{
  "id": 1569,
  "mediaId": 43,
  "date": "1/23/2022 12:00:00 AM",
  "headline": "Why Ann Coulter is 100% right about Trump being finished...",
  "image": "https://images.dailykos.com/images/641409/story_image/GettyImages-477509508.jpg?1549578916",
  "link": "https://www.dailykos.com/story/2022/1/23/2076288/-Why-Ann-Coulter-is-100-right-about-Trump-being-finished",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    922,
    1144,
    1147,
    1237,
    1462,
    1549,
    2095,
    2354,
    428,
    2643
  ],
  "sentences": [
    "Brian Kilmeade said Trump needs to learn how to lose.? A longtime RedState columnist pointed out how ridiculous Trump's endorsements are, as Trump considers endorsing multiple people in races so he can take credit for whomever wins.",
    "Angry white men packed stadiums to hear her hateful diatribes against Muslims and immigrants, while claiming Obama pals around with terrorists.? If Trump was a thing, it was because Palin proved there was a market for such hate.",
    "In June 2015, there was a discussion on Bill Maher's show on who would win the GOP nomination, and Ann Coulter was asked who had the best chance to win the election out of the declared candidates.",
    "Many people are comparing Trump's trajectory to Adolf Hitler, where he made a ridiculous coup attempt, was given essentially a slap on the wrist, and then immediately started to rise to power.",
    "But if you look at the clear trajectory of Donald Trump, some uncomfortable truths about his chances, and finally, what's behind his poll numbers, you come to the same inescapable conclusion.",
    "Palin's speeches attracted less and less attention, until an Iowa speech went so far off the rails that even pundits that loved her admitted she shouldn't speak anymore at Republican events.",
    "Ann Coulter supposes that the reason Trump has such high favorable rating among people who identify as Republicans is because the Republican party is now identified as the party of Trump.",
    "The establishment was furious at for supporting fringe candidates who crashed and burned; and blamed her for costing them the Senate with Angle and O'Donnell's spectacular failures.",
    "Even Palin's people didn't stop the GOP's takeover of the House in 2010, whereas Trump single-handedly cost the GOP both Houses of Congress and the Presidency within two years.",
    "Not to mention the fact that hundreds of Trump's most loyal supporters are the ones who insist on being anti-mask and anti-vaxx, and are being killed BY THE HUNDREDS every day.",
    "Obama's oratory gift was often contrasted with Palin's incoherent screeds on Fox News, which ended up dropping her because of the embarrassment she caused.",
    "So mostly diehard Trumpists are identifying themselves as GOP, while all the other conservatives are identifying as non-party affiliated/independent.",
    "With the exception of non-college educated white men, which is 23% net favorable, there is not one subgroup that goes over 15% net favorable rating.",
    "The GOP can no longer claim their big issues are being pro-police and being fiscally responsible--that went out the window with Trump at the helm.",
    "I remember seeing graphics on news channels that featured the serious? candidates of Jeb, Mitt, Marco, and Scott Walker, but none of Trump.",
    "She wasn't stupid enough to claim that her landslide loss was due to thousands of Republican officials and judges conspiring against her.",
    "Now Ann Coulter has made another bold claim that both sides think is equally ridiculous, and that is her claim that Trump is finished.",
    "He's hoping that the GOP will be there to pay his bills, which the RNC is already doing, and legislators will be there to protect him.",
    "Trump desperately wants to be president again because all of his legal woes will go away as he abuses the DoJ and pardons his cohorts.",
    "She was singularly responsible for Christine O'Donnell's (Delaware) and Sharon Angle's (Nevada) GOP primary Senate victories in 2010.",
    "Senators are calling his lies out finally, including McConnell, Romney, Mike Rounds, Kevin Cramer, John Thune, and Shelley Capito.",
    "He has turned the Republicans into a cult of personality that has spawned into a literal cult who thinks he's the Second Coming.",
    "The problem is that saving Trump from jail and running on election conspiracies from 2020 is not a solid platform for 2024.",
    "When you begin to lose the most racist, hateful people in your party like Ann Coulter, who the hell is going to be left?",
    "Of course, if the choice is between Trump and Biden, I expect a lot of them will hold their nose and vote Trump.",
    "His pick of Hershel Walker and his feud with Brian Kemp will likely cost him Georgia again this year, at least.",
    "When Sarah Palin was selected to be John McCain's running mate in 2008, it was because she was a flame thrower.",
    "I recall seeing car stickers on pickup trucks here in Florida (before flags became vogue) that only said PALIN.",
    "Trump will have his diehard cultists for years, but the rest of the country has moved on from this loser.",
    "That's why he and Roger Stone are telling everyone that if they try to compete, they are disloyal scum.",
    "Yet there is one thing that I have always acknowledged: she has her finger on the pulse of the GOP.",
    "Being a right-wing extremist, Ann doesn't go into the toxicity of the Republican brand in general.",
    "No one thought he would win the nomination, much less the election, including Trump himself.",
    "These numbers don't line up with the narrative that Trump is popular with half the nation.",
    "Yet for everything you can say about Palin, you have to admit Trump is far, far worse.",
    "A more accurate trajectory would probably be a former GOP darling named Sarah Palin.",
    "McCain would admit later that he deeply regretted choosing her as his running mate.",
    "The latest CIVIQs poll shows Trump's approval among all voters at negative 14%.",
    "There was a time I was really worried that Sarah Palin might become president.",
    "Recall at this time, Trump was a joke candidate that very few took seriously.",
    "She completely overshadowed John McCain with her divisive, hateful rhetoric.",
    "She was giving keynote speaking slots at conservative conferences like CPAC.",
    "The fact is that Trump is now primarily associated with the insurrection.",
    "Furthermore, like Trump, Palin was extremely incompetent and unprepared.",
    "After losing the election, she was considered a front-runner for 2012.",
    "Yet if there is a real choice in the GOP primary, Trump is toast.",
    "He has to because the legal walls are closing in all around him.",
    "This comparison is so obvious that Ann Coulter used it as well.",
    "Ann Coulter\nAnn Coulter is an avowed racist and anti-Semite.",
    "Few seem willing to stand up to all his lies and craziness.",
    "Keep in mind it's only been one year since he was in power.",
    "She formed a superPAC, and her endorsements were coveted.",
    "There was a Draft Palin? movement supported by Fox News.",
    "Some establishment figures tried to groom her for a run.",
    "Ann Coulter is not the only one who has turned on Trump.",
    "I don't agree with Ann Coulter on much, but she's right.",
    "Ann Coulter said Donald Trump? to uproarious laughter.",
    "(Remember O'Donnell's ad claiming she wasn't a witch?",
    "All this being said, Trump will definitely run again.",
    "None of that will happen if he isn't the nominee.",
    "Palin graciously conceded when her ticket lost.",
    "Nonetheless, she was the face of the new GOP.",
    "She made the news for all the wrong reasons.",
    "Everyone is sick of him, even conservatives.",
    "Truth be told, this is Ron's best shot.",
    "He's the unofficial leader of the GOP.",
    "We will see if Ron DeSantis caves.",
    "African Americans are minus 85%.",
    "By 2028, he will be a has-been.",
    "He's gotten worse, not better.",
    "He just doesn't know it yet.",
    "Hispanics are minus 44%.",
    "No one fears that now.",
    "Women are minus 24%.",
    "Then it all crashed.",
    "I can't stand her.",
    "Trump is finished.",
    "How can that be?",
    "Good times.)",
    "White men?",
    "14%."
  ]
}