{
  "id": 1571,
  "mediaId": 238,
  "date": "1/22/2022 12:00:00 AM",
  "headline": "The latest GOP idea: A police force to ferret out voter fraud",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/01/22/sundaytake-election-police-gop/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    661,
    661,
    1646,
    1646,
    1147,
    1147,
    428,
    428,
    71,
    71,
    2732,
    2732
  ],
  "sentences": [
    "The language also says that to ensure that election officials are complying with the laws, the unit could conduct proactive information gathering to identify and prevent potential election law violations or irregularities.?\nIn a statement, Mark Ard, the director of external affairs at the Florida Department of State, noted that in addition to individual voter fraud and problems with unsolicited mail-in ballots, the office would deal with many other kinds of violations, from petition-gathering problems to threats of violence against election officials.",
    "He added, We work hard to review all of that now but simply do not have adequate resources or personnel to meet the demand.?\nPerdue's suggestion in Georgia falls short of being a proposal, although it fits with his campaign to undermine the incumbent governor, who drew the wrath of Trump for certifying the election results in 2020 that gave Biden a winning margin of 11,779 votes.",
    "John Malcolm, vice president of the Institute for Constitutional Government at the Heritage Foundation, said the election fraud database is not a comprehensive database,? adding, The purpose of the database is not to be comprehensive; it's to show different ways voter fraud occurs and that it's relatively easy to commit.",
    "A Republican-ordered audit in Arizona, led by an outside firm with no background in dealing with ballots or election machinery, spent months in what turned out to be a fruitless effort to prove that the count in Maricopa County (where Phoenix is the county seat) had been marred by fraud.",
    "The governor simply wants to ensure that Floridians will have a clear, straightforward way to report suspected voter fraud, and that a dedicated team of law enforcement personnel can address it in accordance with the law,? Christina Pushaw, DeSantis's press secretary, said in an email.",
    "Add to that 19 cases catalogued by the conservative Heritage Foundation, which include federal and county prosecutions, and you get a grand total of 174 Together, they represent 0.000185 percent of the total votes cast  or 1 in 540,000 voters.?\nThe pursuit continues.",
    "Under the direction of its chairman, Kris Kobach, a former secretary of state in Kansas, the commission collapsed in controversy and never managed to produce a shred of evidence to buttress Trump's claim or, for that matter, proof of any other substantial fraud.",
    "People have staked their political careers on this [finding widespread fraud], like Kris Kobach, and haven't come up with much,? said Sean Morales Doyle at the Brennan Center for Justice, which has been tracking new laws restricting voting in the states.",
    "The DeSantis proposal has not been approved by the Florida legislature, and whatever Perdue is talking about still hinges on his winning the primary against Kemp and then a general election, possibly against Stacey Abrams.",
    "The conservative Heritage Foundation maintains an election-fraud database that says, dating back several decades, there have been 1,340 proved instances of voter fraud nationally, including 1,152 criminal convictions.",
    "After 15 years of looking for election fraud among the 94 million votes cast in Texas elections since 2005, the Texas Attorney General's Office has dutifully prosecuted 155 people,? the Chronicle editorial said.",
    " You don't find what you don't look for.?\nTrump claimed after his 2016 victory that he would have won the popular vote had it not been for several million votes he said were cast by undocumented immigrants.",
    "DeSantis's office provided background material that noted that the governor does not have law enforcement responsibilities and that the governor would not direct the team to pursue specific allegations.",
    "In Wisconsin, Republicans in the legislature have launched an investigation, led by a retired state Supreme Court justice, that included the idea of hiring several police officers as investigators.",
    "In Florida, there are two entries for 2021 (including the overturning of a 2020 town council election in Eatonville, Fla.), none for 2020 or 2019, six each for 2018 and 2017, and none for 2016.",
    "Proposed legislation says that the unit would field complaints or allegations from government officials or citizens and also have the power to conduct independent investigations.",
    "With Trump continuing to falsely claim there was rampant electoral fraud in 2020 that changed the outcome, Republican followers have taken up the challenge to prove it.",
    "But the idea of an election police force has been put into the political bloodstream, and it won't be surprising to see other Republican politicians try to run with it.",
    "In the name of election integrity, these proposals, and the politicians who push them, are likely to further damage public confidence in the political system.",
    "In the battle over voting rights, an idea is starting to move around in Republican circles: designated police forces designed to hunt down voter fraud.",
    "No one would claim there are no mistakes or irregularities in elections, nor that there are not cases of someone deliberately violating election laws.",
    "The money would pay for 52 staffers, including 20 sworn law enforcement officers and 25 non-sworn investigators, with field offices around the state.",
    "A 2018 congressional election in North Carolina was invalidated and a new election called because of absentee ballot fraud by Republican operatives.",
    "Ken Paxton, the current attorney general, followed that by increasing the staff and reportedly devoted 22,000 staff hours in pursuit of voter fraud.",
    "In Georgia, former U.S. senator David Perdue, who is running as a Trumpian candidate in the GOP primary for governor against incumbent Gov.",
    "Others see them as simply trying to curry favor with a Republican base that has bought into the falsehoods about a stolen election.",
    "(Trump would later call Georgia Secretary of State Brad Raffensperger and urge him to find? 11,780 votes to change the outcome.",
    "The team would go after election crimes and irregularities? and have the power to refer findings to a statewide prosecutor.",
    "But the overwhelming evidence has shown these cases to be relatively rare when matched against the number of ballots cast.",
    "Gregg Abbott (R) had claimed, when he was state attorney general, there was an epidemic? of voter fraud in the state.",
    "The unit would be housed in the office of the Florida secretary of state, where the incumbent is Laurel M. Lee.",
    "It is another example of what comes from former president Donald Trump's false claims about the 2020 election.",
    "That has not prevented claims of more-serious fraud and efforts to find and prosecute alleged violators.",
    "A story that included audio of the call was published by The Washington Post's Amy Gardner.)",
    "Brian Kemp (R), says he wants something like it to assure that only legal votes are counted.",
    "DeSantis's new budget calls for $5.7 million for his Office of Election Crimes and Security.",
    "Some see voter intimidation as a rationale for these aggressive pursuits of election fraud.",
    "The secretary of state in Florida is appointed by the governor, not elected independently.",
    "The Houston Chronicle published an editorial earlier this year noting that Texas Gov.",
    "Sometimes, too, the fraud is serious enough to affect the outcome of an election.",
    "When identified, those cases are prosecuted, sometimes resulting in convictions.",
    "On the basis of available evidence, this is a solution in search of a problem.",
    "Ron DeSantis (R) has put a proposal for such a force in his new budget.",
    "More than 14 months after the election, it has yet to produce findings.",
    "For 2018, there is one entry, and for 2017 there are three entries.",
    "In Georgia, the database shows no entries for 2021, 2020 or 2019.",
    " My point is that you don't know the true extent of voter fraud.",
    "He formed a commission to investigate and study the issue.",
    "What it found was that the original count was accurate.",
    "That inquiry, too, has been marred by controversy.",
    "The database includes state-by-state listings.",
    "He set up a unit to pursue cases.",
    "Florida Gov."
  ]
}