{
  "id": 1574,
  "mediaId": 409,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "New Poll Shows the Challenge and Opportunity of a Primary of Marjorie Taylor Greene",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/05/Marjorie-Taylor-Greene-2.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/new-poll-shows-the-challenge-and-opportunity-of-a-primary-of-marjorie-taylor-greene/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan McLaughlin",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    146,
    146,
    488,
    488
  ],
  "sentences": [
    "The push questions ask about a number of Greene-specific criticisms such as crazy statements (9/11 and Parkland trutherism, antisemitic remarks, embrace of Louis Farrakhan and the Nation of Islam) as well as things like getting kicked off committees, preferring publicity to doing her job, hanging out with scandal-clouded Matt Gaetz, and bashing vaccines while holding stock in Big Pharma companies.",
    "Also, the sample of this poll was 47 percent people with a bachelor's or graduate degree, 18 percent with an associate's degree, and 44 percent people with an income of $75,000 or more; that may be more educated and upscale a sample than the actual turnout, given the demographics of the 14th district.",
    "The final numbers should not be confused with the results of a straight opinion poll, but these kinds of polls serve a distinct and legitimate purpose: They are commonly used by campaigns early in a race to test how many voters are open to persuasion and what kinds of messages they respond to.",
    "That challenge is an uphill battle: Greene has a ton of money from donors outside the district, she gets gobs of free publicity, and the Democrats, eager to prop up Greene as an embarrassment to statewide and national Republicans, are suing to challenge the redrawing of her district.",
    "The poll questions show that Greene leads Strahan 60 percent to 30 percent among the 450 potential Republican voters surveyed (with 10 percent undecided), which is matched by a 60 percent favorable to 28 percent unfavorable rating for Greene among the people polled.",
    "The poll was conducted by TargetPoint, a Republican pollster, and it is a classic push poll designed to test messages: Voters were asked for their opinion of the candidates, then asked to respond to a series of anti-Greene messages, then asked their views again.",
    "But the poll's first round also has some hidden bad news for Trump: by 48 percent to 29 percent, Republican primary voters in the new 14th District prefer incumbent governor Brian Kemp to his Trump-backed primary challenger, former senator David Perdue.",
    "With a redrawn district that subtracted some of her most faithful supporters in her 2020 primary race and added hostile suburban territory in return, freshman congresswoman Marjorie Taylor Greene faces a serious primary challenge from Jennifer Strahan.",
    "There has not been independent public polling of the district yet, but a new poll commissioned by anti-Greene forces  which was not commissioned by the Strahan campaign  shows how Strahan's message could draw her even with Greene.",
    "Still, retiring Greene from Congress is a worthwhile endeavor, and pushing her volatile personality into a competitive race also increases the odds that she says or does something else that alienates voters.",
    "It suggests that her statements are the attack line most likely to move votes away from her, which may be a surprise to political obsessives who just assume that everybody knows this stuff already.",
    "Voters in the initial sample who said they were going to vote in the Democratic primary were unanimous in saying that they would consider voting in the Republican one instead just to stop Greene.",
    "When walked through the whole litany, voters viewed the race as a dead heat: 41 percent supporting each candidate, or a 45-44 Greene lead when including people leaning one way or the other.",
    "Greene has a locked-in base of 35 percent of the respondents, while 16 percent said they would never vote for her (only 7 percent said the same about Strahan, presumably Greene partisans).",
    "Strahan will need more donations if she is going to get her message out, and even the final result of the push poll shows that this will be a tight race even if she does.",
    "If Perdue can't beat Kemp in Greene's district even with a majority of voters who view Trump and Greene favorably, his prospects will be grim statewide.",
    "But the May 24 primary is still four months away (with a runoff on June 21 if nobody breaks 50 percent), and voters are just beginning to tune in.",
    "Donald Trump's favorability among these voters is significantly higher than Greene's, 74 percent approval and only 19 percent disapproval.",
    "Strahan will not make inroads with them by attacking Trump or Trump's style of politics, and she is campaigning as a Trump supporter.",
    "With Georgia's open primary, Strahan will need to attract some crossovers.",
    "First, the bad news: Greene starts off in a strong position.",
    "And it will matter who turns out."
  ]
}