{
  "id": 1579,
  "mediaId": 129,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "Republicans Want New Tool in Elusive Search for Voter Fraud: Election Police",
  "image": "https://static01.nyt.com/images/2022/01/20/us/20vote-police-2/merlin_181164819_6d650648-48d3-4516-8f6e-19c3e421f291-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/20/us/election-police-georgia-florida.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1646,
    2095,
    428,
    2550,
    2661,
    2777,
    2959
  ],
  "sentences": [
    "Sweeping election-law revisions enacted by Florida and Georgia legislators last spring sharply limit the use of popular drop boxes for submitting absentee ballots, require identification to obtain mail-in ballots, make it harder to conduct voter-registration drives, and restrict or ban interactions  such as handing out snacks or water  with voters waiting in line to cast ballots.",
    "WASHINGTON  Reprising the rigged-election belief that has become a mantra among their supporters, Republican politicians in at least three states are proposing to establish police forces to hunt exclusively for voter fraud and other election crimes, a category of offenses that experts say is tiny at best.",
    "That was followed on Thursday by a pledge by David Perdue, the former Georgia senator who is a Republican candidate for governor, to create his own force of election police to make Georgia elections the safest and securest in the country.? Mr. Perdue, who lost his Senate seat in 2020, claimed that Gov.",
    "And in Arizona, a vocal supporter of former President Donald J. Trump's lies about a stolen election, State Senator Wendy Rogers, has filed legislation to establish a $5 million bureau of elections? in the governor's office with the power to subpoena witnesses and impound election equipment.",
    "The first person that gets caught, no one is going to want to do it again after that.?\nNone of the three states  and for that matter, none of the other 47 and the District of Columbia  reported any more than a minuscule number of election fraud cases after the 2020 races.",
    "They are being condemned by voting rights advocates and even some local election supervisors, who call them costly and unnecessary appeasement of the Republican base that will select primary-election winners for this November's midterms and the 2024 presidential race.",
    "This is more pablum to the people who believe in fraud and conspiracy theories and lies that the last election was stolen.?\nNeither the new laws nor election autopsies appear to have shaken the conviction of many Trump supporters that the election system is suspect.",
    "Mr. DeSantis said after the 2020 vote that his was the state that did it right and that other states should emulate.? The only notable hint of irregularity in Florida was the recent arrest on fraud charges of four men in a retirement complex north of Orlando.",
    "In Georgia, Secretary of State Brad Raffensperger already oversees 23 investigators whose purview includes election irregularities, and an assistant state attorney general exclusively prosecutes crimes in elections, the judiciary and local governments.",
    "Ms. Rogers's bill probably faces an uphill road in the Legislature, where Republicans are only narrowly in control and have been battered for their support of a widely ridiculed multimillion-dollar inquiry into 2020 election results.",
    "Mr. Trump comfortably won Florida by about 370,000 votes in 2020, and his narrow losses in Arizona and Georgia were confirmed by expert audits, recounts and even the notorious Cyber Ninjas inquiry into the vote in Maricopa County.",
    "Bids to curb so-called fraud are becoming standard for Republican candidates who want to win over voters, Barry Burden, the director of the Elections Research Center at the University of Wisconsin-Madison, said in an interview.",
    "The proposals are the latest twist in a decades-long crusade by Republicans against election fraud that has grown rapidly since Mr. Trump's election loss in 2020 and his false claim that victory was stolen from him.",
    "The Arizona attorney general manages a relatively new election integrity? investigative unit, and Florida election violations are prosecuted by both state and local authorities, as is true in most states.",
    "Supporters say the added enforcement will root out instances of fraud and assure the public that everything possible is being done to make sure that American elections are accurate and legitimate.",
    "But Mr. DeSantis and Mr. Perdue say their strike forces are still needed to root out other election irregularities and to bolster their constituents' sagging faith in the honesty of the vote.",
    "Brian Kemp, a Republican who is seeking re-election, weakened election standards and refused to investigate claims of fraud following President Biden's narrow win in the state.",
    "We don't need further investigations into elections that are freely and fairly conducted,? said Alex Gulotta, the Arizona director of the advocacy group All Voting Is Local.",
    "And Democrats say the main reason Republican voters have lost faith in the electoral system is because of the incessant Republican focus on almost entirely imagined fraud.",
    "Ron DeSantis asked the State Legislature last week for $5.7 million to create a 52-person election crimes and security? force in the secretary of state's office.",
    "It is a reminder that while the Democratic agenda in Washington seems dead, Republican state-level efforts to make voting harder show no sign of slowing down.",
    "Mr. DeSantis took a tough line in November when he unveiled his proposal, saying that the new unit would chase crimes that local election official shrug at.",
    "The same rationale has powered so-called audits of election results and clampdowns on election rules by Republican-run legislatures across the country.",
    "Critics say the efforts can easily be abused and used as political cudgels or efforts to intimidate people from registering and voting.",
    "The next round of voting clashes comes after the apparent demise of Democratic voting rights legislation in Washington on Thursday.",
    "At least two of them appeared to be winter Floridians accused of casting ballots both there and in more frigid states to the north.",
    "The plan, which Mr. DeSantis has been touting since the fall, would include 20 sworn police officers and field offices statewide.",
    "If you call into the election office, a lot of times they don't do anything,? he said at an appearance in West Palm Beach.",
    "Whoever is the nominee in 2024, whether it's Trump or anyone else, it will likely be part of their platform,? Mr.",
    "Some scholars say they see the police forces as the latest bid by politicians to scratch that itch.",
    "The idea of an election police force is not new, even in the states where they are being proposed.",
    "The plans are part of a new wave of initiatives that Republicans say are directed at voter fraud.",
    "There'll be people, if you see someone ballot harvesting, you know, what do you do?",
    "Prospects for the Florida and Georgia proposals are less clear.",
    "The most concrete proposal is in Florida, where Gov.",
    "We've established that again and again and again.",
    "I guarantee you this,? he added.",
    "Burden said."
  ]
}