{
  "id": 1583,
  "mediaId": 195,
  "date": "1/20/2022 12:00:00 AM",
  "headline": "Perdue proposes election police force in Georgia",
  "image": "https://cdn.jwplayer.com/v2/media/yUHp0NNH/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/590549-perdue-proposes-election-police-force-in-georgia",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson -",
  "authorUrl": "",
  "termIds": [
    1147,
    1303,
    1438,
    1646,
    1951,
    2095,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Then, when Georgians had legitimate questions about the November election, Kemp refused to investigate or fix problems before the January runoff.?\nPerdue said the purpose of the new law enforcement unit is to give Georgians confidence that only legal votes will be counted, and that anyone who tries to interfere with our elections will be arrested and prosecuted.?\nPerdue also said election results should be independently audited? to safeguard our election integrity and ensure transparency and accountability in our system.?\nSince losing his seat in the Senate, Perdue, 72, has increasingly embraced the unfounded allegations of fraud or mismanagement that Trump has used to question the legitimacy of the 2020 elections.",
    "Former Georgia Sen. David Perdue (R-Ga.), who is challenging the sitting Republican governor after he lost his own reelection bid, has called for a new law enforcement organization dedicated exclusively to investigating election law violations after continued unfounded and unsupported allegations of improprieties in the 2020 elections.",
    "He blamed Kemp and Secretary of State Brad Raffensperger (R) for his own loss in Georgia; he has since endorsed both Perdue and Rep. Jody Hice (R), another Republican who has spouted election denialism and who is now challenging Raffensperger.",
    "Perdue said Thursday he would propose a new division meant to enforce election laws and arrest those who commit fraud or crimes related to elections, functions that are already performed by divisions of Georgia's government.",
    "Perdue, who backed Kemp four years ago, has turned on the sitting governor after Democrats Ossoff and Sen. Raphael Warnock (D) swept runoff elections a year ago, handing their party control of the Senate.",
    "Three separate counts, including a mandatory hand recount and a count requested by Trump's campaign, affirmed that President Biden became the first Democrat to win the state since Bill Clinton in 1992.",
    "And Georgia's election results are already independently audited by the Secretary of State's office, which is responsible for ensuring county elections departments conducted accurate counts.",
    "Georgia's Attorney General's office has an assistant attorney general position dedicated to overseeing the prosecution of laws relating to elections, local government and the judiciary.",
    "In a statement Thursday, Perdue referenced a 2018 consent decree that governed how absentee ballots are counted in the event that a voter's date of birth is incorrect or missing.",
    "Attorney General Chris Carr (R) has announced no significant investigations into or prosecutions of alleged elections crimes related to the 2020 contests.",
    "He launched his campaign by blaming Kemp for the results of an election he lost, after Trump spent months undermining confidence in the Georgia vote.",
    "Brian Kemp (R), a former ally who acknowledged the fact that both Perdue and former President Trump lost their election bids in Georgia in 2020.",
    "Trump, who clings to incorrect, unsupported and demonstrably false allegations of election fraud, backed Kemp in the 2018 Republican primary.",
    "Brian Kemp caved to Stacey Abrams before the November election and weakened our elections standards.",
    "Perdue's new proposals duplicate government functions that already exist.",
    "What happened in 2020 should never happen again,? Perdue said.",
    "Perdue is running against Gov."
  ]
}