{
  "id": 1588,
  "mediaId": 43,
  "date": "1/20/2022 12:00:00 AM",
  "headline": "Georgia Republicans make mockery of democracy after new voter suppression law",
  "image": "https://m104216-ucdn.mp.lura.live/iupl_lin/F47/AD5/F47AD55047ADCEF4A47BE71836F4DB64.jpg?Expires=1642724804&KeyName=mcpkey1&Signature=3bIlDap5YYtXqAoM8VuiiS0Ypzk",
  "link": "https://www.dailykos.com/story/2022/1/20/2075745/-Georgia-Republicans-want-one-polling-site-in-county-that-currently-has-seven",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    808,
    1350,
    2095,
    428,
    502,
    571,
    2555,
    2617,
    2672,
    2758
  ],
  "sentences": [
    "It's about a political party using its power to create advantages wherever they can, and in the process weakening our state's institutions of democracy.?\nRELATED: 'Yes, this is voter suppression': Georgia journalist feels effects of butchered voting rights bill\nRELATED: Georgia GOP 'hijacked' bill with nearly 100 pages of voting restrictions, and now it's law\nRELATED: Georgia's third-largest county to slash voting precincts by more than half ahead of runoff\nRELATED: McConnell admits he doesn't think Black people are American as voting rights dies in the Senate\nThis is a short blurb about Daily Kos.",
    "CONNECTING...\nClosed Caption Settings\nFont:\nArialCourierGeorgiaLucida SansTahomaTimes New RomanVerdana12px16px20px24px28px32px36px40px44px\nText color:\n0%25%50%75%100%\nOpacity:\nBackground:\n0%25%50%75%100%\nOpacity:\nAdvanced \nText Edge:\nNoneDrop ShadowRaisedDepressedUniform\nHighlight:\n0%25%50%75%100%\nOpacity:\nScale on resize\nCapitalize\nVideo override\nCaptions will look like this\nShare\nEmail:\nSend\nCopy Link\nCopy Embed\nShare from the beginningOKCancel\nThere are no captions for this video\nLearn More\nHTML5\nEnglish\nSettings\nOff\n00:00 / 00:00\n?\n Live\nYour video will be available shortly.",
    "This is about the good old boys wanting to do what they've always done, which is power and control.?\nx\nx\nLincoln County Elections Board postpones vote on plans to close all but one polling place\nThe proposal was on the agenda for a vote Wednesday night -- but after many residents voiced opposition election board leaders adjourned the meeting.",
    "Fast-forward a year later after the voter suppression law was passed, and journalist Rickey Bevington, who anchors NPR's All Things Considered on Georgia Public Broadcasting, was tweeting this experience on the day of Atlanta's mayoral election, Nov. 3, 2021: \"Today I'm experiencing Georgia's new voting restrictions.",
    "The legislation started as a two-page proposal to make sure eligible voters didn't repeatedly receive absentee ballot applications, but it was expanded into a nearly 100-page legislative document on March 17, 2021 and rushed through the state legislature just before the end of the session.",
    "While these closures are likely to adversely affect many Cobb County voters, we are especially concerned that these closures will be harmful to Cobb County's Black and Latinx voters because many of the locations are in Black and Latinx communities,? the organizations said in the letter.",
    "The Georgia NAACP, the NAACP Legal Defense Fund, and four other nonprofit and advocacy organizations sent a letter to both elected and county elections officials in Cobb County informing them that the planned closure could potentially suppress the Black and Latino vote in the county.",
    "Brian Kemp signed into law last March, requires drop boxes to be held inside early voting sites, attaches a voter ID requirement to mail-in ballots, and in a damning blow to voting rights, gives the majority Republican Legislature more authority over local elections officials.",
    "\"What's happening in Georgia with the dismantling of these county election boards is an extreme example of the national trend in Republican-controlled states to undermine local election officials,\" Jonathan Diaz, an attorney with the nonprofit Campaign Legal Center, told CNN.",
    "With that control, Republican Sen. Lee Anderson, who represents a district that includes Lincoln County, sponsored Senate Bills 282 and 283, giving Republicans the power to disband the Lincoln County Board of Elections and appoint a new board in its place.",
    "https://t.co/tE2PVbDmy2 https://t.co/j6aYiqBMkP\n Anthony Michael Kreis (@AnthonyMKreis) January 19, 2022\nThe fifth seat on the board has been vacant ever since the state's new voting law removed Secretary of State Brad Raffensperger from the board.",
    "Just ahead of early voting for the 2021 Senate runoff in Georgia in which two Republican senators were unseated by Democrats, officials decided to cut the number of voting precincts by more than half in the state's third-largest county, Cobb.",
    "An election board in a rural Georgia county held a meeting on Wednesday intended to slash the number of polling locations in the county from seven to one, in effect suppressing the vote in a county with limited transportation options.",
    "Cobb Elections Director Janine Eveler said during a county legislative delegation meeting that her department has struggled to staff polling sites during the winter holiday of 2020, according to The Atlanta Journal-Constitution.",
    "https://t.co/Q6B3pryVJv\n Adam Harrell (@adamdharrell) January 20, 2022\nAdam Harrell, cofounder of a marketing agency in Atlanta, tweeted a spot-on analysis of exactly what is at stake with Johnston on the State Elections Board.",
    "\"These concerns can be easily addressed and our organizations stand ready to provide you with any assistance you require, including help recruiting and training poll workers or poll managers,\" activists said in their letter.",
    "Aunna Dennis, executive director for the nonprofit Common Cause Georgia, told the Chronicle the effort in Lincoln County is an extension of Senate Bill 202, now a law that critics argue directly targets people of color.",
    "Thanks to Senate Bill 202, that board now has the power to replace the Fulton election board with an administrator, and the county is already under a performance review, The Atlanta Journal-Constitution reported.",
    "Johnston, a retired obstetrician, has supported the former president's claims, speaking of \"falsified tally sheets\" during an election audit in Fulton County, The Atlanta Journal-Constitution reported.",
    "Grateful to have time & a car\"\nA year after that, a critic of elections in the state's most populous county, Fulton, was nominated by the Georgia Republican Party to the State Election Board.",
    "x\nJanice Johnston repeatedly lied about election fraud in Fulton County and now will get a vote to decide whether the local election board will be replaced with a hand-picked administrator.",
    "Voting rights activists demonstrated at the meeting and voiced their opposition, ending in board members deciding to adjourn the meeting, according to ABC-affiliated WJBF.",
    "Lincoln County is one of six counties in Georgia that have dissolved or restructured their local election boards in the year Senate Bill 202 passed, CNN reported.",
    "I think there are bad actors who are wanting to pilot precinct consolidations and takeovers of elections boards in smaller counties,? Dennis told the newspaper.",
    "Some people live as far as 23 miles from the city of Lincolnton,? Denise Freeman, a former Lincoln County school board member, told The Augusta Chronicle.",
    "At least 19 states passed 34 laws to restrict voting rights between Jan. 1, 2021 and Dec. 7, 2021, according to the Brennan Center for Justice.",
    "Raffensperger has repeatedly defended Georgia elections against unsubstantiated claims of fraud by former President Donald Trump.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The county's population of some 7,690 residents is less than 30% Black and 68.3% white, according to census data.",
    "That board likely would have greenlit a consolidation? plan in the county, the Chronicle reported.",
    "Appoint Janice Johnston to the five-seat State Election Board effective as of Wednesday.",
    "Yet federal protections to ban such restrictions couldn't make it out of the Senate.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Since I work until 7pm, I must go to the precinct now or my vote won't count.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "People vote in Georgia's primary election on June 9, 2020 in Atlanta.",
    "This stuff isn't about election procedures,? he said in the tweet.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Voting rights & the integrity of elections go hand in hand.",
    "We just could only staff the five locations,? Eveler said.",
    "I'm barred from casting a provisional ballot before 5pm.",
    "I accidentally went to the wrong voting precinct.",
    "So local voting rights workers offered to help.",
    "This is not about convenience for the citizens.",
    "The bill, which Georgia's Republican Gov.",
    "Lincoln County is a very rural county.",
    "The polling sites were slashed anyway.",
    "x\nWhat a dumpster fire this is.",
    "So what does the governor do?",
    "It's not about appointments.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "This is about control.",
    "Larger ones too.",
    "Please read it."
  ]
}