{
  "id": 1589,
  "mediaId": 19,
  "date": "1/20/2022 12:00:00 AM",
  "headline": "David Perdue to Propose Election Law Enforcement Division' if Elected Georgia Governor",
  "image": "https://media.breitbart.com/media/2021/02/GettyImages-1230182295-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/01/20/david-perdue-to-propose-election-law-enforcement-division-if-elected-georgia-governor/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1951,
    1951,
    2095,
    2095,
    661,
    661,
    1646,
    1646,
    2555,
    2555,
    2672,
    2672,
    2661,
    2661
  ],
  "sentences": [
    "When I'm Governor, we'll have the safest and securest elections in the country.?\nPerdue, who has been endorsed by former President Donald Trump, launched a campaign to beat Democrat gubernatorial candidate Stacey Abrams, the well-funded voting rights activist who narrowly lost her first bid for governor in 2018 against now-Gov.",
    "He failed us, and Georgians lost confidence that their vote would count.?\nKemp has been criticized specifically for not calling a special session after the November 2020 election but before the subsequent January 5 runoffs so that the state legislature could choose its own separate set of electoral college electors.",
    "By proposing this unit, Perdue is finally admitting what state law and the Georgia constitution have made abundantly clear: the Governor has no legal authority regarding the oversight, investigation, or administration of elections in our state,? Hall said in a statement provided to Breitbart News.",
    "Trump has repeatedly attacked Kemp over the 2020 election process after President Joe Biden narrowly defeated Trump in Georgia by about 12,000 votes, or about 0.2 percent of the vote, and the former president was quick to endorse Perdue when he launched his campaign against Kemp in December.",
    "Brian Kemp caved to Stacey Abrams before the November election and weakened our elections standards.?\nThen, when Georgians had legitimate questions about the November election, Kemp refused to investigate or fix problems before the January runoff,? Perdue continued.",
    "Secretary of State Brad Raffensperger was the one involved in signing the decree, which served as a settlement between the Georgia Democrat Party and Raffensperger and elaborated on the state's preexisting process of signature verification on absentee ballots.",
    "The purpose of this law enforcement unit is to give Georgians confidence that only legal votes will be counted, and that anyone who tries to interfere with our elections will be arrested and prosecuted,? Perdue said in a statement about the new plan.",
    "In response to Perdue's criticism and his new Election Law Enforcement Division, Kemp spokesman Cody Hall accused Perdue of lying and highlighted the Election Integrity Act, the high-profile election overhaul bill Kemp signed into law last year.",
    "He caved to Stacey Abrams before the 2020 Election and allowed massive Election Fraud to take place.?\nIn launching his Election Law Enforcement Division, Perdue also criticized Kemp, saying, What happened in 2020 should never happen again.",
    "The Florida governor's plan involves establishing an Office of Election Crimes and Security as an arm of the Florida State Department, though the plan is in its early stages as state lawmakers mull over the logistics of it.",
    "Kemp argued at the time that the move would have been unconstitutional and immediately enjoined by the courts.? Kemp has also been criticized for a consent decree signed in March 2020 ahead of the November election.",
    "A similar process occurred in November 2020 in the state's first risk limiting audit,? which involved hand counting the nearly five million ballots cast in the presidential election.",
    "The proposal entails creating a law enforcement unit that would be responsible for investigating and, when necessary, arresting individuals caught violating Georgia election law.",
    "Former Sen. David Perdue (R-GA) introduced a plan on Thursday to create an Election Law Enforcement Division in Georgia should he be elected as the state's next governor.",
    "Perdue on Thursday also called for Georgia's election results to be independently audited? and include audit benchmark goals prior to their certification.",
    "In addition to targeting Abrams, Perdue is also taking aim at Kemp in what is expected to become a heated primary battle ahead of the general election.",
    "While Perdue was golfing for the last year, Governor Kemp was fighting the woke mob to champion the strongest election integrity law in the nation.?",
    "When he announced his endorsement, Trump said Perdue is the only candidate in Georgia who can beat Stacey The Hoax' Abrams in November.",
    "This is a commonsense step to safeguard our election integrity and ensure transparency and accountability in our system,? Perdue said.",
    "Leave it to a 20-year career politician like Kemp to sit on his hands when we needed him most.",
    "David Perdue is repeatedly lying to the people of Georgia  without facts or evidence.",
    "The proposal falls in line with one made last week by Florida Gov.",
    "Brian Kemp has failed Georgia.",
    "Ron DeSantis (R).",
    "Brian Kemp (R)."
  ]
}