{
  "id": 1604,
  "mediaId": 223,
  "date": "1/16/2022 12:00:00 AM",
  "headline": "Is It Possible Not Even Stacey Abrams Wants to Associate with Joe Biden?",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/337/66f129f8-75ec-4ce2-bffc-ab75b54024ba.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/01/16/is-it-possible-not-even-stacey-abrams-wants-to-associate-with-joe-biden-n2601929",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    2461,
    2461,
    2095,
    2095,
    2087,
    2087,
    1951,
    1951,
    1676,
    1676,
    1216,
    1216,
    55,
    55,
    2555,
    2555,
    2672,
    2672,
    2953,
    2953
  ],
  "sentences": [
    "How toxic does Biden have to be for Stacey Abrams to be like ah sorry I have other plans? for an event about her *signature issue* https://t.co/yfq02U5j9Q\n Matt Whitlock (@mattdizwhitlock) January 11, 2022\nMax Greenwood and Julia Manchester in a piece published Sunday for The Hill noted that an Abrams spokesperson has denied it's because of an issue between the president and Abrams.",
    "It's a disservice to voters across the country and a waste of time and energy amid the fight of our lives for the freedom to vote that unnamed aides would spread false rumors rather than help build momentum for this once-in-a generation opportunity to lead,? Bringman said in a statement to The Atlanta Journal-Constitution.",
    "Biden told reporters this week that he and Abrams have a great relationship? and simply got our scheduling mixed up.?\nSeth Bringman, a spokesperson for Abrams's campaign, slammed false? narratives about her absence from Biden's speech, including the notion that she skipped the event because she was denied a speaking slot.",
    "They also spoke to others, though, including Georgia Democrats, about the president's perception:\nThere's a risk of reading too far into it, but any candidate has to be aware that they're going to be judged, at least a little bit, by what the president is doing  by the job he's doing,? one Georgia Democrat said.",
    "Glenn Youngkin (R-VA)--who defeated McAuliffe last November and was inaugurated on Saturday--of engaging in election denial but he himself denied the results of the 2000 presidential election and promoted Abrams' own version of the 2018 'Big Lie.'",
    "The Babylon Bee particularly had some fun with that hope of hers, writing on May 21, 2020 that \"Stacey Abrams Says She Will Step Down As Governor If Asked To Run For VP\" and on August 11, 2020 that \"Stacey Abrams Graciously Accepts VP Nomination.\"",
    "Source: AP Photo/Brynn Anderson, File\nWe're potentially looking at a very different relationship between Stacey Abrams and President Joe Biden than we had seen in 2020, when she was hoping to be his running mate.",
    "That Georgia Democrat quoted above has got a point to note that \"any candidate has to be aware that they're going to be judged, at least a little bit, by what the president is doing  by the job he's doing.\"",
    "McAuliffe served a term after being elected governor in 2013, but couldn't run in 2017 since the state constitution prohibits governors from running for back-to-back terms.",
    "She announced last December that she was running again, and in her media interviews in the following days misled and tried to rewrite history on that lack of a concession.",
    "Kemp has earned three primary challengers so far, including the Trump-endorsed David Perdue, who narrowly lost his Senate seat to Jon Ossoff, a Democrat, last January.",
    "In Georgia, Civiqs indicates, Biden has an approval rating of 30 percent and a disapproval rating of 59 percent, which places it among Biden's worse states.",
    "While McAuliffe himself acknowledged in October that Biden is \"unpopular\" in Virginia, he still had Biden come to Virginia to campaign with him, twice.",
    "Such a point about Biden is true, with a Monmouth Poll from October showing Biden at a 45 percent approval rating, while 48 percent disapproved.",
    "Should Abrams--who is currently unopposed and is likely to remain so--secure the nomination, time will tell if she heeds warnings of the past.",
    "Last Tuesday, though, when Biden made his fiery and divisive speech about so-called voting rights, in Atlanta, Abrams was noticeably absent.",
    "Abrams ran for governor in 2018 and lost to Georgia's current governor, Brian Kemp, a Republican, though she never conceded.",
    "McAuliffe brought to Virginia a myriad of Democrats, many of them from out-of-state, including Abrams, to campaign for him.",
    "Terry McAuliffe (D-VA) did, whom she ironically campaigned as he sought to be elected once more as Virginia's governor.",
    "That she was not going to appear with the president and vice president was announced prior, leading to speculation.",
    "Both Abrams and Biden have pushed back aggressively on any conjecture that their relationship is fraying.",
    "Eighteen percent say they disapprove while another 18 percent say they neither approve nor disapprove.",
    "Civiqs currently has Biden at a 34 percent approval rating in Virginia, while 55 percent disapprove.",
    "When it comes to Black voters, according to Civiqs, Biden has just a 63 percent approval rating.",
    "I think it's more that Stacey is running her own campaign and setting her own priorities.?\n...",
    "Abrams may very likely be trying to learn the lesson that former Gov.",
    "Georgia's primary election for both parties is May 24.",
    "Not only did McAuliffe falsely accuse now Gov.",
    "While Abrams may very well run unopposed, Gov.",
    "Still can't get over this."
  ]
}