{
  "id": 1607,
  "mediaId": 43,
  "date": "1/15/2022 12:00:00 AM",
  "headline": "When Your Worldview is too Big, The World Seems Overwhelming: Saturday's GNR",
  "image": "https://images.dailykos.com/images/1020185/story_image/snow-drops.jpg?1640379390",
  "link": "https://www.dailykos.com/story/2022/1/15/2073970/-When-Your-Worldview-is-too-Big-The-World-Seems-Overwhelming-Saturday-s-GNR",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    2419,
    2419,
    1951,
    1951,
    886,
    886,
    1155,
    1155,
    481,
    481,
    281,
    281,
    428,
    428,
    376,
    376,
    2661,
    2661
  ],
  "sentences": [
    "In North Carolina today, eleven voters filed a challenge with the State Board of Elections to Madison Cawthorn as a candidate for reelection on the grounds that he is disqualified by the third section of the Fourteenth Amendment, which prohibits from holding office anyone who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any state legislature, or as an executive or judicial officer of any state, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nNorth Carolina law says [t]he burden of proof shall be upon the candidate, who must show by a preponderance of the evidence of the record as a whole that he or she is qualified to be a candidate for the office.?\nIn late December 2021, Cawthorn told supporters to call your congressman and feel freeyou can lightly threaten them.",
    "#CongratulationsJoe pic.twitter.com/YcV1yQEpXj\n BigBlueWaveUSA 2022 #StopVoterSuppression (@BigBlueWaveUSA) January 14, 2022\nx\nCongratulations Joe Biden on:\n-COVID-19 vaccines + booster\n-creating millions of jobs\n-reducing the unemployment rate\n-reducing taxes\n-making America respectable again\n-reducing hate crimes\n-uniting Americans\n-fighting gun violence\n-infrastructure\n-ending Afghan war\n gggSerena Democrat Patriot ggg (@USPatriotSerena) January 14, 2022\n$27 billion in new money aimed at fixing the nation's aging bridges\nThe Biden administration urged states on Friday to get to work bringing thousands of aging bridges up to par, while improving safety and uncorking bottlenecks, with the help of $27.5 billion in new federal aid.",
    "Democrats are doing great things\nx\nCongratulations Joe gg\n-Added 6.4 million jobs\n-Historic GDP growth\n-Unempoyment down to 4.2%\n-Stock Market all-time highs\n-Passed American Rescue Plan\n-Cut child poverty\n-Largest vaccine rollout in history\n-Ended our longest war\n-$1.2 T infrastructure\n-Reunited 100 families pic.twitter.com/SHJDXpVlGH\n Critter (@asclepiasyriaca) January 14, 2022\nx\nCongratulations Joe on the most successful 1st year of a Presidency in US history especially on creating more jobs than any President in over 40 years.",
    "The former president then issued a rambling statement asking: Is he crazy or just stupid??\nRounds retorted that the party must focus on what lies ahead, not what's in the past.? Senator MItt Romney (R-UT) jumped aboard, tweeting that Rounds speaks truth knowing that our Republic depends upon it.? Alaska Senator Lisa Murkowski actually made fun of Trump on Friday with a local political news outlet, mocking his endorsement of the Alaska governor's reelection only if the governor did not endorse Murkowski.",
    "In days after January 6, McCarthy said Trump admitted bearing some responsibility for Capitol attack\nHouse Minority Leader Kevin McCarthy said publicly and privately in the days following the deadly riots at the US Capitol that President Donald Trump admitted personally bearing some responsibility for the attack -- one of several reasons why the select committee on January 6 wants to hear from the House's top Republican.",
    "Ohio Supreme Court rejects GOP-drawn congressional map as unfairly partisan\nThe Ohio Supreme Court on Friday rejected a new congressional map drawn by state Republican lawmakers as unconstitutional and ordered it redrawn, marking a major victory for Democrats in a state where lopsided districts have confounded their efforts to gain seats in the House.",
    "But the questions in these three cases mirror those being discussed by the House Select Committee to Investigate the January 6th Attack on the U.S. Capitol, and touch on whether the former president committed a crime by inciting insurrection or by standing back while the rioters stopped the official proceedings of Congress (which itself is a crime).",
    "With Hard Work, We Can Win In November\nAbrams voting rights group has banked $19.5 million heading into 2022 election year\nThe voting rights group Stacey Abrams founded after losing the 2018 gubernatorial election to Brian Kemp reported this week that it ended 2021 with $19.5 million in the bank as she prepares to seek a rematch with the governor.",
    " Kyle Griffin (@kylegriffin1) January 12, 2022\nMichelle Obama and coalition vow to register more than a million new voters\nFormer first lady Michelle Obama said in a letter on Sunday that a coalition of voting rights organizations would register more than a million new voters across the country in the run-up to this year's midterm elections.",
    "x\nTrump unemployment coming into office: 4.7%\nTump leaving office: 6.4%\nNet jobs: -2.8 million\nBiden unemployment coming into office: 6.4%\nBiden now: 3.9%\nNet jobs: +6.2 million pic.twitter.com/Ld13pe6txg\n Jesse Lee (@JesseLee46) January 14, 2022\nThe Secret Triumph of Economic Policy\nAll the reporting these days is about rising prices.",
    "Observers today noted that Jordan is denying that he recognizes the authority of Congress, and pointed out that in 2015, thenSecretary of State Hillary Clinton did, in fact, recognize that authority when she testified for 11 hours before a Republican-led House Select Committee on Benghazi.",
    " Jon Cooper gg (@joncoopertweets) January 11, 2022\nFrom Heather Cox Richardson\nOn Monday, U.S. District Judge Amit Mehta held a hearing in Washington, D.C., to determine whether three lawsuits against former president Trump and a number of his loyalists should be permitted to go forward.",
    "Obama, who founded When We All Vote, a campaign to register and organize voters, also said in the letter that the coalition would organize at least 100,000 Americans to contact their senators, urging them to pass the Freedom to Vote Act and John Lewis Voting Rights Advancement Act.",
    "Other Good News\nMajor Student Loan Processor Cancels $1.7 Billion In Debt\nNavient, one of the nation's largest student loan processors, will cancel $1.7 billion worth of debt for 66,000 students following an agreement to settle a lawsuit with 39 states and the District of Columbia.",
    "While Trump's lawyer tried to argue that the president could not be in trouble for failing to do somethingthat is, for failing to call off the riotersthe judge wondered if Trump's long silence indicated that he agreed with the insurrectionists inside the Capitol.",
    "Modernizing America's bridges will help improve safety, support economic growth, and make people's lives better in every part of the country  across rural, suburban, urban, and tribal communities,? Transportation Secretary Pete Buttigieg said in a statement.",
    "Donald Trump should be very afraid: This anniversary was not good news for him\nCheney has talked about possible crimes committed by Trump on or around Jan. 6 before, but it was Woodward's appearance on MSNBC that really caught my attention.",
    "It has asked him to testify voluntarily, since he has acknowledged that he spoke to Trump on January 6, and since the committee has at least one text from him appearing to embrace the theory that the election results could be overturned.",
    "Everybody's coming after you.'? Cawthorn spoke at the January 6 Stop the Steal? rally before the crowd broke into the Capitol, suggesting he supported the attack, then voted against accepting the certified ballots from certain states.",
    "Brandishing handfuls of documents and looking as animated as I've ever seen him, Woodward made repeated charges that what Trump had done in attempting to overthrow the election of 2020 was \"a crime against the Constitution.\"",
    "Sen. Mark Kelly raises $9 million in 3 months, leaving GOP primary rivals in the dust\nDemocratic Sen. Mark Kelly is leaving his Republican rivals in the dust, raising a whopping $9 million in the last three months of 2021.",
    "Today, establishment Republicans showed some resistance to Trump's attempt to remake the Republican Party as his own when they made a desperate push to stop litigating the 2020 election and instead to move forward.",
    "The lawsuits have been filed by Democratic members of the House and Capitol Police officers injured on January 6 against Trump, lawyer Rudy Giuliani, Donald Trump Jr., Representative Mo Brooks (R-AL), and others.",
    "He has been called a \"stenographer\" for good reason, because of his reluctance or outright refusal to analyze or draw conclusions from some of the groundbreaking revelations he has reported over the years.",
    "The judge also tried to get at the answer to whether the actions of Trump and his loyalists at the rally were protected as official speech, or were part of campaign activities, which are not protected.",
    " Kyle Griffin (@kylegriffin1) January 11, 2022\nx\n?BREAKING: The Biden administration announced https://t.co/rcuYF3HQS3, a new website for Americans to order FREE at-home rapid Covid tests by mail.",
    "What has always amazed me about Woodward has been his almost congenital refusal to draw conclusions from the extensive reporting he's done on presidents and their administrations.",
    "Most significantly, Judge Mehta grappled with the meaning of Trump's refusal to call off the rioters for 187 crucial minutes during the insurrection as they stormed the Capitol.",
    "arrested Stewart Rhodes, the founder of the far-right militia, in a major step forward in the investigation into the attack on the Capitol by supporters of Donald J. Trump.",
    "And I get that: A 7 percent surge in the Consumer Price Index over the past year comes as a shock, especially because so many people, myself included, didn't see it coming.",
    "For years, hundreds of thousands of farmworkers toiling in California's agricultural heartland weren't entitled to overtime pay unless they worked more than 10 hours a day.",
    "Of all the things written about why it seems so hard to live in the modern word without being depressed, I think one that is often overlooked is the scope of our worldview.",
    "I'm not going to review my Woodward library on a quote-hunt, but I'm pretty sure it's the first time I've ever heard him accuse a president or former president of a crime.",
    "Last night, Representative Jim Jordan (R-OH) joined other Trump administration figures when he announced that he would not appear before the January 6th committee.",
    "x\nBeginning this week, hundreds of thousands of Texans aged 65 and older will begin receiving vote-by-mail applications courtesy of the Texas Democratic Party.",
    "As of Jan. 1, California law requires that employers with 26 or more employees pay overtime wages to farmworkers after eight hours a day or 40 hours a week.",
    "If my words had been misconstruedand they led to violence, wouldn't somebody, the reasonable person, just come out and say, wait a second, stop?? he asked.",
    "In fact, there's a good chance that in retrospect we'll view economic management over the past two years as a policy triumph, despite the inflation spike.",
    "But there's another story that should be getting more attention: America's extraordinary success in limiting the damage from a horrifying pandemic.",
    "The League of Women Voters work year-round to combat voter suppression through advocacy, grassroots organizing, legal action and public education.",
    "It's a change advocates say is long overdue to provide the agricultural labor force with the same protections afforded to other hourly workers.",
    "Cawthorn continues to question the legitimacy of Biden's election and, last summer, warned there could be bloodshed? over future elections.",
    "I've been a sort of Woodward tea-leaf reader since the Watergate days, throughout his various tomes on presidents as the years have passed.",
    "He'll interview them and come up with extraordinary quotes and documentary evidence, but all he ever does is present it without comment.",
    "The Department of Justice said this summer that it considered the rally a campaign event and would not defend Brooks for his part in it.",
    "The bridge program is one of the largest new sources of federal spending in the package and one that encapsulates its bipartisan appeal.",
    "This is a giant and important fight for us but, win or lose, we keep fighting and voting and organizing and spreading truth and light.",
    "They are taking buses around Florida to empower returning citizens, remove financial barriers to voting, and increase public safety.",
    "\"Insulin epitomizes the failures in the pharmaceutical industry in every way, shape or form and that's why we're targeting insulin.\"",
    "The White House announced the allocation of money to mark 60 days since President Biden signed the $1 trillion infrastructure bill.",
    "Brooks told the judge that everything he didincluding wearing body armor to tell the crowd to fightwas part of his official duties.",
    "In parts of the Northeast, it seems to be\nThe number of new Covid-19 cases in New York City rose more than twentyfold in December.",
    "https://t.co/AqyOhyYm2s\n Kyle Griffin (@kylegriffin1) January 11, 2022\nCalifornia farmworkers now get overtime pay after 8 hours.",
    "TV brought the world into our house, but still, the national news just came once a day  at 6pm, and that was if you tuned in.",
    "They have on the ground work in 10 states and people from other states can write postcards, phone bank, fundraise, and text.",
    "For all their bluster before the media, key figures in the events of January 6 appear to be increasingly uncomfortable.",
    "Say Go ahead  you first? Say I understand you are short-staffed, I can wait.? Say stay healthy, my friend.? Stay alive.",
    "Sign up at Democracy Docket to stay informed about the fight against voter suppression and the fight for voter rights.",
    "While you rest, millions of other people are picking up the slack, waiting for you to come back in when you are ready.",
    "Senator Mike Rounds (R-SD) appeared Sunday on ABC News, where he said the 2020 election was fair? and that Trump lost.",
    "The plaintiffs are trying to hold Trump and his team liable in a civil suit for inciting the January 6 insurrection.",
    "That means many farmworkers like Crdenas will now be compensated time-and-a-half for working more than eight hours.",
    "But still, a lot of the paper was local and so, for a few minutes a day, at most, we read about the world beyond.",
    "The Fair Fight PAC could continue using its money to support Democratic Party efforts and promote voting issues.",
    "Fox host Briane Kilmeade said Donald Trump needs to \"learn how to lose,\" because he saw no evidence of fraud.",
    "Jordan claimed that the committee has no legitimate legislative purpose, although a judge has said otherwise.",
    "Texas Democrats also have relaunched their live Voter Assistance Hotline to answer questions voters may have.",
    "Justice Is Coming\nOath Keepers Leader Charged With Seditious Conspiracy in Jan. 6 Investigation\nThe F.B.I.",
    "Gavin Newsom has announced his intention for the state to manufacture and distribute its own insulin.",
    "But that has changed due to a 2016 state law that's been gradually implemented over four years.",
    "Not even his wealthiest GOP challengers came close to matching Kelly's formidable fundraising.",
    "You can get involved with them at this link\nVolunteer with Black Votes Matter at this link.",
    "But it also could get more directly involved in supporting Abrams in her run for governor.",
    "This is a key factor on which the January 6th committee is focused, and Mehta dug into it.",
    "x\nDOJ's Matthew Olsen: The Justice Department is forming a new domestic terrorism unit.",
    "In both New Jersey and Maryland, the number of new cases has fallen slightly this week.",
    " Jon Cooper gg (@joncoopertweets) January 14, 2022\nGood Virus News\nIs Omicron Peaking?",
    "They are really amazing\nMake phone calls FROM YOUR OWN HOME to protect voter rights.",
    "You are one of millions and millions working to make our country and world better.",
    "The site goes live Wednesday, but tests are expected to take 712 days to deliver.",
    "We simply did not win the election, as Republicans, for the presidency,? he said.",
    "It used to be that people just knew about what we going on in their small towns.",
    "We know about things going on everywhere and it permeates our day-to-day lives.",
    "The ACLU plays a key role in filing lawsuits that often stop voter suppression.",
    "In several major cities, the number is also showing signs of leveling off.",
    "The group filing the challenge promised it would be the first of many.",
    "This doesn't mean that you don't have to act to make the world better.",
    "We are constantly being told about a world that is not in our control.",
    "Fascism spreads from hate and fear and those who are good being quiet.",
    "And we are constantly being told about the bad parts of that world.",
    "Say: If you don't support election integrity, I'm coming after you.",
    "Even when it is scary, use your voice to speak for what is right.",
    "Influence voters in key areas from the comfort of your own home!",
    "Spread The Vote works to get voters IDs before voting begins.",
    "I am lucky and proud to be in this with you g?g?gggggg?g?",
    "There are phone banks on Wednesdays and on Saturdays.",
    "With newspapers, we started being able to learn more.",
    "You have lived through so much and you keep going.",
    "Donate to the AMAZING Florida Rights Restoration!",
    "Be still for a moment and maybe you can hear it.",
    "First, be kind to yourself:\nYou are so amazing.",
    "We aren't perfect, but they are fucking evil.",
    "Now the world is literally at our fingertips.",
    "It is not your obligation to fix everything.",
    "But it means you only have to do your part.",
    "You can volunteer with them at this link.",
    "On the Lighter Side\nThat is it for today.",
    "In the past few days, it has flattened.",
    "It'd be better if you did  we need you.",
    "Get involved with the Democratic party.",
    "Third, remember that you are not alone.",
    "No wonder so many of us are depressed.",
    "Get involved with Postcards to voters!",
    "They are working on races right now!",
    "Get involved with them at this link.",
    "Madison Cawthorn's coming after you.",
    "We carry it around in our pocket.",
    "Most important: DON'T LOSE HOPE.",
    "We see headline after headline.",
    "Get involved with Swing Left.",
    "How does that make you feel?",
    "No wonder we feel helpless.",
    "Second, be kind to others.",
    "We can all do that, right?",
    "Remember:\nWhat can you do?",
    "I recommend three things.",
    "So spread love and hope.",
    "I am so proud of you.",
    "And don't be quiet.",
    "Run for something!",
    "But not this week.",
    "We never give up.",
    "x\nCalifornia Gov.",
    "What do we do?",
    "Why not you?",
    "Seriously?",
    "x\nBOOM!",
    "Really."
  ]
}