{
  "id": 1617,
  "mediaId": 129,
  "date": "1/13/2022 12:00:00 AM",
  "headline": "Before Elections, Georgia Republicans Again Consider Voting Restrictions",
  "image": "https://static01.nyt.com/images/2022/01/12/us/12georgia-voting/merlin_200213448_1746abb4-b74d-45c5-8706-d9369dd080ee-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/13/us/georgia-voting-laws-republicans.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2040,
    2040,
    2087,
    2337,
    2337,
    428,
    428,
    146,
    146,
    571,
    571,
    2672,
    2672,
    2555,
    2555
  ],
  "sentences": [
    "Make no mistake,? he said, Georgia is ground zero for the Biden-Harris assault on election integrity, as well as an attempt to federalize everything from how hard-working Georgians run their businesses, to what our kids are taught in school, to how we run elections.?\nMr. Kemp and Brad Raffensperger, Georgia's Republican secretary of state, have both earned places atop Mr. Trump's list of enemies for defying the former president's demands that they help overturn his electoral loss in Georgia.",
    "On Tuesday, Mr. Kemp, in a news conference preceding Mr. Biden's speech, defended the 2021 election law, saying that the Biden administration had lied? about it  a reference to Mr. Biden's untrue assertion that the law ends voting hours early.?\nHe blamed Mr. Biden, Ms. Abrams and Vice President Kamala Harris for the backlash to the law, including the loss of the All-Star game, which he said had cost the state $100 million.",
    "1-ranked elections integrity act in the country.?\nMore than any other state, Georgia was the linchpin of Democrats' fortunes in 2020  the Republican stronghold that not only flipped for President Biden, but delivered the Senate to him, said Larry Sabato, the veteran political analyst and director of the University of Virginia Center for Politics.",
    "He has been one of the most prominent voices calling for a state constitutional amendment barring noncitizens from voting, and in a news conference on Tuesday, he called for a similar amendment to the U.S. Constitution, noting that noncitizen voting in local elections is now legal in places like New York City for municipal elections.",
    "So perhaps it's no surprise that Mr. Miller, a co-sponsor of a sweeping and restrictive state voting law last year, has once again jumped into the fray, promoting a new measure to prohibit the use of drop boxes for absentee ballots, which he says would increase security  though no problems with their use by voters have been verified.",
    "Mr. Raffensperger is locked in a tough primary fight with an ultraconservative Trump-backed congressional candidate, Representative Jody Hice, whose backing of Mr. Trump's fraud claims included signing on to a Supreme Court case that sought to overturn the November 2020 election results in Georgia and three other states.",
    "The investigation, and the new proposals before the Republican-controlled legislature, have triggered fresh anger among Democrats who believe the measures could contribute to an already unfair playing field in a state where numerous Trump-backed candidates are running for statewide offices in the November elections.",
    "And they're willing to try any method at hand to do that.?\nThough Republicans dominate the state legislature, some of the proposals may prove to be, at most, performative gestures by lawmakers eager to show the party's base that they are responsive to Trump-fueled concerns about voter fraud.",
    "It's actually easier to vote early in person  and we provide far more days than most states for that.?\nGeorgia was a key to President Biden's victory as well as the Democratic takeover of the Senate, and this is the second year that Georgia Republicans are focused on voting restrictions.",
    "state legislatures.?\nIn a state where Mr. Biden squeaked to victory by fewer than 12,000 votes, even a slight drop in turnout might be enough to turn a would-be Democratic victory into defeat, a calculus that seems hard to ignore in election measures the legislature passed last year.",
    "There are a lot of things you can to do prevent people from exercising their right to vote, and the total control and access is there.?\nThe ongoing scrutiny of the elections system has also drawn a number of once-obscure local elections officials into an unwelcome spotlight.",
    "The most disturbing thing is that the people who have an iron grip on power in the General Assembly believe that they have to continue to suppress voting in order to maintain that iron grip,? said David Worley, a Democrat and former member of the state elections board.",
    "After the measure eliminated more than three of every four ballot drop boxes in metropolitan Atlanta, the share of voters using the boxes dropped by roughly half in the region's municipal elections in November, The Atlanta Journal-Constitution reported this week.",
    "It did so by sharply reining in the use of drop boxes that were favored by mail-in voters, imposing ID requirements on absentee ballots and raising stiff barriers to the distribution of mail-in ballot applications by both local officials and voting drives.",
    "Last week, Jeanetta Watson, the head of elections in Macon-Bibb County government, tendered her resignation as well, writing that an excessive workload? and rapidly changing election laws, policies and procedures? had taken a toll on my mental health.?",
    "One measure under consideration would allow Georgians to use paper ballots if they have concerns about the recently purchased touch-screen voting machines that were the subject of fantastical fraud claims promulgated by some of Mr. Trump's supporters.",
    "And it's a pretty damn big canary.?\nIn a year that saw Republican-led legislatures nationwide pile new restrictions on voting, the elections law that Georgia lawmakers passed last spring was less notable for its severity than for its specificity.",
    "The governor's race is likely to pit the country's best-known voting rights advocate, Stacey Abrams, a Democrat, against either Mr. Kemp, whom Ms. Abrams has openly accused of voter suppression in her 2018 race against him, or former U.S.",
    "Atop that, the law allowed for state takeovers of county election boards, banned mobile voting sites in heavily Democratic Atlanta and even barred residents from providing food and water to voters waiting in line at the polls.",
    "The 2021 statute drew a number of legal challenges, including by the U.S. Department of Justice, which argues that the law violates the federal Voting Rights Act by making it harder to vote and that it was racially motivated.",
    "sees that no penalty is paid for voter suppression, surely that will encourage Republicans to do it wherever they can get away with it.?\nHe added: In both 2022 and 2024, Georgia is going to be the canary in the coal mine.",
    "ATLANTA  Butch Miller, a Republican leader of the Georgia State Senate, is running for lieutenant governor and faces a tough fight this spring against a primary opponent backed by former President Donald J. Trump.",
    "As part of their investigation, in July 2021, the Manhattan district attorney's office charged the Trump Organization and its chief financial officer with orchestrating a 15-year scheme to evade taxes.",
    "They control who registers, whose ballots are counted,? said Helen Butler, a leader of the Georgia Coalition for the People's Agenda and a Democrat who was kicked off the Morgan County board in June.",
    "If Mr. Hice wins the general election, there's a good chance that Georgia's electoral votes will be pushed into the Republican column in 2024, regardless of the popular vote,? Mr. Sabato noted.",
    "The state law, as well as federal voting rights legislation praised by President Biden in a visit to Atlanta this week, is expected to be front and center in upcoming statewide campaigns.",
    "At the same time, the elections board in Fulton County, the most populous in the state and a Democratic stronghold, is the subject of a state investigation of its management practices.",
    "In six largely rural counties, the legislature gave conservative judges or Republican-dominated county commissions control of some or all appointments to local election boards.",
    "Mr. Miller's proposal is among a raft of new bills that underscore how much Republicans have embraced Mr. Trump's false narrative that voter fraud cost him the 2020 election.",
    "The measure that would expand the role of the state investigations bureau, backed by the powerful House speaker, David Ralston, may have the greatest chance of success.",
    "Yet another would create a constitutional amendment to prevent noncitizens from voting  even though they are already barred from voting under existing state law.",
    "Drop boxes were completely shut down the Friday before Election Day  precisely the time when voters who had neglected to mail their ballots needed them most.",
    "In theory, this investigation could lead to a Republican-directed takeover of the local election board  one that was made possible by the 2021 election law.",
    "Brian Kemp, a Republican, this week sounded a less than enthusiastic note about going much further than the 2021 voting law, which he called the No.",
    "Like Mr. Kemp, Mr. Raffensperger has been eager to show Republican voters that he has his own concerns about election integrity in Georgia.",
    "One of the newly constituted boards already has ended early voting on Sunday, a tradition among Democratic-leaning Black voters.",
    "The measure took dead aim at the record 1.3 million absentee votes cast the previous November, disproportionately by Democrats.",
    "He warned that the federal voting rights laws Mr. Biden was pushing for amounted to a political grab by Democrats.",
    "Senator David Perdue, Mr. Kemp's Republican primary challenger, who has echoed Mr. Trump's baseless fraud claims.",
    "Another proposal would allow the state bureau of investigation to open inquiries into allegations of voter fraud.",
    "Will they shave just enough votes from the Democratic column to put Republicans firmly back in the driver's seat?",
    "Together, the six counties cast 33,400 votes for Mr. Biden in 2020, three times his margin of victory statewide.",
    "That could easily be copied in other swing states with right-wing secretaries of state and G.O.P.",
    "Drop boxes are the weakest link in our election security,? Mr. Miller said in a statement.",
    "The Fulton County elections director, Rick Barron, announced his resignation in November.",
    "That's why the new voting rules in Georgia and elsewhere matter so much,? he said.",
    "This change removes that weakest link without doing anything to prevent access.",
    "Major League Baseball moved its All-Star Game out of the state in protest.",
    "Some results of the 2021 law have already become apparent.",
    "A trial in that case is scheduled for summer 2022.",
    "Card 1 of 6\nInvestigation into tax evasion.",
    "If the G.O.P.",
    "Gov."
  ]
}