{
  "id": 1632,
  "mediaId": 43,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "David Perdue introduces his version of the conservative school indoctrination deception",
  "image": "https://images.dailykos.com/images/1026089/story_image/A8064AA6-8C20-4400-9D95-291A023579F4.jpeg?1642024490",
  "link": "https://www.dailykos.com/story/2022/1/12/2074197/-David-Perdue-introduces-his-version-of-the-conservative-school-indoctrination-deception",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1007,
    1454,
    1465,
    1606,
    1646,
    1758,
    2022,
    2069,
    2095,
    2164,
    4325,
    87,
    120,
    428,
    571,
    2865,
    2945,
    2953
  ],
  "sentences": [
    "And anything, not part of the white heteronormative experience, will be banished, banned, and burnt (the last, metaphorically speaking  at least for now)\nShowing their talent for cloaking extremism and bigotry in neutral language, conservatives have called theIr campaign to bowdlerize school curricula and libraries a fight to promote parental rights?.",
    "Whether it's Joe Biden's Justice Department attempting to classify parents as domestic terrorists' or activists funded by dark money who seek to quietly introduce critical race theory into school curricula, education has taken a back seat to radical politics in many schools and parents are taking notice.",
    "Read between the lines and the message of incipient Stalinism, socialist mind-control, leftist family destruction, Soros-funded activists, Black radicals, LGBTQ+ sexual deviants, and woke bureaucrats seeking to poison America's youth is evident.",
    "And to guarantee this outcome, they will enact laws giving individual parents the right to sue teachers and school districts that depart from conservative state government orthodoxy or stock libraries with books containing challenging material.",
    "(Wrongs Against Our Kids and Employees) Act,\" which would allow parents to sue school districts if they believe the schools teaching their child critical race theory or other inappropriate content \"smuggled\" into class lessons.",
    "On his official website, he explains his aim,\nAmerica has long recognized the right of parents to direct their children's education, but we are now seeing a concerted effort by the Left to shut parents out.",
    "He announced on Monday a nine-point Parent's Bill of Rights? which includes calls for full disclosure of what is being taught in school, who is teaching the material, and information about school funding.",
    "But if they allow Republicans to portray their bigotry as family values' they will make maintaining political majorities an even more slippery pole for Democrats to climb.",
    "In Virginia, Glenn Youngkin won the governorship partly because he promised he would be ridding political agendas from the classroom by banning critical race theory?.",
    "It's time to give control back to parents, not woke bureaucrats, and empower them to start a new era of openness in education.?\nIt's an enumeration of night terrors.",
    "Like a parent comforting a terrified child, the GOP had reassured an easily spooked electorate that they would protect the voters' guns and Bibles.",
    "To say that some parents should be allowed to do something they are already allowed to do, is to imply that parents are not allowed to do it.",
    "An Indiana bill banning the teaching of \"divisive concepts? gives parents and community members more say over curriculum than educators.",
    "And parents who are happy with their child's education, and the selection of books in the school library, are not going to raise a fuss.",
    "And, once again, the GOP proved its genius at finding an imaginary boogeyman to scare the bejesus out of centrist suburban voters.",
    "Which sounds better than admitting their aim is to produce unthinking, uncritical, small-minded, conservative Christian drones.",
    "In Florida, which helped spark the new parental rights movement by passing its own Parents' Bill of Rights last summer, Gov.",
    "It allows parents to collect more records on safety and visit the school to check in on their children during school hours.",
    "Perdue's Bill of Rights would allow parents to sue school districts for relief if schools did not uphold certain rights.",
    "From their language, it seems Islamic madrassas, and North Korean brainwashing, have received favorable attention.",
    "Public support for gay marriage skyrocketed when heterosexual America discovered same-sex unions were no threat.",
    "But christofascists are grasping for the brass ring, control of the entire non-sectarian public school system.",
    "And Protestant schools are lobbying to use school vouchers to get a slice of the public education budget.",
    "In November 2021, Insurrection enabler, Josh Hawley, introduced a Parents Bill of Rights' in the Senate.",
    "Now they promise no child will ever be taught something that would trouble their fragile (white) mind.",
    "A $10,000-per-day fine  payable to the complaining parent  will likely shut down libraries entirely.",
    "An Oklahoma bill would enable parents to force school libraries to remove books they object to.",
    "After all, those are outstanding programs for producing a mindlessly, compliant population.",
    "Religious fundamentalists cannot risk their fearmongering being exposed as groundless.",
    "The Virginia governor race showed that Trump sucks? is not a good electoral strategy.",
    "Other red-state governments have similar anti-education laws on the books or on deck.",
    "Take David Purdue, ex-Senator from Georgia now seeking to primary' incumbent GA Gov.",
    "Liberals have to defend public schools  or risk losing an entire generation or more.",
    "Knowledge Is kryptonite to any group that relies on ignorance to maintain its power.",
    "Conservatives are also waging war on independent thinking in Washington DC.",
    "What are these conservative Christian cultural warriors trying to achieve?",
    "The Catholic Church, with its education network, has known this for years.",
    "Intellectually vibrant communities are anathema to conservative thought.",
    "Which gives the noisy minority outsize control over school curricula.",
    "Addicting teens was a critical part of Big Tobacco's business plan.",
    "The Democrats already face heavy sledding in the 2022 midterms.",
    "The key to any program of indoctrination is to start young.",
    "Schools can't afford to get involved in endless lawsuits.",
    "Ron DeSantis is introducing \"the Stop W.O.K.E.",
    "Isn't all of this public knowledge anyway?",
    "But the real sting is in the tail.",
    "And familiarity breeds acceptance.",
    "And churches aim even younger.",
    "They certainly will not sue.",
    "Brian Kemp as Trump's patsy.",
    "Who are their role models?",
    "It is Orwellian."
  ]
}