{
  "id": 1636,
  "mediaId": 63,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "GOP Figures Blast Trump's Rehashing Of Election Fraud Claims: Learn To Lose'",
  "image": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6172da0dd4c45e8e984d1798%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1914%26cropY1%3D0%26cropY2%3D1076",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/01/11/gop-figures-blast-trumps-rehashing-of-election-fraud-claims-learn-to-lose/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    942,
    1147,
    1231,
    1436,
    2095,
    2214,
    2314,
    428
  ],
  "sentences": [
    "Trump responded with a statement Monday slamming Rounds, saying, Is he crazy or just stupid?? and vowing to never endorse this jerk again.?\nBoth Sen. Mitt Romney (R-Utah) and Sen. Kevin Cramer (R-N.D.) expressed support for Rounds after Trump's attack, with Romney tweeting Monday that Joe Biden won the election? and Cramer telling CNN Tuesday he doesn't believe the election was stolen and moved on a long time ago.?\nArkansas Gov.",
    "Fox & Friends host Brian Kilmeade was another conservative figure who denounced Trump, saying on Fox's Media Buzz Sunday that Trump's failed to show evidence of his claims and needs to learn to lose.?\nRep. Adam Kinzinger (R-Ill.), a longtime critic of Trump and a member of the committee investigating the January 6, 2021, attack on the U.S. Capitol, mocked Trump's attack on Rounds, calling Trump a snowflake? in a tweet Monday.",
    "Topline\nDespite former President Donald Trump and his baseless (and unrelenting) assertions of election fraud remaining popular among Republican voters, a handful of Republicans chose to publicly denounce the claims over the past few days, appearing to agitate the ex-president after he repeatedly rehashed the claims on the anniversary of the January 6 U.S. Capitol attack.",
    "The former president lost the 2020 election.?\nTrump's false claims of election fraud were again the focal point of national media attention over the past week as the nation marked the first anniversary of Trump supporters storming the Capitol.",
    "Trump sent out a series of statements Thursday, the day of the anniversary, promoting conspiracy theories claiming he was the true winner of the 2020 presidential election, even though he actually lost by more than 7 million votes.",
    "Kemp notably denied Trump's claims that widespread fraud kept him from winning Georgia and resisted pressure to overturn the election results, leading to repeated attacks from Trump after the 2020 election.",
    "Polling has also consistently shown that Trump remains the most powerful figure in the Republican Party and GOP voters in large part believe the results of the 2020 election were fraudulent.",
    "Trump had initially planned to hold a news conference that day, primarily to attack politicians he views as Rinos?Republicans in name onlywho do not buy in to the fraud claims.",
    "Trump has essentially made support for fraud claims a litmus test for candidates seeking his endorsement, which has proven to be extremely influential in Republican primaries.",
    "Asa Hutchinson (R) also spoke out against Trump's claims on Sunday, telling CNN he's worried about Republicans who embrace the big lie? being put in positions of leadership.",
    "Brian Kemp (R), who is popular among Republicans, faces Trump-backed former U.S. Sen. David Perdue (R) in the state's Republican gubernatorial primary.",
    "have drawn the most attention, after he told ABC News the 2020 election was as fair as we have seen? in an interview that aired Sunday.",
    "I'm disappointed but not surprised by the former president's reaction,? Rounds said in a statement after Trump's attack Monday.",
    "Trump later called off the news conference, reportedly amid pressure from fellow Republicans.",
    "The power of Trump's endorsement will face its biggest test yet in May, when Georgia Gov.",
    "Key Facts\nComments from Sen. Mike Rounds (R-S.D.)",
    "However, the facts remain the same.",
    "I stand by my statement."
  ]
}