{
  "id": 1638,
  "mediaId": 195,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Kemp pads out campaign war chest ahead of tough reelection bid",
  "image": "https://cdn.jwplayer.com/v2/media/s8DV122L/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/589193-kemp-pads-out-campaign-warchest-ahead-of-tough-reelection-bid",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "Kemp, who won the GOP nomination for governor in 2018 after scoring Trump's endorsement, has found himself isolated from Trump after he rejected the former president's pressure to overturn the results of the 2020 presidential election in Georgia.",
    "If he makes it through the primary, Kemp is likely to face Abrams  a prolific fundraiser in her own right  in the November general election, a rematch that is expected to be among the closest-watched of the year.",
    "Brian Kemp is bulking up his reelection campaign's war chest ahead of an expectedly tough GOP primary fight against former Sen. David Perdue (Ga.) and a potential general election against Democrat Stacey Abrams.",
    "While he won't be able to raise money for his campaign directly while the legislature is in session, an affiliated leadership committee? will be able to raise unlimited funds during that time.",
    "Kemp's fundraising announcement came a day after the start of the 2022 Georgia legislative session, when both the governor and state lawmakers are barred from raising money.",
    "Kemp is among former President Trump's top Republican targets of the 2022 midterm election cycle, and Perdue is running with the support of the former president.",
    "Perdue has filed a lawsuit challenging that law, arguing that it gives Kemp an unfair advantage because of his incumbent status.",
    "The governor pulled in more than $7 million between July 1 and Jan. 9, his campaign confirmed to The Hill on Tuesday.",
    "Such committees were authorized under a law passed by the GOP-controlled state legislature last year.",
    "That leaves him with more than $12 million in his campaign account as he kicks off the year.",
    "The next official reporting deadline for fundraising doesn't fall until the end of January.",
    "The money will come in handy in what is expected to be a challenging race.",
    "The fundraising haul was first reported on Tuesday by Fox News.",
    "Georgia Gov."
  ]
}