{
  "id": 1644,
  "mediaId": 65,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Georgia Gov. Kemp reports massive fundraising haul over past six months",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2c1bdfc1-93b9-41fa-a61f-86882b6cc452/8e4b33e3-1250-4963-ac5f-641450f6f6ea/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-gov-kemp-fundraising-haul-past-six-months",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    4325,
    146,
    227,
    232,
    428,
    2672
  ],
  "sentences": [
    "GEORGIA GOP CLASH: PERDUE FILES LAWASUIT AGAINST LAW ALLOWING KEMP TO RAISE UNLIMITED FUNDS\n\"These numbers affirm what we've said from the very beginning: the Kemp for Governor campaign has the resources to win the primary and in November,\" Kemp campaign manager Bobby Saparow told Fox News.",
    "Last Thursday Perdue filed a lawsuit challenging the constitutionality of Georgia Senate Bill 221, which allows Kemp  as well as a handful of state legislative leaders  to set up leadership funds or committees that can haul in and spend unlimited amounts of campaign cash.",
    "And Abrams  a rising Democratic Party star and voting rights champion  is a fundraising giant who set campaign cash records in her 2018 gubernatorial run and who's voting rights group, Fair Fight, has hauled in over $100 million since then.",
    "KEMP, IN FOX NEWS INTERVIEW, VOWS HE WON'T 'OUTWORKED'\nKemp's committee doesn't have to adhere to the current fundraising caps for statewide candidates in Georgia, but challengers are not exempt from the campaign cash limits.",
    "The fundraising figures for July 1 through Monday, Jan. 9  which were shared nationally first with Fox News on Tuesday  follow an impressive $4 million that Kemp hauled in from February through June of last year.",
    "ENCOURAGED BY TRUMP, PERDUE LAUNCHES PRIMARY CHALLENGE AGAINST KEMP\nPerdue, who declared his candidacy a couple of days after Abrams announcement, jumped into the race after months of encouragement by Trump.",
    "EXCLUSIVE: In a major sign of strength as he faces a general election challenge from Democrat Stacey Abrams as well as a Republican primary challenge from former Sen. David Perdue, Georgia GOP Gov.",
    "While the fundraising filing period for state races doesn't conclude until the end of this month, the governor's prevented by Georgia law from raising money while the legislature is in session.",
    "His move set up an epic GOP primary battle with the conservative incumbent, who for over a year has faced the former president's rath for not overturning the 2020 election results in Georgia.",
    "The ballots in the Peach State were counted three times  the original Election Day tally, a mandatory hand recount and a recount requested by the then-president's campaign.",
    "Saparow emphasized that \"Kemp has been working hard in recent months, meeting with voters, donors, and Republicans who care about the future of this state and our country.\"",
    "Infuriated with the governor, Trump has repeated vowed to return to Georgia to campaign against Kemp for failing to help him overturn the results.",
    "And Kemp's leadership committee is allowed to fundraise when the Georgia legislature is in session, unlike the governor's reelection campaign.",
    "Former Democratic state lawmaker Vernon Jones, who was a top Black surrogate for Trump in Georgia in 2020, is also primary challenging Kemp.",
    "The bill was approved mostly along party lines by the GOP-controlled legislature, and Kemp quietly signed the measure into law last May.",
    "Former President Donald Trump's backing of Perdue's primary challenge should quickly help fuel the former senator's campaign coffers.",
    "The reporting of Kemp's reelection campaign cash figures comes a day after the start of the new legislative session in Georgia.",
    "Kemp's campaign created the Georgians First Leadership Committee in June, just days after the new law went into effect.",
    "And he pledged that \"our campaign will continue to outwork anyone in the field to ensure we keep Georgia red in 2022.\"",
    "President Biden edged Trump by less than 12,000 votes out of nearly 5 million cast in Georgia in the 2020 showdown.",
    "And candidates can use campaign cash to build grassroots outreach, hire staffers, travel, and produce and run ads.",
    "Abrams, a former state legislative leader, launched her second bid for governor at the start of December.",
    "And the governor's 2022 reelection campaign says that they currently have over $12 million cash on hand.",
    "Fundraising, along with polling, is a key barometer of a candidate's popularity, support, and strength.",
    "Four years ago, with the support of Trump, Kemp narrowly defeated Abrams to win the governorship.",
    "There are no restrictions on Perdue's ability to fundraise while the legislature is in session.",
    "Brian Kemp reports bringing in over $7 million in fundraising the past six months.",
    "And Trump endorsed Perdue a day after the former senator launched his bid.",
    "Kemp and his team have a good reason to build a massive war chest.",
    "Georgia's gubernatorial primary is scheduled for May 24."
  ]
}