{
  "id": 1653,
  "mediaId": 195,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "We need to stop kowtowing to COVID refuseniks",
  "image": "https://cdn.jwplayer.com/v2/media/f5FOpz5d/poster.jpg?width=640",
  "link": "https://thehill.com/opinion/campaign/588899-we-need-to-stop-kowtowing-to-covid-refuseniks",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Albert Hunt",
  "authorUrl": "",
  "termIds": [
    1164,
    2095,
    2250,
    2343,
    523,
    2661,
    2672,
    2932
  ],
  "sentences": [
    "On health care workers, a brief filed to the court by leading medical colleges and health care experts notes all evidence shows the vaccination significantly reduces the likelihood that health care workers will transmit COvID-19 and infect patients.? Thus, it says, the rules should not be subject to second-guessing by an unelected federal judiciary which lacks the background, competence and expertise.?\nGiven the crisis, decisions are expected imminently.",
    "There have been mistakes: They dropped the ball on rapid tests, which now are in inadequate supply as Omicron rages, and one wonders: Where's the Secretary of Health and Human Services, Xavier Becerra, during a health care crisis?'\nMy guess is they will adapt and pay attention to the call a few days ago by prominent medical experts to change strategy and deal with a new normal? that the virus isn't going away.",
    "Brian Kemp (R), who has a tough primary challenge, criticized the reimposition of mask mandates in Atlanta, vowing not to divide the vaccinated from the unvaccinated or the masked from the unmasked.? Does he see no difference between those who act responsibly and save lives versus those who don't and risk lives?",
    "A critical test is how the Supreme Court decides two cases it heard on Friday, challenges from anti-vaxxers to Biden's COVID initiatives: one that larger companies require vaccinations or testing for in-person employees; the other that all staffers at facilities with Medicare or Medicaid patients be vaccinated.",
    "But the conservatives, consistently antagonistic to the federal administrative state, argued this could be handled by the states, a number of which have actually banned any vaccine and masking requirements.",
    "We should not lose sight of the fact that while the virus would still be here, it wouldn't have been as bad without the malfeasance of President Trump, despite some revisionism that he is unfairly maligned.",
    "But he failed everywhere else, downplaying the severity of the virus when he knew otherwise, peddling bizarre cures like ingesting disinfectants, and turning to crackpot advisers to counter science experts.",
    "A House committee report last year found Trump deliberately undermined public health and infectious disease experts and silenced officials in order to promote his own political agenda.",
    "The French president is so frustrated with these irresponsible? refuseniks that he just wants to piss them off? by making their lives so complicated they'd prefer to get vaccinated.",
    "The Peterson-Kaiser Family Foundation estimates that over the course of six months last year preventable COVID-19 hospitalizations among unvaccinated adults? cost $13.8 billion.",
    "Most of these politicians usually rail against too lax unemployment benefits  and be certain: there's no rush for a similar waiver for employees who refuse drug testing.",
    "Greg Abbott (R), always a contender for the lead bottom-feeder on this score, is suing the federal government over requiring vaccines for National Guardsman.",
    "Four states  Florida, Tennessee, Iowa and Kansas  have passed laws providing unemployment benefits to those fired for refusing to be vaccinated or tested.",
    "Justice Elana Kagan, one of the liberals, noted more and more people are dying everyday? of COVID and said there is no other effective prevention.",
    "Judging by the oral arguments, the court appears likely to uphold the requirement that all health care workers in these facilities be vaccinated.",
    "For almost a quarter century he wrote a column on politics for The Wall Street Journal, then The International New York Times and Bloomberg View.",
    "I am sick of hearing about the rights of  or alleged abuses suffered by  the 35 million Americans who haven't gotten vaccinated against COVID-19.",
    "Yet cheap-seat politicians and some media are full of sympathy for the unvaccinated, threatened  supposedly  by the heavy hand of government.",
    "In a corollary, the Commonwealth Fund estimates that the vaccination program prevented 1.1 million deaths and 10.3 million hospitalizations.",
    "Some protest that flu shots aren't mandatory; more than 830,000 Americans have died from COVID, 20-fold more than die in a bad flu season.",
    "But the Republican conservative majority on the court raised more objections to the vaccine or testing requirements for larger companies.",
    "The defeated former president deserves credit for the rapid development of highly effective vaccines during his administration.",
    "The know-nothings still rail against any mandates, ignoring that 50 states require a measles vaccine for kindergarteners.",
    "However, continuing to pay any homage to the destructive behavior of anti-vaxxers will make that challenge even harder.",
    "On the first, the question is whether the government has the authority to protect the health and safety of workers.",
    "He's also sending guardsman down to the border to check illegal immigrants, who critics say are COVID spreaders.",
    "There are a few legitimate vaccine exceptions for religious or medical reasons; there are not for testing.",
    "I'm more concerned about the dangers they pose to the more than 200 million who have been vaccinated.",
    "He previously served as reporter, bureau chief and Washington editor for The Wall Street Journal.",
    "Biden has done a better job, strongly promoting vaccinations and listening to the scientists.",
    "When it comes to the anti-vaxxers, I'm in Emmanuel Macron's corner.",
    "Al Hunt is the former executive editor of Bloomberg News.",
    "In Georgia, which faces a surge of Omicron cases, Gov.",
    "He hosts Politics War Room with James Carville.",
    "Follow him on Twitter @AlHuntDC.",
    "A couple simple facts.",
    "Square that governor.",
    "Texas Gov."
  ]
}