{
  "id": 1664,
  "mediaId": 237,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "A left-wing superlawyer's assault on democracy",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/cbe679e/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F8b%2Fae%2F66ec089740e1b630c0d20cf7f07f%2Ffea.Elias.jpg",
  "link": "https://www.washingtonexaminer.com/politics/a-left-wing-superlawyers-assault-on-democracy",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerry Dunleavy",
  "authorUrl": "https://www.washingtonexaminer.com/author/jerry-dunleavy",
  "termIds": [
    2095
  ],
  "sentences": [
    "Elias has played heavily into his new left-wing superhero persona, repeatedly tweeting out a profile of him by the Hill  Meet the Democrats' last best hope of preserving a House majority?  and quoted from it in late December: Elias's legal work may now represent the last best chance for House Democrats as they stare into the abyss of a decade lost in the minority.?\nHe continued talking a big game as recently as last month, tweeting that his prediction? for 2022 was that we will have a serious discussion about whether individual Republican House Members are disqualified by Section 3 of the 14th Amendment from serving in Congress? and that we may even see litigation.? He then boasted that his tweet had triggered the GOP.?\nIt was also Elias's finger on the trigger when Democrats torpedoed bipartisan reforms of the electoral process, revealing that his claims of protecting the integrity of elections are a facade.",
    "Elias allegedly misled reporters about his role funding the dossier, with Maggie Haberman tweeting that the folks involved in funding this lied about it, and with sanctimony, for a year,? while Ken Vogel contended that when he tried to report the story, Elias told him that you (or your sources) are wrong.?\nThe Senate Intelligence Committee's August 2020 report said that Elias told Fusion GPS to report only to him, so Fusion GPS's communications could be solely with a lawyer and thus covered by attorney-client privilege.?\nSimpson said that he briefed Elias on Trump's alleged links to Russia during their first meeting and said, This angle was all new to Elias, and he loved it.? The Fusion founder wrote that he decided not to tell Elias that Steele was sharing information with the FBI, and Elias told the committee that he did not authorize Fusion GPS to provide any information to law enforcement or to reporters.",
    "Grassley brought up Elias briefly during Attorney General Merrick Garland's confirmation hearing before the Senate Judiciary Committee in March, saying the attorney general will be under tremendous pressure from within the Biden administration and from congressional Democrats to turn the Justice Department into Marc Elias and the ACLU with guns.?\nAnd as Democrats sought to compel testimony from Trump's advisers despite claims of executive privilege, GOP Rep. Dan Bishop tweeted a video of himself on the House floor in December, saying, Democrats can throw away executive privilege as they obsess over Trump all they want.",
    "Elias's Democracy Docket website was registered in 2020, and Clinton posted in May 2020 that her PAC, Onward Together, would partner with Democracy Docket to protect Americans' right to vote by mail.?\nThe MacArthur Foundation announced in September 2020 that it would spend $25 million in grants, including to combat voter suppression.? The Democracy Docket Fund received $800,000 to assist with Equitable Recovery.? The Democracy Docket Legal Fund is a fiscally sponsored project? of the Hopewell Fund, whose board hired a left-wing dark money firm  Arabella Advisors  to manage its fiscal sponsorships.",
    "Horowitz said in his December 2019 report that the FBI concluded by early February 2017 that there were no such links.?\nSullivan told the House Intelligence Committee in 2017 that he was in meetings where Elias briefed the campaign on Trump-Russia allegations but claimed, Marc wears a tremendous number of hats, so I wasn't sure who he was representing.?\nRepublican Sen. Chuck Grassley pointed out the absurdity of this dodge in November, exclaiming, For crying out loud, Elias was the Clinton campaign's general counsel.?\nThere's yet more.",
    "Elias uses the Democracy Docket website to provide a platform for Democratic leaders, including Clinton herself; she penned a piece falsely claiming that Republican-led election reform laws are no different from the Jim Crow past.?\nElias wrote a piece on the fifth anniversary of Clinton's loss to Trump, unsurprisingly making no mention of the discredited dossier but writing that I am still with her.?\nMook told CNN in 2017 that he authorized Elias to hire an outside firm to dig up dirt on Trump's connections with Russia in 2016.",
    "... I'm just glad that we're paying attention to this now.?\nBrian Fallon, the former national press secretary for the Clinton campaign, previously defended Elias, saying in 2017 that I am damn glad he pursued this on behalf of our campaign.?\nPerkins Coie was paid over $12 million between 2016 and 2017 for its work representing Clinton and the Democratic National Committee.",
    "Palmieri spoke to the Senate about Elias's campaign briefings, saying, Some of the things that I have read are in the dossier I had heard about from Marc, including the famous encounter at the hotel.?\nElias appeared before the House Intelligence Committee in December 2017, where he was represented by Kathryn Ruemmler, former President Barack Obama's White House counsel.",
    "Brian Kemp signed Georgia's election reform law in March, also claiming to Chris Hayes that we're on the verge of losing our democracy in one or two elections.?\nMeanwhile, the superhero origin story Elias is creating for himself is in a race against the Durham inquiry, which paints a very different and highly unflattering portrait of his activities and priorities.",
    "Its publishing in January 2017 by BuzzFeed led to a yearslong Democratic frenzy: Rep. Adam Schiff, the House intelligence chairman, read portions of it into the Congressional Record, and left-wing partisans and media personalities promoted its false narrative of a collusion conspiracy between Trump and the Kremlin.",
    "Elias was hit with sanctions in March by federal appeals court judges for a redundant and misleading submission? and for violating his ethical duty of candor? to the court in a case in which the Democratic Party was challenging a state law that banned straight-ticket voting.",
    "The grand jury indictment against Sussmann centers on a September 2016 meeting with then-FBI General Counsel James Baker in which Sussmann passed along debunked allegations claiming there was a secret back channel between Russia's Alfa Bank and the Trump Organization.",
    "According to the committee, Elias did not provide details on what information he provided to the DNC or the Clinton Campaign.? Mook told the Senate committee that Elias briefed him along with Podesta, Palmieri, and Sullivan on pieces of the reporting? in the dossier.",
    "Durham alleges that Sussmann told Baker he was not working for any specific client, but, the special counsel contends, Sussmann was secretly doing the bidding of Clinton's presidential campaign (while working on behalf of a technology executive named Rodney Joffe).",
    "Igor Danchenko, a United States-based and Russian-born analyst, was charged with making false statements to the FBI about his sources of information, including the role longtime Clinton ally Charles Dolan played in supplying at least the basis of certain claims.",
    "Horowitz's 2019 report notes that with Fusion GPS's authorization? in late September 2016, Steele traveled to D.C. and met with numerous persons outside the FBI to discuss the intelligence he had obtained.? This included meeting with Elias at his D.C. office.",
    "John Durham's special counsel inquiry has further undercut the dossier's credibility and has resulted in indictments against Steele's primary source as well as Elias's former Perkins Coie law partner, Michael Sussmann, with whom he worked closely in 2016.",
    "Elias's attempt to hold himself up as democracy's great defender is most complicated by his role in funding and spreading British ex-spy Christopher Steele's discredited anti-Trump dossier while he served as the Hillary Clinton campaign's general counsel.",
    "The indictment further states that Elias emailed about the Alfa Bank with Clinton foreign policy adviser and current Biden national security adviser Jake Sullivan, campaign manager Robby Mook, and communications director Jennifer Palmieri.",
    "Republicans have signaled an openness to reforming the Electoral Count Act of 1887, for example, but Elias took to Twitter in January to pressure Democrats to ignore any opening from Republican Minority Leader Mitch McConnell.",
    "Donna Brazile, interim chairwoman of the DNC, texted Elias in early November 2016, asking, MI-6 on our payroll?? She says Elias called her and said that you don't need to know.?\nBoth Fusion and Elias stonewalled the Senate.",
    "He fought during the 2020 election to use the COVID-19 pandemic to change state election rules, especially those related to mail-in voting, and he won dozens of cases against pro-Trump litigants after the election.",
    "According to the indictment, Sussmann, Joffe, and Elias coordinated and communicated? about the Alfa Bank allegations during telephone calls and meetings, which Sussmann billed to the Clinton campaign? in 2016.",
    "I don't know how they got that information.?\nThe Senate committee included a footnote about the September 2017 interview with Podesta: The Committee notes that Elias was representing Podesta at the interview.",
    "Elias worked to slip in a 2014 congressional provision that greatly expanded the ability of national political parties to collect big-dollar donations, including to fund things such as election litigation.",
    "Elias did not raise his role hiring Fusion GPS or his direct knowledge of these matters.?\nWhen Podesta appeared before the House Intelligence Committee in June 2017, Elias was representing him then, too.",
    "Durham's criminal investigation and indictments appear to be affirming that many of the biggest Trump-Russia collusion claims can be traced back to the Clinton campaign and Democratic operatives.",
    "DOJ Inspector General Michael Horowitz found numerous problems with the FBI's investigation, criticizing the central and essential? role of the dossier in the bureau's flawed FISA surveillance.",
    "It was a grand conspiracist snowball rolled down the hill by Marc Elias, a virtual unknown to most of America but one of the most powerful inner-circle Democratic Party figures in Washington.",
    "From the time Elias took over as the Perkins Coie political law group chairman in 2009 through early 2021, the firm billed more than $150 million in legal work to Democratic-linked groups.",
    "The next day, Democratic Majority Leader Chuck Schumer said any compromise makes no sense? and vowed to hold a vote to blow up the filibuster to pass the Democrats' preferred legislation.",
    "Elias appeared on MSNBC numerous times last year, telling Rachel Maddow that democracy was physically assaulted? during the Jan. 6 riot and then assaulted with a pen? when Republican Gov.",
    "Durham pointed out that Dolan met Danchenko in Moscow and passed information along to him, some details of which were apparently embellished by the Russian and perhaps by Steele himself.",
    "Biden's chief of staff Ron Klain praised Elias in 2018, saying, He is the party's leading election lawyer.? Nearly every Democratic senator was represented by him and Perkins Coie.",
    "Elias was also represented by Nicholas McQuaid, who went on to be appointed the acting chief of the Justice Department's criminal division at the start of the Biden administration.",
    "Those bits of disinformation were provided to the Clinton campaign's allies, some of whom were hired by Elias (one such group was the opposition research firm known as Fusion GPS).",
    "According to its co-founder Glenn Simpson, Fusion was, in turn, paid roughly $50,000 per month from Perkins Coie, and Steele was paid roughly $168,000 by Fusion for his work.",
    "As FBI director, James Comey fought to include information from Steele's dossier in the January 2017 intelligence community assessment on Russian election meddling.",
    "He separated from Perkins Coie and launched his own firm last year, saying in December that his firm was involved in 36 pro-democracy? cases in 19 states.",
    "Elias has not been accused of lawbreaking by Durham, but the Clinton lawyer's actions are central to what the special counsel is investigating.",
    "The new firm straightforwardly describes itself as committed to helping Democrats win.?\nNot that his partisan intentions weren't already clear.",
    "The dossier was then deployed by the FBI to obtain secret surveillance against a former Trump campaign adviser, Carter Page, beginning in 2016.",
    "Along the way, it engulfed and corrupted the nation's democratic processes and the institutions of the federal government and law enforcement.",
    "Elias also sought to exempt Google and Facebook from certain disclaimer requirements in Federal Election Commission filings in 2010 and 2011.",
    "It was also an attempt to create a parallel record of events just as official inquests were poking countless holes in Elias's version.",
    "Elias defensively argued in 2017 that the FEC disclaimers would not have stopped? Russian influence efforts on social media in 2016.",
    "John Podesta, the chairman of the Clinton campaign, told the committee, I never saw a document that looks anything like the dossier.",
    "Those actions, as well as his behavior since then, have undermined the very democratic process of which he claims to be a champion.",
    "Democratic election lawyer Marc Elias wants you to believe that he wants to save democracy  by, conveniently, electing Democrats.",
    "The Clinton campaign manager added: I'm proud that we were able to assemble some of the research that has brought this to light.",
    "He also met with Sussmann in July 2016 and testified in a British court that Sussmann provided him with claims about Alfa Bank.",
    "Elias allegedly passed along the most salacious claims (videotaped sex acts) to high-level members of the Clinton campaign.",
    "When news broke of Elias's role in the dossier, Podesta was brought back in December  with Elias no longer alongside him.",
    "Comey also briefed President-elect Trump about the dossier's most salacious allegations during a meeting at Trump Tower.",
    "Steele also met with numerous journalists at the behest of Fusion GPS, and Elias testified he was aware of those plans.",
    "She also represented the DNC against a lawsuit brought by Carter Page, in which she defended the gist? of the dossier.",
    "Elias went on to serve also as the general counsel for now-Vice President Kamala Harris's failed presidential bid.",
    "The former MI6 agent also met with Justice Department official Bruce Ohr and members of the State Department.",
    "Perkins Coie announced in September that 11 partners and three lawyers were leaving to form Elias Law Group.",
    "The sanctions against Elias were upheld in June, though Elias continues to contest the sanctions in court.",
    "An investigation by special counsel Robert Mueller did not establish? any criminal Trump-Russia collusion.",
    "The FBI played a crucial role in insinuating the falsities into the official story of the 2016 election.",
    "The dossier was full of lurid and fantastical claims about Donald Trump's supposed connection to Moscow.",
    "Podesta was instead represented by Robert Trout, who now works at the same firm representing Danchenko.",
    "Bad Robot Productions, run by J.J. Abrams, announced in April it would donate $1 million to the fund.",
    "The Democratic lawyer has reaped the benefits of his efforts to expand the role of money in politics.",
    "Almost everywhere you lift a stone, Marc Elias is responsible for some grotesque bug lurking beneath.",
    "The left-wing Blue Ripple Politics also used ActBlue Civics to raise money for Elias's group.",
    "Republicans have quite a few names in mind when it's our turn.?\nAmong the names: Marc Elias.",
    "He said Elias periodically briefed the Clinton campaign about the Fusion findings.",
    "Jerry Dunleavy is a Justice Department reporter for the Washington Examiner.",
    "Steele's Clinton campaign benefactors were not revealed to the FISA court.",
    "Amid this controversy, Elias fully embraced his new partisan mission.",
    "But his partisanship isn't the biggest red flag.",
    "Some of it was coming in from press inquiries.",
    "We were getting information coming in.",
    "With Elias, there's always more.",
    "Sussmann pleaded not guilty.",
    "They'll regret this though."
  ]
}