{
  "id": 1666,
  "mediaId": 129,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "Republicans and Democrats come together in Atlanta to remember Senator Isakson on Jan. 6.",
  "image": "https://static01.nyt.com/images/2022/01/06/us/politics/06capitol-riot-Isakson-SWAP/merlin_200002176_9644cdd7-aec6-4119-9b44-03da9c838348-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/06/us/politics/johnny-isakson-senate-memorial.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1683,
    1765,
    2095,
    2493,
    428,
    571,
    2555,
    2586,
    2672,
    2959
  ],
  "sentences": [
    "Mr. Chambliss recalled that Mr. Isakson also quoted Mark Twain's advice to do the right thing, on the grounds that It will gratify some people and astonish the rest.?\nMr. Isakson held firm conservative beliefs, opposing the Affordable Care Act and gay marriage, but he also bucked the party's status quo at times, and he was not afraid to publicly criticize Mr. Trump.",
    "Along the way, he made numerous friends in both parties; Mr. Chambliss said that former Georgia Governor Roy Barnes, a Democrat, once quipped, If all Republicans were like Johnny Isakson, I would be a Republican.?\nThe pews were packed with friends and admirers from both parties, including Mr. Barnes.",
    "ATLANTA  On a day when Washington's partisan divide felt as deep as it has in decades, lawmakers from both parties gathered in an Atlanta church on Thursday to honor one of the U.S. Senate's great champions of bipartisanship, Johnny Isakson.",
    "Senator Saxby Chambliss, an old friend of Mr. Isakson's, also delivered remarks, noting that in his farewell speech to the Senate, Mr. Isakson said that he divided the world into two categories: friends and future friends.",
    "Senate majority leader Mitch McConnell, delivering words of remembrance, acknowledged that the funeral resonated in a spirit of comity that the Senate was once known for, but that has lately become more scarce.",
    "Mr. Isakson, a moderate Georgia Republican who once called bipartisanship a state of being,? was 76 when he died on Dec. 19, having retired prematurely from the Senate in 2019 because of health complications.",
    "In Washington on Thursday, most Republican legislators refused to take part in the commemorations of the Jan. 6 storming of the Capitol by supporters of former President Donald J. Trump.",
    "Among the attendees were Senator Ted Cruz, Republican of Texas, and Senator Raphael Warnock, the Democrat who was elected to Mr. Isakson's old Georgia seat last January.",
    "That, he said, was the date of an annual, Johnny Isakson barbecue lunch,? a social tradition that Mr. Isakson started and that lawmakers have continued in his absence.",
    "A folk duo underscored the tone with a rendition of Let There be Peace on Earth.? When they sang God Bless America,? the mourners stood up en masse.",
    "Brian Kemp and Secretary of State Brad Raffensperger, both of whom are facing tough primary challenges from pro-Trump challengers.",
    "But they came together at Peachtree Road United Methodist Church, in Atlanta's Buckhead neighborhood, to honor Mr. Isakson.",
    "I haven't seen this big of a bipartisan group of Senators together off the floor since September,? he said.",
    "The top statewide elected officials in attendance included Gov.",
    "He was battling Parkinson's disease.",
    "Former U.S."
  ]
}