{
  "id": 1678,
  "mediaId": 1164,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "In divisive primary fight, Georgia Gov. Brian Kemp wants to expand gun rights",
  "image": "https://cdnph.upi.com/svc/sv/upi/5801641394224/2022/1/29f481b5288a2c9ba81b92ab8e363ed6/In-divisive-primary-fight-Georgia-Gov-Brian-Kemp-wants-to-expand-gun-rights.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/01/05/Brian-Kemp-gun-rights-Georgia-David-Perdue-Stacy-Abrams/5801641394224/",
  "sentiment": "0.0",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clyde Hughes",
  "authorUrl": "https://www.upi.com/author/Clyde-Hughes/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Trump infamously lashed out at Kemp and Georgia's GOP Secretary of State Brad Raffensperger a year ago when they refused to acquiesce to his demands to overturn the state's election results for then-Democratic nominee Joe Biden.",
    "\"As her opponents run to dangerous extremes and fight desperately to salvage their political careers, [Abrams] is fighting for Georgians and their safety,\" Abrams campaign manager Lauren Groh-Wargo tweeted on Wednesday.",
    "\"In the face of rising violent crime across the country, law-abiding citizens should have their constitutional rights protected -- not undermined,\" Kemp said, according to the Atlanta Journal-Constitution.",
    "Kemp's position is a clear signal that he doesn't intend to be outdone by the Republican challenger on such a key policy issue that's consistently proven to be important among conservative voters.",
    "The gun rights issue is a bright line between the Republican candidates and Democratic hopeful Stacy Abrams -- who, by contrast, is calling for greater gun controls in Georgia.",
    "Perdue is attempting a comeback in the political arena after losing his Senate seat to Jon Ossoff a year ago, a defeat that helped Democrats take control of the upper chamber.",
    "Georgia's incumbent governor was planning to join gun rights advocates and members of the state General Assembly at an event in Smyrna to make the announcement.",
    "Jan. 5 (UPI) -- A volley of policy shots have been fired in Georgia's contentious Republican gubernatorial primary between incumbent Gov.",
    "\"And while this position has recently become popular for others as we enter the campaign season, my position has remained the same.\"",
    "Kemp says he's decided to endorse legislation to expand gun rights in Georgia, a move that Perdue has already promised.",
    "Kemp's legislation would expand the rights of Georgia residents to carry concealed weapons without a state permit.",
    "Brian Kemp and GOP challenger and former Sen. David Perdue -- on the issue of gun rights.",
    "Kemp's dig was directed at Perdue, who's been endorsed by former President Donald Trump.",
    "During that campaign, Perdue was criticized for refusing to debate Ossoff.",
    "Kemp had promised to support such legislation during his 2018 campaign.",
    "Kemp narrowly defeated Abrams in a close gubernatorial race in 2018.",
    "The announcement was scheduled to be made at a local gun shop.",
    "The Republican primaries are scheduled for May 24."
  ]
}