{
  "id": 1680,
  "mediaId": 19,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "Brian Kemp Plans to Ease Gun Laws in Georgia: Carry Permit' Should Be the Founding Document of Our Nation'",
  "image": "https://media.breitbart.com/media/2021/08/GettyImages-1232223914-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/01/05/brian-kemp-plans-to-ease-gun-laws-in-georgia-carry-permit-should-be-the-founding-document-of-our-nation/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Brian Kemp (R) is announcing on Wednesday his plans to pass constitutional carry legislation in Georgia by this spring, telling Breitbart News in an interview ahead of his announcement that the timing is right now to get it done.?\nKemp is joining several gun rights groups and members of the Georgia Assembly at Adventure Outdoors gun store in Smyrna on Wednesday morning to voice his intentions to sign a constitutional carry bill this legislative session, which begins next week and goes through the end of March.",
    "In a draft copy of his remarks for Wednesday obtained by Breitbart News, Kemp notes, For law-abiding Georgians, their carry permit is the founding document of our nation.?\nI look forward to working with members of the House and Senate and groups like the NRA [National Rifle Association] and Georgia Carry on legislation  some of which has already been filed  to get Constitutional Carry across the finish line this legislative session,? Kemp adds in the remarks.",
    "So, we had a very disruptive legislative process suspended for a long time, and when we came back, it was a very short session.?\nSo that was a lot of it,? Kemp said, adding that in addition to a derailed schedule, certain Republican legislators had anxiety? over loosened gun restrictions but that skyrocketing violent crime  particularly in Atlanta  has pushed said legislators to become more open to the idea.",
    "He's a pro-gun, pro-Second Amendment, pro-Constitution governor, and his leadership and being pro-gun since he's been elected will help carry this through the goal line.?\nKemp is facing former Sen. David Perdue (R-GA) in what is anticipated to be a heated Republican gubernatorial primary this year, and the former senator took a jab at Kemp on Monday upon learning of his new legislative plans.",
    "State Sen. Jeff Mullis (R- Chickamauga), the head of the Rules Committee who is one of the lawmakers introducing constitutional carry legislation next week, indicated Georgia Democrats are unified in opposing the Second Amendment effort, telling Breitbart News that unfortunately? he expects it to be a partisan vote? in the Republican-controlled assembly.",
    "We need to give our citizens the constitutional authority, which they have, to protect themselves, and that allows them to carry.?\nKemp, who has served as governor since 2019, campaigned heavily on the Second Amendment in 2018, when he ran against Democrat activist Stacey Abrams in a highly contentious gubernatorial race.",
    "I think their mindset has changed now just with the crime issues that you're seeing in places like Atlanta and cities around the country, where, quite honestly, local leaders haven't been stepping up to do something about it,? Kemp said.",
    "The then-candidate Kemp was met with a barrage of attacks from Democrats during the campaign after he released one ad in which he acted out the role of a protective father pointing a gun at a young man looking to date his daughter.",
    "Asked why constitutional carry  which is legal in 21 states and counting  is not law in Georgia, Kemp said, We've only had three sessions so far, and you know, almost two years of that was dealing with the global pandemic.",
    "Kemp said Abrams, a well-funded voting rights activist, is a scary prospect for Georgia, which is one of the reasons I'm working so hard to get reelected.?\nWrite to Ashley Oliver at aoliver@breitbart.com.",
    "I'm excited about that.?\nThe bill, if indeed it aligns with constitutional carry, would broadly permit Georgians to carry a firearm, open or concealed, without a permit.",
    "Although Georgians can purchase a firearm without a license, they currently need a license in some scenarios to carry one.",
    "Mullis also praised Kemp over the proposed plans, saying, A successful bill will [happen with] the leadership under Gov.",
    "That will set you back years and years and years, and I think we're gonna get it done this year.",
    "Whoever wins the primary will face Democrat Abrams, who is running for governor again this year.",
    "The last thing you want to do would be to try to get something like this done and have it fail.",
    "We all know that, despite what the left says,? Kemp said in a phone interview Tuesday.",
    "I'm glad Brian Kemp is answering my call for constitutional carry in Georgia.",
    "And so I just think the timing is right now to get it done.",
    "But real leaders lead from the start,? Perdue stated.",
    "The criminals are gonna get guns regardless.",
    "Follow her on Twitter at @asholiver.",
    "Kemp,? Mullis said.",
    "Gov."
  ]
}