{
  "id": 1692,
  "mediaId": 43,
  "date": "1/3/2022 12:00:00 AM",
  "headline": "'Sad day': Georgia GOP pushes through virtual ode to gerrymandering in new redistricting plan",
  "image": "https://images.dailykos.com/images/901286/story_image/GettyImages-1294458351.jpg?1609785609",
  "link": "https://www.dailykos.com/story/2022/1/3/2072437/--Sad-day-Georgia-GOP-pushes-through-virtual-ode-to-gerrymandering-in-new-redistricting-plan",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2425,
    2087,
    2087,
    2095,
    2376,
    2376,
    2425,
    2203,
    2240,
    2240,
    2203,
    2095,
    727,
    727,
    1326,
    1326,
    1147,
    1248,
    1248,
    1147,
    1026,
    1026,
    554,
    554,
    428,
    428,
    227,
    227,
    146,
    146,
    2537,
    2537,
    2538,
    2538,
    2672,
    2672,
    2934,
    2934,
    2976,
    2976
  ],
  "sentences": [
    "The advocacy organizations are requesting a three-judge panel, and they are asking the court to invalidate the new maps on the grounds that they violate the Fourteenth Amendment to the U.S. Constitution, which guarantees equal protection under the law, and Section 2 of the Voting Rights Act of 1965, which prohibits efforts to dilute the voting power of protected groups that have historically faced racial discrimination in voting.?\nThe majority party in Georgia purposely ignored the population growth of people of color and impermissibly used race to try to maintain control of Georgia's congressional delegation, as well as the entire General Assembly,? Ezra Rosenberg, co-director of the Voting Rights Project with the Lawyers' Committee for Civil Rights Under Law, said in an emailed media statement.",
    "Reverting to the strategies of the Jim Crow era, Georgia has employed the two classic tactics of gerrymandering to tilt the balance of electoral power to the White majority: cracking? (diluting the voting power of voters of color across many districts) and packing? (concentrating the voting power of voters of color in one district to reduce and dilute their voting power in other districts).",
    "They did their best to pack and dilute the minority community's growth in order to consolidate their power,? Gonzalez told Channel 2. We think that's an illegal use of race in the redistricting process.?\nGeorgia's population has increased by about 1 million people since 2010, and most of that growth has happened in Black and brown communities, the news station reported.",
    "I will continue to advocate for a non-partisan redistricting process and fair maps.?\nJerry Gonzalez, executive director of the Hispanic civic engagement nonprofit Galeo, launched one lawsuit with the Georgia State Conference of the NAACP, and the Georgia Coalition for the People's Agenda Thursday in the U.S. District Court for the Northern District of Georgia.",
    "Attorneys stated in the lawsuit:\nRather than draw this additional congressional district to allow Georgians of color the opportunity to elect their preferred candidates, the General Assembly instead chose to pack? some Black voters in the Atlanta metropolitan area and crack? other Black voters among rural-reaching, predominantly white districts.",
    "Attorneys stated in the lawsuit:\nIn the wake of the growth of communities of color in Georgia, which was reflected in the 2020 elections and the January 2021 Senate runoffs, the State of Georgia has drawn its Congressional and State legislative maps in violation of the U.S. Constitution and the Voting Rights Act.",
    "States cannot use race to achieve political ends  particularly when they do it at the expense of the voting rights of people of color.?\nIn another suit launched by Alpha Phi Alpha Fraternity, the organization is seeking a declaratory judgment and injunctive relief to block the new maps from going into effect.",
    "Attorneys stated in the suit:\nGeorgia's growing Black population could easily support over a half dozen new Black-majority State Senate and State House districts in areas whereBlack voters, despite voting cohesively, have previously been unable to elect candidates of their choice.",
    "Among the most controversial moves was making Carolyn Bordeaux's Gwinnett County 7th District seat safely Democratic by turning fellow Democrat Lucy McBath's neighboring 6th District into a Republican stronghold,? Channel 2 Action News reported.",
    "These redistricting techniques undermine the voting rights of Georgia's Black, Hispanic/Latino (Latinx?) and Asian American Pacific Islander(AAPI?) citizens, and deny them an equal opportunity to elect candidates of their choice.",
    "Three lawsuits have been launched against the state of Georgia since GOP legislators hacked congressional and legislative maps, disarming population growth in Black and brown communities with alleged gerrymandering.",
    "Thus, despite the tremendous growth of the State's Black population over the past decade, Black Georgians will have few new political opportunities in the State Senate and State House under the State's new maps.",
    "They couldn't file them, however, until Kemp actually signed the plans, creating a time crunch for the lawsuits to work their way through the courts before the state primary election in May, Channel 2 reported.",
    "Marc Elias, founder of the progressive site Democracy Docket, tweeted a list of states to watch for \"new voting rights, redistricting and pro-democracy litigation (in order of likelihood).\"",
    "And in yet another lawsuit, activists argued that an \"additional majority-Black district can be drawn without reducing the total number of districts in the region and statewide.\"",
    "Brian Kemp signed the new maps into law on Thursday, a month after the state legislature passed the plans and organizations readied the appropriate lawsuits in response.",
    "The bill also shifts heavily minority and Democratic sections of West Cobb County into conservative Marjorie Taylor Green's safely Republican 14th District.?\nGov.",
    "Instead, the State drew only a small handful of new Black-majority districts, mostly in areas that were already electingBlack-preferred candidates.",
    "That includes new Black-majority districts in areas around metro Atlanta, Augusta, Southwestern Georgia, and elsewhere across theState.",
    "South Carolina\n Marc E. Elias (@marceelias) January 2, 2022\nWhat are Republicans doing in your states to chip away at voting rights?",
    "It was unlawful and unconstitutional when the Democrats did it decades ago, and it is no less so when the Republicans do it today.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Bordeaux tweeted on Thursday: Today is a sad day for Georgia as Republicans have gerrymandered our state at every level.",
    "x\nStates to watch for new voting rights, redistricting and pro-democracy litigation (in order of likelihood)g\n1.",
    "Kemp is named as a defendant in the suit, as is Secretary of State Brad Raffensperger and the state of Georgia.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Raphael Warnock and Jon Ossoff on Jan. 4, 2021 in Hephzibah, Georgia.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "2, only beaten by Arizona and followed by New York.",
    "This is a short blurb about Daily Kos.",
    "But the State's maps do not do that.",
    "A launch party is held for now Sens.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "He listed Georgia as No.",
    "Daily Kos is different.",
    "New Hampshire\n5.",
    "Please read it.",
    "New York\n4.",
    "Missouri\n6.",
    "Arkansas\n7.",
    "Oklahoma\n8.",
    "Michigan\n9.",
    "Arizona\n2.",
    "Georgia\n3.",
    "Texas\n10."
  ]
}