{
  "id": 1709,
  "mediaId": 129,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "In Nebraska, a Trump-Inspired Candidate Cracks Open Divide in the G.O.P.",
  "image": "https://static01.nyt.com/images/2022/05/06/multimedia/06midterm-briefing-Nebraska-Herbster-01/06midterm-briefing-Nebraska-Herbster-01-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/07/us/politics/trump-endorsement-herbster-nebraska-midterms.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1909,
    1909,
    2136,
    2136,
    2146,
    2146,
    1147,
    1147,
    428,
    428,
    588,
    588,
    2954,
    2954,
    2816,
    2816
  ],
  "sentences": [
    "Anybody who the establishment cannot control, they are fearful of.?\nMr. Herbster, a longtime Trump ally who was with members of the Trump family during the Jan. 6, 2021, attack on the Capitol, is running against Jim Pillen, a University of Nebraska regent who is backed by the state's powerful Ricketts family political machine, and Brett Lindstrom, a youthful state senator who has consolidated support from the party's remaining moderates and Democrats.",
    "When you vote for Charles in the primary, you can give a stinging rebuke to the RINOs and sellouts and the losers who are so poorly representing your state.?\nLike Mr. Trump in the 2016 Republican presidential primary, Mr. Herbster is facing accusations that he has mistreated women and tried to use that fact to gain support.",
    "While Nebraska's Republican primaries are typically decided by conservative rural voters who are deeply loyal to Mr. Trump, Mr. Lindstrom, a wonky financial adviser, is betting his campaign on appealing to urban professionals around Omaha  where Mr. Trump lost one of the state's Electoral College votes to President Biden.",
    "It spent millions on a last-ditch effort to block Mr. Trump from winning the Republican presidential nomination in 2016; Trump then said the family better be careful.?\nMr. Ricketts, who tried talking Mr. Trump out of endorsing Mr. Herbster last year, is blunt about his opposition to Mr. Herbster's bid.",
    "His 90-minute stump speech is packed with complaints about illegal immigrants, stories boasting of his business triumphs, a conspiracy theory connecting China, the coronavirus pandemic and the 2020 election, and denials of the recent accusations that he's groped women at political events.",
    "Mr. Pillen, a 66-year-old former defensive back for the University of Nebraska's football team with a grandfatherly demeanor, promised to ban critical race theory at the University of Nebraska and bar transgender women from participating in women's sports or using women's bathrooms.",
    "He begins his speeches, whether to Trump-hatted supporters in Wahoo or bankers in the Omaha suburbs, by offering greetings from the 45th president of the United States of America, Donald J. Trump.?\nLike Mr. Trump, Mr. Herbster casts doubt on the legitimacy of American elections.",
    "In a state long known for genteel, collaborative politics and, for the last 24 years, one-party rule, Mr. Herbster's bid has cracked his party into three camps, with Trump supporters, establishment conservatives and business-friendly moderates battling for power.",
    "This is a proxy war between the entire Republican establishment in America against President Donald J. Trump,? Mr. Herbster, who campaigns wearing a white cowboy hat and a black vest bearing the logo of his cattle semen business, said in an interview Thursday.",
    "Allen Frederickson, the chief executive of a health care company who became a Republican to vote for Mr. Lindstrom, said electing Mr. Herbster would make it hard to recruit workers to Nebraska's booming economy, which has the nation's lowest unemployment rate.",
    "On Sunday, he traveled to Nebraska for a rally and appeared on a conference call for Herbster supporters Thursday night, where he cast Mr. Herbster's rivals as Republicans in name only.?\nCharles was a die-hard MAGA champion,? Mr. Trump said on the call.",
    "He called for ending the state's system of nonpartisan elections, eliminating the state board of education and said that, on his first day in office, he'd demand the tourism bureau change its quirky slogan: Nebraska.",
    "Because whether you like it or not, they didn't want Donald J. Trump to be president for two terms, that's exactly what happened.?\nMr. Herbster has little use for or interest in the traditions of Nebraska politics.",
    "That isn't really healthy.?\nAt a Wednesday fund-raiser for Mr. Lindstrom at an upscale Italian restaurant in Omaha, about half of the two dozen people interviewed said they voted for Mr. Biden in 2020.",
    "Honestly, it's not for everyone.?\nThe question Nebraska's Republican primary voters will settle on Tuesday is whether any of that matters  or matters more than Mr. Trump's stamp of approval.",
    "Both the Pillen and the Herbster campaigns have focused on national issues of which they have little control over and they should have been more focused on state issues,? said former Gov.",
    "He highlights cooperation with Democrats in Nebraska's unicameral legislature and, while he said he had no regrets about voting twice for Mr. Trump, said he'd prefer a new face? in 2024.",
    "A major donor for years to conservative candidates, Mr. Herbster has been abandoned by longtime political allies and seen his running mate quit his ticket to run for governor herself.",
    "Mr. Trump's endorsement of Mr. Herbster, a major donor to Mr. Trump's political career, isn't just the first-time candidate's top credential  it is his campaign's entire rationale.",
    "It was timed perfectly to make sure that they could rig the elections so Mark Zuckerberg could put $400 million into the toll the last four months of the election.",
    "Should Mr. Herbster win the Republican nomination, Mr. Ricketts will not endorse him unless he apologizes to the women he's done this to,? he said in an interview.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "He had no initiative or willingness to do that.?\nBut Mr. Herbster's message resonated with Trump conservatives, and soon one of his rivals followed suit.",
    "Some Republicans bristled at his focus on the sort of divisive cultural issues that don't typically dominate the political conservation in the state.",
    "We need Nebraska to be an appealing state from a business perspective.?\nMr. Herbster makes little effort to appeal outside of the Trump constituency.",
    "More than 8,000 Democrats have switched parties in recent weeks to have some influence on a governor's contest in an overwhelmingly Republican state.",
    "Mr. Herbster spent Friday stumping across western Nebraska with Steven Moore, the former Trump economic adviser who is a minor Trumpworld celebrity.",
    "He campaigns on eliminating sex education in Nebraska's public schools, cracking down on illegal immigration and curbing China's influence.",
    "Mr. Lindstrom, a 41-year-old state senator who also played football for Nebraska, is running a campaign transported from the pre-Trump era.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "He has repeatedly blamed the accusations on Mr. Ricketts, a conservative two-term incumbent who cannot run again because of term limits.",
    "In July, his running mate, the former state senator Theresa Thibodeau, quit the ticket and later jumped into the race herself.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    " In his run for governor of Nebraska, Charles W. Herbster is doing his best imitation of former President Donald J. Trump.",
    "If you want to lead the state, you should get your knowledge up on policies that affect our state,? she said on Thursday.",
    "The style and brand that's going on in the Republican Party right now has created a lot of wedges,? Mr. Lindstrom said.",
    "Ms. McGeachin has struggled to gain traction, and Mr. Trump hasn't mentioned her since his endorsement in November.",
    "Like his political role model  and chief backer  Mr. Herbster is proving to be a one-man political wrecking ball.",
    "But Mr. Trump's touch is looking less golden in other states, particularly in two-way contests for governor.",
    "Mr. Herbster is about to find out if a Trump endorsement alone is enough to win a major Republican primary.",
    "Two women, including a state senator, publicly accused him of groping them at a political event in 2019.",
    "Nebraskans, we like to figure things out and solve our own problems and think for ourselves,? he said.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "If Ohio's recent Senate primary is a guide, the three-way race is working in Mr. Herbster's favor.",
    "She said Mr. Herbster had little interest in anything other than trying to emulate Mr. Trump.",
    "Any allegation that was sent my way is 100 percent totally false,? he said in an interview.",
    "Polling in the final days before Tuesday's vote shows the race is a three-way dead heat.",
    "In Georgia, former Senator David Perdue, Mr. Trump's choice, is lagging far behind Gov.",
    "It's everything,? said former Representative Lee Terry of Omaha, a Herbster supporter.",
    "Dave Heineman, a Republican who was on Mr. Herbster's payroll after leaving office.",
    "Brian Kemp in polling, leading Mr. Trump to distance himself from that campaign.",
    "Mr. Herbster has denied the claims and broadcast a TV ad slamming his accuser.",
    "He even vows to clean up the swamp?  but he means Lincoln, the state capital.",
    "In Wahoo, he posited an outlandish theory about the former president's loss.",
    "Trumpism would impact our internal and external image as a state,? he said.",
    "A handful had switched parties to vote for Mr. Lindstrom in the primary.",
    "Pete Ricketts won the nomination with just over a quarter of the vote.)",
    "Behind all the drama is a question with resonance far beyond Nebraska.",
    "Vance, won in a crowded field, taking less than one-third of the vote.",
    "Mr. Trump's name is on Mr. Herbster's lawn signs, ads and billboards.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "The allegations of groping are coming from fellow Republicans.",
    "Mr. Herbster was facing criticism well before the allegations.",
    "Mr. Trump has thrown his full weight behind Mr. Herbster.",
    "Mr. Pillen downplayed Mr. Trump's influence in the race.",
    "He considers the groping allegations disqualifying.",
    "However, there are signs his control is loosening.",
    "In Idaho, the former president has backed Lt. Gov.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "The Ricketts family has feuded with Mr. Trump.",
    "The Trump-endorsed candidate for Senate, J.D.",
    "There's a lot of Trump people in Nebraska.?",
    "Janice McGeachin's challenge against Gov.",
    "(There's precedent for this in Nebraska.",
    "This is the truth,? he told supporters.",
    "He hasn't yet made an endorsement.",
    "The pandemic came from China.",
    "Eight years ago, Gov.",
    "Brad Little.",
    "WAHOO, Neb.",
    "."
  ]
}