{
  "id": 1710,
  "mediaId": 129,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Where Does the Anti-Abortion Movement Go After Roe?",
  "image": "https://static01.nyt.com/images/2022/05/07/us/07right-abortion03/merlin_200681340_8e79ca03-82dd-494e-ab31-93c4b72ec7ce-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/07/us/anti-abortion-movement-roe-v-wade.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1073,
    2095,
    2403,
    331,
    342,
    400,
    482,
    2945,
    2959
  ],
  "sentences": [
    "Mr. Pierce, of the Foundation to Abolish Abortion, the group behind the Louisiana bill that would punish women who end a pregnancy, said that the anti-abortion movement as a whole has treated Roe as the law of the land and has really just tried to regulate abortion like health care, or like an industry? instead of dealing with it like homicide.?\nMuch of the anti-abortion campaign's energy comes from a network of church ministries and small nonprofits that work directly with pregnant women, with the goal of making it possible for more women to choose options other than abortion.",
    "Another 22 percent say it depends.?\nWe are prepared to not only create a legal landscape to protect life at the federal and state levels, but also to support a culture of life,? said Kristen Waggoner, general counsel for the Alliance Defending Freedom, which supports Mississippi's ban at 15 weeks that led to the Supreme Court case that could overturn Roe.",
    "On Monday, before the leak, a coalition led by Students for Life Action told Republican members of Congress in a letter that abortion restrictions even at 12 weeks of pregnancy were not sufficient but that what ultimately mattered was whether the infant is a human being.?\nUltimately, abortion opponents' biggest goal extends beyond legislation.",
    "The movement has long been divided loosely into incrementalists, mainstream groups such as the Susan B. Anthony List and the National Right to Life Committee, that for years focused on gaining ground restriction by restriction, and absolutists, who saw anything less than the total elimination of abortion as failure.",
    "Thirty-four percent of Americans say abortion should be legal at 14 weeks of pregnancy  roughly the end of the first trimester  compared with 27 percent who say it should be illegal, according to a survey released Friday by the Pew Research Center.",
    "Criticism that such a decision could create a cultural revolution, potentially upending precedent protections for other issues, including contraception and same-sex and interracial marriage is hysteria and scaremongering,? Ms. Waggoner said.",
    "Brian Kemp in the Republican primary for governor, called for a special session to eliminate all of abortion? in the state, which already has an abortion ban at about six weeks on the books that would likely take effect if Roe is overturned.",
    "To see it in such stark terms has really galvanized people.?\nAcross the anti-abortion spectrum, everything is on the table, from instituting bans when fetal cardiac activity is detected, to pressing their case in Democratic strongholds.",
    "This moment is a convergence of both, with the court considering reversing Roe, and states like Texas and Oklahoma effectively banning abortion after about six weeks of pregnancy, before many women even realize they are pregnant.",
    "The sprawling anti-abortion grass-roots campaign is rapidly approaching an entirely new era, one in which abortion would no longer be a nationally protected right to overcome, but a decision to be legislated by individual states.",
    "If the fetus is a person, then we should protect them with the same homicide laws that protect born persons,? said Bradley Pierce, who helped draft the Louisiana legislation and leads the Foundation to Abolish Abortion.",
    "Then this week, the leaked draft of the Supreme Court opinion that would overturn the constitutional right to abortion revealed that anti-abortion activists' dream of a post-Roe America appeared poised to come to pass.",
    "Ms. Carroll, the spokeswoman for the Susan B. Anthony List, noted that there have not been sustained mass protests over other landmark Supreme Court rulings, on issues such as interracial marriage and contraception.",
    "Our ministry model has been a post-Roe ministry model from the beginning,? said Roland Warren, president and chief executive of Care Net, a network of more than 1,100 pregnancy resource centers across the country.",
    "Planned Parenthood Action Fund, NARAL Pro-Choice America and Emily's List announced Monday, hours before the leaked draft appeared, that they would spend a collective $150 million on the midterm election cycle.",
    "The reality of the leaked draft shocked casual supporters of abortion rights who weren't paying particularly close attention to the issue, or who had grown numb after decades of warnings about the end of Roe.",
    "We know they are inadequate, and we know they are not ready,? said Katrina Kimport, an associate professor with Advancing New Standards in Reproductive Health at the University of California, San Francisco.",
    "People just couldn't fathom losing a constitutional right that has been enshrined for nearly half a century,? said Kristin Ford, vice president of communications and research for NARAL Pro-Choice America.",
    "Lawmakers in Louisiana, however, advanced a bill on Wednesday that would classify abortion as homicide and make it possible for prosecutors to bring criminal cases against women who end a pregnancy.",
    "In 2019, the Trump administration offered a $1.7 million grant to a California-based network of facilities run by an anti-abortion nonprofit that sought to compete with Planned Parenthood.",
    "In Texas, Republican lawmakers assigned $100 million in their 2022-23 budget to a program called Alternatives to Abortion, which distributes funds to an array of anti-abortion nonprofits.",
    "Many activists talk about making abortion not merely illegal but unthinkable.?\nPublic opinion polls show that a majority of Americans say abortion should be legal in at least some cases.",
    "From Opinion: A Challenge to Roe v. Wade\nCommentary by Times Opinion writers and columnists on the Supreme Court's upcoming decision in Dobbs v. Jackson Women's Health Organization.",
    "The ruling struck down laws in many states that had barred abortion, declaring that they could not ban the procedure before the point at which a fetus can survive outside the womb.",
    "Now there are emerging disagreements on the moral and practical benefits of strategies like prosecuting pregnant women, and making it illegal to cross state lines for an abortion.",
    "We do.?\nThe Susan B. Anthony List, an anti-abortion political group, is planning a strategy involving state legislatures where it sees room to advance their cause or protect it.",
    "The court's opinion is not final, but the draft immediately shifted the horizon by raising a new question: If Roe is struck down, where does the anti-abortion movement go next?",
    "For the more mainstream campaigners, a post-Roe landscape would mean the anti-abortion fight will become even broader, clearing the path to expand further into state politics.",
    "There are some folks on the right saying they're just turning back to the states, when in fact it's very clear their agenda is much broader than that,? Ms. Ford of NARAL said.",
    "Jamelle Bouie: The leak proves that the Supreme Court is a political body, where horse-trading and influence campaigns are as much a part of the process as legal reasoning.",
    "For nearly half a century, the anti-abortion movement has propelled itself toward a goal that at times seemed impossible, even to true believers: overturning Roe v. Wade.",
    "Several prominent groups now say they would support a national abortion ban after as many as 15 weeks or as few as six, all lower than Roe's standard of around 23 or 24.",
    "Though many clients are grateful for things like free diapers and baby clothes, the scale of need far exceeds what the centers were able to provide for them,? she said.",
    "A vocal faction is talking about abortion abolition,? proposing legislation to outlaw abortion after conception, with few if any exceptions in cases of rape or incest.",
    "Both groups have been hoping to build support in Congress for a national abortion ban, even if it could take years, just as it did to gain momentum to undo Roe.",
    "It involved funding anti-abortion lobbying groups, praying and protesting outside clinics, and opening facilities to persuade women to keep their pregnancies.",
    "It also would present a test, as those who have long backed incremental change could clash with those who increasingly push to end legal abortion altogether.",
    "Abortion rights advocates are using the moment to re-energize their own supporters, organize protests and mobilize for midterm elections in November.",
    "Next week Democrats in the Senate are bringing a bill to codify abortion rights to a vote, but it is all but certain to be blocked by Republicans.",
    "That's what equal protection means.?\nA more prominent anti-abortion group, Louisiana Right to Life, however, opposes the bill for going too far.",
    "Other groups are planning a nationwide day of action? May 14, with marches in cities including New York, Washington, Chicago and Los Angeles.",
    "While many fighting for restrictions believe abortion to be murder, only a small fringe openly call for punishing a woman for procuring one.",
    "It is an effort to change broader American culture and get more people to see a fetus as a human person with an inherent right to life.",
    "For many activists, overturning Roe would mark what they see as not the end, but a new beginning to limit abortion access even further.",
    "Instead of just fighting for the right to pass pro-life laws, we will actually be able to pass and protect pro-life laws,? she said.",
    "Abortion-rights activists call the centers fake clinics? that mislead women about what they actually offer and stigmatize abortion.",
    "But the effort as a whole is only beginning to face the vast needs of pregnant women, from child care to health care to housing.",
    "In the third, it allowed states to ban abortions so long as exceptions were made to protect the life and health of the mother.",
    "Advocates on the left see the leaked draft laying out a playbook for a sweeping attempt to roll back other established rights.",
    "Justice Harry A. Blackmun, a modest Midwestern Republican and a defender of the right to abortion, wrote the majority opinion.",
    "They remembered Planned Parenthood v. Casey in 1992, when they hoped the court would overturn Roe and it ultimately did not.",
    "Many leaders are redoubling state efforts, where they've already had success, with an eye toward more restrictive measures.",
    "If a dog catches a car, it doesn't know what to do,? said Carol Tobias, president of the National Right to Life Committee.",
    "If Roe is overturned, anti-abortion activists will be free to pass legislation without having to work around Roe's limits.",
    "Those needs will only expand as women in states that ban abortion could be required to carry their pregnancies to term.",
    "Anti-abortion pregnancy centers typically provide free pregnancy tests, as well as pregnancy and parenting resources.",
    "The practice would likely be banned or restricted heavily in about half of them, but many would continue to allow it.",
    "This week, many anti-abortion leaders were wary of celebrating before the court's final ruling, expected this summer.",
    "That single-minded mission meant coming to Washington every January for the March for Life to mark Roe's anniversary.",
    "The Supreme Court draft opinion signals a new era for the 50-year effort to end the constitutional right to abortion.",
    "Abortion uniquely has sustained support and energy, as shown by the annual March for Life, abortion opponents said.",
    "Thirteen states have so-called trigger laws, which would immediately make abortion illegal if Roe were overturned.",
    "Some activists are prioritizing limiting medication abortion, which accounts for more than half of all abortions.",
    "The National Right to Life is trying to support its affiliates in every state as it looks to lobby lawmakers.",
    "Some centers offer services like ultrasounds and referrals to prenatal care, employment and other needs.",
    "It might mean overcoming one's own hesitation to provide procedures like second-trimester abortions.",
    "Patrick T. Brown: If Roe is overturned, those who worked toward that outcome will rightly celebrate.",
    "It required electing anti-abortion lawmakers and keeping the pressure on to pass state restrictions.",
    "Ms. Kimport, a sociologist, has studied pregnant women's experiences at pregnancy resource centers.",
    "Roe v. Wade created a framework to govern abortion regulation based on the trimesters of pregnancy.",
    "Jay Kaspian Kang: There is no clear path toward a legislative solution to protect abortion rights.",
    "Roe v. Wade is a landmark Supreme court decision that legalized abortion across the United States.",
    "It will be different work,? said Mallory Carroll, spokeswoman for the Susan B. Anthony List.",
    "But they said they have been preparing for this moment and its possibilities for decades.",
    "Many Republicans have repeatedly tried to enact a ban at about 20 weeks, without success.",
    "It's not just about abortion.?\nThe State of Roe v. Wade\nCard 1 of 4\nWhat is Roe v. Wade?",
    "Next goals include a national ban and, in some cases, classifying abortion as homicide.",
    "But anti-abortion activists say they see plenty of room for persuasion in the details.",
    "Individual states would be able to decide whether and when abortions would be legal.",
    "Critics say the centers are ill-prepared to serve as a meaningful social safety net.",
    "In 1992, the court tossed that framework, while affirming Roe's essential holding.",
    "Alison Block: Offering compassionate care is a core aspect of reproductive health.",
    "That point, known as fetal viability, was around 28 weeks when Roe was decided.",
    "Bret Stephens: Roe v. Wade was an ill-judged decision when it was handed down.",
    "But overturning it would do more to replicate its damage than to reverse it.",
    "This week in Georgia, former Senator David Perdue, who is challenging Gov.",
    "We're talking about prenatal vitamins and they don't have stable housing.?",
    "Polling also suggests most Americans are open to some restrictions.",
    "In the second, it allowed regulations to protect women's health.",
    "Today, most experts estimate it to be about 23 or 24 weeks.",
    "But a broader pro-family agenda should be their next goal.",
    "In the first trimester, it allowed almost no regulations.",
    "That's precisely why people need to take to the streets.",
    "The 7-2 ruling was announced on Jan. 22, 1973.",
    "What would happen if Roe were overturned?",
    "What else did the case do?",
    "What was the case about?"
  ]
}