{
  "id": 1711,
  "mediaId": 195,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Cruz to headline conservative political summit in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/cruzted_020922gn9_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3479927-cruz-to-headline-conservative-political-summit-in-georgia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    990,
    1646,
    1710,
    2012,
    2095,
    2338,
    428,
    2672
  ],
  "sentences": [
    "Our growing roster of speakers will surely inspire conservatives in Georgia and across America.?\nThe summit will also include political action workshops led by conservative strategists aimed at training participants to use technology and messaging to mobilize voters ahead of this year's midterm elections.",
    "From building a digital brand and winning school board races to crafting winning messages, the workshops will equip Americans with the tools they need to win big in The Peach State' this year and beyond,? the Truth and Courage PAC said of the summit.",
    "We're thrilled to have national leaders like Clay, Congressman Owens, and Congressman Roy join our growing list of speakers at the Together for Truth' summit this month in Atlanta,? Truth and Courage PAC Executive Director Christine Babcock said.",
    "Republicans are also gunning to take back the House and the Senate in November's elections, with Georgia Sen. Raphael Warnock (D) facing a difficult reelection fight in the state following his victory in a 2021 runoff election.",
    "On May 21, Cruz will speak along with Republican Reps. Chip Roy (Texas) and Burgess Owens (Utah) and conservative radio host Clay Travis at the one-day Together for Truth? summit hosted by the Truth and Courage PAC.",
    "The Together for Truth' summit will work with Georgia conservatives to mobilize their communities and ensure a big Red Wave this year.",
    "Brian Kemp (R) has a commanding lead in the polls as he faces off against Trump-endorsed former Sen. David Perdue (R-Ga.).",
    "Republican Sen. Ted Cruz (Texas) will be the special guest at a conservative political summit in Georgia later this month.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "A recent poll showed that Kemp received 59.4 percent support among respondents, while Perdue was at 21.5 percent.",
    "The event comes just days before Georgia's Republican gubernatorial primary on May 24.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Gov."
  ]
}