{
  "id": 1716,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Stacey Abrams Chances of Beating Republicans in Georgia, According to Polls",
  "image": "https://d.newsweek.com/en/full/2032640/stacey-abrams.webp?w=790&f=0add8311b5a6679c1026f474d4d2218d",
  "link": "https://www.newsweek.com/stacey-abrams-chances-beating-republicans-georgia-according-polls-1704205",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1147,
    1646,
    1951,
    2087,
    2095,
    4325,
    428,
    571,
    2672
  ],
  "sentences": [
    "Democratic activist and second-time gubernatorial candidate Stacey Abrams aims to build on the energy of President Joe Biden's 2020 win in Georgia to flip the governor's mansion blue, but polls suggest the former state House of Representatives minority leader still faces an uphill battle.",
    "\"Of course, having her [Abrams] I think might be better than having your existing governor, if you want to know the truth,\" the former president told supporters at a September rally before the Democrat had confirmed her plans to run.",
    "\"Right now we are joined at the hip to Donald Trump, who doesn't share the same interests,\" James Hall, a state Republican Party committee member from Savannah, told the Associated Press last October.",
    "But in 2018, Abrams lost to Brian Kemp, who is now the incumbent Republican governor, by a relatively narrow margin of just under 55,000 votesabout 1.4 percent of the total ballots cast.",
    "The conservative southern state also has a significant Republican lean, which polling analysis site FiveThirtyEight assesses as being plus 7.4 points in the GOP's favor.",
    "However, tensions within the Republican party between Kemp and Trump-backed former Senator David Perdue could potentially play out in the Democrats' favor as well.",
    "The former GOP senator had the backing of 49 percent of likely Georgian voters and the former Democratic state lawmaker had the support of 46 percent.",
    "Another poll carried out by Emerson College/The Hill earlier in April found the two Republican candidates with slightly wider leads over Abrams.",
    "The incumbent Republican was backed by 50 percent of Georgia's likely voters whereas the Democratic candidate was supported by just 45 percent.",
    "The RealClearPolitics average currently shows the incumbent governor leading the Trump-backed senator by more than 20 percentage points.",
    "Then, two years later in 2020, Democrats managed to flip Georgia blue not only for Biden, but also for both of the state's Senate seats.",
    "Notably, Trump's disdain for Kemp is so strong that he publicly said last year that he'd prefer Abrams over the incumbent Republican.",
    "A survey conducted by Survey USA/WXIA-TV Atlanta from April 22 to 27 found that Abrams trailed Kemp by 5 points among likely voters.",
    "Whether Abrams and Democrats can maintain the energy of 2020 and flip the governor's mansion to their control remains to be seen.",
    "Just under six months out, polls suggest that Republicans remain favored to win in the midterm race to be held on November 8.",
    "Biden's margin was narrow, however, with a little more than 12,000 votes putting him ahead of former President Donald Trump.",
    "Meanwhile, Abrams chances of winning appear slightly better against the former senator compared to the incumbent governor.",
    "Polls currently suggest that Kemp is favored to beat Perdue for the GOP's gubernatorial nomination in the May 24 primary.",
    "Despite Trump's strong endorsement, Perdue is currently trailing Kemp by double digits in every recent GOP primary poll.",
    "She was tied against Perdue, with both candidates receiving the support of 48 percent of registered Georgia voters.",
    "The poll surveyed 1,013 registered Georgia voters and had a margin of error of plus or minus 3 percentage points.",
    "A little more than 1,700 voters were surveyed and the margin of error was plus or minus 2.4 percentage points.",
    "With under three weeks until the primary is held, that's a commanding lead for any challenger to overcome.",
    "That survey had Kemp at 51 percent and Abrams at just 44 percenta 7 point advantage for the GOP incumbent.",
    "That survey found the Democratic contender to be trailing Kemp by just 2 points49 percent to 47 percent.",
    "That election marked the first time Georgia had gone for a Democratic presidential candidate since 1992.",
    "When facing off against Perdue, Abrams was down by only 3 pointswithin the poll's margin of error.",
    "Whether Trump's opposition to Kemp could ultimately help Abrams and Democrats remains to be seen.",
    "The poll surveyed 2,000 adults in Georgia and had a margin of error of 3.4 percentage points.",
    "Abrams looked best-positioned in a survey by Quinnipiac University conducted in January.",
    "Against Perdue, Abrams was down by 5 points49 percent to 44 percent.",
    "Georgia has not been led by a Democratic governor since 2003.",
    "However, some Georgia Republicans have raised concerns.",
    "\"Stacey, would you like to take his place?\"",
    "\"He wants to torpedo Brian Kemp.\"",
    "\"Might very well be better.\"",
    "\"It's OK with me.\"",
    "Trump asked."
  ]
}