{
  "id": 1732,
  "mediaId": 195,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "J.D. Vance's GOP primary victory in Ohio says little about Trump's endorsement power",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_trumpdonald-vancejd_042422_ap-joe-maiorana.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/opinion/campaign/3478059-j-d-vances-primary-victory-says-little-about-trumps-endorsement-power/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Aftergut",
  "authorUrl": "",
  "termIds": [
    781,
    819,
    946,
    1147,
    1801,
    2027,
    2087,
    2095,
    428,
    2845
  ],
  "sentences": [
    "In 1796, when America's first president chose not to seek a third term, his celebrated Farewell Address spoke to the potential corrosion of factional parties in a nascent democracy: The common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it.?\nOn Tuesday, we saw toxic factionalism on display in Ohio's Republican U.S. Senate primary.",
    "Vance began publicly subscribing to Trump's Big Lie,? telling Ohio voters a lot of us don't trust the results of the 2020 election.?\nFor those concerned that Trump got Vance the primary win, there is no cause for despair about November, but rather a reason to organize.",
    "For similar reasons, in neighboring Indiana's May 3 Republican primary, Trump did not endorse victorious incumbent Sen. Todd Young, who passionately supported certifying Joe Biden's election in a videoed encounter with pro-Trump protestors in January 2020.",
    "Ryan has campaigned on bringing revitalized manufacturing in the state, clean energy jobs, and rebuilding the middle class.?\nThose middle-of-the-road policy positions mirror the ones that helped Ohio Sen. Sherrod Brown win re-election in 2018.",
    "When the Club for Growth continued to attack Vance on Mandel's behalf, Trump reportedly had his assistant send the Club's president a text that said, Go f*^% yourself.?\nVance only decided to enter politics in mid-2021.",
    "That would be a positive sign for Americans who seek to discourage and restrain? what Washington called the common and continual mischiefs of the spirit of party? that lead so easily to extremism.",
    "Vance will be running with that endorsement against a far more centrist candidate, Democrat Tim Ryan, who has represented the state's 13th Congressional district for 19 years.",
    "Vance's primary win aside, the influence of a Trump endorsement seems to be shrinking, and it may well prove less useful in Ohio's general election than in Tuesday's primary.",
    "Polls show that Kemp will likely run away with a large outright majority of the vote despite Trump's relentless attacks for not helping him overturn Georgia's 2020 election.",
    "Matt Dolan, the Republican candidate who distanced from Trump and blamed his lack of leadership? for the Jan. 6 Capitol siege won nearly a quarter of the vote.",
    "Brown won 53 percent to 47 percent against Trump's endorsed candidate  even though Trump had won Ohio by 8 percent in both 2016 and 2020.",
    "Back in 2016, he had called Trump an idiot?  so Vance opportunistically groveled into Trump's good graces in search of his endorsement.",
    "First, take note that outside of Vance's win, Trump's endorsements and non-endorsements are not generally proving to be decisive.",
    "Presumably, Trump withheld his favor because DeWine is more centrist and has acknowledged publicly that Joe Biden is president.",
    "McGeachin gained notoriety by seizing the helm when Little was out of the state and, in his absence, banning mask mandates.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Brown's success in an Ohio Senate race bodes well for Ryan's election in November to the state's other Senate seat.",
    "Unlike Vance, Ryan won a resounding majority of votes in Tuesday's Democratic primary despite having two opponents.",
    "Further, a similar fate for Trump's gubernatorial candidates in Nebraska and Idaho may occur on May 10 and May 17.",
    "Notably, Trump's endorsement of former Georgia Sen. David Perdue in the May 24 primary race against incumbent Gov.",
    "Dennis Aftergut is a former federal prosecutor, currently of counsel to Lawyers Defending American Democracy.",
    "In those facts and others lie hope for the November election of a more moderate Senator, Democrat Tim Ryan.",
    "McGeachin's flagging prospects with Trump's endorsement bring us back to the general election in Ohio.",
    "Vance, while the powerful Republican economic group, the Club for Growth, backed rival Josh Mandel.",
    "Mike DeWine, and on Tuesday, DeWine won massively over the closest of his three opponents.",
    "Again, Young rolled to his primary win with no effect from Trump's lack of support.",
    "Eight women have accused Herbster of groping them; he denies the allegations.",
    "Janice McGeachin, appears to be faring poorly against incumbent Gov.",
    "For example, Trump declined to endorse centrist Ohio Republican Gov.",
    "That's because Vance won only a third of the vote in the primary.",
    "In Nebraska, Trump has endorsed candidate Charles W. Herbster.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Little rescinded her order as soon as he returned.",
    "Brian Kemp appears to be failing spectacularly.",
    "In Idaho, Trump's endorsed candidate, Lt. Gov.",
    "More on Ryan in a moment.",
    "Like McGeachin, J.D.",
    "Trump backed J.D.",
    "Brad Little.",
    "Gov.",
    "J.D."
  ]
}