{
  "id": 1737,
  "mediaId": 124,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "'Rogue governor' scenario spooks senators working to prevent stolen elections",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-05/220504-electoral-college-confirmation-mjf-1723-43e910.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/rogue-governor-scenario-spooks-senators-working-prevent-stolen-electio-rcna27373",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Edelman",
  "authorUrl": "https://www.nbcnews.com/author/adam-edelman-ncpn777046",
  "termIds": [
    2203,
    2203,
    687,
    687,
    1147,
    1147,
    1434,
    1434,
    1335,
    1335,
    1314,
    1314,
    2772,
    2772
  ],
  "sentences": [
    "If the election is close and will turn on the outcome of a handful of states, there are reasons to worry about this in the climate we're in now that partisan actors will seek to manipulate the outcome for partisan reasons, rather than adhering to the lawful outcome of the election,? said elections expert Rick Pildes, a New York University law professor.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nIn 2020, that worst-case scenario didn't come to pass because, even though Trump supporters submitted fake elector slates in seven states, governors in those states submitted the slate voters actually supported,? said Joanna Lydgate, the CEO of States United Action.",
    "Lawmakers and experts working to prevent stolen elections are sounding the alarm about a scenario they say is both worrisome and foreseeable in 2024 should Donald Trump run: swing-state governors beholden to the former president invoking arcane powers to throw the election his way.",
    "Such concerns have prompted a bipartisan group of senators to explore ways to address the rogue governor? scenario as part of their efforts to overhaul the Electoral Count Act, an 1887 law that gives governors an outsize role in determining presidential winners and losers.",
    "That's why we desperately need some clarification.?\nHouse Speaker Nancy Pelosi and Vice President Mike Pence officiate as a joint session of the House and the Senate convenes to count the Electoral College votes cast in the 2020 election on Jan. 6, 2021.J.",
    "Another possibility lawmakers are mulling would require states to establish before the general election exactly who is permitted to send a slate of electors to Congress, a senator said, speaking on condition of anonymity to discuss private negotiations.",
    "But if a governor goes rogue in the way that is being contemplated, you get to this very convoluted provision of the statute,? said an expert on the Electoral Count Act, Edward Foley, a professor at the Moritz College of Law at Ohio State University.",
    "Scott Applewhite / AP file\nFor example, governors who decide that the elections in their states were rife with fraud and that the losing candidate should be declared the winner could submit slates of electors pledging to back that candidate.",
    "In Georgia and Arizona, the Trump-endorsed gubernatorial candidates have said they wouldn't have certified the slates of electors pledged to Biden in 2020, suggesting they could take the same approach in 2024 under similar circumstances.",
    "Kemp did was the right thing.?\nThen there are the Republicans running for governor in Wisconsin, including front-runner Rebecca Kleefisch, who have all pledged to eliminate the bipartisan agency that runs elections in the state.",
    "While lawmakers haven't reached an agreement on amending the statute, experts warn that 2020 was a wakeup call for how the law could be exploited in ways that might prevent the rightful victor from occupying the White House.",
    "Another route available to a governor is to submit a slate of electors pledged to the candidate who lost while another state official  perhaps the secretary of state  submits a slate pledged to the winning candidate.",
    "Senate Democrats previously tried to pass a sweeping voting rights package, but the effort collapsed in January when they couldn't attract enough Republican voters to defeat a GOP filibuster.",
    "In 2020, dozens of people from five swing states that President Joe Biden won signed documents purporting to be duly elected and qualified\" electors and declaring that Trump was the victor.",
    "Sen. Mitt Romney, R-Utah, who is also part of the bipartisan group, said in an interview: I think our Democrat friends would like to include other elements on election reforms generally.",
    "What if Mike Pence had made a different call?? said Sen. Angus King, an independent from Maine who caucuses with the Democrats and has been working to overhaul the Electoral Count Act.",
    "One of the options the bipartisan group of senators working to update the Electoral Count Act is considering is to give the courts the final say over which slate of electors is valid.",
    "Dismantling the Wisconsin Elections Commission would require the Legislature, currently controlled by Republicans, to pass legislation that is then signed into law by the governor.",
    "At least 53 people who deny the 2020 election results are running for governor in 25 states, according to States United Action, a nonpartisan group that tracks gubernatorial races.",
    "The risks are grounded in reality: The last presidential election illuminated how governors could be able to exploit ambiguities in the law to ensure a favored candidate succeeds.",
    "Many Republican candidates up and down the ballot covet Trump's endorsement  one that may well hinge on whether they amplify his baseless claim that the 2020 election was stolen.",
    "The power governors hold is of particular concern, experts and lawmakers say, given how many Trump allies who insist he won in 2020 are now candidates in crucial swing states.",
    "(In two other states, New Mexico and Pennsylvania, the documents included caveats saying their legitimacy depended on whether Trump was ultimately found to be the winner.)",
    "Under the Electoral Count Act, if either the House or the Senate upholds the governor's submission, those votes would count toward the final Electoral College tally.",
    "That's the scenario that could be decisive.?\nIn a close election, such a turn of events could nullify the voters' choice and hand a victory to the losing candidate.",
    "Without reform of the Electoral Count Act, however, governors could still pursue various avenues to subvert the popular will in a presidential race, experts said.",
    "That didn't happen in 2020, largely because no governor approved a rival slate and Vice President Mike Pence, presiding over the count, refused to validate them.",
    "As yet there is no consensus among senators about how best to prevent a governor from skewing the vote in favor of a candidate other than the rightful winner.",
    "The Electoral Count Act stipulates that the House and the Senate would need to vote on the dueling slates; if they split, the tie would favor the governor.",
    "Governors loyal to Trump could proclaim him the winner in their states two years from now because of how the Electoral Count Act is written, experts warn.",
    "The thinking is that the courts, both federal and state, are less partisan than governors and Congress  and less inclined to bow to political pressure.",
    "If a governor recognized what critics call fake? electors as legitimate, Congress would be obliged to count them under several conceivable scenarios.",
    "Of particular concern to election experts, however, are races this year in the handful of states where Biden won by slim margins in November 2020.",
    "In my view, that should go to the courts,? Susan Collins, R-Maine, one of the senators involved in the bipartisan talks, said in an interview.",
    "Doing so might ultimately hand the final say over certifying election results to the governor, the secretary of state or the Legislature.",
    "Republicans say one obstacle has been Democrats' insistence on using Electoral Count Act changes to seek to expand broader voting rights.",
    "The House committee investigating the Jan. 6 riot is examining how the alternate electors fit into efforts to overturn Biden's victory.",
    "Brian Kemp, like Secretary of State Brad Raffensperger, rebuffed Trump's demands to interfere with the election results.",
    "That way, states wouldn't send competing slates of electors and create confusion about which one should be tossed out.",
    "Kleefisch has also said she would favor putting election oversight in the hands of an elected state official.",
    "That provision is known as the governor's tiebreaker.?\nThe governor is supposed to follow the law.",
    "The campaigns for Perdue and Lake didn't respond to questions and requests for comment.",
    "What happens if a governor submits a slate that does not reflect the popular vote?",
    "That's a very heavy lift, and we'd lose almost all of the Republican support.?",
    "In that situation, Congress would be faced with competing slates of electors.",
    "They include Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin.",
    "Trump later endorsed David Perdue to challenge Kemp; the primary is May 24.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Georgia is a perfect example,? said King, the senator from Maine.",
    "Doug Ducey resisted similar pressure, Trump endorsed Kari Lake.",
    "A spokesman for Trump didn't respond to a request for comment.",
    "Ducey is term-limited from running again this year.",
    "We would have been in constitutional no-man's land.",
    "Kemp did in 2020,? King said in an interview.",
    "Perdue said he wouldn't have done what Gov.",
    "In Georgia, Republican Gov.",
    "In Arizona, where GOP Gov.",
    "And what Gov."
  ]
}