{
  "id": 1743,
  "mediaId": 1576,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Stacey Abrams is asking people to donate to abortion funds, not just her campaign",
  "image": "https://www.wabe.org/app/uploads/2022/04/AP22101742010232-336x189.jpg",
  "link": "https://www.wabe.org/stacey-abrams-is-asking-people-to-donate-to-abortion-funds-not-just-her-campaign/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1951,
    2095,
    146,
    331,
    401,
    428,
    482,
    2672
  ],
  "sentences": [
    "Abrams  who helped turn Georgia blue in the 2020 presidential election after narrowly losing her last governor's race in 2018  is continuing to solicit donations for the Feminist Women's Health Center, SisterSong, Planned Parenthood Southeast, Access Reproductive Care Southeast and NARAL Pro-Choice Georgia.",
    "We can only win this fight by uniting and doing the work together.?\nIn a tweet later that night, Abrams thanked the more than 187,000 supporters who have invested in her campaign so far and urged them to consider donating to the reproductive freedom organizations as well.",
    "Both Abrams and Kemp's Republican opponent, former U.S. senator David Perdue, sued over the committee on the grounds that it was unfair for him to be able to collect large sums while the two of them were barred from doing so until after their party primaries.",
    "Democrats are hoping the issue will energize their voters, while, at the Republican debate for lieutenant governor, candidates were asked if they were satisfied with the state's existing abortion restrictions  and all said they want to ban the procedure.",
    "Abrams told the AJC that her campaign would absolutely lean into and lead on that issue.?\nIf I want to be the governor of one Georgia, that means I've got to govern for the women of Georgia,? she said.",
    "As the AP explains, Kemp sought to use a leadership committee  a state fundraising vehicle that allowed him to collect unlimited contributions and coordinate spending with his campaign.",
    "Kemp raised $2.7 million during this same period, limited by a state law that prohibits sitting officeholders from accepting contributions while state lawmakers are meeting.",
    "We know that no one individual, campaign or organization can guarantee reproductive choice on their own,? Abrams' campaign wrote in a fundraising email.",
    "Stacey Abrams, Georgia's Democratic gubernatorial candidate, briefly pivoted her fundraising efforts in light of the leaked Supreme Court draft opinion.",
    "The Atlanta Journal-Constitutionalso notes that The Fair Fight Action political organization she founded has raised more than $100 million since 2019.",
    "Abrams, who is running unopposed in the May 24 Democratic primary, has raised large sums of money for causes as well as her own candidacy.",
    "Her campaign announced on Wednesday that it had raised $11.7 million in the three months ending April 30, the Associated Press reports.",
    "And the women of Georgia by and large agree that their right to choose should not be stripped away from them.?\nCopyright 2022 NPR.",
    "The draft opinion is having an impact across the state's May 24 primary races, WABE reporter Sam Gringlas told Morning Edition.",
    "On Wednesday she asked her supporters to donate not to her campaign, but to abortion-rights groups working in the state.",
    "The voting rights organization made several $10,000 contributions to abortion rights groups on Wednesday as well.",
    "She said she has more than $8 million cash on hand, a smaller sum than that reported by Republican Gov.",
    "Brian Kemp, who is running for reelection.",
    "To see more, visit https://www.npr.org."
  ]
}