{
  "id": 1744,
  "mediaId": 43,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Don't look now, but Stacey Abrams is mowing down Gov. Kemp's financial lead",
  "image": "https://images.dailykos.com/images/1050921/story_image/GettyImages-1134724462.jpg?1647888626",
  "link": "https://www.dailykos.com/story/2022/5/5/2096078/-Don-t-look-now-but-Stacey-Abrams-is-mowing-down-Gov-Kemp-s-financial-lead",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    1136,
    1646,
    1951,
    2095,
    146,
    401,
    571,
    2672
  ],
  "sentences": [
    "But, just as the state enters midterms, and after a leaked draft of the U.S. Supreme Court opinion to overturn Roe v. Wade, according to The Washington Post, the Abrams camp temporarily paused fundraising, and instead began raising money for pro-choice groups in the stateThe Feminist Women's Health Center, SisterSong, ARC Southeast, Planned Parenthood Southeast, and others.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy progressives must build state power, with Gaby Goldstein\nThe Downballot\nFollowShare\n0:0055:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nAccording to the Associated Press, Kemp has reported $10.7 million in cash on hand, down from $12.7 million as of Jan. 31.",
    "Meanwhile, in the Sen. Raphael Warnock battle against the assumed GOP nominee and COVID-spray salesman, Herschel Walker in November, in mid-April, the AJC reported that Warnock broke records as he collected $13.6 million in the first quarter of 2022.",
    "This is a terrifying time for our nation.?\nCo-founder of Sister District, Gaby Goldstein, joins The Downballot to discuss what Democrats in the states are doing to protect abortion rights\nx\nx\nYou need to enable JavaScript to run this app.",
    "Kemp, files suit to use law he signed for himself in her favor\nThis moment demands action, so I will be blunt: The abomination of that leaked opinion is coming to find every one of us,? Abrams wrote in a campaign email.",
    "In late April, a federal judge ruled in favor of Abrams to block Georgians First, Kemp's leadership committee, from raising unlimited money for him until he became the official GOP nominee on May 24.",
    "Perdue hasn't released his financial records, but according to AJC, his last report ended with an underwhelming $1 million in the bank, despite backing from former President Trump.",
    "According to the Atlanta Journal-Constitution, Democratic powerhouse Stacey Abrams, even with a late start entering the race, is nipping at the heels of Gov.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Between February and April, Abrams raised $11.7 million, collecting contributions from over 187,000 donors, the AJC reports.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The rule applies equally to Abrams; until the primary is over she is unable to raise money from her leadership committee.",
    "Abrams has spent over $9 million in TV, radio, and digital ads in the last five months, AJC reports.",
    "Gubernatorial candidate Stacey Abrams\nThings are looking pretty good in the Georgia governor's race.",
    "Kemp's had to spend big in the battle against Sen. David Perdue and his other Republican rivals.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "And at the end of the reporting period, she claimed over $8 million in the bank.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Walker ended 2021 with around $5 million in the bank.",
    "Brian Kemp when it comes to campaign contributions.",
    "RELATED STORY: Stacey Abrams turns tables on Gov.",
    "And particularly those of color or low-income.",
    "Women in Georgia and across this country.",
    "This is a short blurb about Daily Kos.",
    "Donate $25\n\nDonate $10 monthly",
    "LGBTQ+ and disabled people.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Please read it."
  ]
}