{
  "id": 1745,
  "mediaId": 43,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "GA SOS Raffensperger Flirts With Trump Propagandists in Reelection Campaign, by Steven Rosenfeld",
  "image": "",
  "link": "https://www.dailykos.com/story/2022/5/5/2096074/-GA-SOS-Raffensperger-Flirts-With-Trump-Propagandists-in-Reelection-Campaign-by-Steven-Rosenfeld",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Rosenfeld",
  "authorUrl": "",
  "termIds": [
    1147,
    1576,
    2095,
    2203,
    2279,
    182,
    215,
    428,
    501,
    535,
    2672
  ],
  "sentences": [
    "That is illegal.?\nLast fall, when True the Vote presented these allegations to state officials, D. Victor Reynolds, the Georgia Bureau of Investigation director, wrote back saying his agency had reviewed the allegations, consulted with the FBI, and concluded that based on what has been provided and what has not been provided, an investigation is not justified.?\nWhat has not been provided is any other kind of evidence that ties these cell phones to ballot harvesting; for example, there are no statements of witnesses and no names of any potential defendants to interview,? Reynolds' letter said.",
    "Don't rely on any kind of mail-in balloting.?\nOn May 3, the Associated Press published its fact-check report on 2000 Mules,? finding the film's research and claims were based on faulty assumptions, anonymous accounts and improper analysis of cell phone location data, which is not precise enough to confirm that somebody deposited a ballot into a drop box, according to experts.?\nIn other words, the propaganda put forth by the latest pro-Trump movie is not relevant to Georgia's 2022 voting options, as the state's Republicans have already impeded absentee voting.",
    "And the right-wing filmmakers have expanded their allegations, claiming that a network' of non-governmental organizations worked together to facilitate a ballot trafficking scheme in Georgia? that was based out of 10 hubs? in metro Atlanta, according to an April 21 subpoena by the State Elections Board to True the Vote founder Catherine Englebrecht to testify on May 26two days after the state's 2022 primaryand present her evidence.",
    "She replied, Maybe a few percentage points of your population needs to vote legitimately by mail because, certainly, we don't want to see anyone deprived But that tips over into an indefinitely confined list and it becomes theater of the absurd.?\nOther Ways to Vote\nThe Atlanta NAACP's McClendon said that it is the 2020 election deniers who are putting forth political smears that have no basis in reality.",
    "In Georgia, for example, you can give your ballot [to another person to return]but only to a family member, or, if you are in a nursing home, to a caregiver to drop it off What we have here is left-wing nonprofit organizations operating as vote stash houses, accumulating vast numbers of ballots, and then hiring paid political operatives called mules to deliver them.",
    "Raffensperger, who knows what factually occurred during the election, has endorsed a new investigation by the State Elections Board into specious allegations that thousands of mailed-out 2020 ballots had been illegally collected in metro Atlanta by dozens of workers hired by left-leaning nonprofit groups whose leadership supported Joe Biden's candidacy.",
    "While it is standard for Georgia's secretary of state to open investigations after receiving complaints, Raffensperger's revisionism appears to cede ground to a primary challenger, Rep. Jody Hice, R-GA, who, like many Republicans across the country, has built his primary campaign on attacking the 2020 presidential results and has been endorsed by Trump.",
    "The allegations, which are not new, and which the Georgia Bureau of Investigation (GBI) and FBI examined last fall and declined to investigate, are at the core of an inflammatory new movie, 2000 Mules,? made by right-wing provocateur Dinesh D'Souza and a right-wing voter vigilante group, True the Vote, which is now being promoted in pro-Trump circles.",
    "These people who used to be genuine conservatives are now part of the cult when they know better.?\nI do believe that a lot of people respected Raffensperger for having a little integrity and a backbone and standing up and telling the truth that there was no fraud,? said Helen Butler, executive director of the Georgia Coalition for the People's Agenda.",
    "True the Vote is known for making outsized allegations based on shoddy methodology and withholding evidence to support its claims, including its Georgia-based assertion made last fall that it had analyzed cell phone-tracking data and video footage, and had identified 279 people who made repeated trips to ballot drop boxes in 2020's general election.",
    "Georgia Republican Secretary of State Brad Raffensperger, who in November 2020 refused Donald Trump's demand to find? the votes for the ex-president to win the state and vigorously defended the accuracy of Georgia's results and recounts, is being bent to the will? of 2020 election deniers as his May 24 primary approaches, civil rights advocates say.",
    "They don't bring them to drop boxes Those people are nursing home attendants and family members.?\nMcClendon said that the new allegations by the Trump propagandists and the responses by the State Elections Board and Raffensperger lending credence to their claimsallegations that the GBI and FBI already rejectedwere ugly but not unexpected.",
    "Despite repeated requests that source has not been provided to either the GBI or to the FBI.?\nBut now that the movie, 2000 Mules,? is poised to debut in 270 theaters across the country, the filmmakers are trumpeting interview footagewhich they claim is realof a paid ballot trafficker explaining the ballot delivery operation.",
    "And to veer away from that is just playing politics and not really being truthful with voters.?\nTrue the Vote\nTrue the Vote is a Texas-based voter vigilante organization that grew out of the Tea Party and has been promoting the myth of voter fraud since the early years of Barack Obama's presidency.",
    "When Englebrecht testified about the same allegedly illegal ballot trafficking scheme before Wisconsin's legislature in late March, Democratic legislators replied that she was overclaimingreplying that Englebrecht may not like mailed-out ballots, but that did not mean illegal voting occurred.",
    "It's unbelievable to me, the depths to which they will go with these lies, and that they can gain traction with no evidence,? said McClendon, who led a field operation in 2020 that spanned 17 counties where 75 percent of Georgia's Black voters live and involved nonprofit civic groups.",
    "The only ones that should touch a ballot are the voter and the election official,? Raffensperger said on Facebook on May 2, as he reposted an Atlanta Journal-Constitution report on the Georgia State Elections Board launching an investigation into possible illegal ballot collection.",
    "Despite earning media coverage, it failed to deliver on its claimsin part because illegal voting is exceptionally rare, and when it occurs it is usually a result of an individual's error and not a partisan conspiracy.",
    "But he said that there was little more that Georgia's Republicans could do to impede voting with mailed-out ballots in 2022, because the state's red-run government has passed laws making that option inconvenient.",
    "He has reported for National Public Radio, Marketplace, and Christian Science Monitor Radio, as well as a wide range of progressive publications including Salon, AlterNet, the American Prospect, and many others.",
    "Our game plan has already beenand this is part of our text-banking that started last weekendto tell all of our people, if you are physically able, you need to early vote starting May 2,? he said.",
    "However, in today's era of social media-driven disinformation, it has found new audiences, including Trump, who played the trailer to 2000 Mules? at an Ohio rally in late April.",
    "Initially, the group sought to train poll watchers to confront what its founders, predominantly white conservatives, believed were illegal votes by people of color.",
    "Under Georgia law, only voters, their immediate family members, and the caregivers of voters with disabilities are allowed to handle and return mailed-out ballots.",
    "We're going to find out who they are and where they live, were they paid, and how much were they paid,? Raffensperger said during an April 23 debate.",
    "For example, metro Atlanta's most populous county, Fulton County, can deploy fewer than 10 drop boxes across the entire jurisdiction, McClendon said.",
    "Raffensperger certainly knows that reality, as well as the fact that his state's 2020 presidential results and recounts were accurate.",
    "And now he is being bent to the will of these conspiracists,? said Ray McClendon, Atlanta NAACP political action committee chairman.",
    "The key distinction to make here is between ballot harvesting and ballot trafficking,? D'Souza told Chicago's AM 560 talk radio.",
    "As a result, the NAACP and other groups seeking to turn out primary voters were encouraging people to vote early and in person.",
    "Steven Rosenfeld is the editor and chief correspondent of Voting Booth, a project of the Independent Media Institute.",
    "They [True the Vote] need to provide us [the board] the names of those people that they say harvested the ballots.",
    "Raffensperger's last-minute validation of True the Vote's allegations is troubling to voting rights advocates.",
    "By Steven Rosenfeld\nThis article was produced by Voting Booth, a project of the Independent Media Institute.",
    "A principled conservative who rejected demands in 2020 to find votes? is now singing a very different tune.",
    "True the Vote filed lawsuits that were ridiculed by Republican judges and senior election officials.",
    "Brian Kemp instituted an overly bureaucratic absentee ballot application and return process.",
    "Saliently, it has been stated that there is a source' that can validate ballot harvesting.",
    "We will continue investigating every credible allegation of ballot harvesting in Georgia.",
    "Under SB 202, a massive election bill passed last year, the Georgia legislature and Gov.",
    "And that's what makes his last-minute embrace of 2020 election denial claims disturbing.",
    "People should tell the truth, stick with the truth, and leave it at that,? said Butler.",
    "I don't know any groups that have done, quote-unquote, [ballot] harvesting,? he said.",
    "Raffensperger, whether you like him or not, still followed the rule of law [in 2020].",
    "It also made returning mailed-out ballots less convenient by restricting drop boxes.",
    "I know people that have delivered valid ballots to the county registrar's office.",
    "We haven't done anything like what they are alleging."
  ]
}