{
  "id": 1746,
  "mediaId": 43,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Morning Digest: How an unknown QAnon candidate shocked the Ohio GOP establishment on Tuesday night",
  "image": "https://images.dailykos.com/images/1066064/story_image/179996480_134107692066653_2323165852159179620_n.jpg?1651705325",
  "link": "https://www.dailykos.com/story/2022/5/5/2095941/-Morning-Digest-How-an-unknown-QAnon-candidate-shocked-the-Ohio-GOP-establishment-on-Tuesday-night",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2502,
    2502,
    1885,
    1885,
    1447,
    1447,
    1755,
    1755,
    146,
    146,
    428,
    428,
    414,
    414,
    379,
    379,
    2845,
    2845,
    2935,
    2935
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy progressives must build state power, with Gaby Goldstein\nThe Downballot\nFollowShare\n0:0055:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? OH-09: Tuesday's night's biggest surprise came in Ohio's newly gerrymandered 9th Congressional District, when J.R. Majewski, a QAnon-aligned activist who attended the Jan. 6 Trump rally that preceded the attack on the Capitol, defeated two Republican state legislators to win the nod to take on 20-term Democratic Rep. Marcy Kaptur.",
    "While the incumbent, whose 2020 pandemic measures infuriated ultra conservatives, failed to take a majority of the vote, Renacci and Blystone each proved to be weak contenders: Renacci, just like in his failed 2018 bid against Democratic Sen. Sherrod Brown, poured millions into his campaign but didn't spend much of it on ads, while The Columbus Dispatch says Blystone ran an operation that was \"messy with high turnover among volunteer staff and incomplete campaign finance reports.\"",
    "? DGA: The Democratic Governors Association has booked a total of $75 million in fall TV time to defend Democratic incumbents in seven states:\nColorado: $5 million\nMaine: $5 million\nMichigan: $23 million\nMinnesota: $4.5 million\nNevada: $10 million\nNew Mexico: $2.5 million\nWisconsin: $21 million\nThe DGA's counterparts at the RGA announced its first round of reservations about two months ago.",
    "Senate\n? AL-Sen: Republican Rep. Mo Brooks' latest ad ahead of the May 24 primary features audio of the 2017 shooting attack on a GOP congressional baseball practice event, where Brooks was present and Republican Rep. Steve Scalise along with several others were seriously injured in the shooting, to claim he was the top target of the \"leftist gunman.\"",
    "The Downballot hosts Gaby Goldstein, the co-founder of Sister District, to discuss what Democrats in the states are doing to protect abortion rights; how her organization helps connect volunteers with worthy legislative candidates across the country; and the advice she's giving campaigns on how to succeed in a difficult political environment.",
    "The Trump administration implemented Title 42 in March 2020 to enable immigration officials to quickly deport asylum-seekers, even those with valid asylum claims, to Mexico in the name of preventing COVID-19 outbreaks at border detention centers, though Trump officials had reportedly wanted to implement it even before the pandemic began.",
    "Gilbert will be going up against Democratic state Rep. Emilia Sykes, who had no primary opposition, in what will likely be one of the fall's most competitive House races: This seat in the southern suburbs of Akron and Cleveland, which is a radically reconfigured mashup of five old districts, would have supported Biden by a close 51-48.",
    "Biden would have carried this northwestern Indiana seat, which only changed minimally in redistricting, 53-45.\n? IN-09: Former state Sen. Erin Houchin defeated former Rep. Mike Sodrel 37-26 in the primary to succeed their fellow Republican, retiring incumbent Trey Hollingsworth, in this dark-red constituency in south-central Indiana.",
    "The Biden administration has subsequently moved to revoke the policy later this month now that the pandemic is no longer as dire a threat and once again allow those seeking asylum to remain in the country while officials determine whether they qualify for asylum, which Republicans have fixated on to attack Democrats.",
    "Turner responded to her latest defeat by expressing interest in running for president as an independent in 2024.\n? OH-13: Attorney Madison Gesiotto Gilbert, who has Donald Trump's endorsement, earned the Republican nod for this open seat by defeating underfunded opponent Gregory Wheeler by a 29-23 margin.",
    "? OR-05: Center Forward, a super PAC that's funded by the pharmaceutical industry, has deployed another $650,000 opposing attorney Jamie McLeod-Skinner ahead of her May 17 Democratic primary against incumbent Kurt Schrader, which brings its total spending here to just over $1 million.",
    "Former Republican Rep. Tom Campbell decisively flipped Mineta's seat, now numbered the 15th District, in a special election; Mike Honda, who had also been detained during World War II, retook the constituency for Democrats 2000 when Campbell left to unsuccessfully run for the Senate.",
    "He also successfully passed the Civil Liberties Act of 1988, which provided $20,000 to each surviving internee and apologized for their detention, and he stood out as one of the rare members of Congress to support same-sex marriage at a time when it was deeply unpopular nationwide.",
    "The Philadelphia Inquirer reports that the group is spending about $1 million in the Pittsburgh media market on a commercial accusing White of \"defending a massive tax hike\" when he served on the Delaware County Council \"even though taxes had already gone up by more than 12%.\"",
    "The region the 13th was based in, which had recently been christened Silicon Valley, was Republican-friendly turf at the time, but Mineta's popularity and the national GOP's woes following the Watergate scandal gave him a huge advantage over former Assemblyman George Milias.",
    "And while Majewski, unlike his two foes, doesn't appear to have run TV commercials, he did still generate attention with an online video in which he told his audience he'd \"do whatever it takes to return this country back to its former glory\" just before cocking a rifle.",
    "Ohio Republican J.R. Majewski\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "However, Sommer reports, Majewski has continued to associate with Paine: In February, Majewski told Paine that he was willing to fight Democrats in a \"civil war\" (as Sommer put it) and even invited Paine to host a November victory party for him less than two weeks ago.",
    "Mineta was re-elected two years later 67-31 over future Rep. Ernest Konnyu even as, according to data analyst Kiernan Park-Egan, Gerald Ford was carrying his seat 54-46 against Jimmy Carter, and the congressman never had a close race in any of his subsequent campaigns.",
    "Majewski edged out state Rep. Craig Riedel 36-31, with state Sen. Theresa Gavarone taking third with 29%, and will now face Kaptur in a Toledo area constituency that would have supported Trump 51-48a massive shift from Biden's 59-40 victory in her current district.",
    "? AR-Sen: With just under three weeks to go until the Republican primary, Sen. John Boozman has launched an ad that criticizes his opponent, former NFL player Jake Bequette, as \"fake Jake\" and argues Bequette opposes Trump's agenda without providing any specifics.",
    "Hobbs' campaign contends that her statement to CNN was clarifying her earlier position that Title 42 has been ineffective because border crossing attempts increased anyway after Trump implemented it, but the GOP has pounced on it to accuse her of flip-flopping.",
    "Legislatures\n? Special Elections: Michigan Democrat Carol Glanville flipped a dark-red state House seat in Tuesday's special election, which makes this the first legislative seat either party has flipped nationwide in 2022, against a truly vile Republican foe.",
    "House\n? NC-11: It's impossible to fit every article of freshman Rep. Madison Cawthorn's dirty laundry into one 30-second commercial, but Sen. Thom Tillis' allies at Results for NC do the best they can in their newest spot for the May 17 GOP primary.",
    "Milo looked like the clear frontrunner when she entered the race in January but Green, who would be the first African American Republican to represent Indiana in Congress, ran to her right and portrayed the former mayor as a \"never Trump liberal.\"",
    "After hitting the incumbent for allowing himself to be \"used to defend Putin's war crimes\" and voting \"against banning the Russian oil funding Putin's terror,\" the narrator accuses Cawthorn of wanting to cut \"veterans' benefits by $80 billion.\"",
    "Hobbs had initially said in early April that \"Title 42 isn't working,\" but she told CNN later last month that Biden should reverse his \"rash decision\" to lift it because doing so \"without a clear plan to secure our border would be a disaster.\"",
    "The ad features footage of Cawthorn being pulled over by the cops; shows a senior staffer placing his hand on the congressman's crotch; and displays the incumbent posing in women's lingerie as the narrator says, \"Always in the limelight.",
    "Mineta, whom San Jose's airport is named for, is largely remembered nationally for his decision to ground every airplane in U.S. airspace following Sept. 11 and for his work afterwards creating the Transportation Security Administration.",
    "Mineta opted to become chair of the House transportation committee following the 1992 elections rather than become Bill Clinton's secretary of transportation, but he lost that coveted post after the GOP flipped the House two years later.",
    "? TX-28: AIPAC's United Democracy Project is spending another $416,000 against attorney Jessica Cisneros ahead of her May 24 Democratic primary runoff against conservative Rep. Henry Cuellar, which brings its total to nearly $750,000.",
    "Mineta was incarcerated in Wyoming, and it was there that he met fellow Boy Scout Alan Simpson; the two became close friends and later served together in Congress when Simpson represented the state in the Senate as a Republican.",
    "Regan also called Russia's invasion of Ukraine a \"fake war just like the fake pandemic\" and shared bigoted Facebook posts that, among many other things, labeled feminism \"a Jewish program to degrade and subjugate white men.\"",
    "? OH-11: Rep. Shontel Brown fended off former state Sen. Nina Turner 66-34 in the Democratic primary for this safely blue seat in Cleveland, a rematch that took place less than a year after Brown beat Turner in an upset.",
    "Regan, who lost primaries here in 2014, 2018, and 2020, attracted national attention after he narrowly captured the nomination in March when he pushed back on the idea that it was \"too late\" to overturn Biden's win.",
    "? FL-Gov: St. Pete Polls' newest survey for Florida Politics shows Rep. Charlie Crist beating Agriculture Commissioner Nikki Fried 52-19 in the August Democratic primary to go up against GOP incumbent Ron DeSantis.",
    "He made history in 1967 when he became the first person of color on the San Jose City Council, and his landslide win in the mayoral race four years later made him the first Asian American to lead a major U.S. city.",
    "Obituaries\n? Norman Mineta: Norman Mineta, a California Democrat who spent two decades in the House and later served as U.S. secretary of transportation during the Sept. 11 attacks, died Tuesday at the age of 90.",
    "That day, he also appeared with a QAnon promoter named Zak Paine, who posted a video with Majewski in which Paine says they'd made it \"all the way to the base of the Capitol building\" after violence broke out.",
    "? OR-Gov: Nelson Research has conducted what it says is an \"independently conducted poll\" of the May 17 Republican primary, and it finds that no one has established a firm lead with less than two weeks to go.",
    "Glanville's victory leaves the GOP with a small 57-53 majority ahead of this fall's elections, which will be fought using the new map drawn up by the Michigan Independent Citizens Redistricting Commission.",
    "ARW also has the first survey we've seen of the attorney general nomination fight, and it shows incumbent Chris Carr leading his Trump-endorsed foe, Big Lie proponent John Gordon, 25-9, with 66% undecided.",
    "Vance's come-from-behind victory in the GOP Senate race, Nina Turner's fizzled rematch with Rep. Shontel Brown, and a shock win by an openly QAnon rando in a House district Republicans are hoping to flip.",
    "The RGA's assertion cites the Albuquerque Journal without noting that the article in question is an opinion piece from  Mark Ronchetti, who is the frontrunner in the GOP primary to take on Lujan Grisham.",
    "Michelle Lujan Grisham for withdrawing National Guard troops from the border shortly after taking office and claims she refuses to oppose Biden's \"open borders\" policy, an unnamed reference to Title 42.",
    "While Mineta had planned to remain in local office, he got a chance to run for Congress in 1974 when Republican Rep. Charles Gubser retired from what was then numbered the 13th Congressional District.",
    "Majewski, who previously served in the Air Force, made news in 2020 when he used paint to transform his yard into a giant \"Trump 2020\" banner, a move that Trump himself praised on Twitter.",
    "Mineta himself resigned in 1995 to become a Lockheed Martin executive, and Democrats soon got a rude reminder that Silicon Valley was still in the process of becoming reliably blue turf.",
    "Kemp has posted huge leads in every recent poll even though his party's leader badly wants him to fall, but the governor enjoys the support of noted Dallas-based painter George W. Bush.",
    "Majewski also benefited from outside support from Drain the DC Swamp, a PAC that spent close to $400,000, mostly on mail and radio ads promoting him and bashing the two state lawmakers.",
    "The Downballot\n? This week's dreadful news that the Supreme Court is poised to strike down Roe v. Wade underscores more than ever why progressives must build power at the state level.",
    "Nikki Haley, who is arguably her most prominent supporter, praising the congresswoman's conservative credentials and taking a not very subtle shot at primary rival Katie Arrington.",
    "Former state House Minority Leader Christine Drazan outpaces former state Rep. Bob Tiernan 19-14, with 2016 nominee Bud Pierce at 10%; a 27% plurality of respondents are undecided.",
    "Houchin lost to Hollingsworth six years ago, while Sodrel was waging his third campaign to return to Congress (and his sixth overall) following his 2006 defeat after just one term.",
    "Local CBS affiliate KPHO reports that Board of Regents member Karrin Taylor Robson, who is running in the GOP primary, has \"spent big money\" on ads attacking Hobbs over the issue.",
    "? GA-Gov, GA-Sen, GA-AG: The Republican firm ARW Strategies has released a poll of the May 24 GOP primary, though there's no word if these numbers were done on behalf of a client.",
    "Brian Kemp turning back former Sen. David Perdue 59-22, while former football star Herschel Walker outpaces state Agriculture Commissioner Gary Black 59-10 in the Senate contest.",
    "The Arizona ad is a minute-long spot that claims without evidence that Joe Biden and Democrats favor \"open borders\" and blames them for a whole host of supposed ills as a result.",
    "? PA-Gov: The Club for Growth hasn't made an endorsement ahead of the busy May 17 Republican primary, but it's very much decided it wants wealthy businessman Dave White stopped .",
    "Gavarone, who is closer to GOP leadership, sported a notable endorsement of her own from 5th District Rep. Bob Latta, who currently represents just over half the revamped 9th.",
    "? IN-01: Air Force veteran Jennifer-Ruth Green earned the Republican nomination to face freshman Democratic Rep. Frank Mrvan by beating former LaPorte Mayor Blair Milo 47-23.",
    "Glanville defeated Robert Regan 52-40, with another 8% opting for a write-in candidate, in House District 74, a west Michigan constituency that Trump carried 57-41 in 2020.",
    "The rest of Boozman's spot touts how he has been a steadfast Trump ally who supported Trump's Supreme Court appointees, backed his border wall, and has Trump's endorsement.",
    "Vance, saying, \"We love you, J.R.\" (Given Trump's difficulty in remembering the initials of Ohio Republicans, though, it's always possible this was just a happy accident.)",
    "Majewski will now go up against Kaptur, who is the longest-serving woman in the history of the House, for a seat that Republicans engineered to try to win for themselves.",
    "Mineta's interactions with the U.S. government began in a truly awful way when at 10 years old he was detained along with his family and other Japanese Americans in 1942.",
    "Mineta himself returned to public service in 2000 when he became Clinton's secretary of commerce, and Bush later kept him in the cabinet as its one Democratic member.",
    "Over in Georgia, though, Republican Mitchell Kaye turned back Democrat Dustin McCormick 57-43 to defend HD-45, a suburban Atlanta seat that had gone for Biden 50-49.",
    "In that appearance, writes the Daily Beast's Will Sommer, Majewski identified himself as a supporter of the conspiracy cult and said, \"I wear this shirt with pride.\"",
    "West Michigan was an unlikely place for a Democratic pickup, but Regan proved to be an especially toxic candidate even by the standards of the Trump-led GOP.",
    "The candidate ultimately raised and self-funded just over $250,000 through late April, which was actually slightly more than the amount Gavarone brought in.",
    "It then singles out Secretary of State Katie Hobbs, the Democratic primary frontrunner, over the federal government's immigration policy known as Title 42.",
    "Ad Roundup\nIA-Sen: Michael Franken (D)\nAL-Gov: Lindy Blanchard (R) - anti-Kay Ivey (R-inc)\nOK-02: Chris Schiller (R)\nThis is a short blurb about Daily Kos.",
    "Mineta, who mused, \"There is no such thing as a Democratic highway or a Republican bridge,\" eventually retired as secretary of transportation in 2006.",
    "? NC-Sen: Meredith College has released a late-April poll of the May 17 GOP primary, and it finds Rep. Ted Budd holding a 33-26 lead over former Gov.",
    "Majewski soon appeared decked out in a QAnon shirt in an interview with Fox News, and he also showed up on a QAnon livestream sporting related garb.",
    "The Michigan Freedom Network, which is close to the DeVos family, also spent $3,500 to promote the write-in campaign of Republican Mike Milanowski.",
    "The New York Times wrote just before the election that Democrats anticipated a Mineta victory, and he soon confirmed their hopes by winning 53-44.",
    "When he launched his bid for Congress in the spring of last year, Majewski told the Toledo Blade that he hadn't fully understood what QAnon was.",
    "Budd has led in every poll since mid-March, and he would only need to win with a plurality above 30% in order to avoid a potential July runoff.",
    "Governors\n? AZ-Gov, NM-Gov: The RGA has unveiled new ads attacking Democrats running for governor in Arizona and New Mexico over immigration.",
    "Bush will be the \"special guest\" at a Kemp fundraiser later this month, which seems to be his primary function in today's Republican Party.",
    "Both Glanville and Regan are campaigning for a full two-year term in the new HD-84, which is significantly different turf at 54-44 Biden.",
    "Riedel ran commercials touting his support from Ohio Rep. Jim Jordan, including one in which he pledged to join Jordan's Freedom Caucus.",
    "Powerful Republicans ended up abandoning their nominee, with the House Republican Campaign Committee refusing to support him Tuesday.",
    "Mike DeWine defeated former Rep. Jim Renacci 48-28 in Tuesday's Republican primary, with another 22% going to farmer Joe Blystone.",
    "The congresswoman, though, is hoping that her deep ties to the Toledo area will help her win over enough conservatives to hold on.",
    "Mineta was a Republican himself after World War II, but he'd become a Democrat by the time he became active in San Jose politics.",
    "The new state representative has no intra-party opposition, while Regan is going up against Milanowski and two other Republicans.",
    "Back in mid-April, the firm showed Pierce edging out Drazan 11-8, with Tiernan locked in a three-way tie for third with just 5%.",
    "On the Democratic side, former Dayton Mayor Nan Whaley decisively defeated John Cranley, her counterpart from Cincinnati, 65-35.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "? ME-Gov: New campaign finance reports show that Democratic incumbent Janet Mills outraised her Republican rival, former Gov.",
    "Paul LePage, $1.1 million to $455,000 from Jan. 1 through April 26, and she holds a $2 million to $855,000 cash-on-hand lead.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Whaley will be in for a very tough battle against DeWine in a state that swung hard to the right during the Trump era.",
    "Riedel and Gavarone each enjoyed considerably deeper networks as sitting elected officials, and they made use of them.",
    "Meanwhile, the New Mexico ad is another minute-long spot where the first part is nearly identical to the Arizona ad.",
    "\"She won this seat from a liberal Democrat,\" Haley tells the audience of Mace, \"and she'll keep it Republican.\"",
    "Until Tuesday night, though, Majewski's prospects of even making it to the general election seemed remote.",
    "Co-hosts David Nir and David Beard also recap Tuesday's primaries in Ohio, including Trump-endorsed J.D.",
    "We also cast a gimlet eye at last-minute ballot shenanigans in New York State designed to benefit Gov.",
    "Even Majewski, when he launched his campaign, acknowledged, \"My grandparents supported Marcy Kaptur.",
    "Following Trump's defeat, Majewski bragged that he was helping bring people to the Jan. 6 rally.",
    "Please subscribe to The Downballot on Apple Podcasts or wherever you listen to podcasts.",
    "(Riedel took in a little more than $435,000, with a large portion of that self-funded.)",
    "However, Majewski proved to be a tougher opponent than either official likely realized.",
    "Trump himself gave Majewski a shoutout at a late April rally for Senate candidate J.D.",
    "Mineta was a major supporter of public transportation during his long career in D.C.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "You'll find a transcript of this week's episode right here by noon Eastern Time.",
    "(After his win, another video surfaced of him in a \"Let's Go Brandon\" rap video.",
    "I tell my daughters if rape is inevitable, lie back and enjoy it,\" he said.",
    "Brooks uses the incident to highlight his recent endorsement from the NRA.",
    "? SC-01: Republican Rep. Nancy Mace's newest commercial stars former Gov.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The group has spent almost $950,000 with less than two weeks to go.",
    "My grandmother adored Marcy Kaptur and so did my great-grandmother.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Now, Madison Cawthorn's starring in Putin's state-owned TV.\"",
    "Pat McCrory, with a 34% plurality of voters still undecided.",
    "Donate $5\nDonate $25\nDonate $15\n\nDonate $5 monthly",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "\"That's kind of like having three daughters.",
    "The second half chastises Democratic Gov.",
    "Subscribe to our podcast, The Downballot!",
    "That's not how we won this election.\"",
    "Election Recaps\n? OH-Gov: Gov.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "\"That's not how we roll.",
    "Daily Kos is different.",
    "We've warned you.)",
    "They adored her.\"",
    "Please read it.",
    "It finds Gov.",
    "Kathy Hochul."
  ]
}