{
  "id": 1750,
  "mediaId": 238,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Stacey Abrams switches gears from campaign fundraising to aiding abortion rights",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/04/stacey-abrams-abortion-rights-fundraising/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eugene Scott",
  "authorUrl": "https://www.washingtonpost.com/people/eugene-scott/",
  "termIds": [
    1646,
    1646,
    1951,
    1951,
    2095,
    2095,
    428,
    401,
    401,
    428,
    482,
    482,
    2945,
    2945
  ],
  "sentences": [
    "But my parents taught me that it is insufficient to be merely upset; you have to act.?\nAbrams, who is running unopposed in the Democratic primary, listed a number of abortion rights groups including Planned Parenthood Southeast and NARAL Pro-Choice Georgia that would benefit from her campaign's funds.",
    "If I were Governor when this ruling was issued, I would call the legislature back into a special session to ban abortion in GA.?\nAnd while Kemp expressed his support for the investigation into how the memo was made public, he responded to the news by highlighting his antiabortion bona fides.",
    "Stacey Abrams  one of the Democratic Party's most notable fundraisers  has paused fundraising for her Georgia gubernatorial race to redirect funds to abortion rights groups after a draft Supreme Court opinion signaling the end to a constitutional right to abortion was made public.",
    "In June 2019, Fair Fight Action  a voting rights organization that has raised more than $100 million since Abrams founded it in 2018  made a number of $10,000 donations to abortion rights groups after Georgia Republicans enacted a ban on most abortions after six weeks.",
    "Under my leadership, Georgia will remain a state the values life at all stages, and as we anticipate the U.S. Supreme Court's decision, Georgians should rest assured that I will continue to fight for the strongest pro-life law in the country,? he tweeted Tuesday.",
    "As the next Governor of Georgia, I will defend the right to an abortion and fight for reproductive justice.?\nThis isn't the first time that Abrams, who also ran for governor in 2018, used money she has raised for other causes to aid abortion rights groups.",
    "Abrams's ability to temporarily redirect funds to groups working to expand abortion access is thought to be possible in part because she regularly beats her main GOP competitors Gov.",
    "The announcement came a day after the former state lawmaker expressed her anger on Twitter about the draft opinion that could mean the end to a constitutional right to abortion.",
    "This moment demands action, so I will be blunt: The abomination of that leaked opinion is coming to find every one of us,? Abrams said Wednesday in a campaign email.",
    "This is a terrifying time for our nation.?\nIn response, we have a right to be angry, and a right to be right,? the Democrat added.",
    "Her campaign told supporters in an email Wednesday that she had raised an additional $11.7 million during the past three months.",
    "She reportedly raised more than $9 million a month after announcing her second attempt at the governor's mansion in December.",
    "As a woman, I am enraged by the continued assault on our right to control our bodies + our futures,? she tweeted Tuesday.",
    "Activists challenged the law, and it is on hold in federal appeals court pending a decision from the Supreme Court.",
    "Any ruling from the Supreme Court that would save innocent lives would be an historic milestone,? he tweeted.",
    "Brian Kemp and former U.S. senator David Perdue (R-Ga.) in fundraising.",
    "Kemp and Perdue are candidates in the Republican gubernatorial primary.",
    "As an American, I am appalled by the SCOTUS breach & its implications.",
    "And particularly those of color or low-income.",
    "Women in Georgia and across this country.",
    "LGBTQ+ and disabled people."
  ]
}