{
  "id": 1765,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Trump wasn't on the ballot but was a big winner with Vance's Ohio GOP Senate nomination victory",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/085365ed-0936-4ae4-b76f-53c060cf011a/3f53e736-80bc-4461-b2eb-35e3bca68be1/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-wasnt-on-the-ballot-but-was-a-big-winner-with-vances-ohio-gop-senate-nomination-victory",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    1404,
    1801,
    2095,
    379,
    571,
    2710,
    2816,
    2845
  ],
  "sentences": [
    "\"JD Vance put in tremendous work and has immense political talentwhich put him in the position to earn the support of President Trumpbut it was the endorsement of President Donald J. Trump that took a candidate who many insiders said was in 4th and at single digits in the polls, and in only two weeks, propelled him into a commanding first place finish,\" Trump spokesman Taylor Budowich told Fox News in a statement soon after Vance's victory.",
    "CLICK HERE FOR THE LATEST PRIMARY ELECTION RESULTS FROM FOX NEWS\nTrump, who remains a fundraising giant as he continuously re-litigates his 2020 presidential election loss, has made dozens and dozens of endorsements this cycle all the way up and down the ballot and has crisscrossed the country the past couple of months, holding rallies for some of the top candidates he's backing.",
    "Vance campaign senior adviser Andy Surabian told Fox News his candidate \"put in tremendous work and has immense political talentwhich put him in the position to earn the support of President Trumpbut it was the endorsement of President Donald J. Trump that.propelled him into a commanding first place finish.\"",
    "And Budowich emphasized that \"the power of President Trump's endorsement is undeniable, his dominance over the Republican powerbrokers in D.C. cannot be overstated, and the promise of this MAGA Movement will not just define the Midterms, but it will win for years to come.\"",
    "Polling suggests Oz is locked in a fierce battle with David McCormick, a former hedge fund executive, West Point graduate, Gulf War combat veteran, and Treasury Department official in former President George W. Bush's administration.",
    "Vance, the candidate Trump endorsed less than three weeks ago in the crowded and expensive showdown that has grabbed national attention for months, on Tuesday won the GOP nomination in the race to succeed retiring Republican Sen.",
    "Next Tuesday in Nebraska's combustible three-way fistfight for the GOP gubernatorial nomination, Trump is backing Charles Herbster, a multimillionaire agricultural executive, in the race to succeed term-limited Republican Gov.",
    "CLICK HERE TO GET THE FOX NEWS APP\nBut regardless of Trump's endorsement, with three weeks to go until Georgia's primary, Kemp enjoys large leads over Perdue in two key campaign metrics  public opinion polling and fundraising.",
    "VANCE URGES PARTY UNITY AFTER CONTENTIOUS REPUBLICAN PRIMARY BATTLE\nVance pointed to the former president's endorsement in his victory speech, saying, \"I have absolutely got to thank the 45th President of the United States.\"",
    "The former president recently endorsed Mehmet Oz in Pennsylvania's jam-packed, expensive, and very high-profile GOP Senate primary, in a move that split Trump's political world and millions of supporters across the country.",
    "MAY MADNESS: PRIMARY SEASON IGNITES IN EARNEST\nWest Virginia holds primaries on the same day as Nebraska, and Trump's prestige is on the line in an intra-party battle between GOP Reps. David McKinley and Alex Mooney.",
    "If former President Donald Trump's continued clout over the Republican Party was on the line in Ohio's highly contested and contentious GOP Senate primary, the former president easily passed the test.",
    "\"Vance was stuck before the endorsement and surged the last two weeks,\" Hartley, a veteran of numerous presidential and statewide campaigns who remained neutral in the 2022 primary, emphasized.",
    "But Kemp earned Trump's ire starting in late 2020, after the governor certified President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "Trump for months urged former Republican Sen. David Perdue to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "Trump's backing of the celebrity doctor known as Dr. Oz did little to temper suspicions among many in the Republican Party about the candidate's conservative credentials.",
    "And the former president, who 15 months removed from the White House remains the most popular and influential politician in the GOP, didn't waste any time taking credit.",
    "Perdue declared his candidacy a few days after Abrams, a voting rights champion and rising star in the Democratic Party, launched her second straight bid for governor.",
    "Tuesday's primaries in Ohio and the neighboring Midwestern state of Indiana kicked off a frenetic schedule this month, with a total of 13 states holding primaries.",
    "The state lost a congressional seat during the once-in-a-decade congressional reapportionment, and both Republican incumbents were drawn into the same district.",
    "Trump has his best shot of victory on May 17 in North Carolina, where last summer he endorsed Rep. Ted Budd in the state's open GOP held Senate seat race.",
    "Trump continues to play a kingmaker's role in the 2022 Republican primaries as he repeatedly flirts with making another White House run in 2024.",
    "But in recent weeks, Budd has surged to front-runner status in the increasingly contentious primary showdown that also includes former Gov.",
    "Herbster, who in recent weeks has faced accusations that he sexually assaulted eight women, is a longtime top donor and ally of Trump.",
    "The contentious race also includes multimillionaire hog farmer Jim Pillen, who is backed by Ricketts, and state Sen. Brett Lindstrom.",
    "But a week later, the former president could suffer a major setback in his nearly year and a half long bid to oust Republican Gov.",
    "Asked if Trump's backing was the reason Vance came out on top, longtime Ohio based Republican consultant Mike Hartley said \"100%.\"",
    "For months, Budd was unable to leverage the former president's endorsement to boost his poll numbers and fundraising figures.",
    "Four years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "The former president endorsed Herbster last autumn and held a rally with the candidate in Nebraska on Sunday.",
    "FOLLOWING TRUMP ENDORSEMENT, OZ AND MCCORMICK TRADE FIRE\nIn Idaho, Trump is backing far-right Lt. Gov.",
    "Trump's backing Mooney in a race that's partially turned into a test of the former president's clout.",
    "Janice McGeachin, who is one of seven primary challengers running against incumbent Republican Gov.",
    "A week later, on Tuesday, May 17, Trump faces three more stiff tests.",
    "Three other major GOP candidates are also on the primary ballot.",
    "Brad Little, whom polling suggests is the clear front-runner.",
    "Vance was Trump's first test in May, but far from his last.",
    "And Trump-backed candidates face stiffer tests ahead.",
    "Pat McCrory, and former Rep. Mark Walker.",
    "Brian Kemp of Georgia.",
    "Pete Ricketts.",
    "Rob Portman.",
    "J.D."
  ]
}