{
  "id": 1766,
  "mediaId": 124,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Vance's Ohio win showcases Trump's endorsement power",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220503-donald-trump-ew-600p-8ac09b.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/vances-ohio-win-showcases-trumps-endorsement-power-rcna26429",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1801,
    1801,
    1874,
    1874,
    2087,
    2087,
    2095,
    2095,
    1402,
    1402,
    1147,
    1147,
    428,
    428,
    2672,
    2672,
    2845,
    2845,
    2862,
    2862
  ],
  "sentences": [
    "\"I gotta say, a lot of the fake news media  and there are there are some good ones in the back there, and there's some bad ones too, let's be honest  but they wanted to write a story that this campaign would be the death of Donald Trump's America First agenda,\" Vance said in his victory speech Tuesday night at a downtown Cincinnati convention hall.",
    "On Good Friday, the former president weighed in with an endorsement that enabled Vance on Tuesday to clinch the Republican Party's nomination for the open seat, besting better-funded rivals and putting an exclamation point on the singular role Trump plays as kingmaker and center of gravity in today's Republican Party.",
    "And if he wins with only 30 or 40 percent, that means 60 to 70 percent of Republicans aren't moved by the Trump endorsement,? said Carter Wrenn, a Republican pollster for John Bolton, who served as Trump's national security adviser before becoming an outspoken critic of the former president.",
    "Vance, the higher the likelihood that Donald Trump endorses Blake Masters in Arizona,\" said one Republican associate of Trump's who has spoken to the former president about his endorsement and spoke on condition of anonymity to describe private conversations.",
    "But even if Oz loses, Trump is going to take the credit for getting him so far ahead anyway.?\nKristin Davison, who consulted for Republican Senate candidate Josh Mandel in Ohio and McCormick in Pennsylvania, said the two races have important distinctions.",
    "Vance's win was the first major test of Trump's endorsement power in 2022 and serves as yet another sign that his influence over the Republican Party is strong enough that he could secure the Republican nomination for president again in two years.",
    "The bigger the margin, the likelier it is that Trump will crusade for his candidates in tougher May races in Pennsylvania and Georgia  or that he'll endorse in Arizona's Aug. 2 senate primary, according to one Trump confidante.",
    "\"When Trump talks, Republicans listen,\" Bill Kristol, an anti-Trump Republican said on Twitter, pointing out that Vance was in third place with about 10 percent support in polls before Trump endorsed him on April 15.",
    "But former Ohio Senate candidate Bernie Moreno saw the power of Trump's support, or lack thereof, first hand and bowed out of the race in February after meeting with Trump.",
    "He agreed to back whomever Trump eventually supported, and he told NBC News that Tuesday's result validates how influential the former president remains in GOP politics.",
    "In Pennsylvania, Trump endorsed Mehmet Oz over hedge fund mogul Dave McCormick, who has unleashed a torrent of ads on TV, radio and the internet savaging the former Dr.",
    "\"The power of President Trump's endorsement is undeniable, his dominance over the Republican powerbrokers in D.C. cannot be overstated,\" Budowich said in an email.",
    "In Ohio, Republican opponents attacked Vance almost exclusively for once being an anti-Trump Republican, an attack that lost its sting with Trump's endorsement.",
    "\"Anybody who dismisses Donald Trump as not a major factor in the party is crazy,\" Dave Carney, a veteran national Republican Party consultant, told NBC News.",
    "They note that his first endorsed candidate this cycle, Max Miller, won his congressional primary Tuesday in Ohio as Vance carried the Senate nomination.",
    "Taylor Budowich, Trump's communications director, credited Vance for his hard work, but made sure to point out Trump's share of the victory.",
    "Last month, Trump took the extraordinary step of pulling his endorsement from Rep. Mo Brooks in Alabama over his lackluster campaigning.",
    "\"Vance's win proves the concept that he can take someone from third or fourth place and pull them into the lead in a crowded primary.\"",
    "Brian Kemp, whom Trump loathes for refusing to help overturn his 2020 re-election loss to President Joe Biden.",
    "On Tuesday, Vance basked in his Trump-backed win and channeled the former president in swiping at the press.",
    "In Georgia, Trump persuaded former Sen. David Perdue to run for governor, but he's struggling to catch Gov.",
    "Trump recently joined a fundraising call for Masters, a sign of his interest in the Republican's candidacy.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nOz is not a slam dunk.",
    "Still, Trump's team expects some losses out of the more than 120 candidates he has publicly backed.",
    "Two months before, the super PAC backing him took the rare step of publicly saying he was losing.",
    "I still think McCormick wins,? said Rob Gleason, the former chair of the Pennsylvania GOP.",
    "Still, there are Republican critics who think Trump is apt to take too much credit.",
    "Vance looked like just another Ohio also-ran in the crowded GOP senate primary.",
    "\"Ladies and gentlemen, it ain't the death of the America First agenda.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "So far, Trump-endorsed candidates are 55-0 this cycle, advisers said.",
    "Vance will face Democrat Tim Ryan, a U.S. congressman, in November.",
    "But in Pennsylvania, McCormick has run a more complete campaign.",
    "He remains incredibly popular, rightfully so,? Moreno said.",
    "It's not just Vance's win that matters, sources said.",
    "The Trump endorsement forgives being anti-Trump.",
    "It doesn't forgive ideology,? Davison said.",
    "\"The greater the margin of victory for J.D.",
    "Then Donald Trump decided to get involved.",
    "Vance is getting 70 percent of the vote.",
    "Oz? TV star as a phony conservative.",
    "It's not like J.D.",
    "\"Absolutely!",
    "J.D."
  ]
}