{
  "id": 1787,
  "mediaId": 237,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Trump and ally Pete Ricketts on opposite sides in Nebraska gubernatorial primary",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/f7dfa33/2147483647/strip/true/crop/4219x2215+0+466/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fac%2Fc5%2Fdbf15cfe3fc8174c2ad3b2c32e90%2F84d6541398973adfe3f50476011c4ced.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/trump-and-ally-pete-ricketts-on-opposite-sides-in-nebraska-gubernatorial-primary",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "",
  "termIds": [
    1147,
    1147,
    1009,
    1009,
    2136,
    2136,
    1985,
    1985,
    1811,
    1811,
    350,
    350,
    2757,
    2757,
    2816,
    2816
  ],
  "sentences": [
    "But on Sunday, the warmup act was dominated by speakers from out of state, including American Conservative Union Chairman Matt Schlapp and Citizens United Chairman David Bossie, both based in Washington, D.C.; My Pillow CEO Mike Lindell; former professional football player Jack Brewer; Sen. Billy Long (R-MO); and others.",
    "Charles is a fine man, and he's innocent of these despicable charges.?\nBut the former president's divide with Ricketts  indeed, his rift with so many Nebraska Republicans sparked by his endorsement of Herbster  was reflected by the lineup of pre-rally warmup speakers, as well as by who did not show up at all.",
    "Ultimately, the people of Nebraska will decide who our next governor should be.?\nHerbster's defeat to Pillen or Lindstrom might say little about Trump's relationship with Republican voters or his status as the overwhelming front-runner for the 2024 presidential nomination  should he run.",
    "It's a three-horse race coming around turn four, and they're nose and nose,? said Robert Bud? Synhorst, the former executive director of the Nebraska Republican Party and now the president of the Lincoln Independent Business Association in the state capital.",
    "Ricketts, his father, Joe Ricketts, and his brother Todd Ricketts, the former finance chairman of the Republican National Committee during much of Trump's term in office, have been aligned with the former president and generous benefactors.",
    "Just In...\nDonald Trump is facing the prospect of a major setback at the hands of a close political ally, with the former president's choice for Nebraska governor struggling to overcome opposition from the wealthy Ricketts family.",
    "Trump traveled to Nebraska Sunday to rally support for businessman Charles Herbster, who has been unable to turn the former president's coveted endorsement into an advantage over rancher Jim Pillen or state Sen. Brett Lindstrom.",
    "But the Republican primary for governor in Nebraska has received scant attention compared to other nominating contests on which Trump has staked his credibility, despite the unique circumstances of his opposition.",
    "Pete Ricketts and has enjoyed the generous financial backing of the term-limited chief executive and members of his family, some of whom are among the most prolific donors to GOP candidates and causes annually.",
    "During the former president's rally in Greenwood, northeast of Lincoln, he acknowledged that Herbster might lose but made clear he is sticking with the businessman, even amid allegations of sexual misconduct.",
    "Among party activists, it's been a big topic of conversation, having those two heavyweights be at loggerheads going against each other,? said Phil Young, a former executive director of the Nebraska GOP.",
    "But a loss in a deep red state like Nebraska could perpetuate speculation that Trump's influence in the GOP is waning post-presidency as he insists that the 2020 election was stolen.",
    "However, Ricketts emphasized Monday through a spokesman that he and Trump see eye to eye on the most issues  they just happen to disagree on the best fit for the next governor.",
    "Trump's widely attended and raucous gatherings typically attract several elected Republicans and GOP officials based in and around the community where the rally is being held.",
    "Right here in Nebraska, you have the chance to elect a diehard MAGA champion as your governor, a man who's been with us from the very, very beginning,? Trump said.",
    "Trump's pick in the Idaho governor's race is in similar trouble, while his endorsed candidate in the Pennsylvania Senate race has a 50-50 shot at best.",
    "In an internal poll publicized by the Pillen campaign, the rancher led narrowly with 24%, followed by Herbster at 23% and Lindstrom at 20%.",
    "In the Alabama Senate race, Rep. Mo Brooks performed so poorly that Trump pulled his endorsement and is now neutral in that contest.",
    "Although some elected Nebraska Republicans participated, there were no major statewide or federal officeholders.",
    "However, in this case, we are backing different candidates for governor of Nebraska,? Ricketts said.",
    "Herbster is hardly the first Republican candidate endorsed by Trump to face headwinds in a primary.",
    "In late March, Ricketts confirmed to the Nebraska Examiner that they had given the group $600,000.",
    "The governor and his father have contributed to the outside group Conservative Nebraska.",
    "Seven percent were supporting another candidate, and 24% checked the \"undecided\" box.",
    "Primary day in Nebraska is May 10, and early voting has been underway since April 4.",
    "And that might encourage opposition to his leadership among prominent Republicans.",
    "In the Georgia governor's race, former Sen. David Perdue trails incumbent Gov.",
    "Brian Kemp significantly, according to recent polls.",
    "President Trump and I agree on many policy issues.",
    "It's possible they have contributed more since.",
    "Pillen is backed by Republican Gov.",
    "But not this time."
  ]
}