{
  "id": 1800,
  "mediaId": 43,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Morning Digest: Join us for our liveblog tonight as the 2022 primaries resume in Ohio and Indiana",
  "image": "https://images.dailykos.com/images/1065005/story_image/GettyImages-1240191090.jpeg?1651506501",
  "link": "https://www.dailykos.com/story/2022/5/3/2095389/-Morning-Digest-Join-us-for-our-liveblog-tonight-as-the-2022-primaries-resume-in-Ohio-and-Indiana",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2277,
    2277,
    1801,
    1801,
    648,
    648,
    1147,
    1147,
    1253,
    1253,
    428,
    428,
    2710,
    2710,
    2935,
    2935,
    2845,
    2845
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nBig, big May primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0053:14\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? Primary Night: Strictly Come Vancing: After a two-month break, the 2022 primary season picks are back with a vengeance Tuesday in Ohio and Indiana, and we've put together our preview of the night's key races in both states.",
    "Lone Star State Democrats were still the dominant faction in this conservative state at the time, but Krueger had a difficult task ahead of him unseating Tower, whose win in the 1961 special election to succeed Vice President Lyndon Johnson made him the first Republican to win a direct election to the Senate in any of the 11 former Confederate states since the passage of the 17th Amendment half a century earlier.",
    "? FL-04: State Rep. Jason Fischer announced Monday that he was joining the Republican primary for the open 4th District, a Jacksonville-area seat that Trump would have taken 53-46.\n? FL-15, FL-07: Retired Navy Captain Mac McGovern, who launched a bid for the old 7th District in January before redistricting was completed, said Monday that he'd compete in the August Republican primary for the new 15th instead.",
    "House\n? AL-05: The May 24 Republican primary for this safely red open seat was a pretty low-key affair until last week, but that all changed when former Department of Defense official Casey Wardynski's allies at the nihilist House Freedom Caucus dropped $192,000 on TV spots, plus another $83,000 on digital ads, attacking Madison County Commission Chairman Dale Strong.",
    "Ann Richardson appointed him to succeed Sen. Lloyd Bentsen, who resigned to become Bill Clinton's first treasury secretary, after a long process where she would mention a name and see what the reaction was; one Democratic state representative explained Krueger was ultimately chosen because he \"has statewide name ID, and no one has strong objections to him.\"",
    "Quarles' only notable intra-party foe so far is state Auditor Mike Harmon, who has struggled to raise money, but considerably more Bluegrass State Republicans are eyeing the contest: Secretary of State Michael Adams, who himself hasn't quite ruled it out, mused, \"I think we're going to need more paper for the ballots.\"",
    "? TX-34 (special): Republican Mayra Flores and the NRCC have released the first poll we've seen of the June 14 all-party special election primary, a Ragnar Research internal that shows Flores and Democrat Dan Sanchez advancing to an all-but-assured runoff in the current version of this 52-48 Biden seat.",
    "? MA-Gov: Suffolk University, working on behalf of the Boston Globe, is out with the first survey we've seen of the general election to succeed retiring Republican incumbent Charlie Baker, and it finds Massachusetts Democrats well-positioned to retake the governorship after eight years.",
    "There actually weren't enough seats on the ballot that year for Republicans to win a majority on the body even though they won all three of the 2020 contests, including the Davis race, though the Club doesn't let that stop them from continuing to blame Daughtry for what happened next.",
    "Redistricting extended Trump's margin of victory in this western Colorado constituency from 52-46 to 53-45, but three Democrats are hoping they'll have an opening against Boebert: Former Aspen City Councilman Adam Frisch, social worker Sol Sandoval, and businessman Alex Walker.",
    "Krueger and his allies argued the state needed to maintain a Democratic senator, while Republican state Treasurer Kay Bailey Hutchison used every chance she had to tie him to the administration: It was Hutchison's strategy that resonated, and she scored a 67-33 victory.",
    "We mentioned which major candidates were still in the running following the assemblies for Senate and governor, as well as for the 5th, 7th, and 8th Congressional Districts, though a few contenders were in limbo as they waited for their petitions to be verified.",
    "? WI-Gov: Democratic incumbent Tony Evers has launched a $3.5 million opening ad buy, and his first spot commends him for saving jobs, improving public schools and roads, and working \"with Republicans and Democrats to pass middle class income-tax relief.\"",
    "? FL-27, FL-Sen: Two local Democratic elected officials announced over the weekend that they'd take on freshman Republican Rep. Mara Elvira Salazar in the new 27th District: Miami Commissioner Ken Russell and Miami-Dade County Commissioner Eileen Higgins.",
    "In the open 7th, by contrast, the GOP is set for a three-way race because both attorney Brad Dempsey and construction company owner Carl Andersen failed to turn in enough signatures, though both are challenging the secretary of state's ruling in court.",
    "? OR-06: Protect Our Future PAC has thrown down another $735,000 to aid economic development adviser Carrick Flynn, which brings the crypto-aligned group's total investment to $8.76 million with two more weeks to go before the Democratic primary.",
    "Vance\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "The Washington Post wrote weeks before Election Day, \"With Tower and Krueger agreeing on most economic and oil-and-gas issues, the glitter foreseen for this campaign has turned to ho-hum boredom, a far greater hazard for Krueger than Tower.\"",
    "An unnamed source at the McKinley campaign told columnist Steven Allen Adams, \"In our polling, Manchin has consistently been in the mid to high 60s favorables among Republican primary voters,\" though they didn't actually release any polls.",
    "? NE-02: Donald Trump used his Sunday rally for gubernatorial candidate Charles Herbster to bash Rep. Don Bacon ahead of next week's Republican primary for this competitive seat and to implore his audience to vote for roofer Steve Kuehl.",
    "The senator begins by telling the audience that, as someone who opposed the Biden administration's Build Back Better program, he knows that Mooney \"and his out of state supporters\" are lying when they say McKinley supported the program.",
    "Russell, who serves on the local equivalent of the city council, had been waging a longshot campaign against Republican Sen. Marco Rubio, but he'd struggled to gain traction in the August primary against 10th District Rep. Val Demings.",
    "Krueger's team tried to go after the incumbent by mailing out a newspaper column that, while it didn't name Tower directly, implied the senator was a womanizer; Tower's camp, in turn, asked why the 43-year-old Democrat was unmarried.",
    "? NH-Sen: Democratic Sen. Maggie Hassan is using her first TV ad of the campaign to tell the audience, \"I am taking on members of my own party to push a gas tax holiday, and I am pushing Joe Biden to release more of our oil reserves.",
    "It's very rare for a high-profile politician, even a conservative Democrat like Manchin, to take sides in the other party's primary, much less cut an ad for it, though McKinley's camp is arguing he'll be an asset with GOP voters.",
    "The last survey we saw giving McKinley the lead, by contrast, was a March poll for the West Virginia Chamber of Commerce that gave him a small 38-33 edge; the group went on to endorse McKinley after those numbers were released.",
    "Krueger previously was elected to represent the 21st District, which at the time was a geographically vast seat covering much of West Texas, in 1974 and 1976, but he gave it up to challenge Republican Sen. John Tower in 1978.",
    "Over in Ohio's 11th District, Rep. Shontel Brown faces a Democratic primary rematch against former state Sen. Nina Turner, a prominent Bernie Sanders supporter whom she defeated in last year's special election in an upset.",
    "Vance (R)\nPA-Sen: Mehmet Oz (R) - anti-Dave McCormick (R)\nAL-Gov: Kay Ivey (R-inc)\nAL-Gov: Lindy Blanchard (R) - anti-Ivey (R-inc)\nGA-07: Lucy McBath (D-inc)\nNJ-07: Tom Kean Jr. (R)\nThis is a short blurb about Daily Kos.",
    "Finally, the state's list confirms that far-right Rep. Lauren Boebert's only Republican primary opponent in the 3rd District will be state Sen. Don Coram, though it's hard to see the moderate state legislator prevailing.",
    "The ad features several local people arguing that the assemblyman has aided oil companies while benefiting from their donations, and that he \"even stood with Donald Trump when Trump let polluters put our water at risk.\"",
    "We now know, however, that business owner Andrew Heaton will indeed be competing in the GOP primary for the safely red 5th in the Colorado Springs area, which is potentially good news for Republican Rep. Doug Lamborn.",
    "? Colorado: The deadline to turn in petitions to make Colorado's June 28 primary passed all the way back on March 15, but because the state takes several weeks to verify signatures, we only now have an official list.",
    "Russell, however, said Sunday he would run against Salazar instead: The commissioner ended March with $285,000 in the bank that he can use on his new House race, though the GOP congresswoman had $1 million available.",
    "? WV-02: Democratic Sen. Joe Manchin not only has endorsed Rep. David McKinley ahead of next week's Republican primary against fellow incumbent Alex Mooney, he's also starring in a commercial praising McKinley.",
    "? NC-13: The Club for Growth, which supports law student Bo Hines in the packed May 17 Republican primary, is running a negative ad here for the first time by targeting self-funding attorney Kelly Daughtry.",
    "Attorney General Maura Healey leads both former state Rep. Geoff Diehl and wealthy businessman Chris Doughty 54-27 and 55-25, respectively, while state Sen. Sonia Chang-Daz outpaces them 45-29 and 43-27.",
    "Mooney, by contrast, is only too happy to publicize his own internal from Public Opinion Strategies showing him defeating McKinley 50-30, which is nearly double his margin from just a few weeks ago.",
    "The result turned out to be tight, but Tower held off Krueger 50-49; that same evening, Bill Clements was pulling off a similarly narrow win to become Texas' first GOP governor of the 20th century.",
    "The commercial accuses Strong of voting to put a tax increase on the ballot and having \"stood with the radical woke left and supported relocating an historic Civil War statue in Madison County.\"",
    "Vance is hoping that a late endorsement from Donald Trump will put him over the top (even if Trump himself hasn't bothered to remember Vance's name), but it's far from the only primary on tap.",
    "The school also tests out an extremely hypothetical scenario where Baker runs for re-election as an independent and has him beating Healey 37-28, with 17% going to the Trump-endorsed Diehl.",
    "? ID-Gov, ID-AG: Idaho Dispatch last month released a mid-April survey from Zoldak Research, a firm we haven't previously encountered, that shows incumbent Brad Little turning back Lt. Gov.",
    "Krueger, who never sought elected office again, went on to serve as Clinton's ambassador both to Burundi, where he survived a 1995 attack on his convoy that killed one person, and Botswana.",
    "And in south-central Indiana's 9th, former Rep. Mike Sodrel is hoping to return to the House 16 years after he was ejected from it, but he has to get past several fellow Republicans first.",
    "Buckeye State Republicans are taking part in their race for governor as well, where a recent poll finds incumbent Mike DeWine beating former Rep. Jim Renacci with a plurality of the vote.",
    "Penn has declared that he'll seek the Republican nomination to lead heavily Democratic Hawaii, an announcement that the mask and vaccine mandate foe naturally made to podcaster Joe Rogan.",
    "The Club tells the audience that Daughtry donated to a Democrat, Mark Davis, running for the North Carolina Supreme Court in 2020 \"when Republicans were fighting to take back the court.\"",
    "The narrator instead continues, \"The Democrats kept control, then used their Supreme Court majority to block Republican redistricting plans and draw districts benefiting the Democrats.\"",
    "The Club For Growth, which is running commercials attacking Wasden, publicized an internal back in March that had Labrador ahead by a large 35-14 in the GOP nomination contest.",
    "In the Toledo-based 9th, meanwhile, two Republican state legislators are competing to go up against 20-term Democratic Rep. Marcy Kaptur in a newly-gerrymandered constituency.",
    "The new senator, though, soon had to defend his seat in a special election that occurred as Clinton's weak numbers were accelerating Texas Democrats' decline in the state.",
    "Obituaries\n? Bob Krueger, whose brief tenure as an appointed senator in 1993 made him the last Texas Democrat to serve in the upper chamber, died Sunday at the age of 86.",
    "Higgins pulled off an upset victory in 2018 to claim her seat on the county commission in a special election, a victory that flipped the body to a Democratic majority.",
    "You can also follow us on Twitter for blow-by-blow updates, and you'll want to bookmark our primary calendar, which includes the dates for primaries in all 50 states.",
    "Brian Kemp fending off former Sen. David Perdue 54-38 in the May 24 Republican primary, which is a big improvement from the incumbent's 44-35 lead two months ago.",
    "? CA-13: Financial advisor Phil Arballo's first commercial for the June 7 top-two primary goes after his fellow Democrat, Assemblyman Adam Gray, from the left.",
    "Both Heaton and Navy veteran Rebecca Keltie have brought in almost no money, but their presence could cost state Rep. Dave Williams some anti-incumbent votes.",
    "She went on to win a close race for a full four-year term in 2020, though she'll need to step down to campaign for Congress under Florida's resign-to-run law.",
    "Over in the real world, though, telling voters to vote for a candidate is an endorsement no matter what Trump and his minions actually insist on labeling it.",
    "Several people also reached the primary ballot by competing at their party conventions (also known as the party assemblies), a process we explain here.",
    "And while we hadn't previously heard state Sen. Ralph Alvarado mentioned as a possibility, the Associated Press reports that he's indeed considering.",
    "Trump, naturally, said he wasn't actually endorsing Kuehl, which is a good way for him to avoid a dreaded L on his precious win-loss primary record.",
    "Flores outpaces Sanchez 24-19, with two other candidates, Democrat Rene Coronado and Republican Juana Cantu-Cabrera, taking 9% and 7%, respectively.",
    "The final third of the commercial praises Arballo, who was the 2020 nominee in the old 22nd District, as someone who \"rejects corporate PAC money.\"",
    "Senate\n? NC-Sen: Rep. Ted Budd's allies at the Club for Growth are out with a new survey from WPA Intelligence that shows him defeating former Gov.",
    "? KY-Gov: State Agriculture Commissioner Ryan Quarles said Saturday that he was entering next year's Republican primary to take on Democratic Gov.",
    "Wardynski and Strong are the only candidates who have brought in a serious amount of money in the contest to succeed Senate candidate Mo Brooks.",
    "Krueger ran again in the 1984 race to succeed the retiring Tower only for future Rep. Lloyd Doggett to narrowly deny him a place in the runoff.",
    "Pat McCrory 43-23 in the May 17 Republican primary, which is an improvement from the congressman's 44-31 edge a little less than a month ago.",
    "But the news isn't good for five-term Attorney General Lawrence Wasden, as Zoldak shows former Rep. Ral Labrador narrowly leading him 36-33.",
    "We haven't seen any other polls all year testing Little's prospects against McGeachin, a far-right favorite who sports Trump's endorsement.",
    "Plenty of local GOP voters will be asking who the hell Kuehl is too, since he ended March with a negative balance in his campaign account.",
    "The UFC forbade Penn from fighting again in 2019 after videos showed him involved in a bar brawl, though he was not arrested or charged.",
    "Polls close at 6 PM ET in the portion of Indiana located in the Eastern Time Zone, while the rest of the state follows an hour later.",
    "The main event is Ohio's massively expensive Republican primary for the state's open Senate seat, where venture capitalist J.D.",
    "The new GOP gerrymander shifted this Miami-based seat from a 51-48 Biden constituency to one that Trump would have taken 50-49.",
    "\"David McKinley has always opposed reckless spending,\" says Manchin, while \"Alex Mooney has proven he's all about Alex Mooney.\"",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The Freedom Caucus then goes after the commissioner for daring to donate to George W. Bush and Mitt Romney but not Trump.",
    "Every poll we've seen in the last few weeks has found Kemp taking the majority he needs to avert a June runoff.",
    "Krueger, however, eventually returned to office in 1990 by winning a spot on the powerful Railroad Commission.",
    "Voting concludes in Ohio at 7:30 PM ET, and our live coverage will begin then at Daily Kos Elections.",
    "Alvarado became incumbent Matt Bevin's running mate in 2019 after the then-governor ejected Lt. Gov.",
    "Baker, though, has shown no obvious interest in abandoning either his party or his retirement plans.",
    "A hefty 41% are undecided, which makes it especially hard to draw any conclusions from this survey.",
    "The ad does not mention Wardynski, who recently made a remarkably stiff appearance in his own spot.",
    "(Russell, who is termed out next year, already said he'd resign to pursue his aborted Senate bid.)",
    "Jenean Hampton from his ticket, but the duo narrowly lost to Beshear and Jacqueline Coleman.",
    "Governors\n? GA-Gov: Republican firm InsiderAdvantage's new poll for Fox5 Atlanta shows Gov.",
    "That same day, Higgins' campaign manager also confirmed his boss would challenge Salazar.",
    "(Strong maintains that he took action to protect that Confederate monument from damage.)",
    "You can find details on these contests, as well as a whole lot more, in our preview.",
    "\"Now I don't know Steve,\" Trump continued, who he said was a nice guy he just met.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "(Next week will bring us contests in Nebraska and West Virginia.)",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "? HI-Gov: Former Ultimate Fighting Championship champion B.J.",
    "Janice McGeachin 60-29 in the May 17 Republican primary.",
    "That's how we lower costs and get through these times.\"",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Donate $5\nDonate $25\nDonate $15\n\nDonate $5 monthly",
    "Ad Roundup\nOH-Sen: Protect Ohio Values - pro-J.D.",
    "There's also several big House contests to see.",
    "\"Good luck, Steve, whoever the hell you are.\"",
    "Subscribe to our podcast, The Downballot!",
    "He held that job in 1993 when Gov.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Ohio Republican J.D.",
    "Please read it.",
    "Andy Beshear."
  ]
}