{
  "id": 1802,
  "mediaId": 238,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Trump's endorsements in the 2022 Republican primaries",
  "image": "https://www.washingtonpost.com/elections/interactive/2022/trump-endorsements-republican-primaries/img/candidates/avatar2.svg",
  "link": "https://www.washingtonpost.com/elections/interactive/2022/trump-endorsements-republican-primaries/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    1801,
    1801,
    2087,
    2087,
    2137,
    2137,
    1147,
    1147,
    428,
    428,
    571,
    571,
    525,
    525,
    2934,
    2934
  ],
  "sentences": [
    "Trump had originally backed Sean Parnell in Pennsylvania's U.S. Senate race, and falsely claimed Parnell  who lost by two percentage points in 2020  was robbed in his congressional run in the Crime of the Century  the 2020 President Election Scam.? Parnell dropped out of the Senate race following allegations of domestic and other abuse.",
    "Brian Kemp, allowed massive Election Fraud to take place.? For the state's attorney general's race, Trump called the current Republican holding office a Do Nothing? attorney general, saying, [Chris] Carr did absolutely nothing to stop the 2020 Presidential Election Fraud.?\nFull list of Trump's endorsees",
    "Trump endorsements in other statewide races\nTrump's endorsements for state-level offices such as governor and secretary of state are his most clear effort to punish officials he wrongly believes delivered the 2020 election to Joe Biden.",
    "But his seemingly random endorsement strategy is potentially risky: While many of his picks are incumbents expected to sail to reelection, he has also weighed in on competitive primaries that expose fractures in the Republican Party.",
    "Trump dropped his endorsement of Rep. Mo Brooks in the U.S. Senate race in Alabama, accusing the strong Trump supporter of making a horrible mistake? by abandoning talk of the 2020 election.",
    "Former president Donald Trump is flexing his political influence in this year's Republican primaries, backing his favored candidates in hotly contested statewide and congressional races.",
    "Trump has thrown his support behind more than a dozen Senate candidates so far, with May primaries being the first test of his ability to lift trailing candidates to victory.",
    "The Post is tracking his endorsements  through news releases and declarations at rallies or other venues  in statewide and federal primary elections this year.",
    "He has endorsed a primary challenger against all but one House Republican  Rep. David G. Valadao (Calif.)  who voted in favor of his impeachment last year.",
    "His endorsement of a candidate is most often tied to their efforts to confirm election fraud in states he continues to falsely claim were stolen from him.",
    "The races ahead present a real-time test of whether Trump's influence on Republican voters is waning nearly two years after he lost the presidency.",
    "Trump endorsements for U.S. Senate\nRepublicans need to flip only one Senate seat to take the majority in the evenly divided chamber.",
    "Trump has signaled that he believes the key to a potential run for president in 2024 is showing that he can still shape the GOP.",
    "The other, embattled Attorney General Ken Paxton (R), was forced into a runoff against state land commissioner George P. Bush.",
    "Trump released another slew of endorsements in noncompetitive races days ahead of the May 3 primaries in Ohio and Indiana.",
    "Trump endorsements for U.S. House\nIn the House, Trump's endorsements are about rewarding loyalty and settling scores.",
    "In Georgia, Trump has thrown his support behind gubernatorial candidate David Perdue, claiming the incumbent, Gov.",
    "His endorsements of Vance and Mehmet Oz in Pennsylvania have resulted in cash windfalls for the candidates.",
    "All but one of Trump's 33 endorsees  of whom 25 were incumbents  won in Texas's early-March primaries.",
    "for reelection without mentioning Pence's brother, the former vice president, in the statement.",
    "In Ohio's crowded primary race, Trump's own advisers tried to dissuade him from endorsing J.D.",
    "His winning record is sure to be boosted by the more than 50 incumbents he has backed so far.",
    "Vance, whose campaign was lagging in the polls until the former president intervened.",
    "I'm the king of endorsements,? Trump told The Washington Post on April 6.",
    "Brooks had struggled to win support despite Trump's initial backing.",
    "Notably, Trump endorsed Rep. Greg Pence (R-Ind.)"
  ]
}