{
  "id": 1805,
  "mediaId": 1576,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Supreme Court decision could quickly curtail abortion access in Georgia  and shake up midterms",
  "image": "https://www.wabe.org/app/uploads/2022/05/AP22060723692583-336x189.jpg",
  "link": "https://www.wabe.org/supreme-court-decision-could-quickly-curtail-abortion-access-in-georgia-and-shake-up-the-midterms/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    809,
    854,
    1078,
    1365,
    1389,
    1951,
    2087,
    2095,
    2428,
    2507,
    146,
    147,
    428,
    482,
    545,
    562,
    2672
  ],
  "sentences": [
    "Kemp led the fight to pass the strongest pro-life bill in the country and championed the law throughout legal challenges.?\nA Supreme Court decision overturning Roe could also open the door for Georgia to pass a total abortion ban  or even new legislation on same-sex marriage or contraception.",
    "And that will never change.?\nAssuming Democrats do not gain control of the General Assembly and do not have the votes to enshrine abortion rights into Georgia law, Pate says a Democratic Georgia governor or attorney general couldn't just decide not to enforce a restrictive abortion law.",
    "And if that's gutted, that opens up the floodgates to reconsidering lots of legislation.?\nRepublican David Perdue, the former U.S. senator now running for governor, said that if he were governor, he would call the legislature back into session to pass a total abortion ban.",
    "Democrat Stacey Abrams, who's running to unseat him, said on Tuesday that as governor she would defend the right to an abortion.?\nSixty-eight percent of Georgia voters oppose overturning Roe v. Wade, according to a January poll by the Atlanta Journal-Constitution.",
    "U.S. Rep. Nikema Williams, chair of the Georgia Democratic Party, wrote in a statement that if the Supreme Court overturns Roe v. Wade, the midterm elections in Georgia will be a referendum on reproductive freedom.?\nIn 2019, Republican Gov.",
    "In the meantime, we will continue to vigorously defend Georgia's Heartbeat Bill in federal court.?\nDemocrat Jen Jordan, a state senator running for attorney general, highlighted Carr's defense of the Georgia abortion law.",
    "We are aware that an initial draft opinion in the Dobbs case has been leaked to the media, and we will reserve comment until the U.S. Supreme Court has issued its official decision, spokesperson Kara Richardson said.",
    "But he says there could be a scenario where district attorneys in Democratic-leaning Fulton or DeKalb counties, for example, do not bring prosecutions against abortion providers, but DAs in Republican counties do.",
    "Not only that, the leaked draft of the high court's ruling is already jolting the 2022 midterms as Democrats gear up for a fight over abortion rights on the campaign trail and at the state Capitol.",
    "A U.S. Supreme Court decision to overturn Roe v. Wade, the landmark ruling that has guaranteed abortion rights for roughly half a century, could quickly curtail access to abortion in Georgia.",
    "If this decision holds, Georgia is the next battleground for reproductive freedom, and we need an attorney general who will fight for our right to choose,? Jordan wrote on Twitter.",
    "The law has been tied up in the U.S. Court of Appeals for the 11th Circuit, which held off on a ruling once the Supreme Court decided to hear Mississippi's abortion case.",
    "And if the Supreme Court's ruling is as broad as the leaked order, the circuit court will almost certainly allow Georgia's restrictive abortion law to take effect.",
    "With Kemp and other state executives up for reelection, as well as state legislators, the court's decision on abortion only elevates the stakes of those races.",
    "As a pro-choice pastor, I've always believed that a patient's room is way too small for a woman, her doctor, and the United States government,? Warnock wrote.",
    "U.S. Sen. Raphael Warnock, a vulnerable Democrat up for reelection this fall, fired off a tweet not long after the draft opinion leaked Monday night.",
    "They have also laid the groundwork in statehouses, solidifying conservative majorities with the votes to pass restrictive state abortion laws.",
    "On Tuesday, the Supreme Court confirmed the authenticity of the draft decision, but noted it does not represent a final ruling.",
    "But doing so could have consequences for the general election in November, when he will be trying to woo a broader electorate.",
    "Brian Kemp signed a bill banning most abortions about six weeks into a pregnancy, before most people know they are pregnant.",
    "Attorney Page Pate says the circuit court is likely to rule quickly once the Supreme Court hands down its ruling.",
    "For years, Republicans have methodically confirmed conservative judges, paving the way for such a ruling.",
    "Georgia is a state that values life at all stages,? Kemp's office wrote in a statement.",
    "The leak amped up pressure on Democrats in Congress to codify the right to an abortion.",
    "The basic premise of Roe was built on the constitutional right of privacy,? Pate says.",
    "Republican Attorney General Chris Carr's office weighed in on Tuesday afternoon.",
    "In the midst of a primary challenge, Kemp could be pressed to agree.",
    "That law was never implemented, but that could change soon.",
    "I'll always fight to protect a woman's right to choose.",
    "But that won't likely be the case for much longer.",
    "Kemp has not weighed in on that question.",
    "Trending",
    "Gov."
  ]
}