{
  "id": 1814,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "May Madness: Primary season ignites in earnest kicking off with Ohio",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c5744de2-b3c3-448d-82c7-03a53f93a2dc/f3adf6fd-6a4f-411d-a3d1-b2e9ebb8f228/1280x720/match/931/524/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/may-madness-primary-season-ignites-earnest",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    946,
    1801,
    2095,
    2136,
    2491,
    571,
    2614,
    2672,
    2845
  ],
  "sentences": [
    "McCormick and Oz are part of a GOP field of eight contenders that also includes Jeff Bartos, a real estate developer, philanthropist and 2018 Republican nominee for lieutenant governor; veteran and conservative political commentator Kathy Barnette; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark during the Trump administration.",
    "The top two candidates are Mehmet Oz, the cardiac surgeon, author and well-known celebrity physician who until the launch of his Senate campaign late last year was host of TV's popular \"Dr. Oz Show;\" and David McCormick, a former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official in former President George W. Bush's administration.",
    "And all but one of the top five contenders for months had been making hard pitches to land the endorsement of Trump, who more than 15 months removed from the White House remains the most popular and influential politician in the GOP as he continues play a kingmaker's role in Republican primaries and repeatedly hints about making another presidential run in 2024.",
    "The Republican gubernatorial primary is a wide-open battle that includes former Rep. Lou Barletta, State Senate leader Jake Corman, Montgomery County commissioner Joe Gale, political strategist Charlie Gerow, former Rep. Melissa Hart, former U.S. Attorney William Mc Swain, state Sen. Doug Mastriano, and former Delaware County council member Dave White.",
    "McCormick and Oz are the two polling front-runners in the primary race and have vastly outspent the other candidates to run ads across the Keystone State, as they fight to win the Republican primary in a crucial general election contest that's one of a handful that could determine whether the GOP wins back the Senate majority.",
    "Things got so heated that two leading contenders - 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker, and former Ohio treasurer and former two-time Senate candidate Josh Mandel - nearly came to blows at a debate.",
    "With many of the leading Republican candidates able spend millions on their own bids, and with well-financed super PACs backing many of the major contenders, the race has become one of the most expensive in the nation to date this cycle.",
    "May 17: Pennsylvania Senate and gubernatorial primaries\nThe key general election battleground state of Pennsylvania is holding high-profile primaries in the races to succeed retiring GOP Sen. Pat Toomey and term-limited Democratic Gov.",
    "While the former president's backing  and an ensuing Trump/Vance rally in Ohio  helped Vance surge in the polls, the latest surveys  including one from Fox News - indicate the race remains competitive, with plenty of voters undecided.",
    "As the leading candidates tried to one up each other in showcasing their support and loyalty to Trump, the nomination battle turned increasingly antagonistic, with the candidates and outside groups backing them attacking each other.",
    "Senate candidate JD Vance, left, greets former President Donald Trump at a rally at the Delaware County Fairgrounds, Saturday, April 23, 2022, in Delaware, Ohio, to endorse Republican candidates ahead of the Ohio primary on May 3.",
    "And Ricketts, whose wealthy family owns Major League Baseball's Chicago Cubs, along with his father  billionaire TD Ameritrade founder Joe Ricketts  have contributed big bucks to an outside group slamming Herbster in TV ads.",
    "The GOP Senate primary, like its counterpart in neighboring Ohio, quickly turned into a crowded, divisive, and extremely expensive contest that's included plenty of attack ads as well as a last-minute endorsement from Trump.",
    "The contests in the neighboring Midwestern states kick off a frenetic schedule this month, with 13 states  including the crucial general election battlegrounds of North Carolina, Pennsylvania and Georgia - holding primaries.",
    "And outside groups backing each candidate have spent tens of millions of dollars in recent months to launch attack ads against McCormick and Oz in a race that's become the most expensive Senate showdown in the country.",
    "The two candidates traded fire for months over a host of issues, including who is tougher or softer on China, charges that McCormick outsourced Pennsylvania jobs, Oz's dual citizenship in Turkey, and over fracking.",
    "Ryan is considered the favorite for the Democratic nomination in the race that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "FIRST ON FOX: KEMP BRINGS IN BIG BUCKS AS HE FACES TRUMP-BACKED PRIMARY CHALLENGE FROM PERDUE\nFour years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "Democrats have coalesced around former state Supreme Court Chief Justice Cheri Beasley  who made history as North Carolina's first Black state supreme court chief justice - as their Senate nominee.",
    "THIS STATE HAS THE MOST EXPENSIVE SENATE RACE IN THE COUNTRY\nWhile all the top contenders made a hard sell for Trump's endorsement, the former president a couple of weeks ago decided to back Oz.",
    "But Kemp earned Trump's ire starting in late 2020, after the governor certified President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "But regardless of Trump's endorsement, with three weeks to go until Georgia's primary, Kemp enjoys large leads over Perdue in two key campaign metrics  public opinion polling and fundraising.",
    "On Tuesday voters in Ohio choose between the Trump-backed JD Vance for an open U.S. Senate seat and several other contenders who spent months clamoring for the former president's support.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "And even though his name's not on the ballot, Donald Trump is very much on the line in the May primaries, as the former president's made endorsements in key GOP primary showdowns.",
    "John Fetterman is the polling front-runner in the Democratic Senate primary, in an increasingly combative race that also includes Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "Perdue declared his candidacy a few days after Abrams, a voting rights champion and rising star in the Democratic Party, launched her second straight bid for governor.",
    "May 17: North Carolina GOP Senate primary\nAs with Ohio and Pennsylvania, the key battleground state of North Carolina is also home to a combative GOP Senate primary.",
    "In the gubernatorial primary, the Democrats have closed ranks around Pennsylvania Attorney General Josh Shapiro, who is considered the party's presumptive nominee.",
    "May 3: Ohio GOP Senate primary\nThe race for the GOP Senate nomination in Ohio has been one of the most crowded, combustible and expensive primaries in the nation.",
    "The top candidates are Charles Herbster, a multimillionaire agricultural executive, multimillionaire hog farmer Jim Pillen and state Sen. Brett Lindstrom.",
    "Candidates and outside groups have shelled out $69.8 million in the Ohio GOP Senate primary, according to AdImpact, a leading national ad tracking firm.",
    "At stake  crucial party nominations for senator that could influence whether the GOP's able win back the chamber's majority in November's midterms.",
    "Ricketts, the co-chair of the Republican Governors Association, is backing Pillen and has spent months slamming Herbster as unfit to hold office.",
    "Herbster, who in recent weeks has faced multiple accusations that he sexually assaulted eight women, is a longtime top donor and ally of Trump.",
    "Trump for months urged Perdue to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "(AP Photo/Joe Maiorana, File) (AP)\nTrump stayed neutral until a few weeks ago, when he endorsed venture capitalist and bestselling author J.D.",
    "Brian Kemp of Georgia is facing a Republican primary challenge from former Sen. David Perdue, who enjoys the backing of the former president.",
    "Pete Ricketts of Nebraska has turned into a heated three-way fistfight that's grabbed attention far beyond the Great Plains state's borders.",
    "The winner of the GOP primary may face off in November's general election against longtime Democratic Rep. Tim Ryan of northeastern Ohio.",
    "But for months Budd was unable to leverage the former president's endorsement to boost his poll numbers and fundraising figures.",
    "And voters will also choose their party's nominees for governor, the House of Representatives, and other down ballot contests.",
    "By comparison, only $3.4 million has been spent by candidates and outside groups in the Democratic Senate primary.",
    "The former president endorsed Herbster last autumn and held a rally with the candidate in Nebraska on Sunday.",
    "But in recent weeks Budd has surged to front-runner status in the increasingly contentious primary showdown.",
    "To date, Texas is the only state in the nation to have already held primary elections this year.",
    "May 10: Nebraska GOP gubernatorial primary\nThe battle to succeed term-limited Republican Gov.",
    "And he's headed to Pennsylvania on Friday to team up with the celebrity doctor at a rally.",
    "But that all changes on Tuesday, as voters in Ohio and Indiana head to the polls.",
    "Eight candidates are running to try and succeed retiring Republican Sen.",
    "May 24: Georgia GOP gubernatorial primary\nConservative Gov.",
    "Here's a look at some key primary battles this month.",
    "The top contenders are Rep. Ted Budd, former Gov.",
    "Trump surprised many by endorsing Budd last June.",
    "Pat McCrory, and former Rep. Mark Walker.",
    "Trump has remained neutral in the race.",
    "Rob Portman.",
    "Tom Wolf.",
    "Lt. Gov.",
    "Vance."
  ]
}