{
  "id": 1817,
  "mediaId": 1546,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump: Republican Political Kingmaker or Political Meddler?",
  "image": "https://gdb.voanews.com/02d10000-0aff-0242-b7be-08da2c620bcb_cx0_cy6_cw0_w1023_r1_s.jpg",
  "link": "https://www.voanews.com/a/trump-republican-political-kingmaker-or-political-meddler-/6553935.html",
  "mediaOutlet": "VOA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Bredemeier",
  "authorUrl": "https://www.voanews.com/author/ken-bredemeier/k-iqi",
  "termIds": [
    946,
    1147,
    1801,
    2087,
    2095,
    146,
    428,
    571,
    2959
  ],
  "sentences": [
    "The United States is about to get its first significant reading on how much political clout Trump retains over the Republican Party 16 months after he played a role in hundreds of his supporters storming the U.S. Capitol to protest his 2020 election defeat and then left Washington as Democrat Joe Biden became president.",
    "Several of the Ohio Republican Senate contenders actively sought Trump's endorsement but the former president went with Vance even though he had criticized Trump's 2016 candidacy, saying then that his \"actual policy proposals, such as they are, range from immoral to absurd\" and describing Trump as \"reprehensible.\"",
    "In Pennsylvania\nA week later, on May 17 in the Eastern state of Pennsylvania, which Trump lost in the 2020 election, he is backing the Senate candidacy of a celebrity television doctor, Mehmet Oz, in his run for an open seat after Republican Senator Pat Toomey announced he would be retiring.",
    "Trump's first choice in the Senate race in Pennsylvania was not Oz but rather Sean Parnell, an Army veteran and former congressional candidate who dropped out of the race late last year after losing a custody battle with his estranged wife over primary custody of their three children.",
    "But Vance, as he transformed himself into a politician, recanted his views about Trump, saying, \"I ask folks not to judge me based on what I said in 2016, because I've been very open that I did say those critical things and I regret them, and I regret being wrong about the guy.",
    "Trump angrily had an assistant send a vulgar message to Club for Growth president David McIntosh protesting the broadcasting of the ad, but the group, rather than backing off, responded by saying it would increase its spending on the anti-Vance ad with his attacks on Trump.",
    "The Club for Growth, a national pro-Republican anti-tax group and often a Trump ally, had already endorsed one of Vance's opponents, Josh Mandel, a former state treasurer who has pledged that if he wins, he will take on \"squishy establishment\" Republicans in Washington.",
    "To that end, he has endorsed nearly 130 Republican candidates in coming party primary elections  state legislative and congressional contenders and incumbents  who share his political vision, with many of them also embracing his contention that Biden fraudulently won.",
    "A grand jury is convening in the state capital of Atlanta to investigate his possibly criminal efforts in a taped telephone call he made to try to convince a state election official to \"find\" him one more vote than he needed to overtake Biden's 11,779-vote victory.",
    "Next up is the May 10 party primary in the staunchly conservative Midwestern state of Nebraska, where Trump on Sunday rallied with gubernatorial contender Charles Herbster, a businessman who has advised Trump on agricultural policy and donated to his campaigns.",
    "In supporting Walker, Trump has ignored advice from Washington Republican political analysts that Walker is a flawed candidate after he acknowledged abusing his former wife, who accused him of holding a pistol to her head and \"extremely threatening behavior.\"",
    "It is a memoir of Vance's upbringing in Ohio and acts in part as an explanation of why white working-class voters became enamored of Trump during his successful run for the presidency in 2016 and subsequent loss for reelection two years ago.",
    "Three other contenders narrowly trailed Vance in the latest polling, giving them a chance as well in the Tuesday election: Ohio State Senator Matt Dolan, businessman Mike Gibbons, and former Ohio Republican chairwoman Jane Timken.",
    "\"As all the other candidates up here have outlined, under the cover of COVID, there were draconian changes made to our voting laws by Democratic leadership, and they have blocked appropriate reviews of some of those decisions.",
    "Those decisions have not stopped Trump from making the election fraud claims and endorsing his most ardent supporters, even as other key Republicans and interest groups aligned with the party have endorsed their opponents.",
    "Oz's key opponent appears to be David McCormick, a former hedge fund executive and undersecretary of the Treasury for international affairs during the administration of former Republican President George W. Bush.",
    "He could now be positioned to win the Republican Senate nomination with just a quarter of the primary vote to run in the November general election against the likely Democratic nominee, Congressman Tim Ryan.",
    "Trump, who retains a wide Republican following, to this day claims he was cheated out another four-year term in the White House and has teased making another run for the presidency in 2024.",
    "According to recent polling, Trump's mid-April endorsement of the 37-year-old Vance immediately doubled his share of the vote and pushed him to a narrow lead in the crowded field.",
    "Trump's anger over his loss in the southern state  the first for a Republican presidential candidate in Georgia since 1992  has spilled over to the state's gubernatorial primary.",
    "After Trump's Vance endorsement, Club for Growth immediately started airing television ads showing Vance's repeated 2016 attacks on then-presidential candidate Trump.",
    "The first test comes Tuesday in the Midwestern state of Ohio, which Trump easily won in the 2020 election, where he has endorsed the Senate candidacy of J.D.",
    "Trump is also supporting Herschel Walker, a former professional football player for a Trump-owned team, for the Republican Senate nomination in the state.",
    "Polls show Walker far ahead in his maiden bid for elected office and will likely face Democratic Senator Raphael Warnock in the November general election.",
    "Court after court has ruled that the scant irregularities that may have occurred in 2020 would not have been sufficient to overturn Biden's victory.",
    "Trump is opposing Kemp's reelection because he claims Kemp did not do enough two years ago to help him overturn Biden's victory in the state.",
    "Polling in the state, however, shows Kemp with a substantial lead over Perdue, who lost his Senate seat in a run-off election in early 2021.",
    "We have to be serious about what happened in 2020, and we won't be able to address that until we can really look under the hood.\"",
    "I think he was a good president; I think he made a lot of good decisions for people, and I think he took a lot of flak.\"",
    "But Vance's six-year-old attacks on Trump quickly reemerged as a point of contention in the Republican primary.",
    "Washington \nIs former U.S. President Donald Trump a Republican political kingmaker or just a political meddler?",
    "In Georgia\nLast up on the May political primary calendar is Georgia, on the 24th, a state Trump lost in 2020.",
    "In Nebraska\nTrump's grip on Republican politics will also be tested this month in three other states.",
    "Senator David Perdue in his race for the state governorship over incumbent Governor Brian Kemp.",
    "\"I have discussed it with President Trump and we cannot move on,\" Oz said at a recent debate.",
    "All of them have collected endorsements from various state and national Republican figures.",
    "A judge ruled that Parnell had committed some abusive acts toward his wife in the past.",
    "Oz, echoing Trump, is disputing the outcome of the 2020 presidential election.",
    "Herbster is denying allegations that he has sexually assaulted multiple women.",
    "Some of those Trump is supporting have also been accused of abusing women.",
    "\"A lot of people, they look at you and say: you don't have to do it, sir.",
    "Trump called Herbster a \"very good man\" who had been \"maligned.\"",
    "\"I defend people when I know they're good,\" Trump said.",
    "Vance, author of a book called \"Hillbilly Elegy.\"",
    "The first answers are coming in the month of May.",
    "Trump has endorsed former Republican U.S.",
    "I defend my friends.\""
  ]
}