{
  "id": 1826,
  "mediaId": 237,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "GOP voters have largely forgiven Ohio Gov. DeWine for peak COVID-19 restrictions",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/3aee9d6/2147483647/strip/true/crop/2518x1322+236+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fa2%2F71%2Faf87b99148a499624b8a59d31820%2Fap22104015048200.jpg",
  "link": "https://www.washingtonexaminer.com/news/gop-voters-have-largely-forgiven-ohio-gov-dewine-for-peak-covid-19-restrictions",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    689,
    806,
    819,
    1147,
    1718,
    2095,
    428,
    2623,
    2845
  ],
  "sentences": [
    "Although former President Donald Trump has not made an endorsement in Ohio's Republican gubernatorial primary, a few self-identified Ohio voters at his rally on April 23 told the Washington Examiner that they planned to support candidates other than DeWine in the primary.",
    "With days remaining before the state's May 3 primary, polling shows DeWine leading a Republican field that also includes former Rep. Jim Renacci, businessman and farmer Joe Blystone, and former state Rep. Ron Hood.",
    "DeWine's primary opponents said that his approach to the pandemic hurt business and cost jobs, while the governor has defended his approach as pragmatic in response to a public health crisis.",
    "DeWine, a staunch conservative in many respects, including the enactment of tax cuts and anti-abortion measures, took what he characterized as a balanced approach to the COVID-19 pandemic.",
    "Early on, in spring 2020, DeWine's administration implemented some social distancing requirements, as well as restrictions on some public spaces and businesses.",
    "Trump won Ohio, which may have helped DeWine escape the wrath he showed other Republican officials who did not back his claims, such as Georgia Gov.",
    "The restrictions were lifted months ago, but those actions sparked outrage from some conservatives in the state, including his primary challengers.",
    "But the anti-DeWine vote appears to be split among multiple candidates, placing the incumbent governor on a path to win renomination.",
    "DeWine co-chaired Trump's 2020 campaign in Ohio but afterward did not embrace Trump's unfounded claims that the election was stolen.",
    "Ohio was one of the first states to implement these restrictions but also one of the first states to lift them.",
    "A RealClearPolitics average of polls showed DeWine leading the Republican primary field by 16.5%.",
    "Mike DeWine appears poised to stave off a primary challenge and win renomination from his party.",
    "Were there one anti-DeWine challenger, polls indicate it would be a much closer race.",
    "DeWine, 75, recently recovered from COVID-19.",
    "Just In...\nCOLUMBUS, Ohio  Republican Gov.",
    "Brian Kemp."
  ]
}