{
  "id": 1832,
  "mediaId": 1576,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Georgia's Brian Kemp raises $2.7M for reelection bid",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP21266659872036-336x189.jpg",
  "link": "https://www.wabe.org/georgias-brian-kemp-raises-2-7m-for-reelection-bid/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1664,
    1896,
    2095,
    3082
  ],
  "sentences": [
    "After an earlier ruling that Kemp could not spend money from the committee against Perdue, U.S. District Judge Mark Cohen ruled last week that Kemp's Georgians First Leadership Committee cannot solicit or receive contributions until after the primary election and any possible runoff that makes him the Republican nominee for governor.",
    "Kemp's main campaign committee, like other sitting state officials, is barred from raising money while state lawmakers are meeting, meaning Kemp raised the money in the 26 days following the April 4 end of the session.",
    "The $10.7 million in cash on hand is down from $12.7 million as of Jan. 31, reflecting Kemp's heavy spending as he tries to fend off a primary challenge from former U.S. Sen. David Perdue and other Republicans.",
    "The totals don't count Kemp's leadership committee, a special state fundraising vehicle that allowed the governor to collect unlimited contributions and coordinate spending with his campaign.",
    "A picture with Trump meant contributing $24,200, the maximum individual contribution for Georgia in this election cycle, including a primary, general election and two possible runoffs.",
    "Brian Kemp said Monday his main campaign committee raised $2.7 million in the period that ended April 30, giving him $10.7 million in cash as the May 24 Republican primary approaches.",
    "Both Perdue and Abrams sued over the committee, saying it was unfair that Kemp could take in large amounts while Perdue and Abrams were barred until they won their party primaries.",
    "After having less than $1 million in cash on hand at the end of January, Perdue hinted he would crack his own $50 million fortune to try to keep up with Kemp's spending.",
    "None of Kemp's Republican primary rivals, who also include Kandiss Taylor, Catherine Davis and Tom Williams, have yet filed reports or announced totals.",
    "Perdue has struggled to tap the same network of big donors that sustained his two Senate runs, despite his endorsement by former President Donald Trump.",
    "The momentum is with our campaign, and we will continue to outwork our competition to secure wins in May and November,? Saparow said in a statement.",
    "The Republican nominee will face Democrat Stacey Abrams, who displayed her fundraising power by raking in $9.25 million in December and January.",
    "Trump hosted a fundraiser for Perdue at his at his Mar-a-Lago resort in Florida, where contributors had to give $3,000 to attend.",
    "Kemp campaign manager Bobby Saparow predicted that totals would show Kemp has continued to build a fundraising advantage.",
    "The campaign said in March that Kemp would spend $4.2 million on television advertising alone before the primary.",
    "The results of that fundraiser will show up in Perdue's report this week.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "Reports are due later this week.",
    "Georgia Gov."
  ]
}