{
  "id": 1838,
  "mediaId": 129,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Georgia Jury to Consider Whether Trump Illegally Interfered in 2020 Election",
  "image": "https://static01.nyt.com/images/2022/05/02/us/02TRUMP-ATLANTA01/merlin_181984950_0211a608-0e46-4d1c-ac6b-22e2b88599d9-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/02/us/trump-election-georgia-grand-jury.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1039,
    1147,
    1660,
    2087,
    2095,
    2203,
    2555,
    2670,
    2672,
    2910
  ],
  "sentences": [
    "Among them, potentially, are a call that Mr. Graham made to Mr. Raffensperger asking whether mail-in votes could be discarded in counties with high rates of questionable ballot signatures; a visit Mr. Meadows made to suburban Atlanta to monitor an election audit there; and postelection appearances that Mr. Giuliani made before state legislative committees in which he asked for an alternative pro-Trump slate of electors to be appointed.",
    "In the Georgia case, a group of legal experts, in an analysis published last year by the Brookings Institution, wrote that the call to Mr. Raffensperger, and other postelection moves by Mr. Trump, put the former president at substantial risk? of criminal charges in Georgia, including racketeering, election fraud solicitation, intentional interference with performance of election duties and conspiracy to commit election fraud.",
    "Jason Miller, a senior adviser to Mr. Trump, has called the Fulton County investigation a politically motivated witch hunt.?\nIn an interview last month with The Atlanta Journal-Constitution, Ms. Willis said she would wait until after Georgia's May 24 primary election to bring witnesses to testify before the special grand jury in an effort to avoid the appearance of her seeking to influence state politics.",
    "Mr. Trump planned to hold a call-in tele-rally? on Monday evening for Mr. Kemp's opponent, former Senator David Perdue, who has falsely claimed that Mr. Kemp allowed radical Democrats to steal our election.?\nSecurity at the downtown courthouse on Monday was tight, with streets around the court complex closed to traffic, and a heavy law enforcement presence inside and outside the buildings.",
    "Brian Kemp after the election and asked him to call a special election to get to the bottom? of a big election-integrity problem in Georgia.? Mr. Trump also called Chris Carr, the state attorney general, asking him not to oppose a lawsuit challenging the election results in Georgia and other states, and Mr. Raffensperger's chief investigator, asking her to find dishonesty? in the election.",
    "There's a lot more than just the phone call,? said Mr. Kreis, who added that the case involved areas of the law that were underdeveloped.?\nWe don't have a lot of claims or potential claims that someone violated Georgia law by soliciting election fraud, because you'd have to be pretty crazy to go to the secretary of state's office to demand a change in vote tabulations,? he said.",
    "ATLANTA  As the criminal investigation of Donald J. Trump by Manhattan prosecutors appears to be stalling out, the separate investigation into whether the former president and his allies illegally interfered with Georgia's 2020 election results took a significant step forward on Monday, as 23 people were chosen to serve on a special investigative grand jury.",
    "Some legal experts have said the inquiry could be perilous for Mr. Trump, who, in a January 2021 phone call, asked Georgia's secretary of state, Brad Raffensperger, to find? enough votes to put Mr. Trump ahead of his Democratic rival, Joseph R. Biden Jr., in Georgia's presidential election tally.",
    "The investigation is also likely to look at Trump allies who inserted themselves into election administration matters in Georgia, including Mr. Trump's personal lawyer, Rudolph W. Giuliani; Senator Lindsey Graham of South Carolina; and Mark Meadows, Mr. Trump's former chief of staff.",
    "These are things so brazen it's almost beyond belief.?\nMr. Trump has other legal challenges to overcome in the wake of his one-term presidency, all of them taking on greater importance given the fact that he appears to be positioning himself to make another presidential run in 2024.",
    "The investigation is within the purview of the Fulton County district attorney because many of the actions in question took place in or involved phone calls to officials in Fulton County, which includes the State Capitol building in downtown Atlanta and numerous government offices.",
    "Like the federal RICO law, which has been used to target the Mafia and other organized crime networks, Georgia's state racketeering statute is a tool that can be used to go after a broad range of groups that take part in patterns of criminal conduct.",
    "In addition to an investigation in Manhattan, the New York attorney general, Letitia James, is poised to bring a civil action in her investigation of fraudulent and misleading business practices by the Trump Organization, her staff has said in court.",
    "Mr. Kemp, Mr. Raffensperger and Mr. Carr, all Republicans, are facing high-profile primary challenges from candidates who have echoed Mr. Trump's unsubstantiated claims about election fraud in the state, and who have received Mr. Trump's endorsement.",
    "Ms. Willis said the security concerns had been escalated? by comments Mr. Trump made at an event in Texas in which he called the prosecutors focusing on him vicious, horrible people? who were racist? and mentally sick? and unfairly targeting him.",
    "Judge McBurney told potential jurors to announce that they had a potential conflict if they were convinced that a crime had definitely been committed in regard to the 2020 elections  or if they were convinced that no crimes at all had occurred.",
    "As part of their investigation, in July 2021, the Manhattan district attorney's office charged the Trump Organization and Allen Weisselberg, its chief financial officer, with orchestrating a 15-year scheme to evade taxes.",
    "Alvin L. Bragg, the Manhattan district attorney, is said to be concerned about the strength of the New York case, which focuses on whether Mr. Trump exaggerated the value of assets in annual financial statements.",
    "Anthony Michael Kreis, a law professor at Georgia State University, said that impaneling the grand jury was a sign that prosecutors had acknowledged the complexity, sensitivity and unique nature of the case.",
    "The ability of the special grand jury to subpoena witnesses and documents will help prosecutors, who have encountered resistance from some potential witnesses who have declined to testify voluntarily.",
    "In January, a majority of the judges in the Fulton County Superior Court system approved Ms. Willis's request for the special grand jury, allowing it to meet for up to a year beginning May 2.",
    "After the panel makes recommendations regarding criminal prosecutions, it will be up to Ms. Willis, a Democrat, to return to a regular grand jury to seek criminal indictments.",
    "Among other things, Ms. Willis has raised the possibility that Mr. Trump and his allies violated the state's Racketeer Influenced and Corrupt Organizations Act, known as RICO.",
    "McBurney of the Fulton County Superior Court told 200 potential jurors who had been called to a downtown Atlanta courthouse swarming with law enforcement agents.",
    "The panel will focus exclusively on whether there were unlawful attempts to disrupt the administration of the 2020 elections here in Georgia,? Judge Robert C.I.",
    "But now it's time for 26 members of our community to participate in that investigation,? he said, referring to the 23 jurors and three alternates.",
    "People close to the investigation have told The New York Times that the inquiry may lose steam if other witnesses do not step up to cooperate.",
    "The district attorney's office in Westchester County is looking into financial matters related to a golf course Mr. Trump's company owns.",
    "A judge recently held Mr. Trump in contempt in that case for failing to fully comply with a subpoena and began fining him $10,000 a day.",
    "The panel will have up to a year to issue a report advising District Attorney Fani T. Willis on whether to pursue criminal charges.",
    "that her office had received communications from persons unhappy with our commitment to fulfill our duties,? and asked the F.B.I.",
    "Ms. Willis noted that Mr. Trump called for large protests in Atlanta and elsewhere if prosecutors illegally pursued him.",
    "The meetings will be confidential, and jurors will not be allowed to discuss the proceedings outside of their meetings.",
    "And a federal grand jury has been empaneled to investigate the Jan. 6 attack on the U.S. Capitol by Trump supporters.",
    "The seating of the Georgia grand jury comes as a criminal inquiry in Manhattan has come to an apparent standstill.",
    "In addition to the call with Mr. Raffensperger, Mr. Trump has publicly described how he called Gov.",
    "The investigations into such matters were already underway, Judge McBurney said in court on Monday.",
    "But the judge noted that witnesses could speak about the proceedings publicly if they so wished.",
    "The special grand jurors will issue subpoenas, hear testimony and review documents.",
    "Proving that case would require a deep examination of multiple moving parts.",
    "In February, lawyers for both parties asked a judge to dismiss the charges.",
    "The Trump Investigations\nCard 1 of 6\nInvestigation into tax evasion.",
    "to provide intelligence and federal agents? for the courthouse.",
    "In January, Ms. Willis wrote to the F.B.I.",
    "Roughly 25 said they had such a conflict."
  ]
}