{
  "id": 1839,
  "mediaId": 43,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Morning Digest: Trump starts backing away from Perdue as yet another poll shows him getting walloped",
  "image": "https://images.dailykos.com/images/892263/story_image/GettyImages-1228685605.jpg?1607612415",
  "link": "https://www.dailykos.com/story/2022/5/2/2094860/-Morning-Digest-Trump-starts-backing-away-from-Perdue-as-yet-another-poll-shows-him-getting-walloped",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    837,
    946,
    1007,
    1147,
    1299,
    1454,
    1480,
    1646,
    1661,
    2095
  ],
  "sentences": [
    "? DSCC: The DSCC has reportedly made its initial TV ad reservations for this fall's Senate contests, allocating $33 million across six states:\nArizona: $7.5 million\nGeorgia: $7 million\nNevada: $8.4 million\nNew Hampshire: $4 million\nPennsylvania: $3 million\nWisconsin: $3 million\nDemocratic incumbents are currently defending Arizona, Georgia, Nevada, and New Hampshire, while Wisconsin has a GOP incumbent and Pennsylvania is a Republican open seat.",
    "? PA-Gov: The Philadelphia Inquirer's Andrew Seidman reports that \"most Pennsylvania Republican insiders\" are fretting that state Sen. Doug Mastriano, who recently addressed a QAnon-aligned conference, could win the May 17 primary and jeopardize the party's chances in the fall, but it remains to be seen if there will be any organized attempt to stop him.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nBig, big May primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0053:14\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? GA-Gov: As he always does when one of his endorsees starts to falter, Donald Trump is now inching away from his choice to unseat Gov.",
    "Notably, the DSCC is the first of the three groups with reported reservations that included New Hampshire, where Democratic Sen. Maggie Hassan is seeking a second term, while both they and SMP omitted North Carolina, a state Trump won by less than two points with a Republican-held open seat that SLF included on their defense list.",
    "There's still plenty of time, though, for Trump to disavow Perdue before the primary, but given the lack of alternativesTrump actually helped ease Kemp's other challenger, former state Rep. Vernon Jordan, out of the race in Februaryand his towering hatred of the incumbent, he may just stick with the ex-senator until the very end.",
    "The former prosecutor himself got some incredibly bad news weeks ago when his old boss, Donald Trump, implored Republicans not to vote for him, but McSwain is still strong in one area: Seidman writes that he has $3.4 million in TV ads reserved for the primary, more than many of his numerous intra-party rivals.",
    "A recent survey from Data Targeting for Neilan Strategy Group, which said it wasn't working on behalf of any candidate or allied group, found things comparably close, though the order of the candidates was different: That firm gave Lindstrom a 28-26 advantage over Herbster, while Pillen took third with 24%.",
    "SurveyUSA shows incumbent Brad Raffensperger leading Trump's endorsed candidate, Rep. Jody Hice, 31-20, while UGA recently had Raffensperger ahead by a considerably smaller 28-26; still, both polls have him well below the majority he'd need to avoid a second round in June, and many voters undecided.",
    "A newly established group called Pennsylvania Patriots for Election Integrity has launched a TV buy in rural areas that, improbable as it sounds, tries to out-Big Lie the Big Lie fanatic by claiming Mastriano \"failed to audit the 2020 election,\" but so far only $250,000 is going to the effort.",
    "But Trump's approach is even more confused than usual, since as the Atlanta Journal-Constitution's Greg Bluestein notes, he simultaneously appears to be amping up his efforts on behalf of Perdue, with a \"tele-rally\" set for Monday and continued spending to boost Perdue from Trumpworld.",
    "The DSCC's reservations follow on the recent news of both main super PACs in Senate races, Senate Majority PAC for Democrats and the Senate Leadership Fund for Republicans, placing their initial fall ad reservations, each of which were significantly higher at more than $100 million.",
    "Mastriano has also been taking hits on TV from former U.S. Attorney Bill McSwain for supporting what his campaign calls \"the unconstitutional mail-in voting law\" that the Republican-run legislature passed in 2019 before Trump and his allies started to wage war on vote-by-mail.",
    "Former Georgia Sen. David Perdue (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Redistricting\n? NY Redistricting: The New York trial court judge now tasked with implementing new congressional and state Senate districts following a decision by the state's top court to strike down both maps has postponed affected primaries from June 28 to Aug. 23.",
    "Vance (R), backed by $1.73 million\nAL-Gov: Alabama Trucking Association (R) - pro-Kay Ivey (R-inc)\nGA-Gov: Brian Kemp (R-inc) - anti-David Perdue (R), anti-Stacey Abrams (D)\nIL-06: Gary Grasso (R)\nOK-02: Avery Frix (R)\nThis is a short blurb about Daily Kos.",
    "? TX-28: AIPAC's new United Democracy Project is spending at least $333,000 against attorney Jessica Cisneros ahead of her May 24 Democratic runoff against conservative Rep. Henry Cuellar, with its TV ad arguing she would jeopardize Border Patrol jobs.",
    "Governors\n? AZ-Gov: The August Republican primary got a little smaller and perhaps significantly less expensive on Thursday evening when wealthy businessman Steve Gaynor, who narrowly lost the 2018 general election for secretary of state, dropped out.",
    "Judge Patrick McAllister also issued a separate order giving Carnegie Mellon's Dr. Jonathan Cervas, the special master who will actually draw new maps, until May 16 to submit his proposals; the order says the court will issue final maps by May 20.",
    "House\n? FL-15: Political consultant Gavin Brown has announced that he'll seek the Democratic nomination for this new 51-48 Trump seat in the northeast Tampa suburbs, arguing that it's vital to have \"candidates who can compromise in the middle.\"",
    "? NE-Gov: University of Nebraska Regent Jim Pillen has released an internal from WPA Intelligence that shows him narrowly edging out wealthy businessman Charles Herbster 24-23 in the May 10 GOP primary, with state Sen. Brett Lindstrom at 20%.",
    "? OK-Sen-B: Kentucky Sen. Rand Paul, who perhaps thinks he has far more appeal in Oklahoma than he actually has, stars in a new $750,000 ad buy from Protect Freedom PAC in support of Republican state Sen. Nathan Dahm in the June 28 primary.",
    "That end may come pretty soon: A new poll from SurveyUSA, taken for WXIA, gives Kemp a commanding 56-31 lead over Perdue, which makes it the fourth poll in a row to show the governor winning the majority he needs to avert a runoff.",
    "These are the only two polls we've seen since the Nebraska Examiner published an April 14 story where Republican state Sen. Julie Slama and seven other women accused Herbster of groping and other forms of sexual assault.",
    "Fellow Inquirer reporter Chris Brennan writes that an organization called the 1776 Project Committee registered in the state back in February as a pro-Barletta group, and it went on to set up a website bashing McSwain.",
    "? MN-Gov: State Sen. Michelle Benson announced Friday that she was exiting the Republican primary for governor, a departure that came about two weeks ahead of the party's important May 13-14 endorsement convention.",
    "The Peter Thiel-funded group, though, is still treating the former state treasurer as a threat, as it's launched a new ad that essentially goes after Mandel for being involved in pre-Trump Republican politics.",
    "While Gaynor, thanks to significant self-funding, ended March with a significant cash-on-hand edge over the rest of the field, he said he'd concluded his \"chance of winning is low enough to be unrealistic.\"",
    "Of course, Trump's record is very, very blemished, with dozens of failures under his belt, including some high-profile debacles this cycle (check in with Susan Wright and Sean Parnell for more).",
    "? MD-Gov: Former nonprofit head Wes Moore has earned the endorsement of House Majority Leader Steny Hoyer, who is a longtime congressman from the D.C. suburbs, for the July Democratic primary.",
    "Benson both struggled to raise money and fared poorly in the February precinct caucuses, which Minnesota politicos closely watched for early signs of strength ahead of the spring convention.",
    "They show state Rep. Bee Nguyen beating Michael Owens, who unsuccessfully sought the 13th Congressional District in the 2014 and 2020 primaries, by just a 12-9 margin, with 60% undecided.",
    "In addition to their general election numbers, SurveyUSA also tested several primaries a bit further down the ballot (as well as the Kemp-vs.-Perdue matchup we mentioned in our top item).",
    "? FL-23: While Democratic state Sen. Gary Farmer expressed interest earlier this year in campaigning to succeed retiring Rep. Ted Deutch, he's instead filed to run for a local judgeship.",
    "Paul tells the audience, \"Nathan Dahm will join me in demanding that Fauci is fired and removed from office,\" which may have sounded tougher on the page than it does out loud.",
    "? OH-11: Rep. Shontel Brown earned an endorsement from President Joe Biden on Friday just ahead of her May 3 Democratic primary rematch against former state Sen. Nina Turner.",
    "If this order stands, then unless lawmakers act, the state will host two separate primaries, with all other races on the ballot on the original date in June.",
    "In the race for Senate, however, Democratic Sen. Raphael Warnock enjoys a 50-45 advantage over former football star Herschel Walker, his likely GOP opponent.",
    "Senate\n? OH-Sen: Protect Ohio Values has dropped one more poll from Fabrizio, Lee & Associates that shows its man, venture capitalist J.D.",
    "Nguyen, though, has widespread backing from the party establishment and recently began running ads, so her lead is only likely to grow.",
    "NV-Sen: Catherine Cortez Masto (D-inc)\nOH-Sen: Drain the DC Swamp PAC (R) - pro-Josh Mandel (R)\nOH-Sen: Ohio Leads PAC (R) - anti-J.D.",
    "The GOP side pits former Rep. Dennis Ross, who represented a previous version of the 15th District, against state Rep. Jackie Toledo.",
    "Brennan writes that the group, which as of Friday still lists itself as supporting Barletta, has not explained its apparent betrayal.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "One of those other candidates is former Rep. Lou Barletta, who is now under attack by a group ostensibly set up to help him.",
    "Vance, beating Josh Mandel 31-19 in Tuesday's Republican primary, which is an improvement from his 25-18 edge a week before.",
    "Interestingly, the firm diverges with the University of Georgia when it comes to the GOP's contest for secretary of state.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "? GA-Gov, GA-Sen, GA-SoS: SurveyUSA's new poll for WXIA finds a split decision in Georgia's marquee contests this fall.",
    "Brian Kemp leading Democrat Stacey Abrams 50-45 and former Sen. David Perdue sporting a slightly smaller 49-46 edge.",
    "? RI-Gov: Secretary of State Nellie Gorbea has publicized a Lake Research Partners poll that shows her beating Gov.",
    "Brown, who would be the star's first LGBTQ member of Congress, joins a primary that includes comedian Eddie Geller.",
    "The pollster also takes a look at the Democratic contest, finding that even fewer voters have made up their minds.",
    "Dan McKee 30-24 in the September Democratic primary, with former Secretary of State Matt Brown taking 10%.",
    "Now, though, the 1776 Project has started running digital ads against Barletta dubbing him \"Lobbyist Lou.\"",
    "\"Remember, you know, my record is unblemished,\" Trump told the New York Times' Reid Epstein on Thursday.",
    "\"The real story should be on the endorsementsnot the David Perdue oneand, by the way, no race is over.\"",
    "The narrator also twice uses one of Mandel's favorite insults against him by dubbing him a \"squish.\"",
    "Hoyer's boss, the Baltimore-born Speaker Nancy Pelosi, previously backed former DNC chair Tom Perez.",
    "However, the DSCC's initial reservations almost certainly will grow as the cycle progresses.",
    "The DSCC's GOP counterpart, the NRSC, has yet to reveal its fall ad reservation plan.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Ad Roundup\nDollar amounts reflect the reported size of ad buys and may be larger.",
    "John Kasich praising Mandel, with the late McCain calling him a \"centrist.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The spot features footage of John McCain, Mitt Romney, and then-Gov.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "(Pennsylvania Patriots also hit Mastriano over mail-in voting.)",
    "The GOP comes out on top in the race for governor, with Gov.",
    "This is the first survey we've seen of this race all year.",
    "The court will hold a hearing on the matter on May 6.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "Brian Kemp in the May 24 GOP primary.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}