{
  "id": 1844,
  "mediaId": 163,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trump faces biggest test of his 'king-maker' clout since leaving White House",
  "image": "https://www.reuters.com/resizer/uz_1TabNBeDMbrddTFJ5sArKPrU=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/LIPAVD4FOBN4JPWHOAY3WJWILI.jpg",
  "link": "https://www.reuters.com/world/us/trump-faces-biggest-test-his-king-maker-clout-since-leaving-white-house-2022-05-01/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jarrett Renshaw",
  "authorUrl": "https://www.reuters.com/authors/jarrett-renshaw/",
  "termIds": [
    661,
    815,
    943,
    1064,
    1136,
    1147,
    1404,
    1563,
    1646,
    1801,
    2087,
    2095,
    428,
    2845
  ],
  "sentences": [
    "Victories in May by some of Trump's more controversial Senate picks, including former football star Herschel Walker in Georgia and television doctor Mehmet Oz in Pennsylvania, would not guarantee success in the Nov. 8 general elections and missteps could allow Democrats to hold onto their razor-thin Senate majority.",
    "REUTERS/Gaelen Morse/File Photo/File Photo\nMay 1 (Reuters) - The month of May brings Donald Trump the biggest test of his political clout since the end of his presidency, as candidates he has endorsed contest Republican primaries that will set the stage for November's midterm congressional elections.",
    "Reuters/Ipsos polling last week showed 83% of Republicans view the former president favorably and 40% said he is the leader who best represents their party, well ahead of the 25% for his nearest potential rival for the 2024 nomination, Florida Governor Ron DeSantis.",
    "read more\n\"It's important for him to maintain that perception, and perhaps a reality, that he is a king-maker in the Republican Party,\" said Mike DuHaime, a Republican strategist, cautioning: \"The Trump endorsement is still powerful, but it's not undefeatable.\"",
    "read more\nIn Georgia, Trump defied the Republican establishment by encouraging Perdue to challenge popular incumbent Kemp, who infuriated Trump by certifying the 2020 election results that showed President Joe Biden defeated him in the state.",
    "Following Trump's endorsement, a Fox News poll showed Vance leaping 12 percentage points from a previous poll to notch the support of 23% of primary voters, whereas opponent Josh Mandel lost 2 points to poll at 18%.",
    "Former U.S. President Donald Trump speaks during a rally to boost Ohio Republican candidates ahead of their May 3 primary election, at the county fairgrounds in Delaware, Ohio, U.S. April 23, 2022.",
    "They are among the highest-profile -- and in the case of the Senate, most critical for the party -- of the more than 150 candidates for federal, state and local races Trump has endorsed this year.",
    "The former president has also backed a challenger to Georgia's sitting Republican governor, who angered Trump by rejected his false claims that his 2020 election defeat was the result of fraud.",
    "In North Carolina, polls show Trump-backed Senate candidate Representative Ted Budd leading rival former Governor Pat McCrory, though a crowded field in that race could force a July run-off.",
    "\"Georgia is going to be the proving ground for what the rest of the country is going to see: It's time to turn the page,\" said Lieutenant Governor Geoff Duncan, an anti-Trump Republican.",
    "More than 40 Republican officials had written to Trump urging him to not endorse Vance, arguing that his history of criticizing Trump would be fodder for his Democratic opponent.",
    "\"No matter what happens to his endorsed candidates, I don't think it will change the conventional wisdom that he would still be the frontrunner for the GOP nomination for 2024.\"",
    "But Oz trails rival David McCormick ahead of the May 17 Pennsylvania primary and former Senator David Perdue lags Georgia Governor Brian Kemp heading into their May 24 matchup.",
    "\"His power base is tens of millions of disaffected voters around the country,\" said Justin Sayfie of Ballard Partners, a Florida-based lobbying firm with ties to Trump.",
    "In Pennsylvania, Trump's April 9 endorsement of Oz has done little to move the polls, with the latest survey showing a tight race with former hedge fund CEO McCormick.",
    "Trump is expected to finalize a midterms spending plan for his massive war chest following the contests in Ohio and Pennsylvania, sources told Reuters last month.",
    "Trump-backed candidates in Ohio, Pennsylvania and North Carolina face active and well-funded challengers seeking the Republican nomination to run for U.S. Senate.",
    "Their races will be closely scrutinized for any sign that Trump's iron-clad grip on his party could be waning as he flirts with a possible 2024 White House run.",
    "In a Monmouth University poll released last week, 61% of Pennsylvania Republicans say they were \"very likely\" to vote for McCormick compared to 51% for Oz.",
    "Trump stunned Ohio Republicans on April 15 by endorsing Vance, a venture capitalist and author who has been bitterly critical of the former president.",
    "At a Georgia rally in March, Trump turned to Perdue and said: \"I hope, David, you're going to be the governor.",
    "Perdue lagged Kemp by some 20 points in a recent poll published by the Atlanta Journal-Constitution.",
    "Poor performances by Trump-backed candidates may not diminish his support with his core supporters.",
    "read more\nA spokesman for Trump did not respond to a request for comment.",
    "Polls show that at least one of Trump's May picks, Senate candidate J.D.",
    "Vance in Ohio, is leading going into his Tuesday primary.",
    "Even Trump's faith in Perdue appears to be wavering.",
    "Or I just wasted a helluva lot a time tonight.\"",
    "Still, 25% of voters said they were undecided."
  ]
}