{
  "id": 1852,
  "mediaId": 409,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Sparks Fly at Heated Georgia Debate Between Brian Kemp, David Perdue",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/cpac-2022-022722-8.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/sparks-fly-at-heated-georgia-debate-between-brian-kemp-david-perdue/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Downey",
  "authorUrl": "https://www.nationalreview.com/author/caroline-downey/",
  "termIds": [
    2095
  ],
  "sentences": [
    "https://t.co/CNVexxeae8\n Lakshya Jain (@lxeagle17) April 29, 2022\nWe've gotta have someone that will focus on today and focus on how we win in November  not try to look back like David Perdue and Stacey Abrams have been, and not admit that they lost an election because they didn't have a record to win,? he added.",
    "You can't go and change the laws in the middle of an election that's happening, which includes your runoff.?\nPerdue argued that while Kemp would be unlikely to secure Trump's endorsement again in 2022, and suggested that Kemp would likely be soundly defeated by Democratic candidate Stacey Abrams without it.",
    "You won't own up to the fact that you actually certified the election, governor, without investigation,? said Perdue, who repeated the claim that he only had lost the election to Ossoff because Kemp let him steal it.?\nLord of mercy, there's a lot of spaghetti being thrown on the wall,? Kemp shot back.",
    "I'm in here to protect my state, this man has sold us out to the radical left.?\nKemp was defiant, declaring that he his job performance would help him beat Abrams again, while Perdue lacked both the experience and the record to prevail.",
    "Perdue also alleged that his rival didn't reform election rules and procedures after the 2020 fiasco, neglecting to address fraud relating to signature verification, mail-in ballot harvesting, and unsecured drop boxes.",
    "The pair sparred over other issues, including crime  which has also been on the rise in Georgia  and the economic effects of soaring inflation, but the focus remained on the fallout from the 2020 election.",
    "I believe with [Trump's endorsement], and with everyone's help and vote, we will stop this madness and we will beat Stacey Abrams, even though our governor has divided the party,? Perdue said.",
    "The Georgia legislature did pass a sweeping election reform bill that Kemp signed into law in the spring of 2021.\nLord of mercy, he's lying again folks.",
    "Perdue said he regretted pushing former president Trump to give his highly-coveted endorsement to Kemp during the last election for Georgia governor.",
    "Sparks flew between former senator David Perdue and Georgia governor Brian Kemp at the GOP gubernatorial primary debate Thursday night.",
    "I'm just telling you, the worst mistake I ever made was getting Donald Trump's endorsement for this man,? said the former senator.",
    "He clarified that the FBI, Georgia Bureau of Investigations, and his own office had probed the election results independently.",
    "Kemp is currently leading Perdue, 56 percent to 31 percent, according to a recent poll conducted by 11-Alive/ Survey USA.",
    "Kemp 50  Abrams 45\nPerdue 49  Abrams 46\nWalker 45  Warnock 50\nAbrams just underperforms Warnock across the board.",
    "The former senator has insisted that the contest was stolen? from Trump without presenting any credible evidence.",
    "Perdue narrowly lost to Democratic Senator Jon Ossoff in the Georgia Senate run-off in early 2021.",
    "Perdue's loss in the 2020 cycle handed Democrats their first Georgia Senate seat since 2005.",
    "Perdue's gubernatorial campaign has largely been focused on the 2020 presidential election.",
    "People have lost confidence in you, and confidence in the voting system.",
    "10 points worse with whites and 10 points worse with Black voters.",
    "Polling shows Kemp beating Abrams by sounder margins than Perdue.",
    "The new @SurveyUSA poll of Georgia is fascinating.",
    "It's really sad,? Kemp said."
  ]
}