{
  "id": 1857,
  "mediaId": 881,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Some of the most prolific purveyors of election disinformation on the right seem to think Musk will be their salvation.",
  "image": "https://video-images.vice.com/articles/626bf70c91ccfe009b84869e/lede/1651242764752-gettyimages-1239964184.jpeg?crop=1xw:0.84375xh;center,center&resize=20:*",
  "link": "https://www.vice.com/en/article/y3v79y/elon-musk-twitter-disinformation-content-moderation",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Zwillich",
  "authorUrl": "https://www.vice.com/en/contributor/todd-zwillich",
  "termIds": [
    1147,
    1609,
    1646,
    2095,
    2517,
    177,
    539
  ],
  "sentences": [
    "House Republicans have already decided they don't care what they heard from GOP Leader Kevin McCarthy on tape: that he fretted in days after Jan. 6 that lawmakers like Rep. Matt Gaetz were trafficking in dangerous rhetoric that could get people hurt; that his chief deputy, Rep. Steve Scalise, wondered if some of their incitement was in fact illegal; and especially that he slid into this week lying about the fact that he'd told colleagues Donald Trump took responsiblity for the riot and that he would advise Trump to resign.",
    "The reason is that McCarthy's on-tape comments are long in the past,before he traveled to Mar-a-Lago to publicly resuscitate Trump, before he made sure the most vicious Trumpists would receive no discipline for inciting violence or cavorting with racists, and most important, before he moved to cover up Jan. 6 by obstructing the committee investigation and threatening retribution against companies considering cooperation.",
    "Coup d'Utah  Finally, an answer to the question What would it take to get a bunch of Utah Democrats to dump their own candidate for Senate?? It's the hope of defeating GOP incumbent Sen. Mike Lee, who last week appeared all up in Mark Meadows' texts planning, egging on, then later abandoning, Donald Trump's coup attempt.",
    "Here's the obligatory reminder that DeSantis praised Florida's 2020 election, saying it inspires confidence.?\nInterestingly, the President did not grant clemency to any potential witnesses against him.?  Attorney George Conway, upon news that President Biden granted clemencies to 78 federal felons.",
    "PROPUBLICA\nTrump allies breach U.S. voting systems in search of 2020 fraud evidence.? REUTERS\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Colon's plea deal includes a Jan. 5 conversation with several co-defendants where one individual says of the Capitol, Do we have patriots here willing to take it by force??\nTotal obstruction  Time for some traffic problems in downtown Atlanta.",
    "Side note: Which lawmakers was Rep. Marjorie Taylor Greene talking about when she texted then-White House chief of staff Mark Meadows on Jan. 17 saying that GOP lawmakers were urging Trump to institute Marshall law??",
    "Either way, consistent content moderation is vital, not just at election time but during non-election periods, when platforms like Twitter and Facebook have disbanded their teams or stopped moderating.",
    "So I talked to a couple of online disinformation experts about what Musk might do with Twitter, whether Donald Trump will return, and how important the platform is to real-world politics and safety.",
    "We've noticed a pattern where bad actors will take content from Twitter to more extremist spaces and organize there, which, as we saw on Jan. 6, can spread into real-world actions and violence.",
    "Anyone who's spent even a few minutes in a journalist's mentions or in their memories of 2020, knows what online free speech? looks like in a high-leverage environment for disinformation.",
    "Former Sen. David Purdue might be current Sen. David Purdue if Trump had stifled the stolen-election claims and not suppressed GOP turnout in Georgia's super-close runoff on Jan. 5, 2021.",
    "Gableman released a report on March 1 that alleged all kinds of election conspiracies and culminated in a legally impossible recommendation to rescind the 2020 electors Joe Biden won.",
    "Steiner: There's a widespread perception that not only will there be some sort of banned jubilee? where banned users can return, but that practices like shadow-banning will be lifted.",
    "McCarthy has already refused to speak to the bipartisan committee investigating what he himself recognized as a dangerous and potentially criminal episode of Trump's doing on Jan. 6.",
    "His chances of continuing to lead House Republicans depend entirely on his willingness to advance Trumpism's anti-democratic depredations and coddle its most authoritarian radicals.",
    "On Wednesday, four frontrunners who debated for PA's GOP gubernatorial nomination said they'd ban mail-in voting, which was created in 2019 with near-unanimous Republican support.",
    "Trump's awareness that he may have committed crimes could go directly to the heart of the committee's belief that Trump acted criminally when he fraudulently obstructed Congress.",
    "524, creating the Office of Election Crimes and Security,? set up to investigate voter fraud, election violation, and (DeSantis says) threats to election workers and voters.",
    "Click Cam's story to find out which former president threatened Gableman with political destruction if he didn't help keep the stolen election? storyline alive through 2022.",
    "Getachew: As we saw with Jan. 6, Trump gets so much engagement that his network of high-profile politicians and influencers can keep disinformation flowing at a fever pitch.",
    "The automaker's PAC has already pledged twice to back off political donations to lawmakers who voted against certifying the election as the coup attempt raged on Jan. 6.",
    "But it donated $1,000 each to at least five Republicans who voted to overturn the election, three of whom signed court briefs asking that election results be reversed.",
    "Meanwhile, in Pennsylvania, Mehmet Dr.? Oz is testing the wild theory that TV celebrity, combined with attacking free elections, can lead to political success.",
    "I'm not sure what Elon Musk really means when he says he believes in free speech under the law.?\nGetachew: I don't think he understands what he means by that.",
    "Emma Steiner is a disinformation analyst at the democracy advocacy group Common Cause, and Josef Getachew is the group's media and democracy program director.",
    "Still, several revelations this week are likely to be taken much more seriously by Jan. 6 investigators, and if it ever comes to it, maybe even a grand jury.",
    "Getachew: I think their joy is in part because of that false narrative that Twitter and other platforms have been biased against conservative viewpoints.",
    "(APPLAUSE)\nThere's really only one (well, two) big questions in This Week in Subpoenas: Was Mark Meadows warned on Jan. 4 that Jan. 6 could be violent?",
    "Will the administrative judge deciding her 14th Amendment case in Georgia now think it wasn't credible when she claimed under oath not to recall it?",
    "Whether their protests do anything to stop Q-crazed conspiracists like Kristina Karamo taking over the state's election apparatus is another matter.",
    "Flippin' proud  One of several Kansas City Proud Boys charged in the Jan. 6 riot pleaded guilty this week and agreed to cooperate with prosecutors.",
    "Many people stormed the Capitol on the basis of false narratives that often started on Twitter and were perpetuated on Twitter by the president.",
    "Vos this week extended the contract of Michael Gableman, the retired judge he hired under MAGA pressure to audit? claims of 2020 election fraud.",
    "People who don't use Twitter will see ideas, memes, or political narratives that started on Twitter eventually migrate over to their platform.",
    "First off, folks, let me be very clear tonight: The election in 2020 was rigged and stolen,? Purdue said at the top of his opening statement.",
    "Fulton County DA Fani Willis convenes the special grand jury next week investigating if Trump illegally tried to overturn the 2020 election.",
    "Some of the most prolific purveyors of election disinformation on the right seem to think that Musk's purchase this week is their salvation.",
    "But, as VICE News' Cameron Joseph reports, Vos is finding out what McCarthy already knows: In MAGA World, loyalty means utter capitulation.",
    "Vos is an establishment-minded Republican leader who's tried to manage the nearly unrivaled MAGA fervor that's taken over his state's GOP.",
    "Kemp refused to overturn the election results, but he's signed into law tons of voter suppression and potential election subversion since.",
    "Oh, what a feeling  Toyota's North American subsidiary is back at it supporting House Republicans who voted to overturn the 2020 election.",
    "And so it's important to maintain the practices that are already in place on Twitter and also figure out how to close those loopholes.",
    "It'll be tough for McMullin to win, but he doesn't have to compete in the primary against Lee, because he's running as an independent.",
    "In reality, if you want to have a platform that works for everyone, you're going to need content moderation and civic integrity teams.",
    "The case isn't connected to the conspiracy case involving Proud Boys leader Enrique Tarrio, but his testimony could prove important.",
    "Both possibilities came out in a committee filing this week aiming to get Meadows to drop his delay tactics and honor his subpoena.",
    "Utah Dems voted over the weekend to abandon their leading, long-shot challenger, and instead back former Republican Evan McMullin.",
    "If you think Kevin McCarthy scares easily into undermining democracy, wait till you see Wisconsin Senate GOP Leader Robin Vos.",
    "Some party-leading Republicans in Michiganand even some donorsfinally have had enough of Trumpists taking over their party.",
    "You'd expect Trump's sycophants, and Trump himself, to repay such conscience-riddled statements with vitriol and a purge.",
    "It'll have 15 employees and a budget of $1.2 million, and answer to the secretary of state, who's appointed by DeSantis.",
    "We've found over the past couple years that they've stopped enforcing against lies about the 2020 presidential election.",
    "They have every reason to believe that any impulses McCarthy has for protecting the Constitution are properly subdued.",
    "I refer you to these prosecutors on why yes? to either of those questions could be evidence of a criminal conspiracy.",
    "The idea that Elon Musk saying I'm the free speech guy? leads to more conservative voices needs to be figured out.",
    "In the end, four out of five of the GOP candidates on the stage either stated or implied the election was stolen.",
    "No one knows exactly how he'll run it or what he means when he says he's returning free speech? to the platform.",
    "Republicans disproportionately believe they're victims of shadow-banning, despite data that it's not the case.",
    "And applying First Amendment values doesn't mean the same thing in government as it does in a private company.",
    "Some Jan. 6 rioters have been citing election disinformation as a reason behind their actions at the Capitol.",
    "Election officials and poll workers, who are usually women and people of color, are most often the targets.",
    "We cannot move on,? Oz, who also has Trump's endorsement, said when asked if it's time to move past 2020.",
    "He'd be able to essentially restart with this built-in network that can be weaponized against democracy.",
    "Conspiracists use Twitter to share information allowing them to attack and harrass these poll workers.",
    "For the low, low price of $44 billion and a lot of trolling, Elon Musk has made a deal to buy Twitter.",
    "So I would take issue with the idea that it doesn't affect your life, because we've seen it on Jan. 6.",
    "Now the committee wants to again pursue him, and potentially other lawmakers, to tell what they know.",
    "If you don't have them, the public square becomes a cesspool for bad content no one will want to use.",
    "Ron DeSantis' dream of a crack squad of election-crime sleuthers who report to him is now a reality.",
    "Why was he apparently concerned that Trump might ask to be pardoned as a condition of stepping down?",
    "Louis Enrique Colon, 45, pleaded guilty to one count of obstructing police officers during the riot.",
    "Why did McCarthy voice his personal fear? Vice President Mike Pence might be asked to pardon Trump?",
    "I think the question becomes, is he going to keep those civic integrity teams or do away with them?",
    "We have democratic values and public safety values that go right along with our free speech values.",
    "Emma Steiner: And Twitter's inconsistent moderation policies have already led to offline harm.",
    "Our own research shows that narratives that often start on Twitter migrate to other platforms.",
    "But it's up to content moderation and civic integrity policies to help with this issue online.",
    "Josef Getachew: Twitter hasn't been consistent with how it enforces civic integrity policies.",
    "Conspiracy theorists and their followers mobilize there to direct their false narratives.",
    "They made the active decision to no longer enforce against that type of disinformation.",
    "Brian Kemp, who earned the title of Trump Enemy #1 for certifying Georgia for Biden.",
    "So if you go on Twitter now, you may see content that says the election was stolen.",
    "We'll see, of course, but from a disinformation perspective, how important is that?",
    "But instead, when Republicans gathered to hear him out, McCarthy got a standing O.",
    "It could also inform other potential but harder to prove charges, like incitement.",
    "But it's a space where a lot of political and cultural narratives are generated.",
    "Purdue is going to need some help to win: Polls this week showed him way behind.",
    "All of that points back to content moderation and how it balances those things.",
    "And was he also warned that the plan to mine fake electors was likely illegal?",
    "The McCarthy of those tapes, in other words, was captured and turned long ago.",
    "One concern we have is what content moderation looks like under a new regime.",
    "There's this kind of savvy phrase in politics that Twitter isn't real life.",
    "Vos did so even though Gableman's taxpayer-funded contract had expired.",
    "So we really don't need it to get any worse with Elon Musk's takeover.",
    "Everyone's pretty focused on whether Donald Trump returns to Twitter.",
    "There's all sorts of laws against offline voter suppression tactics.",
    "Still, Purdue led with his best stuff in Sunday's debate with Gov.",
    "When he does, your democracy-minded boos will mean nothing to him.",
    "Steiner: Elon, content moderation on social platforms is good.",
    "And as long as we're rounding up GOP primary debates, enjoy!",
    "We're here to wallow in the mentions so you don't have to.",
    "Why was McCarthy concerned Trump may have committed them?",
    "What's your first reaction to Elon Musk buying Twitter?",
    "Maybe what Elon Musk decides doesn't matter that much.",
    "The first of this summer's public hearings is June 9.)",
    "I'm comfortable predicting McCarthy will refuse again.",
    "The Republican blueprint to steal the 2024 election.",
    "CNN\nInside the creation of the stolen-election myth.",
    "Steiner: Only 22 percent of Americans use Twitter.",
    "We don't know a lot about what he's going to do.",
    "So why not give him a nice round of applause?",
    "Presidential pardons are for federal crimes.",
    "Sign your friends up for Breaking the Vote!",
    "I don't think that's been fleshed out yet.",
    "Not really, but, but let's say that I am.",
    "Don't try to drive near the courthouse.",
    "It helps protect democracy and safety.",
    "I'm talking to Elon right after this.",
    "Our chat has been edited for length.",
    "Trump says he's not coming back.",
    "I can convey one brief message.",
    "What could have convinced Vos?",
    "(Mark your calendar, BTW.",
    "Tapping out  What's this?",
    "This week he signed S.B.",
    "Pardon for what?",
    "(Also what?)",
    "Florida Gov."
  ]
}