{
  "id": 1858,
  "mediaId": 136,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Win for Abrams as Judge Orders Georgia Gov. Kemp PAC to Stop Raising Money",
  "image": "https://d.newsweek.com/en/full/2028097/brian-kemp-stacey-abrams-georgia-governor-election.webp?w=790&f=07c3960cebe828418ea9da8a535a435f",
  "link": "https://www.newsweek.com/win-abrams-judge-orders-georgia-gov-kemp-pac-stop-raising-money-1702019",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    861,
    1646,
    1951,
    2095,
    4325,
    43,
    146,
    428,
    2672
  ],
  "sentences": [
    "\"After months and months of Brian Kemp having exclusive ability to raise unlimited funds as a result of the bill he signed, Kemp will no longer be able to raise these funds while Stacey Abrams and One Georgia are denied equal ability to operate under the same rules,\" Abrams campaign manager Lauren Groh-Wargo said in a statement to the Associated Press.",
    "Cohen previously ruled that Abrams could not raise funds through her own similar leadership committee before the conclusion of the Democratic primary, finding against Abrams' argument that she was already effectively the nominee due to running in the primary unopposed.",
    "Cohen wrote in his order that allowing the Kemp campaign to receive \"unlimited contributions\" from the leadership committee, which he chairs, while denying Abrams the same opportunity was \"antithetical to the First Amendment,\" according to Bloomberg.",
    "While the leadership committees are legally entitled to receive unlimited donations, candidates operating on their own are limited to individual contributions of $7,600 during the primary and general elections and $4,500 during any runoff election.",
    "Kemp signed into law a bill that allowed for the creation of the leadership committees last year, with the stipulation that they could be controlled by the state's governor, lieutenant governor or political party nominees for either office.",
    "A RealClearPolitics average of polls has the governor with a 5.3 percent lead over Abrams, while a survey released on Thursday by SurveyUSA and Atlanta NBC affiliate WXIA showed Kemp with a similar 5 percent advantage.",
    "Cohen's decision was viewed as a victory by the governor's likely Democratic opponent Stacey Abrams, who is hoping to unseat Kemp in the general election in a rematch of her narrow 2018 defeat.",
    "A federal judge has ordered a political action committee to stop raising campaign funds for Republican Georgia Governor Brian Kemp until he is able to secure his party's nomination.",
    "Cohen had already banned Kemp from spending money taken from his leadership committee during the GOP primary in a February decision that followed a legal challenge from former U.S.",
    "The former president, once a Kemp ally, has repeatedly launched bitter attacks on the governor over his failure to overturn his 2020 Georgia election loss to President Joe Biden.",
    "U.S. District Judge Mark Cohen's Thursday ruling blocked Kemp's Georgians First Leadership Committee from soliciting or receiving campaign contributions before the GOP primary.",
    "An average of polls from RealClearPolitics shows Kemp with a double-digit lead over Perdue, who has been endorsed by former President Donald Trump.",
    "Kemp is also leading in polling of his potential rematch with Abrams, although by a slimmer margin.",
    "Committees can also be formed by GOP and Democratic caucuses in the state Legislature.",
    "Senator David Perdue, the incumbent governor's top Republican opponent.",
    "Newsweek reached out to the Kemp campaign for comment."
  ]
}