{
  "id": 1866,
  "mediaId": 43,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/29",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/29/2093475/-Daily-Kos-Elections-Live-Digest-4-29",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    653,
    815,
    970,
    1335,
    1646,
    1823,
    2095,
    2426,
    4325,
    483,
    571
  ],
  "sentences": [
    "While Gaynor, thanks to significant self-funding, ended March with a significant cash-on-hand edge over the rest of the field, he said he'd concluded his chance of winning is low enough to be unrealistic.?\n Friday, Apr 29, 2022  6:16:59 PM +00:00  Jeff Singer\nGA-Gov, GA-Sen, GA-SoS: SurveyUSA, working on behalf of WXIA, gives Gov.",
    "Friday, Apr 29, 2022  6:33:30 PM +00:00  David Nir\nNY Redistricting: The New York trial court judge now overseeing redistricting for Congress and the state Senate has given Jonathan Cervas, the special master who will actually draw new maps, until May 16 to submit his proposals and says the court will issue final maps by May 20.",
    "Friday, Apr 29, 2022  4:20:07 PM +00:00  Jeff Singer\nAZ-Gov: The August Republican primary got a little smaller and perhaps significantly less expensive on Thursday evening when wealthy businessman Steve Gaynor, who narrowly lost the 2018 general election, dropped out.",
    "The newer poll shows incumbent Brad Raffensperger leading Trump's endorsed candidate, Rep. Jody Hice, 31-20, while UGA had Raffensperger ahead by a considerably smaller 28-26; still, both polls find him well below the majority he'd need to avoid a second round in June.",
    "Friday, Apr 29, 2022  4:01:05 PM +00:00  Jeff Singer\nMD-Gov: Former nonprofit head Wes Moore has earned the endorsement of House Majority Leader Steny Hoyer, who is a longtime congressman from the D.C. suburbs, for the July Democratic primary.",
    "SurveyUSA also takes a look at the Democratic contrast and has frontrunner state Rep. Bee Nguyen leading Michael Owens, who unsuccessfully sought the 13th Congressional District in the 2014 and 2020 primaries, only 12-9 with 60% undecided.",
    "Friday, Apr 29, 2022  4:04:35 PM +00:00  Jeff Singer\nFL-23: While Democratic state Sen. Gary Farmer expressed interest earlier this year in campaigning to succeed retiring Rep. Ted Deutch, he's instead filed to run for a local judgeship.",
    "The firm also unsurprisingly finds former football star Herschel Walker flattening his nearest intra-party foe, former state Agriculture Commissioner Gary Black, 62-6 for the Senate nod.",
    "Brian Kemp a 56-31 lead over former Sen. David Perdue ahead of the May 24 Republican primary, which makes it the fourth poll in a row to show the incumbent averting a runoff.",
    "SurveyUSA, though, diverges with recent numbers from University of Georgia when it comes to Team Red's contest for secretary of state.",
    "Nguyen, for her part, recently began running ads, which could help her stand out in a race that usually gets little attention.",
    "Finally, the firm takes a look at the general elections for governor and Senate and shows a split decision.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "Hoyer's boss, the Baltimore-born Speaker Nancy Pelosi, previously backed former DNC chair Tom Perez.",
    "Kemp leads Democrat Stacey Abrams 50-45, while Perdue enjoys a slightly-smaller 49-46 advantage.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "However, the sample sample favors Democratic Sen. Raphael Warnock 50-45 over Walker.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "The court will also hold a hearing on the matter on May 6.",
    "It's also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "Daily Kos relies on readers like you.",
    "New episodes every Thursday morning."
  ]
}