{
  "id": 1867,
  "mediaId": 129,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "A Georgia judge ordered a special fund-raising committee for Kemp to suspend its efforts, siding with Abrams.",
  "image": "https://static01.nyt.com/images/2022/04/29/us/politics/29midterm-briefing-georgia-kemp/merlin_205032183_c819947f-414d-4c9e-bcbd-057d9c47f551-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/live/2022/04/29/us/midterms-elections-primary",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1646,
    1646,
    1951,
    1951,
    1980,
    1980,
    2095,
    2095,
    571,
    571,
    428,
    428,
    146,
    146,
    2555,
    2555,
    2672,
    2672
  ],
  "sentences": [
    "In a statement, Ms. Abrams's campaign manager, Lauren Groh-Wargo, considered the ruling a success, saying the Abrams campaign was glad Judge Cohen recognized and offered a remedy today for the unconstitutional fund-raising advantage Brian Kemp signed into law benefiting himself.?\nAfter months and months of Brian Kemp having exclusive ability to raise unlimited funds as a result of the bill he signed, Kemp will no longer be able to raise these funds while Stacey Abrams and One Georgia are denied equal ability to operate under the same rules,? she said, adding that the campaign will continue to monitor the governor's fund-raising efforts.",
    "Mr. Perdue's opening statement was also the same as in the first debate, repeating the falsehood that the 2020 election was rigged and stolen.? When asked if he believed Mr. Trump broke the law by trying to influence the results of the election in Georgia, Mr. Perdue responded, Hell, no!? He said it was the former president's constitutional responsibility? to ask elected officials to investigate the results before they were certified.",
    "He has lived in Powder Springs since 2016. Her rhetoric, her demeanor, her discourse in Congress, her discourse, quite frankly, as an American, is just something that is just reprehensible.?\nFor more than a decade, Powder Springs and Austell have been represented by Representative David Scott, a Black Democrat whose district included parts of Atlanta and its surrounding suburbs.",
    "It's about having someone that's going to take your phone calls, who's going to work on your behalf, who's going to care what happens to your children, who is going to care about making sure you get to your job,? said State Representative David Wilkerson, a Black Democrat who lives in and represents the communities now drawn into Ms. Greene's congressional district.",
    "People are just redistricting just to fit their own needs without getting input or buy-in from people in the area  the people who would like to be represented in a fair and equitable manner.?\nThe conflict over sweeping new restrictions on voting, largely confined to statehouses and governors' desks since 2020, is spilling over into the midterm elections.",
    "Both Mr. Perdue and Stacey Abrams challenged the terms of the leadership committees in court, saying the governor's fund-raising advantage was unfair because it allowed him to bring in unlimited campaign cash before the primary election  something neither Ms. Abrams nor Mr. Perdue can do under Georgia's campaign finance laws.",
    "In November, she told The Atlanta Journal-Constitution that she was unhappy that her district was made slightly less Republican, calling the redistricting process a fool's errand that was led by power-obsessed state legislators.? Rather than add Democrats to her district, she said, lawmakers should have fortified G.O.P.",
    "Some of the usual efforts to inform voters about important dates, like when to register and the deadline for early voting, didn't happen this year with details in flux, said Jen Miller, executive director of the League of Women Voters of Ohio, which is in litigation over the maps in front of the Supreme Court.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year's map is poised to be surprisingly fair\nGovernors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "Brian Kemp of Georgia and his supporter-turned-primary challenger, former Senator David Perdue, took part in their second governor's debate on Thursday evening  a meeting more civil than the first but largely featuring the same back-and-forth over the 2020 election and the merits of their conservatism.",
    "Two other candidates are ardent backers of his stolen election claims: former Representative Lou Barletta, whose campaign is managed by former Trump advisers; and Doug Mastriano, a state lawmaker and retired colonel who helped organize transportation to the Stop the Steal? rally on Jan. 6.",
    "And while he has shown a unique ability to energize the party's base and turn out new voters, those operatives are still dreading the likelihood that he runs again in 2024, anchoring candidates up and down the ballot to an erratic, divisive figure who was rejected by swing voters in 2020.",
    "Mr. Perdue painted Atlanta's rising crime numbers as the product of the governor's lenience on the issue and a lack of law enforcement presence in the state, while Mr. Kemp railed against his challenger for outsourcing jobs to China as the chief executive of Dollar General.",
    "how they run\nThis Ohio House race has everything\nIt's a shining example of Democrats' challenges in 2022, the confusion caused by whiplash over new congressional maps and, yes, the power of a Trump endorsement: This is the race for Ohio's 13th Congressional District.",
    "Both candidates and the moderators fixated on questions about election security and whether former President Donald J. Trump was the rightful winner, despite multiple recounts confirming his loss and the victories of scores of down-ballot Republican candidates.",
    "That's what people are looking for.?\nThe newly drawn 14th Congressional District is a result of a tactic called cracking,? the practice of breaking up blocs of voters and scattering them across multiple districts to dilute their voting power.",
    "In Arizona, two Trump-endorsed Republican candidates  Kari Lake in the governor's race and Mark Finchem for secretary of state  sued election officials this month to try to stop the use of electronic voting machines in the midterm elections.",
    "By restoring service to this and not being so focused on being a social media celebrity, it allows us to bring value back to people,? Ms. Strahan said, noting that she and Ms. Greene do share some overlap? in their beliefs as conservatives.",
    "One, a small-business owner, Jennifer Strahan, has run as a no-drama conservative  helping her garner support from several Republican leaders in the district, including four out of five of the commissioners in one of its largest counties.",
    "The lawsuit, filed in December, argues that the new lines are drawn specifically to dilute Black voters' influence, and violate the Voting Rights Act of 1965 by not allowing for an additional majority-Black district in south Cobb County.",
    "In Georgia, Brian Kemp, the Republican governor, signed a bill on Wednesday empowering the Georgia Bureau of Investigation to pursue criminal inquiries into election fraud, an authority solely held by the secretary of state in the past.",
    "The congresswoman has followed the QAnon conspiracy theory and questioned whether the Sept. 11 attack and school shootings were real  comments that got her ousted from congressional committees by the Democratically led House.",
    "But for residents, the prospect of Powder Springs and another predominantly Black suburb, Austell, being represented by perhaps the most far-right Republican in Congress is raising questions that go beyond partisan politics.",
    "In Nevada, a push by Republicans to scale back universal mail-in voting while introducing a new voter ID requirement ran into a major setback on Monday when two different judges in Carson City invalidated those efforts.",
    "An added wrinkle is that the boundaries of the district aren't technically final: Ohio's redistricting process has been tied up in the courts, and the State Supreme Court could still rule against the current maps.",
    "Judge Cohen obliged, saying that allowing Mr. Kemp to continue to fund-raise while barring Ms. Abrams from doing so would be antithetical to the First Amendment.?\nMr. Kemp's campaign did not comment on the ruling.",
    "DeBorah Johnson, the chairwoman of the Austell Community Task Force, a typically apolitical community group, has led a drive to encourage more Cobb County voters to cast ballots in next month's primary election.",
    "If 2022 is as bad for Democrats as most everybody else, myself included, expects it to be, Republicans will flip this district,? said Ryan Stubenrauch, a Republican strategist in Ohio who grew up in the area.",
    "In early April, hundreds of Cobb County residents gathered for the Taste of Mableton,? a first-of-its-kind spring festival, featuring food trucks, live performances and booths for dozens of community groups.",
    "Most of his voters appear to be migrating toward Vance rather than Josh Mandel, the other leading candidate in the race, said Jeff Sadosky, a former political adviser to Senator Rob Portman, who is retiring.",
    "He issued an anti-endorsement to Bill McSwain, a former U.S. attorney who served in the Trump administration, calling him a coward, who let our country down? by not stopping massive? election fraud in 2020.",
    "The risk for Trump is that if the candidates he has endorsed end up losing, his influence over Republican primary voters looks substantially diminished,? said Whit Ayres, a longtime Republican pollster.",
    "Elsewhere in Pennsylvania, officials in Westmoreland County, which includes the suburbs east of Pittsburgh, voted this week to scale back the number of drop boxes used for absentee ballots to just one.",
    "Some say they have little trust that Ms. Greene will pay them the same attention and respect that she gives to her white, Republican constituents and fear their voice in Congress won't speak for them.",
    "In a recent poll by Quinnipiac University, 45 percent of Republicans said they would be more likely to vote for a candidate endorsed by Trump, whereas 44 percent said it would make no difference.",
    "Marjorie Taylor Greene represents the antithesis of what we believe,? said Robert Richards, a former Army pilot and Baltimore police officer now working as a senior federal government executive.",
    "Set up in the shadow of a large billboard for Mr. Scott, the event aimed to strengthen ties between residents of the small community, particularly after the Covid-19 pandemic kept many distant.",
    "Scattered throughout the evening's questions was a handful of policy issues that proved to be more conservative litmus tests on crime, immigration and education than substantive policy debate.",
    "Most people engage with their lawmakers on routine matters, such as a fast-tracked passport renewal, Social Security benefits claims, Veterans Affairs queries or locally targeted legislation.",
    "President Biden would have carried this newly drawn district by just three percentage points, making it a must-win for Democrats as they face challenges in maintaining their House majority.",
    "The suburban city elected its first Black mayor in 2015, and the county where it sits, the former Republican stronghold of Cobb, voted for President Biden by 14 percentage points in 2020.",
    "They can mail in their ballots.?\nSeveral states had already conducted elections primarily through mail-in voting before the pandemic, with there being little meaningful evidence of fraud.",
    "But Republicans, smarting over President Donald J. Trump's election loss to Joseph R. Biden Jr. and promulgating baseless voter fraud claims, have since sought to curtail voting by mail.",
    "Mr. Kemp has lied three times tonight about this,? Mr. Perdue said of the accusation that he did not take action against the 2020 election results following his loss in the Senate race.",
    "If Mr. Kemp does win the Republican Party's nomination for governor next month, he will again face Ms. Abrams, who is re-entering the governor's race with a huge fund-raising war chest.",
    "No one here thinks it's locked up,? said Christopher Nicholas, a Republican consultant in Harrisburg, though the Oz campaign's internal polling has shown a shift in the doctor's favor.",
    "Mr. Wilkerson, the state lawmaker, said he was most concerned about a possible cutoff in communication between his office and Ms. Greene's in Washington to address constituent issues.",
    "Ms. Greene, who is best known as a bomb-thrower on social media, has said little about how she would represent the communities new to her district if she wins re-election in November.",
    "It was Georgia where Trump pressured the state's top elections official to find 11,780 votes? to overturn the presidential election results, a phone call that is under investigation.",
    "Lightning round\nA few other primaries we're watching:\nMay 10: In West Virginia's Second Congressional District, redistricting has pitted two Republican incumbents against each other.",
    "About two dozen states have tightened laws regulating matters like who is eligible to vote by mail, the placement of drop boxes for absentee ballots and identification requirements.",
    "In Pennsylvania, the four leading Republican candidates for governor all said during a debate on Wednesday that they supported the repeal of no-excuse absentee voting in that state.",
    "It allows the governor, the Democratic Party's nominee for governor and special caucuses to raise unlimited funds throughout their campaigns, including during legislative sessions.",
    "Elliott Hennington, a community leader who is also a plaintiff in the lawsuit, described the redrawn district as disgraceful? and very disrespectful? to the voters now part of it.",
    "Brian Kemp and Secretary of State Brad Raffensperger, two Republicans whose refusal to help overturn the 2020 election results have made them the former president's top targets.",
    "The district  whose lines are changing and whose current representative, Tim Ryan, is running for Senate  is one of just a few in Ohio expected to be competitive in the fall.",
    "Shops and restaurants owned almost entirely by Black proprietors line its downtown center and are frequented by a growing population of young and racially diverse residents.",
    "Mr. Kemp's committee has raised more than $2 million in 2022, contributing to the governor's fund-raising advantage over his primary challenger, former Senator David Perdue.",
    "It is common and legal under federal law, unless found by a court to be deliberately used to prevent voters of the same race from electing a representative of their choice.",
    "Henry Lust, a Powder Springs city councilman, said, Our cities are growing, we have significant developments that are being put on the table and starting to be implemented.",
    "A state court in January struck down Pennsylvania's landmark law expanding absentee voting, a ruling that is the subject of a pending appeal before the U.S. Supreme Court.",
    "Court documents released by the House committee investigating the Jan. 6 riot place Hice at a meeting at the White House to discuss objections to certifying the election.",
    "And Stacey Abrams, the Democratic nominee for governor who lost to Mr. Kemp by less than two percentage points in 2018, was once again a focal point of the evening.",
    "districts for the long term instead.?\nMs. Greene won her seat by more than 50 percentage points in 2020 and her district will remain bright red under the new maps.",
    "The group argues that her comments in the days leading up to the Jan. 6 attack on the Capitol, including calling the day our 1776 moment,? helped incite the riot.",
    "He later called his pushing for Mr. Trump to endorse Mr. Kemp in 2018 the worst mistake I ever made.?\nThe two candidates will debate once more, on Sunday evening.",
    "If Vance wins, it'll be because of the Trump endorsement,? said Michael Hartley, a Republican consultant in Columbus who is not backing any of the candidates.",
    "When Judge Cohen denied their interpretation, they asked him to bar Mr. Kemp from continuing to fund-raise under his leadership committee to keep things fair.",
    "The extended discussion about the 2020 election forced Mr. Kemp to rehash his own role, both as Georgia's former secretary of state and its sitting governor.",
    "Powder Springs and Austell, with their combined population of under 25,000 people, will stand as a lone blue corner in a sea of red in the new 14th District.",
    "Brian Kemp in Georgia must suspend its efforts until the May 24 primary election formally declares a Republican nominee, a federal judge ruled on Thursday.",
    "But he most often pointed to Mr. Perdue's own loss to Jon Ossoff in the Senate race that same year to debunk Mr. Perdue's claims of a fraudulent election.",
    "Democratic strategists still see David McCormick, a wealthy former hedge fund executive and the other leading Republican candidate, as a potent threat.",
    "Much of the legislation she has sponsored is aimed at making political points, such as the Fire Fauci Act? and a resolution to impeach President Biden.",
    "Brad Little of Idaho faces a primary challenge from a field that includes his own lieutenant governor, Janice McGeachin, who has Trump's endorsement.",
    "Mention of Ms. Greene's new territory next door was met with nervous laughter and eye rolls among those at the festival who were aware of the change.",
    "His fund-raising and campaign organization were anemic; his past comments, such as his comparison of Trump to cultural heroin,? were hurting him.",
    "And Ron DeSantis, the governor of Florida, is drawing rapturous receptions within the party as he gears up for a likely presidential run in 2024.",
    "Senator Ted Cruz of Texas, Trump's top 2016 foe, has endorsed his own slate of candidates, as have conservative groups like the Club for Growth.",
    "Georgia, May 24\nThe biggest test of Trump's influence will come in Georgia, where control of the machinery of democracy itself is on the ballot.",
    "In 2020, about 2.6 million people who were adapting to pandemic life voted by mail in Pennsylvania, more than a third of the total ballots cast.",
    "Emily Cochrane spoke with Senator Lisa Murkowski of Alaska about whether her centrist credentials will appeal to Republican voters in November.",
    "That development, the result of new district maps drawn by Georgia state legislators, was part of a Republican drive to blunt Democrats' power.",
    "But polls show Kemp comfortably ahead, suggesting that dwelling on the past is not a path to victory despite the power of Trump's endorsement.",
    "With that caveat in mind, here's a look at the key primaries to watch:\nOhio Senate, May 3\nVance was looking wobbly before Trump's endorsement.",
    "On the Republican side, Trump endorsed Madison Gesiotto Gilbert, a conservative commentator who worked on Trump's campaigns in 2016 and 2020.",
    "Lou Barletta, one of the four on the debate stage and a former congressman, asserted that no-excuse absentee voting was conducive to fraud.",
    "In an early April ruling, Judge Mark Cohen barred Ms. Abrams from making use of the committees because she was not yet her party's nominee.",
    "Trump has endorsed candidates in at least 40 Republican primaries that are taking place in May, my colleague Alyce McFadden has tabulated.",
    "strategist called a re-centering? of Republican politics  with Trump as the party's strongest voice, but no longer its sole power broker.",
    "Jonathan Weisman, from Toledo, Ohio, reports that Democrats are in jeopardy because they can no longer rely on firm support from unions.",
    "At a March rally she hosted in her district, she boasted about having voted down every single piece of legislation backed by Democrats.",
    "The vote was 2-to-1, with Republicans on the Board of Commissioners saying that the reduction from several drop boxes would save money.",
    "In Alabama, he withdrew his endorsement of Representative Mo Brooks, an ardent Trump loyalist who has floundered as a Senate candidate.",
    "Every candidate has to lose or win their race themselves,? cautioned Ryan James Girdusky, an adviser to a super PAC supporting Vance.",
    "That was big in my eye.?\nA handful of residents, including Mr. Richards, are plaintiffs in a lawsuit challenging Georgia's new maps.",
    "There is one other big change: Powder Springs, a majority Black city, may soon be represented in Congress by Marjorie Taylor Greene.",
    "The delay and the fact that we have to have a second primary for the State House maps is really confusing for voters,? Miller said.",
    "The two have feuded bitterly, to the point where McGeachin issued her own executive orders while Little was traveling out of state.",
    "May 17: In North Carolina, Trump's preferred Senate candidate, Representative Ted Budd, is surging in the polls against former Gov.",
    "Lawyers for Ms. Abrams pushed back, saying she was the de facto Democratic nominee because she had not drawn a primary challenger.",
    "It will still stretch through Georgia's predominantly white and rural countryside all the way to its mountainous Tennessee border.",
    "Vance in the Republican primary, the venture capitalist and author of Hillbilly Elegy? has zoomed to the top of the public polls.",
    "She felt like that was just something that should have been swept up under the rug and not considered a riot,? Ms. Johnson said.",
    "Ms. Greene testified that she was referring to the courage to object? to the election results but was not calling for violence.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "POWDER SPRINGS, Ga.  Less than a 30-minute drive from Atlanta, Powder Springs embodies the changes reshaping Georgia politics.",
    "Helping to underwrite the lawsuit, along with similar efforts in other states, is Mike Lindell, the MyPillow chief executive.",
    "David Perdue is not being truthful to you,? Mr. Kemp said of his opponent's campaign promise to lower the state's income tax.",
    "The real test of Trump's party boss mojo, however, is fast approaching: actual elections, beginning with Ohio's on Tuesday.",
    "But in statewide races from Pennsylvania to Georgia and Idaho to North Carolina, Trump's imprimatur could prove decisive.",
    "In February, she gave a virtual speech at an event sponsored by white nationalists, leading to calls for her resignation.",
    "And with the primaries split, with state legislative voting postponed to later this year, turnout is a big question.",
    "She is facing a legal challenge to her candidacy after a group of Georgia voters sued to remove her from the ballot.",
    "The hourlong matchup was hosted by WTOC-TV in Savannah and moderated by a handful of anchors from across the state.",
    "The leadership committee, Georgians First, is the product of legislation that passed Georgia's state house in 2021.",
    "The Sykes name is well known in the Akron area, where her father, Vernon Sykes, remains in the state legislature.",
    "Trump is hoping to oust Raffensperger, the secretary of state, who was on the receiving end of that phone call.",
    "The former president has backed Representative Jody Hice, who supports Trump's debunked election fraud claims.",
    "In the governor's race, Trump dragooned former Senator David Perdue into trying to unseat Kemp, the incumbent.",
    "Support for Mike Gibbons, a businessman who spent more than $13 million of his own money on ads, is crumbling.",
    "Pennsylvania Senate and governor, May 17\nIn some ways, Pennsylvania offers the purest test of Trump's appeal.",
    "He said that he did not betray Republican voters but that he followed the law and constitution of the state.",
    "In Powder Springs and Austell, some residents are organizing to try to flex what political muscle they have.",
    "To be sure, plenty of Democratic voters around the country are represented by Republicans, and vice versa.",
    "Trump endorsed Representative Alex Mooney, who voted against the bipartisan infrastructure law, while Gov.",
    "Emilia Sykes, a state representative and former minority leader, will be the only Democrat on the ballot.",
    "Ms. Johnson said she found the congresswoman's comments about the Jan. 6 attack particularly concerning.",
    "The lone Democrat said that the change would make it more difficult for people to send in their ballots.",
    "As the men underlined their conservative political records, they repeatedly accused each other of lying.",
    "Perdue, who lost to Jon Ossoff, a Democrat, in 2021, has dutifully made 2020 the theme of his campaign.",
    "In both cases, Trump is backing challengers who have embraced his false narrative of a stolen election.",
    "Since declaring her candidacy in December, she has raised more than $9 million, outpacing the governor.",
    "They were shocked, surprised,? he said in an interview behind the Austell Community Task Force booth.",
    "We do not want to see that bright future derailed.?\nMs. Greene has also alienated some conservatives.",
    "But none of the bills she has sponsored this legislative session are specific to the 14th District.",
    "Listen, we know dead people have been voting in Pennsylvania all of our lives,? Mr. Barletta said.",
    "But Mandel, a well-known quantity in Ohio conservative politics, appears to be holding his ground.",
    "Republicans are watching these races closely for signs that Trump's hold over the party is waning.",
    "Vance jumped from 11 percent of likely voters in March to 23 percent now, according to Fox News.",
    "If you doubt the power of Donald Trump's endorsement, look no further than the Ohio Senate race.",
    "Mr. Perdue called the governor's 2018 win into question, saying his margin of victory was slim.",
    "More than half the evening was spent discussing the results of the last presidential election.",
    "Many of the politicians driving the clampdown can be found on the ballot themselves this year.",
    "He's the only candidate who has aired a campaign TV ad, but he trails Gilbert in fund-raising.",
    "They learned their district lines  tentatively  just a few weeks before early voting started.",
    "Ms. Greene's ability to legislate has been limited by her being stripped of committee duties.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Trump recently endorsed Mehmet Oz, the celebrity doctor, in the Republican Senate primary.",
    "But most experts believe that the lines will remain in place through the general election.",
    "Early voting for Georgia's primary election begins on Monday, and Election Day is May 24.",
    "What to read\nReporting from Columbus, Ohio, Jazmine Ulloa notes a new fixation in G.O.P.",
    "A third Republican to watch, Gregory Wheeler, has an endorsement from The Plain Dealer.",
    "Mr. Scott's new district now includes a larger share of the suburbs south of Atlanta.",
    "Ms. Strahan trails Ms. Greene in fund-raising and has struggled to raise her profile.",
    "Trump has yet to endorse a candidate for governor here, but his shadow looms large.",
    "She faces Shay Hawkins, a Republican who narrowly lost a state House race in 2020.",
    "He said he had not heard from her office since passage of the new maps last fall.",
    "In February, Ms. Greene spoke at a rally hosted by a prominent white supremacist.",
    "She later defended her attendance, calling criticisms an attempt to cancel? her.",
    "But some voters see Ms. Greene's brand of Republicanism as a particular affront.",
    "Those learning of it for the first time responded with outrage and confusion.",
    "Most of these contests involve an incumbent who faces no serious challenger.",
    "Jim Justice is backing Representative David B. McKinley, who voted for it.",
    "For Democrats, the primary election on Tuesday should be straightforward.",
    "She has drawn five Republican challengers for Georgia's May 24 primary.",
    "ATLANTA  A special fund-raising committee dedicated to re-electing Gov.",
    "See the full primary calendar and a detailed state-by-state breakdown.",
    "messaging: the baseless claim that unauthorized immigrants are voting.",
    "If you beat Jon Ossoff, why are you not a U.S. senator?? he quipped.",
    "They include Colorado and Utah, a state controlled by Republicans.",
    "But unlike in other states, the public polls haven't moved much.",
    "With a Trump endorsement, Mr. Perdue argued, he could widen it.",
    "The case is unlikely to be decided before the primary election.",
    "McGeachin also has a history of associating with extremists.",
    "strategists largely expect that Vance will win the primary.",
    " Blake & Leah\nIs there anything you think we're missing?",
    "She says she would reconnect the district to Washington.",
    "Now they don't even have to leave the cemetery to vote.",
    "His wife, Barbara, also once served in the state House.",
    "He will not have that this November,? Mr. Perdue said.",
    "Midterms Begin: The 2022 election season is underway.",
    "operatives view the former president as a liability.",
    "No candidates have had much time to make a mark.",
    "She did not respond to requests for comment.",
    "Already, there are signs of what one G.O.P.",
    "The stakes for American democracy are high.",
    "Pat McCrory and Representative Mark Walker.",
    "She lost to Mr. Kemp by 1.4 points in 2018.",
    "Here are the four incumbents most at risk.",
    "In Georgia, Trump is trying to unseat Gov.",
    "Here are some of the latest developments.",
    "But nobody is sure just how much juice.",
    "Since April 15, when Trump backed J.D.",
    "Everyone knows Trump still has juice.",
    "Trump's endorsement is no magic wand.",
    "Alyce McFadden contributed reporting.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "We'd love to hear from you.",
    "He had Trump's endorsement.",
    "We have a bright future.",
    "Privately, many G.O.P.",
    "ATLANTA  Gov.",
    "May 17: Gov.",
    "Now, G.O.P."
  ]
}