{
  "id": 1873,
  "mediaId": 65,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Georgia gov: Federal judge orders special committee to stop raising funds for Kemp",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f8cb3d77-7c49-4e56-b160-bb18074471cd/c020f52c-10a8-4abe-a4f7-7cfa2f31c9a0/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-federal-judge-orders-special-committee-stop-raising-funds-kemp",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bradford Betz",
  "authorUrl": "https://www.foxnews.com/person/b/bradford-betz",
  "termIds": [
    861,
    1547,
    1646,
    1837,
    1951,
    2095,
    501,
    2672
  ],
  "sentences": [
    "\"After months and months of Brian Kemp having exclusive ability to raise unlimited funds as a result of the bill he signed, Kemp will no longer be able to raise these funds while Stacey Abrams and One Georgia are denied equal ability to operate under the same rules.\"",
    "PROMINENT REPUBLICANS BACK SENATE CANDIDATE ADAM LAXALT IN THE MIDTERMS: NEVADA IS TURNING RED'\nPerdue already sued over the law, saying it was unfair that Kemp could raise and spend unlimited sums in the Republican primary while Perdue could not.",
    "\"We are pleased the Court both recognized and offered a remedy today for the unconstitutional fundraising advantage Brian Kemp signed into law benefiting himself,\" Abrams' campaign said in a statement sent to Fox News.",
    "Days later, Cohen rejected the campaign's request to allow Abrams to raise unlimited money through her One Georgia committee before the May 24 primary  even though Abrams is unopposed for the Democratic nomination.",
    "His GOP challenger, former U.S. Sen. David Perdue, and his Democratic challenger, Stacey Abrams, whom he faced in 2018, have BOTH criticized the leadership committee system, saying it unfairly helps Kemp.",
    "At a hearing Thursday, Cohen said that the rules had unfairly tipped the balance in Kemp's favor, as no other candidate could have a leadership committee, according to the Atlanta Journal-Constitution.",
    "Donors can give as much as they want, while they can't directly give candidates for statewide office more than $7,600 for a primary or general election and $4,500 for a runoff election.",
    "Judge Mark Cohen ruled that the leadership committee, Georgians First, cannot raise money until a GOP gubernatorial candidate is decided, the Atlanta Journal-Constitution reported.",
    "TRUMP ENDORSES JOE LOMBARDO IN CROWDED GOP PRIMARY FOR NEVADA GOVERNOR\nAbrams' campaign asked the judge last week to shut down unlimited contributions to Kemp's committee.",
    "The law allows the governor and lieutenant governor, opposing major party nominees, and both party caucuses in the state House and Senate to form leadership committees.",
    "Cohen had earlier denied Abrams' request to start taking unlimited amounts before she is all but expected to clinch the Democratic nomination on May 24.",
    "Cohen told her lawyers during an April 11 hearing that the right route to challenge the Georgia law was to go after Kemp's Georgians First committee.",
    "But he said the committee could continue to receive contributions and spend money in support of other public officials per campaign finance laws.",
    "Kemp's leadership committee allowed the governor to bypass laws that dictate how much an individual or business can donate to a candidate.",
    "Brian Kemp must suspend raising campaign money for his re-election bid until after the GOP primary, according to a report.",
    "Because there are additional candidates, the Republicans might not determine a nominee until after a June runoff.",
    "Cohen ruled in February that Kemp could not spend any more money from the committee on his primary campaign.",
    "The U.S. District Court of the Northern District of Georgia does not comment on cases as a policy.",
    "A federal judge on Thursday ruled that a special committee associated with Georgia Gov.",
    "Fox News reached out to Georgians First and the governor's office for comment.",
    "The Associated Press contributed to this report.",
    "Kemp has appealed the ruling."
  ]
}