{
  "id": 1890,
  "mediaId": 43,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "The Downballot: Big, big May primary preview (transcript)",
  "image": "https://images.dailykos.com/images/1043487/story_image/TexasVoting.jpg?1646144840",
  "link": "https://www.dailykos.com/story/2022/4/28/2094649/-The-Downballot-Big-big-May-primary-preview-transcript",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2277,
    2277,
    571,
    571,
    601,
    601,
    2537,
    2537,
    2791,
    2791,
    2834,
    2834,
    2850,
    2850,
    2862,
    2862,
    2934,
    2934
  ],
  "sentences": [
    "David Beard:\nHonestly, I wish that it would be true, that if we just run a left-wing candidate, that they would have energized the French populace and won by even more, but I do think there's a not inconsiderable amount of center and center-right voters who were pretty happy with Macron and voted for Macron against Le Pen, who I think would have, from their point of view, faced a very difficult choice if it had been the leading left-wing candidate, Melenchon, and Le Pen.",
    "Co-hosts David Nir and David Beard also shake their heads in disbelief at a bizarre ruling by New York's top court striking down the state's new maps; explain why Utah Democrats chose not to endorse a candidate for Senate at their convention last week; discuss the Michigan GOP's decision to back Trump-endorsed Big Lie proponents for state attorney general and secretary of state, and breathe a sigh of relief over the results of the French presidential runoff.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nBig, big May primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0053:14\n15301xApr 28, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThe 2022 election cycle really gets going next month with primaries in more than a dozen states, so we invited Daily Kos Elections editor Jeff Singer to join us on this week's episode of The Downballot to run us through all the key contests.",
    "In their roles as the top elections official in the state and the top law enforcement official in the state, they have played an important role in making sure that elections are run safely and soundly, whereas the candidates preferred by Trump, who just won the GOP convention, obviously believe that the only legitimate elections are ones that Republicans win and would unquestionably use their powers, if elected, to overturn any Democratic wins.",
    "The idea is obviously that there was basically next to no chance for any Democrat to have any chance of unseating Mike Lee, but McMullin, if he can pull some moderate Republicans and conservative Independents who would otherwise never consider voting for a Democrat, he might be able to put together a coalition that would allow him to win and defeat Lee.",
    "What you see nationally is Democrats in New York being forced to move into a fair map, while similar big key states on the Republican side are being allowed to slide through, despite laws that were passed, despite judgments from the Ohio Supreme Court, and have gerrymandered Republican maps go through that skews the entire House nationwide.",
    "They are holding primaries, of course, for a huge range of offices up and down the ballot, but we are going to start with a top tier contest that has attracted a great deal of attention and that is the Republican primary for Ohio's open Senate seat, which has been one of the nastiest primaries in a year full of many, many nasty primaries.",
    "We analyze some sloppy GOP food fights in Senate races in Alabama, North Carolina, Ohio, and Pennsylvania; a pair of primaries in Oregon and Texas where progressive challengers are seeking to oust irritating Democratic moderates; and the first incumbent-vs.-incumbent matchup of the year, thanks to West Virginia losing a House seat.",
    "David Beard:\nUtah Democrats are taking the very narrow path to try to get through with McMullin, so that at least you'll have somebody a little bit more to the center, a little bit more pro-democracy, if not a Democrat, somebody who doesn't like Mitch McConnell, who has promised not to vote for Mitch McConnell for majority leader.",
    "David Beard:\nJust another example of the importance of these downballot races, obviously we talk a lot about the Senate and the House here, but a lot of these races have really important results and so we'll be continuing to track these Michigan races and other races that affect elections and election rights moving forward.",
    "David Beard:\nOne thing I'll be watching for, and obviously we don't know who's going to win, but I think you maybe put the scales a little bit on Vance's side, now that he has Trump's endorsement, though other results wouldn't shock me, is that we've clearly seen that Vance is not one committed to a certain ideology.",
    "David Nir:\nRegardless of who wins, the Democrats will be nominating former State Supreme Court Justice Cheri Beasley, who doesn't really face any opposition in her primary, but there is yet another primary in North Carolina for a House race in the far western part of the state that we absolutely have to discuss.",
    "David Beard:\nEven worse, in Florida, where they just passed a significantly gerrymandered Republican map, the broad expectation is that the Florida Supreme Court is going to simply wave it through, despite very clear restrictions against gerrymandering in Florida law that was passed by Florida voters.",
    "It's very easy I think to imagine McMullin giving Lee a real scare, maybe even forcing Lee to spend some real money that he wouldn't have otherwise needed to spend, but it's still pretty hard to imagine him winning, but it's certainly something worth keeping an eye on as we move closer to November.",
    "DePerno, who is the candidate for attorney general, he shot on to the scene in 2020 after the elections, when he claimed that there was election fraud in Antrim County, that's in Northern Michigan, a small conservative community, because the vote totals initially showed Joe Biden leading.",
    "David Nir:\nIt's not at all clear to me how on earth lawmakers are supposed to force an evenly-divided partisan body, like the Independent Redistricting Commission, to quote, \"make more meaningful attempts at compromise,\" but that seems to have been the only recourse that was left to them.",
    "Jeff Singer:\nYou have former U.S. Attorney Bill McSwain, who was trying to portray himself as the Trump candidate, but he got a huge setback earlier this month when Trump himself denounced him for allegedly not doing enough to uncover voter fraud in 2020, which of course didn't exist.",
    "The PAC seems to think that this is a good line of attack to argue Fetterman is unelectable, because they've attacked Fetterman for applying for the endorsement of the Democratic Socialists of America, even though Fetterman explicitly said in their questionnaire he's not a socialist.",
    "One person observed that Jansa governed like he had Orban's majority, but he was actually in a minority and was reliant on coalition partners, which may have been a key reason why he was not able to build the dominance and media dominance that Orban has been able to build in Hungary.",
    "Macron won with 59% of the vote to Le Pen's 41% of the vote, which is a pretty large feat, a little bit larger than the polls were showing just before the election, which had been about 10 points, but was a significant narrowing from their 2017 election, which Macron won 66% to 33%.",
    "Gerrymandered maps are bad,\" but when you look at it from a national perspective, what you see is that, in New York, a gerrymandered map to favor Democrats was struck down by a Democratic court, but in Ohio, Republican gerrymandered maps were struck down once by a Republican court.",
    "Trump did, in fact, win by a big margin in the county, but of course, none of that ever matters in the MAGA world, so DePerno has continued to press his claims that election fraud, which again didn't exist, wound up causing Trump to lose the State of Michigan to Joe Biden.",
    "One of the worst candidates in the nation, and that's saying a lot, is state Senator Doug Mastriano, who, among many other things, tried to help Trump steal the state after the 2020 election and on January 6th, he was filmed passing breached barricades at the Capitol.",
    "He's had an advantage in every poll we've seen against Congressman Conor Lamb, who won a very closely watched special election in Western Pennsylvania in 2018, and State Representative Malcolm Kenyatta, who would be the first Black and gay senator to serve, ever.",
    "What's interesting is I think Lindstrom probably wouldn't have a shot in a straight-up two-way race against either of those other candidates, but in a three-way race, you could imagine him coming out with 35% of the votes, squeaking past the other two.",
    "Golob is going to be governing an alliance with a couple of other left-wing parties that made it into parliament and will hopefully turn Slovenia away from its more populist far-right direction that it had been trending over the past couple of years.",
    "To take it from a New York-focused point of a view to a national point of view just for a minute, the end result will probably be less gerrymandered maps for the State of New York, which in a vacuum, one could think, \"Oh, well, that's a good thing.",
    "What we'll see is a lot of instances where either a centrist candidate and a far-right candidate or a centrist candidate and a left-wing candidate or maybe a left-wing candidate and a right-wing candidate are the ones to advance to the runoffs.",
    "Golob is the former executive of a state-owned energy company who took over, in a friendly way, the country's very newly constituted Green Party, renamed it the Freedom Movement, and led it to victory all in the course of about a year.",
    "Madison Cawthorn, who needs no introduction, there is really no shortage of scandals attached to him, could do a whole podcast episode just on him, but his greatest liability might be because he essentially tried to switch districts.",
    "He's somebody who's extremely conservative and probably a little bit to the right of the State of Utah, which is much more of a Romney-esque Republican state, but still very hard to beat a Republican incumbent senator in a red state.",
    "David Nir:\nWe laugh about this, but there is a very real chance that these candidates could win and jeopardize, really, the very operations of democracy, and again I say not just in Michigan, but in a whole host of other states.",
    "One of those candidates is Economic Development Adviser Carrick Flynn, who has benefited from over $7 million from Protect Our Future PAC, which is a group that's funded by cryptocurrency billionaire Sam Bankman-Fried.",
    "Even more rare is what the Democratic group House majority PAC, which exists to keep Democrats in majority is doing, they don't intervene in primaries, except this time, they spent $1 million to help Flynn, as well.",
    "Jeff Singer:\nThis is held by moderate Democratic Congressman Kurt Schrader, who has annoyed progressives for, among many other things, saying last year that the idea of impeaching Donald Trump was like a lynching.",
    "David Nir:\nOne super interesting thing to note is that Edwards got into the race during that brief period of time when Cawthorn said \"See you\" to western North Carolina and was going to run in Charlotte instead.",
    "I promise we'll get to some Democratic contests soon enough, but the GOP primary for North Carolina's Senate seat, which is another open seat race and another truly nasty affair, Singer, what's going on there?",
    "Schrader's one and only Democratic primary opponent in the seat, which takes up some of the Portland suburbs in Central Oregon, is Jamie McLeod-Skinner, who would be the state's first LGBTQ member of Congress.",
    "There's some fear that Walker could cost Budd some much-needed votes, but while McCrory went into the year with leads in even a Budd internal poll, the recent numbers we've seen have shown Budd well-ahead.",
    "David Nir:\nOne other candidate who lost in the race for attorney general says that they might actually have to go this route, because they think that DePerno could lose his law license or even be indicted.",
    "David Beard:\nTurning to the other election that recently took place in Europe, this in the small country in Southeast Europe that was formerly part of Yugoslavia, Slovenia, who had their election, as well.",
    "If we could imagine perhaps a clearer fight between the right and left in France, do you think that might yield a result that was somewhat less concerning than this sizeable drop in Macron's winning share?",
    "David Beard:\nIn France, as we've been covering for the past few weeks, the presidential runoff took place between centrist Emmanuel Macron and far-right challenger Marine Le Pen, for Macron's second term.",
    "Jeff Singer:\nTo try to break Fetterman's lead, a pro-Lamb super PAC has spent heavily on ads that, relying on a since-corrected media report, falsely claims that Fetterman was a self-described socialist.",
    "There is at least a theoretical path there for McMullin, if you could combine his 2016 coalition of McMullin voters and Clinton voters to get to something like 49% that he would need to win the election.",
    "There wasn't really any polling done for that race in a runoff, because Melenchon was way behind for most of it until really the last couple of weeks, when left-wing voters united around him tactically.",
    "David Beard:\nI think that there are definitely plenty of voters in France who voted for Macron who probably would have voted for Le Pen or stayed home or cast a blank ballot in a Melenchon-Le Pen race.",
    "In a very vague footnote, they say that the courses of action that lawmakers could have resorted to include, quote, \"political pressure,\" and quote, \"more meaningful attempts at compromise on the IRC.\"",
    "To add insult to injury, it showed a clip reporting that, back in 2018, Trump endorsed none other than Mitt Romney for the Senate and one of the stars of the ad said, \"Well, look how that turned out.\"",
    "David Beard:\nOf course, in 2020, the more recent election, Trump got 58% of the vote, as a lot of those McMullin voters, when they didn't have somebody like McMullin to vote for, went home to Trump.",
    "Obviously, those millions of blank voters, who were probably left-wing voters, would've voted for him instead, but I think there are plenty of Macron voters who would have not gone with Melenchon.",
    "He's run ads that show Budd saying nice things about Putin and commending him as pretty smart when he invaded Ukraine, but so far that doesn't seem to be moving the needle the way he needs it to.",
    "The Court of Appeals said it probably has to take place in August, but there's a whole other round of litigation that's going to have to be resolved over the maps drawn up by this special master.",
    "We haven't had any primaries since then, but coming up next month, there are 13 different states holding primary elections, and that includes Texas, once again, because they're hosting runoffs.",
    "Donald Trump is endorsing wealthy businessman Charles Herbster, who was at the January 6 rally that came right before the attack on the Capitol, although Herbster says he wasn't there for that.",
    "That would be comparativelyobviously nothing's ideal here when you're in such a Republican statebut a comparatively more moderate candidate who would probably end up becoming governor there.",
    "One of them is he does not really take part in competitive Democratic primaries that often, so it's pretty notable he's weighing in here, even for someone who's tried to obstruct his agenda.",
    "David Beard:\nThis week, we're starting with late-breaking news in New York, where the state's highest court recently brought down a ruling on the state's congressional and state Senate map.",
    "The Court of Appeals struck down both the new map for the U.S. House and for the state Senate by saying that state legislators simply lacked the power to pass these maps in the first place.",
    "With three major candidates, or two and-a-half if you count Brooks, and a bunch of pretty minor contenders on the ballot, it's very unlikely anyone's going to win the first round outright.",
    "Even if a large majority of voters want Cawthorn gone, if he clears 30% and gets more votes than anyone else, he's renominated, which is pretty good, considering how red this district is.",
    "David Beard:\nIt's like if all of the House and Senate races in the U.S. took place on the same timetable as the Georgia runoffs happened back in the end of 2020 and the beginning of 2021.",
    "There was also a GOP convention in Michigan this past weekend, where Republicans nominated two Big Lie extremists for the important post of state attorney general and secretary of state.",
    "Mandel has the support of the Club for Growth, a really deep-pocketed conservative organization that's been particularly aggressive about going after Vance for what he said about Trump.",
    "Jeff Singer:\nThere was an interesting turn in this race back in January, when the federal investigators raided Cuellar's home and campaign office, allegedly over his ties to Azerbaijan.",
    "David Nir:\nWell, it's obvious there is quite a lot to watch coming up in the month of May and there are many races on the ballot in all of these states, beyond those that we mentioned.",
    "The race took a really unexpected turn two weeks ago when eight women, including a sitting Republican state senator, accused Herbster of groping them and other forms of sexual assault.",
    "In the second congressional district in the northern part of the state, we have our first incumbent-versus-incumbent primary of the whole cycle between Alex Mooney and David McKinley.",
    "There, the current Democratic incumbent is term-limited and Democrats have rallied around state Attorney General Josh Shapiro, but the GOP primary, once again, is a total shit-show.",
    "The way they got there was by saying that an amendment to the state constitution that voters approved in 2014 created a body that's called the Independent Redistricting Commission.",
    "It was about 33 points then, about 18 points now, but you also mentioned that a lot of left-leaning voters, in all likelihood, left their ballots blank or just didn't participate.",
    "In fact, Slovenia had experienced the sharpest decline in Democratic rights in Eastern Europe or Central Asia over the past two years, according to an NGO called Freedom House.",
    "We have more than a dozen states with elections on top, tons of interesting, nasty, messy, and even funny contests, so stick with us as we run them all down with Jeff Singer.",
    "David Beard:\nNow, Jansa had styled himself very much in the same vein as Viktor Orban in Hungary, very much this far-right populist, go after the media, go after the courts.",
    "Might have just been increase the statewide name recognition, might have been just to show what a big dog he was, but it really backfired, because that map no longer exists.",
    "David Beard:\nThen, nearby, we've got another Democratic primary, where there's an open seat because the seat is new, but at least one candidate has money like an incumbent.",
    "Jeff Singer:\nThen, there's Army veteran Mike Durant, who was held prisoner in Somalia for 11 days in 1993 in the incident that was dramatized in the movie Black Hawk Down.",
    "The voters want to give them the ability to govern, so they tend to support the candidates of the winning presidential candidate's party, so that's what you expect.",
    "This is a reflection of a broader pattern we are seeing in other states, where really extremist candidates, Big Lie supporters are running for secretary of state.",
    "In Oregon's 6th District, in the Willamette Valley, you have a large field, but only two of the nine Democratic candidates have really gotten a lot of attention.",
    "The highlight, of course, is Texas 28, which we've covered extensively here already, but what has been going on since the first round down there in South Texas?",
    "David Nir:\nThe majority also did something really strange, which it said, \"Okay, the maps for the state Senate and for Congress, they are void from the get-go.",
    "What the Club did was they ran an ad that not only showed Vance beating on Trump in the past, but it showed various people questioning, \"Has Trump seen this?\"",
    "The GOP went with Matthew DePerno in the race against Attorney General Dana Nessel and Kristina Karamo in the race against Secretary of State Jocelyn Benson.",
    "A third dissenter ripped that analysis to shreds and said that the majority, in fact, was wrong on this score, too, that the map was an illegal gerrymander.",
    "Jeff Singer:\nOn March 1st, conservative Democratic opponent Henry Cuellar led his progressive Democratic primary opponent, Jessica Cisneros, just 49 to 47%.",
    "She was a poll worker in Detroit and claimed, again without any evidence, that she saw fraud in the 2020 elections while she was working as a poll worker.",
    "As is typical with this flotsam and jetsam that Trump has managed to bring into the party, Karamo is also a total nutcase of the more traditional variety.",
    "It's a similar system, where all of the races go to runoffs between the top two candidates a couple of weeks later, just like the presidential system was.",
    "Last year, the Republican Legislature adopted a congressional map and put most of Cawthorn's existing seat in a different Western North Carolina district.",
    "There is former Governor Pat McCrory, might remember him from 2016, when he narrowly lost reelection over the backlash over the transphobic bathroom bill.",
    "One losing candidate for the secretary of state race said, \"I'm disappointed that Jocelyn Benson will be the secretary of state for the next four years.\"",
    "Oh, and this map that has no legal authority whatsoever, we're also going to say that it is a partisan gerrymander that violates the state constitution.\"",
    "David Nir:\nOnce again, Pennsylvania is a state that does not use runoffs, so whoever wins this primary could do so with a very small share of the vote.",
    "David Beard:\nOn the off chance he wins and we end up with some sort 50-49 Senate plus McMullin, it'll be a really interesting scenario to investigate.",
    "Let's move on now to the following week in May, May 10th, where we have two more states holding their primary elections, Nebraska and West Virginia.",
    "This race is open because Governor Pete Ricketts, who hails from one of the most influential donor families in the Republican Party, is termed out.",
    "The other candidate who's got plenty of attention here is state Rep. Andrea Salinas, who would be the first Latina to represent Oregon in Congress.",
    "This part of the decision was really, really strange, because at no point did a majority explain what the legislature should have done differently.",
    "There was a recent poll that showed a very close three-way race with Lindstrom for the first time with a small lead, but very little polling here.",
    "Due to reapportionment, West Virginia lost one of their congressional districts, which forced two incumbent Republicans to run against each other.",
    "He's completed reinvented himself to get Trump's endorsement to win this primary, but once he wins the primary, does he really need Trump anymore?",
    "It's a weird quirk of the election calendar in France that legislative elections now take place a couple of months after presidential elections.",
    "In both cases, two Trump-endorsed candidates who are Big Lie proponents defeated more traditional choices that were backed by the establishment.",
    "What you'll have as a result is Republican Senator incumbent Mike Lee riding on the Republican ticket and you'll have Independent Evan McMullin.",
    "You'll have no Democratic candidate, but you'll have it at least publicly known that the Democratic Party is backing McMullin's independent run.",
    "Jeff, we are extremely grateful to have you on, once again, to share all your knowledge of all of these many, many elections with our listeners.",
    "Their remedy is to have a trial court, working with an independent special master, come up with new maps for Congress and for the state Senate.",
    "David Nir:\nWe are going to swing back to the eastern portion of the United States and hit the third major state that has a primary on May 17th.",
    "He lost his election in Eastern Pennsylvania to the Delaware County Council back in 2017, but he's still a big presence, thanks to his wealth.",
    "Cawthorn, he gets a little greedy and says, \"I'm going to run for an even more Republican seat that I barely represent in the Charlotte area.\"",
    "After the break, we will be talking to Daily Kos Elections Editor Jeff Singer about the huge slate of primaries coming up in the month of May.",
    "We are going to be talking about a very bizarre ruling from New York's top court striking down the state's congressional and state Senate map.",
    "McCrory, if anything, is the less far-right candidate; that's because Ted Budd, who is Trump and the Club for Growth's candidate, is also in.",
    "I mean, it's safe to assume these were primarily left-wing voters who were unhappy with the options of a centrist and a far-right candidate.",
    "David Beard:\nWe also saw that turnout was 72% out of registered voters, which was a low for French presidential runoffs dating back to 1969.",
    "We have three major candidates, Lieutenant Governor John Fetterman, who's the tattooed, six-foot-nine candidate, who has this big fan base.",
    "There was much more of a sense that a lot of people voted for him purely to keep Le Pen out, rather than out of real energy on his behalf.",
    "The Republicans also have a race to watch here, but the GOP establishment's going all-in for a former Ted Cruz staffer named Cassy Garcia.",
    "Vance, like plenty of Republicans in 2016, was a vociferous Trump critic, who at one point mused he might even vote for Hillary Clinton.",
    "The Office of Congressional Ethics is also investigating Mooney for allegedly misusing campaign money, including $2,000 for Chick-fil-A.",
    "Singer is going to walk us through the top primaries that will be taking place, both for Democrats and Republicans, in the month of May.",
    "David Beard:\nNow that we got through that, I'm going to talk a little bit about Utah, which is very different, and the Utah Senate race.",
    "The expectation is, because it's a Republican court that has a lot of DeSantis appointments, that they're just going to wave it through.",
    "Jeff Singer:\nCawthorn's main opponent right now looks like state Senator Chuck Edwards, who has the endorsement of Senator Thom Tillis.",
    "What's resulted usually is it's been a big benefit for the winning presidential candidate, because they're on still a honeymoon period.",
    "It's a very messy legislative election to follow, but we'll definitely check in and see how that turns out when that happens in June.",
    "Most incumbents would be quite okay with that, but Cawthorn's constituents, they felt that he just tried to straight-up abandon them.",
    "McMullin ran for president in 2016 as an Independent, largely didn't do very well, except in Utah, where he got over 20% of the vote.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency, from Senate to city council.",
    "Michigan Republicans actually have to have another convention in August and so do Democrats to officially designate their nominees.",
    "We've got two really interesting, for different reasons, Democratic primaries over in Oregon, who will also be voting on May 17th.",
    "He's been focusing pretty much entirely on how he's Trump candidate and he's been proclaiming the Big Lie at every chance he gets.",
    "He's backed workplace protections for LGBTQ people and he voted to override Ricketts' veto on a gas tax and death penalty repeal.",
    "I very much hope that the Republican Supreme Court in Florida will strike down the DeSantis gerrymander and will force fair maps.",
    "David Nir:\nWe're going to keep rolling right along here, because like I said earlier, there are so many states coming up in May.",
    "The seat in the Laredo area is a longtime Democratic stronghold, but Biden won it only 53 to 46 in 2020, so it could be in play.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "McKinley was one of the few Republicans who voted for the Biden Administration's infrastructure bill, Mooney very much did not.",
    "Barletta, back in the early 2000s, was this virulent anti-immigration crusader when he was mayor of the small town of Hazleton.",
    "This was a pre-convention to allow their candidates to get an earlier start on the general election, but it isn't official yet.",
    "Walker has trailed very badly in the polls, but kept running, even though Trump tried to convince him to run for a House seat.",
    "The Republican Legislature was allowed to do a second round of gerrymandering and just pass it through, at least through 2022.",
    "David Nir:\nThat's particularly crucial, given that Michigan will, almost certainly once again, be a major swing state in 2014.",
    "It's hard to know exactly how that race would have turned out, but I don't think that it would have resulted in a bigger win.",
    "He since reinvented himself as a born-again MAGA conservative, but he's still taking plenty of flack for his past statements.",
    "We have Portman's choice, former state party chair Jane Timken, who is the only woman who's running a serious campaign here.",
    "I'm going to take us now across the pond to follow a couple of election results in Europe that went pretty well, all in all.",
    "Why would they get involved in a primary for a seat that, since Biden won at 55 to 42, really shouldn't be that competitive.",
    "All of these candidates for the U.S. House and for state Senate, they're going to have to start this process all over again.",
    "Unsurprisingly, that's not shaken Trump's confidence in him in the least, but we'll see if that affects things on May 10th.",
    "Every poll we've seen has shown Kemp either at or very close to the majority he'd need to avoid a runoff also on June 21st.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Believe it or not, that makes her not the only Republican candidate running for office this year on an anti-yoga platform.",
    "More than 3 million voters went to the polls that cast a blank ballot in protest of the two candidates who were available.",
    "Right now, New York's maps are a total black hole and there is just no predicting what's going to come out the other side.",
    "We're waiting to see if Trump's going to take sides now that he's abandoned Brooks, or if he just lets this one play out.",
    "We're also going to be discussing an unusual decision by the Utah Democrats to not nominate a candidate for U.S. Senate.",
    "Let's move on to West Virginia, where we've got another Republican primary, this time between two incumbent congressmen.",
    "If he doesn't need Trump, does he reinvent himself into some other direction, either in a Portmanesque way or something?",
    "Oz has been self-funding much of his bid, but so has former hedge fund manager David McCormick and his allied super PAC.",
    "We also have a wealthy businessman, Mike Gibbons, who unsuccessfully ran in the 2018 primary for the other Senate seat.",
    "They allowed the Ohio legislature to go back and draw another gerrymandered map and now those maps are being litigated.",
    "The expectation is that the primary will go ahead and the general will go ahead with these current gerrymandered maps.",
    "No corroboration on this claim from the FBI or Department of Justice, but it hasn't emerged in campaign ads this time.",
    "He was anti-Trump, like so many were in the beginning, pre-2016, but has now become a very, very tight ally to Trump.",
    "The constitution says that new maps have to come from the IRC and those maps have to be passed on a bipartisan basis.",
    "Though primaries started back in March with Texas, the 2022 election cycle really gets underway in the month of May.",
    "She has endorsement from Governor Kate Brown and the Congressional Hispanic Caucus has also spent $1 million on her.",
    "The two congressmen, they voted the same way most the time, but they diverged on two very important issues recently.",
    "Maybe it was the Club for Growth, which has been spending very heavily here on Budd's behalf, making the difference.",
    "If you would please rate us on Apple Podcasts and subscribe to us there, that would really help boost our audience.",
    "Delegates to Utah's State Democratic Convention voted on Saturday not to run a candidate, which is pretty unusual.",
    "The map that was adopted by the State Supreme Court no longer gave Cawthorn any real option except to run at home.",
    "In fact, Clinton and McMullin combined in 2016, got 49% of the vote, which was more than Trump's 45% of the vote.",
    "A dissenter said that was really nonsense and said that this view would leave the legislature hostage to the IRC.",
    "Maybe the polls are wrong, but if they're not, it's looking like Trump's going to take a very big black eye here.",
    "At a recent debate, he began, \"The election in 2020 was rigged and stolen,\" but that doesn't seem to be working.",
    "It really throws New York's politics into turmoil, though, because the filing deadline passed several weeks ago.",
    "If you haven't already, please subscribe to The Downballot on Apple Podcasts or wherever you listen to podcasts.",
    "Mastriano also recently addressed a QAnon-aligned group, although he claims not to have anything to do with it.",
    "Now, the interesting thing about French elections is that legislative elections are now coming up on June 12th.",
    "David Beard:\nThe difference here, obviously, is that Macron is definitely less popular now than he was in 2017.",
    "In other words, he assumes that Republicans have just conceded the race by nominating these lunatic candidates.",
    "There is perhaps some small chance of these results getting overturned when the delegates meet again in August.",
    "She claimed that gay people or anyone who has sex outside of marriage, quote, \"violates God's creative design.\"",
    "If you haven't already, please like and subscribe to The Downballot and leave us a five-star rating and review.",
    "Trump's not so fond of him anymore, especially after Kemp refused to help him steal the state two years later.",
    "Trump recently decided to endorse TV personality Mehmet Oz, as in Dr. Oz, who has very weak ties to the state.",
    "Those maps unquestionably favored Democrats, but this was the process that lawmakers believe was left to them.",
    "It's still a tough thing to accomplish, so we'll see how well McMullin is able to ride this very narrow path.",
    "Jeff Singer:\nYou also have former Congressman Mark Walker, who has some connections with the religious right.",
    "It's also gaining a congressional district, but the marquee contest has been yet another Republican primary.",
    "That could be an even bigger liability than all the coke and orgy allegations in the world that he lives in.",
    "You have former Congressman Lou Barletta, who lost the 2018 Senate race really badly to Democrat Bob Casey.",
    "We have seen the GOP win general elections in swing states, nominating the most unacceptable of candidates.",
    "Just because the IRC failed to come up with maps, that doesn't mean that you get to draw the maps instead.\"",
    "David Nir:\nThis pissed off yet another dissenter, who called it inappropriate that the court would do this.",
    "Trump sent a profane text message to the Club's president recently, after they kept airing anti-Vance ads.",
    "So far, none of them have benefited from anything like the endorsements the other two have, but we'll see.",
    "Cawthorne jumped back into the race in the 11th District and Edwards said, \"Well, I'm not going anywhere.\"",
    "David Beard:\nIf it is a rematch between Kemp and Abrams, that will certainly be a blockbuster in November.",
    "There are also two other states that have primary elections on the 17th, just to note, Idaho and Kentucky.",
    "David Beard:\nWe're going to wrap up in Texas, where they're taking some runoffs from their March primary.",
    "Cisneros is not getting outgunned the way she did back in 2020 when she narrowly lost in the first round.",
    "McKinley's backed by Governor Jim Justice; Mooney has Donald Trump and the Club for Growth in his corner.",
    "Jeff Singer:\nThen, you have a third major candidate, state Senator Brett Lindstrom, who is more moderate.",
    "Whitten doesn't have any big-name supporters, so it'll be a surprise if Garcia had any problem with her.",
    "Edwards, himself, even released a poll just last month that gave Cawthorn this huge 32 to 20 advantage.",
    "That is Pennsylvania, where we have competitive Democratic and Republican primaries in the Senate race.",
    "No one has any idea what the next set of maps will look like, but those also will be subject to appeal.",
    "Jeff Singer:\nNorth Carolina's Senate seat is open because Republican Senator Richard Burr is retiring.",
    "There was a recent poll from Fox that gave Vance a 23 to 18 lead over Mandel, but that's pretty tight.",
    "We are really excited to welcome back Daily Kos Elections Editor Jeff Singer for this week's episode.",
    "Then, you have state Senate Leader Jake Corman, who just this month, Corman was running out of money.",
    "David Nir:\nThis is a really bizarre outcome and Democrats obviously are extremely unhappy about this.",
    "We don't have any recent polls, but it's really been this demolition derby between Oz and McCormick.",
    "$7 million in outside spending for a House primary, that's, if not unheard of, it's very, very rare.",
    "The one good thing, I suppose, is that the Republican establishment is pretty despondent about this.",
    "You also have wealthy businessman Dave White, who has used his resources to outspend everyone else.",
    "As well, we are going to catch up on the long-awaited results of the French presidential election.",
    "We'll definitely cover any notable results from those states as we track these races week by week.",
    "This one might've gotten more ink than any other, but it seems like it's possibly about to fizzle?",
    "This was a convention to choose their nominees for state attorney general and secretary of state.",
    "We'll see if that does him any damage, but so far it doesn't seem to be, at least in the primary.",
    "The very day he was about to announce he was dropping out of the race, Corman says, \"Never mind.",
    "If it comes down to who has more local roots, though, that's where things get more interesting.",
    "Just go to dailykos.com/thedownballot, click on the Apple Podcasts link, and you're good to go.",
    "Trump's gone all-in for former Senator David Perdue, who lost last year's runoff very narrowly.",
    "Moving on to May 24th, we've got three states holding a primary, along with the Texas runoffs.",
    "Macron's party won an absolute majority back in 2017 and it looks like they might do so again.",
    "North Carolina, though, no second round, unless no candidate takes more than 30% of the vote.",
    "Whoever wins this one is going to take on Stacey Abrams, who was the 2018 Democratic nominee.",
    "Cuellar's attorney recently said the congressman is not a target in a federal investigation.",
    "He was about to drop out, then Trump attacks McSwain, and Corman suddenly gets another idea.",
    "He's benefited from recent footage of Oz kissing his own star on the Hollywood Walk of Fame.",
    "It doesn't look like Flynn is such a great candidate that the group needs to intervene here.",
    "That will cause different alliances and different vote decisions all throughout the country.",
    "The winner of the Republican primary is probably going to go on to win the general election.",
    "Let's start off with Nebraska's governor race, which has had some interesting developments.",
    "The fact is, four judges on the Court of Appeals said that these maps should be tossed out.",
    "There was a lot of nasty sniping between the majority and the dissenters in the footnotes.",
    "What they decided to do instead is back conservative Independent Evan McMullin's campaign.",
    "Brian Kemp, the governor, he rode to victory in the 2018 primary after Trump endorsed him.",
    "David Nir:\nWell, next door in Georgia, we have another whole host of compelling primaries.",
    "She's attacked Cuellar for siding with Texas Republicans to restrict the right to choose.",
    "McKinley represents about two-thirds of this new seat, Mooney represents the other third.",
    "He, himself, has said he was a Trump conservative before there were Trump conservatives.",
    "Ricketts is backing Jim Pillen, who is a University of Nebraska regent and a pig farmer.",
    "Garcia faces Sandra Whitten, who lost a very little-noticed campaign in 2020 to Cuellar.",
    "The problem for Perdue, it seems, is that Kemp still is liked by a majority of the base.",
    "Edwards has been running ads saying, \"I'm not some vapid celebrity, unlike my opponent.",
    "David Beard:\nWe promised some Democratic primaries and now we're going to get to them.",
    "We've got a couple of interesting primaries on the Republican side, one in each state.",
    "We'll see if that moves the needle, but even Edwards knows he's starting well-behind.",
    "That's not something you would expect a state Democratic convention to do very often.",
    "New York has to have new maps and so we are going to pass new maps,\" and so they did.",
    "We have seen really no recent polls to indicate anyone is the frontrunner right now.",
    "In addition, we have as our guest this week Daily Kos Elections Editor Jeff Singer.",
    "You actually have to collect thousands of signatures in order to get on the ballot.",
    "She had a podcast, where she obviously said a whole ton of absolutely nutty things.",
    "Not all of them have much money or name recognition, but anything can happen here.",
    "If 31% of the voters here want a vapid celebrity, that's pretty good for Cawthorn.",
    "If it comes down to who's more Trumpy, Mooney easily takes it, really no question.",
    "David Nir:\nYou mentioned that Macron's winning margin fell considerably from 2017.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Really, Cawthorn's attempt to abandon his constituents could be his true undoing.",
    "In a race this packed, anything could happen, but those seem to be the big five.",
    "He was defeated by a political newcomer, Robert Golob, and his Freedom Movement.",
    "Trump hates him, because the team is trying to change its name to the Guardians.",
    "As you said, the main event on Tuesday will be the Ohio Republic Senate primary.",
    "They don't know which voters would actually be eligible to sign their petitions.",
    "Apple Podcasts is like The New York Times Best Seller List of the podcast world.",
    "Let's start off in Alabama, where the Republican Senate primary is taking place.",
    "David Nir:\nThis is a huge surprise and really a strange ruling in so many ways.",
    "Schrader apologized and voted to impeach Trump anyway, but the damage was done.",
    "That's far less than what Flynn has benefited from, but it's still quite a lot.",
    "As you said, Nir, North Carolina's runoff rules are different than many states.",
    "Many states, if you take less than a majority of the vote, you're in a runoff.",
    "McKinley supported creating a January 6th commission, Mooney very much didn't.",
    "If it comes down to geography or who's the more West Virginian, it's McKinley.",
    "All they said was that the maps should be passed with, quote, \"all due haste.\"",
    "She claimed that Beyonce was, quote, \"Bringing black Americans into Paganism.\"",
    "Alabama's another state where you do need to win a majority to avoid a runoff.",
    "We'll see if that changes, but so far Cisneros is focusing on abortion rights.",
    "David Nir:\nKaramo, the candidate for secretary of state, is a similar figure.",
    "David Beard:\nNow, this is of course in Utah, which is an extremely red state.",
    "He moved to West Virginia in 2013 when he launched his campaign for governor.",
    "David Nir:\nThere is another demolition derby going on in the governor's race.",
    "Why don't you kick us off talking about what's going on in the Buckeye State?",
    "It's an open seat, because Republican Senator Rob Portman decided to retire.",
    "It'll be interesting to see how that plays out in the legislative elections.",
    "We will, of course, be covering many of these contests in the weeks to come.",
    "If they're on Trump's bad side, it could have a big effect on future races.",
    "Jeff Singer:\nMastriano has plenty of competition, though, on the far-right.",
    "Now, who that means he would vote for if he theoretically won is not clear.",
    "When courts do this kind of thing, it's called issuing an advisory opinion.",
    "You have to get it from within the district that you're seeking to run in.",
    "At the top of the ticket is the GOP battle in the Georgia governor's race.",
    "Vance might have some momentum going in, but we'll really see on Tuesday.",
    "This coming Tuesday, we have two states on the docket, Indiana and Ohio.",
    "David Nir:\nMichigan Republicans also held a convention over the weekend.",
    "The Supreme Court, bizarrely, is actually New York's lowest-level court.",
    "Ohio isn't the first time the club and Trump have parted ways, it seems.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Jeff Singer:\nThe good news for Cawthorn is that he has seven opponents.",
    "This one, the runoff rules could have an effect on the ultimate result.",
    "A Thom Tillis-aligned super PAC has also been running ads against him.",
    "Jeff Singer:\nThe GOP race, on the other hand, such an expensive mess.",
    "He was the Republican nominee for the other Ohio Senate seat in 2012.",
    "The Downballot comes out every Thursday everywhere you find podcasts.",
    "On May 17, we have five states, including a couple of very big ones.",
    "Where the Club for Growth launched an ad attacking Vance and Trump?",
    "He also importantly didn't have an absolute majority in parliament.",
    "There was a real increase for Le Pen and her vote five years later.",
    "It could not agree on any maps, so that meant New York had no maps.",
    "Its members are mostly appointed by politicians in the legislature.",
    "Thanks also to our producer, Cara Zelaya, and editor, Tim Einenkel.",
    "She's the former chief of staff to retiring Senator Richard Shelby.",
    "Cuellar's pretty much stuck with his strategy from the first round.",
    "I will say, though, that the story is not completely written here.",
    "I think Melenchon, there was a good chance he would've still won.",
    "That's a state that's seen a lot of political upheaval this year.",
    "Mooney's chief of staff is also a current Maryland state senator.",
    "Jeff Singer:\nOn the Democratic side, things are a bit more clear.",
    "She said that yoga was a satanic ritual, that's an actual quote.",
    "They're gently, but very much questioning Trump's judgment here.",
    "They can't do it right now, because there are no district lines.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "There's already been some fighting between Trump and the Club.",
    "Whoever wins is almost certainly going to prevail in November.",
    "David Nir:\nSomething funny happened just on Wednesday, right?",
    "Jeff Singer:\nWe have also former state Treasurer Josh Mandel.",
    "These are both fairly small, very strongly Republican states.",
    "You don't just tick a box on a piece of paper and mail it in.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "Very close, just below what Cuellar needed to avert a runoff.",
    "There's Katie Britt, who ran the state's Chamber of Commerce.",
    "This one will probably go to a second round almost certainly.",
    "They had a right-wing populist, Prime Minister Janez Jansa.",
    "Vance, who is best known as the writer of Hillbilly Elegy.",
    "We have talked about Madison Cawthorn plenty on this show.",
    "David Nir:\nI'm David Nir, political director of Daily Kos.",
    "You can't just get it from any random person in the state.",
    "Cisneros, this time she's focused more on abortion rights.",
    "That's where Trump withdrew his endorsement of Mo Brooks.",
    "Mooney, by contrast, served in the Maryland state Senate.",
    "Here's how far Republican politics has gone to the right.",
    "If he does win, that'll at least be interesting to watch.",
    "The Club is a major power player in Republican politics.",
    "We have state Senator Matt Dolan, who also is very rich.",
    "Republicans might have found themselves in a total mess.",
    "If people want the more MAGA-approved candidate, Mooney.",
    "The polls show Budd's really taking control of the race.",
    "You're going to have to pull a lot of those voters back.",
    "That's essentially what the court seems to be okay with.",
    "You can reach us by email at thedownballot@dailykos.com.",
    "He's using his money to finance super PACs to help her.",
    "Jeff Singer:\nPerdue's trying to still get to his right.",
    "They're only supposed to litigate actual controversies.",
    "The only thing these candidates do is cool their heels.",
    "Jeff Singer:\nThat's caused a lot of consternation here.",
    "Trump may have clarified things when he endorsed Vance.",
    "He's fervently conservative on pretty much everything.",
    "These two, DePerno and Karamo, present a real danger.",
    "Now, Jansa had only been in government for two years.",
    "Maybe people are just tired of seeing McCrory's face.",
    "It's certain that New York's primary will be delayed.",
    "New York's top court is called the Court of Appeals.",
    "Joe Biden, just over the weekend, endorsed Schrader.",
    "We have no fewer than five major candidates running.",
    "Jeff Singer:\nCuellar has long had a money advantage.",
    "David Beard:\nThat runoff would take place June 21st?",
    "McCormick is portraying Oz as this vapid celebrity.",
    "It has a brand new court-imposed congressional map.",
    "She's arguing he's dependent on special interests.",
    "David Beard:\nWe've got a jam-packed episode today.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Courts aren't supposed to issue advisory opinions.",
    "Donate $5\nDonate $25\nDonate $15\n\nDonate $5 monthly",
    "In New York, filing is not just a mere formality.",
    "It's still going to help her get her message out.",
    "Jeff Singer:\nNo one's quite sure why he did that.",
    "I'm just a hardworking, dependable conservative.\"",
    "The one we want to start with is North Carolina.",
    "David Nir:\nWell, the Court of Appeals said, \"No.",
    "They want their hands on the election machinery.",
    "Both Nessel and Benson won close races in 2018.",
    "He's been very involved in Republican politics.",
    "A polarity of respondents were still undecided.",
    "David Nir:\nWell, that wraps up our weekly hits.",
    "If we know Trump, that's not going to go well.",
    "They'd been running ads attacking one another.",
    "David Nir:\nThe IRC failed to produce new maps.",
    "We'll have to watch and see how that develops.",
    "There are two other major candidates to watch.",
    "He's argued Cisneros is weak on public safety.",
    "He still does, but it's narrowed quite a bit.",
    "David Nir:\nThey didn't put a timetable on it.",
    "His family co-owns Cleveland's baseball team.",
    "They have absolutely no validity whatsoever.",
    "I don't have very high expectations on that.",
    "We have no idea who Republican nominee J.D.",
    "How do you see both of these going, Singer?",
    "Maybe it was Trump pushing Budd extra hard.",
    "Jeff Singer:\nBrooks is still limping along.",
    "David Beard:\nYeah, this one is a real mess.",
    "We'll be back next week with a new episode.",
    "David Beard:\nThat's all from us this week.",
    "There are three major Republicans running.",
    "One very prominent Democrat doesn't agree.",
    "David Beard:\nIt's really an Etch A Sketch.",
    "Donald Trump recently decided to weigh in.",
    "It's just an extremely frustrating result.",
    "Lee, of course, is extremely conservative.",
    "It turns out it was just a clerical error.",
    "Would he vote for a different Republican?",
    "Nebraska, that's a very Republican state.",
    "The group had to pull the ad and edit it.",
    "We've talked a little bit about that one.",
    "The Club for Growth is still on his side.",
    "She has no primary opposition this time.",
    "Things very much appear to have changed.",
    "His family's been there for a long time.",
    "Jeff Singer:\nThis is an interesting one.",
    "Biden, in many ways, is not like Trump.",
    "There are seven other candidates here.",
    "McKinley is a longtime West Virginian.",
    "That's Alabama, Arkansas, and Georgia.",
    "This is a short blurb about Daily Kos.",
    "Thanks to Jeff Singer for joining us.",
    "It's just been this giant messy race.",
    "The majority, this was a 4-3 opinion.",
    "We're seeing it in Georgia, as well.",
    "It's expensive, it's time-consuming.",
    "Perdue's sticking with his strategy.",
    "He endorsed venture capitalist J.D.",
    "He didn't even vote there in 2020.",
    "There are nine candidates running.",
    "The legislature said, \"Well, okay.",
    "This panel was at a total impasse.",
    "There are three major candidates.",
    "David Beard:\nHello, and welcome.",
    "Kemp is anything but a moderate.",
    "Jeff Singer:\nIt very well could.",
    "We have a big favor to ask you.",
    "It was really bitterly divided.",
    "Again, that's not super likely.",
    "Vance is going to end up being.",
    "David Nir:\nFirst up is May 3rd.",
    "It's a very, very strange race.",
    "Shelby's going all-in for her.",
    "Brooks really is in bad shape.",
    "She's run to Schrader's left.",
    "Let's start with Oregon Five.",
    "Would he vote for a Democrat?",
    "There was no need to do this.",
    "It's not independent at all.",
    "You can do that very easily.",
    "There's a lot going on here.",
    "More ads are being run here.",
    "Jeff Singer:\nThank you, Nir.",
    "Jeff Singer:\nThank you, Nir.",
    "I'm not so sanguine at all.",
    "It's caused a lot of angst.",
    "I'm going to stick around.\"",
    "There are other candidates.",
    "It's not the Supreme Court.",
    "We're seeing it in Arizona.",
    "Would he vote for himself?",
    "What are we covering, Nir?",
    "It's still called the IRC.",
    "There's a lot to see here.",
    "Jeff Singer, welcome back.",
    "This is not a small thing.",
    "What's going on there now?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "He lost to Sherrod Brown.",
    "This is a very red state.",
    "That map got struck down.",
    "Jeff Singer:\nThat, it is.",
    "What happened there, Nir?",
    "Jeff Singer:\nAll right.",
    "Daily Kos is different.",
    "He's been self-funding.",
    "He's all over the air.",
    "Jeff Singer:\nOh, yeah.",
    "It's great to be back.",
    "There are four others.",
    "What's going on there?",
    "He also has a primary.",
    "David Nir:\nWe sure do.",
    "It was quickly fixed.",
    "McCrory's fired back.",
    "What do we have here?",
    "Jeff Singer:\nRight.",
    "David Beard:\nYeah.",
    "Jeff Singer:\nYeah.",
    "Jeff Singer:\nYeah.",
    "It's very strange.",
    "Jeff Singer:\nYeah.",
    "David Beard:\nYeah.",
    "There are no maps.",
    "Maybe they won't.",
    "Jeff Singer:\nYes.",
    "It's been a mess.",
    "It's been great.",
    "Please read it.",
    "Stay with us.",
    "He's not."
  ]
}