{
  "id": 1893,
  "mediaId": 129,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "For Trump, May Could Be the Cruelest Month",
  "image": "https://static01.nyt.com/images/2022/04/28/us/politics/28onpolitics-pm-newsletter-trump/merlin_205888065_f346131a-f03e-4b61-ac1b-3555d626c057-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/28/us/politics/trump-primary-endorsements.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2203,
    2203,
    1801,
    1801,
    1710,
    1710,
    1147,
    1147,
    428,
    380,
    380,
    428,
    2672,
    2672,
    2845,
    2834,
    2834,
    2845
  ],
  "sentences": [
    "Some of the usual efforts to inform voters about important dates, like when to register and the deadline for early voting, didn't happen this year with details in flux, said Jen Miller, executive director of the League of Women Voters of Ohio, which is in litigation over the maps in front of the Supreme Court.",
    "Two other candidates are ardent backers of his stolen election claims: former Representative Lou Barletta, whose campaign is managed by former Trump advisers; and Doug Mastriano, a state lawmaker and retired colonel who helped organize transportation to the Stop the Steal? rally on Jan. 6.",
    "And while he has shown a unique ability to energize the party's base and turn out new voters, those operatives are still dreading the likelihood that he runs again in 2024, anchoring candidates up and down the ballot to an erratic, divisive figure who was rejected by swing voters in 2020.",
    "An added wrinkle is that the boundaries of the district aren't technically final: Ohio's redistricting process has been tied up in the courts, and the State Supreme Court could still rule against the current maps.",
    "If 2022 is as bad for Democrats as most everybody else, myself included, expects it to be, Republicans will flip this district,? said Ryan Stubenrauch, a Republican strategist in Ohio who grew up in the area.",
    "Most of his voters appear to be migrating toward Vance rather than Josh Mandel, the other leading candidate in the race, said Jeff Sadosky, a former political adviser to Senator Rob Portman, who is retiring.",
    "He issued an anti-endorsement to Bill McSwain, a former U.S. attorney who served in the Trump administration, calling him a coward, who let our country down? by not stopping massive? election fraud in 2020.",
    "The risk for Trump is that if the candidates he has endorsed end up losing, his influence over Republican primary voters looks substantially diminished,? said Whit Ayres, a longtime Republican pollster.",
    "In a recent poll by Quinnipiac University, 45 percent of Republicans said they would be more likely to vote for a candidate endorsed by Trump, whereas 44 percent said it would make no difference.",
    "President Biden would have carried this newly drawn district by just three percentage points, making it a must-win for Democrats as they face challenges in maintaining their House majority.",
    "how they run\nThe district  whose lines are changing and whose current representative, Tim Ryan, is running for Senate  is one of just a few in Ohio expected to be competitive in the fall.",
    "No one here thinks it's locked up,? said Christopher Nicholas, a Republican consultant in Harrisburg, though the Oz campaign's internal polling has shown a shift in the doctor's favor.",
    "It was Georgia where Trump pressured the state's top elections official to find 11,780 votes? to overturn the presidential election results, a phone call that is under investigation.",
    "Lightning round\nA few other primaries we're watching:\nMay 10: In West Virginia's Second Congressional District, redistricting has pitted two Republican incumbents against each other.",
    "Brian Kemp and Secretary of State Brad Raffensperger, two Republicans whose refusal to help overturn the 2020 election results have made them the former president's top targets.",
    "Court documents released by the House committee investigating the Jan. 6 riot place Hice at a meeting at the White House to discuss objections to certifying the election.",
    "If Vance wins, it'll be because of the Trump endorsement,? said Michael Hartley, a Republican consultant in Columbus who is not backing any of the candidates.",
    "Democratic strategists still see David McCormick, a wealthy former hedge fund executive and the other leading Republican candidate, as a potent threat.",
    "Brad Little of Idaho faces a primary challenge from a field that includes his own lieutenant governor, Janice McGeachin, who has Trump's endorsement.",
    "His fund-raising and campaign organization were anemic; his past comments, such as his comparison of Trump to cultural heroin,? were hurting him.",
    "And Ron DeSantis, the governor of Florida, is drawing rapturous receptions within the party as he gears up for a likely presidential run in 2024.",
    "Senator Ted Cruz of Texas, Trump's top 2016 foe, has endorsed his own slate of candidates, as have conservative groups like the Club for Growth.",
    "Georgia, May 24\nThe biggest test of Trump's influence will come in Georgia, where control of the machinery of democracy itself is on the ballot.",
    "Emily Cochrane spoke with Senator Lisa Murkowski of Alaska about whether her centrist credentials will appeal to Republican voters in November.",
    "But polls show Kemp comfortably ahead, suggesting that dwelling on the past is not a path to victory despite the power of Trump's endorsement.",
    "On the Republican side, Trump endorsed Madison Gesiotto Gilbert, a conservative commentator who worked on Trump's campaigns in 2016 and 2020.",
    "Trump has endorsed candidates in at least 40 Republican primaries that are taking place in May, my colleague Alyce McFadden has tabulated.",
    "strategist called a re-centering? of Republican politics  with Trump as the party's strongest voice, but no longer its sole power broker.",
    "Jonathan Weisman, from Toledo, Ohio, reports that Democrats are in jeopardy because they can no longer rely on firm support from unions.",
    "In Alabama, he withdrew his endorsement of Representative Mo Brooks, an ardent Trump loyalist who has floundered as a Senate candidate.",
    "Every candidate has to lose or win their race themselves,? cautioned Ryan James Girdusky, an adviser to a super PAC supporting Vance.",
    "The two have feuded bitterly, to the point where McGeachin issued her own executive orders while Little was traveling out of state.",
    "May 17: In North Carolina, Trump's preferred Senate candidate, Representative Ted Budd, is surging in the polls against former Gov.",
    "The delay and the fact that we have to have a second primary for the State House maps is really confusing for voters,? Miller said.",
    "Vance in the Republican primary, the venture capitalist and author of Hillbilly Elegy? has zoomed to the top of the public polls.",
    "The real test of Trump's party boss mojo, however, is fast approaching: actual elections, beginning with Ohio's on Tuesday.",
    "But in statewide races from Pennsylvania to Georgia and Idaho to North Carolina, Trump's imprimatur could prove decisive.",
    "In February, she gave a virtual speech at an event sponsored by white nationalists, leading to calls for her resignation.",
    "And with the primaries split, with state legislative voting postponed to later this year, turnout is a big question.",
    "The Sykes name is well known in the Akron area, where her father, Vernon Sykes, remains in the state legislature.",
    "Trump is hoping to oust Raffensperger, the secretary of state, who was on the receiving end of that phone call.",
    "The former president has backed Representative Jody Hice, who supports Trump's debunked election fraud claims.",
    "In the governor's race, Trump dragooned former Senator David Perdue into trying to unseat Kemp, the incumbent.",
    "Support for Mike Gibbons, a businessman who spent more than $13 million of his own money on ads, is crumbling.",
    "Pennsylvania Senate and governor, May 17\nIn some ways, Pennsylvania offers the purest test of Trump's appeal.",
    "Trump endorsed Representative Alex Mooney, who voted against the bipartisan infrastructure law, while Gov.",
    "Emilia Sykes, a state representative and former minority leader, will be the only Democrat on the ballot.",
    "Perdue, who lost to Jon Ossoff, a Democrat, in 2021, has dutifully made 2020 the theme of his campaign.",
    "In both cases, Trump is backing challengers who have embraced his false narrative of a stolen election.",
    "Republicans are watching these races closely for signs that Trump's hold over the party is waning.",
    "But Mandel, a well-known quantity in Ohio conservative politics, appears to be holding his ground.",
    "Vance jumped from 11 percent of likely voters in March to 23 percent now, according to Fox News.",
    "If you doubt the power of Donald Trump's endorsement, look no further than the Ohio Senate race.",
    "He's the only candidate who has aired a campaign TV ad, but he trails Gilbert in fund-raising.",
    "They learned their district lines  tentatively  just a few weeks before early voting started.",
    "But most experts believe that the lines will remain in place through the general election.",
    "Trump recently endorsed Mehmet Oz, the celebrity doctor, in the Republican Senate primary.",
    "What to read\nReporting from Columbus, Ohio, Jazmine Ulloa notes a new fixation in G.O.P.",
    "A third Republican to watch, Gregory Wheeler, has an endorsement from The Plain Dealer.",
    "Trump has yet to endorse a candidate for governor here, but his shadow looms large.",
    "She faces Shay Hawkins, a Republican who narrowly lost a state House race in 2020.",
    "Most of these contests involve an incumbent who faces no serious challenger.",
    "Jim Justice is backing Representative David B. McKinley, who voted for it.",
    "For Democrats, the primary election on Tuesday should be straightforward.",
    "Ohio Senate, May 3\nVance was looking wobbly before Trump's endorsement.",
    "messaging: the baseless claim that unauthorized immigrants are voting.",
    "But unlike in other states, the public polls haven't moved much.",
    "McGeachin also has a history of associating with extremists.",
    "strategists largely expect that Vance will win the primary.",
    " Blake & Leah\nIs there anything you think we're missing?",
    "His wife, Barbara, also once served in the state House.",
    "operatives view the former president as a liability.",
    "No candidates have had much time to make a mark.",
    "Pat McCrory and Representative Mark Walker.",
    "The stakes for American democracy are high.",
    "Already, there are signs of what one G.O.P.",
    "In Georgia, Trump is trying to unseat Gov.",
    "But nobody is sure just how much juice.",
    "Since April 15, when Trump backed J.D.",
    "Everyone knows Trump still has juice.",
    "Trump's endorsement is no magic wand.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "We'd love to hear from you.",
    "Privately, many G.O.P.",
    "May 17: Gov.",
    "Now, G.O.P."
  ]
}