{
  "id": 1894,
  "mediaId": 1576,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Judge halts Kemp's unlimited fundraising in Georgia governor's race",
  "image": "https://www.wabe.org/app/uploads/2022/04/AP22114469955679-336x189.jpg",
  "link": "https://www.wabe.org/?p=276982",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    861,
    1646,
    1951,
    2095,
    4325,
    2672
  ],
  "sentences": [
    "Ruling on a motion in a lawsuit filed by Democratic candidate for governor Stacey Abrams, U.S. District Judge Mark Cohen said Kemp's Georgians First Leadership Committee cannot solicit or receive contributions until after the primary election and any possible runoff that makes him the Republican nominee for governor.",
    "After months and months of Brian Kemp having exclusive ability to raise unlimited funds as a result of the bill he signed, Kemp will no longer be able to raise these funds while Stacey Abrams and One Georgia are denied equal ability to operate under the same rules,? she said in a statement.",
    "Cohen had already ruled in February that Kemp couldn't spend money from his leadership committee on his reelection bid during the primary after Perdue challenged the constitutionality of the law that allowed leadership committees.",
    "Leadership committees can also collect unlimited contributions, while candidates for statewide office cannot collect more than $7,600 from an individual donor for a primary or general election and $4,500 for a runoff election.",
    "A state law passed last year and signed by Kemp allowed certain top elected officials and party nominees to create leadership committees? that can raise campaign funds without limits, including during the legislative session.",
    "Cohen said it is likely that as the lawsuit progresses Abrams will likely be able to show that the way the leadership committee law is currently used is an impermissible infringement? of her First Amendment rights.",
    "Cohen previously ruled that Abrams could not take in unlimited contributions through her own leadership committee, One Georgia, before she officially becomes her party's nominee in the May 24 primary.",
    "The law allows the governor and lieutenant governor, opposing major party nominees, and both party caucuses in the state House and Senate to form leadership committees.",
    "In his temporary ruling Thursday, Cohen noted that Kemp and Abrams are running for governor but that neither has yet officially become a party nominee.",
    "If he becomes the Republican nominee, Kemp will face off against Abrams in November in a rematch of the 2018 contest he won by a narrow margin.",
    "Kemp faces a primary challenge from former U.S. Sen. David Perdue and others and could be forced into a runoff election in June.",
    "She had argued that she was already effectively the nominee because no other Democrat qualified to run for governor.",
    "But the leadership committee law allows Kemp to accept unlimited campaign contributions while Abrams cannot.",
    "Unlike traditional political action committees, they are allowed to coordinate with a candidate's campaign.",
    "A federal judge on Thursday ruled that a special campaign committee created by Georgia Gov.",
    "Brian Kemp cannot raise money unless and until he secures his party's nomination.",
    "Abrams campaign manager Lauren Groh-Wargo applauded the judge's ruling.",
    "Kemp campaign spokesman Cody Hall declined to comment."
  ]
}