{
  "id": 1897,
  "mediaId": 195,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Campaign Report  Primary season heats up",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/02/voting_nh_primary_021120gn10_lead.jpg",
  "link": "https://thehill.com/news/3468983-campaign-report-primary-season-heats-up/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    879,
    946,
    1609,
    1646,
    1707,
    1810,
    1878,
    2095,
    4325,
    571
  ],
  "sentences": [
    "Slotkin, Kildee, Craig and Schrier are rated as Democratic toss ups.?\nBALANCING ACT: McCarthy tapes split GOP\nRecordings of a call that House Minority Leader Kevin McCarthy (R-Calif.) participated in with Republican leadership in the wake of the Jan. 6, 2021 Capitol riot are indicating a rift within his party as McCarthy eyes the Speaker's gavel should Republicans take back the House this November.",
    "The big picture: Pence has ramped up his public appearances and political activity over the past several months; he traveled to Ukraine in March amid Russia's invasion of that country in a high-profile visit and delivered a speech at the University of Virginia earlier this month where he teased a prospective presidential bid.",
    "Now every American is paying a $5,200 inflation tax every year.?\nReps. Tom O'Halleran (Ariz.), Greg Stanton (Ariz.), Jahana Hayes (Conn.), Sharice Davids (Kan.), Elissa Slotkin (Mich.), Dan Kildee (Mich.), Angie Craig (Minn.), Chris Pappas (N.H.), Ann Kuster (N.H.) and Kim Schrier (Wash.) are targeted in the ads.",
    "Reps. Andy Biggs (R-Ariz.) and Matt Gaetz (R-Fla.) have criticized the House GOP Leader for his comments on a Jan. 10 Republican leadership call during which he considered asking then-President Trump to resign and claimed Gaetz was putting people in jeopardy,? according to audio obtained by The New York Times.",
    "COUNTDOWN\n195 days until the 2022 midterm elections\nON THE TRAIL: Pence heading back to New Hampshire in May\nThe shadow primary: Former Vice President Mike Pence is set to return to New Hampshire next month in a move that's likely to only fuel speculation of a potential 2024 White House run.",
    "But, but, but: Just because Oz enjoys Trump's endorsement, however, does not mean that it could sway voters; sixty-nine percent of Republican primary voters said that Trump's endorsement in the race has not affected their opinion of the celebrity cardiothoracic surgeon.",
    "Most of the big primaries are unfolding on the Republican side; former President Trump has handed down endorsements  including some controversial ones  in most of them, meaning they'll be seen as an early test of his influence in his post-presidency.",
    "He's facing six rivals in the nominating contest, including former state Treasurer Josh Mandel, businessman Mike Gibbons and former Ohio GOP Chair Jane Timken, all of whom aggressively sought Trump's support prior to his endorsement of Vance.",
    "AD WATCH: GOP targets Dems on inflation\nThe National Republican Congressional Committee on Wednesday rolled out a slew of ads targeting 10 House Democrats, hitting them over inflation which has already hit a 40-year high, Julia reports.",
    "A majority of Republican primary voters, 54 percent, see Oz as a strong supporter of the former president compared to 30 percent who see fellow Republican Senate challenger Dave McCormick as a strong supporter of Trump, the poll found.",
    "He's also broken with Trump a handful of times, including earlier this year when he insisted that he had no right to overturn the 2020 presidential election results, despite his former boss's repeated pleas for him to do so.",
    "Email us tips and feedback: Max Greenwood (mgreenwood@thehill.com), Julia Manchester (jmanchester@thehill.com), Tal Axelrod (taxelrod@thehill.com), Caroline Vakil (cvakil@thehill.com) and Monique Beals (mbeals@thehill.com).",
    "Other Republicans, however, remain undeterred about the audio; during a House GOP conference meeting on Wednesday, McCarthy received a standing ovation from other members after he addressed his past comments.",
    "And despite facing a difficult year nationally, Democrats believe they have a chance of flipping GOP-held Senate seats in at least two of the states holding primaries in May: Pennsylvania and North Carolina.",
    "Pence is slated to attend the New Hampshire Federation of Republican Women's Lilac Brunch on May 26 in an effort to raise money for women GOP candidates running in the 2022 midterms, the group announced.",
    "May 17: Pennsylvania's GOP and Democratic Senate primaries\nOn the Republican side, celebrity physician Mehmet Oz is seen as the candidate to beat after winning Trump's endorsement earlier this month.",
    "He hasn't issued a new endorsement in the race, but the race now looks more like a head-to-head between two other Republicans: former Army pilot Mike Durant and Katie Britt, a former aide to Shelby.",
    "May 24: Alabama GOP Senate primary\nTrump initially endorsed Rep. Mo Brooks (R-Ala.) in the race to succeed retiring Sen. Richard Shelby (R-Ala.), but revoked that support last month.",
    "House Democrats voted for trillions in reckless spending that funded luxury hotels, golf courses, and ski resorts,? NRCC Chairman Tom Emmer (R-Minn.) said in a statement to The Hill.",
    "Among Republican Pennsylvania Senate candidates, Mehmet Oz is considered the strongest supporter of former President Trump, according to a new Monmouth University poll out Wednesday.",
    "Kemp will still have to win more than 50 percent of the vote to avoid a runoff, but if he defeats Perdue, it will likely be seen as a blow to Trump's sway among GOP voters.",
    "Brian Kemp is facing a Trump-backed challenge in former Sen. David Perdue (R-Ga.), though surveys leading up to the primary show the incumbent governor with a solid lead.",
    "John Fetterman is the heavy favorite to win the Democratic nomination, though he'll still have to beat out Rep. Conor Lamb (D-Pa.) in the primary.",
    "May 17: North Carolina GOP Senate primary\nRep. Ted Budd (R-N.C.) scored Trump's endorsement early on, but that hasn't scared away his opponents.",
    "Meanwhile, fellow Republican Senate challenger and former state Treasurer Josh Mandel received 18 percent of support among primary supporters.",
    "Stanton's and Hayes' seats are rated likely Democratic? in Cook Political Report's latest ratings on competitive House races as of Tuesday.",
    "Following reporting over some of the audio made public, McCarthy and Trump indicated last week their relationship was still on good terms.",
    "Meanwhile, a Fox News poll conducted between April 20 and 24 indicates that Trump's endorsement in the Ohio Senate race could be a boost.",
    "Vance (R), whom Trump stumped for this past weekend, currently leads his opponents among primary supporters, with 23 percent support.",
    "Lamb has repeatedly sought to argue that Fetterman is too progressive to win statewide in an already tough year for Democrats.",
    "Voters in a dozen states will head to the polls next month to decide nominating contests in some of the year's premier races.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Pat McCrory and former Rep. Mark Walker (R-N.C.) in the primary, though recent polling shows Budd taking the lead.",
    "Still, he's facing a tough challenge from former hedge fund CEO David McCormick, and the polls show a tight race.",
    "Welcome to The Hill's Campaign Report, where we'll be tracking all things related to the 2022 midterm elections.",
    "May 3: Ohio GOP Senate primary\nTrump weighed in earlier this month by endorsing author and one-time critic J.D.",
    "It's the former vice president's second stop in the crucial first-in-the-nation primary state since December.",
    "Max has a more in-depth rundown on it here, but here's a quick look at what we're watching next month.",
    "The California Republican asserted he had never asked Trump to resign nor thought he should resign.",
    "Thanks for reading and check out The Hill's Campaign page for the latest news and coverage.",
    "You can expect this newsletter in your inbox each week leading up to November's election.",
    "PRIMARY FEVER: 6 races to watch next month\nPrimary season is about to begin in earnest.",
    "Be sure to follow along with The Hill's primary coverage throughout May.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "May 24: Georgia GOP gubernatorial primary\nGov.",
    "A TALE OF TWO POLLS: Does Trump help or hurt?",
    "Trump-endorsed Ohio Senate candidate J.D.",
    "He's set to face former Gov.",
    "That's it for today.",
    "Meanwhile, Lt. Gov.",
    "See you next week.",
    "Vance."
  ]
}