{
  "id": 1902,
  "mediaId": 238,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Trump's Georgia allies are running on 2020 grievance. It may not work.",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/27/trumps-georgia-allies-are-running-2020-grievance-it-may-not-work/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1641,
    1646,
    1951,
    2087,
    2095,
    428,
    2555,
    2672,
    2963
  ],
  "sentences": [
    "At the debate, when Perdue accused Kemp of being a weak leader? who caved to Stacey Abrams and the liberal Democrats,? Kemp retorted: Weak leaders blame everyone else for their own loss instead of themselves.?\nTrump supporters, the Republican operative said, may have thought Kemp mishandled the election, but when the whole left is beating him up, he must be doing something right.? People close to Kemp say he is far ahead in the polls because the 2020 election is not the most important issue for most Georgia Republican voters  who are more focused on gas prices, inflation and other issues Trump talks about less.",
    "When Biden, corporate leaders and even Major League Baseball criticized Georgia Republicans for enacting last year's voting law, it was Kemp on TV, day after day, defending the law and positioning himself as a champion of election integrity.?\nI didn't waver after we passed the strongest elections integrity act in the country,? Kemp told a crowd of Republican voters during a GOP event in south Georgia last week.",
    "All they can do is wade in the mud of their election conspiracy theories, standing idly by while the people of Georgia suffer.?\nKemp  who has had a long career in politics that includes stints as a state senator and secretary of state  has boosted his popularity among conservative voters by pushing to relax covid precautions early on in the pandemic and pass new gun-carrying protections.",
    "In a televised debate over the weekend, Perdue used his opening statement to falsely assert that the 2020 election was rigged and stolen.?\nKemp defended his actions in 2020, noting that the law required him to certify the election and that it is the job of the attorney general and local district attorneys  not the governor  to prosecute those who engaged in election fraud.",
    "They set about trying to unite the state party to protect Kemp against what was expected to be a vigorous and well-funded rematch against Democrat Stacey Abrams, whom Kemp had narrowly defeated in 2018.\nWe had to shore up Kemp,? explained one GOP operative, who spoke on the condition of anonymity to be candid about internal party dynamics.",
    "Cliff Albright, co-founder of Black Voters Matter, a Georgia-based voting rights organization, said the spat was typical of GOP candidates who have no ideas, no interest in governing.?\nIt's very telling and consistent in continuing the same narrative that they've been pushing since November 2020,? he said.",
    "Last month, he authorized a $500,000 donation from his leadership committee to a PAC called Get Georgia Right that has been airing an ad focused exclusively on unsubstantiated claims that Democrats illegally collected thousands of mail ballots and deposited them in drop boxes across the Atlanta area.",
    "Raffensperger has taken to talking about noncitizen voting in Georgia, holding a news conference in early April in which he called for a constitutional amendment to make sure only American citizens vote? in Georgia  even though state law already prohibits noncitizens from casting ballots.",
    "Two Trump picks hold a polling advantage in other statewide races: Herschel Walker, the former NFL and University of Georgia star, who hopes to face incumbent U.S. Sen. Raphael G. Warnock (D) in November; and Burt Jones, who is running for an open seat for lieutenant governor.",
    "And then he was able to beat up on the big companies when Major League Baseball left the state.?\nPerdue, meanwhile, has struggled to raise money, with many donors unwilling to give to someone challenging a powerful and popular sitting governor whom they say will win.",
    "I have yet to encounter any group in the state that says, David Perdue is my guy.' I'm sure those groups exist, but I'm not aware of them.? Erickson said callers to his show frequently say they like Trump but are ready to move on from the 2020 talk.",
    "In one instance, Perdue said Kemp's support for election-year pay hikes for teachers was disgusting.? He criticized a $5 billion plan to open an electric-vehicle plant in the state, and he encouraged a chant of lock him up? targeting Kemp.",
    "Even when big corporations, Georgia corporations and Major League Baseball tried to pressure me, I didn't bend.?\nAll of that made it harder for Perdue and Trump to discredit Kemp as a friend of liberals who helped them steal the election.",
    "He hosted Perdue for two more golf outings in the months that followed, commissioned a poll to show that Perdue could win and urged him on at a September rally in Perry, Ga., both from the stage and during a private gathering of donors.",
    "Kemp and Raffensperger have both walked a fine line of trying to appear tough on election security without embracing Trump's false claims about the 2020 result in Georgia, which both men certified in their official capacities.",
    "They want to move forward.?\nIn early 2021, conventional wisdom among Georgia Republicans held that GOP incumbents who had not embraced Trump's false claims of election fraud would be vulnerable to primary challenges in 2022.",
    "It was a rare critique of law enforcement from a Republican, and Kemp's campaign seized on the comment by quickly rounding up signatures from more than a dozen sheriffs saying they were disappointed? in Perdue's attacks.",
    "The race, perhaps more than any other in the country, represents a test: both of the power of Trump's endorsement and the potency of his false 2020 fraud claims as a motivating force among Republican voters this year.",
    "Two people said Perdue was looking for vulnerabilities besides election fraud but that some of the other options, such as the rising crime in Atlanta's suburbs or inflation, were difficult to pin on Kemp.",
    "Kemp was able to get back in the good graces of conservative voters because of the heartbeat bill and some of the faith-based initiatives he has done,? said Tim Phillips, a longtime Republican strategist.",
    "Party leaders fear the focus on the past and Perdue's attacks on Republicans who want to emphasize something else will make it harder to defeat Democrats in November no matter who wins the nomination.",
    "The poll found that 71 percent of Republican voters held a favorable opinion of Kemp and 45 percent of GOP primary voters said a Trump endorsement would make them more likely to support a candidate.",
    "That included Kemp as well as Brad Raffensperger, the secretary of state who resisted Trump's appeals during a recorded phone call to find? enough votes to overturn Biden's victory in Georgia.",
    "He has sought to highlight problems with election administration without mirroring Trump's claims, in part because polling data shows that those claims are unlikely to animate Georgia voters.",
    "Candidates campaigning on Trump's debunked claims are running for statewide office in all the other contested states of 2020, including Arizona, Michigan, Nevada, Pennsylvania and Wisconsin.",
    "Raffensperger is in a tighter race with his main challenger, U.S. Rep. Jody Hice, according to the most recent polls, which show the two neck and neck and potentially headed to a runoff.",
    "Trump has even gone so far as to say he would consider endorsing Abrams if Kemp wins the GOP nomination, though he frequently denigrates her appearance in conversations with top donors.",
    "He's calling everyone, but he doesn't have the money,? said one individual with knowledge of the effort who spoke on the condition of anonymity to discuss internal campaign operations.",
    "Kemp was the worst of all Governors to deal with  he didn't want to do anything to help with finding this massive Ballot Harvesting fraud,? Trump wrote in a statement issued Thursday.",
    "Even Perdue complained after the election that Trump had cost him the seat, according to multiple associates who spoke on the condition of anonymity to describe private conversations.",
    "But Kemp's allies, including many from Perdue's orbit after he lost his Senate runoff election to Democrat Jon Ossoff in January 2021, worked hard to close ranks around the governor.",
    "In an interview with The Washington Post early this month, the former president conceded, It's never easy to beat a sitting governor.?\nYet Trump's decisions have not always helped.",
    "Up until the day in December when Perdue finally jumped into the race, friends and former advisers urged him not to, said several Republicans with knowledge of the conversations.",
    "Their concern was less that he might defeat Kemp, they said, than that the race itself would roil the party, ruin relationships and make it harder to defeat Abrams in November.",
    "The former U.S. senator spent most of his nine-minute stump speech embracing unproven claims that fraud tainted the 2020 election  and accusing Kemp of doing nothing about it.",
    "He also called for criminal investigations of what he described as many as 1,634 potential instances of noncitizens attempting to register to vote over a span of five years.",
    "They also worry that Trump will not move on and that he will undermine GOP prospects elsewhere by carrying his grievances from one state to the next as the midterms unfold.",
    "Brian Kemp, drew some cheers Monday evening at a gathering of about 50 Republicans around a pickup truck in this deeply conservative town about 70 miles east of Atlanta.",
    "In theory, it's the sort of message that should appeal to Don McGeary, a retired banker and supporter of former president Donald Trump who believes the fraud claims.",
    "Trump handpicked the former senator to challenge and defeat Kemp after the governor defied the then-president and certified Joe Biden's narrow victory in the state.",
    "Party insiders credit him with deftly maneuvering around the anger over 2020, neutralizing  for now, at least  what might have otherwise become a fatal liability.",
    "There are a lot of people out there who want to look forward,? Martha Zoller, a conservative talk-radio host based in Gainesville, Ga., said in an interview.",
    "Then, this month, Perdue criticized the Georgia State Patrol, the state law-enforcement agency that protects the Capitol and patrols the state's highways.",
    "On the stump last week in southern Georgia, Kemp argued there were mechanical issues? in the 2020 election that warranted the passage last year of S.B.",
    "He is even still contemplating sending millions from his PAC to shore up Perdue's flagging campaign, and he plans to hold more rallies in the state.",
    "Trump has fixated on the film in the final run-up to the Georgia primary, recently watching a rough cut and offering suggestions for the final edit.",
    "Kemp, who has assiduously avoided criticizing Trump, has logged double-digit leads in recent public polls and enjoys a vast fundraising advantage.",
    "It's okay with me.?\nIn an Atlanta Journal-Constitution/University of Georgia poll released Tuesday, Kemp had a 26-point advantage over Perdue.",
    "Let's get over it and get on with our lives.?\nUnfortunately for Perdue  and for Trump  many Republican voters in Georgia appear to agree.",
    "Kemp has told his staff not to criticize Trump publicly, and he wants to avoid public conflict with the former president, advisers said.",
    "Stacey, would you like to take his place?? the former president asked at a rally in Perry last September while railing against Kemp.",
    "It's what the law and the Constitution say,? Kemp said sharply after Perdue accused him of doing nothing to investigate 2020 fraud.",
    "Kemp is popular and people think he's done a good job,? said Erick Erickson, a longtime conservative commentator based in Georgia.",
    "Numerous polls show that a majority of GOP voters believe, despite the lack of evidence, that the 2020 election was illegitimate.",
    "But with less than a month to go before the May 24 primary, Perdue's laserlike focus on election fraud seems to be falling flat.",
    "He told others he was not inclined to run even after Trump pressured him over two rounds of golf at Mar-a-Lago in early 2021.",
    "Yet Perdue's struggles suggest that many voters are ready to move on and want to hear candidates talking about other issues.",
    "He is aware of how well Kemp is doing and complains privately that Perdue is not running an aggressive enough campaign.",
    "202, a sweeping election security law that focused on absentee ballots, which now require identification verification.",
    "Those claims are the subject of a movie being released in early May by the conservative commentator Dinesh D'Souza.",
    "We can't do anything about it,? McGeary said about the 2020 result, adding that he intends to vote for Kemp.",
    "They said Trump's incessant talk of fraud had discouraged GOP turnout and was to blame for Perdue's defeat.",
    "By the end of January, he had brought in a little more than $1 million, compared with Kemp's $7.4 million.",
    "Trump hosted a fundraiser for Hice at Mar-a-Lago this month, and speaks to him and Walker regularly.",
    "WATKINSVILLE, Ga.  David Perdue's quest to unseat a longtime friend and fellow Republican, Gov.",
    "We can win and restore order if we change the subject? and stop talking about election fraud.",
    "And we've got to focus on putting the infrastructure in place to fight that fight.",
    "Kemp has told advisers that Perdue pledged to him directly that he would not run.",
    "Even people who would vote for Trump again, they don't want to rehash the past.",
    "In Georgia, Raffensperger quickly drew two Trump-embracing primary opponents.",
    "It's water over the dam, under the bridge, however you want to refer to it.",
    "He has planned a celebratory screening at Mar-a-Lago ahead of the primary.",
    "When asked about Kemp and Perdue, he quickly changed the subject.",
    "Many have already won the GOP nomination or are leading in polls.",
    "Trump's advisers say he asks for updates on Georgia constantly.",
    "A Perdue defeat could help define the limits to both.",
    "Perdue has also stumbled on the campaign trail.",
    "This should have been a wake-up call.",
    "But McGeary, 71, was not impressed.",
    "But Trump has not yet given up.",
    "But Trump refused to relent.",
    "We have to stop Stacey."
  ]
}