{
  "id": 1908,
  "mediaId": 1576,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Georgia tax cut could hit $2 billion, but maybe not by 2029",
  "image": "https://www.wabe.org/app/uploads/2021/09/AP21266586296443-1-scaled.jpg",
  "link": "https://www.wabe.org/georgia-tax-cut-could-hit-2-billion-but-maybe-not-by-2029/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1457,
    2095,
    2357,
    428,
    2672,
    2887
  ],
  "sentences": [
    "Georgia Democratic Party Chair Nikema Williams called it a boon for the wealthy.?\nBoth Kanso and Kyle Wingfield, CEO of the conservative-leaning Georgia Public Policy Foundation, agree that the 4.99% rate may not arrive by 2029.\nIf you look at all the triggers, I'm not sure that hitting all three of them five or six years in a row will necessarily happen,? Wingfield said.",
    "I strongly believe that government should take in the very least amount possible needed to serve the people properly.?\nKemp signed the tax cut in former U.S. Sen. David Perdue's hometown of Bonaire at a barbecue restaurant once featured in a Perdue campaign ad.",
    "The bill requires a review of other tax breaks, after Republican Senate Finance Committee Chairman Chuck Hufstetler of Rome unsuccessfully proposed limiting the $1 billion-plus Georgia gives to movie and television productions each year.",
    "For Kemp, Tuesday's signing was a tax-cutting triumph as he touted not only the newly flat income tax, but also a $1.1 billion income tax refund and the zeroing out of nearly $400 million in fuel taxes for more than two months.",
    "But tax cuts would pause any year state revenue does not grow 3%, any year revenue is lower than in the five previous years, or any year the state does not have enough money in its savings account to cover the cost.",
    "If we're not hitting the triggers fast enough, but the state's revenues and fiscal picture are still stable or sustainable, then you could look at expediting some of those down the road,? he said.",
    "A GBPI analysis using modeling by the Institute on Taxation and Economic Policy shows 39% of benefits would flow to the top 5% of Georgia tax filers  households making more than $253,000 a year.",
    "House Ways and Means Committee Chairman Shaw Blackmon, a Bonaire Republican, said Tuesday that Georgia would have met all three requirements in only six of the last 12 years.",
    "That's an attempt to avoid higher taxes on low-income earners, but the Georgia Budget & Policy Institute's Danny Kanso said most benefits will go to the highest earners.",
    "It would have easily met the standards in the 2021 budget year, when revenues soared thanks in part to federal COVID-19 aid that propped up spending and employment.",
    "Blackmon said the House wants to show fiscal responsibility.?\nThe other option, if the state does not meet revenue goals, could be to discard them, Wingfield said.",
    "Brian Kemp as he seeks reelection could eventually total more than $2 billion, but the reductions may only happen by a 2029 target date if state revenue holds up.",
    "For his part, Perdue espouses gradually abolishing the entire state income tax, which contributes nearly half of Georgia's $30 billion in revenue.",
    "But pauses caused by lagging revenue could bring pressure to reconsider the approach or to bolster revenue by curtailing business tax breaks.",
    "Perdue is running against Kemp for the Republican nomination for governor and early in-person voting starts Monday for the May 24 primary.",
    "Kemp said he's committed to the review, but it's not clear if House leaders share the Senate's interest in limiting tax breaks.",
    "Georgia's state and local taxes already take a larger share of poor people's income than rich people's income.",
    "After that, the measure calls for the tax rate to fall one-tenth of 1% each year, reaching 4.99% by 2029.",
    "Republican House Speaker David Ralston and others reject that, saying it would devastate state services.",
    "It would increase the standard exemption on how much someone could earn before beginning to pay taxes.",
    "Weeks after it passed, Blackmon said there's still no official estimate for the cut's total cost.",
    "The liberal-leaning Georgia Budget & Policy Institute projects a total cost of $2.04 billion.",
    "Married couples filing jointly would get an exemption that would grow to $24,000 by 2030.",
    "We're doing our part to lessen the pain on people's wallets here in Georgia,? Kemp said.",
    "The bottom 80% of households  making less than $109,000  would get 32% of benefits.",
    "A single taxpayer or head of household would get a $12,000 exemption immediately.",
    "Those requirements aim to ensure there's enough revenue for state services.",
    "That report is due by December 2023, just before the first income tax cut.",
    "House Bill 1437 would create a flat income tax of 4.99% by 2029 or later.",
    "The current tax has a top rate of 5.75% with lower brackets below there.",
    "The measure delivers an immediate flat tax of 5.49% on Jan. 1, 2024.",
    "And today we will put into place a more long-term system of relief.",
    "Taxpayers could deduct $3,000 for each child or other dependent.",
    "A major state income tax cut signed by Republican Georgia Gov.",
    "Kanso said the cut would make taxes even more regressive.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "The cut would cost about $450 million in the first year.",
    "Democrat Stacey Abrams awaits the winner."
  ]
}