{
  "id": 1911,
  "mediaId": 195,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Meadows texts shine new light on Trump effort in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/5b8832688c6e4a379d6dee7ab9d34842.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3465984-meadows-texts-shine-new-light-on-trump-effort-in-georgia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Beitsch",
  "authorUrl": "https://thehill.com/author/rebecca-beitsch/",
  "termIds": [
    1039,
    1147,
    2095,
    2203,
    2555,
    2617,
    2672
  ],
  "sentences": [
    "State officials were also at the audit, and Meadows apparently hoped to ask about what they were hearing from the State about status of the election and, you know, if there was significant evidence to their knowledge at that point.?\nThe state of Georgia has been doing its own probe into former President Trump's election interference and plans to call witnesses in late May after the state's primary.",
    "Now, there was a point where I was going to go with him because he was going to conduct a few more meetings, but then it was decided that he would make it a little bit more informal and casual, which is when he decided to go watch the ballots being counted,? she said.",
    "The Jan. 6 committee's battle to score testimony from Mark Meadows is shedding new light on the ways the Trump campaign weighed indirectly inserting itself in the Georgia election audit as they were largely rebuffed by Georgia's secretary of state.",
    "Testimony from Cassidy Hutchinson, a former special assistant to the president and Meadows, shows that Meadows sought a casual? trip to Georgia in December 2020, ultimately arriving in the state amid its review of absentee ballots.",
    "He wanted to do more of a status check to see where they were at with things, if they had thoughts that they needed any more resources, if there was anything that the White House could do to help ease the process along.",
    "While Meadows apparently went to Georgia around the holidays to visit a son who lives in the Atlanta area, there were discussions within the White House about how that trip could align with campaign goals in the state.",
    "Hutchinson's testimony was released along with reams of other evidence obtained by the Jan. 6 committee as part of a legal battle to force Meadows to provide other text messages and documents he claims are privileged.",
    "The revelation that Meadows weighed offering campaign assistance in the highly watched review of ballots in Georgia came shortly before President Trump's now infamous call with Raffensperger in January of 2021.",
    "Conveniently, his son lives in close proximity to Cobb County, and Mr. Meadows had discussed at length coordinating any visits with Georgia State officials during this trip,? Hutchinson said.",
    "It's not appropriate for me just to talk to the President by myself.'?\nRaffensperger added that both the litigation and their own investigation made the contact unethical.",
    "We also had lawsuits with the Trump team and the Trump campaign and all these other organizations, and I just didn't feel that that was the appropriate channel to go.",
    "That they had their attorneys, we have our attorneys, and we'll follow the process, we'll follow the law, and the results will be what the results will be,? he said.",
    "If they needed, like, bodies, there were campaign officials that had been, you know, off-boarded and were looking for jobs,? Hutchinson said of Meadows' visit.",
    "That includes a deposition with Raffensperger outlining how deeply disturbed he was with efforts from the Trump campaign to get involved.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "And so she said, Well, they really want to talk to you.' I said, We have all these lawsuits going on.",
    "Raffensperger repeated that he ignored various efforts by the Trump campaign to contact him.",
    "Hutchinson said the team ultimately decided against her accompanying Meadows on the trip.",
    "Meadows apparently weighed offering Trump campaign officials to assist with the audit.",
    "They really want to talk to you,? Raffensperger recalled being told by his deputy.",
    "His son lives in Georgia, and they went down to see his son for Christmas.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Trump is involved in that primary, backing GOP rivals to Gov.",
    "Brian Kemp and Secretary of State Brad Raffensperger.",
    "The primary purpose of this trip was to visit family.",
    "We had ongoing investigations.",
    "I said, I don't want to."
  ]
}