{
  "id": 1913,
  "mediaId": 136,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Trump Endorsement Nearly Powerless in Georgia Governor Race",
  "image": "https://d.newsweek.com/en/full/2026210/georgia-governor-brian-kemp.webp?w=790&f=35f7e70cf3cf1026b14177fa93f4d5d3",
  "link": "https://www.newsweek.com/donald-trump-georgia-governors-race-primary-brian-kemp-david-perdue-1701043",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    1147,
    1646,
    1951,
    2087,
    2095,
    501,
    584,
    2672
  ],
  "sentences": [
    "\"Recent polling is clear: Governor Kemp is the only Republican who can beat Stacey Abrams this fall and Georgia conservatives are rallying behind his campaign,\" Cody Hall, director of communications and senior adviser to Kemp, wrote in the statement.",
    "The Atlanta Journal-Constitution poll conducted by the University of Georgia's School of Public and International Affairs found 53 percent of likely voters said they will support incumbent Governor Brian Kemp in the May 24 Republican primary.",
    "\"I was secretary of state for eight years and I don't need to be lectured by someone that lost their last election about what our voting laws are and who has responsibilities for those in our state,\" Kemp said.",
    "During the debate, Perdue further claimed Kemp shared part of the blame for the country's increased inflation, as well as for illegal immigration, rising gas prices and the U.S. being on \"the brink of war.\"",
    "On Sunday, Kemp reiterated he is the stronger Republican to take on the Democratic nominee in November and referenced Perdue's loss in a Senate runoff to Democrat Jon Ossoff in January 2021.",
    "\"Our campaign is keeping our foot on the gas through the May 24th primary and will be out on the road and on the airwaves sharing Governor Kemp's strong, conservative record with voters.\"",
    "\"All the madness we see from the Biden administrationall that started here in Georgia when our governor caved and allowed radical Democrats to steal our election,\" Perdue said.",
    "She announced her run for Georgia governor on the Democratic ticket in December, though an early poll found her polling lower than Kemp and Perdue in hypothetical match-ups.",
    "After being narrowly defeated by Kemp in the 2018 gubernatorial race, Abrams has gone on to become a prominent national figure due to her work as a voting rights advocate.",
    "Of those respondents who said a Trump endorsement would make them more likely to vote for someone, Perdue enjoyed a 55 percent to 30 percent advantage over Kemp.",
    "Former President Donald Trump's endorsement for governor in Georgia's upcoming GOP primary has had little sway over voters, according to a poll released Tuesday.",
    "The poll also found a majority of respondents said Trump's endorsement made no difference in whether or not they would support a candidate.",
    "Those attacks came after Kemp, who once enjoyed Trump's favor, refused to contest the 2020 presidential election results in Georgia.",
    "Federal and Georgia election officials have found no evidence of widespread election fraud in the 2020 presidential election.",
    "The battle between the two Republicans in Georgia is among the most high-profile races in 2022 due to Trump's involvement.",
    "When contacted for comment, Kemp's campaign provided Newsweek with a statement released earlier on Tuesday.",
    "\"First off, folks, let me be very clear tonight, the election in 2020 was rigged and stolen,\" Perdue said.",
    "In his opening statement, Perdue declared that 2020's presidential election had been stolen from Trump.",
    "(Other candidates polled in the single digits, and 15 percent of respondents said they were undecided.)",
    "On Sunday, Perdue and Kemp faced off in the first of three scheduled debates ahead of the primary.",
    "The former president's endorsement of Perdue came after he publicly bashed Kemp multiple times.",
    "Meanwhile, just 27 percent of poll respondents said they will vote for former U.S.",
    "Adding to the attention of the Georgia governor's race is Stacey Abrams.",
    "Trump's allegations have also been rejected by multiple courts.",
    "Senator David Perdue, who is Trump's favored candidate.",
    "Kemp, however, maintained he had followed the law.",
    "Newsweek reached out to Perdue for comment."
  ]
}