{
  "id": 1915,
  "mediaId": 238,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Another indicator that Republican primaries may not center on 2020",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/26/another-indicator-that-republican-primaries-may-not-center-2020/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    800,
    1147,
    1646,
    1951,
    2095,
    2279,
    4325,
    428,
    2672,
    2791
  ],
  "sentences": [
    "One losing secretary of state candidate called the vote a fiasco? and told Mlive.com that they're going to have to vote again or reconvene this thing again in August and fix it.?\nThe statement released by DePerno's campaign in response to his victory did not mention any concerns about how the vote was conducted.",
    "The 2020 election served as a reminder of how lower-tier executive offices are often responsible for safeguarding the elections by which we allocate power, meaning that those who hold positions such as attorney general or secretary of state have the power to either bolster or subvert the will of the electorate.",
    "We saw that clearly in Georgia, Michigan and Arizona in the aftermath of the last election, as state elected officials  including Republicans  stood firm in defense of the elections despite the opprobrium of the former president of the United States and his most energetic supporters.",
    "Perdue is betting that focusing on Kemp's purported failure  which, of course, wasn't a failure because there is no evidence that the election was significantly marred by voter fraud  and Trump's endorsement centered on that focus will carry him across the finish line first.",
    "In other words, likely voters in Georgia's Republican primary, given a choice between a guy parroting Trump's claims and one who opposed Trump's efforts (getting repeatedly disparaged by the popular president as a result), are picking the Trump opponent.",
    "The Journal-Constitution also asked Georgia Republicans whom they preferred in the secretary of state nominating contest, pitting incumbent Brad Raffensperger against challengers including Rep. Jody Hice, who's received Trump's endorsement.",
    "Again, polling of potential results is very different from the results themselves, and Raffensperger being tied with Hice is not a massive deviation from DePerno winning second-round balloting by 55 percent to 45 percent.",
    "A poll released by the Atlanta Journal-Constitution on Tuesday shows Kemp with a wide lead over Perdue  a 2-to-1 ratio in support that would be enough for Kemp to avoid a runoff against his challenger.",
    "Incumbent Brian Kemp (R) is facing a primary challenge from former senator David Perdue, who has leaned into the idea that the 2020 election in the state was stolen and that it's Kemp's fault.",
    "He was an early adopter of noncredible claims about fraud that Trump would later embrace, such as baseless allegations about systematic fraud promoted by a math teacher named Douglas Frank.",
    "The idea is that this allows a candidate to campaign as though he or she is the nominated candidate without having to burn energy competing against others in the party for the nomination.",
    "There, the Republican Party adopted a tactic first used by Democrats, gathering party activists to endorse a single candidate in advance of the actual nominating vote later this year.",
    "Not to mention that the vote conducted over the weekend was marred by actual irregularities, not the unsubstantiated ones that DePerno used to gain prominence in Michigan politics.",
    "As a result, Trump went all in, hosting DePerno for a fundraiser at Mar-a-Lago and personally appealing to Michigan Republican leaders multiple times on DePerno's behalf.",
    "But 2022 has sent signals that, Trump's fixation aside, Republican voters are not as compelled by the need to prioritize election fraud? as an electoral consideration.",
    "This is not to say that they ought not to; ideally, Americans would be well-informed about all of the candidates on their ballots and make decisions on that basis.",
    "Paxton then led the charge on a highly dubious effort to overturn the 2020 election, no doubt reinforcing the value of these positions to the president.",
    "In Michigan, party activists made the decision  and supported both DePerno and Kristina Karamo, who received Trump's endorsement for secretary of state.",
    "Of course, this is also a gubernatorial race in which Kemp can tout the fact that he has already beaten the likely Democratic candidate, Stacey Abrams.",
    "We come back to the point offered at the beginning of this article: Probably a lot of people aren't really paying that much attention to the race.",
    "That includes endorsing non-gubernatorial executive positions, something that's not particularly common for top-tier national politicians.",
    "We can start with the marquee test of Trump's efforts to punish those who he believes have wronged him: the governor's race in Georgia.",
    "So as Trump and his allies hype his political heft, it's useful to note where a voter-led process deviates from an activist-led one.",
    "(It's worth noting, though, that he actually received more votes on Election Day itself, losing only in a runoff weeks later.)",
    "In 2022, Trump is endorsing eight attorney general or secretary of state candidates, twice the number he did in 2020.",
    "Donald Trump has since made administration of elections a central component of his endorsements for the 2022 cycle.",
    "After the vote this weekend, Trump's endorsed candidate for attorney general, Matt DePerno, emerged victorious.",
    "Perdue's most recent election saw him losing to a liberal Democrat, which Republican voters certainly remember.",
    "Trump's insistence on ousting someone he views as having failed his reelection bid is not a sure thing.",
    "Raffensperger and Hice are statistically tied with more than a third of the electorate still undecided.",
    "There, in a lower-profile contest without the encumbrances burdening Perdue, the contest is closer.",
    "In most years, very few people really care about their state's candidate for attorney general.",
    "We're picking through tea-leaf dregs here, certainly, as one does as party primaries approach.",
    "More than half of Republicans have an opinion, though, and Raffensperger is holding his own.",
    "This is self-serving, in part: Perdue also lost his reelection bid during the last cycle.",
    "But while I am an optimist, I am also a realist, and let's just be honest here.",
    "In other words, this may not be as pure a test of Trump's value as it may seem.",
    "The election is weeks away, but Kemp has consistently led in polling.",
    "DePerno has been the sort of advocate Trump has long wanted to see.",
    "Voters could still opt for another candidate in the race in August.",
    "In Georgia, voters are asked to decide and Kemp has an advantage.",
    "In 2018, he endorsed only one, Texas's Ken Paxton.",
    "This year, however, the stakes are different.",
    "Of course, DePerno's victory is not final.",
    "But it's also an electoral gambit.",
    "It does not appear to be working.",
    "But then we move down a level.",
    "Consider the difference here.",
    "But it is still close."
  ]
}