{
  "id": 1916,
  "mediaId": 238,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Opinion: A leading Trump sycophant may soon get the humiliation he deserves",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/26/trump-sycophant-david-perdue-georgia-loss/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    973,
    973,
    1147,
    1147,
    428,
    428,
    501,
    501,
    2791,
    2791,
    2672,
    2672,
    2972,
    2972
  ],
  "sentences": [
    "Remember, as long as the Electoral Count Act of 1887 remains unreformed, if a GOP governor in a state set to decide the election certifies sham electors for a losing Republican candidate, and a GOP-controlled House of Representatives counts those electors, they stand.",
    "Remarkably, the basis for Perdue's challenge is that Kemp performed his official duty with integrity despite facing some of the most intense pressure in the country from Trump and the MAGA movement to corrupt himself  and our elections  on Trump's behalf.",
    "But something bigger is at stake: A decisive Kemp win would show that Republican officials can abide by the integrity of election losses and live to tell the tale  that is, without immediately seeing their careers implode in the next GOP primary.",
    "What's more, many GOP candidates are running on a willingness to corrupt elections in a similar manner, including candidates for governor in swing states such as Pennsylvania, Wisconsin and Michigan, and GOP primary voters might pick them.",
    "At a GOP primary debate this week, Perdue flatly declared that Kemp had caved and allowed radical Democrats to steal our election,? and told GOP voters that if they're upset and angry about Democratic control, Kemp is to blame for it.",
    "But beyond structural reform, our democracy will also depend on elections officials performing their roles with integrity at a time when pressure to corrupt election outcomes might only be increasing.",
    "He hopes to exploit the raw emotions that always grip voters of the out-of-power party to portray the act of upholding the integrity of a loss amid extremely difficult conditions as a betrayal.",
    "Perdue has built his entire primary challenge to Kemp around the idea that in some vague sense, Kemp betrayed Republican voters by rebuffing Trump's pressure to help steal the 2020 election.",
    "The Journal-Constitution poll found that a majority of GOP primary voters say Trump's endorsement won't impact their choice or make them less likely to back a candidate.",
    "And so, even if that stolen election scenario is improbable, it will have value if a candidate running on an implicit vow to execute that scenario goes down to defeat.",
    "News reports regularly say Republicans are running on Trump's big lie.? But that suggests they are merely re-litigating his loss out of twisted loyalty to him.",
    "A new poll from the Atlanta Journal-Constitution shows Perdue trailing Kemp by an astonishing 53-to-27 percent among likely voters in next month's GOP primary.",
    "One cannot know for certain whether Perdue would actually use his power as governor to refuse to certify a legitimate Democratic winner of the 2024 election.",
    "In other words, Perdue will not allow? Democrats to win elections, and will justify this with invented claims of fraud, in a way Kemp refused to do.",
    "It could mean GOP voters aren't swayed by the argument that they should elect a governor for the express purpose of subverting future elections.",
    "If Kemp clears 50 percent he will win outright without a runoff, which would be a stunning downfall for Perdue, given his endorsement by Trump.",
    "That's an implicit promise to use his power as governor in a way Kemp would not, to prevent a legitimate GOP loss from becoming official.",
    "Kemp did sign an onerous voter suppression law, and such measures are being implemented by GOP legislatures across the country.",
    "The former senator has debased himself on Trump's behalf perhaps more thoroughly than anyone alive in his quest to defeat Gov.",
    "When the history of the Donald Trump era is written, a special place in the whole saga should be reserved for David Perdue.",
    "That's why it's important that a bipartisan group of senators is meeting this week to discuss Electoral Count Act reforms.",
    "Let's state this plainly: This is central to Perdue's case for why GOP primary voters should pick him as governor.",
    "Let's hope those include built-in safeguards against governors and state legislatures certifying sham electors.",
    "It's worse: Some candidates are running on an implicit vow to do what it takes to subvert future losses.",
    "So even if Perdue loses, a 2024 sham-elector scheme will remain a live possibility, if an unlikely one.",
    "Analysts are already describing this as evidence of Trump's waning influence among GOP voters.",
    "Brian Kemp of Georgia in a Republican primary  yet he may be on track for a humiliating loss.",
    "And Perdue is wagering that GOP voters' angst over losing in 2020 will make them ripe marks.",
    "Trump endorsed Perdue for the explicit purpose of ousting Kemp as payback for that heresy.",
    "Many GOP primary candidates are running on Trump's lies about our elections, of course.",
    "But there's something uniquely repulsive and corrupt about Perdue's rendition.",
    "He has said that as governor he wouldn't have certified Trump's 2020 loss.",
    "We shouldn't be overly sanguine about the meaning of a Perdue loss.",
    "Which is why making an example of it is so crucial.",
    "First, Perdue has made this forward-looking.",
    "Perdue recently telegraphed this again.",
    "But why not take him at his word?",
    "Fortunately, that may be failing.",
    "Perdue is a prime example."
  ]
}