{
  "id": 1922,
  "mediaId": 238,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Opinion: Biden needs to explain why GOP lies and bullying are a danger to democracy",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/26/biden-gop-lies-bullying-danger-to-democracy/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    2087,
    2087,
    661,
    661,
    1646,
    1646,
    1147,
    1039,
    1039,
    1147,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "CNN reports on a tranche of 2,319 text messages between Meadows and other Trump allies, including texts with Rep. Scott Perry of Pennsylvania about a scheme to replace Justice Department leaders who opposed Trump's claims of election fraud.? CNN adds: Beginning on Election Day, Meadows was in the middle of it all, from connecting activists pushing conspiracy theories to strategizing with GOP lawmakers and rally organizers preparing for January 6.?\nTogether these examples provide a portrait of a party that has rejected basic norms of democracy.",
    "As Attorney General Merrick Garland moves at a snail's pace looking for a chain connecting Trump to the violent marauders at the Capitol on Jan. 6, Americans are in need of a coherent explanation for why the GOP's conduct is so unacceptable and why it should be disqualifying for office.",
    "As my colleague Aaron Blake reports, Cassidy Hutchinson, a former aide to Meadows, testified that the White House Counsel's Office made clear that the plot to overthrow the election was not legally sound? and that Meadows had been warned about the potential for violence on Jan. 6.",
    "Consider the evidence of their anti-democratic bent from just the past week:\nFormer senator David Perdue of Georgia, who has been endorsed by defeated former president Donald Trump in his state's Republican primary for governor, kicked off his debate with incumbent Gov.",
    "Quite simply, politicians are a menace to democracy when they think they are beyond accountability, free from the obligation to follow the will of the voters and able to use instruments of power to punish enemies.",
    "Sen. Mike Lee (R-Utah) asked then-White House Chief of Staff Mark Meadows for something to work with? on Nov. 20, 2020, to overturn the will of the voters and justify throwing out electoral votes for Joe Biden.",
    "House Minority Leader Kevin McCarthy (R-Calif.) was caught lying about his conversations about the Jan. 6, 2021, insurrection that Trump instigated and his prior statements that he wanted Trump to resign.",
    "Biden certainly does not want to interfere with legal investigations, but he has the authority and the obligation to explain why Republicans are unfit to serve.",
    "What is missing from the coverage is an unstintingly candid portrait of a party that rejects democracy in favor of authoritarianism and Christian nationalism.",
    "Ron DeSantis retaliated against Disney for speaking out against his don't say gay? law by enacting what amounts to a massive tax hike on Floridians.",
    "Republicans have dismissed the peaceful transfer of power and their obligation to place the rule of law over loyalty to a partisan ideologue.",
    "The threat that the GOP poses to democracy must be a constant refrain, as was Biden's restore the soul of America? in the 2020 campaign.",
    "This is an insult to democracy and an indication that he is incapable of comprehending the oath of office he would take if elected.",
    "Biden need not ignore economic issues to make the case, and it would be unwise and irresponsible not to hammer home this message.",
    "Republicans are showing they cannot be trusted to properly exercise government authority or leave office when they lose.",
    "It's weird that he has resisted doing so forcefully, despite all the evidence of a massive assault on democracy.",
    "No one other than the president has the megaphone to explain this and to raise the stakes for the 2022 election.",
    "The political landscape is littered with Republicans' lies and evidence of their authoritarian schemes.",
    "And they are willing to use the power of government to threaten dissenters in pursuit of power.",
    "Right-wing pundits cheered this deployment of government power to punish political opponents.",
    "It is not simply Disney's tax status or a single primary debate that is at stake.",
    "Quite simply, Biden must explain why this ain't your father's Republican Party.?",
    "It will also take more than one speech or one ad buy to drive home the message.",
    "Brian Kemp on Sunday with this lie: First off, let me be very clear tonight.",
    "This is a page straight out of Hungarian leader Viktor Orban's playbook.",
    "The media too often portray this as a matter of political gamesmanship.",
    "Trump rewarded McCarthy's lies and subsequent sycophancy with praise.",
    "The election in 2020 was rigged and stolen.? It was not.",
    "Will McCarthy survive this latest scandal?",
    "How will Perdue do in the primary?",
    "Florida Republican Gov."
  ]
}