{
  "id": 1925,
  "mediaId": 409,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Georgia Poll: Kemp 53 Percent, Perdue 27 Percent",
  "image": "https://www.nationalreview.com/wp-content/uploads/2019/12/Brian-Kemp.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/georgia-poll-kemp-53-percent-perdue-27-percent/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormack",
  "authorUrl": "https://www.nationalreview.com/author/john-mccormack/",
  "termIds": [
    2087,
    2087,
    2095,
    2095,
    2279,
    2279,
    1147,
    1147,
    1646,
    1646,
    428,
    428,
    501,
    501,
    2672,
    2672,
    2934,
    2934
  ],
  "sentences": [
    "In 2019, he signed a bill to ban abortion after a baby's heartbeat can be detected early in pregnancy, and last year, he signed into law a reasonable voting bill that Joe Biden and other Democrats hysterically denounced as Jim Crow 2.0.? But the thing Kemp wouldn't do was break Georgia law in an attempt to overturn Joe Biden's victory in the 2020 presidential election.",
    "As I wrote in the most recent issue of National Review, Georgia is the most important test in the May GOP primaries of how much Republican voters care about Trump's grievances over the 2020 election:\nIncumbent GOP governor Brian Kemp won the nomination in 2018 with Trump's endorsement, and he's governed as a staunch conservative.",
    "But the House Republicans who opposed Trump's efforts to overturn the election did not pay a price in the Texas primaries in March, and Georgia could prove that a majority of Republicans in a key swing state aren't animated by Trump's grievances over 2020.",
    "Brian Kemp has a chance of landing an outright victory against former U.S. Sen. David Perdue, according to an Atlanta Journal-Constitution poll that shows the Republican incumbent with a hefty advantage over his Donald Trump-backed challenger.",
    "That single act by Kemp is the only reason why Trump has waded into the gubernatorial primary by endorsing former senator David Perdue, who has said he would not have certified the 2020 election results in Georgia.",
    "That verdict will also depend on the outcome of Georgia's GOP primary race for secretary of state, where Trump endorsed Congressman Jody Hice over incumbent Brad Raffensperger.",
    "The new poll was conducted just before the first Georgia gubernatorial debate on April 24 in which Perdue blamed Kemp for allowing Democrats to rig? and steal? the election.",
    "Four of ten House Republicans who voted to impeach Trump in January 2021 have announced their retirements, and others face tough primary challengers later this year.",
    "The results of the KempPerdue race could thus have real consequences in a scenario where Trump runs and loses again in 2024 and attempts to overturn the election.",
    "A new Atlanta Journal-Constitution poll shows incumbent Republican governor Brian Kemp crushing former senator David Perdue in the GOP gubernatorial primary:\nGov.",
    "If he loses, [the press will] blame me fully.?\nFor Republicans who have been most critical of Trump, a Kemp victory alone wouldn't be electoral vindication.",
    "But as we went to press, polls had consistently shown Kemp leading Perdue by at least ten points, and Trump was trying to lower expectations.",
    "In Georgia, elections where no candidate gets 50 percent of the vote head to a runoff, which we may see after the May 24 primary.",
    "Kemp led Perdue 53% to 27% in the poll of likely voters in the Republican primary, which is now less than a month away.",
    "Not easy to beat a sitting governor, just remember that,? Trump said in an early-April radio interview.",
    "That would put the governor above the majority-vote threshold needed to avoid a June runoff.",
    "In an Emerson poll from early April, Raffensperger led Hice 29 percent to 26 percent.",
    "Other challengers were in the single digits; an additional 15% were undecided.",
    "But it's a close race, and we'll see what happens.",
    "If David wins, we'll get no credit."
  ]
}