{
  "id": 1928,
  "mediaId": 238,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Biden gets briefed on the youth vote; McCarthy faces House Republicans",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/27/biden-gets-briefed-youth-vote-mccarthy-faces-house-republicans/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2429,
    2429,
    2087,
    2087,
    2085,
    2085,
    661,
    661,
    1147,
    1147,
    982,
    982,
    1392,
    1392,
    1609,
    1609,
    562,
    562,
    255,
    255
  ],
  "sentences": [
    "In today's edition  House Minority Leader Kevin McCarthy will learn this morning whether House Republicans still stand firmly behind him  The Post's Matt Brown, Amy Gardner and Josh Dawsey look at how Trump's Georgia allies are running on 2020 grievance and why it may not work  Biden is expected to eulogize former secretary of state Madeleine Albright today  but first \nHarvard Kennedy School Institute of Politics pollsters and their students briefed President Biden Monday on their Spring 2022 Harvard Youth Poll, according to people familiar with the matter, in a discussion that focused on the political views of LGBTQ young people, the state of democracy and concerns over a mental health crisis, among other topics.",
    "Twenty-one percent of the people surveyed by Harvard identify as LGBTQ, and young LGBTQ voters are much more likely to be politically engaged, according Harvard IOP Director John Della Volpe, who served as one of Biden's 2020 presidential campaign pollsters and authored Fight: How Gen Z is Channeling Their Fear and Passion to Save America.?\nBiden's approval rating among young Americans has fallen to 41 percent, according to the poll  that's five percentage points down from the fall edition.",
    "But McCarthy did not follow through on the sterner steps that some Republicans encouraged him to take, opting instead to seek a political accommodation with the most extreme members of the GOP in the interests of advancing his own career.?\nIn the phone call with other Republican leaders on Jan. 10, McCarthy referred chiefly to two representatives, Matt Gaetz of Florida and Mo Brooks of Alabama, as endangering the security of other lawmakers and the Capitol complex.",
    "But he and his allies discussed several other representatives who made comments they saw as offensive or dangerous, including Lauren Boebert of Colorado and Barry Moore of Alabama.?\nThe Hill has eyes (on McCarthy): The Times' latest revelations have prompted the House committee investigating the attack on the Capitol to redouble its efforts to have McCarthy appear for an interview, per AP News' Lisa Mascaro and Kevin Freking.",
    "Biden engaged the students on this set of topics, expressed pride about his diverse cabinet and federal judicial nominees and shared his belief that the U.S. is at a critical point in history in the battle of democracy versus autocracy, according to a person familiar with the meeting who, like others, spoke on the condition of anonymity to describe the private event.",
    "Kemp, who has assiduously avoided criticizing Trump, has logged double-digit leads in recent public polls and enjoys a vast fundraising advantage.?\nThe race, perhaps more than any other in the country, represents a test: both of the power of Trump's endorsement and the potency of his false 2020 fraud claims as a motivating force among Republican voters this year.",
    "Shen, according to a second person, shared with Biden her concerns about mental health, telling the president that 71 percent of Americans aged 18 to 29 agree that there's a mental health crisis in America  a sentiment Biden acknowledged and said he heard regularly about from Surgeon General Vivek Murthy, and via conservations with his grandchildren.",
    "Lordy, there are more tapes: McCarthy feared in the aftermath of the Jan. 6 attack that several far-right members of Congress would incite violence against other lawmakers, identifying several by name as security risks in private conversations with party leaders,? the New York Times' Alexander Burns and Jonathan Martin report.",
    "He'll face fellow House Republicans for the first time since a series of recordings were released by two New York Times reporters in advance of the release of a new book that show him criticizing former president Donald Trump and members of his conference in the days following the Jan. 6, 2021, attack on the Capitol.",
    "The former U.S. senator spent most of his nine-minute stump speech embracing unproven claims that fraud tainted the 2020 election  and accusing Kemp of doing nothing about it.?\nIn theory, it's the sort of message that should appeal to Don McGeary, a retired banker and supporter of Trump who believes the fraud claims.",
    "Those people who disapprove today, but who voted for him just a year and a half ago  they rate him much more harshly on the economy.?\nHappening today: House Republicans will hold a routine conference meeting, but the moment will be anything but routine for House Minority Leader Kevin McCarthy (R-Calif.).",
    "McCarthy talked to other congressional Republicans about wanting to rein in multiple hard-liners who were deeply involved in Trump's efforts to contest the 2020 election and undermine the peaceful transfer of power,? according to an audio recording obtained by the Times.",
    "A Perdue defeat could help define the limits to both.?\nHappening today: Biden and an array of current and former U.S. officials, lawmakers, foreign diplomats and world leaders will gather at the Washington National Cathedral to pay their respects to Madeleine Albright.",
    "Let's get over it and get on with our lives.?\nUnfortunately for Perdue  and for Trump  many Republican voters in Georgia appear to agree  With less than a month to go before the May 24 primary, Perdue's laserlike focus on election fraud seems to be falling flat.",
    "The committee is also looking at summoning a widening group of House Republicans for interviews, Thompson said, as more information emerges about their conversations with the Trump White House in the run-up to the Capitol siege.?\nHappening today: Sens.",
    "Brian Kemp, drew some cheers Monday evening at a gathering of about 50 Republicans around a pickup truck in the deeply conservative [Watkinsville, Ga.,] about 70 miles east of Atlanta,? our colleagues Matt Brown, Amy Gardner and Josh Dawsey report.",
    "Out of the 24 percent of 18-to-29-year-olds who report having thoughts of self-harm in the past two weeks, those feelings are most prevalent in LGBTQ (39 percent), Black (35 percent), and Asian American and Pacific Islander (33 percent) youth.",
    "The attendees include former president Barack Obama and former first lady Michelle Obama, current secretary of state Antony Blinken, former secretaries of state Condoleezza Rice and John Kerry, and the presidents of Georgia and Kosovo.",
    "Biden quizzed undergrad students Alan Zhang, chair of the Harvard Public Opinion Project, and Jing-Jing Shen, former chair of the project, on the most significant findings of the poll, according to a person familiar with the meeting.",
    "How the policies being endorsed or implemented by Republicans across the country will affect the midterm elections is unclear, but the poll, which focuses on people aged 18 to 29, showed it could turn off younger voters.",
    "Biden, former president Bill Clinton, former secretary of state Hillary Clinton and Albright's three daughters are expected to eulogize the country's first female secretary of state in front of more than 1,400 guests.",
    "The group also met Tuesday with the National Republican Senate Committee to discuss the poll's findings and in previous years have met with White House officials, including during the Trump and Obama administrations.",
    "Zhang shared his concerns about threats to democracy, underscoring the poll's findings that 59 percent of young Democrats and 61 percent of young Republicans see the other party as a threat to democracy.",
    "Robert Menendez (D-N.J.) and Patty Murray (D-Wash.) will hold a press conference with covid activists as the country closes in on a once-unthinkable milestone: 1 million covid deaths.",
    "The stark findings come as several leading Republicans have reignited a culture war over sexual orientation and gender identity ahead of November's midterm elections.",
    "Only 69 percent of young Americans who voted for President Biden in 2020 approve of his job performance today,? Della Volpe said on a press call earlier this week.",
    "More than 991,000 Americans have died of covid, according to The Post's tracker, although the rate at which Americans are dying has fallen sharply in recent weeks.",
    "The GOP focus on the LGBTQ community has stood out, in part, because it follows the rapid escalation in public support for LGBTQ rights in recent years.",
    "But McGeary, 71, was not impressed.?\nWe can't do anything about it,? McGeary said about the 2020 result, adding that he intends to vote for Kemp.",
    "said the panel expects to decide this week about issuing a second request to McCarthy, who has declined to voluntarily appear before the panel.",
    "Nearly half (45 percent) of LGBTQ youth, according to the poll, feel under attack a lot? due to their sexual orientation.",
    "Let go and let GOP: David Perdue's quest to unseat a longtime friend and fellow Republican, Gov.",
    "Ron DeSantis has signed into a law a measure that restricts LGBTQ discussion in schools.",
    "If we ever interview New York Mayor Eric Adams, we promise not to be arrogant.",
    "It's water over the dam, under the bridge, however you want to refer to it.",
    "Chairman Bennie Thompson (D-Miss.)",
    "Tips: earlytips@washpost.com.",
    "Thanks for waking up with us.",
    "In Florida, Republican Gov.",
    "Good morning, Early Birds.",
    "What we're reading:"
  ]
}