{
  "id": 1933,
  "mediaId": 33,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "The lies and delusions revealed in Mark Meadows' texts are already poisoning the next election",
  "image": "https://www.i.cdn.cnn.com/.a/2.294.0/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/04/26/politics/meadows-texts-trump-lies-2022-election-analysis/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Collinson",
  "authorUrl": "https://www.cnn.com/profiles/stephen-collinson",
  "termIds": [
    2087,
    1981,
    1981,
    2087,
    916,
    916,
    1053,
    1053,
    1039,
    1039,
    1147,
    1147,
    428,
    428,
    2791,
    2791
  ],
  "sentences": [
    "The most alarming revelation from 2,319 texts sent and received by ex-White House chief of staff Mark Meadows, which were exclusively reported by CNN on Monday, is that that same authoritarian stew is already poisoning yet another election -- November's midterms -- with the lie that Trump won in 2020.",
    "(CNN)The most chilling takeaway of a new haul of texts showing how former President Donald Trump's inner circle schemed to steal the 2020 election is not the delusional fervor of their plan or the casual way plotters rejected the legitimate will of the American people.",
    "It's possible, if not likely, that many of those involved could soon have real political power if the GOP successfully capitalizes on President Joe Biden's unpopularity and picks up seats in Congress, as is the historical norm for the party out of the White House.",
    "And despite the lie about a stolen election dominating Republican primary duels, many elections in November may turn most on the inability of Biden and Democrats to project a winning narrative, even though the economy is improving in many ways.",
    "It's not even the hypocrisy of key Trump supporters who were in some cases disgusted and scared by the US Capitol insurrection and knew it was wrong but have since tried to whitewash it and the ex-President's culpability from history.",
    "For many Americans, struggling against high inflation that has caused rocketing prices of basic goods and gasoline, the question of pressing accountability for the January 6 insurrection may be backward looking more than a year on.",
    "But it is becoming increasingly clear that the lack of consequences for those who helped Trump in his pernicious attempt to steal a legitimate election is having a dangerous effect in emboldening fresh assaults on democracy.",
    "They show how Trump's most fervent and unhinged supporters desperately looked to overturn a free and fair election, indulged in absurd fantasies about voter fraud that didn't happen and plotted to deny Biden his presidency.",
    "And the messages underscore how the most important divide in modern politics is not the age old struggle between liberalism and conservatism -- a legitimate ideological duel over the meaning and direction of America.",
    "The texts also suggest that the committee's final report, after public hearings expected to take place within weeks, will embroider a devastating picture of Trump's efforts to subvert the election and cling to power.",
    "And if Republicans, as expected, win back the House in November, the select committee is sure to be swept away -- by some of the very Trump loyalists whose coverup of the insurrection it has been investigating.",
    "In one of the most remarkable texts, Georgia Rep. Marjorie Taylor Greene told Meadows only three days before Biden was sworn in that some Republicans still wanted the then-President to declare martial law.",
    "The core national principle that the people get the right to choose their leaders -- not a ragtag band of conspiracists and power-hungry supporters of a strongman -- appears more under threat than ever.",
    "The text messages sent or received by Meadows between Election Day 2020 and Biden's inauguration on January 20, 2021, were obtained and reported by CNN's Jamie Gangel, Jeremy Herb and Elizabeth Stuart.",
    "Just this weekend, the falsehood of widespread electoral fraud -- which led to the terrifying assault by Trump supporters on the Capitol -- defined Republican primary battles in Michigan and Georgia.",
    "Apart from anything else, they show a White House chief of staff facilitating an attack on democracy rather than acting in any conventional and accepted definition of that critical government post.",
    "Still, the idea that Attorney General Merrick Garland would decide there was sufficient likelihood of a conviction to prosecute Trump strikes many legal and political observers as far-fetched.",
    "And in Michigan this weekend, Kristina Karamo, who promoted lies about a stolen election in 2020 and is backed by Trump, won the state Republican Party's endorsement for secretary of state.",
    "But it is already obvious that the mendacious battle to steal power, which reverberates through the Meadows texts, still threatens the right of American voters to choose their own leaders.",
    "In their first gubernatorial debate in Georgia this weekend, for example, former Sen. David Perdue, who has transformed himself into a Trump acolyte in his quest for power, attacked Gov.",
    "The House has voted to refer the committee's criminal contempt citations against Meadows and former Trump White House advisers Dan Scavino and Peter Navarro to the Justice Department.",
    "But on January 6, the texts show, Greene was among the Republicans pleading with Meadows to get Trump to calm his marauding supporters, who smashed their way into the Capitol.",
    "However damning the findings, which are likely to leave a valuable legacy, will anyone face true accountability for the worst attack on American democracy in modern history?",
    "It's also at work nationwide in other races, fueled by Trump's determination to turn the midterms into a theater of vengeance and a platform to win back power in 2024.",
    "It's too early to say whether such campaigns will electrify the conservative base at the expense of more moderate voters, potentially backfiring on the GOP.",
    "Meadows turned the texts over to the House select committee investigating the January 6, 2021, insurrection before he stopped cooperating with the panel.",
    "Instead, the great struggle of the early 21st century is between those in the Republican Party who are prepared to reject democracy and everyone else.",
    "And he is also seeking to leverage supporters who fan the falsehood that there was massive fraud in 2020 into key state posts administering elections.",
    "They show Trump administration Energy Secretary Rick Perry and Trump's son, Donald Trump Jr., brainstorming ideas to overturn Trump's election loss.",
    "And it is as yet undecided on whether to send a criminal referral of the former President or his alleged co-conspirators to the Justice Department.",
    "Testifying under oath last week, before these texts were revealed, the high-profile Trump supporter said she could not recall any such sentiments.",
    "\"The election of 2020 was rigged and stolen,\" Perdue said in his opening statement on Sunday, striking a theme to which he frequently returned.",
    "She's been among the many House Republicans who denied the truth of the insurrection and who have tried to prevent efforts to find the truth.",
    "The texts -- sent by members of Congress, key Republican Party figures, Fox hosts and even Trump's family -- also pose a troubling question.",
    "But while they are stunning to read, they are unlikely to settle the most vital emerging question about the House committee's work.",
    "If she wins the election in November, she will be in charge of running the next presidential election in the Wolverine State.",
    "Another group of texts shows Trump supporters suggesting ways to pin the violence by his supporters on Antifa activists.",
    "And the material offers evidence of Meadows' role in coordinating efforts to overturn results in various states.",
    "The former President is wielding his considerable power in the party to promote candidates who deny the truth.",
    "Brian Kemp, who refused to help the ex-President's attempt to overturn Biden's victory in the Peach State.",
    "Similar stories of pro-Trump election conspiracists are playing out in Colorado, Arizona and elsewhere.",
    "Another Trump aide, Steve Bannon, faces trial later this year after a similar referral.",
    "Multiple GOP primary campaigns are rooted in the lie that Trump won the 2020 election.",
    "The Trump-backed candidate also won the state party's nod for state attorney general.",
    "The committee itself has no power to impose consequences."
  ]
}