{
  "id": 1934,
  "mediaId": 19,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Georgia Poll: Kemp Widens Lead over Perdue in Governor's Primary",
  "image": "https://media.breitbart.com/media/2021/12/AP18208489278499-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/26/georgia-poll-kemp-widens-lead-over-perdue-in-governors-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    1147,
    1646,
    1951,
    2095,
    2203,
    3082,
    2672,
    2947
  ],
  "sentences": [
    "The poll asked, Would an endorsement by Donald Trump make you more or less likely to vote for a candidate running for office in Georgia??\nForty-five percent said the Trump endorsement would make them much more likely (27 percent) or somewhat more likely (18 percent) to vote for a candidate, and 36 percent said it would make no difference.",
    "Former football star Herschel Walker, who also has Trump's endorsement, is polling far ahead of any others in the U.S. Senate primary and is widely seen as a shoo-in candidate for the general election, where he will compete in a much tougher battle against Democrat Sen. Raphael Warnock.",
    "While Kemp has been leading Perdue by double digits for most of the duration of the primary, this latest poll shows Kemp with his widest lead yet and signals, along with a couple other recent polls, that the governor may be able to reach 50 percent of the vote and stave off a runoff.",
    "A runoff scenario could be costly and shift the momentum back toward Perdue, as well as eat up four weeks of general election time that would be valuable for Republicans in their upcoming race against the uncontested Democrat gubernatorial candidate, Stacey Abrams.",
    "The poll was taken over a relatively long timeframe, from April 10 to 22, and therefore does not account for Kemp and Perdue's first debate, which occurred Sunday evening and was dominated by angry and interruptive exchanges over the 2020 election.",
    "Former President Donald Trump is backing Perdue in the election as part of his heavy-handed mission to unseat Kemp and Kemp's allies, who he believes are to blame for Republicans' losses in 2020 in Georgia.",
    "The poll, conducted by the University of Georgia's School of Public and International Affairs among 886 likely primary voters, found Kemp with 53 percent support compared to Perdue's 27 percent.",
    "Hice is less than two points behind Raffensperger, 28.1 percent to 26.4 percent, which is within the poll's 3.3 percent margin of error and pits the two in a statistical tie.",
    "Walker received 66 percent support in the primary poll, while Agriculture Commissioner Gary Black received seven percent and multiple others received two percent or less.",
    "Fifteen percent said the Trump endorsement would make them somewhat less likely (five percent) or much less likely (ten percent) to vote for a candidate.",
    "Trump-backed Rep. Jody Hice, who is vying to unseat Secretary of State Brad Raffensperger, is polling neck-and-neck with his incumbent opponent.",
    "Brian Kemp has about double the support of former Sen. David Perdue in Georgia's Republican gubernatorial primary race, according to a new poll.",
    "Trump has weighed in on seven candidates total in the Georgia primary, and some are faring better than Perdue, according to the poll.",
    "Third-place candidate Kandiss Taylor received four percent, and 15 percent of respondents said they were undecided.",
    "The poll tested voters' value of the Trump endorsement and found a plurality have a positive perception of it.",
    "The primary takes place May 24, but early voting begins in one week, on May 2.",
    "Twenty-three percent said they remain undecided on a Senate candidate.",
    "Gov."
  ]
}