{
  "id": 1935,
  "mediaId": 19,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Georgia Democrat Stacey Abrams Revels in Kemp and Perdue's Bitter Primary Battle",
  "image": "https://media.breitbart.com/media/2021/07/staceyabramsbook2-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/26/georgia-democrat-stacey-abrams-revels-kemp-perdue-bitter-primary-battle/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1646,
    1951,
    2095,
    4325,
    146,
    428,
    539,
    571,
    2672
  ],
  "sentences": [
    "Abrams' digital director chimed in during the Sunday debate, writing, Tune out the #GaGovDebate nonsense and instead focus on the positive message and care for the Georgian people @staceyabrams is spreading.?\nTune out the #GaGovDebate nonsense and instead focus on the positive message and care for the Georgian people @staceyabrams is spreading.",
    "https://t.co/JrIlyGuh3e\n Garima Verma (@gverma289) April 25, 2022\nThe Georgia Democrat Party observed that Kemp and Perdue were bad for each other  and worse for Georgia? and called their heated exchanges a hot peachy mess.?\nIn #GaGovDebate, Brian Kemp and David Perdue showed they are bad for each other  and worse for Georgia.",
    "#GaGovDebate\n Lauren Groh-Wargo (@gwlauren) April 24, 2022\nGroh-Wargo also managed Abrams' first gubernatorial campaign in 2018, when Abrams narrowly lost to Kemp and then famously refused to concede, claiming her loss was due to alleged voter suppression.",
    "Kemp currently holds a commanding double-digit in the race, which has captured the country's attention largely because former President Donald Trump has been so vocal about his support for Perdue and his disapproval of Kemp over the 2020 election.",
    "Let's help Georgians tune out the noise from my opponents by focusing on what is most important: building a better future for all Georgia,? Abrams stated after Kemp and Perdue spent much of the debate raging at each other over the 2020 election.",
    "Although Abrams has been able to coast through her own primary unopposed, the Georgia Democrat saw a brief spurt of intense national attention in February after being photographed without a mask on while surrounded by dozens of masked children.",
    "An ad for @staceyabrams: pic.twitter.com/VOcSI61hx7\n Blayne Alexander (@ReporterBlayne) April 25, 2022\nAbrams' campaign staffers and the Georgia Democrat Party also piled on as the Republican back-and-forth played out on local television.",
    "pic.twitter.com/RJ2kIKB1li\n Georgia Democrats (@GeorgiaDemocrat) April 25, 2022\nWhile the debate was the most recent example of Abrams and her campaign highlighting the Republican discord, they have used the same line of attack before.",
    "Stacey Abrams, the uncontested Democrat candidate in Georgia's gubernatorial race, is leveraging on the infighting between the top two candidates in the Republican primary as she awaits the general election.",
    "Republicans across the country, many of whom were in the midst of fighting their own child mask mandate battles, shared the photo far and wide, lashing out at the stunning juxtaposition.",
    "I'm fighting to expand affordable health care, strengthen education and create more good paying jobs,? Abrams stated on social media in January alongside a fundraising link.",
    "Abrams and her campaign have repeatedly framed the Georgia Democrat as the candidate who is focused on her state while framing her potential Republican opponents, Gov.",
    "Other than that brutal moment in the spotlight, Abrams' campaign has largely been overshadowed by the dramatic primary, which, barring a runoff, concludes on May 24.",
    "A recent poll from Emerson College and the Hill showed Kemp is a slightly stronger candidate than Perdue in a hypothetical matchup against Abrams.",
    "Kemp led Abrams in the poll by seven points, 51 percent to 44 percent, while Perdue led Abrams by five points, 49 percent to 44 percent.",
    "Also, per an NBC News reporter, the very first commercial following the hour-long Republican brawl was an Abrams campaign ad.",
    "Sunday's Republican debate in Georgia was the latest example of Abrams using the lack of a primary opponent to her advantage.",
    "As Kemp and Perdue fight each other, Stacey Abrams will is [sic] fighting for Georgia,? Groh-Wargo said in February.",
    "Her campaign manager, Lauren Groh-Wargo, wrote on social media, Brian Kemp and David Perdue are stuck in 2020.",
    "Yet again, Brian Kemp and David Perdue are showing that their fight is with each other  and not for Georgia.",
    "@StaceyAbrams is looking to the future.?\nBrian Kemp and David Perdue are stuck in 2020.",
    "Brian Kemp and former Sen. David Perdue, as the candidates who are focused on arguing.",
    "Abrams used the debate to ask her supporters for campaign donations.",
    "1st commercial immediately following end of Kemp/Perdue debate?",
    "@StaceyAbrams is looking to the future.",
    "(It was a hot peachy mess.)"
  ]
}