{
  "id": 1936,
  "mediaId": 147,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Tamara Keith and Amy Walter on Trump's influence on the GOP",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/04/fullepisode-21-768x513.jpg",
  "link": "https://www.pbs.org/newshour/show/tamara-keith-and-amy-walter-on-trumps-influence-on-the-gop",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1824,
    1970,
    2095,
    2407,
    4325,
    375,
    428,
    2672
  ],
  "sentences": [
    "And so candidates up and down the ballot in states, but especially states like Georgia and Pennsylvania, states where the former president has not given up  like a dog with a bone, he has not given up on relitigating the election and trying  he put out a statement today supporting an effort to try to overturn the election in Wisconsin, I think, and said any real Republican needs to support that effort.",
    "And you literally watched hour after hour, and you could see it, you're right, in these texts, that it wasn't just saying maybe it's Antifa, but also continuing to press Meadows on these accusations of fraud, that they are going to find these machines that have been rigged and algorithms, all of those conspiracy theories starting up around that same time.",
    "Read the Full Transcript\nJudy Woodruff:\nAs midterm election season kicks into high gear, GOP candidates have increasingly tied their fates to the lie that the 2020 presidential election was stolen, while, in Washington, more communications sent by Republican officials on and around January 6 are coming to light.",
    "And accusations about  that David Perdue is making that the governor did not stand up enough to protect the election kind of fall flat when it is, as Kemp noted often in this debate, that it was  the reason Democrats had the majority in the Senate right now which is because David Perdue lost that race.",
    "And showing that you can at least nod to fraud, or say that you have concerns with the election, or somehow, if you aren't going to go full-bore and say it was completely fraudulent and rigged, if you're a Republican, you have to like at least acknowledge, before you can talk about anything else.",
    "And a good reason why David Perdue lost that race, as did the other Republican in the run-off that election, is because then-President Trump went around during the run-off saying how terrible the election was and how it was stolen, and a whole bunch of Republicans did not show up to vote.",
    "But now you see we're now seeing more reporting today  CNN had this  texts from House members who in the  on the day of January 6 were saying to Mark Meadows, the chief of staff, President Trump's chief of staff, please tell the president  this is from Marjorie Taylor Greene.",
    "And he most recently signed legislation about having a handgun, and you don't need a permit to do so, so getting on the right side of conservatives by doing those things, and it makes the argument that he has not done enough to protect Trump, it's harder to make that sell.",
    "NPR's Tamara Keith and Amy Walter of the Cook Political Report with Amy Walter join Judy Woodruff to discuss the latest political news, including the midterm elections season and Republican ties to the lie that the 2020 election was stolen.",
    "If we needed any more proof that President Trump looms large in this year's midterm elections, we saw it in last night's Georgia first Republican primary debate, gubernatorial candidates David Perdue, Brian Kemp.",
    "And then, within weeks of Trump leaving office, he was down at Mar-a-Lago kissing his ring, going to get Trump's support for the midterms, because, in these days of partisan politics, winning is everything.",
    "Judy Woodruff:\nWell, it means there will be much  all the more attention to what the January 6 Committee has to say when they hold their hearings, which we now believe is going to be in the month of June.",
    "So, immediately, even before the dust was settled, before the glass was cleaned up, Republicans were and allies of the president were shifting, were trying to find ways to explain this away.",
    "Amy Walter:\nThough only one of them has been endorsed by Donald Trump, and that is David Perdue, who also lost his bid for reelection in the run-off election in January of this year.",
    "And, remember, the governor signed into law earlier this last year voting legislation that would do things like restricting the number of drop boxes, and there's tighter voter I.D.",
    "The House Republican leader, Kevin McCarthy, in this new book, he is on a recording telling fellow Republicans that he plans to tell President Trump he needs to resign.",
    "And he is making sure that those who did not support him in either overturning the election or not certifying the election in their state will suffer the consequences.",
    "But, Tam, let's turn to something else we're seeing where President Trump is very, very much present in these  the stories that have come out of the last few days.",
    "(CROSSTALK)\nDavid Perdue:\nThe difference between you and me is the fact that you think that Jon Ossoff and John Biden  or Biden won fair and square.",
    "There were many things that the president did or is involved in that we thought were going to mark the end of either his candidacy or his tenure.",
    "And they were texting because they thought that the president of the United States could do something to tell his supporters to go home.",
    "At the moment, as Tam said, we were talking to plenty of people who thought  on the Republican side who thought, all right, this is it.",
    "And Perdue began the debate by saying that the 2020 presidential election was rigged, that President Trump actually won reelection.",
    "Tamara Keith:\nYes, in some ways, it all makes sense, in that these were text messages that were sent when they were under attack.",
    "Judy Woodruff:\nSo, Tam, if it is an argument that did not work in 2020, why do Republicans think it is going to work this time?",
    "However, voters, at least what we're seeing in polling in the state of Georgia, aren't interested in relitigating it either.",
    "They agree with Perdue, the former senator, that the election was fraudulent, that Donald Trump really won the election.",
    "If you look at other text messages, Marjorie Taylor Greene is like, but we think it was all people  it was Antifa.",
    "Their place of employment had people charging into it looking for members of Congress and shouting about hanging.",
    "You are telling the people in Georgia that that's what the truth is, and you want us to swallow that and move on.",
    "Every one of these members is now saying this didn't  this didn't  it wasn't something that they really meant.",
    "Kevin McCarthy publicly gave a speech on the floor of the House very critical of the former president.",
    "Judy Woodruff:\nAnd, clearly, this is not the only state where those arguments are taking place.",
    "And we just heard  we played some of the clip  some of what he said earlier in the program.",
    "This is Congressman Timmons from South Carolina: \"The president needs to stop this ASAP.\"",
    "Didn't come to pass, but surely something like this was going to be  was going to stick.",
    "Brian Kemp:\nWell let me remind you, I can speak for myself, and that's not what I said.",
    "That's Amy Walter of The Cook Political Report With Amy Walter and Tamara Keith of NPR.",
    "It is a litmus test in the Republican primary to just say that you're cool with Trump.",
    "Judy Woodruff:\nAnd then it became a theme throughout much of the rest of the debate.",
    "David Perdue (R), Georgia Gubernatorial Candidate: He said it was a clean election.",
    "So, obviously, it had an impact in terms of actions, reactions from the governor.",
    "And in the primary, all that matters is, how close can you hug Donald J. Trump?",
    "Tamara Keith, National Public Radio:\nWell, they are right now in the primary.",
    "Judy Woodruff:\nSo, you now have both of these candidates talking about fraud.",
    "Congressman Loudermilk of Georgia: \"It's really bad up here on the Hill.",
    "And he did sort of a mediocre job of telling them to go home, at best.",
    "Many report Republicans would like to move on from the 2020 election.",
    "And the calculus was that Trump remained a huge force in the party.",
    "This is material that was turned over to the January 6 Committee.",
    "But, very quickly, Republicans started shifting away from that.",
    "Donald Trump does not want to move on from the 2020 election.",
    "It's a good time to check in with our Politics Monday team.",
    "Amy Walter:\nWell, for those Republicans, it does, right.",
    "What does it say about where Republicans are right now?",
    "Brian Kemp:\nI have never said it was a clean election.",
    "Very good to see both of you on this Monday evening.",
    "I have always said there is fraud in every election.",
    "That's the difference between the two of us.",
    "now on absentee ballots, things like that.",
    "\"Please tell the president to calm people.",
    "If we look at\nTamara Keith:\nWithin hours.",
    "This isn't the way to solve anything.\"",
    "It took him hours and hours to do it.",
    "You are putting words in my mouth.",
    "Like, it was utterly frightening.",
    "They were literally under attack.",
    "He wants to keep relitigating it.",
    "But they also like the governor.",
    "There was  people died that day.",
    "They have breached the Capitol.",
    "So, Amy, I will start with you.",
    "It's not anything that I said.",
    "He said that's just whatever.",
    "This doesn't help our cause.\"",
    "They like Donald Trump a lot.",
    "Here is a just short excerpt.",
    "He denies anything happened.",
    "And he's still doing that.",
    "So they're on the record.",
    "He's now denying that.",
    "But where's it going?",
    "The texts are there.",
    "They were evacuated.",
    "It was a false flag.",
    "We will be watching.",
    "It's a litmus test.",
    "Amy Walter:\nYes.",
    "This is the end.",
    "Politics Monday.",
    "It's 2022.",
    "Hello.",
    "Gov.",
    "Gov."
  ]
}