{
  "id": 1941,
  "mediaId": 151,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Southern border is the backdrop for GOP ads",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/04/25/southern-border-is-the-backdrop-for-gop-ads-00027434",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1563,
    2087,
    2095,
    2117,
    2286,
    2303,
    2466,
    428,
    2590,
    2661,
    2787
  ],
  "sentences": [
    "Though he's a longshot at best, Pierce's candidacy offers a window into the ways that money and ideas from the cryptocurrency world could start to scramble U.S. politics.?\n A New England Patriot and a conservative billionaire are trying to take down a GOP senator,? by Alex Isenstadt, POLITICO: Boozman's scramble shows the risk he confronts in 2022: The second-term senator is trying to beat back an under-the-radar primary challenge from 33-year-old Jake Bequette, a former Arkansas Razorbacks star and reserve for the NFL's New England Patriots who is trying to claim the MAGA mantle  and is financed by Richard Uihlein, one of the wealthiest conservative donors in the country.?\nGETTING IN  Construction executive Tim Michels running for Wisconsin governor, bringing the Republican field to 4,? by Molly Beck, Milwaukee Journal Sentinel: Tim Michels, co-owner of the Brownsville-based Michels Corporation and U.S. Army veteran, enters the GOP primary for governor nearly 20 years after his last statewide campaign  a 2004 loss to then-U.S. Sen. Russ Feingold.?\nHINDSIGHT IS 2020  Local election chief threatened by Republican leader seeking illegal access to voting equipment,? by Nathan Layne, Reuters: A local Republican Party leader in North Carolina threatened to get a county elections director fired or have her pay cut unless she helped him gain illegal access to voting equipment, the state elections board told Reuters.",
    "THE GREAT LAKES STATE  In northern Michigan, Trucker Randy and pay for play' claims roil Senate race,? by Jonathan Oosting, Bridge Michigan: A Republican state Senate candidate in northern Michigan says he was offered a $50,000 government job to withdraw from the race as part of a plot involving well-known conservative radio host Trucker Randy' Bishop, who is running for the same seat as a Democrat.?\nPRIMARY SOURCES  Madison Cawthorn's Blunders Open Door to Primary Challengers,? by Natalie Andrews, The Wall Street Journal: The brashness that catapulted freshman Rep. Madison Cawthorn to national attention is wearing on some of his voters here in his rural district in the Blue Ridge Mountains.?\nDAY IN COURT  Herbster files defamation lawsuit against Slama over assault allegations,? by Dan Crisler, Omaha World-Herald: Charles W. Herbster, a businessman and a front-runner for the Republican nomination to be Nebraska's next governor, filed a lawsuit Friday against State Sen. Julie Slama after she, along with seven other women, accused him this month of groping them.?\nTHE SHOW-ME STATE  Eric Greitens posts, then deletes, video featuring KCPD ride along.",
    "The party official, William Keith Senter, sought evidence to support false conspiracy theories alleging the 2020 election was rigged against former U.S. President Donald Trump.?\n In election misinformation fight, 2020 changed everything,'? by Amanda Seitz, Associated Press: As voters ready for hundreds of elections of local and national importance this year, officials and voting rights advocates are bracing for a repeat of the misinformation that overwhelmed the 2020 presidential race and seeded distrust about the legitimacy of Democrat Joe Biden's victory.?\nENDORSEMENT ALERT  Oregon Democrat Jamie McLeod-Skinner earned the endorsement of The Bulletin Editorial Board over Rep. Kurt Schrader (D-Ore.) in OR-05.",
    "Leslie Foreman said Saturday.?\nTHE WINDY CITY  Republican Bailey's forecast for political climate' of Illinois: A storm' is coming,? by Tina Sfondeles, Chicago Sun-Times: A farmer with a distinctly Southern accent, Bailey has called himself the only true conservative in a crowded primary field of GOP candidates, which includes Aurora Mayor Richard Irvin, venture capitalist Jesse Sullivan, businessman Gary Rabine, state Sen. Paul Schimpf and Hazel Crest lawyer Max Solomon.?\nMISS INDEPENDENT  How bad do Utah Democrats want Mike Lee out?",
    "And this man is going to win,' Trump said as he introduced Vance to the stage at the Delaware County Fairgrounds, just 10 days before the May 3 election.?\n DePerno wins GOP attorney general race after runoff; Karamo wins SOS endorsement,? by Craig Mauger, The Detroit News: Donald Trump's preferred candidates, Matt DePerno for attorney general and Kristina Karamo for secretary of state, won the endorsement Saturday of Michigan Republican Party delegates, solidifying the former president's hold over a changing GOP.",
    "Days until the Indiana and Ohio primaries: 8\nDays until the Nebraska and West Virginia primaries: 17\nDays until the Pennsylvania, North Carolina, Oregon, Idaho and Kentucky primaries: 22\nDays until the Texas runoff and the Alabama, Arkansas and Georgia primaries: 29\nDays until the California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota primaries: 43\nDays until the general election: 197\nDays until the 2024 election: 925\nWant to receive this newsletter every weekday?",
    "DePerno, a lawyer from Kalamazoo, got the party's endorsement after a runoff election while Karamo, an educator from Oak Park, got the nod for secretary of state in the first round of voting.?\nBEHIND THE SCENES  Bannon is helping a Vermont crypto bro get elected to the Senate,? by Ben Schreckinger, POLITICO: A longshot independent bid by crypto mogul Brock Pierce to capture a seat in the U.S. Senate has been getting help from an unexpected corner of the political universe.",
    "THE CASH DASH\n Top NM GOP official allegedly violated campaign finance laws,? by Ryan Boetel, Albuquerque Journal: A complaint filed this week with the Federal Election Commission alleges the executive director of the New Mexico Republican Party helped funnel $100,000 through a shell company to support Mark Moores during his failed bid for the U.S. House last year  a violation of campaign finance laws.?\nCODA  TWEET OF THE DAY  An interesting observation, just FYI.",
    "Contenders are stockpiling cash and quietly assessing their options.?\nJUST PEACHY  Election fraud claims dominate Georgia GOP governor's debate,? by Brittany Gibson, POLITICO: David Perdue made his intentions clear right out of the gate: In his opening statement in the Georgia GOP gubernatorial primary debate, he fixated on alleged election fraud.",
    "TRUMP CARD  Trump lays down marker for Vance in Ohio rally: 'This man is going to win,'? by Craig Howie, POLITICO: Former President Donald Trump on Saturday evening dialed up the stakes in Ohio's Senate Republican primary contest, holding a big rally with his endorsed candidate, Hillbilly Elegy' author J.D.",
    "Ambitious Democrats are preparing for what happens when the 88-year-old California senator's seat becomes available for the first time in a generation  a sea change for California politics that would likely launch a frenzied intraparty rush for the coveted post.",
    "Southern border is the backdrop for GOP ads\nBy STEPHANIE MURRAY\n04/25/2022 10:00 AM EDT\nPresented by PREMION\nTOP LINE\nBORDER PATROL  The border between the United States and Mexico is becoming a popular campaign ad backdrop this midterm cycle.",
    "No doubt many will also make the contrast that the vice president has not made that trip.?\nAlabama Republican Katie Britt recently cut a TV ad from the border for her Senate bid, despite her home state being well over 700 miles from Mexico.",
    "Finish the wall and secure our border once and for all.?\nDespite representing a state more than a thousand miles from Mexico, going to the border to record a campaign spot is likely to resonate with voters, according to Minchillo.",
    "Illegal immigration is an issue that is doing well in polls and there's no better way to show you are concerned about that issue than going to the border,? Republican admaker Vinny Minchillo, who is based in Texas, told Score.",
    "What's notable now is that candidates, mostly Republicans, are traveling to the border to make their point, going beyond stock footage to pledge in-person that they will finish former President Donald Trump's border wall.",
    "The ratings will be up later today, but here's a sneak peek for Morning Score readers from POLITICO's Steve Shepard: 20 seats are rated as Lean/Likely/Solid Republican, while only 8 seats are Lean/Likely/Solid Democratic.",
    "Ohio Republican Jane Timken, whose state is closer to Canada than Mexico, aired a Senate campaign ad last month in which she says border security is national security.? Timken is running to replace retiring Sen.",
    "Senate candidate Eric Greitens on Friday posted  then deleted  a video on social media featuring a ride along with Kansas City police that was quickly criticized as inappropriately politicizing the department.",
    "The decision has big implications for Utah's U.S. Senate race.?\nAS SEEN ON TV\n FIRST IN SCORE: North Carolina Democrat Cheri Beasley is launching a six-figure ad buy for her Senate bid today.",
    "Even some Democrats are turning on the administration over its decision to end a Trump-era border restriction next month, called Title 42, for migrants encountered at the southern border.",
    "CAMPAIGN INTEL\nSNEAK PEEK: NEW HOUSE RATINGS  POLITICO's Election Forecast is releasing ratings for Florida's new congressional districts, which were finalized last Friday, when GOP Gov.",
    "More than three-quarters of Republicans  77 percent  strongly disapprove of Biden's immigration moves, according to a POLITICO/Morning Consult poll conducted at the beginning of April.",
    "Pierce, a former child actor and serial entrepreneur, filed a statement of candidacy last fall in the race to succeed Vermont's eight-term Democratic senator, Patrick Leahy.",
    "Bad enough to ditch their own nominee and back Evan McMullin instead,? by Katie McKellar, Deseret News: The Utah Democratic Party made an extraordinary decision on Saturday.",
    "A majority of delegates decided to not put forth a Democratic candidate to face off with Republican Sen. Mike Lee and to instead back independent candidate Evan McMullin.",
    " Speaking of North Carolina, Trump-endorsed Rep. Ted Budd (R-N.C.) is up with a new 30-second Senate campaign ad featuring footage from Trump's rally in the state.",
    "The 30-second spot features Britt walking with a member of law enforcement, and references fentanyl and human trafficking before taking a shot at the president.",
    "Brian Kemp on the issue for almost half of the one-hour GOP debate Sunday night, accusing the governor of trying to bury the truth' about the 2020 election.\"",
    "Republicans running in GOP primaries are using the southern border as the setting for campaign ads  regardless of how far their home states are from Mexico.",
    "I approve this message because we must secure this border now.?\nRep. Nancy Mace (R-S.C.) recorded a campaign spot at the border between Texas and Mexico.",
    "Instead of focusing on what people care about, they get caught up in political games,? Beasley says in the ad, which is her campaign's second commercial.",
    "Follow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "Sen. Maggie Hassan (D-N.H.), one of the most vulnerable lawmakers up for reelection this fall, is facing blowback for her own border visit.",
    "SUCCESSION  California Dems are eyeing Feinstein's seat  but they're not talking about it,? by Jeremy White, POLITICO California: Sen.",
    "As the real Trump conservative, I will fight to finish this wall, secure this border and crack down on the drug cartels,? Timken says.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "As Alabama's senator, I'll fight to finish President Trump's wall, ban sanctuary cities and deport criminal illegal aliens.",
    "President Macron appears to have secured a double-digit victory over LePen, at a time when his approval rating is 36%.",
    "You'll also receive daily policy news and other intelligence you need to act on the day's biggest stories.",
    "I'm here at the border today for a reason,? Mace says in the ad, pointing to the barrier at the border.",
    "Most everyone is operating under the assumption that Feinstein will not run for reelection in 2024.",
    "The former governor's campaign didn't obtain official approval for filming, KCPD spokeswoman Capt.",
    "Ron DeSantis signed the new map into law following a months-long standoff with state legislators.",
    "Beasley's new ad highlights her background, and offers some criticism for both political parties.",
    "Joe Biden's America is woke and broke,? Budd says in the ad, which features praise from Trump.",
    "The fact that Joe Biden still hasn't been to this border is a disgrace,? Britt says in the ad.",
    "Perdue, the former senator who is Donald Trump's endorsed candidate, sparred with Gov.",
    "The most competitive seats are FL-07 and FL-15, which are rated Lean Republican.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "President Joe Biden's most unpopular policy moves are related to immigration.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "In South Carolina there's a distance and unfamiliarity with the problem.",
    "Dianne Feinstein's potential successors don't want to talk about it.",
    "Looking at Washington, I think both parties are doing the job wrong.",
    "He lacked OK to film,? by Jonathan Shorman, Kansas City Star: U.S.",
    "The paper endorsed Lori Chavez-DeRemer in the Republican primary.",
    "Mace faces Trump-endorsed Katie Arrington in the GOP primary.",
    "Check out the full map on POLITICO's Redistricting Tracker.",
    "Rob Portman (R-Ohio) in the fast-approaching GOP primary.",
    "(The ad aired before Trump endorsed Timken opponent J.D.",
    "Hmmm....?  White House Chief of Staff Ron Klain.",
    "That may make it even scarier,? Minchillo said.",
    "I want to pick somebody who's going to win.",
    "Subscribe to POLITICO Pro.",
    "Good Monday morning!",
    "Vance).",
    "Vance."
  ]
}