{
  "id": 1942,
  "mediaId": 65,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Kemp, Perdue clash in heated Georgia GOP debate",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8b9a1953-ff38-446f-b11e-2d8c1f76d971/e7f7540a-ec5e-4a81-87a1-50bc05455d77/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/kemp-perdue-clash-in-heated-georgia-gop-debate",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronn Blitzer",
  "authorUrl": "https://www.foxnews.com/person/b/ronn-blitzer",
  "termIds": [
    661,
    1147,
    1646,
    1951,
    2095,
    2230,
    4325,
    227,
    2672
  ],
  "sentences": [
    "Perdue, who is endorsed by former President Donald Trump, accused Kemp of \"suppressing information and not following up on leads,\" but Kemp stated that attorneys \"invested hundreds of hours\" looking into claims and that his office has referred matters for investigation where appropriate.",
    "RON DESANTIS SAYS IF STACEY ABRAMS WINS ELECTION IT WILL CREATE A FLORIDA-GEORGIA COLD WAR'\n\"You have a candidate that is going to attack my record, unfortunately, all night tonight, because they didn't have a record there to beat Jon Ossoff in 2020,\" Kemp said.",
    "The debate touched on a number of topics, but Perdue early and often repeated unsubstantiated claims of voter fraud in the 2020 election, claiming that Kemp did not do enough to keep it secure.",
    "He recalled taking on the Justice Department during the Obama administration in a battle over citizenship checks for voter registration, as well as court battles over the state's voter ID law.",
    "Brian Kemp and former Sen. David Perdue, R-Ga., squared off in a rancorous debate Sunday night as Perdue mounts a primary challenge against Kemp.",
    "\"Weak leaders take credit when things go well, and I tell you they blame somebody else when it doesn't,\" he said.",
    "He also noted that it is the state attorney general, not the governor, who decides whether to prosecute.",
    "The governor touted his record, which includes eight years as Georgia secretary of state.",
    "Perdue accused Kemp of making excuses for not doing more to secure the 2020 elections.",
    "\"Weak leaders blame everybody else for their own loss instead of themselves.\"",
    "Kemp then accused Perdue of blaming others for losing his Senate seat.",
    "Kemp, meanwhile, accused Perdue of making excuses for his own failure.",
    "Georgia Gov."
  ]
}