{
  "id": 1950,
  "mediaId": 136,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "David Perdue Opens Georgia Primary Debate by Declaring Election Was Stolen",
  "image": "https://d.newsweek.com/en/full/2025180/republican-gubernatorial-candidate-david-perdue-speaks.webp?w=790&f=e8043e9b8539792ba91ad2c77bf4f2e5",
  "link": "https://www.newsweek.com/david-perdue-opens-georgia-primary-debate-declaring-election-stolen-1700479",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Khaleda Rahman",
  "authorUrl": "https://www.newsweek.com/authors/khaleda-rahman",
  "termIds": [
    1147,
    1248,
    1646,
    1895,
    1951,
    2087,
    2095,
    2230,
    114,
    146,
    183,
    296,
    428,
    571,
    2672
  ],
  "sentences": [
    "\"While Brian Kemp and David Perdue bicker, display the raw bitterness of their Trump-owned party's internal war and fight each other, @staceyabrams is fighting for Georgians,\" Lauren Groh-Wargo, Abrams' campaign manager, tweeted in response to the debate.",
    "In an indication of the rhetoric that can be expected of candidates endorsed by Trump ahead of the November midterm elections, Perdue spent much of the debate rehashing the former president's debunked claims about the 2020 election.",
    "The midterm elections will serve as a test of Trump's enduring influence on Republican voters as he has backed a number of candidates across the country who support his false claims of the 2020 election being stolen from him.",
    "Perdue has continued to trail behind Kemp in the polls despite Trump's backing and frequent attacks on the incumbent governor, a sign that the former president's endorsement may not carry the same weight it once did.",
    "Perdue blasted Kemp, echoing Trump's claims about the governor's refusal to call a special session of the state legislature to name a new set of Republican electors to cast the state's Electoral College votes.",
    "\"I was Secretary of State for eight years and I don't need to be lectured by someone that lost their last election about what our voting laws are and who has responsibilities for those in our state,\" he said.",
    "Perduewho was defeated in a Senate runoff by Democrat Jon Ossoff in January 2021went on to blame inflation, illegal immigration, rising gas prices and the U.S. being on \"the brink of war\" on Kemp.",
    "During the debate, Kemp repeatedly touted Perdue's loss to Ossoff as he sought to paint himself as the stronger candidate to defeat Stacey Abrams, the presumptive Democratic nominee.",
    "\"All the madness we see from the Biden administration... all that started here in Georgia when our governor caved and allowed radical Democrats to steal our election,\" he said.",
    "Trump recruited Perdue to challenge Kemp as retribution for the governor for refusing to go along with his demands to overturn Georgia's result in the election.",
    "Federal and state election officials as well as Trump's own attorney general said there was no evidence the election was rife with widespread fraud.",
    "\"First off, folks, let me be very clear tonight, the election in 2020 was rigged and stolen,\" Perdue began his opening statement.",
    "\"That's why we passed the strongest election integrity act in the country, because a lot of things were done by other people.\"",
    "Brian Kemp in the Republican primary, opened Sunday night's debate by declaring the 2020 election was \"stolen.\"",
    "David Perdue, the Donald Trump-backed former senator challenging Georgia Gov.",
    "However, Kemp didn't say that he thought the 2020 election had been fair.",
    "The Kemp and Perdue campaigns have been contacted for further comment.",
    "Trump's spokesperson has also been contacted for comment.",
    "\"Look, I was as frustrated as anybody else,\" Kemp said.",
    "Trump's allegations were also rejected by the courts.",
    "Kemp hit back that he had followed the law."
  ]
}