{
  "id": 1957,
  "mediaId": 195,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Georgia gubernatorial debate spotlights divide over 2020 election",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/kempbrian_perduedavid_split_getty-ap_georgia-campaign.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3461835-georgia-gubernatorial-debate-spotlights-divide-over-2020-election/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Monique Beals",
  "authorUrl": "https://thehill.com/author/monique-beals/",
  "termIds": [
    1147,
    1646,
    1951,
    2087,
    2095,
    571,
    2672
  ],
  "sentences": [
    "Both candidates also took aim at Democratic gubernatorial candidate Stacey Abrams, who lost to Kemp in 2018.\nI want to promise you this tonight if you will nominate me as your Republican nominee, I will work every single dayto make sure that Stacey Abrams is never your governor, or your next president,? Kemp said in his opening statement.",
    "But the point is a special session would have done nothing to solve this problem.?\nFulton County District Attorney Fani Willis (D) is investigating whether Trump's alleged push to overturn Georgia's election results was criminal, and said she will begin taking testimony after the primaries to avoid claims of political interference.",
    "Perdue invoked Abrams during discussion of education in the state, saying that Georgia schools with Stacey Abrams help? are teaching kids that voter ID is racist.?\nNow, that's just improper in my mind, I call that indoctrination,? he added, sounding a popular note among GOP candidates ahead of the midterms.",
    "Trump pressed Kemp at the time to call for a special session of the special session of the Georgia state legislature to overturn President Biden's win in the election, however Kemp instead certified the results following a recount.",
    "All that started right here in Georgia when our governor caved and allowed radical Democrats to steal our election, and because of that, he has divided our party and cannot win,? the Trump-endorsed candidate added.",
    "Georgia's primary elections are are scheduled for May 24, with the winner of the GOP gubernatorial primary set to face Abrams in the general election in November.",
    "The only reason I'm not in the United States Senate is because you caved in and gave the election to  liberal Democrats,? Perdue told Kemp during Sunday's debate.",
    "The false claims about the 2020 presidential election have taken center stage in Georgia's midterms, as Trump lost by less than 12,000 votes in the state.",
    "Brian Kemp (R) sparred on Sunday over the 2020 election in the first of three scheduled debates for Georgia's GOP gubernatorial primary.",
    "Kemp and Purdue also traded bards over other election-related issues on Sunday, including Perdue's 2020 loss to Democrat Jon Ossoff.",
    "I've always said there's fraud in every election, and when I was secretary of state, I went after it,? Kemp said on Sunday.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The election in 2020 was rigged and stolen,? Perdue said in the first words of his opening statement on Sunday night.",
    "Weak leaders blame everybody else for their own loss instead of themselves,? Kemp responded.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Look, I was as frustrated as anybody else,? he added.",
    "I didn't say there wasn't problems in this election.",
    "First off, folks, let me be very clear tonight.",
    "Former Sen. David Perdue (R-Ga.) and Gov."
  ]
}