{
  "id": 1961,
  "mediaId": 43,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "If elections are about the future, Georgia's gubernatorial race suggests Republicans are screwed",
  "image": "https://images.dailykos.com/images/1062680/story_image/AP22086150958691.jpg?1650912523",
  "link": "https://www.dailykos.com/story/2022/4/25/2093963/-With-Trump-s-2020-lie-dominating-Georgia-GOP-hopefuls-don-t-have-time-for-voters-2022-concerns",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1862,
    1951,
    2087,
    2095,
    2230,
    428,
    2555,
    2672
  ],
  "sentences": [
    "Perdue said Democratic control of the federal government resulted because Kemp caved? and allowed radical Democrats to steal our elections.?\nIn fact, numerous investigations and multiple recounts all concluded that Joe Biden was the rightful 2020 winner, as were Democratic Senate candidates Jon Ossoff and Rev.",
    "Kemp retorted, Weak leaders blame everybody else for their own loss instead of themselves.?\nKemp, who is comfortably ahead in the polls and has vastly outraised Perdue, also sought to focus some of his energy on Democrat Stacey Abrams, who will face off against whichever Republican prevails in the primary.",
    "And if we want to protect our freedom and our values, we have to vote and we have to make sure that Stacey is never our governor.?\nOn that point, the candidates agreedmaking sure Abrams would \"never\" become Georgia's governor or \"your next president,\" as Kemp put it.",
    "But Perdue's opening salvo kicked off nearly 25 minutes of bare-knuckle brawling between the two GOP rivals over who bore responsibility for the historic losses last cycle of both Donald Trump and the two incumbent Republican senatorsone of whom was Perdue.",
    "Daily Kos' The Brief\nFollowShare\n0:001:02:00\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nBut Kemp, who spent hours on Perdue's bus campaigning for his reelection, blasted Perdue for failing to ever ask for a special session.",
    "Listen to Jennifer Fernandez Ancona from Way to Win explain how Democrats must message to win on Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "According to the Atlanta Journal-Constitution, the very first ad that aired on WSB following the hour-long GOP slugfest was an Abrams spot featuring her small business with her conservative entrepreneur partner.",
    "When former Sen. David Perdue of Georgia had his chance at Sunday night's debate to make an opening argument for his 2022 gubernatorial bid, he bypassed offering Peach State voters a vision for the future.",
    "Kemp will likely prevail in the GOP primary, and a deflated MAGA base is exactly the type of boost that could help Democrats Abrams and Sen. Warnock prevail in the general election.",
    "Georgia Democrats also got in on the action, tweeting out video of the two Republicans bickering and saying they had shown \"they are bad for each other  and worse for Georgia.\"",
    "Having a Democratic governor in place to blunt the GOP-dominated state legislature could literally be the difference between a Democratic White House and a Republican one.",
    "You have a candidate that is going to attack my record, unfortunately, all night tonight, because they didn't have a record there to beat Jon Ossoff in 2020,? he said.",
    "Not only do GOP hopes of retaking the U.S. Senate majority increasingly run through Georgia, it will also be a pivotal battleground in the 2024 presidential election.",
    "Perdue pummeled Kemp for failing to call a special session to overturn the election following Trump's loss and claimed he had asked the governor to do so repeatedly.",
    "And frankly, nothing could be better for Democrats than Perdue's fixation on 2020 and the notion that Kemp betrayed Trump and, by extension, his MAGA base.",
    "GOP gubernatorial candidate David Perdue speaks during a Donald Trump rally at Banks County Dragway in Commerce, Georgia, on Saturday, March 26, 2022.",
    "pic.twitter.com/RJ2kIKB1li\n Georgia Democrats (@GeorgiaDemocrat) April 25, 2022\nGeorgia is quickly turning into the most crucial of swing states.",
    "First off, let me be very clear tonight, the election in 2020 was rigged and stolen,? Perdue began his second debate with sitting GOP Gov.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "In that matchup, Perdue added, he had secured Trump's endorsement for Kemp, who no longer enjoys Trump's backing now.",
    "Kemp said Perdue's loss against Ossoff was proof positive that he wasn't up to the task of defeating Abrams.",
    "But if there's was one person in Georgia who thought the entire spectacle was simply peachy, it was Abrams.",
    "x\nIn #GaGovDebate, Brian Kemp and David Perdue showed they are bad for each other  and worse for Georgia.",
    "But Perdue said Kemp \"barely beat Stacey Abrams in '18,\" after Kemp eked out a victory by a 1.4% margin.",
    "But both GOP candidates offered disparaging views of why their rival would fumble a matchup with Abrams.",
    "\"Looking in the rearview mirror,\" Kemp said, isn't the key to defeating Abrams in the general election.",
    "Perdue offered, Weak leaders take credit when things go well, and blame someone else when it doesn't.\"",
    "This portion of the debate, centered entirely on 2020, included a series of barbs and recriminations.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n61.",
    "Folks, he never asked me,\" Kemp told the audience.",
    "The more Kemp nauseates Trumpers, the better.",
    "\"He has divided us,\" Perdue charged of Kemp.",
    "Kemp also turned Perdue's loss back on him.",
    "He will not be able to beat Stacey Abrams.",
    "Brian Kemp, carried by Atlanta's WSB-TV.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "(It was a hot peachy mess.)",
    "Want to keep it that way?",
    "Democrats and messaging.\"",
    "Daily Kos is different.",
    "Can it be solved?",
    "Raphael Warnock.",
    "Please read it.",
    "Sigh."
  ]
}