{
  "id": 1963,
  "mediaId": 19,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Kemp, Perdue Exchange Fiery Insults over 2020 at First Georgia Governor's Debate",
  "image": "https://media.breitbart.com/media/2022/04/AP22115061957308-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/25/kemp-perdue-exchange-fiery-insults-over-2020-at-first-georgia-governors-debate/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1646,
    1951,
    2087,
    2095,
    2230,
    256,
    428,
    2672,
    2900
  ],
  "sentences": [
    "Kemp spokesman Cody Hall said, While former Senator Perdue spent an hour telling hollow lies about the Governor's record, Governor Kemp remained laser focused on reminding Georgians how he has delivered on his promises since taking office.?\nPerdue spokeswoman Jenni Sweat said, Tonight, David Perdue clearly demonstrated that Brian Kemp is a weak Governor who divided our party and cannot win in November,? adding that a clear difference? between the two candidates is that Kemp believes Joe Biden won the election fair and square? whereas Perdue is a bold leader who will make waves and knock heads if that's what it takes to get things done, and tonight he held Governor Kemp accountable for his numerous failures.?\nThe debate comes as Perdue trails Kemp in fundraising and in most polls by roughly ten points.",
    "The Republican Party suffered stunning losses in Georgia in 2020 after now-President Joe Biden defeated Trump by the slimmest margin of any state  about 12,000 votes out of nearly five million cast, after two recounts  and Democrats Ossoff and now-Sen. Raphael Warnock both prevailed in barnburner runoff races shortly thereafter.",
    " You never asked me about a dang consent decree that I had nothing to do with.?\nPerdue had initially launched his gubernatorial campaign with a heavy focus on 2020, but has since expanded his platform to focus on economic issues like the multibillion-dollar Rivian plant deal and crime issues like the Buckhead cityhood debate.",
    "It's somebody else's fault when it doesn't go right.?\nKemp also accused Perdue of leveling politically expedient? charges about the election after he said Perdue made no such charges during his runoff campaign, which took place in the two months after the November election.",
    "Kemp maintains that the state constitution has a clear delineation of powers and that the election process and subsequent investigations into it are to be led by the secretary of state, while election-related prosecutions are to be handled by the attorney general.",
    "Perdue accused Kemp of refusing to investigate claims of voter fraud, denounced a court agreement  commonly referred to as a consent decree?  signed in March 2020, and said Kemp should have called a special legislative session after the presidential election.",
    "Perdue, who has been endorsed by former President Donald Trump in his election bid, charged in his opening statement in no uncertain terms that the election in 2020 was rigged and stolen? and that Kemp allowed the alleged election theft to occur.",
    "Perdue and Trump, who has endorsed seven candidates in Georgia in his mission to unseat Kemp and Kemp allies, characterize Kemp as having caved? on election proceedings to Democrats, namely Georgia Democrat gubernatorial candidate Stacey Abrams.",
    "Kemp fired back, I'm not gonna let you call me corrupt like you let Jon Ossoff call you corrupt, and your record and what you're saying is completely false.?\nLots of fireworks during the Kemp-Perdue #WSBDebate: \"The only one lying here is you.",
    "Kemp has faced more than a year's worth of criticism, primarily led by Trump, that he was complacent in 2020 as changes were made to the voting process because of surges in coronavirus cases and pressure from Democrats.",
    "That's a fact.? WATCH LIVE: https://t.co/dYPfNgqZyr pic.twitter.com/xOwFIy1FaZ\n WSB-TV (@wsbtv) April 24, 2022\nKemp repeatedly referenced Perdue's narrow loss to now-Sen. Jon Ossoff in January 2021.",
    "Brian Kemp and former Sen. David Perdue met on the Republican gubernatorial primary debate stage Sunday evening for the first time in what became a bitter clash over Georgia's 2020 election process.",
    "You said after it was politically expedient, Perdue, that you wanted a special session after your campaign chief of staff told us you didn't, so you're flip-flopping on the issue,? Kemp said.",
    "The first half of the hour-long debate, hosted by WSB-TV, focused mainly on the last election, which Perdue has made a central focus of his campaign to unseat Kemp.",
    "Monday marks the final day Georgians can register to vote in the May 24 primary, and early voting for the race begins in one week.",
    "While those issues were broached later Sunday evening, they were largely overshadowed by the heated exchanges over 2020.",
    "If he were a Democrat, even his strongest supporters would be calling this a gross, corrupt coverup,? Perdue said.",
    "Weak leaders blame everybody else for their own loss instead of themselves,? Kemp said of Perdue.",
    "Kemp repeated this in the debate, to which Perdue replied, You know that's what politicians do.",
    "Following the debate, both candidates declared victory in competing statements to the press.",
    "I was on the campaign with him on the bus, I don't know how many times, how many events.",
    "Folks, he never asked me.",
    "Gov."
  ]
}