{
  "id": 1974,
  "mediaId": 238,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Democrats' last, best chance to legislate before the midterms starts now",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/25/democrats-last-best-chance-legislate-before-midterms-starts-now/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    963,
    963,
    1341,
    1341,
    571,
    571,
    545,
    545,
    146,
    146,
    2744,
    2744,
    2945,
    2945,
    2942,
    2942,
    2888,
    2888
  ],
  "sentences": [
    "They informed [Ukrainian President Volodymyr] Zelensky of new military aid and the administration's intent to resume diplomatic operations in Ukraine this week, marking the return of U.S. diplomats for the first time since Russia's Feb. 24 invasion.?\n\"The officials also brought with them promises of additional security aid, including more than $300 million in military financing for Ukraine, allowing it to buy more sophisticated air defense systems and stockpile arms compatible with those used by NATO nations instead of Soviet-designed weapons.",
    "Former New York congressman Steve Israel, who led the Democratic Congressional Campaign Committee for two cycles, said Democrats need to pass bills addressing issues that midterm voters care about: the cost of gas and groceries, and in some districts, crime.?\nI've talked with dozens of congressional Democrats and they're well aware of the mood out there, so I expect you'll be seeing an aggressive legislative agenda that gives candidates the message contrasts they need to prosecute their campaigns,? Israel wrote in an email to the Early.",
    "But Sen. Tina Smith (D-Minn.) told Tony that she has been in conversations in which lawmakers acknowledge they have far less time than it appears, and they need instead to broker a deal around Memorial Day, which marks the end of the upcoming work period.?\nRep. Tom O'Halleran (D-Ariz.), who is perhaps the most endangered House Democrat after redistricting made his rural seat more Republican, said he'd like to see $150 million in housing funds included in the bill to combat soaring home prices and mortgage rates.",
    "Israel, the former DCCC chair, said the bill  which hasn't been introduced yet  is important not only because it will be felt by voters, but because voting against it is a perfect 30-second ad for Democrats.?\nCollins and Shaheen have been soliciting feedback on the bill and are looking forward to finalizing it once Congress returns, according to a Shaheen aide.",
    "Brian Kemp and his primary challenger, former senator David Perdue, faced off in their first debate  but first \nLawmakers return to Washington this week after a two-week recess, with Democrats preparing for a major push in the coming months to move legislation before the midterms consume Congress' attention starting in August.",
    "Perdue, who has the endorsement of former president Donald Trump, blamed Kemp for handing control of Washington to Democrats.?\nThe only reason I'm not in the United States Senate is because you caved in and gave the elections to Stacey (Abrams) and the liberal Democrats in 2020,? Perdue said.",
    "\"The new pledge brings the amount the Biden administration has given Ukraine in security assistance since the beginning of the war to about $3.7 billion.?\nAlso happening this week: The Biden administration will name Bridget Brink as the next ambassador to Ukraine.",
    "And Rep. Chrissy Houlahan (D-Pa.), who represents a Democratic-leaning district in the Philadelphia suburbs that could be in play in a strong Republican year, said she'd like to see prescription drug pricing and child care measures include in the bill.",
    "g: Secretary of State Antony Blinken and Defense Secretary Lloyd Austin, on the heels of a trip to Kyiv, pledged ongoing American support to Ukraine as it faces the prospect of a protracted war against Russia,? our colleague Missy Ryan reports.",
    "With Democrats' control of both chambers at risk, lawmakers are rushing to pass bills that they can run on in November, and Democratic senators working to confirm President Biden's nominees while their fragile majority holds.",
    "Senate Majority Leader Chuck Schumer (N.Y.) will also move to confirm Alvaro Bedoya to the Federal Trade Commission as soon as this week, which would give Democrats a 3-2 majority for the first time since Biden took office.",
    "Rep. Dan Kildee (D-Mich.), one of the House Democrats on the conference committee, told the Early that passing the bill ahead of the midterms was a top priority in the manufacturing-heavy swing district he represents.",
    "Brian Kemp and his Republican challenger, former U.S. Sen. David Perdue, met in the first debate of the Georgia gubernatorial race Sunday night,? the Atlanta Journal-Constitution's Shannon McCaffrey writes.",
    "Senate Republicans are holding up the bill because Democrats won't commit to holding a vote on an amendment to block the administration's planned rollback of pandemic immigration restrictions.",
    "But it sends a message of confidence that we are going to make stuff in America.?\nThe multitrillion-dollar domestic policy bill that Democrats labored for months last year to pass is dead.",
    "The Senate, meanwhile, will vote as soon as this week to confirm Federal Reserve Chair Jerome Powell  who Biden nominated in November to another term  and three other Fed board nominees.",
    "and Schumer introduced a version of it a year ago: the Endless Frontier Act, the United States Innovation and Competition Act, the COMPETES Act, the Bipartisan Innovation Act.",
    "In today's edition  The United States will resume diplomatic operations in Ukraine this week for the first time since Russia's invasion began in February  Georgia Gov.",
    "The most immediate challenge for lawmakers is defusing a standoff over a $10 billion covid relief package that the White House has pleaded with Congress to approve.",
    "Lagging in the polls, Perdue appealed to his base, hammering away at the 2020 election, which he called rigged and stolen'  despite no evidence to back that claim.",
    "The next step in the process is for the Senate to appoint senators to conference committee to hash out the differences, which could happen as early as this week.",
    "The House is set to take up three bills this week meant to help small businesses  each of them sponsored by lawmakers facing tough reelection fights this fall.",
    "About $400 million more goes to help other countries purchase new weapons to boost their stocks or, in some cases, replenish arms provided to Ukraine.",
    "It doesn't necessarily resolve some of the short-term challenges that we see right in front of us right now, like the chips shortage,? Kildee said.",
    "But the idea behind it remains the same: to bolster American manufacturing, strengthen supply chains and help the U.S. compete with China.",
    "Susan Collins (R-Maine) Jeanne Shaheen (D-N.H.) and Reps. Diana DeGette (D-Colo.) and Tom Reed (R-N.Y.)  are at risk in the midterms.",
    "Lawmakers will also consider a Ukraine bill and domestic terrorism legislation this week, House Majority Leader Steny H. Hoyer (Md.)",
    "(Collins and Shaheen aren't up for reelection this year, DeGette represents a deep-blue district and Reed is retiring.)",
    "Kemp fired back: Weak leaders blame everybody else for their own loss instead of themselves.?\nWhat we're reading:",
    "Democrats are trying to finish work on a new version of the bill by July 4, our colleague Tony Romm reports.",
    "But the party is still working on a more modest version that Sen. Joe Manchin (D-W.Va.) can support.",
    "None of the lawmakers spearheading legislation to lower the cost of insulin  Sens.",
    "But she said she realized not everything will make it into a compromise bill.",
    "Lawmakers are trying to reconcile the House and Senate version of the bill.",
    "But that doesn't mean Democrats aren't interested in running on it.",
    "This bill has gone by many names since Sen. Todd Young (R-Ind.)",
    "About last night: The punches came fast and furious as Gov.",
    "told colleagues on Friday."
  ]
}