{
  "id": 1975,
  "mediaId": 157,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump is facing humiliation as his effort to dethrone Brian Kemp 'fizzles out in embarrassment': report",
  "image": "https://www.rawstory.com/media-library/brian-kemp-and-david-perdue.jpg?id=28606489&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-kemp-perdue-georgia/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2095
  ],
  "sentences": [
    "\"For one, it shows that even the most devoted Republicans simply aren't making decisions based on Trump's endorsements or his fixation on the 2020 electiona potential boon to Republican leaders who have been urging candidates nationwide to focus on Democrats' handling of the economy and COVID instead.\"",
    "Brian Kemp for refusing to overturn the 2020 election in Georgia could set the former president up for humiliation as former Sen. David Perdue's campaign fails to gain traction, according to a new analysis.",
    "\"If Kemp successfully vanquishes Perdue, the win might have implications that extend far beyond this spring's primary, which has become a litmus test for the future of the GOP,\" Brody explained.",
    "Perdue blamed Kemp for his and Trump's lossesand Kemp called him 'weak' for trying to avoid accountability for his humiliating loss,\" Daily Beast congressional correspondent Sam Brodey wrote.",
    "Trump has threatened his MAGA base will sit out the midterms if his candidate loses the primary, meaning a victory by Kemp could strategically position Democrat Stacey Abrams for victory.",
    "Brodey noted there has not been a single poll showing Perdue leading Kemp, even though Trump held a rally with Perdue in March and also campaigned against Kemp at a rally in September.",
    "\"What wasn't expected, however, is what Kemp carefully alluded to in Louisville: the possibility that Perdue's much-hyped challenge fizzles out in embarrassment.\"",
    "That much was clear at a debate between the two men on Sunday night, which ended up being a bare-knuckled brawl over the 2020 election.",
    "\"Now, as the May 24 primary draws near, this Republican battle royale has turned out to be as bitterly personal as expected.",
    "Trump has worried of a \"humiliating experience\" if Kemp wins the primary.",
    "Donald Trump's efforts to punish Gov."
  ]
}