{
  "id": 1992,
  "mediaId": 238,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Rep. Greene declines to say if interfering with electoral count makes one an enemy of the Constitution'",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/21/rep-marjorie-taylor-greene-expected-testify-about-jan-6/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    883,
    883,
    1616,
    1616,
    1577,
    1577,
    562,
    562,
    2555,
    2555,
    2672,
    2672
  ],
  "sentences": [
    "Brian Kemp and Secretary of State Brad Raffensperger  both Republicans  for allowing a horrible thing to happen to a very popular Republican.? Trump lamented that Greene, one of his closest allies in Congress, is now going through hell in their attempt to unseat her, just more of an election mess in Georgia.?\nSince his 2020 loss in the state, Trump has aggressively spread baseless accusations about the state's election systems and lambasted GOP lawmakers who did not acquiesce to his false claims.",
    "In an interview, Fein said the case could also set a national precedent for other members of Congress and officials who broke their oath and helped the insurrection, and including, if he chooses to run again in 2024, the former president, Donald Trump.?\nThey want to talk about the big lie?' This is the big lie,' and they're destroying democracy,? Greene said of the case during an interview Tuesday with One America News.",
    "pic.twitter.com/rXQf8fW9f9\nIn his opening statement, Ron Fein, Free Speech for People's legal director, said that this was not the type of insurrection where the leaders were standing in Richmond, Virginia, giving long-winded speeches.?\nRather, the leaders of this insurrection, of whom there were a number, were among us  on Facebook, Twitter and corners of social media that would make your stomach hurt.",
    "ATLANTA  Rep. Marjorie Taylor Greene (R-Ga.) on Friday declined to say whether unlawfully interfering with the counting of electoral votes in a presidential election would make someone an enemy of the Constitution,? as she testified about her role in the Jan. 6, 2021, attack on the U.S. Capitol as part of a case seeking to disqualify from her from seeking reelection.",
    "Greene's lawyer, James Bopp Jr., argued that Free Speech for People wants to deny the right to vote to the thousands of people in the 14th District of Georgia by having Greene removed from the ballot.?\nVoters have a right to vote for the candidate of their choice unless there is very compelling legal  not rhetorical  justification for that,? Bopp said.",
    "She has previously visited the Washington, D.C., jail where some of those charged are being held and has described them as patriots.?\nGreene also said during Friday's hearing that she believed Joe Biden had lost the 2020 election to President Donald Trump but claimed it was not accurate? that she wanted Congress not to certify Biden as the winner.",
    "The reform group alleges that Greene, who has become a lightning rod for controversy and has gained a reputation as one of the Republican Party's most hard-right members, helped facilitate the ransacking of the Capitol in an attempt to stop the certification of Joe Biden's presidential win.",
    "In the days before the Jan. 6 attack, Greene said, We aren't going to let this election be stolen by Joe Biden and the Democrats.? She was among the 147 Republicans who voted in support of at least one objection to counting Biden's electoral votes.",
    "The first, Indiana University constitutional law professor Gerard Magliocca, has written extensively about congressional amnesty and the 14th Amendment, which bars those who have engaged in insurrection or rebellion? from federal office.",
    "U.S. District Judge Amy Totenberg ruled Monday that the case could proceed, a ruling that stands in contrast to other lawsuits against members of Congress over their alleged roles in the Jan. 6 attack.",
    "And he argued that the 14th Amendment was meant to bar any direct, overt act of insurrection to overthrow the United States government,? such as the Confederacy marshaling troops.",
    "As she entered the hearing room at the Georgia Office of State Administrative Hearings on Friday morning, Greene was greeted with cheers and applause from some in the audience.",
    "Good morning from the Georgia Office of State Administrstive Hearings, where @RepMTG will testify for the first time about her role in the Jan 6 Capitol attack.",
    "The case against Greene was brought by Free Speech for People, a campaign-finance reform organization, on behalf of a group of voters from Greene's district.",
    "Greene noted that breaking the law is unlawful? and that more than 700 people have been charged with various crimes in connection with the Jan. 6 attack.",
    "Free Speech for People levied a similar case against Rep. Madison Cawthorn (R-N.C.), but he successfully sued in federal court to block the proceedings.",
    "The congresswoman has criticized the fact that media outlets will be allowed to attend the proceedings Friday in front of an administrative law judge.",
    "Greene tried to block the trial from proceeding by asking for an injunction and a temporary restraining order, but Totenberg rejected the request.",
    "He accused Free Speech for People of trying to hold against [Greene] First Amendment-protected speech? for her comments about the Jan. 6 attack.",
    "That prompted one of the plaintiffs' lawyers to declare at one point, You have a standing objection, Mr. Bopp, to everything in the world.?",
    "I don't know if it defines it that way,? Greene said in response to questioning by a lawyer representing the plaintiffs in the case.",
    "Throughout the hearing, Bopp repeatedly interrupted to lodge objections against the plaintiffs' questioning.",
    "The organization has also filed lawsuits against Reps. Paul A. Gosar and Andy Biggs, both of Arizona.",
    "Greene's fellow House member, Rep. Matt Gaetz (R-Fla.), was present for the hearing as well.",
    "There is no evidence that widespread voter fraud took place in the 2020 presidential race.",
    "Trump weighed in on the case Thursday afternoon in a statement criticizing Georgia Gov.",
    "The evidence will show that Marjorie Taylor Greene was one of them,? Fein said.",
    "Trump has endorsed primary challengers to both Kemp and Raffensperger.",
    "It's a packed court room, like Easter Sunday,? the judge remarked.",
    "Free Speech for People called two witnesses.",
    "She just received cheers entering the room.",
    "I don't know."
  ]
}