{
  "id": 1996,
  "mediaId": 237,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Trump's JD Vance gamble in Ohio",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/0021c24/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F03%2F89%2Fd4ca1e164adaac0b1abd8d6afd0e%2Fwb.campaign.jpg",
  "link": "https://www.washingtonexaminer.com/politics/trumps-jd-vance-gamble-in-ohio",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "W. James Antle III",
  "authorUrl": "",
  "termIds": [
    2524,
    2524,
    2027,
    2027,
    1801,
    1801,
    2129,
    2129,
    946,
    946,
    1147,
    1115,
    1115,
    1054,
    1054,
    1147,
    571,
    571,
    2845,
    2845
  ],
  "sentences": [
    "More senators who are beholden to him could come in handy when getting nominees confirmed, passing legislation, surviving impeachment trials, and loosening the grip of the former president's most powerful intraparty rival  Senate Republican leader Mitch McConnell.",
    "This caused him to undermine an ideologically aligned candidate he could have helped, former Attorney General Jeff Sessions, by endorsing former Auburn football coach (now the state's junior senator) Tommy Tuberville instead.",
    "Vance has run on a full-throated platform of populism and national conservatism, suggesting that Americans dying from fentanyl should get more attention than the Russian invasion of Ukraine.",
    "Vance leapfrogging businessman Mike Gibbons to move into second place among likely voters but still behind Josh Mandel, the Hillybilly Elegy author was headed for a humiliating defeat.",
    "Yet if Vance or Oz wins, Trump can far more plausibly claim to have helped pull them across the finish line than any of the entrenched incumbents running against marginal challengers.",
    "Unlike Mehmet Oz, the Trump-endorsed candidate for Senate in Pennsylvania, Vance is a favorite of the MAGA smart set, typified by billionaire and GOP megadonor Peter Thiel.",
    "That puts him ahead of state Sen. Matt Dolan and former Ohio GOP chairwoman Jane Timken but behind former state Treasurer Josh Mandel and businessman Mike Gibbons.",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said in his endorsing statement.",
    "Brian Kemp is still leading over Trump-endorsed former Sen. David Perdue, and South Carolina Rep. Nancy Mace remains ahead of Trump-endorsed Katie Arrington.",
    "In doing so, he might also devalue his endorsement when other Republicans are weighing whether they might run for president regardless of his 2024 decision.",
    "If Vance wins, he gets to brag about his turnaround from being a harsh Trump critic to taking the wheel of the MAGA bus heading into the November elections.",
    "In addition to backing incumbents and clear-cut front-runners often, he wades into primaries in which he has a political grievance against a candidate.",
    "The public polling has been sporadic and all over the place, but the RealClearPolitics average has Vance squarely in the middle of the pack at 14%.",
    "So, we won't rate Vance's campaign as a sinking ship, but it's still all hands on deck as the iceberg comes into view with primary day a week away.",
    "But the Trump-off could work: Trafalgar's mid-April poll had Mandel in first place with 28%, Vance in second at 23%, and Gibbons sinking to third.",
    "Arrington was defeated in November after Trump helped her beat Sanford, putting a reliably red district in the Democratic column for two years.",
    "\"All 33 Trump-endorsed candidates won last night in Texas, or are substantially leading,\" he said after the Lone Star State's primaries.",
    "Just In...\nFormer President Donald Trump finally took the plunge into the Ohio Republican primary to potentially succeed retiring Sen.",
    "For Trump, it provides validation that his endorsement means something significant, and he won't let people forget it.",
    "In both cases, Republicans have reason to fear the Trump-backed candidate is less likely to win the general election.",
    "In this race, Ohio Republicans tried to dissuade Trump from endorsing Vance because of his past anti-Trump comments.",
    "He has contributed to the defeat or hastened the retirement of some of his most prominent critics inside the party.",
    "Trump's endorsement could be a significant test of his continuing influence over the Republican primary electorate.",
    "Still, the good news for Vance is that he has received a coveted endorsement from former President Donald Trump.",
    "Mandel had also been vying for Trump's endorsement and serving up generous portions of red meat for the base.",
    "Trafalgar's poll, conducted before Trump's endorsement, shows undecided voters at 13%, a significant number.",
    "But Vance wasn't the clear-cut favorite of Buckeye State primary voters at the time of Trump's endorsement.",
    "Mike DeWine, surged past them after blanketing the airwaves with millions of dollars in self-funded ads.",
    "The question is, how many of those will go to Vance now that the BMOC has given him the nod?",
    "Rob Portman, throwing his weight behind Hillbilly Elegy author and venture capitalist J.D.",
    "Four of the 10 House Republicans who voted for Trump's second impeachment have retired.",
    "But Trump pads his success rate by endorsing many incumbents already well ahead.",
    "Gibbons, a conventional Midwestern Republican in the mold of Portman and Gov.",
    "He is spending political capital on behalf of a candidate who could lose.",
    "This would also be helpful to Trump if he plans to return to Washington.",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "The cerebral Vance has joined him in aping Trump's Twitter pugilism.",
    "Trump followed up by featuring Vance as a speaker at an Ohio rally.",
    "Does Trump want to look like he has less juice than [Florida Gov.]",
    "Not So Fast\nBefore a recent Trafalgar Group poll showing J.D.",
    "Former Rep. Mark Sanford lost due to an Election Day tweet.",
    "Donald Trump Jr. has also campaigned for the candidate.",
    "Ron DeSantis?? a Republican strategist in Ohio asked.",
    "He hasn't gotten out of the path of the iceberg yet.",
    "Twenty-five of the 33 candidates were incumbents.",
    "There have also been exceptions in the past.",
    "Trump's primary endorsement record is mixed.",
    "Trump's endorsement strategy is also mixed.",
    "How will the Fake News make it look bad?\"",
    "It's a big deal for all those involved.",
    "For Trump, this is a gamble.",
    "\"Like some others, J.D.",
    "It didn't work.",
    "Sinking Ship?",
    "Georgia Gov.",
    "\"Big night!",
    "Vance."
  ]
}