{
  "id": 2009,
  "mediaId": 33,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Fact check: New David Perdue TV ad tells two election lies at once",
  "image": "https://www.cnn.com/media/sites/cnn/video-placeholder.svg",
  "link": "https://www.cnn.com/2022/04/21/politics/fact-check-david-perdue-2020-election-brian-kemp/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Dale",
  "authorUrl": "https://www.cnn.com/profiles/daniel-dale",
  "termIds": [
    1147,
    1646,
    2087,
    2095,
    2230,
    4325,
    428,
    571,
    2672
  ],
  "sentences": [
    "Asked about the Perdue ad on Thursday, Kemp campaign spokesperson Cody Hall said in an email that Perdue has a pitiful lack of self awareness and refusal to acknowledge reality.? Hall said that if anyone is responsible for the last year of disastrous consequences brought on by total Democrat control in Washington DC, it's the guy who lost his Senate seat to Jon Ossoff.? Ossoff, a Democrat, defeated then-incumbent Perdue in a January 2021 runoff, winning Democrats control of the Senate.",
    "During the past year, Perdue has joined Trump in using falsehoods to attack Kemp over a 2020 legal settlement between Georgia's Republican secretary of state and Democratic entities over the process of giving voters a chance to fix problems with their absentee ballots  though Kemp wasn't a part of that settlement.",
    "In the ad, which he also tweeted out on Thursday, Perdue paints a negative picture of the state of the country under President Joe Biden, then says, Folks, that all started right here when Brian Kemp sold us out and allowed radicals to steal the election.? Perdue adds moments later: Enough is enough.",
    "Before Trump held a rally in support of Perdue's candidacy in late March, Perdue claimed in a radio interview that both the presidential election and his election against Ossoff were stolen.? Perdue, like Trump, was defeated fair and square.",
    "Now, trailing in public polls with advance in-person voting fast approaching, Perdue is further deepening his commitment to 2020-related dishonesty  releasing a television ad in which he tells two election lies at once.",
    "Months of false Perdue claims\nTrump has endorsed and vigorously supported Perdue in an attempt to get back at Kemp for refusing to help him overturn his Georgia defeat in 2020.",
    "Biden legitimately defeated former President Donald Trump, earning 306 electoral votes to Trump's 232 (and more than 7 million more votes than Trump earned).",
    "Perdue has also attacked Kemp for failing to investigate a group of ballots Perdue wrongly made to sound suspicious by citing an inaccurate statistic.",
    "There is no evidence, in Georgia or any other state, of voting fraud even close to widespread enough to have changed the outcome.",
    "Kemp formalized Biden's Georgia victory in November 2020, noting that state law required the governor to do so.",
    "CNN \nDavid Perdue, the Republican former US senator from Georgia, is trying to unseat incumbent Republican Gov.",
    "I'll make sure our elections are never stolen again.?\nFacts First: The 2020 election was not stolen.",
    "Perdue even filed a lawsuit that included baseless conspiracy theories about the 2020 election.",
    "A Perdue spokesperson did not immediately respond Thursday to a CNN request for an explanation.",
    "Perdue did not explain in the ad how Kemp supposedly allowed people to steal the election.",
    "Brian Kemp with a primary campaign heavy on false claims about the 2020 election.",
    "Perdue's false election rhetoric has been especially explicit in the last month.",
    "Biden won Georgia by 11,779 votes; Georgia ballots were counted three times.",
    "And Perdue has made false election claims an emphasis of his candidacy.",
    "Election Day in the 2022 Georgia primary is May 24.",
    "Kemp didn't allow anyone to steal the election."
  ]
}