{
  "id": 2015,
  "mediaId": 65,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Trump endorsements of Oz, Vance aren't deterring Cruz, Pompeo in key GOP Senate primaries",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8731fd85-e9be-46fc-b394-5ab170a7b167/6a5dc035-db8e-4349-9008-cb02dee961e4/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-endorsements-oz-vance-not-deterring-cruz-pompeo",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2095,
    2409,
    2409,
    2095,
    1653,
    1653,
    1693,
    1693,
    1710,
    1710,
    1147,
    1147,
    428,
    428,
    571,
    571,
    2672,
    2672
  ],
  "sentences": [
    "FOLLOWING TRUMP ENDORSEMENT, DR. OZ AND DAVE MCCORMICK TRADE FIRE\nMcCormick, a former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official during President George W. Bush's administration, and Oz, the cardiac surgeon, author and well-known celebrity physician who until the launch of his Senate campaign late last year was host of TV's popular \"Dr. Oz Show,\" are the polling front-runners and biggest spenders in the race to succeed retiring GOP Sen. Pat Toomey.",
    "Pompeo's been crisscrossing the country over the past year, campaigning with, and helping to raise money for fellow Republicans running in this year's midterms, making friendships that could pay dividends if the former congressman from Kansas, CIA director and America's top diplomat during the Trump administration decides to run the 2024 GOP presidential nomination.",
    "\"Dave is honored to have Secretary Pompeo's continued support, a fellow West Point grad, and is thankful Pompeo believes he is the right candidate to fight on behalf of Pennsylvanians,\" the McCormick campaign said in a statement ahead of their event at the Frosty Valley Resort in Danville, Pennsylvania.",
    "Brian Kemp; former Alaska Department of Administration commissioner Kelly Tshibaka, who's primary challenging Republican Sen. Lisa Murkowski; and in Alabama the former president recently pulled his endorsement of Rep. Mo Brooks, a Trump ally who's struggling in his state's open seat primary race.",
    "The former president, 15 months removed from the White House, remains the most influential and popular politician in the Republican Party, as he continues to play a kingmaker's role in party primaries and repeatedly flirts with making another White House run in 2024.",
    "With Pennsylvania's May 17 primary fast approaching, former Secretary of State Mike Pompeo heads to the Keystone State on Wednesday to support Dave McCormick, the candidate he's backing in a very crowded, combustible and expensive Republican Senate nomination race.",
    "Haley, who served as ambassador to the United Nations during the Trump administration, is backing Rep. Nancy Mace in the Republican primary in South Carolina's 1st Congressional District, while the former president is backing challenger Katie Arrington.",
    "\"If you're a potential 2024 candidate and you go on to endorse somebody who goes on to win their primary, that person's indebted to you and if it's in a key state like Ohio or Pennsylvania, that could be a valuable support for your own run.\"",
    "TRUMP 2024 TEASE DOESN'T STOP OTHER POTENTIAL WHITE HOUSE HOPEFULS FROM MAKING EARLY MOVES\nAmong those struggling in the polls or with fundraising are former Sen. David Perdue of Georgia, who's primary challenging GOP Gov.",
    "\"There's no question that a Trump endorsement is helpful in a Republican primary but we're finding that it doesn't clear the field, nor does it ensure victory,\" longtime Republican consultant Ryan Williams told Fox News.",
    "Pete Ricketts, whom some consider a possible White House hopeful, has endorsed University of Nebraska Board of Regents member Jim Pillen as his successor, with Trump backing GOP businessman Charles Herbster.",
    "The intraparty face-offs between Trump and other potential 2024 presidential contenders may be like appetizers for things to come once the midterms are over and the contest for the next White House heats up.",
    "Cruz, who was runner-up to Trump in the 2016 Republican presidential nomination race and who's considering another run in 2024, is scheduled to join Mandel on the campaign trail at the end of next week.",
    "And advisers to former Vice President Mike Pence, who is making the early moves that could result in a presidential run of his own next cycle, have been helpful to Kemp's team behind the scenes.",
    "Pompeo endorsed McCormick in early February, more than two months before his old boss  former President Donald Trump  weighed in on the race by supporting McCormick's chief rival, Mehmet Oz.",
    "POMPEO'S 2022 MISSION TO HELP FELLOW REPUBLICANS MAY SET HIM UP FOR 2024\nWhile a Pompeo endorsement is helpful, a Trump endorsement remains the gold standard in the GOP.",
    "Williams, a veteran of numerous GOP presidential campaigns, noted that \"it's giving other potential 2024 contenders the license to go out and endorse who they want.",
    "The key battleground state contest is one of a handful that could decide whether the Republicans win back the Senate majority in November's midterm elections.",
    "Sen. Ted Cruz of Texas is also backing McCormick, as well as former Ohio treasurer Josh Mandel in Ohio's divisive and costly GOP Senate primary.",
    "Christie, a 2016 GOP presidential candidate who has publicly said he's mulling another White House run in 2024, is supporting Kemp.",
    "Pompeo is far from the only potential 2024 contender to back a candidate that's facing off against a Trump endorsed contender.",
    "They feel that there are no repercussions for making your own endorsements separate of President Trump's endorsement.\"",
    "Nikki Haley, another potential 2024 contender, are on opposing sides in a GOP congressional primary in her home state.",
    "Kristi Noem  whom pundits see as a possible White House hopeful  is backing former Ohio GOP chair Jane Timken.",
    "Vance, the venture capitalist and bestselling author the former president endorsed last Friday.",
    "But some high-profile candidates Trump has backed this cycle have failed to date to ignite.",
    "Like Pompeo, Cruz made his endorsements well before Trump weighed in on either race.",
    "\"People remember who supported them in tough fights,\" Ryan noted.",
    "Trump heads to Ohio this weekend to campaign with J.D.",
    "Chris Christie are on opposing sides in Georgia.",
    "And in Nebraska, term-limited Republican Gov.",
    "In that same primary race, South Dakota Gov.",
    "Trump and former South Carolina Gov.",
    "Trump and former New Jersey Gov."
  ]
}