{
  "id": 2017,
  "mediaId": 136,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Donald Trump Is Realizing the Limits of His Power in GOP Primaries",
  "image": "",
  "link": "https://www.newsweek.com/donald-trump-realizing-limits-power-gop-primaries-midterms-republicans-1699328",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    946,
    1052,
    1147,
    1653,
    1765,
    2095,
    2137,
    428,
    571
  ],
  "sentences": [
    "Sean Parnell, who Trump previously endorsed in the Pennsylvania Senate race, dropped out amid his estranged wife's accusations of abusive behavior and Trump withdrew his endorsement from Representative Mo Brooks in the Alabama Senate race, possibly because of his poor showing in the polls despite an initial lead.",
    "\"Trump may run again for the GOP nomination but it is by no means a certainty that he will secure it in the face of, ironically, a roster of candidates who can offer the positives of a Trumpian candidacy without the negatives that turn voters off,\" he said.",
    "McConnell made reference to the 2010 midterms during comments in Kentucky on April 12 where he warned that Republicans would struggle to win if they nominate \"somebody who's just sort of unacceptable to a broader group of people\" in competitive races.",
    "A Repeat of 2010\nSingh suggested that \"establishment\" Republicans like Senate Minority Leader Mitch McConnell \"are desperate to avoid a repeat of 2010, where the GOP could have won the Senate but failed to do so because of some eccentric nominees.\"",
    "In one famous case, the Republican Senate candidate in Delaware, Christine O'Donnell, recorded a TV ad assuring voters she was not a witch, addressing comments she had made during an appearance on Bill Maher's show, Politically Incorrect, in 1999.",
    "Political experts who spoke to Newsweek suggested that while the former president's endorsement still mattered, it may not carry the same weight it once didand that could have implications for a potential Trump 2024 presidential bid.",
    "\"Although the Republican Party now is much more Trump's party than Ronald Reagan's, Trump has had a very uneven record in terms of endorsing Republican candidates for Congress and state positions,\" Singh said.",
    "Former President Donald Trump has long touted the importance of his endorsements in the Republican primary processes and as crucial midterms approach, he's been offering his backing to a range of candidates.",
    "Trump's Party\nRobert Singh, a professor at the Department of Politics at Birkbeck, University of London, told Newsweek that the former president may have less of a hold over the GOP than has been imagined.",
    "\"With ample money, name recognition, and media attention, he can wait, still knowing he's the frontrunner in what promises to be a very large field of presidential aspirants,\" he went on.",
    "Gift said that despite this, Trump's endorsement \"is still highly coveted, and in tight races, there's no doubt it could give candidates the marginal boost they need to secure a win.\"",
    "\"Privately, he has told many figures that he is running, but the laws on campaign financing mean that he has no incentive to declare anytime sooneven after the midterms,\" Singh said.",
    "\"The fact that he's not just anointing candidates who already have a clear path to victory is indicative of the kind of boldness that many supporters admire about Trump,\" Gift added.",
    "Trump faced some conservative criticism for endorsing celebrity surgeon Mehmet Oz in the Pennsylvania Senate race, with Fox News host Laura Ingraham saying it was a \"mistake.\"",
    "On Tuesday, the Trump-endorsed candidate for Tennessee's 5th congressional district, Morgan Ortagus, was removed from the primary ballot after a vote by the state party.",
    "However, the power of the former president's endorsement could be called into question as some of his preferred candidates have faced attacks from others in the GOP.",
    "\"What this shows is that while he remains popular among rank-and-file GOP voters, his supposed 'hold' on the party is more tenuous than many imagine,\" he went on.",
    "Boldness\nThomas Gift said that some GOP operatives \"might question the wisdom of Trump risking his political capital on primary candidates who ultimately lose.\"",
    "However, Singh said that \"what the hit-and-miss record of endorsements confirm is that many Republicans are looking actively for alternatives.\"",
    "\"The fact that virtually every Republican contender wants Trump's blessing is evidence of his continued popularity with the party,\" he added.",
    "Robert Singh told Newsweek that the opposition Trump-endorsed candidates face \"probably won't be decisive on whether Trump runs again.\"",
    "\"Trump voters are much more impulsive, unpredictable, and ideologically-motivated than they're often given credit for,\" he said.",
    "Senator David Perdue in his primary challenge to Governor Brian Kemp but Kemp appears to be well positioned to defeat Perdue.",
    "\"But true to form, Trump seems more interested in actually helping candidates who he sees as loyal to him and his agenda.\"",
    "\"Yet his uneven record in picking primary winners proves that the GOP base doesn't acquiesce to his every whim.\"",
    "Trump in 2024\nTrump is still considered the leading contender for the 2024 Republican presidential nomination.",
    "\"So, many Trump-endorsed figures face stiff competition from more party-focused Republicans,\" Singh explained.",
    "Polls have shown majorities of GOP voters favor him and he has repeatedly hinted at a third White House run.",
    "\"Trump is often described as having a cult-like following among his core supporters,\" Gift said.",
    "Personal Fealty\nThomas Gift, founding director of University College London's Centre on U.S.",
    "Vance for the Senate despite the fact Vance has been trailing Republican rival Josh Mandel.",
    "\"The personal fealty they display toward their leader, in other words, isn't unbounded.\"",
    "Politics, told Newsweek that Republicans will still seek Trump's endorsement.",
    "It remains to be seen if the former president's nod will be decisive.",
    "Newsweek has asked former President Trump's office for comment.",
    "And in Georgia, Trump is backing former U.S.",
    "She has said she's looking at her options.",
    "In Ohio, Trump has formally endorsed J.D.",
    "\"Fair enough,\" Gift said."
  ]
}