{
  "id": 2021,
  "mediaId": 1576,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Residents rip planned electric vehicle plant at Georgia meeting",
  "image": "https://www.wabe.org/app/uploads/2022/02/Oppose-Rivian-Sign-336x189.jpg",
  "link": "https://www.wabe.org/residents-rip-planned-electric-vehicle-plant-at-georgia-meeting/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    44,
    436,
    2590,
    2672,
    2707,
    2806,
    2844,
    2889
  ],
  "sentences": [
    "A spokesperson for Rivian said the meeting was a valuable opportunity for the company to gather input and committed to sharing details of their plans for the site once they are complete and meet our own high design and environmental standards.?\nThe plant is a subject of contention in the Republican primary for governor, with former U.S. Sen. David Perdue attacking Kemp for agreeing to the Rivian location without support from neighbors.",
    "The Irvine, California-based electric vehicle manufacturer announced last year that it would build the facility on a 2,000-acre (809-hectare) site in Morgan and Walton counties about 45 miles (72 kilometers) east of Atlanta along Interstate 20.",
    "The state panel, led by John Eunice, deputy director for the state Environmental Protection Division, did not get much cooperation from a hostile crowd that gathered at Athens Technical College in Monroe.",
    "Opponents trying to derail a $5 billion, 7,500-job electric truck plant dominated a state meeting Monday that was meant to gather suggestions on how to design the plant to mitigate environmental impacts.",
    "Residents criticized the meeting as a sham, saying it's impossible to make meaningful suggestions when there's not yet a plant design and saying the state is only working to get the plant built.",
    "Many speakers Monday voiced concerns about possible well-water contamination, light pollution and the disruption of wildlife habitats and farmland for heavy industry.",
    "I don't understand why you are sitting on that side of the table, which is the Rivian side of the table and why you're not sitting over here asking Rivian and Gov.",
    "I was sitting at home and I saw my governor get on TV and say Rivian, 2,000-acre plant, coming to Rutledge, Georgia and it's a done deal,? said Pam Jones.",
    "The state plans four meetings each with three other committees tasked with examining quality of life, workforce and local business engagement issues.",
    "Rivian, which also has a plant in Normal, Illinois, said it hopes to break ground as early as this summer and begin production in 2024.",
    "The state assumed oversight over the Rivian Automotive project after opponents overwhelmed Morgan County planning and zoning officials.",
    "Opposition to the plant has been heavy from Rutledge-area residents who say the plant will spoil their rural quality of life.",
    "Eunice said he does not know when Rivian will file for environmental permits needed to build the facility.",
    "Kemp to explain this environmental project and how it's a disaster,? said Edwin Snell of Oconee County.",
    "Monday's meeting was the first of four planned for the site design and environmental committee.",
    "A Rivian executive was present via video conference but did not speak during the hearing.",
    "Brian Kemp in December, and is the biggest single industrial project in state history.",
    "He said the division will take public comment on the permits.",
    "It plans to produce up to 400,000 vehicles a year there.",
    "The plant was announced by the company and Georgia Gov."
  ]
}