{
  "id": 2027,
  "mediaId": 195,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Georgia prosecutor details plans for Trump election grand jury",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/02/willisfani_ap.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3272888-georgia-prosecutor-details-plans-for-trump-election-grand-jury/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Monique Beals",
  "authorUrl": "https://thehill.com/author/monique-beals/",
  "termIds": [
    2279,
    2279,
    2203,
    2203,
    2087,
    2087,
    1147,
    1147,
    501,
    501,
    2672,
    2672,
    2555,
    2555
  ],
  "sentences": [
    "Trump, who continues to falsely claim he won the 2020 election, has said nothing about the conversation was inappropriate and referred to it as a perfect phone call.?\nAt a rally in Texas earlier this year, Trump directly mentioned the investigation in Georgia, prompting a request for additional security at the district attorney's office and home.",
    "If these radical, vicious, racist prosecutors do anything wrong or illegal, I hope we are going to have in this country the biggest protests we have ever had in Washington, D.C., in New York, in Atlanta and elsewhere because our country and our elections are corrupt,? Trump said at the rally in February.",
    "The investigation is largely focused on a January 2021 phone call between Trump and Georgia Secretary of State Brad Raffensperger (R), in which the then-president asked Raffensperger to find? 11,780 votes to overturn President Biden's victory in the state.",
    "Willis told The Atlanta Journal-Constitution that testimony would not begin until June 1, following primary elections scheduled for May 24, in an effort to avoid the appearance of any underlying political motivations.",
    "Fulton County District Attorney Fani Willis (D) will wait until after primary elections next month to begin taking testimony over former President Trump's alleged push to overturn Georgia's election results in 2020.",
    "Willis also told the outlet that 50 people have voluntarily testified before prosecutors, but she intends to seek subpoenas for at least 30 other people who declined to be interviewed so far.",
    "I don't want anyone to say oh, she's doing this because she wants to influence the outcome of this upcoming election,' ? Willis told the Journal-Constitution.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Raffensperger is facing a primary challenge from Rep. Jody Hice (R-Ga.), who has been endorsed by Trump.",
    "After that rally, Willis said she had increased security after receiving a number of racist threats.",
    "The former president also recruited and endorsed former Sen. David Perdue (R-Ga.) to primary Gov.",
    "Selections for a special grand jury in the case are expected to begin on May 2.",
    "Brian Kemp (R), who also refused Trump's entreaties to block Biden's victory.",
    "It will have nothing to do with this district attorney's office,? she added.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The people will decide the outcome of this upcoming election."
  ]
}