{
  "id": 2028,
  "mediaId": 238,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Opinion: A conservative insider's stark warning about Trump and 2024",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/19/conservative-matthew-continetti-warning-trump-2024/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    1813,
    1813,
    2095,
    2095,
    1147,
    1147,
    1162,
    1162,
    1078,
    1078,
    1074,
    1074,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "When racist, white supremacist and alt-right elements sought to violently overturn democracy, he writes, all of the unreason and hatred that had been slowly growing in the body of the Right burst into the open.?\nTo illuminate these tendencies, Continetti tells a story of conservatism that has often been marked by an elite inability or unwillingness to police extremism, and at times an active embrace of it.",
    "As Continetti writes, many on the right are now in the grip of antagonism toward American culture and society? and even outright opposition to the constitutional order.?\nContinetti warns that conservatism cannot remain a viable ideological alternative to liberalism if it doesn't decisively repudiate this turn away from liberal democracy and constitutionalism.",
    "You can discern many signs that Republican lawmakers think the party's future depends, at least partly, on sustaining the engagement of the voters that Trump brought into the GOP coalition, and that a full-throated repudiation of Trump's contempt for democracy might imperil this project.",
    "As John Ganz notes, again and again conservative intellectuals have fastened themselves like barnacles onto demagogic movements.?\nTrump hastened the erasure of that boundary with his unabashed nativism, racism, active flaunting of corruption and open contempt for democracy.",
    "In the book, Trump's efforts to overturn the election through extraordinary procedural corruption and then the incitement of mob violence occupy a more prominent place in the story of conservatism's evolution than movement thinkers usually ascribe it.",
    "One possible answer might be that, just as conservative elites have historically been reluctant to police extremism in order to hitch conservatism to mass political movements, something similar is happening again.",
    "In The Right,? author Matthew Continetti warns that Republicans must wean themselves off the personality cult of Trump and fealty to his 2020 lies in order for conservatism to remain a viable ideological project.",
    "Untangling the Republican Party and conservative movement from Donald Trump won't be easy,? writes Continetti, who has held various positions inside conservative journalism and think tanks over the years.",
    "The through line here is that conservative elites have perpetually kept fuzzy the boundary between elite conservatism and right-wing mass politics, to mobilize large popular constituencies.",
    "You see it in Senate GOP leader Mitch McConnell (R-Ky.) refusing to acknowledge Joe Biden's victory for weeks to keep GOP voters engaged for the U.S. Senate runoffs in Georgia.",
    "For instance: The right's noninterventionist streak during the lead-up to World War II too easily collapsed into Charles Lindbergh's antisemitism and flirtation with Nazism.",
    "And a new book by a conservative movement insider helps us make sense of those stakes, why things have come to this, and the prognosis for a good outcome in that struggle.",
    "More recently, when Presidents Ronald Reagan and George W. Bush tried to edge the GOP in a pro-immigrant, facially aspirational direction, the base lurched the other way.",
    "Some Republicans really do think future elections should be subject to nullification by any means necessary, justified by wildly inflated depictions of the leftist enemy.",
    "It embraced right-wing populism, the angry anti-immigrant demagoguery of paleoconservative Pat Buchanan and the resentment-soaked Own the Libs? theater of Sarah Palin.",
    "But this gives rise to a question: Why are so few Republican lawmakers inclined to undertake this project of disentangling from Trump in the first place?",
    "You see it in the GOP's official censure of the only two House Republicans who want a full reckoning with Trump's effort to destroy our political order.",
    "Brian Kemp is likely to survive a GOP primary challenge backed by Donald Trump in retaliation for Kemp's refusal to help overturn his 2020 loss.",
    "It's possible that if many GOP primary candidates endorsed by Trump lose, followed by him not running in 2024, then this conviction might fade.",
    "You see it in Pennsylvania Republicans telegraphing their belief that keeping the base engaged requires undying fealty to Trump's 2020 lies.",
    "That's because, in Continetti's telling, those events partly represented long-festering tendencies inside the movement and the GOP.",
    "The bad news: Trump's allies are escalating efforts to get swing-state GOP legislatures to revisit and overturn the 2020 outcome.",
    "This is gaining support from some Republicans running for positions of control over future elections, which bodes rather badly.",
    "And for too long they humored states rights? as a smokescreen for opposing the dismantling of legally enforced white supremacy.",
    "But at bottom, why many GOP lawmakers think this is necessary to keep their voters engaged remains an unanswered question.",
    "If a willingness to respect election losses doesn't turn out to be a dealbreaker in GOP primaries, that will be welcome.",
    "Somewhat less menacingly, others feed these tendencies for instrumental purposes, to keep GOP voters on full boil.",
    "You see this in Sen. Lindsey Graham (R-S.C.) explicitly declaring that the party can't grow? without Trump.",
    "The anti-communism of the 1950s too easily shaded into support for Joe McCarthy's witch hunts.",
    "The stakes are high in this struggle over the GOP's future posture toward democracy.",
    "Then in the 1960s, conservative elites were slow to purge John Birch conspiracism.",
    "Here's where Continetti's history of modern conservatism is illuminating.",
    "There is a spectrum of motives in all this.",
    "The 2024 election is a big test.",
    "The good news: Georgia Gov."
  ]
}