{
  "id": 2029,
  "mediaId": 63,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Georgia Prosecutor Investigating Trump's Attempts To Overturn Election Will Wait To Call Witnesses Until After Primaries",
  "image": "https://imageio.forbes.com/specials-images/imageserve/625eb664d3ec28f7215ca2c5/Fulton-County-Georgia-District-Attorney-Fani-Willis-photographed-in-her-office-/0x0.jpg?fit=crop&format=jpg&crop=2810,1581,x0,y90,safe",
  "link": "https://www.forbes.com/sites/annakaplan/2022/04/19/georgia-prosecutor-investigating-trumps-attempts-to-overturn-election-will-wait-to-call-witnesses-until-after-primaries/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Kaplan",
  "authorUrl": "https://www.forbes.com/sites/annakaplan/",
  "termIds": [
    1147,
    2095,
    2203,
    501,
    2670,
    2672
  ],
  "sentences": [
    "Topline\nFulton County District Attorney Fani Willis said Tuesday she will wait until after the primary elections in Georgia to begin calling witnesses in her criminal investigation into former President Donald Trump's attempts to overturn or influence the 2020 election in the state, in an effort to avoid allegations that her probe could influence the outcome of the election.",
    "The four-week period between selection and calling witnesses will give the jurors time to approve subpoenas for witnesses who did not voluntarily testify, and for Willis' office to deliver the subpoenas and other related documents, the Journal-Constitution reports.",
    "Key Facts\nWillis told the Atlanta Journal-Constitution she will wait to call witnesses to testify before the grand jury until June 1, or more than a week after Georgia's primary elections, which are scheduled for May 24.",
    "Trump also called Kemp and a state investigator, who he reportedly urged to find the fraud.? Judges dismissed lawsuits filed by Trump supporters asking for the election results to be thrown out and seeking an audit.",
    "The Fulton County District Attorney's Office has increased security measures after racist slurs and threats were made over the phone and on social media with ties to the Trump probe.",
    "I don't want anyone to say Oh, she's doing this because she wants to influence the outcome of this upcoming election,'? Willis told the Journal-Constitution.",
    "In the call, Trump pressured and threatened Raffensperger to help overturn his loss in the state, insisting that voter fraud altered the vote's results.",
    "Willis opened her investigation in February 2021 after a recording of the call between Trump and Raffensperger was published by the Washington Post.",
    "Georgia election officials have said there was no evidence of voter fraud in runoff elections and in two recounts requested by Trump's campaign.",
    "Willis said she has ordered bulletproof vests for the lead prosecutors in the investigation, who she declined to name due to security concerns.",
    "Willis said plans to prepare subpoenas for at least 30 other individuals, and plans to speak to about 60 other people in the next few weeks.",
    "Several key witnesses, including Secretary of State Brad Raffensperger, who Trump called and asked to find? votes for him, and Gov.",
    "That's how about many people who have already voluntarily testified before prosecutors, Willis told the Journal-Constitution.",
    "Brian Kemp, who Trump also called after the election, are on the primary ballot.",
    "Multiple recounts confirmed Trump lost by about 12,000 votes in the state.",
    "It will have nothing to do with this district attorney's office.?\n50.",
    "I just want to find 11,780 votes,? Trump said during the call.",
    "The people will decide the outcome of this upcoming election.",
    "All I want to do is this."
  ]
}