{
  "id": 2032,
  "mediaId": 65,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Trump hauled in $19 million the past three months and has $124 million in his coffers",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/88e33caf-9aec-4fc3-a318-a5a086ad2f7c/73a92a44-e867-4e88-ae6e-163ceda53482/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-19-million-three-months-fundraising",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    1646,
    2087,
    2095,
    4325,
    200,
    428,
    2672
  ],
  "sentences": [
    "The former president's expenditures include payroll for his staff, advisers and outside consultants and contractors, costs associated with holding large rallies in states across the country every other week, fees to Trump-owned hotels for lodging, meals and rental facilities, Facebook advertising by his committees, and transfers to candidates and committees he's backing.",
    "The latest fundraising figures, shared first with Fox News on Tuesday, are another indicator that Trump remains the most popular and influential politician in the GOP as he continues to play a kingmaker's role in the 2022 Republican primaries and repeatedly teases another presidential run in 2024.",
    "\"President Donald J. Trump's political organizations are positioned to carry his America First message into battleground races across the nation,\" Taylor Budowich, communications director for the former president and the Save America PAC, told Fox News in a statement.",
    "Trump's impressive war chest could also give him a huge head start over the rest of the field of potential 2024 GOP presidential contenders should he follow through on his flirtations and make a third White House run.",
    "The former president's cash on hand rising just $2.1 million while raking in $19 million the past three months is a sign that Trump's committees are starting to spend the money they've raised.",
    "And the three entities  Trump's Save America PAC, Save America JFC (joint fundraising committee) and MAGA PAC  report ending March with a massive $124 million in cash on hand in their coffers.",
    "FIRST ON FOX: Fifteen months removed from the White House, former President Donald Trump's reputation as the Republican Party's fundraising behemoth remains firmly intact.",
    "Trump's fundraising draw  and especially his grassroots appeal  has been fueled in part by his constant re-litigating of his 2020 election loss to now-President Biden.",
    "\"President Trump is incredibly well-positioned to look beyond November as the need for his leadership has never been more important,\" Budowich told Fox News.",
    "Among the expenditures was a $500,000 transfer on March 25 from Save America to the Get Georgia Right Super PAC, which is taking aim at Republican Gov.",
    "The former president's three political committees hauled in just over $19 million during the January-March first quarter of fundraising.",
    "Trump hauled in $51 million during the second half of last year and had roughly $122 million cash on hand at the start of this year.",
    "In another sign of Trump's grassroots fundraising prowess, his committees' average donation during the first quarter was $28.04.",
    "Trump's team also reports a total of 679,445 contributions the past three months, with 98.4% of those donations under $200.",
    "Trump is backing former GOP Sen. David Perdue as he challenges Kemp in Georgia's May 24 primary.",
    "TRUMP'S GRIP ON THE GOP REMAINS FIRM, BUT IS HE STRETCHING HIMSELF TOO THIN?",
    "Brian Kemp of Georgia."
  ]
}