{
  "id": 2037,
  "mediaId": 19,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Donald Trump Remains a Fundraising Juggernaut: $19M in Q1, $124M on Hand",
  "image": "https://media.breitbart.com/media/2022/04/Donald-Trump-Clapping-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/19/donald-trump-remains-a-fundraising-juggernaut-19m-in-q1-124m-on-hand/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    1147,
    1646,
    1765,
    2095,
    234,
    443,
    2672,
    2887
  ],
  "sentences": [
    "Taylor Budowich, the communications director for Trump and his Save America PAC, told Fox News that President Donald J. Trump's political organizations are positioned to carry his America First message into battleground races across the nation.?\nAs Fox News noted, Trump started the year off with $122 million cash on hand, meaning the former president only raised his war chest by roughly $2 million after paying his staff and other expenditures:\nThe former president's expenditures include payroll for his staff, advisers and outside consultants and contractors, costs associated with holding large rallies in states across the country every other week, fees to Trump-owned hotels for lodging, meals and rental facilities, Facebook advertising by his committees, and transfers to candidates and committees he's backing.",
    "In fact, a poll last month showed that Trump held a significant 52 points lead in a potential 2024 Republican primary ahead of any closest competitor, while another poll showed that he was also far more popular than Senate Minority Leader Mitch McConnell (R-KY) in 2022 midterm swing states.",
    "The former president's fundraising numbers, first reported by Fox News, between the three fundraising entities  Trump's Save America PAC, Save America JFC, and MAGA PAC  have hauled in over $19 million between January and March and have $124 million in cash on hand.",
    "Former President Donald Trump remains a fundraising juggernaut over a year out of the White House, with over $19 million raised in the last quarter and $124 million in cash spread across all of his entities.",
    "At the same time, he simultaneously backs former Sen. David Perdue (R), making this the first significant financial contribution he has taken in the midterm election cycle.",
    "Trump also poured out half a million dollars from his Save America PAC into Georgia's Republican gubernatorial primary race in his effort to unseat the incumbent Gov.",
    "President Trump is incredibly well-positioned to look beyond November as the need for his leadership has never been more important,? Budowich added.",
    "While the former president continues to pull in massive fundraising numbers, he holds an edge over a potential 2024 field if he decides to run.",
    "During the last fundraising quarter, the committees say an average donation of $28.04 came from 679,445 contributions.",
    "The former president's latest fundraising haul shows that Trump is still widely popular within the Republican party.",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "The committees also had 98.4 percent of the donations made under $200.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "Brian Kemp (R)."
  ]
}