{
  "id": 2038,
  "mediaId": 238,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Opinion: Trump is gambling with his political future in Ohio and Pennsylvania",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/18/donald-trump-endorsement-jd-vance-ohio-mehmet-oz-pennsylvania-gamble/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1563,
    1801,
    2095,
    2117,
    2475,
    2672,
    2845,
    2862
  ],
  "sentences": [
    "Two of Trump's endorsees for the House, North Carolina's Bo Hines and Tennessee's Morgan Ortagus, are under fire from local conservatives and party leaders as carpetbaggers with no substantial ties to the seats they want to represent.",
    "Former president Donald Trump's last-minute endorsements in the crowded Ohio and Pennsylvania Republican Senate primaries are gambles to show he can still drive underdogs to victory.",
    "Oz, whose general consultant is a friend, was running a close second but has been repeatedly hammered in television ads by the front-runner, wealthy businessman David McCormick.",
    "Vance, who is a friend and someone I have written about favorably in the past, was particularly in a difficult position, running third in the RealClearPolitics polling average.",
    "And Trump's pick in the Alabama Senate race, Rep. Mo Brooks, started in first place but gradually sank to third in the polls as he failed to keep up with two big-spending foes.",
    "Trump chose former Georgia senator David Perdue to oppose Kemp, even though Perdue had just run statewide himself and narrowly lost his Senate seat to Democrat Jon Ossoff.",
    "In the race for Georgia secretary of state, Rep. Jody Hice leads against incumbent Brad Raffensperger but is also well short of the majority he needs to avoid a runoff.",
    "His first endorsee in the Pennsylvania Senate race, Sean Parnell, dropped out after his estranged wife accused him of spousal and child abuse (which Parnell denies).",
    "Trump could then do what he always does in situations like this: Blame his losing endorsees for the defeats and minimize what the victors brought to the table.",
    "Then there's Trump's pick in South Carolina's 1st Congressional District, former state Rep. Katie Arrington, who has also stumbled out of the gate.",
    "If both lose, it will amplify the growing sense that Trump's political influence is like a fading television hit rapidly losing its audience.",
    "Rep. Ted Budd now leads in North Carolina's GOP Senate race, but he remains below the 35 percent he needs to win without a runoff.",
    "Two high-profile, unexpected wins will go a long way to bolstering his reputation against the likely losses elsewhere.",
    "Brian Kemp, accusing him of not acting to overturn the 2020 election result and deliver his state for Trump.",
    "Vance and Mehmet Oz in the GOP primaries for the Senate seats in Ohio and Pennsylvania, respectively.",
    "But these were risky moves, as neither candidate was a clear front-runner before gaining Trump's nod.",
    "If Vance and Oz end up the victors, Trump will claim  and perhaps even deserve  much of the credit.",
    "His new high-profile endorsements show that he's doubling down on the approach that got him there.",
    "Trump, like the warriors of ancient Sparta, will soon either come back with his shield  or on it.",
    "Savvy politicos nonetheless took note: Trump could command, but the GOP tides might not listen.",
    "Trump then withdrew his endorsement, apparently attempting to avoid defeat by abandoning ship.",
    "Trump's decisions, therefore, have perplexed allies who believe he is getting behind losers.",
    "Trump is clearly seeking to change the narrative with his recent endorsements of J.D.",
    "This is a classic Trump recipe  a little bit of fact folded into a lot of balderdash.",
    "Mace also leads in cash on hand, as of March 31, by a $2 million to $754,000 margin.",
    "Arrington provided most of that money herself, giving her campaign a $525,000 loan.",
    "If Vance or Oz loses, it will be clear that Trump's blessing cannot move mountains.",
    "Trump's immediate political future now likely turns on whether those bets pay off.",
    "Other Trump endorsees are doing better, but almost none have cleared the field.",
    "If that happens, it will be only a matter of time before the show is canceled.",
    "Kemp has led in almost every public poll, and his lead has grown over time.",
    "Trump's status as the GOP's kingmaker already stands on shaky ground.",
    "He faces four opponents who had outspent him by millions of dollars.",
    "But that is likely the primary reason Trump made his choices.",
    "Early polls show her foe, incumbent Rep. Nancy Mace, ahead.",
    "Trump didn't get to be president by playing it safe.",
    "Other endorsees also looked doomed to defeat.",
    "Trump has it in for incumbent Georgia Gov.",
    "The risks to Trump's standing are immense."
  ]
}