{
  "id": 2042,
  "mediaId": 43,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "rhetoric despite pleas from Asian Americans",
  "image": "https://images.dailykos.com/images/1059783/story_image/ScreenShot2022-04-15at4.08.59PM.png?1650058878",
  "link": "https://www.dailykos.com/story/2022/4/18/2092219/-Morning-Digest-Tim-Ryan-returns-to-anti-China-rhetoric-despite-pleas-from-Asian-Americans",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2534,
    2534,
    2302,
    2302,
    2087,
    2087,
    781,
    781,
    1454,
    1454,
    1632,
    1632,
    1670,
    1670,
    2863,
    2863
  ],
  "sentences": [
    "Among Pruitt's many dubious activities were his penchant for living high on the taxpayers' dime, including first-class airfare, luxury hotels, and other exorbitant travel spending; a pattern of financially benefiting from lobbyists such as renting a Capitol Hill condo from one for only $50 a night; $4.6 million in security spending that included a $42,000 soundproof phone booth in his office, his own 24-hour security detail, and $3,000 on \"tactical pants;\" and also using his office and aides to run personal errands and help advance his wife's business interests.",
    "AZ-Gov: Katie Hobbs (D): $750,000 raised; Marco Lpez (D): $450,000 raised; Kari Lake (R): $970,000 raised, $700,000 cash-on-hand\nNV-Gov: Joe Lombardo (R): $824,000 raised, $3 million cash-on-hand; Fred Simon (R): $1.3 million self-loaned\nSenate\n? AL-Sen: Former Business Council of Alabama leader Katie Britt has launched a new ad ahead of the May 24 Republican primary where she appears to shop in a supermarket and blames Joe Biden for inflation while asserting that \"Washington politicians\" shouldn't get paid if they don't balance the budget.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNerding out on redistricting, with Nathaniel Rakich\nThe Downballot\nFollowShare\n0:0059:53\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? OH-Sen: Despite widespread condemnation of his first TV ad that blamed America's ills on China, Democratic Rep. Tim Ryan is back to the same theme in his newest spot, telling viewers, \"We've gotta take on China\" and \"be Americans first.\"",
    "? IL-01: Democratic Rep. Chuy Garcia, who represents the nearby 4th District, has endorsed construction contracting firm owner Jonathan Jackson, who is the son of civil rights leader Jesse Jackson Sr. and brother of former 2nd District Rep. Jesse Jackson Jr., in the June Democratic primary to succeed retiring Democratic congressman Bobby Rush in the 1st District on Chicago's South Side.",
    "? OK-Sen-B: Shortly before Friday's deadline to run passed, former Trump administration Environmental Protection Agency director Scott Pruitt, who previously served as state attorney general from 2011 until he joined Trump's cabinet in 2017, filed and indicated he would run in the upcoming special election to succeed retiring GOP Sen. Jim Inhofe.",
    "Pruitt gained national notoriety for leading the EPA on a crusade to undermine its very mission by aggressively rolling back regulations against pollution in favor of the fossil fuel industry and denying human-made climate change, but it was his cartoonish level of corruption scandals that led to him resigning just over a year into his tenure.",
    "Looking ahead to the general election, the Republican Governors Association is running a new commercial as part of a $5 million ad reservation that claims Democrat Stacey Abrams' support for mask mandates and restrictions on businesses during the height of the COVID-19 pandemic back in April 2020 would have \"devastated\" the state's economy.",
    "? TX-28: Despite being pressed repeatedly by NBC's Chuck Todd in a Thursday interview, Democratic Rep. Henry Cuellar declined to reiterate his attorney's recent claim that he's not the target of a federal investigation that prompted law enforcement to raid his home and campaign headquarters earlier this year.",
    "A Thursday press release from the committee didn't offer any details as to the nature of the probe, but Politico took note of an Insider story from last month reporting that Rutherford had bought as much as $15,000 worth of stock in military contractor Raytheon on the very day that Russia invaded Ukraine.",
    "The pollster, who didn't reveal whom if anyone the poll was conducted on behalf of, sees 2016 nominee Bud Pierce taking 11, former state House Minority Leader Christine Drazan earning 8, and Sandy Mayor Stan Pulliam, former state Rep. Bob Tiernan, and 1998 nominee Bill Sizemore each winning 5.",
    "That's somewhat worse for Raffensperger than a recent University of Georgia poll that found him trailing by a smaller 30-22, and neither result is encouraging news for the incumbent in a race where Trump is backing Hice over Raffensperger's refusal to help steal the 2020 election for him.",
    "One person who took objection to Ryan's rhetoric was his House colleague, New York Rep. Grace Meng, who tweeted that the ad was \"essentially shifting blame away from American corporations' anti-worker policies and putting a target on the backs of #AAPIs\" and demanded he stop airing it.",
    "Governors\n? GA-Gov: Polling on behalf of local CBS affiliate WGCL, Landmark Communications surveyed the May 24 Republican primary for governor and finds incumbent Brian Kemp holding a dominant 52-28 lead over former Sen. David Perdue, with 10% going to educator Kandiss Taylor.",
    "In response to a challenge brought by Republicans, the lower court had rejected three signatures that had issues with their dates on petitions Finkenauer submitted, which put her below a requirement that she collect at least 100 signatures in 19 different counties.",
    "Last year, the Campaign Legal Center filed a complaint with the nonpartisan Office of Congressional Ethics charging that Suozzi had made some 300 stock trades worth as much as $11 million without filing any disclosure forms, known as \"periodic transaction reports.\"",
    "? IA-Sen: The Iowa Supreme Court overturned a recent lower court ruling that had booted former Democratic Rep. Abby Finkenauer from the June 7 primary ballot on Friday, allowing her to continue her campaign for the right to take on Republican Sen. Chuck Grassley.",
    "Secretaries of State\n? GA-SoS: Landmark Communications also polled next month's Republican primary for secretary of state, where they find Rep. Jody Hice with a 35-18 lead over incumbent Brad Raffensperger while former Alpharetta Mayor David Belle Isle takes 10.",
    "Rutherford doesn't appear to have addressed the Ethics Committee's announcement yet, though a spokesperson previously acknowledged the congressman hadn't filed disclosure reports in a timely manner for the 2020 transactions flagged by Insider.",
    "Both of these polls are the first we have seen all year in either party's primary, which have been relatively low-key despite this year being the first contest in two decades to have neither an incumbent nor a former governor on the ballot.",
    "The spot rolls off a list of right-wing buzzwords and shows Shannon speaking to the camera to call himself an alliterative \"conservative, christian, capitalist\" and vowing to antagonize the \"Democrat Party\" [sic] and \"woke left\" if elected.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Because of those alterations, it's not clear whether Rutherford would run in the revised 4th District or the radically altered 5th; he currently holds the 4th but it would become considerably bluer while the new 5th would be much redder.",
    "A number of Democratic strategists likewise defended the advertisement, arguing that Rust Belt Democrats have long pushed a similar message, including the last Democrat to run for the Senate seat Ryan is now seeking, former Gov.",
    "De la Cruz struggled with fundraising, and her departure leaves Fung, who was the GOP's 2014 and 2018 gubernatorial nominee, facing just 2020 nominee Bob Lancia in the September primary for this open Democratic-held seat.",
    "\"I would've suggested that Tim introduce himself to voters with a more biographical ad,\" said Brown, who declined to back Ryan's decision to run the spot, adding, \"I don't have an opinion on whether it should stay up.\"",
    "? WI-Gov: Businessman Eric Hovde, who narrowly lost the GOP primary for Senate back in 2012, says he won't run for governor this year and is instead waiting out this cycle to consider running for Senate again in 2024.",
    "While Pruitt won plaudits from conservatives for rolling back Obama administration environmental protections, it remains to be seen just how willing voters will be to overlook his laundry list of corruption scandals.",
    "The most prominent name belongs to Jacksonville Mayor Lenny Curry, who was elected to a second four-year term in 2019 but can't run again due to term limits, though he declined to answer questions about his plans.",
    "1Q Fundraising\nThe deadline for federal candidates to submit their first quarter fundraising totals is April 15, and we consequently aren't including candidates for federal office in Friday's fundraising roundup.",
    "Finkenauer faces two other candidates for the Democratic nomination, though she recently released a poll giving her a dominant 64-15 lead over her nearest opponent, retired Navy Vice Adm. Mike Franken.",
    "? OR-Gov: State Treasurer Tobias Read has released a poll from FM3 Research that finds Read trailing state House Speaker Tina Kotek 25-20 with just weeks to go until the May 17 Democratic primary.",
    "The spot plays a clip of the former senator saying, \"We outsourced every single product sold in our stores,\" before highlighting his opposition to lowering gas and income taxes this year.",
    "After sustaining criticism for his first ad, Ryan was unmoved, saying in a statement, \"I will never apologize for doing everything in my power to take on China and fight for all Ohioans.\"",
    "? RI-02: State Sen. Jessica de la Cruz has announced she's dropping out of the Republican primary and will instead seek re-election, throwing her support behind Cranston Mayor Allan Fung.",
    "State Sen. Aaron Bean, state Rep. Jason Fischer, and Jacksonville City Councilman Rory Diamond were more forthcoming, each telling the Florida Times-Union they're potentially interested.",
    "While the committee did not say what the probe concerns, Suozzi's staff said it concerns allegations that he failed to file legally required disclosures of his stock trades.",
    "Kemp has led in every publicly available poll this year, though Landmark is one of the few to show the governor taking the outright majority needed to avoid a July runoff.",
    "The Supreme Court, however, held that the signatures in question were valid because Iowa law doesn't include missing or incorrect dates as a reason to strike a petition.",
    "Kemp has also debuted a new ad attacking Perdue over the latter's business record, arguing he \"made millions as a corporate raider\" who outsourced jobs to China.",
    "Several other notable Republicans are also reportedly eyeing this same pair of districts, though it's likely they'll wait to see which seat Rutherford chooses.",
    "? NY-Gov: The House Ethics Committee announced on Thursday that it's launching an investigation of Democratic Rep. Tom Suozzi, who is running for governor.",
    "House\n? FL-04, FL-05: Republican Rep. John Rutherford is a member of the House Ethics Committeeand now he's being investigated by that very same body.",
    "Indeed, by the time Pruitt stepped down in July 2018, he was the subject of at least 15 federal investigations into his conduct as a Trump official.",
    "Suozzi's office didn't seem to dispute the accusations, saying that \"all periodic transaction reports will be filed on a going-forward basis.\"",
    "However, with a hefty 56% of voters undecided, the pollster argues that the contest is still \"wide open\" and that Read has a path to victory.",
    "The script of the original ad, which was likewise narrated by Ryan himself, was even more bellicoseand prompted a heated response:\nChina.",
    "Asian American advocacy groups were likewise incensed, and even Sen. Sherrod Brown, who previously endorsed Ryan, questioned the choice.",
    "Last year, Insider also reported that Rutherford failed to disclose five other stock trades he made in 2020 valued at up to $75,000.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "But these operatives may want to reconsider whether Strickland's 2016 campaign is one to emulate: He lost to Republican Sen.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Shannon, state Sen. Nathan Dahm, former Inhofe chief of staff Luke Holland, and former White House staffer Alex Gray.",
    "The development comes as Florida lawmakers prepare to adopt a new congressional map proposed by Republican Gov.",
    "The main story, however, is that an enormous 68% of primary voters are undecided with one month left to go.",
    "However, we will bring you fundraising charts covering all notable House and Senate candidates this week.",
    "He joins a crowded June GOP primary that includes Rep. Markwayne Mullin, former state House Speaker T.W.",
    "The Ethics Committee said it would provide an update by July 29, well after New York's June 28 primary.",
    "It is us versus China and instead of taking them on, Washington's wasting our time on stupid fights.",
    "Ron DeSantis that would make major changes to the Jacksonville area, which Rutherford represents.",
    "Rob Portman by a 58-37 margin and ran 13 points on margin behind the top of the ticket.",
    "Meanwhile, Nelson Research shows an even less certain primary on the Republican side.",
    "However, multiple surveys have shown her losing to Grassley by double-digit margins.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Meanwhile, Shannon has gone up with his first TV ad, backed by a $200,000 buy.",
    "Todd asked Cuellar, \"What assurance did you get that you're not a target?\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "to which the congressman replied, \"I'll let my attorney speak to that.\"",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "They praise Kemp for reopening schools and businesses.",
    "America can never be dependent on communist China.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "We need to build things in Ohio by Ohio workers.",
    "China is out-manufacturing us left and right.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "It is time for us to fight back.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "It's time to fight back.",
    "Daily Kos is different.",
    "We need to fight back.",
    "It's definitely China.",
    "One word: China.",
    "Left and right.",
    "Ted Strickland.",
    "Please read it."
  ]
}