{
  "id": 2045,
  "mediaId": 195,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "Christie says Trump midterm endorsements won't be determinative'",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2020/10/christiechris1_1032020_gettyimages.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/sunday-talk-shows/3271194-christie-says-trump-midterm-endorsements-wont-be-determinative/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell/",
  "termIds": [
    761,
    761,
    1147,
    1147,
    1646,
    1646,
    1958,
    1958,
    2095,
    2095,
    428,
    428,
    98,
    98,
    2726,
    2726,
    2820,
    2820
  ],
  "sentences": [
    "Chris Christie (R) on Sunday said former President Trump's endorsements in the upcoming midterm elections will not be determinative.?\nAsked by anchor George Stephanopoulos on ABC's This Week? what role Trump's endorsements will play in November's midterm races, Christie said they will always be a factor? because of the ex-president's influence in the Republican Party but argued that they will not always determine the outcomes.",
    "The ex-New Jersey governor pointed to remarks from Senate Minority Leader Mitch McConnell (R-Ky.) in saying that Republicans must nominate candidates who can attract support from the general electorate.",
    "McConnell is right at core, that if Republicans don't nominate folks who can appeal to the general electorate then all this momentum will be stunted in those states,? Christie said.",
    "Christie's comments come more than six months out from the November midterm elections, when Republicans are looking to pick up seats and possible control of both chambers.",
    "It will always be a factor because the former president has influence inside the party, but I don't believe his endorsements will be determinative,? Christie said.",
    "The GOP needs to flip five seats red to take control of the House, while a 50-50 split in the Senate means they need to flip just one seat there.",
    "It did surprise me a lot and  but it's only $500,000, so it's not gonna do anything in a race where they're spending tens of millions,? he said.",
    "Trump has endorsed a number of GOP candidates running in November, most recently throwing his support behind Hillbilly Elegy? author J.D.",
    "Christie on Sunday said he was surprised by the contribution but said the funds will not make a difference in an already expensive race.",
    "The endorsement came after much anticipation in the Buckeye State, where a number of Republicans are vying for the GOP nomination.",
    "The former president's political action committee recently transferred $500,000 to a group working to oust incumbent Georgia Gov.",
    "Trump has also endorsed Mehmet Oz in the Pennsylvania Senate race and Rep. Ted Budd (R-N.C.) in North Carolina's Senate race.",
    "He has said that he will not defer to Trump when deciding whether to launch a bid for the White House in the next cycle.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Additionally, Trump is supporting former Sen. David Perdue (R-Ga.) in Georgia's GOP primary for governor.",
    "Christie's name has been floated as a potential GOP candidate in the 2024 presidential election.",
    "Trump has not firmly indicated if he plans on mounting another bid for a second term.",
    "If they pick the right people, then none of the momentum will be stunted,? he added.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Vance in Ohio's Republican primary for Senate.",
    "Former New Jersey Gov.",
    "Brian Kemp (R)."
  ]
}