{
  "id": 2046,
  "mediaId": 151,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: 3 ways the Ukraine war is changing the U.S.",
  "image": "https://www.politico.com/dims4/default/b01c8bf/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff2%2Fbb%2F04b0931a48e69e9b9d27967e7945%2Faptopix-russia-ukraine-war-47193.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/04/17/3-ways-the-ukraine-war-is-changing-the-u-s-00025708",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    895,
    946,
    1986,
    2030,
    2055,
    2095,
    403,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "Guy Reschenthaler (R-Pa.)  Dean Lieberman of the White House  CNN's Jim Acosta  NYT's Julie Hirschfeld Davis  Chris Durlak  Shaunna Thomas of UltraViolet  Leslie Dach of Protect Our Care  Venable's Jim Tyrrell  Jane Oates of WorkingNation  Greg Lemon  Jackie Whisman of the Information Technology and Innovation Foundation  Jennifer LaTourette  E&E News' Ev Crunden  POLITICO's Michelle Bocanegra, Angelica Botlo and Lauren Shafik  NatGeo's David Lindsey  Jessica Ehrlich  Jon Simons  Ed Gilroy  Jonathan Brodo  Sean Dalton  Benjamin Runkle  Gabi Porter  Eric Sayers of Beacon Global Strategies  Ken Jost  Marty Obst of MO Strategies  Brandon Howell of Repubclick  former Rep. George Holding (R-N.C.)\nDid someone forward this email to you?",
    "Despite some of the sharp partisan responses to his moves on Twitter  which have particularly delighted conservatives upset about Big Tech censorship  Peters writes that Musk is not just a libertarian: His paradoxical and random? positions follow few patterns except that they often align with his business interests,? which make[s] it difficult to say whether the elation and fear about how he would run the company are justified.?\nRelated read: A federal judge declared that tweets Musk wrote in 2018 saying he planned to take Tesla private were false and misleading,? and that Musk recklessly made the statements with knowledge as to their falsity.? More from Reuters\n9.",
    "The U.S. Army is incorporating takeaways from the war into its own training, with an eye on potential great-power conflicts with Russia or China, AP's Lolita Baldor reports from Fort Irwin, Calif. They're focusing on fighting in the information domain? against a powerful propagandist foe: The role-players have their phones ready to film and post quickly to social media.? U.S. training is also taking note of Russia's tactics  like its willingness to bombard cities into oblivion to win them  and its supply-chain/logistical failures on the ground.",
    "TOP-ED: NYT's Ross Douthat digs into the structural disaster Democrats are staring down post-2024, when they could be locked out of power even while winning majorities of the vote, and writes that neither party should celebrate such a recipe for delegitimization and reasonable disillusionment.? His prescriptions: Republicans should try to actually win majorities of public support by moving away from voter fraud? and RICK SCOTT's tax plan and DONALD TRUMP himself.",
    "Vance says the war's images are disgusting,? but he's sticking to his guns: Whatever is going on in Ukraine, we have to separate our personal reaction to it from  how we should respond as a country.?\nRelated reads: JOSH MANDEL is centering his bid on stops at evangelical churches, running a race steeped in Christianity?  even though he's Jewish, AP's Jill Colvin and Julie Carr Smyth report.",
    "SUNDAY BEST \n Ukrainian President VOLODYMYR ZELENSKYY on CNN's State of the Union,? on whether he's willing to concede territory in a peace deal: Ukraine and the people of our state are absolutely clear: We don't want anyone else's territory, and we are not going to give up our own.?  On the new $800 million in U.S. aid: Of course we need more, but I am happy that he is helping us now.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "I want people to take me as I am: a regular human.?\n Austrian Chancellor KARL NEHAMMER on Putin's frame of mind, on NBC's Meet the Press?: I think he believes he is winning the war.?\n House Minority Leader KEVIN MCCARTHY on the members of his conference who voted against a NATO support resolution, on Fox News Sunday?: There's a strong support for NATO moving forward  always has been.",
    " MissionWired has acquired Chapman Cubine Allen + Hussey, touting nearly 50 years of combined nonprofit and political outreach experience across email, SMS, mail, digital advertising, telemarketing, and more.?\nWEDDING  Kai Chen Yeo, partner at Echelon Insights, and Kevin Sobkoviak, a business development specialist at the tech startup Polco, got married in Chicago.",
    "POLITICO Playbook: 3 ways the Ukraine war is changing the U.S.\nBy ELI OKUN\n04/17/2022 10:57 AM EDT\n Updated 04/17/2022 11:31 AM EDT\n 2022-04-17T11:31-0400\nPresented by\nDRIVING THE DAY\nSeven weeks after his forces invaded Ukraine, Russian President VLADIMIR PUTIN is gearing up to take the war in a new, more narrow (but no less brutal) direction.",
    "Spanning from defense and finance to trade and international diplomacy,? from the National Security Strategy to the National Defense Strategy to NATO's next Strategic Concept document to energy imports to military budgets, the U.S. and Europe are fundamentally altering their approaches to Russia  perhaps for decades to come.",
    "She writes that AAF's uniform mudslinging in opposition to all nominees, led by TOM JONES, marks a new escalation in partisan warfare? in which obstructionism  is the end in itself.?\nCritics say the group's tactics could have a chilling effect on qualified people's willingness to serve in government.",
    "NATO is the process of defending themselves, but the one thing we need to make sure, these NATO countries spend the money, more than 2%.?\n White House Covid coordinator ASHISH JHA on whether the White House Correspondents' Dinner should be canceled, on Fox News Sunday?: I think we can gather safely.",
    "FOLLOWING THE MONEY, PART I: The New Yorker's Jane Mayer has a deep dive into the American Accountability Foundation, the conservative dark money group that has marshaled opposition to Biden administration nominees and helped steer criticism of KETANJI BROWN JACKSON's sentencing of sex offenders.",
    "But in several statehouses, long-standing low pay is forcing some legislators to quit because they just can't afford to keep serving, AP's Susan Haigh reports from Hartford, Conn. Efforts to raise pay have fallen short this year in Alaska, Connecticut, Georgia, New Mexico and Oregon.",
    "Close friends and allies of Graham and Biden say that it will take sustained effort to repair what has devolved into a contentious relationship that has been laden with public insults.?\nPLAYBOOKERS\nKim Reynolds and Brian Kemp need to brush up on their Jewish holidays.",
    "THE NEW DEMS: Los Angeles is deep blue, but voters' focus on crime and homelessness is pushing progressive candidates to the center  and helping billionaire, moderate developer RICK CARUSO challenge Rep. KAREN BASS at the front of the pack.",
    "In a world order remade by the war, even as we await its conclusion, the conflict is already changing the U.S. Three interesting stories this weekend highlight Ukraine's ripple effects for America's foreign policy, politics and military:\n1.",
    "About half those people were expelled from the country under the controversial Title 42 public health order, and Biden officials have cautioned that migration could rise further after U.S. health officials? lift it in about a month's time.",
    "I think if people put in good safeguards, they can make it substantially safer.?\nBIDEN'S SUNDAY  The Bidens will return to the White House from Camp David at 5:45 p.m.\nVP KAMALA HARRIS' SUNDAY  The VP has nothing on her public schedule.",
    "And The New Yorker's Benjamin Wallace-Wells, who writes that the race is a bellwether for the GOP's future, finds that in a primary swamped by big money and national media hits, the ground game in Ohio can seem like an afterthought.?\n3.",
    "LABOR FORCE FIELD: New research indicates that a staggering 3 million Americans who left the workforce during the pandemic won't return to it, which could prolong the country's shortage of workers for years, WSJ's Josh Mitchell scoops.",
    "But in Troy, WSJ's Joshua Jamerson finds that Republican voters mostly disagree with Vance, believing that the U.S. can play an active (though not direct military) role in supporting Ukraine while also addressing issues here at home.",
    "Alexander Nieves and Lara Korte report that [t]he crime-centric debate in Los Angeles is becoming a familiar story in big-city mayoral politics,? and many progressives are feeling disappointed and alienated by the tenor of the race.",
    "THE NEW GOP: Ahead of their state party convention Saturday, Michigan Republicans are riven by questions of loyalty to Trump and his lies about the 2020 election, NYT's Jazmine Ulloa and Nick Corasaniti report from Shelby Township.",
    "From Greenville, Miss., to Brandywine, Md., her travels are part of an approach in which she's homed her focus on the ways in which administration policy is intersecting with overlooked communities,? Eugene reports this morning.",
    "Where coexistence and cooperation once ruled the day, American and allied officials are now reorienting their long-term strategies toward isolating and enfeebling Putin's regime, WaPo's Karen DeYoung and Michael Birnbaum report.",
    "But Trump is pushing especially hard for his favored candidates for A.G. and secretary of state, whose endorsements from state party co-chair MESHAWN MADDOCK, typically a position that remains neutral, have rocked the boat.",
    "This group, often comprising less educated, lower-paid women, isn't just skipping the return to work  they also say they won't go back to shopping or dining out in person, in a phenomenon termed long social distancing.?\n10.",
    "And the Democratic Party should seek clarity about what kind of electoral reforms would actually accomplish something,? while working politically to win back culturally conservative Latinos and working-class whites.?\n4.",
    "LATEST DEVELOPMENTS IN UKRAINE \n Russia is on the verge of seizing Mariupol, but the outnumbered remaining Ukrainian forces haven't given up yet, even after Russians gave them an ultimatum that passed this morning.",
    " Devastating read: They Are Gone, Vanished': Missing Persons Haunt Ukrainian Village,? by NYT's Thomas Gibbons-Neff and Natalia Yermak in Husarivka: In a Russian-occupied village, five men went off to feed cattle.",
    "I feel that right now, we are having a cleaner dialogue.?  On whether President JOE BIDEN will visit: I think he will.?  On how he wants to be remembered: A human being that loved life to the fullest.",
    "applied for its tax-exempt status, it portrayed itself, under penalty of perjury, as a nonpartisan charity that would neither participate in political campaigns nor try to influence legislation.?\n2.",
    "More from The Hill\n North Korea reportedly launched two projectiles Saturday night, possibly missiles that could carry nuclear warheads, in yet another test of the weapons and the world.",
    "WITH FRIENDS LIKE THESE: In The State, Francesca Chambers and Caitlin Byrd report on the ex-friendship of Biden and Sen. LINDSEY GRAHAM (R-S.C.)  and whether they can ever get it back.",
    "5) Biden is helping Harris settle some old campaign obligations, including a donation from LEONARDO DICAPRIO, while Trump-affiliated PACs are paying for lawyers, catering and more.",
    "More from the NYT\n Russian attacks hit Brovary in the Kyiv area, where they said they destroyed an ammunition factory, and JOS ANDRS' community kitchen in Kharkiv, killing three.",
    "The administration believes that the symbolism of a vice presidential trip matters, and that when it's tied with some larger announcement, it has a clear downstream upside.?\n5.",
    "FOLLOWING THE MONEY, PART II: Zach Montellaro has a great breakdown of several top takeaways from the recent round of politicians' first-quarter fundraising disclosures.",
    "Still, there are plenty of undecided voters in the race, largely young people of color, who could tilt the balance  perhaps even in the direction of KEVIN DE LEN.",
    "More from The Post and Courier\n The White House rescheduled a special Association of Southeast Asian Nations summit that Biden is hosting for May 12-13.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nA FEW QUICK NEWS BITES:\n Fourteen people were injured in a mass shooting at a Columbia, S.C., shopping mall Saturday.",
    "The big picture  no surprise  is that gobsmacking sums of money are sloshing around our political system, much of it increasingly hard to follow.",
    "Here's how Zach lays out some of the lessons learned: 1) Senate incumbents, especially but not just Democrats, are building massive war chests.",
    "THE RICHEST MAN ON EARTH: NYT's Jeremy Peters takes a look at the complex politics of ELON MUSK as he stages a possible takeover of Twitter.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Bethany Irvine, Eli Okun and Garrett Ross.",
    "The state has a large Ukrainian American population, but it remains to be seen how much the conflict will sway votes in the heated primary.",
    "Advocates say higher salaries would help diversify statehouses  though there actually isn't much empirical evidence to support that claim.",
    "How the coming Donbas offensive unfolds could determine the outcome of the conflict and the future of Ukraine's sovereignty and borders.",
    "VP FILES: Harris has been hitting the road in some unconventional, not particularly politically valuable corners of the country lately.",
    "Their relatives and neighbors are wondering what happened to them.?\nHappy Easter Sunday morning, and thank you as always for reading.",
    "A DIFFERENT KIND OF WORKFORCE DROPOUT: There are few perennial bills less popular than lawmakers voting to raise their own salaries.",
    "She's doing more interviews with local press, and she's often bringing back ideas to the White House from her time on the road.",
    "They originally met through Nancy Jacobson, when Kevin was working on the Evan Bayh campaign and Kai was working at No Labels.",
    "He most recently was director of government affairs at Malouf Companies, and is an NFL government affairs and Rob Bishop alum.",
    "IN MEMORIAM  Wendy Rieger, the popular longtime host of Washington NBC affiliate WRC's 5 p.m. newscast, died on Sunday at 65.",
    "Harris' policy questions in meetings often emphasize how people in rural or otherwise underserved areas will be affected.",
    " Ukraine and Russia failed to reach agreement on humanitarian corridors for civilians to escape today, per Reuters.",
    "He previously was comms director for Rep. Judy Chu (D-Calif.) and the Congressional Asian Pacific American Caucus.",
    "That's the headline out of new border data that showed 210,000 such arrests last month, per Reuters' Ted Hesson.",
    "Drop me a line here, or get in touch with the rest of the team: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "2) Republican megadonors, including RUPERT MURDOCH, smell blood and are spending lots to flip Congress.",
    "[I]t was quite a surprise to find out that they lied to me,? one of the competitors tells the Times.",
    "It's Soviet containment? redux, and it's not sitting well with everyone (see the French election).",
    "It would be a key gain for Russia, but a victory very hard won after two months of siege tactics.",
    "AT THE BORDER: The highest monthly number of arrests at the Mexico border since February 2000.",
    "4) Many dark-money groups are shielding their donors, even as the FEC plans some crackdowns.",
    "The National Zoo celebrated the 50th anniversary of the arrival of their first giant pandas.",
    "His political donations tend to be small and distributed to both Democrats and Republicans.",
    "TRANSITIONS  Ben Suarato is now director of comms, branding and marketing at Dream Corps.",
    "Ukraine has become a flashpoint in the Ohio Senate GOP primary, mainly due to J.D.",
    "Note to the Club for Growth: Bo Hines is running for the House, not the Senate.",
    "The cause was glioblastoma, a form of brain cancer, according to WaPo's obit.",
    "But in the U.S., there's broad support for the approach across party lines.",
    "Establishment Macomb County Republicans overthrew their MAGA leaders.",
    " Ethan Dursteler is now a portfolio manager at Stand Together.",
    "One suspect has been arrested; others are still being sought.",
    "I don't think events like that need to be canceled.",
    "3) Big crypto players are donating more than ever.",
    "The number constituted a 24% rise year over year.",
    "Send Playbookers tips to playbook@politico.com.",
    "And loved his family and loved his motherland.",
    "The West is rewriting its plans for Russia.",
    "More from NPR\n11 THINGS FOR YOUR RADAR:\n1.",
    "Go pound sand.? Notable: When the A.A.F.",
    "VANCE's outspoken isolationist views.",
    "Jones himself told Mayer, Ms.",
    "HAPPY BIRTHDAY: Montana Gov.",
    "Definitely not a hero.",
    "That's the key point.",
    "Greg Gianforte  Rep.",
    "Sign up here.",
    "Meyers .",
    "11.",
    "6.",
    "7.",
    "8.",
    "3.",
    "2.",
    ".",
    "."
  ]
}