{
  "id": 2051,
  "mediaId": 151,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "GOP megadonors go big in battle for Congress: 5 takeaways from new campaign money filings",
  "image": "https://www.politico.com/dims4/default/76f924e/2147483647/legacy_thumbnail/1200x849%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F05%2F49%2F9e512fb1419c868bd1ed487655a7%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F453214770",
  "link": "https://www.politico.com/news/2022/04/16/gop-megadonors-congress-campaign-finance-disclosures-00025693",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    886,
    1136,
    2095,
    2202,
    2395,
    118,
    183,
    428,
    562,
    571,
    2818
  ],
  "sentences": [
    "Make America Great Again PAC, another PAC he controls, spent over $1 million on legal consulting from megafirms like Jones Day to boutique attorneys in Georgia, and the group also spent $1.2 million on expenses labeled as recount: research consulting.?\nSave America Joint Fundraising Committee  a fundraising arm of several of his political operations  raised $19 million in the quarter, spending over $6 million on SMS and online advertising and list rentals.",
    "Here are five takeaways from the latest campaign money developments:\nSenators build enormous cash reserves\nDemocratic incumbents facing the toughest races this year have stockpiled major cash so far, far outstripping the financial resources of most potential Republican opponents, who still have to survive primaries for the right to face them in November.",
    "POLITICO pored over the first quarter's Federal Election Commission filings for super PACs and candidates, looking for the latest trends shaping the 2022 elections  including huge amounts of dark money flowing into the campaign and the crypto industry flexing its muscles in Democratic primaries.",
    "POLITICO previously reported that Protect Our Future had planned on spending at least $10 million in contests, and new filings from that group reveal that a majority of that group's early funding comes from Prime Trust LLC, a Nevada-based crypto company, which kicked in $14 million.",
    "Honor Pennsylvania, which has supported investor David McCormick in the open Senate primary and has attacked physician Mehmet Oz in the race, raked in nearly $10 million, which includes $2.5 million from Griffin, $1 million from Paul Singer and $500,000 for Schwarzman.",
    "Meanwhile, former President Donald Trump's main political arm  his leadership PAC Save America, which had a warchest of $110 million as of the end of February  was not required to file new disclosures on Friday, but several other groups affiliated with him were.",
    "It gave $3 million to Pennsylvania Conservative Fund, which has attacked Oz, and $2 million to the group America's Promise, which in turn gave over $2 million to Alabama Patriots PAC, which has supported Michael Durant in the state's open Senate race.",
    "| Alex Wong/Getty Images\nBy Zach Montellaro\n 04/16/2022 12:35 PM EDT\nThe battle for Congress has gone into overdrive, with tens of millions of dollars flowing into campaigns and outside groups as both the House and Senate hang in the balance.",
    "Anonymous money reigns\nThe LLC donation to Protect Our Future was among the biggest single donations we saw in the first quarter, but there was plenty more money flowing into federal elections without an actual donor name attached to it.",
    "Biden floats money to Harris, while Trump pays a lot of lawyers\nPresident Joe Biden's mostly dormant campaign operation transferred $560,000 to Kamala Harris For The People, his now-vice president's former presidential campaign.",
    "Sensing opportunity, GOP megadonors open their checkbooks even wider\nWith the political winds at their backs, deep-pocketed Republicans have been pouring money into super PACs with ties to Republicans' Senate and House leaders.",
    "Web3 Forward, another super PAC, got $2 million from another crypto-backed organization GMI PAC, which was backed in part by Trump aide-turned-foe Anthony Scaramucci and has also spent seven figures on advertising already.",
    "Crypto pours into 2022\nThe crypto industry has increasingly flexed its muscles in Washington, and major players are starting to pour significant money into super PACs that have already spent millions on the 2020 election.",
    "Republican donors including private equity exec Stephen Schwarzman and hedge funder Ken Griffin poured millions more into major GOP super PACs in the first three months of 2022, according to new campaign finance filings.",
    "The Harris campaign is also carrying debt: over $300,000 to Maryland's comptroller for payroll taxes? (her former campaign was based out of Baltimore) and $100,000 in outstanding legal fees and expenses.",
    "Kelly has $25.6 million stockpiled after bringing in an eye-popping $13.6 million for the quarter, while Warnock had $23.3 million in the bank after raising $11.4 million over the last three months.",
    "Watch this space going forward: The FEC also signaled on Friday that it could start cracking down on some dark money donations from companies created solely to shield megadonors' identities.",
    "The Senate Leadership Fund, controlled by allies of Senate Minority Leader Mitch McConnell, brought in $27 million in the quarter and bumped its cash reserves to more than $72.3 million.",
    "Sen. Ron Johnson (R-Wis.) had the smallest stockpile of any battleground incumbent senator, sitting on $3.6 million after only kicking his campaign into gear in recent months.",
    "And while Sen. Tim Scott (R-S.C.) isn't expected to have a competitive election later this year, he's fundraising  and spending  like a potential 2024 presidential candidate.",
    "Americans for Secure Elections, which has run ads boosting Ohio Republican Secretary of State Frank LaRose, received its funding from three vaguely named organizations.",
    "Everytown for Gun Safety  the pro-gun control group founded by Michael Bloomberg  also gave a pair of small in-kind donations for polling don't add up to six figures.",
    "The two possess some of the most formidable fundraising operations in politics  because they need them, representing two of the closest states from the 2020 election.",
    "Harris' campaign disgorged to the U.S. treasury hundreds of thousands of dollars of old donations that were likely donations that went over 2020 contribution limits.",
    "Sen. Catherine Cortez Masto (D-Nev.) had $11.1 million, Sen. Maggie Hassan (D-N.H.) had $7.6 million and Sen. Michael Bennet (D-Colo.) had $6.1 million.",
    "But Democratic candidates are also stockpiling cash from big and small donors alike to defend their seats, especially the key Senate battlegrounds.",
    "Democrats' leading Senate and House super PACs file on a monthly schedule, so their next reports covering their activity in March is due April 20.",
    "Many of the major Democratic super PACs are expected to file later this month, but some Democratic dark money still cropped up in these filings.",
    "(One of its biggest donors over that time period was Ohio Senate candidate Mike Gibbons, who missed out on Trump's endorsement in that primary.)",
    "The biggest one has been Protect Our Future, the effort supported by Sam Bankman-Fried, the billionaire CEO of the cryptocurrency exchange FTX.",
    "Republicans' flagship House super PAC, Congressional Leadership Fund, which is tied to House Minority Leader Kevin McCarthy, fared even better.",
    "CLF brought in nearly $38 million, including $10 million from Schwarzman, $7.5 million from Griffin, and several other seven-figure checks.",
    "One of Senate Leadership Fund's largest donors was its own affiliated dark money? nonprofit One Nation, which kicked in $2.1 million.",
    "Sixteen Thirty Fund was the sole funder for a group called Alaskans for Bristol Bay Action, giving $600,000 to the organization.",
    "Brian Kemp received over $2 million in dark money donations, and none of its first-quarter funding was from named donors.",
    "Some organizations that appear to have been formed to back a single candidate also have opaque fundraising mechanisms.",
    "Perhaps the most interesting donation was the $2 million contribution from Rupert Murdoch, the Fox Corporation honcho.",
    "Leading the pack is a pair of senators who won office in 2020 special elections and are now seeking full terms: Sens.",
    "A mysterious organization called Defending America Together? has also poured money into Republican Senate primaries.",
    "Sen. Marco Rubio (R-Fla.)  a one-time and perhaps future presidential candidate  stored away $13.1 million.",
    "Congressional Leadership Fund got over $6 million from its nonprofit affiliate, American Action Network.",
    "A $318,000 payment to Trump's Mar-a-Lago Club for event expense: facility rental and catering services.?",
    "Some of the same big donors have also gotten involved in individual states, including in GOP primaries.",
    "A corporation with that name was registered in Delaware in January, according to state records there.",
    "The groups' FEC filings list Defending America Together's address as a UPS store in Phoenix.",
    "One group supporting former Sen. David Perdue's primary challenge against Georgia GOP Gov.",
    "Scaramucci also gave $100,000 to a fourth group called Crypto Innovation in the quarter.",
    "The reason appears fairly mundane: Harris' campaign has some obligations to settle.",
    "The donations all arrived before Trump endorsed Oz in the race earlier this month.",
    "But all the other Democratic incumbents had a sizable amount of money socked away.",
    "The group has already disclosed nearly $13 million in spending across four races.",
    "The group has already spent millions in Democratic primaries across the country.",
    "Stephen Schwarzman participates in a session of the U.S.-Africa Business Forum.",
    "The group got a $10 million check from Schwarzman and $5 million from Griffin.",
    "His campaign raised nearly $4 million and has $23.4 million in the bank.",
    "The two Republicans in battleground states also have large warchests.",
    "And a Trump-blessed super PAC  Make America Great Again, Again!",
    " brought in $4.3 million and has $12.5 million cash on hand.",
    "The super PAC's single largest line item in the quarter?",
    "Mark Kelly of Arizona and Raphael Warnock of Georgia.",
    "The group did not report any expenditures.",
    "(On this list was Leonardo DiCaprio.)"
  ]
}