{
  "id": 2054,
  "mediaId": 129,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "Will Democrats Soon Be Locked Out of Power?",
  "image": "https://static01.nyt.com/images/2022/04/18/opinion/16douthat1/16douthat1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/16/opinion/democrats-republicans-majority.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1158,
    1315,
    1813,
    1930,
    2087,
    2095,
    2475,
    2491,
    146,
    428,
    571,
    2862
  ],
  "sentences": [
    "According to calculations by liberalism's Cassandra, David Shor, the convergence of an unfavorable Senate map for Democrats with their pre-existing Electoral College and Senate disadvantages could easily produce a scenario where the party wins 50 percent of the congressional popular vote, 51 percent of the presidential vote  and ends up losing the White House and staring down a nearly filibuster-proof Republican advantage in the Senate.",
    "Second, to the extent that there's a Democratic path back to greater parity in the Senate and Electoral College without structural reform, it probably requires the development of an explicit faction within the party dedicated to winning back two kinds of voters  culturally conservative Latinos and working-class whites  who were part of Barack Obama's coalition but have drifted rightward since.",
    "And crucially, not in the tactical style favored by analysts like Shor, but in the language of principle: Rightward-drifting voters would need to know that this faction actually believes in its own moderation, its own attacks on progressive shibboleths, and that its members will remain a thorn in progressivism's side even once they reach Washington.",
    "That faction would have two missions: To hew to a poll-tested agenda on economic policy (not just the business-friendly agenda supported by many centrist Democrats) and to constantly find ways to distinguish itself from organized progressivism  the foundations, the activists, the academics  on cultural and social issues.",
    "It means rejecting the attempts to return to the libertarian makers versus takers? politics of Tea Party era, currently manifested in Florida Senator Rick Scott's recent manifesto suggesting tax increases for the working class  basically the right-wing equivalent of defund the police? in terms of its political toxicity.",
    "From the Republican Party's perspective, the best way to avoid this future  where the nature of conservative victories undercuts the perceived legitimacy of conservative governance  is to stop being content with the advantages granted by the system and try harder to win majorities outright.",
    "But a scenario where one party has sustained governing power while lacking majoritarian support is a recipe for delegitimization and reasonable disillusionment, which no clever conservative column about the constitutional significance of state sovereignty would adequately address.",
    "Especially in the current climate, which looks dire for the Democrats, the Republicans have an opportunity to make the Electoral College complaint moot, for a time at least, by simply taking plausible positions, nominating plausible candidates and winning majorities outright.",
    "In recent years, as their advantages in both institutions have increased, conservatives have defended institutions like the Senate and the Electoral College with variations of the argument that the United States is a democratic republic, not a pure democracy.",
    "But more Americans voted for Republican congressional candidates than Democratic congressional candidates, and more Americans voted for right-of-center candidates for president  including the Libertarian vote  than voted for Hillary Clinton and Jill Stein.",
    "Throughout the Trump era it was a frequent theme of liberal commentary that their political party represented a clear American majority, thwarted by our antidemocratic institutions and condemned to live under the rule of the conservative minority.",
    "The Electoral College's legitimacy can stand up if an occasional 49-47 percent popular vote result goes the other way; likewise the Senate's legitimacy if it tilts a bit toward one party but changes hands consistently.",
    "A different reform idea, statehood for the District of Columbia and Puerto Rico, wouldn't have happened in this period either, but it's much more responsive to the actual challenges confronting Democrats in the Senate.",
    "So if you're a liberal activist or a legislator planning for the next brief window when your party holds power, pushing for an expanded Senate seems like a more reasonable long ball to try to train your team to throw.",
    "That's been lacking in the Biden era, where liberal reformers wasted considerable time and energy on voting bills that didn't pass and also weren't likely to help the party much had they been actually pushed through.",
    "(They would fall apart completely in the scenario sought by Donald Trump and some of his allies after 2020, where state legislatures simply substitute their preferences for the voters in their states.)",
    "First, to the extent the party wants to focus on structural answers to its structural challenges, it needs clarity about what kind of electoral reforms would actually accomplish something.",
    "That means rejecting the politics of voter-fraud paranoia  as, hopefully, Republican primary voters will do by choosing Brian Kemp over David Perdue in the Georgia gubernatorial primary.",
    "You can't expect a political party to simply cede its advantages: There will never be a bipartisan constitutional amendment to abolish the Senate, on any timeline you care to imagine.",
    "has done of late  to seek to win more elections the way that Ronald Reagan and Richard Nixon won them, rather than being content to keep it close and put their hopes in lucky breaks.",
    "And Republican structural advantages, while real, did not then prevent Democrats from reclaiming the House of Representatives in 2018 and the presidency in 2020 and Senate in 2021.",
    "These victories extended the pattern of 21st century American politics, which has featured significant swings every few cycles, not the entrenchment of either party's power.",
    "A Republican Party that managed to win popular majorities might still see its Senate or Electoral College majorities magnified by its structural advantages.",
    "But they don't have an agenda for them to coalesce around, a group of donors ready to fund them, a set of intellectuals ready to embrace them as their own.",
    "As for what the Democrats should do about their disadvantages  well, that's a longer discussion, but two quick points for now.",
    "Necessity, however, is the mother of invention, and necessity may impose itself upon the Democratic Party soon enough.",
    "In strictly majoritarian terms, liberalism deserved to lose in 2016, even if Trump did not necessarily deserve to win.",
    "Right now the Democrats have scattered politicians, from West Virginia to New York City, who somewhat fit this mold.",
    "And it means  and I fear this is beyond the G.O.P.'s capacities  nominating someone other than Donald Trump in 2024.",
    "These arguments carry less weight, however, the more consistently undemocratic the system's overall results become.",
    "The political landscape after 2024, however, might look more like liberalism's depictions of its Trump-era plight.",
    "That's a scenario for liberal horror, but it's not one that conservatives should welcome either.",
    "It's very different from losing the popular vote consistently and yet being handed power anyway.",
    "But you can expect a political party to show a little more electoral ambition than the G.O.P.",
    "Yes, Donald Trump won the presidential election of 2016 with a minority of the popular vote.",
    "But such magnification is a normal feature of many democratic systems, not just our own.",
    "In the political context of 2016-20, this belief was overstated."
  ]
}