{
  "id": 2058,
  "mediaId": 136,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump-Backed Candidates Face Increased Attacks From GOP as Primaries Loom",
  "image": "https://d.newsweek.com/en/full/2021281/donald-trump-north-carolina.webp?w=790&f=ad406c3b9698f9e7c4e26eb046e7b249",
  "link": "https://www.newsweek.com/trump-backed-candidates-face-increased-attacks-gop-primaries-loom-1698306",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1147,
    1237,
    1646,
    1801,
    2087,
    2095,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Sean Parnell, who previously had Trump's endorsement in the Pennsylvania race before withdrawing over a child custody battle with his estranged wife, told Politico that he's been receiving frustrated phone calls from fellow Republicans.",
    "That [he's] walking off the plank that Donald Trump has put out there for him here in Georgia,\" Georgia Lieutenant Governor Geoff Duncan, a Republican, told ABC News in late March ahead of a Trump rally in the state.",
    "JD Vance is widely known by Republican Primary voters for his Never-Trumper comments and his calling Trump supporters 'racists,'\" Titus Bond, the Remington Research president, wrote in the memo, Politico reported.",
    "In Georgia, Trump is looking to settle a personal vendetta against Republican Governor Brian Kemp, who declined to work with Trump in his effort to overturn President Joe Biden's narrow victory in the state.",
    "Trump has been traversing the country over the past couple months, hosting rallies nearly every weekend in various states alongside Republican candidates he has endorsed ahead of the upcoming GOP primaries.",
    "Another recent poll by the University of Georgia's School of Public and International Affairs showed Kemp leading Perdue 48 percent to 37 percent among voters who were unaware of Trump's endorsement.",
    "Meanwhile, Republicans in Tennessee's state legislature attempted to legally prevent Trump-endorsed Morgan Ortagus from being allowed to run to represent the state's 5th District in Congress.",
    "\"Since he is already known to Ohioans as a self-proclaimed 'Never Trumper' and voters will forcefully be reminded of that, Vance will still lose even with President Trump's endorsement.\"",
    "But the debate over some of Trump's picks demonstrates the ongoing tensions within the GOP over the party's future, even if its voters have largely aligned behind the former president.",
    "Because it wasn't signed or vetoed within 10 days, the bill automatically became law, but it didn't go into effect until after the filing deadline for candidates.",
    "Some Republicans have expressed concern that some Trump-backed candidates will hurt the party's chances of maintaining or flipping seats in the general election.",
    "Some of the Republican primary candidates endorsed by former President Donald Trump are facing significant opposition from fellow members of the GOP.",
    "While that legislation passed the Tennessee state House and Senate, Republican Governor Bill Lee did not sign it but sent it back to the legislature.",
    "In reality, the former president's support has had mixed resultsas is the case with most former and current presidents and other prominent officials.",
    "\"RINOS in Tennessee who are trying to pull strings and illegally remove President Trump's endorsed candidate...from the ballot,\" Budowich told CNN.",
    "He has lived with us through the screen and has always been popular, respected, and smart,\" the former president said in a statement last weekend.",
    "The former Trump State Department spokesperson, who moved to the state last year, also has the backing of former Secretary of State Mike Pompeo.",
    "In Pennsylvania, Trump endorsed physician and prominent television personality Mehmet Oz in his bid to replace outgoing GOP Senator Pat Toomey.",
    "Budowich criticized the efforts by \"power-hungry insiders...to deprive voters of the opportunity to elect the strong America First champion.\"",
    "Remington Research, a polling firm associated with Vance rival Josh Mandel's campaign, began circulating a memo to prominent Republicans.",
    "\"The bill was not signed into law before the April 7th filing deadline,\" Tennessee secretary of state spokesperson Julia Bruck told CNN.",
    "A Trump spokesperson, Taylor Budowich, criticized Republicans in Tennessee attempting to prevent Ortagus' candidacy from going forward.",
    "Stone included an image of Oz on his television show flexing his bicep as former first lady Michelle Obama, a Democrat, did the same.",
    "right-wing strategist Roger Stone, a Trump ally who received a pardon from the former president, wrote on Sunday in a Telegram post.",
    "The memo said that even with Trump's support, Vance would manage only fourth place with just 15 percent support among GOP voters.",
    "Just 39 percent of Georgia's GOP voters backed Perdue while 50 percent supported Kempan 11-point lead for the incumbent governor.",
    "\"We're going to see a rally show up that's once again going to confuse Georgians, and who knows what Donald Trump's gonna say.\"",
    "Trump has backed former GOP Senator David Perdue to oust Kemp, but polls suggest Kemp is well-positioned ahead of the primary.",
    "In a separate group that was aware of Trump's support for Perdue, the former Republican senator saw only a 2 percent boost.",
    "Polling data showed that a Trump endorsement of Vance would not push the Republican contender into winning territory.",
    "The GOP-supported state legislation requires candidates to have voted in three previous statewide general elections.",
    "\"The requirement does not apply retroactively to candidates who met the qualification deadline at noon on April 7.\"",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "Several are facing significant pushback and Republican-backed efforts to prevent them from winning their primaries.",
    "\"My phone has been ringing off the hook from committee chairs in Pennsylvania saying, 'What the heck is going on?",
    "My phone has been ringing off the hook from committee chairs in Pennsylvania saying, 'What the heck is going on?",
    "I'll say it, I'm not afraid to say it,\" Fox News host Laura Ingraham said on her Tuesday night show.",
    "That decision drew swift backlash from some Republicans who do not view Oz as a real conservative.",
    "Trump has repeatedly bragged in the past about his endorsements, arguing that he picks winners.",
    "Vance, Republicans are already working to lobby the former president against that endorsement.",
    "As a result, Ortagus will be allowed to continue her campaign in the crowded GOP primary.",
    "In Ohio's GOP Senate primary, where Trump is rumored to be planning to back J.D.",
    "A Fox News poll released in March showed Kemp with a substantial lead.",
    "\"JD Vance will still lose even with President Trump's endorsement.",
    "Duncan said that Trump is \"out to settle a score\" in Georgia.",
    "\"And that's no way to keep conservative leadership in power.\"",
    "Newsweek reached out to Trump's press office for comment.",
    "\"I think it was a mistake for Trump to endorse Oz.",
    "\"You almost feel bad for David Perdue.",
    "President endoresd [sic] this guy ?\"",
    "What was President Trump thinking?'\"",
    "What was President Trump thinking?'",
    "Parnell said.",
    "\"Wait ?"
  ]
}