{
  "id": 2060,
  "mediaId": 305,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Federal Judge Rules Against Stacey Abrams' Campaign on Fundraising",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/9520a5d2b51097e0547478bb41ef752f.jpg",
  "link": "https://www.theroot.com/federal-judge-rules-against-stacey-abrams-campaign-on-f-1848798277",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Keith Reed",
  "authorUrl": "https://www.theroot.com/author/kreed3110",
  "termIds": [
    2095,
    2095,
    1951,
    1951,
    861,
    861,
    1389,
    1389,
    1438,
    1438,
    146,
    146,
    2672,
    2672
  ],
  "sentences": [
    "From the AJC\nBut Abrams said in court pleadings that when a lawyer contacted the state ethics commission to confirm that her leadership committee could begin raising and spending money before May 24, a commission lawyer said he needed to seek legal advice from Georgia Attorney General Chris Carr and Secretary of State Brad Raffensperger as to whether state law considers Abrams the nominee\nAbrams called the law unconstitutional in court filings, labeling it a poorly-designed, if potent, scheme for incumbency protection? benefiting Kemp.",
    "Kemp, who effectively enjoys two campaign committees  one of which can raise funds in unlimited amounts as he looks ahead to a competitive statewide election in the foremost swing state in the nation.?\nCohen's ruling rejects Abrams arguments, which means that at least until May 24, the scheme of Republicans in Georgia's state legislature has worked.",
    "Abrams and One Georgia sued last month, arguing that the law was unconstitutional, and further that she should be exempt from fundraising caps since she has no opponent in the May 24 Democratic primary, making her the party's de facto nominee.",
    "In 2021, Georgia's Republican-controlled General Assembly passed a law that exempts some incumbentsparticularly the governor and lieutenant governoras well as party nominees for elected offices from fundraising caps on their campaigns.",
    "A federal judge issued a ruling in a case over a political fundraising law in Georgia that will put Democratic gubernatorial candidate Stacey Abrams and even some Republicans at a big disadvantage as they try to unseat Gov.",
    "Candidates in those positions can create so-called leadership committees that don't have to abide by the $7,600 cap on donations from individuals in general elections, while all other candidates do.",
    "The law was clearly intended to give Kemp an advantage on fundraising in the lead up to this year's gubernatorial race, as Abrams has proven a formidable fundraiser since her last campaign in 2018.",
    "The leadership committees can also coordinate directly with candidates' campaigns, something that a traditional political action committee, such as Abrams' One Georgia, cannot do.",
    "With the law in place, it effectively gives Kemp a head start over Abrams and even his Republican challengers like former U.S. Sen. David Perdue, who filed a separate lawsuit.",
    "Cohen wrote that he, will not rewrite Georgia law,? to allow Abrams to play by the same rules that, ironically, the state's legislature rewrote last year to Kemp's advantage.",
    "U.S. District Court Judge Mark Cohen ruled that Abrams can't start raising unlimited funds for her campaign under a new Georgia law that allows her potential opponent, Gov.",
    "Georgia's Democratic Party chair, Nikema Williams, even sent a letter to the state saying that the state recognizes Abrams as its nominee.",
    "By January, Kemp had raised $2.3 million through his Georgians First Leadership Committee, according to the Atlanta Journal-Constitution.",
    "Plaintiffs thus are competing to raise funds with one hand tied behind their backs compared to Gov.",
    "Brian Kemp, a Republican, to do the same.",
    "Brian Kemp."
  ]
}