{
  "id": 2068,
  "mediaId": 129,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump Endorses J.D. Vance in Republican Primary for Senate in Ohio",
  "image": "https://static01.nyt.com/images/2022/04/15/us/politics/15pol-ohio-vance/merlin_202912767_67fc18cf-bcce-46ce-a981-ca17a2f3ea27-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/15/us/politics/ohio-jd-vance-trump-endorsement.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2466,
    2466,
    1801,
    1801,
    668,
    668,
    683,
    683,
    946,
    946,
    1147,
    1147,
    571,
    571,
    428,
    428,
    2845,
    2845
  ],
  "sentences": [
    "Calling Mr. Vance our best chance for victory in what could be a very tough race,? Mr. Trump said in a statement that the candidate was strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election.?\nThe move amounted to a major bet on Mr. Vance and on Mr. Trump's influence over Republican primary voters in conservative-leaning Ohio, where several high-profile candidates are facing off in a contentious and at times nasty campaign to replace the retiring Senator Rob Portman, a Republican.",
    "He has a long public history of supporting Republican candidates, including Donald Trump in 2020.?\nThe campaign also pointed to polling that showed Mr. Vance in second place behind Mr. Mandel, as well as a tweet from one Republican Party county chairman denying that he had signed the letter, and another tweet from the anti-abortion group Ohio Right to Life PAC that expressed support for a Trump endorsement of Mr. Vance.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.?\nAccording to one of the Republicans familiar with Mr. Trump's thinking, he was swayed by several factors, one of which was seeing video clips of a Republican primary debate in which two of the candidates, Mr. Mandel and Mr. Gibbons, nearly came to blows.",
    "Mr. Johnson helped circulate the letter from Republican leaders in Ohio, which stated that Mr. Vance was not a registered Republican and provided Mr. Trump with a list of negative comments that Mr. Vance had made against him, including calling him another opioid? in 2016.\nWhile we were working hard in Ohio to support you and Make America Great Again, J.D.",
    "Ahead of the endorsement, many Republican county party leaders expressed frustration that Mr. Trump might select Mr. Vance, the author of the best-selling 2016 memoir Hillbilly Elegy.? They noted that he had spent much of his life in San Francisco and had been critical of Mr. Trump even as they worked to elect him.",
    "In one of his biggest gambles, Mr. Trump recently gave his backing in the Republican Senate primary in Pennsylvania to the celebrity doctor Mehmet Oz, despite a concerted effort by supporters of the other leading candidate, David McCormick, to persuade Mr. Trump to stay neutral.",
    "With the May 3 primary less than three weeks away, limited polling has shown Mr. Vance struggling to break through against rivals including Josh Mandel, a former Ohio state treasurer; Jane Timken, a former chairwoman of the Ohio Republican Party; and Mike Gibbons, a financier.",
    "In the tweet, the group's chairman, Marshal Pitchford, said that the former president would be making a fantastic choice? in backing Mr. Vance, adding that he was 100 percent pro-life without exceptions? and would continue Mr. Trump's pro-life victories? in the Senate.",
    "More than three dozen Republican county and state committee leaders urged the former president in a letter not to endorse Mr. Vance, questioning his Republican credentials and noting that he had repeatedly denounced Mr. Trump during the 2016 presidential campaign.",
    "The highly coveted endorsement came after weeks in which the race's top candidates veered increasingly to the right in pursuit of Mr. Trump's support, with tension and anticipation rising ahead of a planned visit to the state by the former president on April 23.",
    "He referred to your supporters as racists.'?\nAsked for comment, including about the accusation that Mr. Vance is not a registered Republican, Taylor Van Kirk, a spokeswoman for the Vance campaign, said: When he has voted in primaries, J.D.",
    "The survey suggested that Mr. Trump's endorsement would give Mr. Vance only a five-percentage-point bump in support, which Mr. Trump took as an affront, the Republican familiar with the former president's thinking said.",
    "Mr. Trump has been increasingly looking toward a prospective 2024 presidential campaign of his own, and he is said to see Mr. Vance as a reliable ally in the Senate on issues he cares about, like trade and immigration.",
    "He is the guy who worked against Trump and spoke against Trump and told everybody he didn't vote for Trump,? said David Johnson, the chairman of the Columbiana County Republican Party, who has endorsed Ms. Timken.",
    "Few races across the country have captured Mr. Trump's effect in Republican primaries in the way that Ohio's Republican Senate campaign has, with candidates seeking to model themselves after the former president.",
    "Vance in the Republican primary election for Senate in Ohio, aiming to give the candidate a needed boost in a crowded race that will test Mr. Trump's potency as a kingmaker in key congressional contests.",
    "Mr. Trump has also told allies that he believes the leading Democratic candidate, Representative Tim Ryan, will be a difficult opponent in the general election and that he thinks Mr. Vance can beat him.",
    "But Mr. Trump had all but decided days earlier to support Mr. Vance, according to four Republicans familiar with his thinking, who spoke on the condition of anonymity to discuss private deliberations.",
    "In recent days, as news reports trickled out that Mr. Vance was likely to win Mr. Trump's backing, supporters of other candidates engaged in last-ditch efforts to prevent the endorsement.",
    "The move amounts to a major bet on Mr. Vance's ability to prevail over a crowded field, and on the former president's power to alter the course of key congressional races.",
    "Mr. Trump was lobbied heavily by supporters of Mr. Vance including the billionaire Peter Thiel, the Fox News host Tucker Carlson and his own son, Donald Trump Jr.",
    "It ended any chance that Mr. Trump, who credits the 2016 presidential debates for his victory that year, might have endorsed either of them, the Republican said.",
    "In stump speeches, Mr. Vance has been quick to address the criticism that he has not always been a Trump loyalist, often saying that the best policy is honesty.",
    "Still, the move carries significant risks for Mr. Trump, whose endorsements in other marquee races across the country have not yet proven decisive.",
    "Most of the contenders have railed against undocumented immigrants, and only one has recognized President Biden as the nation's legitimate leader.",
    "And a last-minute effort to stop Mr. Trump's endorsement that included releasing an internal Mandel campaign poll appears to have backfired.",
    "I was very happy to be proven wrong.?\nHe added, I was very proud to support the president over the past several years.?",
    "I didn't like Trump six years ago,? he told supporters this week at a brewery in Hilliard.",
    "Former President Donald J. Trump on Friday endorsed the author and venture capitalist J.D.",
    "Mr. Trump was also impressed by Mr. Vance's performance after watching the last debate.",
    "Mr. Trump called Mr. Vance to alert him to the endorsement before it became public.",
    "Dr. Oz and Mr. Mandel use the same consulting firm, run by the strategist Jeff Roe.",
    "In Georgia, his attempt to fuel David Perdue's Republican primary challenge to Gov.",
    "Vance was actively working against your candidacy,? the letter says.",
    "I did not think he was going to be a good president.",
    "Brian Kemp has largely been seen as underwhelming.",
    "In his statement on Friday, Mr. Trump said, J.D.",
    "No one has emerged as a clear front-runner.",
    "has always voted in Republican ones."
  ]
}