{
  "id": 2084,
  "mediaId": 19,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Exclusive  Poll: Trump-Backed Vernon Jones Leads Georgia 10th District in Tight Primary",
  "image": "https://html.scribdassets.com/8rkwaatibk9pzfg8/images/1-d9c14a3286.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/14/exclusive-poll-trump-backed-vernon-jones-leads-georgia-10th-district-in-tight-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1147,
    1646,
    2095,
    2319,
    2355,
    4325,
    146,
    254,
    428,
    2672
  ],
  "sentences": [
    "The people of the 10th Congressional District want a Congressman who has earned the trust of President Trump, isn't afraid to fight against the Radical Left, and won't back down to the GOP Establishment.?\nHe added that despite every attack from the Fake News media and RINO Republicans, our campaign continues to connect with more and more Georgians every single day.?\nCollins, the second-place candidate in the poll, has not appeared deterred by the Trump factor as the May 24 race nears.",
    "Thirty-one percent said they were a Trump Republican,? 27 percent said they were traditional/establishment,? 17 percent said they were evangelical,? nine percent said they were libertarian,? eight percent said they identified as outsider,? and seven percent said something else.?\nJones said in a statement to Breitbart News, What this poll shows is clear: the momentum in this race is on our side.",
    "In a statement on social media on April 4, Collins stated, What Donald Trump understood more than all his career politician competitors is that the most important endorsement was the PEOPLEactive voters and dormant.?\nThe poll had a margin of error of plus or minus 3.7 percent.",
    "Former state Rep. Vernon Jones is narrowly leading his closest competitor, trucking company owner Mike Collins, in the Republican primary race for U.S. Congress in Georgia's Tenth District, according to an internal poll obtained by Breitbart News.",
    "See the full polling document below:\nJones, a former Democrat, emerged as an outspoken supporter of former President Donald Trump in the leadup to the 2020 election and eventually converted to Republican in 2021.",
    "Jones, who has described himself as a black Donald Trump,? is endorsed by Trump and heavily promotes the former president's support as he campaigns in a solid red district.",
    "Jones was initially running for governor in Georgia but dropped out of that race at Trump's urging and earned Trump's endorsement once he joined the congressional race.",
    "Trump had sought to combine Jones's support with that of Trump's endorsed gubernatorial candidate, former Sen. David Perdue, amid Perdue's campaign against Gov.",
    "Former Tenth District Rep. Paul Broun came in third at 15 percent, followed by state Rep. Tim Barr at seven percent and a few others at five percent or lower.",
    "Jones received 20 percent support compared to Collins' 16 percent, while a plurality of respondents, 25 percent, said they were undecided.",
    "The poll also asked how the 703 likely Republican primary voters who were surveyed identified themselves within the party.",
    "The poll, conducted by Remington Research Group from April 10 to 11, found Jones four points ahead of Collins.",
    "Brian Kemp, who has been the subject of Trump's ire over Georgia's 2020 election process."
  ]
}