{
  "id": 2091,
  "mediaId": 43,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Trump's going all in to trash frontrunner Brian Kemp in Georgia's GOP gubernatorial primary",
  "image": "https://images.dailykos.com/images/1059326/story_image/GettyImages-1227990289.jpg?1649968461",
  "link": "https://www.dailykos.com/story/2022/4/14/2091998/-Trump-s-going-all-in-to-trash-frontrunner-Brian-Kemp-in-Georgia-s-GOP-gubernatorial-primary",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNerding out on redistricting, with Nathaniel Rakich\nThe Downballot\nFollowShare\n0:0059:53\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThe effort is likely a fool's erranda perfect fit for Trump.",
    "Fox News is a menace to our democracy, more than ever, so let's take them down\nDaily Kos' The Brief\nFollowShare\n0:001:01:34\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThis is a short blurb about Daily Kos.",
    "If you want to know what the truth is about the election, you should first relearn what the laws and the Constitution say,? he said, just before thanking the crowd and making a quick exit.",
    "Eventually, Kemp got testy, questioning where all his critics had been when he was serving as Secretary of State and battling Stacey Abrams in the run up to the 2018 gubernatorial race.",
    "Others belted out, \"Special session,\" presumably referring to the post-election legislative session Trump allies had lobbied the governor to call in order to overturn the results.",
    "It's a special gesture for a special vendetta, and the very first time Trump has reached into his $110 million war chest to make a substantial donation to another candidate.",
    "Kemp maintains a nearly double-digit lead over Perdue and, as of Jan. 31, Kemp reported having $12.7 million in his war chest to Perdue's $1 million cash on hand.",
    "So Trump is doing something highly unusualdipping into his own campaign funds to malign Kemp and give his lackluster endorsee, former Sen. David Perdue, a boost.",
    "\"All the issues that you're talking about, you need to talk to the Secretary of State about,\" he added, throwing Republican SOS Brad Raffensperger under the bus.",
    "To this day, Trump believes Kemp committed the gravest of sins, and there's a good chance that mindset has also embedded itself in the hearts of his cultists.",
    "Just last weekend at a Fulton County GOP meeting, Kemp endured a round of heckling from pro-Trumpers peppering him with 2020 election conspiracy theories.",
    "Listen and subscribe to Daily Kos Elections' The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "Ahead of the May 24 primary, Trump's Save America PAC has transferred a sizable sum of $500,000 to another PAC that's solely focused on ousting Gov.",
    "x\nx\nListen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "Shortly after Trump's cash infusion, the anti-Kemp Super PAC Get Georgia Right cut an ad saying Kemp \"dismissed concerns\" about 2020 voter fraud.",
    "Kemp, of course, refused to illegally overturn the state's thrice-counted 2020 results and, for Trump, that's a betrayal worth investing in.",
    "Kemp effectively telling his detractors that they're stupid and they should reeducate themselves on the law was just icing on the cake.",
    "Kemp also had a strong contingent of supporters at the event, but the room was divided, and that division holds promise for Democrats.",
    "The TV spot is being disseminated in the state's most conservative areas in a bid to turn out die-hard Trump voters at the polls.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Now they're trying to blame me for something that I had no constitutional authority to do.?\nOne heckler responded, \"Liar.\"",
    "Brian Kemp is trouncing his Trump-backed primary opponent in both cash and polling, but Donald Trump just can't let it go.",
    "Let's face it, Trump doesn't part ways with money easily, but he clearly harbors an abiding white-hot hate for Kemp.",
    "But even if Kemp survives the onslaught, Trump's fan base will likely walk away with a sour taste in its mouth.",
    "Last month, the Kemp camp promised to spend north of $4 million in ad buys prior to the late-May primary.",
    "\"If Kemp can't beat voter fraud, he won't beat [Democratic candidate] Stacey Abrams,\" the ad charged.",
    "I fought them every single time when none of these naysayers over here even cared about it,? he said.",
    "Given the current mismatch, it's entirely plausible that Kemp will still prevail next month.",
    "Nothing could help Democrats more in November than a dispirited and depressed Trump base.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The Atlanta Journal-Constitution's Greg Bluestein caught the action.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "I'm not a dictator,\" Kemp said, pushing back on the criticism.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n60.",
    "Frankly, all of this is outstanding news for Democrats.",
    "At that point, Kemp decided to cut his losses.",
    "Kemp from office, according to Politico.",
    "Brian Kemp\nGeorgia Republican Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "You tell em, Kempbravo.",
    "\"I'm the governor.",
    "Georgia GOP Gov.",
    "Please read it."
  ]
}