{
  "id": 2093,
  "mediaId": 195,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Trump PAC transfers $500K to group working to defeat Kemp in Georgia",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/TrumpMAGA_031222_AP-MegKinnard.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3266785-trump-pac-transfers-500k-to-group-working-to-defeat-kemp-in-georgia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Vakil",
  "authorUrl": "https://thehill.com/author/caroline-vakil/",
  "termIds": [
    2095,
    2095,
    1147,
    1147,
    1646,
    1646,
    101,
    101,
    183,
    183,
    428,
    428,
    571,
    571,
    2672,
    2672
  ],
  "sentences": [
    "Though Kemp is now in the political fight of his life against Republican challenger and former Sen. David Perdue, whom Trump has already endorsed, recent polling indicates that he is leading in voter support among the five Republican gubernatorial candidates.",
    "The super PAC describes itself as being organized to make Georgia Red Again  GOP victories in all 2022 Georgia state wide races and delivering the Peach State to the 2024 GOP nominee for President,? according to its website.",
    "President Trump is committed to supporting his endorsed candidates across the nation, but we won't be telegraphing our efforts to the media,? Trump spokesman Taylor Budowich said in a statement.",
    "A poll conducted for The Hill by Emerson College showed that Kemp received 43 percent of the vote among the Republican contenders, compared to Perdue's 32 percent.",
    "Trump's Save America PAC gave $500,000 to the anti-Kemp Get Georgia Right Super PAC on March 25, according to a filing from the Federal Election Commission.",
    "Former President Trump's political action committee contributed half a million dollars to a group whose efforts center on defeating incumbent Gov.",
    "The development shows that the former president is committing serious money to unseating Kemp ahead of the May 24 gubernatorial primary.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Brian Kemp (R) in the Georgia gubernatorial race.",
    "The development was first reported by Politico.",
    "Tal Axelrod contributed to this report."
  ]
}