{
  "id": 2097,
  "mediaId": 209,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Trump spends $500k to unseat Georgia governor who refused to overturn 2020 election",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-continuous-scroll-mobile@1/v1649884086/GettyImages-1239537998.jpg",
  "link": "https://theweek.com/donald-trump/1012539/trump-spends-500k-to-unseat-georgia-governor-who-refused-to-overturn-2020",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    801,
    1147,
    1248,
    1646,
    1951,
    2087,
    2095,
    2203,
    2230,
    2279,
    4325,
    501,
    2672
  ],
  "sentences": [
    "At a rally in Georgia last month, Trump denounced Kemp as a \"turncoat\" and said \"Trump voters will not go out and vote for Brian Kemp,\" who refused to help Trump in his quest to overturn President Biden's razor-thin victory in Georgia.",
    "According to Politico, this transfer to the anti-Kemp Keep Georgia Right super PAC marks Trump's largest political donation of the midterm election cycle, though it hardly puts a dent in his $110-million war chest.",
    "The two major contenders for the GOP nomination are Kemp, who won a close race with Democrat Stacey Abrams in 2018, and former Sen. David Perdue, who lost his seat to Democrat Jon Ossoff in Jan. 2021.",
    "Mark Niesse and Jennifer Peebles of The Atlanta Journal-Constitution wrote that then-President Trump's claims of voter fraud may have driven down Republican turnout enough to cost Perdue the election.",
    "Trump is under investigation by a Georgia grand jury after asking Republican Secretary of State Brad Raffensperger to \"find\" the 11,780 votes needed to flip the state to Trump.",
    "out for revenge\nFormer President Donald Trump's Save America PAC is throwing $500,000 behind an effort to unseat Georgia Gov.",
    "Brian Kemp (R) in the first major test of the former commander-in-chief's kingmaker status, Axios reports.",
    "Trump has also endorsed a primary challenger to Raffensperger.",
    "Kemp currently leads Perdue in the polls."
  ]
}