{
  "id": 2101,
  "mediaId": 65,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Georgia Gov. signs major constitutional carry bill into law",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8f8af956-91ae-42ea-922b-3fe8806f0eeb/39440d72-2168-4e0b-9bd1-bbd8cde75458/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-gov-signs-major-constitutional-carry-law-into-effect",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawrence Richard",
  "authorUrl": "https://www.foxnews.com/person/r/lawrence-richard",
  "termIds": [
    2095,
    428,
    501,
    571,
    2555,
    2648,
    2672,
    2945
  ],
  "sentences": [
    "OHIO GOV DEWINE SIGNS BILL ALLOWING PEOPLE TO CARRY CONCEALED FIREARMS WITHOUT A PERMIT\nDubbed the \"Constitutional Carry Act,\" the new law cleared both chambers of the state legislature by the beginning of April, to the high praise of Second Amendment advocates in the state  and across the country.",
    "\"This legislation will potentially allow individuals with a criminal history who purchase a gun through a private sale to legally carry a hidden, loaded weapon in our communities,\" said state Rep. Kimberly Alexander, a Democrat, according to the report.",
    "Joining supporters outside Gable Sporting Goods in Douglasville on Tuesday, the Republican governor celebrated the new law, saying it will ensure citizens' rights to protect themselves in public, Fox 5 of Atlanta reported.",
    "IVEY SIGNS CONSTITUTIONAL CARRY' BILL, REPEALS NEED FOR PERMIT TO CARRY CONCEALED PISTOL\nOn Tuesday, Kemp also signed into law legislation that recognizes and accepts other states' concealed carry permits in Georgia.",
    "The bill also drew some criticism from Kemp's Trump-backed primary gubernatorial opponent, former Sen. David Perdue, who applauded the bill's signing but criticized Kemp for taking \"four years\" to get it signed.",
    "Brian Kemp, a Republican, signed a bill into law Tuesday removing the license and background check requirements for gun owners to carry a firearm in public, drawing high praise from gun owners in the state.",
    "\"SB 319 makes sure that law-abiding Georgians  law-abiding Georgians, including our daughters and your family too  can protect themselves without having the permission of the state government.",
    "This is allowing law-abiding citizens to carry a weapon without a license in Georgia,\" said state Sen. Jason Anavitarte, a Republican, Fox 5 reported.",
    "\"HB 218 ensures that individuals who are licensed to carry in another state are also authorized to do so here in Georgia.\"",
    "The Constitution of the United States gives us that right, not the government,\" Kemp said.",
    "\"This isn't a bill that's going to create more crime.",
    "Critics swiftly slammed both new laws.",
    "ALABAMA GOV.",
    "Georgia Gov."
  ]
}