{
  "id": 2104,
  "mediaId": 151,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Roe draft supercharges battle for state control",
  "image": "https://www.politico.com/dims4/default/d87dee2/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fac%2Fa3%2Fe2c1a60b4f3cb36418a150840f87%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1395368835",
  "link": "https://www.politico.com/news/2022/05/04/roe-draft-supercharges-battle-state-control-00030155",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1906,
    1906,
    2087,
    2087,
    2058,
    2058,
    2095,
    2095,
    2145,
    2145,
    862,
    862,
    773,
    773,
    1646,
    1646,
    1434,
    1434,
    1147,
    1147,
    571,
    571,
    307,
    307,
    101,
    101,
    425,
    425,
    428,
    428,
    2672,
    2672,
    2791,
    2791,
    2972,
    2972,
    2818,
    2818
  ],
  "sentences": [
    "It is very different to think about it in the abstract: It's going to happen, it might happen, it could happen.' Very different to see it written, and particularly written the way this was written.?\nOn Tuesday, the high court publicly confirmed the authenticity of the draft, but stressed it does not represent a decision.? Congress is extremely unlikely to act, given Democrats' narrow majority in the Senate and several senators' stated unwillingness to scrap the filibuster for a whole host of issues, abortion included.",
    "Seventeen Democratic governors  including swing-staters like Wisconsin's Tony Evers, Michigan's Gretchen Whitmer and Nevada's Steve Sisolak  signed a letter to congressional leadership urging Congress to act swiftly to ensure that all Americans continue to have meaningful access to reproductive healthcare and abortion.?\nBut the immediate political ramifications of the decision are unclear.",
    "Abortion-rights and anti-abortion advocates confront one another in front of the U.S. Supreme Court Building on May 04, 2022 in Washington, D.C. | Anna Moneymaker/Getty Images\nBy Zach Montellaro and Holly Otterbein\n 05/04/2022 06:12 PM EDT\nWith the Supreme Court poised to strike down Roe v. Wade, the next battle over abortion rights in America won't be fought in Washington.",
    "He highlighted the importance of the three justices former President Donald Trump nominated to the bench, and said if he was governor he would immediately call the legislature back into a special session to ban abortion in Georgia.?\nBut privately, some Republicans were more skittish about the impact on the midterms and urged candidates to proceed carefully.",
    "And so candidates for the state legislature and for governor are going to have to have a position on abortion in every cycle going forward.?\nDemocrats have long contended that the scrapping of Roe would motivate their voters, pointing to polling that shows that most Americans believe abortion should be legal in most cases and that Roe should be upheld.",
    "A GOP consultant in Wisconsin, referring to that state's gubernatorial race, said the issue within the Republican primary is whether or not candidates are going to treat it with the proper delicacy that they'll need to treat it in the fall.?\nThat doesn't mean not being glad to see a court decision that many of them have fought for their entire lives.",
    "But there's still six-plus months until the general election, and by then I think most voters will be back to focusing on pocketbook issues like inflation and the economy.?\nRepublicans also noted Gallup polling that shows that a majority of Americans are opposed to abortion in the second and third trimesters.",
    "It must be made clear to pro-life voters that beating Shapiro is the most important task in this election.?\nShapiro said in a news conference Tuesday that the top four Republican gubernatorial candidates backed an abortion ban, and two allowed for no exceptions for rape, incest or the life of the mother.",
    "Will Simons, a spokesperson for Josh Shapiro, the Democratic candidate for governor in Pennsylvania, said Tuesday this has already been the best online fundraising day of the year for our campaign.?\nRepublicans contend the landscape is not that clear-cut, pointing to the fact that former Virginia Gov.",
    "An ABC News/Washington Post poll, which was published on Tuesday but was in the field prior to POLITICO publishing the draft opinion, found that 58 percent of Americans said that abortion should be legal in all or most cases, and 54 percent said that the court should uphold Roe.",
    "Jessica Post, the president of the Democratic Legislative Campaign Committee, said that she believed that the overturning of Roe would be a motivating decision for Democratic-leaning voters who may have become complacent? with the party having unified control in Washington.",
    "I don't think anything motivates voters quite like outrage.?\nJenifer Fernandez Ancona, a co-founder and chief strategy officer of the liberal donor collective Way to Win, concurred, saying the draft opinion would bring more urgency? in their conversations with big donors.",
    "An internal survey for a Democratic candidate in Pennsylvania, which was provided to POLITICO, found that banning abortion is unpopular among non-conservative Republicans (an important subset of swing voters),? with 61 percent opposing and 32 percent supporting.",
    "During the state's August primary, Kansans will vote on a proposed state constitutional amendment that would explicitly say the state constitution does not establish a right to an abortion in the state, after the state Supreme Court ruled in 2019 that it did.",
    "Roshni Nedungadi, a pollster at HIT Strategies  which has done work with abortion rights groups  said that the shift for Democratic voters was apparent in a focus group of young, base? Democrats that her firm was running as POLITICO broke the news on Monday.",
    "Cooper Teboe, a Silicon Valley-based adviser to Democratic donors, said our priority right now needs to be that women are safe and that they have access.? But, he said, he anticipates a tremendous? boost in giving from both small- and large-dollar donors.",
    "Beyond gubernatorial contests, abortion politics could also factor in heavily in other state races  including attorneys general, who could make prosecutorial decisions, and state legislators, who actually write the laws governors decide to sign or veto.",
    "It's especially salient in key battleground states like Michigan, Pennsylvania, Wisconsin, Nevada and elsewhere, where radically different abortion policy could hinge on who is elected governor, or to a handful of state legislative seats  or both.",
    "But it needs to be done in a way that can have a shelf life in the fall.?\nAn early test of the saliency of abortion in the midterms will be in Kansas, which is arguably Republicans' best opportunity to flip a governorship this year, with Gov.",
    "Our moderator asked a question before this news came out: What would you think about the possibility of Roe v. Wade being overturned?' And people didn't think that it was a realistic possibility until the news broke,? she said.",
    "Political operatives and candidates on both sides of the aisle have long said that the Supreme Court's looming decision on abortion rights could upend 2022, especially in state-based contests that could actually set new policy.",
    "So there'll be a clear distinction between the two candidates.?\nIn some Republican state primaries, candidates see the news as an opportunity to boost their campaigns and are tweaking their political strategy in response.",
    "In an internal memo obtained by POLITICO, an aide for another top gubernatorial candidate in Pennsylvania, Dave White, predicted that the question of candidate electability will now be even more important for GOP voters.",
    "But the conversations about a ruling throwing out Roe became much less theoretical on Monday, after POLITICO obtained a draft opinion authored by Justice Samuel Alito that would completely overturn the decades-old case.",
    "Instead, it will be state-by-state trench warfare  particularly in a small universe of swing states that are poised to play an oversized role in the midterm election and the presidential race to come.",
    "If something similar to this alleged Alito draft goes forward, then it's going to shift abortion from a federal issue to a state issue,? said Bill McCoshen, a Wisconsin-based Republican strategist.",
    "Democratic party leaders and consultants said they believed it would ultimately motivate base voters and bring some undecided voters back into the fold because most Americans agree with them.",
    "Josh Shapiro is clear that he supports abortion,? he said, and whoever the Republican nominee is has made their position clear that they are in support of protecting the life of the unborn.",
    "Then they were palpably angry.?\nDemocrats also expect a financial windfall from the news, even beyond the $150 million that pro-abortion rights groups recently committed to spending.",
    "Democratic gubernatorial incumbents and candidates rushed to condemn the draft, casting themselves as the bulwark against restrictive abortion laws being passed in their home state.",
    "Kristi Noem, a potential 2024 candidate, tweeted in response to POLITICO's reporting that she would immediately call for a special session? should Roe v. Wade be overturned.",
    "Unopposed in the primary, Attorney General Josh Shapiro is set to become the most stridently proabortion gubernatorial candidate in the commonwealth's history,? they wrote.",
    "I think it's possible that Democratic voters that care about the Roe v. Wade decision will have a sugar-high, and they'll be amped up for a little while,? said McCoshen.",
    "In an interview, former Rep. Lou Barletta  one of the leading Republican candidates in this month's Pennsylvania gubernatorial primary  said he approved of it.",
    "It's been hard in this midterm a little bit, right, because of all the news about the midterm and how hard it's going to be [for Democrats],? she said.",
    "And so this confirms what we have been saying: that abortion is going to be a mobilizing issue for Democrats, but Democrats have to lean into it.",
    "Terry McAuliffe ran heavily on opposing abortion restrictions during his comeback attempt in 2021, only to still be defeated by now-Gov.",
    "There is some skepticism in the party, though, that it could totally reverse what is shaping up to be a difficult political environment.",
    "With an eye toward swing voters, Democratic campaigns are already conducting polling on the impact of a ruling on the general election.",
    "But now we see it in black and white, with Judge Alito's name on it,? said Lavora Barnes, the chair of the Michigan Democratic Party.",
    "And neither party is expected to win a filibuster-proof majority in the Senate in the fall, which puts the ball in states' court.",
    "Glenn Youngkin, who opposes abortion access but sought to downplay focus on the issue in the run-up to the general election.",
    "This is an extreme position, and I can tell you it is wildly out of touch with the majority of Pennsylvanians,? he said.",
    "And second, we're going to see the grassroots get activated in a similar way to how they were activated during Trump.",
    "Just 8 percent of voters listed abortion as the most important issue facing Virginia, according to exit polls.",
    "Other battleground Republicans have weighed in as well: Former Sen. David Perdue, who is primarying GOP Gov.",
    "Either they're going to get off the sidelines, or they're going to give more than they were,? he said.",
    "Laura Kelly the only Democratic incumbent up for reelection in a state that Trump carried in 2020.",
    "And it doesn't mean not being rock-ribbed about their pro-life credentials,? the person added.",
    "Indeed, some battleground Republican gubernatorial candidates have embraced the draft opinion.",
    "The Supreme Court is taking rights away, and that we need to stand up and fight,? she said.",
    "Brian Kemp in Georgia, praised the draft ruling in a pair of statements.",
    "I think it will have a huge impact on the general election,? he said.",
    "In fact, they need to do that in a primary like the governor's race.",
    "It isn't going to just happen.?\nIt has already paid early dividends.",
    "And red-state Republican governors are moving on the issue as well.",
    "It took them a moment to process the information.",
    "I don't think it will change the primary at all.",
    "It gives Democrats a united enemy.",
    "The writing was on the wall.",
    "South Dakota Gov."
  ]
}