{
  "id": 2106,
  "mediaId": 129,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Georgia's 2018 Rematch, in a Courtroom",
  "image": "",
  "link": "https://www.nytimes.com/2022/04/13/us/politics/georgia-stacey-abrams-brian-kemp.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2203,
    2203,
    2419,
    2419,
    2095,
    2095,
    2056,
    2056,
    1951,
    1951,
    735,
    735,
    1147,
    1147,
    179,
    179,
    2672,
    2672
  ],
  "sentences": [
    "Through the three practices at issue in this case  exact match, affirmative mismanagement of the voter rolls and failure to train on absentee ballot cancellations  these defendants have erected a series of roadblocks  roadblocks that propose unjustifiable burdens on eligible voters in violation of both the Constitution and the Voting Rights Act,? Allegra Lawrence-Hardy, a lawyer for Fair Fight and the other plaintiffs, said in her opening statement.",
    "The subject line of one read: First bus of Biden's illegal immigrants reaches DC.?\nAbbott held a news conference later in Laredo, a city on the border, teasing a historic announcement.? It turned out to be an agreement with Nuevo Len, the Mexican state, to end additional state vehicle inspections at one bridge, though the inspections continue to stall trucks delivering goods from Mexico.",
    "He continued: What the evidence will show is what the plaintiffs allege is part of a campaign is not what is happening on the ground in Georgia elections.?\nEchoes from the past\nFair Fight and other groups have challenged Georgia's election laws on both constitutional grounds and under a provision of the Voting Rights Act known as Section 2.",
    "We are defending this basic protection of the integrity of Georgia's elections.?\nWhat to read\nPresident Biden announced that the Environmental Protection Agency would lift summertime regulations on E15, an ethanol-gasoline blend, the latest sign that Russia's invasion of Ukraine has pushed the White House to embrace fossil fuels.",
    "Hosts of the network's morning talk show provided live commentary, including that this guy has a backpack? and at least this guy has a mask on  he's being responsible as he sneaks into our country illegally.?\nThis looks calm,? the co-host Brian Kilmeade observed, as the migrants were discharged one by one.",
    "After he rebuffed Donald Trump's entreaties to find? enough votes to subvert the election in Georgia, Raffensperger became a key target of Trump, who has endorsed a well-funded challenger in Representative Jody Hice, a Republican who has publicly claimed that Trump won the election in Georgia.",
    "North Carolina dropped Mark Meadows, Donald Trump's former chief of staff, from its voter rolls, as officials investigate whether he fraudulently cast a ballot in the state in 2020.\nin the moment\nNot so much on the ground, but on cable news, on Twitter and in fund-raising emails.",
    "The methods may be different than in the past, but the state's creation of barriers to voting in Georgia have the same impact, particularly for people of color and immigrants who meet all eligibility requirements to vote in Georgia's elections,? Lawrence-Hardy said.",
    "And Kemp's office put 53,000 voter registrations on hold under the state's exact match? rule, which requires that voters' registration information exactly match what is on file with the state's Department of Driver Services or Social Security Administration.",
    "The 2018 race for governor in Georgia ended in a bitter dispute between Brian Kemp, a Republican who was serving as secretary of state at the time, and Stacey Abrams, the Democratic challenger who accused the state of voter suppression.",
    "You'll hear how these election workers, who come from all political persuasions and demographic roots, operate under extraordinarily trying circumstances,? Belinfante, the lawyer for the secretary of state, said in his opening remarks.",
    "And you'll hear how at the end of the day they just want to get it right.?\nBut the trial will not focus on the state's controversial new voting law that was passed last year and that added numerous new restrictions on voting.",
    "The trial, which is expected to last roughly a month, will feature dozens of voters who claim that their right to vote was foiled by the state's rules and regulations, with anecdotes from both the 2018 and the 2020 elections.",
    "The office of Brad Raffensperger, Georgia's secretary of state and the defendant in the case, has said repeatedly that the state has already beaten back most of the claims in court, and accused Fair Fight of playing politics.",
    "Raffensperger has not backed down from saying Trump legitimately lost the 2020 election in Georgia, a stance that has put him at odds with a segment of the Republican base who will be deciding his fate in the May 24 primary.",
    "In response to the Biden administration's plans to end a Trump-era pandemic policy that turned away most unauthorized migrants at the border, Abbott pledged to put immigrants on charter buses and send them to Washington.",
    "On the sidewalks outside the building near Union Station, the moment was less chaotic than most charter bus arrivals by the Capitol, where it's typical to see crowds of bouncing children and anxious tourists.",
    "Republicans have focused on noncitizens voting in their hunt for widespread voter fraud (there is no evidence of swaths of noncitizens voting, nor of widespread fraud) and also to justify new policies.",
    "Georgia was one of the states that were put under special federal oversight by the Voting Rights Act when it was signed in 1965 because of the history of discrimination at the polls in those states.",
    "She added that when the state first proposed the exact-match identification policy in 2009, Georgia was still under federal oversight and the Justice Department rejected the initial proposal.",
    "U.S.-backed news outlets and Ukrainian activists' efforts to deliver news to Russians are starting to show signs of working, sowing doubt in the Kremlin's accounts of the invasion.",
    "A window of opportunity\nThough Raffensperger is on the defense, the trial also presents a political opportunity for the sitting secretary of state, who is seeking re-election.",
    "After Judge Steve C. Jones tossed parts of the original lawsuit last year, Fair Fight opened its case challenging three specific tenets of the Georgia election system.",
    "A Fox News co-anchor, John Roberts, captured a photo of the bus pulling up, it turns out, right in front of the building that houses? Fox News, NBC News and C-SPAN.",
    "But the trial has allowed Raffensperger the opportunity to attack Abrams and embrace issues that help endear him to the Republican base, such as noncitizen voting.",
    "After the election, Fair Fight Action, the voting rights group founded by Abrams, sued the state, claiming its election practices were illegal and discriminatory.",
    "Lawyers for Fair Fight contend that part of the exact match? process could result in citizens being prevented from voting, including newly naturalized citizens.",
    "Now, more than three years after the suit was filed, the trial began on Monday in Atlanta  the first federal voting rights trial in Georgia in over a decade.",
    "I want to make sure it is citizen-only voting here in the state of Georgia,? Raffensperger said in a brief news conference before the trial began on Monday.",
    "The trial represents one of the first marquee challenges using this provision after the Supreme Court weakened its protections for voting rights last year.",
    "Democrats had hoped to unravel voting restrictions with federal legislation, but they weren't able to secure enough votes to pass it in the Senate.",
    "The election, won by Kemp, was plagued by long lines, especially in communities of color where wait times occasionally exceeded two hours.",
    "They ran this litigation like a campaign,? Joshua B. Belinfante, a lawyer for the secretary of state, said in his opening remarks.",
    "Some laws will make voting more difficult for certain groups, cause confusion or create longer wait times at polling places.",
    "In her opening remarks, Lawrence-Hardy spoke of John Lewis, the Georgia Democrat and civil rights icon who died in 2020.",
    "The Republican push to tighten voting rules has fueled doubts about the integrity of the democratic process in the U.S.",
    "In 2020, as a result of the pandemic, millions embraced voting early in person or by mail, especially among Democrats.",
    "But the new restrictions could backfire on Republicans, especially in rural areas that once preferred to vote by mail.",
    "This morning, the first bus arrived near Union Station, with Fox News camera crews ready to record the moment.",
    "Spurred on by Donald Trump's false claims about mail ballots in hopes of overturning the election, the G.O.P.",
    "And she drew comparisons between the current legal battle and the state's history of suppressing voters.",
    "Many of those 53,000 were Black voters, according to an investigation by The Associated Press in 2018.",
    "Perhaps that was because, according to the governor, a grand total of 24 migrants were on the bus.",
    "An attempt to change the Senate's filibuster rules to enable the passage of the bill also failed.",
    "These tenets, the group says, make it harder for people to vote, especially Black voters.",
    "Abrams is now in the middle of a second campaign for governor, a rematch with Kemp.",
    "Many of the restrictions are likely to affect voters of color disproportionately.",
    "He also said there would be more migrants sent to Washington, by bus or by plane.",
    "Celebratory emails were sent out by the governor's re-election campaign today.",
    "The lawsuit was filed before that law was introduced and passed.",
    "Abbott used the migrant drop-off as a fund-raising opportunity.",
    "But,? he added, it's not a calm event? at the border.",
    " Leah\nIs there anything you think we're missing?",
    "Card 1 of 6\nWhy are voting rights an issue now?",
    "has pursued a host of new voting restrictions.",
    "Why are these legislative efforts important?",
    "Will these new laws swing elections?",
    "How have the Democrats pushed back?",
    "Email us at onpolitics@nytimes.com.",
    "Election workers will also testify.",
    "Anything you want to see more of?",
    "We'd love to hear from you.",
    "They didn't have to go far.",
    "Maybe not.",
    "Maybe."
  ]
}