{
  "id": 2107,
  "mediaId": 157,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Trump makes first big midterm donation  invests in ousting GOP Gov Brian Kemp",
  "image": "https://www.rawstory.com/media-library/gov-brian-kemp-of-georgia.jpg?id=26018220&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-brian-kemp-georgia/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ross Williams",
  "authorUrl": "https://www.rawstory.com/u/rosswilliams-georgiarecorder",
  "termIds": [
    2095
  ],
  "sentences": [
    "And I think you really see that in that it's sort of continuing, that it's not just about what happened in the election, but really, that he doesn't want Kemp to be there and sort of anyone but Kemp would be preferable.?\nTrump's criticism of Kemp has been unrelenting ever since the governor refused to help overturn the presidential election results nearly two years ago, and the former president has vowed to foil Kemp's plans for a second term in the governor's mansion.",
    "Perdue lamented the condition of the Georgia State Patrol under Kemp, telling reporters Tuesday the agency had been allowed to deteriorate? and was no longer functioning at an elite level.? Perdue's press conference was held the same day Kemp signed into law a bill ending a permit requirement and fee to carry a concealed firearm, which is a change Perdue has argued his primary challenge helped spur.",
    "In fact, in anything, it seems to have somewhat led to an increase, actually, in how Kemp is doing.?\nKemp held an 11-point lead over Perdue in an Emerson College poll released this month, which cast doubt on whether Trump's March rally in Commerce benefited his favored candidate.",
    "As Politico first reported, the check is Trump's first big donation in this year's midterm elections nationally, and it may also be just the beginning of Trump's spending in the Georgia governor's race.",
    "The donation comes as former U.S. Sen. David Perdue lags behind Kemp in the polls and in fundraising, and it is yet another sign of the important role Georgia continues to play in national politics.",
    "The 2018 challenge between the two was famously close, and if 2022 sees the same dynamic, a small number of Trump loyalists sitting the election out could boost Abrams across the finish line.",
    "But even if Trump is not able to propel Perdue past the primary, he could still remain a thorn in Kemp's side as he tries to focus on defeating presumed Democratic nominee Stacey Abrams.",
    "It really is the one thing that he focuses on and that he has devoted a lot of energy to, and in many ways, his dislike of Kemp is also very personal,? Steigerwalt said Wednesday.",
    "David Perdue is going to need a lot more than $500,000 to distract from his unhinged rant attacking the Georgia State Patrol,? said Cody Hall, spokesman for the Kemp campaign.",
    "Trump has since endorsed a slate of statewide candidates in the Republican primary in Georgia, even wading into lower ballot races like the insurance commissioner's contest.",
    "Once political allies, Trump and Kemp fell out after the 2020 election in which Trump lost Georgia and accused Kemp of not doing enough to illegally overturn the results.",
    "Perdue publicly announced his candidacy in December, immediately complicating the GOP primary in Georgia, and he received Trump's official endorsement the same day.",
    "Trump has seemed to lower expectations in more recent interviews, telling a conservative radio host this month it's always hard to beat a sitting governor.",
    "Relitigating the last presidential election has become standard for Trump, said Georgia State University political science professor Amy Steigerwalt.",
    "Since Trump has ventured so far into Georgia politics this year, the May 24 primary is widely seen as a test of Trump's hold on Republican voters.",
    "Georgia Recorder is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Former President Donald Trump has opened up his wallet  or at least his political action committee  in the hopes of thwarting Gov.",
    "Following the March 25 donation, Get Georgia Right began sponsoring TV ads featuring unsubstantiated claims tying Gov.",
    "Really, it doesn't appear to be helping, for example, David Perdue, now that people know that Trump has endorsed him.",
    "Trump's Save America PAC has donated $500,000 to Get Georgia Right, a Virginia-based anti-Kemp super PAC.",
    "He very clearly has a lot of sway still over elected members of the Republican Party,? Steigerwalt said.",
    "Raphael Warnock and Jon Ossoff likely benefited from Trump supporters sitting out the 2020 runoffs.",
    "NOW WATCH: Fox Corp's LGBTQ staff livid over 'hateful' coverage of 'Don't Say Gay' bill",
    "What we don't entirely know is whether or not the voters are going to respond to that.",
    "Just remember that.?\nKemp's campaign shrugged off Trump's $500,000 donation to Perdue.",
    "The Republican incumbent commissioner, John King, was appointed by Kemp.",
    "Trump has socked away more than $110 million in his Save America PAC.",
    "Georgia Recorder Deputy Editor Jill Nolin contributed to this report.",
    "Contact Editor John McCosh for questions: info@georgiarecorder.com.",
    "Brian Kemp to supposed illegal ballot harvesting? in 2020.",
    "Georgia Recorder maintains editorial independence.",
    "Follow Georgia Recorder on Facebook and Twitter.",
    "And really, indications are that they're not.",
    "We're not seeing his numbers going up.",
    "Brian Kemp's bid for a second term.",
    "Georgia Sens."
  ]
}