{
  "id": 2112,
  "mediaId": 136,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Donald Trump: U.S. 'Going to Hell' Because of Election Fraud",
  "image": "https://d.newsweek.com/en/full/2019098/donald-trump-voter-fraud-pennsylvania.webp?w=790&f=84beb20a492b206b44fa0f02bd56b987",
  "link": "https://www.newsweek.com/donald-trump-bill-mcswain-election-fraud-going-hell-1697326",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron McDade",
  "authorUrl": "https://www.newsweek.com/authors/aaron-mcdade",
  "termIds": [
    2525,
    2525,
    1796,
    1796,
    1997,
    1997,
    1549,
    1549,
    1147,
    1147,
    2862,
    2862,
    2945,
    2945
  ],
  "sentences": [
    "He has not yet endorsed a Republican candidate for Pennsylvania governor ahead of next month's primary in the state, but he has endorsed Mehmet Oz, the former Dr. Oz Show host who has announced a run for one of Pennsylvania's U.S. Senate seats, despite criticism from conservatives over Oz's past comments on abortion and gun control.",
    "In a new statement attacking Pennsylvania gubernatorial candidate Bill McSwain, former President Donald Trump repeated his frequent lies regarding fraud in the 2020 election and said the country is \"going to hell\" because McSwain, former Attorney General Bill Barr and other officials did not do enough to overturn the election.",
    "Recent polls have indicated that Trump is maintaining his popularity in some states with high-profile congressional races in 2022, like Georgia, North Carolina and Ohio, although that popularity has dipped slightly in Georgia and Ohio compared to January 2021, Newsweek previously reported.",
    "Other races like Oz's race in Pennsylvania and the Georgia gubernatorial race, in which Trump has backed former Senator David Perdue over incumbent Brian Kemp, could indicate how much weight the former president still carries with many Republicans, Newsweek reported.",
    "However, some within the Republican party, like Maryland Governor Larry Hogan, have criticized the candidates he has endorsed as \"crazy\" and said that the 2022 midterms could reveal if Trump's influence has waned since his 2020 loss.",
    "All the candidates who Trump backed in Texas won in the first primary earlier this year, although many of those were incumbents, who historically have a better chance of winning elections over their challengers.",
    "\"When I'm Governor, we're going to get back to a voting system that everyone has confidence in, and that begins with repealing the unconstitutional mail-in balloting law, Act 77, that Doug Mastriano voted for.\"",
    "Trump said at a recent fundraising event for Arizona gubernatorial candidate Kari Lake that Republican candidates running for office in 2022 who have rejected his claims of voter fraud have gone \"woke.\"",
    "While he has not yet announced his own plans on whether he will run for president again in 2024, Trump has remained active in the Republican political scene in Pennsylvania and around the country.",
    "Some of Trump's recent endorsements have proven beneficial, as former Alaska Governor Sarah Palin saw a boost in her poll numbers after his endorsement in a race for a U.S. Congress seat.",
    "Much of the statement attacked McSwain, who Trump appointed as a U.S. attorney in Pennsylvania in 2018 and who is now running for governor in the state's Republican primary.",
    "I've prosecuted and put people behind bars who committed voter fraud, and put rioters and looters in jail,\" McSwain said in a statement to Newsweek.",
    "\"Without free and fair Elections, we don't have a Country,\" Trump said.",
    "\"Do not vote for Bill McSwain, a coward, who let our Country down.",
    "ET: This story has been updated with additional information.",
    "Attorneys were probably told not to do anything by Barr.",
    "It was there for the taking and he failed so badly.",
    "\"I'm proud of my record as U.S. Attorney.",
    "He knew what was happening and let it go.",
    "Hence, our Country is going to hell.\"",
    "Update 4/12/22, 1:15 p.m.",
    "Many of the U.S."
  ]
}