{
  "id": 2114,
  "mediaId": 136,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Donald Trump's Popularity Declining Among GOP Voters in These States",
  "image": "https://d.newsweek.com/en/full/2018801/trump-georgia.webp?w=790&f=536a3435d73f1e93a7f682cf49f3f89d",
  "link": "https://www.newsweek.com/donald-trump-poll-morning-consult-gop-1697226",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    1147,
    1646,
    2095,
    2491,
    4325,
    324,
    428,
    2672
  ],
  "sentences": [
    "Trump spokesman Taylor Budowich told Morning Consult that an endorsement from the former president is still the \"most powerful asset in politics\" and that voters will ultimately back candidates whose policies align the most closely with his \"America First\" agenda.",
    "In Pennsylvania, where Trump's favorabilty rating has jumped five percent from January 2021's Morning Consult poll, the former president could influence the outcome of the Republican Senate primary after he endorsed celebrity heart surgeon Mehmet Oz.",
    "\"Every candidate should be out there seeking a Trump endorsement, because more often than not, it helps candidates substantially,\" Republican strategist Gregg Keller, former executive director of the American Conservative Union, told Morning Consult.",
    "Trump has already seen some success in Texas primaries in March, where all 33 of the former president's publicly supported candidates either won outright, or were put through to a runoff where they are overwhelmingly the favorite to eventually win.",
    "According to a recent Emerson College poll, Kemp has an 11-point lead over Perdue (43 percent to 32 percent), meaning the Trump-backed candidate still has a significant lead to try and chip away at before the Republican primary on May 24.",
    "Donald Trump remains a popular Republican in a number of key election states, although voters' positive view of him has waned slightly in places where his endorsed candidates are seeking primary elections, according to a poll.",
    "However, as with virtually all of Trump's endorsements, there is the caveat that many of his picks went to incumbents, who rarely lose renomination, with at least seven of his preferred candidates running unopposed.",
    "According to a Emerson College Polling/The Hill survey conducted between March 26 and 28, both Oz and fellow GOP nomination hopeful David McCormick are tied on 14 percent, with 51 percent of voters still undecided.",
    "The debate about Trump's popularity within the GOP will increase over the coming months as his endorsed candidates across all areas of government hope to sweep their elections following his approval.",
    "A Morning Consult survey found that Trump has a strong favorability rating with Republicans in Georgia (86 percent), North Carolina (87 percent), Ohio (80 percent) and Pennsylvania (77 percent).",
    "A bigger challenge to prove the influence of a Trump endorsement will be in Georgia, where Trump is backing former Senator David Perdue over incumbent Brian Kemp in the gubernatorial race.",
    "However, the results show that Trump's favorability has fallen slightly in Georgia and Ohio compared to January 2021, where Trump was polling at 89 percent and 81 percent respectively.",
    "In both Georgia and Ohio, Trump also saw his unfavorable rating increase slightly from last January, up four points in Georgia to 14 percent, and two points in Ohio to 19 percent.",
    "\"Because of that, strong, pro-Trump fighters will sweep Election Day up and down the ballot in 2022,\" Budowich said.",
    "\"But we're going to find out it's not a silver bullet in all races at all times.\""
  ]
}