{
  "id": 2115,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Georgia just became the 25th state to let people carry concealed guns with no permit and no training",
  "image": "https://images.dailykos.com/images/1058459/story_image/ScreenShot2022-04-12at1.07.41PM.png?1649794088",
  "link": "https://www.dailykos.com/story/2022/4/12/2091567/-Georgia-just-became-the-25th-state-to-let-people-carry-concealed-guns-with-no-permit-and-no-training",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1646,
    2095,
    176,
    242,
    341,
    571,
    2537,
    2672,
    2710,
    2845
  ],
  "sentences": [
    "Gun lobby-backed politicians are shamefully putting primary politics over public safety, and the consequences will be even more devastation for their constituents and the law enforcement officers they pretend they support.?\nDepending on how broadly the U.S. Supreme Court rules in the case of New York State Rifle & Pistol Association (NYSRPA) v. Bruen, states requiring concealed-carry permits and training may have to relax or eliminate such provisions.",
    "The president also said Monday that it is cracking down on ghost guns.? A White House Fact Sheet notes:\nToday, the President [...] will also announce that the U.S. Department of Justice has issued a final rule to rein in the proliferation of ghost guns?  unserialized, privately-made firearms that law enforcement are increasingly recovering at crime scenes in cities across the country.",
    "At his website, Rep. Joe Neguse of Colorado summarized the legislation:\nHelp for Healing Communities Actthis bill creates a new grant program in the Substance Abuse and Mental Health Services Administration (SAMHSA) to provide funding for mental health services to those who have survived an active shooter event or incident of targeted violence.",
    "The aim of this program is to promote resilience and equity in communities that have recently faced an active shooter or event of targeted violence through implementation of evidence-based, violence prevention, and community engagement programs, as well as linkages to trauma-informed behavioral health services.",
    "This final rule bans the business of manufacturing the most accessible ghost guns, such as unserialized buy build shoot? kits that individuals can buy online or at a store without a background check and can readily assemble into a working firearm in as little as 30 minutes with equipment they have at home.",
    "The Department of Justice's anti-terrorism and emergency funding program currently allows for public agencies, US Attorney's offices, public institutions of higher education and nongovernmental and victim services organizations to receive funding after a crime of terrorism or mass violence has occurred.",
    "pic.twitter.com/NYoDn3M1qX\n Georgia Democrats (@GeorgiaDemocrat) April 5, 2022\nIt should be noted that while Georgia and other constitutional carry? states don't require background checks, anyone who purchases a firearm from an authorized dealer must still undergo a federal background check.",
    "While pursuing permit-less carry is considered a play for GOP voters, a poll by The Atlanta Journal-Constitution earlier this year found that about 70% of Georgia voters polled do not believe Georgians should be allowed to carry a concealed weapon without first obtaining a license.",
    "For instance, when the Ohio legislature was considering its own law, Hamilton County Sheriff Charmaine McGuffey challenged it:\n\"To allow people to carry concealed with no background check, no documentation of who they are and no training is dangerous,\" McGuffey told ABC News.",
    "Prioritizing Resources for Victims of Firearm Violence Act to designate as a fifth priority category programs that provide assistance and mental health services to victims of firearm violence and families of victims of homicide through the Victims of Crime Act (VOCA).",
    "Among them:\nThere's a reason law enforcement officers overwhelmingly oppose permitless carry: it makes their jobs harder and puts their lives  and the lives of the people they're sworn to protect  on the line,? said Shannon Watts, founder of Moms Demand Action.",
    "Biden announced the ATF will now require licensed gun dealers to keep their sales records until they close the business or give up their federal firearm license and then turn these records over the agency where they will be permanently kept.",
    "Once the study has been completed, the Occupational Safety and Health Administration (OSHA) is tasked with developing best practices for employers to keep employees safe from these threats of violence which will be publicly disseminated.",
    "And previous efforts to pass universal background checkslike the one introduced in 2013 in the wake of the Sandy Hook massacre of 1st grade school children and educators in Newton, Connecticuthave failed under a barrage of NRA lobbying.",
    "Maya T. Prahbu reports:\nIn the three years after his election, Kemp did little to push permit-less carry at the Legislature, until former U.S. Sen. David Perdue declared he would challenge the governor for the state's highest office.",
    "Democratic Rep. Joe Neguse of Colorado\nIn addition to the administration's efforts, six Democratic members of the House of Representatives have introduced a package of modest bills designed they say to reduce gun violence.",
    "Kemp had vowed to sign such a law during his 2018 campaign, which also featured him in a much-ridiculed TV ad that showed him pointing a shotgun at an actor depicting someone who wanted to date Kemp's daughter.",
    "To get a permit, many states have required applicants to have a specific need for carryingsuch as dangerous employmentand to undergo background checks and training, including live-fire proficiency tests.",
    "\"Our deputies are well-vetted for their backgrounds, their personalities, their integrity, their ability to follow rules and follow the law, and I would not hand one of them a gun with no training.\"",
    "Because ghost guns lack the serial numbers marked on other firearms, law enforcement has an exceedingly difficult time tracing a ghost gun found at a crime scene back to an individual purchaser.",
    "In March 2021, less than two weeks before a shooter killed 10 people at a shopping center in Boulder, part of Neguse's 2nd District, the Congressman introduced a universal background check bill.",
    "Last year alone, there were approximately 20,000 suspected ghost guns reported to ATF as having been recovered by law enforcement in criminal investigationsa ten-fold increase from 2016.",
    "On a day that we're lucky if there is only one mass shooting and on which congressional Democrats introduced a modest package of gun violence-related legislation, Georgia Republican Gov.",
    "Safe Workplaces Act, this bill would direct the National Institute of Occupational Safety and Health to conduct a study on threats of violence, including gun violence, in the workplace.",
    "But @BrianKempGA plans to sign a dangerous \"criminal carry\" bill into law that weakens public safety by making it easier for criminals to carry hidden, loaded guns in public.",
    "The agency hasn't had a permanent director since 2015, and Biden had to pull his original nomineeDave Chipmanafter foes raised a stink that made his confirmation unlikely.",
    "Perdue accused Kemp of being a career politician who hasn't delivered? for gun rights advocates or backed other cultural issues popular with the party's conservative core.",
    "The green states are those with constitutional carry? laws letting people who can legally own a firearm to carry it concealed with no permit and no training required.",
    "The STOP Violence Act would expand this program to include the location of active shooter events, such as the Table Mesa King Soopers and public assembly facilities.",
    "Of those, 54% of respondents who identified as Republican and 60% of those who said they were conservative opposed allowing handguns to be carried without a permit.",
    "Brian Kemp showed up at a gun store Tuesday afternoon to sign Senate Bill 219, which allows people to carry concealed firearms without a permit or training.",
    "Meanwhile, President Joe Biden on Monday announced his second nominee to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives, Steve Dittelbach.",
    "Now, as the green states in the map below show (with Georgia not yet included), 25 states have such laws on the books, the product of heavy lobbying.",
    "Chipman previously was an adviser to the Giffords Law Center to Prevent Gun Violence and was viewed as anti-gun by advocates of looser firearm laws.",
    "STOP Violence Actthis bill would provide federal funding for preventative security measures at active shooter sites and public assembly facilities.",
    "This makes Georgia the 25th state to adopt a law allowing anyone who can legally own a firearm to carry it concealed without a permit or training.",
    "The other five Democrats introducing these bills are Veronica Escobar (Texas), Ted Deutch (Florida), Lucy McBath and Nikema Williams (Georgia.",
    "Nearly 40 years ago, the NRA began its crusade to get every state to issue concealed-carry permits to anyone who could legally own a firearm.",
    "In the past two months, Republican governors in Alabama, Ohio, and Indiana have also signed such so-called constitutional carry laws.",
    "Ensuring states allocate at least 10% of VOCA funding to these programs, to guarantee funding for victims and communities in need.",
    "Shannon Watts\nNumerous organizations advocating tougher gun restrictions also opposed the Georgia bill and those in other states.",
    "Despite the organization's financial and internal troubles over the past couple of years, its agenda is still being carried out.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "It's another victory for the National Rifle Association gun lobby and the even more extreme Gun Owners of America (GOA).",
    "But that doesn't cover the 20% or so of Americans whom analysts say acquire firearms in private sales or as gifts.",
    "Across the political spectrum, universal background checks have been the gun-law reform with the widest approval.",
    "But beginning in 2009, the GOA and subsequently the NRA began a new crusade to eliminate permits altogether.",
    "What I'm asking people to do is consider that there must be some failsafe placed into the system.\"",
    "I took note of the ridiculousness of this in Wannabe Wild Bill Hickoks fantasize heroic gunplay.",
    "The basic concept: if everybody is armed all the time just about everywhere, we're all safer.",
    "The signing was done, naturally, at a gun store in Douglas County and takes effect July 1.",
    "When states dismantle permitting systems and gut gun safety laws, gun violence goes up.",
    "As in Georgia, the laws in Indiana, Ohio, and Alabama go into effect in a few months.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The most powerful opposition to permitless carry laws comes from law enforcement.",
    "In an ad last week, state Democrats blasted Kemp for planning to sign the law.",
    "Previously, gun dealers could destroy their sales records after 20 years.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "70% of Georgians oppose it and law enforcement has major concerns.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "\"I am not against the Second Amendmentthe right to bear arms.",
    "At the time, just Vermont and Alaska were in that category.",
    "Most recently, such a move failed by two votes in Nebraska.",
    "In the past 16 months, 10 states have enacted such laws.",
    "A still shot from Brian Kemp's 2018 gun-love ad.",
    "Yet Neguse's bill remains stalled in Congress.",
    "Biden again pushed for its passage on Monday.",
    "Brian Kemp signed Senate Bill 319 Tuesday.",
    "Here's a state roster with some details.",
    "When they began, nearly no state did so.",
    "Now, almost all but eight states do so.",
    "This is a short blurb about Daily Kos.",
    "[...]\n\"I have 900 officers,\" she said.",
    "That ruling is expected in June.",
    "), and Andr Carson (Indiana).",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It doesn't always work.",
    "No background check.",
    "Please read it.",
    "x\nNo permit.",
    "Georgia Gov."
  ]
}