{
  "id": 2116,
  "mediaId": 19,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Perdue Vows to Focus on Crime in Georgia, Bashes Kemp for Lack of Leadership'",
  "image": "https://media.breitbart.com/media/2022/02/Georgia-gubernatorial-candidate-David-Perdue-Feb1-2022-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/12/perdue-vows-focus-crime-georgia-bashes-kemp-lack-leadership/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    661,
    1646,
    2087,
    2095,
    4325,
    2550,
    2555,
    2661,
    2672
  ],
  "sentences": [
    "The former senator, who is challenging Kemp in a heated gubernatorial primary election, highlighted during his press conference issues he felt contributed to crime, including the tabled Buckhead cityhood legislation, illegal migration, and a State Patrol that he said has been led to deteriorate.?\nI'm just astounded that the people in Buckhead were not allowed to have that vote,? Perdue said of the dormant legislation that would have allowed a ballot referendum for residents of Buckhead, a wealthy Atlanta neighborhood, to vote on if Buckhead should become its own city with its own police department.",
    "For David Perdue to suggest otherwise in order to score political points during campaign season is dangerous and beneath the office he seeks.?\nHall added, If Perdue wants to attack law enforcement, he should switch primaries and run to the left of Stacey Abrams,? a reference to the Democrat gubernatorial candidate the winner of the May 24 Republican primary will face in the general election.",
    "This needs to be rebuilt.?\nKemp's campaign was compelled to respond to Perdue's State Patrol remarks, issuing a statement Tuesday afternoon characterizing them as an unhinged rant.? The campaign also listed out arrests, citations, and other statistics from the state's Crime Suppression Unit, which was created by the Kemp administration in 2021 as a state-level response to crime waves.",
    "Kemp himself also responded later Tuesday in a local interview with Fox 5 Atlanta, calling Perdue's comments outrageous?:\nThe heroic men and women of the Georgia State Patrol are elite, and we owe them an enormous debt of gratitude for keeping our families, communities, and state safe.",
    "I would help our counties and work with our counties to develop a closer working relationship with ICE [U.S. Immigration and Customs Enforcement] to make sure the detention process is there and the deportation process is there,? Perdue said.",
    "People want to take their own safety into their own hands.?\nHomicide and rape occurrences have increased 43 percent and 39 percent, respectively, in Atlanta over last year, according to Atlanta Police Department data through April 2.",
    "Somehow it's been led to deteriorate by a lack of leadership from the governor's office in the last three years in my opinion.?\nLater in the conference, Perdue again reiterated Kemp let the State Patrol deteriorate.",
    "Perdue said during his press conference he supported the passage of the legislation but that it's too bad it took four years to get it done,? according to a video of the press conference provided to Breitbart News.",
    "Perdue's remarks on crime came hours before Kemp's signing ceremony of Georgia's new constitutional carry law, which allows law-abiding Georgians to carry firearms without a permit.",
    "Ron DeSantis has led multiple efforts to crack down on illegal migration, a crisis that has grown in the U.S. largely because of the Biden administration's open-borders posture.",
    "The heroic men and women of the Georgia State Patrol set the standard for integrity, excellence, and dedicated service for law enforcement organizations.",
    "Perdue charged that the illegal migrant population in Georgia has exploded? during Kemp's tenure and that it now exceeds that of Arizona.",
    "On the issue of Georgia's state police, Perdue said, We've got to get our State Patrol back to the elite level that it always was.",
    "The same data shows aggravated assaults have decreased by one percent, while property crimes have decreased by four percent.",
    "Former Sen. David Perdue held a press conference centered around the issue of crime on Tuesday, the same day Republican Gov.",
    "When I was a kid growing up in Georgia that's what all the county sheriffs deputies and everybody wanted to aspire to.",
    "https://t.co/jYrEoZRKFI\n Brian Kemp (@BrianKempGA) April 12, 2022\nWrite to Ashley Oliver at aoliver@breitbart.com.",
    "Perdue cited Atlanta crime statistics as he said, Crime is out of control.",
    "Perdue said another issue exacerbating crime rates is illegal migration.",
    "Brian Kemp signed pivotal Second Amendment legislation into law.",
    "As long as I'm governor, Georgia will always Back the Blue.",
    " It's not considered the elite group that it always was.",
    "Period,? Kemp campaign spokesman Cody Hall stated.",
    "Perdue compared Georgia to Florida, where Gov.",
    "They wanted to become a State Patrol.",
    "Talk to anybody in uniform right now.",
    "Follow her on Twitter at @asholiver.",
    "It's a lack of leadership."
  ]
}