{
  "id": 2117,
  "mediaId": 1576,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Georgia Gov. Kemp signs bill easing gun laws amid primary",
  "image": "https://www.wabe.org/app/uploads/2021/11/AP20317568584788-scaled.jpg",
  "link": "https://www.wabe.org/georgia-gov-kemp-signs-bill-easing-gun-laws-amid-primary/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1178,
    1646,
    2095,
    4325,
    2555,
    2672
  ],
  "sentences": [
    "SB 319 makes sure that law-abiding Georgians, including our daughters, and your family too, can protect themselves without having to have permission from your state government,? Kemp said outside Gable Sporting Goods in Douglasville, where he said he had previously purchased a handgun for one of his daughters.",
    "Allison Anderman is senior counsel for the Giffords Law Center to Prevent Gun Violence, named for former Arizona U.S. Rep Gabby Giffords, a Democrat who was shot outside a supermarket and suffered a severe brain injury in 2011.\nI don't know that we can really draw any conclusions,? Anderman said.",
    "Perdue cited the failure of lawmakers to allow the Buckhead neighborhood to vote on seceding from Atlanta, said Kemp has let the state police force deteriorate? and said Kemp should do more to arrest people who entered the country illegally.",
    "But in one example of how Perdue's Donald Trump-endorsed challenge has forced Kemp to the right, he revived calls for constitutional carry in January, saying people need to carry guns to protect themselves against crime.",
    "At an event before Kemp signed the law, several Democratic lawmakers lambasted the measure as criminal carry,? saying it would remove one of Georgia's few deterrents blocking people who aren't supposed to carry a gun.",
    "But why are we spreading the access to guns to everyone??\nDemocrats point to polling showing the measure is unpopular with a majority of the public, saying Kemp has become a prisoner of his party's right wing.",
    "The Republican, then running as a conservative insurgent, pushed his support for gun rights, proposing to do away with the requirement that Georgians obtain a permit to carry a concealed handgun in public.",
    "The Constitution of the United States gives us that right, not the government.?\nRepublicans argue that requiring a carry permit, which costs about $75, infringes on Second Amendment gun rights.",
    "Under Georgia law, people who have been convicted of a felony, are facing felony charges or have been treated for certain mental health issues within the past five years can't carry a gun.",
    "Democrats note that more than 5,000 people applied for permits last year and were blocked, and say police and the public will now face the danger of some of those people carrying guns.",
    "But Biden has made no progress on getting Congress to pass gun regulations, and the U.S. Supreme Court could be poised to strike down New York's more restrictive permitting regime.",
    "There are no studies that show permitless carry laws decrease violent crimes, a 2020 Rand Institute analysis found, while it's uncertain whether the laws increase violence.",
    "It's too bad it took four years to get it done, and it's too bad it took me getting in the race for them to get any energy to get that done,? Perdue said of the gun law.",
    "It is a sad day when the Republican leadership across Georgia cares more about their political position than public safety,? said Rep. Roger Bruce, an Atlanta Democrat.",
    "Brian Kemp rose to national notice in 2018 in part through a television ad that showed him brandishing a shotgun at an actor playing a suitor of one of his daughters.",
    "He supported some gun rights expansions but talked little of constitutional carry, failing to mention the issue in his 2019, 2020 or 2021 State of the State speeches.",
    "There's little dissension inside the Republican Party on expanding gun rights, while Democrats are eager to stake their claim to commonsense? gun regulation.",
    "Kemp signed the law a day after Democratic President Joe Biden announced new regulations on ghost guns, privately made firearms without serial numbers.",
    "Republican state House Speaker David Ralston shelved even a more modest gun bill in 2021 after shootings killed eight people at two Atlanta-area spas.",
    "Tuesday, facing a Republican primary challenge from former U.S. Sen. David Perdue, Kemp completed his return to those roots, signing Senate Bill 319.",
    "Perdue told reporters Tuesday in Atlanta that he's glad? Kemp was signing the bill but said the governor isn't doing enough to fight crime.",
    "Even some gun control proponents say that Georgia's laws were already so permissive that it's unclear what will change without permits.",
    "It immediately allows permitless carry in Georgia, making it the 25th state with such a law, and the 10th added in the past two years.",
    "Kemp's support points to a sharp divergence between the Georgia Republican and Democratic parties this year on guns and other issues.",
    "The state would still issue concealed-carry permits to allow Georgians to take advantage of agreements allowing interstate gun carry.",
    "Kemp also signed a bill Tuesday enhancing reciprocity in Georgia for gun owners from other states.",
    "But it removes the background check for a permit to carry a loaded or concealed handgun in public.",
    "The votes haven't been there, but a lot changed,? he told reporters after signing the law.",
    "They also cite permitting delays in some Georgia counties during the COVID-19 pandemic.",
    "Yes, I believe in the Second Amendment,? said Sen. Donzella James, an Atlanta Democrat.",
    "Kemp denies he ever wavered on the issue, saying he had to keep persuading lawmakers.",
    "Kemp's advocacy of permitless carry had grown quieter after he took office.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "The new law doesn't change that.",
    "Georgia Gov."
  ]
}