{
  "id": 2126,
  "mediaId": 12,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "The Jolt: Brian Kemp tangles with grassroots hecklers yelling Liar!'",
  "image": "https://www.ajc.com/resizer/7IXq5qSLLIYotFiIwOlcclgyiJ8=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/23UQLTHKEUVVBQGJSVDNAF6XBM.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-brian-kemp-tangles-with-grassroots-hecklers-yelling-liar/OPZE3KGDERACLJALNTLNKBMYJE/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    2095,
    3082
  ],
  "sentences": [
    "By him going out, giving up all the energy, now we're not energy independent anymore, which started the whole downfall\" -- Herschel Walker's analysis of energy policy doesn't show a grasp of details or really anything at all pic.twitter.com/WR5GkqS8ma\n Aaron Rupar (@atrupar) April 10, 2022\nAlthough Herschel Walker has refused all of the AJC's interview requests since declaring his candidacy seven months ago, his campaign produced a video over the weekend alleging media bias and scrolling though AJC headlines of his race.",
    "Among the stories the Walker campaign resurfaced were a report about an ex-girlfriend of Walker's who told police he had threatened her life; Walker's decision to give a paid speech, instead of a free speech, as his first public appearance as a Senate candidate; and an item about a Texas woman who had planned to host a fundraiser for Walker, until the AJC reported the woman's Twitter profile picture was a swastika.",
    "In response, rival Gary Black's campaign wrote, In 33 seconds, @HerschelWalker's own team just showed everyone that neither he nor Warnock have any business being in the Senate.?\nDemocrats celebrated the Senate confirmation of Ketanji Brown Jackson to become the first Black female Supreme Court justice at the White House Friday.",
    "And we need people in Washington that are going to be leaders, and not people that are going to be followers of people that are upset, have sour grapes, and they're not going to do what's right for the people of Georgia, they're not going to do what's right for people of the United States.",
    "With early voting for the May primaries just weeks away, Herschel Walker appeared on Fox Business with Maria Bartiromo Sunday morning, when she asked him what has changed during the 14 months since U.S. Sen. Raphael Warnock was elected to office.",
    "Now they're trying to blame me for something that I had no constitutional authority to do.?\nThe majority of the Fulton crowd stood for several ovations, but there was a group of critics clustered around several tables heckling Kemp.",
    "As an officer of the court, you were willing to put your name on a legal pleading, alleging that the machines used in Georgia in 2018 were switching votes illegally from one candidate to another is that correct??\nYes,? she said.",
    "You know, this country isthis is one of the most environmentally drilling countries in the world, but yet we're walking on all the resources we have underneath our feet, and we won't say, Hey, guys, we got to come out of this.",
    "Former Atlanta Mayor Keisha Lance Bottoms did a livestream on her Instagram feed before the ceremony, and snapped photos with state Reps. Billy Mitchell and Calvin Smyre, who has his own Senate confirmation process ahead.",
    "The AJC's Mark Neisse has the background on the case, which was originated in a lawsuit filed by Fair Fight Action, the voting ground that Abrams founded, against Georgia election officials after her 2018 loss to Kemp.",
    "It's up to Brian Kemp and David Perdue to explain to Republican women and to all Georgians why they are excluding Kandiss Taylor from participating in multiple Republican primary debates,? Groh-Wargo said.",
    "On Sunday, Abrams noted that Kandiss Taylor  whose campaign motto involves Jesus, guns and babies  invited Abrams to debate because she's being shut out of two other GOP showdowns between Kemp and Perdue.",
    "While two of the three debates on the schedule involve a head-to-head matchup between Kemp and Perdue, the Atlanta Press Club showdown on May 1 will include all of the Republican gubernatorial contenders.",
    "Without naming names, he went on to question where all the people that are out there saying all these things? were when he was battling Stacey Abrams and her allies ahead of the 2018 election.",
    "Warnock announced late Thursday that he received a positive test shortly after he went to the Senate floor to speak and cast his vote for Ketanji Brown Jackson to join the U. S. Supreme Court.",
    "Instead, her campaign manager Lauren Groh-Wargo commended Taylor for being willing to debate? Kemp  and then noted that he skipped their final showdown in 2018 to powwow with Donald Trump.",
    "If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a cold war between Florida and Georgia,? DeSantis said at a press conference in northwest Florida.",
    "Dara Lindenbaum, one of the attorneys who represented plaintiffs in the elections lawsuit going to trial Monday, has now been nominated to join the Federal Election Commission.",
    "I'm not a dictator.? Georgia @GovKemp gets spicy during a Q&A this morning at the Fulton GOP from pro-Trump activists who challenged him on his role in the 2020 election.",
    "And what I mean by that is, you know, one of the first things they did, and I think people need to know this, is they decided that they were going to give up our energy.",
    "Sen. Raphael Warnock shared a letter he wrote using stationery he received from Vice President Kamala Harris on the day of Judge Ketanji Brown Jackson's confirmation.",
    "The latest example came at the Fulton GOP meeting on Saturday when Kemp tangled with a handful of activists repeating debunked conspiracies about the 2020 election.",
    "Harris had encouraged Warnock and New Jersey's Cory Booker, the Senate's other Black Democrat, to write letters to young Black women to mark the date in history.",
    "If you want to know what the truth is about the election, you should first relearn what the laws and the Constitution say,? he said, all but dropping the mic.",
    "The Bulldogs have won four of the last five matchups with the Gators at the World's Largest Outdoor Cocktail Party  er, the World's Largest Cold War Party.",
    "#gapol https://t.co/yOqoRldwu0\n Greg Bluestein (@bluestein) April 9, 2022\nI know there's a lot of people that lied to people about what my powers are.",
    "So I hope you guys take care of that and we'll end up in good shape.?\nFlorida might welcome a cooling off period, at least on the football field.",
    "Niesse notes that the trial could last about a month and feature dozens of witnesses, including voters, election officials and preachers.",
    "Brian Kemp's original victory over Stacey Abrams in 2018 is at the center of a major voting rights case going to trial in Atlanta Monday.",
    "Brian Kemp and other Georgia Republicans are putting permitless carry? and gun-related measures at the center of their 2022 campaigns.",
    "Also spotted in the audience were U.S. Reps. Nikema Williams and Lucy McBath, as well as Black Voters Matter co-founder LaTosha Brown.",
    "Democratic U.S. Sen. Raphael Warnock is expected to testify by video, since Ebenezer Baptist Church also participated in the lawsuit.",
    "Because Warnock is also the pastor at Ebenezer Baptist Church, he sent a message about his COVID diagnosis to the church membership.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "The Texas Republican asked Lindenbaum if criticizing an election as stolen? can undermine faith in the democratic process.",
    "In the nation's history, she is the first Supreme Court justice who looks like you with hair like yours,? Warnock wrote.",
    "U.S. Sen. Raphael Warnock declined an invitation to be at the White House on Friday after testing positive for COVID-19.",
    "By him going out giving up our energy and now we're not energy independent anymore, which started the whole downfall.",
    "The Republican governor predicted open hostilities between the two states if Democrat Stacey Abrams wins in November.",
    "I can't have [former Cuban leader Ral] Castro to my south and Abrams to my north, that would be a disaster.",
    "I wrote this note to say you can be anything, achieve anything you can set your head and your heart to do.",
    "Brian Kemp and former U.S. Sen. David Perdue to go into a June runoff that would further divide the GOP.",
    "I fought them every single time when none of these naysayers over here even cared about it,? he said.",
    "Last week, U.S. Sen. Ted Cruz grilled Lindenbaum during her Senate confirmation hearing to the post.",
    "The senator said he is feeling fine,? but has now canceled a statewide tour planned for this week.",
    "You know, I think they got to remember the song that Michael Jackson said, the man in the mirror.",
    "Where do you start at what has changed is, we've got an administration that they're not leaders.",
    "Brian Kemp had moved beyond the hecklers and naysayers at GOP grassroots meetings, think again.",
    "Ron DeSantis is determined to bring new meaning to the annual Georgia-Florida grudge match.",
    "It's up to the debate organizers  not the candidates  to set the rules of each debate.",
    "Abrams isn't going to meet with Taylor, though she didn't formally reject the offer.",
    "And if you assumed Kemp is taking the pushback lightly, that's also not the case.",
    "The video also included an AJC story about U.S. Sen. Raphael Warnock's divorce.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "There's no word yet on whether, or how, it could affect services for Easter.",
    "We've got a piece up today on why they think that's a winning issue.",
    "At that point, one of those critics yelled liar? about the governor.",
    "Now she's egging it on by highlighting a far-right GOP contender.",
    "Dad.?\nAs always, Jolt readers are some of our favorite tipsters.",
    "You know, right now, you see there's no food on the shelf.",
    "\"They decided they were gonna give up all the energy.",
    "And they're blaming everyone else except themselves.",
    "You got to look at yourself and see what's going on.",
    "I was secretary of state for nine years,? Kemp said.",
    "Cruz also asked about Lindenbaum's role in the case.",
    "Right now gas prices are going out of the roof.",
    "Warnock will quarantine in Washington instead.",
    "They're more reactive rather than proactive.",
    "It depends on the circumstances, she said).",
    "We have full recap of the day at AJC.com.",
    "What has changed is where do you start?",
    "And I think people need to know that.",
    "Warnock wrote to his daughter, Chloe.",
    "Bartiromo had no follow-up question.",
    "Here, in full, is what Walker said.",
    "Stacey Abrams would love for Gov.",
    "Several Georgians were on hand.",
    "We cannot continue to do this.\"",
    "Well, Herschel Walker will.",
    "I mean, I'm the governor.",
    "His patience ran thin.",
    "I'm not a dictator.",
    "If you thought Gov.",
    "I'm the governor.",
    "About the Authors",
    "POSTED: Gov.",
    "Florida Gov.",
    "Love you!",
    "Gov.",
    "..."
  ]
}