{
  "id": 2128,
  "mediaId": 238,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "With Biden's voting rights push stalled, Georgia activists regroup",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/11/georgia-voting-law-biden-abrams-kemp/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2087,
    2095,
    2462,
    545,
    2555,
    2672
  ],
  "sentences": [
    "Noting the large minority populations in counties like DeKalb, Lee said the bill is a way of suppressing the Black and Brown vote without saying you're suppressing the Black and Brown vote.?\nBiden has joined Georgia Democrats in decrying the law, and similar laws elsewhere, calling them Jim Crow 2.0? and un-American? during a speech in Atlanta on Martin Luther King Jr. Day.",
    "So, we've got to be in a position to overcome all of that negativism that they're going to be throwing at us, in addition to what they already have in place.?\nThe summit in Atlanta comes as Democrats have failed to advance voting rights legislation, a key campaign promise for Black voters who helped deliver Georgia.",
    "With new requirements for voters in place, Hale said the groups hope building out that network will let them make sure that we can report immediately what's going on on the ground, so that we can make change.?\nIn 2020, in-person voter registration efforts were heavily disrupted by the pandemic.",
    "On Tuesday, more than a dozen voting rights groups, spearheaded by faith leaders, will gather at The King Center in Atlanta to rally their organizations in the run-up to the midterms  and plot their strategy to outmaneuver new regulations they see as limiting access to the ballot.",
    "But with no signs of progress in President Biden's push for voting rights bills, those groups are now confronting a new challenge: How to turn out voters despite the restrictions passed by state Republicans in the wake of Biden's upset win there.",
    "After the November election last year, I knew, like so many of you, that significant reforms to our state elections were needed,? Kemp said after signing the bill, arguing there was a crisis of competence? in the state's election administration.",
    "[Georgia's voter law] made some changes that will impact what we talk about including new requirements for voting by mail, but fundamentally our goals on the ground remain the same,? said Fair Count's program director, Melva Steps.",
    "While Tuesday's coalition will start with plans that helped drive turnout increases in 2018 and 2020, especially among communities of color, activists say it's unclear how those proven tactics will fare in the face of the new law.",
    "That's going to be a focus for two nonpartisan initiatives founded by Democratic governor candidate Stacey Abrams, Fair Count and The New Georgia Project, which are among the groups supporting the rally in Atlanta this week.",
    "The balance of power in Congress could hinge on several Georgia races, including Sen. Raphael G. Warnock (D)'s likely challenge from former NFL player and all-American Herschel Walker, whom Trump has endorsed.",
    "Georgia Republicans also enacted a new congressional map that includes nine districts that voted heavily for Trump in 2020 and four that solidly broke for Biden with one relatively competitive race left.",
    "But Kemp defended the bill as a necessary tightening of election security and touted some measures to expand voting, like allowing an extra day of early voting and more drop boxes in some rural counties.",
    "She added that companies, faith groups, and local civic bodies that are not political at all but do believe in democracy? have begun mobilizing to register voters and expand access to the ballot.",
    "While neither group is affiliated with Abrams' campaign, they are continuing voter registration and education initiatives predicated on her goal of enfranchising more minority communities.",
    "Since then, Republicans in numerous states have enacted restrictive new voting laws, driven in part by false claims of a stolen 2020 election from allies of former president Donald Trump.",
    "For months, Georgia voting rights advocates and faith leaders warned that a new state law would drastically suppress minority turnout and pleaded with Congress to enshrine protections.",
    "It's something that this administration really should tackle and hold up the battle for us, otherwise they're going to see the repercussions.?\nGeorgia's bill, which was signed by Gov.",
    "Tuesday's event will march from The King Center to Ebenezer Baptist Church, the parish where Martin Luther King Jr. once preached and where Warnock still serves as senior pastor.",
    "In his 2018 gubernatorial campaign, Kemp  then the secretary of state  outraged voting rights groups by purging more than 53,000 voters over a strict signature matching? policy.",
    "The map, which has imperiled two House Democrats and led to a member-on-member primary in one district, threatens Democrats' House control before campaigning begins in earnest.",
    "Despite the growth in the people of color population, they drew districts in such a way that they will be even less representative of the diversity of the state,? said Young.",
    "Fair Count is also partnering with VoteRiders, a nonpartisan voter ID education group, to contact and aid Georgians who may otherwise be unable to navigate the new system.",
    "One key response, advocates said, is enhanced education  particularly teaching voters when they can now request mail-in ballots and how to adhere to new ID requirements.",
    "The bill limits the number of drop boxes overall, imposes new voter ID requirements, and criminalizes passing out water and food to voters in line, among other measures.",
    "Consequently, many Georgia voting rights activists are dismayed at Democrats' lack of progress in expanding access to the ballot, especially among communities of color.",
    "Kemp and other GOP officials, like Georgia Secretary of State Brad Raffensperger, had rejected pressure from Trump and others to alter the outcome of the election.",
    "The groups meeting in Atlanta this week will seek to highlight the long history of suppressing Black votes in a state where Jim Crow was once the law of the land.",
    "The groups, which are mostly nonpartisan but also aligned with Democratic efforts, aim to show GOP leaders that their work will continue in the face of the law.",
    "Abrams is set for a rematch against Kemp in the governor's race, while Georgia Democrats are challenging for secretary of state and attorney general as well.",
    "Other voting rights groups are also planning to have more on-the-ground staffers to help voters properly register and cast ballots early and at the polls.",
    "Joe Manchin III (D-W.Va.) and Kyrsten Sinema (D-Ariz.)  resisting calls to change the filibuster, which the GOP would likely use to block the measures.",
    "While many advocates returned to in-person campaigning for the 2021 Senate runoffs, the groups hope to boost turnout by expanding on those efforts.",
    "Limiting the number of drop boxes and the times when they can be accessed is penalizing those counties that have large populations,? said Rev.",
    "It's actually activated a lot of civic organizations,? said Andrea Young, executive director of the ACLU of Georgia, which sued over the law.",
    "Democrats also won two Georgia Senate runoffs in 2021 that handed Democrats unified control of Congress for the first time in a decade.",
    "The law's opponents, though, have pointed to numerous other measures they said are meant to crack down on minority participation.",
    "Faith leaders partnered with a coalition of legal groups in 2018 and 2020 to help voters who faced challenges in casting ballots.",
    "For Georgia advocates, it's become increasingly clear that they'll have to find a way to organize around the new restrictions.",
    "And Georgia has made history just in the last election and one of our things is going to be, let's make history again.?",
    "Voting rights advocates argue that the newly drawn map also intentionally hinders the voting power of people of color.",
    "Our mission remains the same, with education, outreach, and encouragement for voters to make their voices heard.",
    "Brian Kemp (R) in March 2021, sparked a fierce pushback from major corporations and local religious leaders.",
    "While the bill may depress turnout, backlash has also helped to energize the opposition, advocates argue.",
    "In addition to voter registration, education and mobilization, we also do voter protection,? said Rev.",
    "Biden won Georgia by almost 12,000 votes, the first time a Democrat has won the state since 1992.",
    "He also called for a carve out to the Senate filibuster to pass voting rights legislation.",
    "Jamal Bryant, of New Birth Missionary Baptist Church in Stonecrest, Ga., told The Post.",
    "Timothy McDonald III of First Iconium Baptist Church in Atlanta said in an interview.",
    "Our community has faithfully upheld democracy even when we've not benefited from it.",
    "There also remains ongoing debate over how to best to confront the new restrictions.",
    "That's the name of the game right now: to hold power by any means necessary,? Rev.",
    "I don't just believe in reading about history but making history,? said McDonald.",
    "So, I think this is one campaign promise that has to be fulfilled,? Bryant said.",
    "But multiple Senate bills remain stalled, with at least two centrists  Sens.",
    "Our call is to expand the vote above all, but this is a no brainer,? Rev.",
    "Kemp has long been an advocate of expanding voter ID restrictions.",
    "So now we can adjust and respond intelligently,? McDonald said.",
    "Cynthia Hale of Ray of Hope Christian Church in Decatur, Ga.",
    "The stakes are high this November in Georgia and beyond.",
    "The ACLU of Georgia also sued the state over the maps.",
    "Lee May of Transforming Faith Church in DeKalb County.",
    "They put these mechanisms in place to hold onto power.",
    "But some hope there may be unexpected benefits.",
    "Now we know the rules of the game."
  ]
}