{
  "id": 2130,
  "mediaId": 43,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "conspiracy, Andrew Cuomo won't be on the ballot",
  "image": "https://images.dailykos.com/images/1057208/story_image/GettyImages-1234460114.jpeg?1649441488",
  "link": "https://www.dailykos.com/story/2022/4/11/2090853/-Morning-Digest-Barring-an-X-Files-level-conspiracy-Andrew-Cuomo-won-t-be-on-the-ballot",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    671,
    1071,
    1205,
    1404,
    1454,
    1770,
    1795,
    2095,
    2186,
    2192
  ],
  "sentences": [
    "? PA-Gov: Campaign finance reports are in covering the period of Jan. 1 to March 28, and the Pittsburgh Post-Gazette has collected the numbers from the main Republicans competing in the May 17 primary:\nFormer U.S. Attorney Bill McSwain: $1.4 million raised, $546,000 spent, $1.7 million cash-on-hand\nBusinessman Dave White: $790,000 raised, additional $1 million self-funded, $4.1 million spent, $171,000 cash-on-hand\nState Senate President Pro Tempore Jake Corman: $590,000 raised, $2.38 million spent, $271,000 cash-on-hand\nFormer Rep. Lou Barletta: $431,000 raised, $318,000 spent, $356,000 cash-on-hand\nState Sen. Doug Mastriano: $373,000 raised, $326,000 spent, $1.09 million cash-on-hand\nFour other Republicans are also running, but none of them took in more than $150,000 during this time.",
    "1Q Fundraising\nMN-01: Jeff Ettinger (D): $148,000 raised (in 17 days)\nMT-01: Cora Neumann (D): $401,000 raised, $877,000 cash-on-hand\nNY-22: Josh Riley (D): $360,000 raised, $550,000 cash-on-hand\nTN-05: Beth Harwell (R): $350,000 raised (in five weeks)\nVA-02: Elaine Luria (D-inc): $1.18 million raised, $3 million cash-on-hand\nWA-08: Kim Schrier (D-inc): $1.1 million raised, $4.7 million cash-on-hand\nSenate\n? NC-Sen: The Republican firm Cygnal is the latest pollster to find Trump-endorsed Rep. Ted Budd taking the lead over former Gov.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NY-Gov: Thursday was the filing deadline for New York's June 28 primary, but despite much chatter and speculation, the state Board of Elections mercifully did not receive a filing from Andrew Cuomo for any office.",
    "Politico's Bill Mahoney wryly writes of the disgraced former governor, \"If his supporters covertly knocked on tens of thousands of doors in recent weeks and every one of the people they interacted with kept it a secret, then he could still appear on the primary ballot if he put the signatures in a mailbox on Thursday and they arrived at the board by Monday  which is the final deadline.\"",
    "Green faces frontrunner Blair Milo, who is the former mayor of LaPorte, in the May 3 primary to take on Democratic incumbent Frank Mrvan in a seat that Biden would have carried 53-45.\n? NY-22, NY-24: Army veteran Steven Holden has left the June Democratic primary for the open 22nd District to instead challenge Republican Rep. Chris Jacobs in the reliably red 24th.",
    "Everyone else running to lead the state needed to submit 15,000 petitions (with at least 100 each coming from half of the state's 26 congressional districts), though Mahoney explains that because \"it's fairly easy to get a lot of these thrown out for irregularities, the long-standing rule of thumb has been that the goal should be about 30,000.\"",
    "\"My goal for Kentucky is to get a good conservative governor, said the congressman, who lost an excruciatingly close 2015 primary for this office to eventual winner Matt Bevin, adding, \"And if I see a good candidate out there that I'm friends with that I think can win, then I'll certainly support that candidate.\"",
    "Harmon informed the Lexington Herald Leader this month he's raised a mere $30,000 so far and had $14,000 on hand, though he insisted he's \"still in the early stages\" when it comes to collecting money and understood that \"the closer we get, the more I'm going to have to put a lot more focus on fundraising.\"",
    "The state does publish a list of candidates who've filed for Congress, but it doesn't include all House seats: Candidates running for a district that is contained entirely within either a single county or New York City file with their local election authorities, while everyone else files with the state.",
    "The field also includes Eric Deters, an attorney whose license has been suspended several times, who told the paper that he's willing to self-fund more than $1 million; so far, though, Deters has thrown down just $23,000 of his own money and raised another $12,000.",
    "New York allows statewide candidates to earn an automatic place in the primary by taking at least 25% of the vote at their respective party conventions, but the only gubernatorial candidates to hit that threshold were Hochul and Republican Rep. Lee Zeldin.",
    "Attorney General Daniel Cameron, who is a former legal counsel to Senate Minority Leader Mitch McConnell, recently made news when he once again declined to rule out a campaign against Beshear, saying, \"we're looking at everything that's on the table.\"",
    "Legislatures\n? Special Elections: Here is a recap of Thursday's contest in New York:\nNY AD-20: With about 7,100 votes counted, Republican Ari Brown holds a huge 66-34 lead over Democrat David Lobl in a Long Island seat Trump took 52-47 in 2020.",
    "Two Democrats, at least, are prepared to show they can do more than inhale and exhale: New York City Public Advocate Jumaane Williams and Rep. Tom Suozzi each said they turned in 40,000 signatures in their quest to deny Hochul the nomination.",
    "Fetterman did indeed solicit the support of the Pittsburgh chapter of the Democratic Socialists of America in 2017 when he was running for lieutenant governor, but \"sought\" is the key word, because Fetterman did not receive DSA's backing.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Former Ambassador to the United Nations Kelly Craft, who has long been one of the state and national GOP's most prominent donors, also reiterated in February that she was \"leaning heavily toward running for governor.\"",
    "Under the new congressional map, 10 districts (the 6th through the 15th) are located wholly within the city, while the lone single-county seat anywhere else in the state is the open 4th District in Nassau County.",
    "? IN-01: Air Force veteran Jennifer-Ruth Green, a Republican we hadn't previously mentioned, is running a spot where she touts her military service and pledges to \"advance President Trump's America first policy.\"",
    "As ominous drums sound, the narrator claims, \"Kemp refused to call a special session before the [Senate] runoff, and the widespread illegal ballot harvesting continued, electing two Democrat [sic] senators.",
    "Cygnal's survey for the conservative John Locke Foundation (which merged with the Civitas Institute last year) has Budd ahead 32-21, which is a big shift from McCrory's 24-19 edge in its January numbers.",
    "Former Trump aide Andrew Giuliani, meanwhile, wouldn't reveal how many petitions he gathered, while Lewis County sheriff Michael Carpinelli acknowledged his campaign was kaput because he'd fallen short.",
    "Secretary of State Michael Adams also declined to rule it out last year, though he said it was unlikely, while the Herald Leader adds that state Rep. Savannah Maddox hasn't said no either.",
    "Instead of calling Fetterman a \"self-described socialist\"he in fact has never described himself that waythe spot now says that Fetterman \"sought the Democratic Socialists' endorsement.\"",
    "Finally, while Bevin doesn't appear to have said anything about running to avenge his narrow 2019 loss to Beshear, political observers have speculated about that idea for some time.",
    "Election officials can take a few weeks to release their lists of contenders, so it'll be a little while before we know exactly who will be running for Congress in all 26 districts.",
    "? OR-06: A new group called Justice Unites Us is spending at least $847,000 to support economic development adviser Carrick Flynn in the May 17 Democratic primary for this new seat.",
    "Four years later, the unpopular governor delayed filing to run again despite announcing he was in, which led to plenty of talk that he'd pull the plug on his re-election campaign.",
    "Comer, for his part, finally announced two days later he had \"zero desire to run against a multi-millionaire incumbent Governor in a Primary regardless of how unpopular he was.\"",
    "Major party candidates for the House, meanwhile, need to turn in 1,250 valid petitions, though they too want to provide considerably more to guard themselves against challenges.",
    "Rep. James Comer also said at that time he had \"no plans on running for governor at this moment\" and intended to stay in Congress, which he even acknowledged wasn't quite a no.",
    "Kevin Stitt, in the June Republican primary, arguing that \"the Stitt administration is rife with corruption, self-dealing and cronyism, and Oklahomans deserve another choice.\"",
    "We'll be taking a look at the state of play in each competitive congressional race after first quarter campaign finance reports are in following the FEC's April 15 deadline.",
    "? PA-Sen: Penn Progress, the James Carville-backed super PAC that got its inaugural TV ad yanked from the airwaves the day it debuted for making false claims about Lt. Gov.",
    "The incumbent begins with a massive financial advantage over his declared GOP foes, but as we'll discuss, there are plenty of other Republicans who are eyeing this contest.",
    "Needless to say, even Agent Mulder would question the existence of a clandestine statewide signature-gathering conspiracy, but if Cuomo wanted to challenge Democratic Gov.",
    "McSwain, meanwhile, has also benefited from an additional $5.8 million in spending from Commonwealth Leaders Fund, a group funded by the state's wealthiest man, Jeff Yass.",
    "It would have almost certainly been better for Republicans if they'd swapped Bevin out for Comer (or pretty much anyone else) as Beshear narrowly unseated the incumbent.",
    "For the GOP, wealthy businessman Harry Wilson announced that he'd submitted 36,000, while 2014 nominee Rob Astorino's team said he'd filed 20,000 \"solid signatures.\"",
    "Tate Reeves, and while he's said little publicly since then, Mississippi Today's Adam Ganucheau recently wrote that the speaker \"is still flirting\" with the idea.",
    "Of note is Fetterman's response to a DSA questionnaire, obtained by Politico reporter Holly Otterbein, in which he was asked, \"Do you identify as a socialist?\"",
    "The filing deadline is set for the first week of 2023, and if the last two governor races are any indication, we won't know for sure who's running until then.",
    "House\n? FL-13: State Rep. Ben Diamond has received an endorsement from House Majority Leader Steny Hoyer in the August Democratic primary for this open seat.",
    "Kintsel, who is a former state House parliamentarian but has never run for office before, did not point to any specific allegations in his launch statement.",
    "Bevin did indeed make it clear he was running just days before the 2019 deadline, though he also used that occasion to announce he was dropping Lt. Gov.",
    "His allies at the RGA, though, recently announced that it would spend $577,000 to support him this month through its State Solutions Inc. affiliate.",
    "Andy Beshear raised $1 million and has $2.2 million stockpiled ahead of what will be a challenging 2023 re-election bid in this conservative state.",
    "In 2015 Bevin, who had just badly failed to deny renomination to McConnell, announced his ultimately successful bid on the very last day possible.",
    "? NE-Gov: State Sen. Brett Lindstrom earned an endorsement late last month from Omaha Mayor Jean Stothert ahead of the May 10 Republican primary.",
    "? MS-Gov: State House Speaker Philip Gunn last summer made plenty of news when he refused to rule out a 2023 Republican primary bid against Gov.",
    "Democrat Josh Shapiro, who has no intra-party opposition, raised $4.53 million, which is almost as much as those five Republicans put together.",
    "Commissioner of Agriculture Ryan Quarles, state Sen. Max Wise, and Somerset Mayor Alan Keck each previously expressed interest last summer.",
    "Cameron is the Bluegrass State's first Black attorney general, and he'd make history again if he were elected to the top job in 2023.",
    "Indeed, New York campaigns have long been aggressive about going to court to challenge the validity of their opponent's signatures.",
    "? OK-Gov: Oklahoma Department of Veterans Affairs Director Joel Kintsel announced Thursday that he would challenge his boss, Gov.",
    "Comer, who had lost the primary to Bevin by 83 votes, also made it known he was considering a rematch if the incumbent did run.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "There's been little indication that Stitt, who self-funded his successful 2018 bid, is vulnerable to an intra-party challenge.",
    "State Auditor Mike Harmon announced his campaign back in July, but he doesn't appear to have made good use of his head start.",
    "former Brooklyn Democratic Party leader Frank Seddio recently said of anyone who might get knocked off the ballot this way.",
    "It will still take a little time before we know exactly who's on the June ballot for governor and U.S. House seats, though.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The last poll we saw giving the former governor the advantage was, ironically, from an early March internal for Budd.",
    "Neither Harmon or Deters, though, will likely deter many fellow Republicans from getting in (no pun intended).",
    "Flynn has already benefited from $4.79 million in aid from the crypto industry-aligned Protect Our Future PAC.",
    "Uncounted mail-in votes may shift the margin, but Brown has declared victory in this GOP-held seat.",
    "? OH-Sen: The influential anti-abortion group Ohio Right to Life has backed venture capitalist J.D.",
    "? KY-Gov: Campaign finance reports are in for the first quarter of the year, and Democratic Gov.",
    "Governors\n? GA-Gov: A group called Get Georgia Right is airing an ad that bludgeons Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Kathy Hochul as an independent, he would have until May 31 to submit petitions.",
    "Jenean Hampton from his ticket in favor of adding state Sen. Ralph Alvarado.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "\"Breathing shouldn't be the only qualification for running for office.\"",
    "The attorney general spent $1.9 million and had $16 million on-hand.",
    "Brian Kemp with the Big Lie ahead of the May 24 Republican primary.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "If Kemp can't beat voter fraud, he won't beat Stacey Abrams.\"",
    "His response: \"No, I don't consider myself a socialist.\"",
    "John Fetterman, has now released a revised version.",
    "Pat McCrory ahead of the May 17 Republican primary.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "There is no word on the size of the buy.",
    "Vance in the May 3 Republican primary.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "\"Fuck them!\""
  ]
}