{
  "id": 2134,
  "mediaId": 302,
  "date": "4/10/2022 12:00:00 AM",
  "headline": "Steelers QB Dwayne Haskins killed in auto accident in Florida",
  "image": "https://www.tampabay.com/resizer//UlPuyVvhmbO9YE11Iv6Sn83jdPA=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/USPC65H62VDQNMPW7UV5TPUOTY.jpg",
  "link": "https://www.tampabay.com/news/2022/04/09/steelers-qb-dwayne-haskins-killed-in-auto-accident-in-florida/?itm_source=parsely-api",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.tampabay.com/author/associated-press",
  "termIds": [
    868,
    1019,
    1038,
    1193,
    1275,
    1355,
    1612,
    2095,
    2201,
    399
  ],
  "sentences": [
    "Jones and other federal judges have been reluctant to order last-minute changes, noting that the Supreme Court has repeatedly said federal judges shouldn't alter rules on the eve of an election.?\nIn the months preceding the 2018 election, Abrams, a Democrat, accused her Republican opponent in the governor's race, then-Secretary of State Brian Kemp, of using his position as Georgia's chief elections officer to promote voter suppression, an allegation Kemp has vehemently denied.",
    "I ask for Mr. Jackson to turn himself over to the authorities, so resolution to the crime committed against me runs its course, whatever the courts determine that outcome to be.?\nThe pop star's dogs were returned two days later by a woman who claimed she had found them tied to a pole and asked about Lady Gaga's offer of a $500,000 reward if the dogs were returned no questions asked.? The singer was in Rome at the time filming a movie.",
    "Lawyers for the state argue the claims in the lawsuit are not supported by the evidence.? The number, geographic scope and severity of the alleged problems experienced by voters identified by the plaintiffs do not rise to a level sufficient to demonstrate an unconstitutional burden on voting in Georgia,? state lawyers wrote in a filing.",
    "The lawsuit cited multiple alleged problems, including the purging of eligible voters from voter rolls under a use it or lose it? policy; the state's so-called exact match voter registration rules; an insufficient number of voting machines at some precincts; and a lack of sufficient training for election officials.",
    "Since the start of this lawsuit, we have highlighted real voters and their challenges because we believe that is one of the most effective ways to demonstrate the barriers in Georgia's elections system,? Fair Fight executive director Cianti Stewart-Reid said in an emailed statement.",
    "Jackson already had been charged in the attack and had pleaded not guilty when the county district attorney's office filed a superceding indictment Tuesday charging him with attempted murder, conspiracy to commit a robbery and assault with a semiautomatic firearm.",
    "He was always making people smile, never taking life for granted.?\nTomlin and general manager Kevin Colbert both praised Haskins for his improvement since joining the team, and the Steelers re-signed him to a one-year deal as a restricted free agent in March.",
    "Among other things, the state's measure reduced the window to request an absentee ballot, stripped power from the secretary of state and sharply curtailed the use of absentee ballot drop boxes in populous and Democratic-voting metro Atlanta counties.",
    "Ohio State coach Ryan Day, who was the quarterbacks coach during Haskins' final season at the school, called Haskins' death beyond tragic.?\nFor those who knew him closely, he was much more than a great football player,? Day posted on Twitter.",
    "The accident caused the highway to be shut down for several hours, and Miranda said it's an open traffic homicide investigation.?\nA 2019 first-round draft pick by Washington, Haskins was released by the team after going 3-10 over two seasons.",
    "Filed in November 2018 by Abrams' Fair Fight Action organization, the suit alleged that state officials grossly mismanaged? the election, depriving some citizens, particularly low-income people and people of color, of their right to vote.",
    "The plaintiffs also say election officials aren't sufficiently trained on canceling an absentee ballot if someone chooses to vote in person instead, which can cause voters to be turned away or forced to cast a provisional ballot.",
    "Prosecutors said Jackson and two other alleged gang members had driven around looking for expensive French bulldogs to steal, then spotted, tailed and robbed Ryan Fischer as he walked Lady Gaga's dogs near Sunset Boulevard.",
    "The lawsuit originally called for a sweeping overhaul of the state's elections, but its scope was considerably narrowed after the state made changes that addressed some allegations and others were dismissed by the court.",
    "The plaintiffs say data entry errors or differences as minor as a missing hyphen or apostrophe can trigger a non-match and that naturalized citizens can also be wrongly flagged as noncitizens if records are outdated.",
    "The Ohio State community and our entire football program are heartbroken.?\nThe Steelers gave Haskins a chance to resurrect his career in January 2021 when they signed him a month after being released by Washington.",
    "The plaintiffs claim that Georgia's secretary of state and State Election Board members are denying and abridging Georgians' right to vote? in violation of the Voting Rights Act of 1965 and the U.S. Constitution.",
    "James Howard Jackson, 19, was facing an attempted murder charge when he was released from Los Angeles County's jail on Wednesday due to a clerical error,? the county Sheriff's Department said in a statement.",
    "Our entire team is sending our heartfelt condolences and thoughts and prayers to the Haskins family at this time.?\nOhio State posted a photo of Haskins on its Twitter feed, topped by the description Leader.",
    "Under the exact match? policy, information from voter registration applications is checked against information held by the state Department of Driver Services or the federal Social Security Administration.",
    "LOS ANGELES  A gunman accused of shooting and seriously wounding Lady Gaga's dog walker and stealing her two French bulldogs was mistakenly released from jail and is being sought, authorities said Friday.",
    "Haskins made the roster as the third-stringer but only dressed once, serving as the backup in a tie with Detroit after Roethlisberger was placed into the COVID-19 protocol the night before the game.",
    "Our thoughts and prayers are with his wife, Kalabrya, and his entire family during this difficult time.?\nWashington coach Ron Rivera said he was absolutely heartbroken? to learn of Haskins' death.",
    "Her 3-year stolen election' campaign has been nothing more than a political stunt to keep her in the national spotlight, and it's a disservice to Georgia voters,? he said in an emailed statement.",
    "Our thoughts and prayers are with his wife, Kalabrya, and his entire family during this difficult time.?\nFORT LAUDERDALE  Dwayne Haskins was working on a second chapter for his young NFL career.",
    "The statewide voter registration database is error-ridden,? the plaintiffs say, resulting in the erroneous deletion of eligible voters' registration or critical information being incorrect.",
    "Haskins appeared to be in South Florida this week with several teammates, including fellow quarterback Mitch Trubisky, running back Najee Harris and tight end Pat Freiermuth.",
    "Fair Fight says it works to promote voting rights and support progressive candidates around the country, and its PAC has raised more than $100 million since its founding.",
    "While I'm deeply concerned at the events that led to his release, I'm confident law enforcement will rectify the error,? Fischer said in a statement obtained by KABC-TV.",
    "In February 2021, Jones threw out parts of the lawsuit, saying some allegations were made irrelevant by changes in state law or the plaintiffs' lack of standing.",
    "The issues remaining for the trial have to do with the exact match? policy, the statewide voter registration list and in-person cancellation of absentee ballots.",
    "ATLANTA  When she ended her first bid to become Georgia governor in 2018, Stacey Abrams announced plans to sue over the way the state's elections were managed.",
    "Meanwhile, Abrams, a state lawmaker who was little known outside Georgia when she ran four years ago, has become a household name and Democratic Party star.",
    "These problems disproportionately affect people of color and can depend on where a person lives because counties do things differently, the plaintiffs say.",
    "Later that year, former President Donald Trump hurled insults at state officials who declined to overturn his narrow general election loss in the state.",
    "He quickly became part of our Steelers family upon his arrival in Pittsburgh and was one of our hardest workers, both on the field and in our community.",
    "Haskins' death sparked an outpouring of grief from multiple corners of the NFL, particularly from former teammates with the Steelers and Commanders.",
    "In the more than three years since that fiercely fought contest captured national attention, the focus on Georgia's elections has only intensified.",
    "The only Democrat running for governor, she'll face Kemp again in November if he fends off a primary challenge from former U.S. Sen. David Perdue.",
    "Among them were some of the claims about voting machines and election technology, as well as the security of voter lists and polling place issues.",
    "The move was done to speed up the legal process? and Jackson was arraigned Wednesday under a new case number, the DA's office said in a statement.",
    "Numerous GOP-led state legislatures passed election bills last year after Trump stoked false claims that widespread fraud led to his 2020 defeat.",
    "Numerous GOP-led state legislatures passed election bills last year after Trump stoked false claims that widespread fraud led to his 2020 defeat.",
    "The following month, Jones dismissed claims targeting the use it or lose it? policy and some allegations of inadequate training of poll workers.",
    "Republicans in Georgia this year passed legislation to let the Georgia Bureau of Investigation initiate probes into alleged election wrongdoing.",
    "Humbled by the decision, Haskins stressed he was eager to work hard and absorb as much as he could from Ben Roethlisberger and Mason Rudolph.",
    "The 24-year-old quarterback was spending time with some teammates with the Pittsburgh Steelers, getting ready to compete for a starting job.",
    "He was attempting to cross the westbound lanes of Interstate 595 when there was oncoming traffic,? Miranda said in an emailed statement.",
    "If there's a discrepancy, the would-be voter must show identification to county officials before being able to cast a regular ballot.",
    "And the nation watched closely in January 2021 as a pair of Democrats unseated the state's two incumbent Republican U.S. senators.",
    "Forever a Buckeye.?\nAt Ohio State, Haskins set single-season records for touchdowns passing with 50 and yards passing with 4,831.",
    "During a violent struggle, Fischer was hit, choked and then shot in an attack captured by the doorbell camera of a nearby home.",
    "Secretary of State Brad Raffensperger accused Abrams and her allies of trying to undermine the integrity of Georgia elections.",
    "That can prevent eligible voters from being able to vote or force them to overcome undue burdens to do so, the plaintiffs say.",
    "Even if U.S. District Judge Steve Jones sides with the plaintiffs, it's unclear whether that will affect elections this year.",
    "Additionally, they argue, the alleged problems cited are not the responsibility of the state officials named in the lawsuit.",
    "Haskins was killed early Saturday morning when he was hit by a dump truck while he was walking on a South Florida highway.",
    "I am devastated and at a loss for words with the unfortunate passing of Dwayne Haskins,? Steelers coach Mike Tomlin said.",
    "She's charged with receiving stolen property and the father of another suspect is charged with helping him avoid arrest.",
    "It asked a federal judge to find that Georgia's elections processes violated the U.S. Constitution and federal law.",
    "More than three years later, as she makes another run at the governor's mansion, the lawsuit is going to trial.",
    "She added that voters from around the state will testify at trial about obstacles faced while trying to vote.",
    "The sheriff's Major Crimes Bureau is Major Crimes Bureau is working on finding him, the statement said.",
    "The sheriff's Major Crimes Bureau is Major Crimes Bureau is working on finding him, the statement said.",
    "Dwayne meant so much to so many people,? Steelers defensive lineman Cameron Heyward posted on Twitter.",
    "Florida Highway Patrol spokeswoman Lt. Indiana Miranda said Haskins was pronounced dead at the scene.",
    "Voting rights groups and the U.S. Department of Justice promptly sued; those lawsuits are pending.",
    "Jackson is one of five people arrested in connection with the Feb. 24, 2021, attack in Hollywood.",
    "I've been shot!? and Help me!? and I'm bleeding out from my chest!?\nFischer lost part of a lung.",
    "It filed the lawsuit along with Care in Action, a nonprofit that advocates for domestic workers.",
    "Jackson was subsequently released from custody by the Los Angeles County Sheriff's Department.",
    "He was signed by Pittsburgh as a developmental QB, but he didn't appear in a game last season.",
    "Dwayne was a talented young man who had a long life ahead of him,? Rivera said in a release.",
    "For example, a 2019 law called for replacing the state's outdated voting machines.",
    "The world lost a great person today,? Steelers star T.J. Watt posted on Twitter.",
    "When Dwayne first walked into the locker room I could tell he was an upbeat guy.",
    "Georgia's bill, which Kemp signed into law a year ago, was one of the broadest.",
    "Fair Fight collected statements from people who said they had problems voting.",
    "Dwayne was a great teammate, but even more so a tremendous friend to so many.",
    "I know I speak for the rest of our team in saying he will be sorely missed.",
    "He also dismissed some claims relating to provisional and absentee ballots.",
    "He was expected to compete with Rudolph and Trubisky at training camp.",
    "Some of the alleged problems were addressed by changes in state law.",
    "His smile was infectious and he was a guy you wanted to be around.",
    "This is a very sad time and I am honestly at a loss for words.",
    "Miranda didn't say why Haskins was on the highway at the time.",
    "We are unsure as to why they did so,? the statement said.",
    "The camera recorded the dog walker screaming Oh, my God!",
    "He was the 2019 Rose Bowl MVP as the Buckeyes went 13-1.",
    "He had a giant heart, old soul and an infectious smile.",
    "RIP DH.?\nESPN was the first to report Haskins had died.",
    "Problems during the 2020 primary drew sharp criticism.",
    "The new system was implemented statewide in 2020.",
    "We are going to miss the heck out of him as well.",
    "Several churches have also joined as plaintiffs.",
    "Luckily I got a chance to get to know you.",
    "Devastated,? Rudolph said on social media.",
    "We are all in shock about losing him.",
    "That's when his life was cut short.",
    "The trial is set to begin Monday.",
    "By KATE BRUMBACK Associated Press",
    "We lost you way too early.",
    "I am truly heartbroken.",
    "Legend.",
    "Mr."
  ]
}