{
  "id": 2135,
  "mediaId": 223,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "DeSantis Warns of a Cold War' Between Florida and Georgia if Stacey Abrams Becomes Governor",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/214/a4d62605-c82b-4178-bc25-d120a8ded620.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/04/09/desantis-warns-of-a-cold-war-between-florida-and-georgia-if-stacey-abrams-becom-n2605689",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    661,
    1951,
    2095,
    146,
    428,
    2556,
    2661,
    2672
  ],
  "sentences": [
    "Abrams's chances in November depend in large part on whether or not these younger voters turn out,? Spencer Kimball, who conducted the survey for Emerson College Polling, said to The Hill.",
    "Ron DeSantis said in a press conference on Friday that there will be a Cold War? between Florida and Georgia if Democratic gubernatorial candidate Stacey Abrams is elected governor.",
    "If Stacey Abrams is elected Governor of Georgia, I'm just going to be honest, that will be a Cold War between Florida and Georgia at that point,? DeSantis added in his remarks.",
    "Previously, she represented Georgia's 89th district for the state House of Representatives from 2007 to 2017 and served as minority leader from 2011 to 2019.",
    "2022 could be a rematch between Abrams and Kemp, or Abrams could run against Republican gubernatorial candidate former Sen. David Perdue.",
    "A poll released this week by The Hill and Emerson College shows incumbent Kemp leading Abrams by a 51 percent to 44 percent margin.",
    "The poll surveyed 1,013 registered voters between April 1-3, for an overall margin of error of plus or minus 3 percentage points.",
    "DeSantis kicked off his remarks by saying how the Masters golf tournament is happening in Augusta, Georgia this weekend.",
    "That'd be a disaster.?\nI hope you guys [Georgia voters] take care of that and we end up in good shape,? he continued.",
    "I just want you to know that we really appreciate our Georgians,? he said to the attendees in Gulf County.",
    "In addition, Perdue, Kemp's primary challenge, leads Abrams by a 49 percent to 44 percent margin.",
    "Abrams ran for governor in the 2018 Georgia election and lost to Gov.",
    "I mean, I can't have Castro to my south and Abrams to my north.",
    "Source: AP Photo/Rick Bowmer\nRepublican Florida Gov.",
    "Abrams announced her candidacy in December.",
    "Brian Kemp, a Republican."
  ]
}