{
  "id": 2140,
  "mediaId": 409,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "DeSantis Says a Stacey Abrams Win in Georgia Could Cause Cold War' with Florida",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/02/desantis.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/desantis-says-a-stacey-abrams-win-in-georgia-could-cause-cold-war-with-florida/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    661,
    1951,
    2095,
    146,
    2661,
    2672
  ],
  "sentences": [
    "DeSantis said he really appreciates our Georgians? and said, I hope you guys take care of that we'll end up in good shape.?\nA spokesperson for DeSantis clarified the governor's comments in a statement to Newsweek.",
    "Since her defeat in 2018, Abrams has become a well-known figure in the Democratic Party, with many crediting her for helping elect Democratic Georgia Senators Raphael Warnock and Jon Ossoff.",
    "If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a Cold War between Florida and Georgia,? DeSantis said during a press conference.",
    "Florida governor Ron DeSantis (R.) on Friday predicted a Cold War? could ensue between Florida and Georgia should Democrat Stacey Abrams be elected governor of Georgia.",
    "If Stacey Abrams wins the governorship of Georgia, we know that her approach to leadership will involve more heavy-handed government, taxes, and bureaucrat influence.",
    "The governor was simply making an analogy to the stark ideological differences that underpinned the Cold War,? the spokesperson said.",
    "Now, Abrams is running once again and will be uncontested in the Democratic primary field.",
    "In Florida, Governor DeSantis will continue to keep Florida free and put citizens first.",
    "Abrams first ran for governor in 2018, losing to Republican Brian Kemp.",
    "Recent polling shows Kemp leading Abrams 51 percent to 44 percent.",
    "Former Senator David Perdue, a Republican, is running as well.",
    "I can't have Castro to my south and Abrams to my north.",
    "That would be a disaster,? he said, referring to Cuba.",
    "Perdue also leads Abrams 49 percent to 44 percent.",
    "She will again face off against Kemp.",
    "She still has not conceded the race."
  ]
}