{
  "id": 2151,
  "mediaId": 43,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Florida Man (R) Claims A \"Cold War\" Is Coming If Stacey Abrams (D) Becomes Governor",
  "image": "https://images.dailykos.com/images/1057347/story_image/HU4ALP4PYFEDDLO33AT2YJ7UCM.jpeg?1649458683",
  "link": "https://www.dailykos.com/story/2022/4/8/2090919/-FL-amp-GA-Gov-Florida-Man-R-Claims-A-Cold-War-Is-Coming-If-Stacey-Abrams-D-Becomes-Governor",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1338,
    1451,
    1761,
    1951,
    2095,
    2661,
    2672
  ],
  "sentences": [
    "Governor\nJen Jordan for Georgia Attorney General\nBee Nguen for Georgia Secretary of State\nLucy McBath for Congress\nCarolyn Bourdeaux for Congress\nWe Stand United\nAsian American Advocacy Fund\nGeorgia Equality PAC\nHuman Rights Campaign\nJon Ossoff\nGeorgia Democratic Party\nGeorgia House Democrats\nFair Fight\nGeorgia Blue Project\nOur American Dreams PAC\nGeorgia Stand-Up\nNew Georgia Project\nGaleo\nWoke Vote\nAmplify Action\nMijente PAC\nGeorgia Latino Alliance for Human Rights\nBlack Voters Matter",
    "FYI, this is DeSantis:\nx\nx\nBy the way, here's the latest stupid attack line from the Georgia GOP:\nGeorgia gubernatorial candidate Stacey Abrams filed state financial disclosures that placed her net worth at $3.17 million, opening a new line of criticism from her Republican opponents who are now targeting her millionaire status, the Associated Press reports.",
    "Click below to donate and get involved with these Florida and Georgia Democrats campaigns:\nFlorida\nCharlie Crist for Governor\nNikki Fried for Governor\nAnnette Taddeo for Governor\nVal Demings for Senate\nFlorida Democratic Party\nRemove Ron PAC\nGeorgia\nStacey Abrams for Governor\nRaphael Warnock for U.S. Senate\nCharlie Bailey for Georgia Lt.",
    "Be a part of the conversation and join our statewide seniors rally tonight at 6:00PM ?? https://t.co/vtx4PS16GH pic.twitter.com/kUCc2G4Epc\n Charlie Crist (@CharlieCrist) April 6, 2022\nx\nHanding out massive corporate tax giveaways while slashing affordable housing  at a time when rents are sky-rocketing in our state.",
    "And national GOP spokesperson Garrison Douglas claimed that Abrams is using her campaign as a platform for her own financial gain.?\nAccording to the AP, the facts are that Abrams' new home was financed by a $760,000 mortgage, and her GOP gubernatorial rivals are much wealthier than her.",
    "wRONg DeSantis.https://t.co/lAtIf2BYa7\n Charlie Crist (@CharlieCrist) April 8, 2022\nNikki Fried:\nAgriculture Commissioner Nikki Fried still has a Democratic Primary ahead of her in the Governor's race, but she's already sharpening her General Election message against incumbent Gov.",
    "Joshua Scacco, an associate professor of political communication at the University of South Florida, also believed that the Republican governor may regret so feverishly going after a private corporation, especially one with such a \"profound influence\" in Florida as Disney.",
    "Also, something to consider:\nWhile there is not much potential for a political backlash against DeSantis speared on by Disney workers alone, the governor's battle with the \"happiest place on earth\" could yet affect how Floridians as a whole decide how they will vote.",
    "DeSantis, while speaking at a press event centered around infrastructure improvements and economic developments Friday morning, indicated that Abrams winning the governorship in Georgia could bring about a Cold War between the two southern states.",
    "Ron DeSantis (R. FL)\nFucking asshole:\nFlorida Governor Ron DeSantis does not want to see Democrat Stacey Abrams become the next governor of Georgia and stated that if it were to happen, it would not be good for Florida and Georgia.",
    "Now, instead of criticizing Abrams' financial management skills, GOP strategists are creating a narrative that the Democratic candidate is an out-of-touch elitist who can't connect with the lives of average Georgians.",
    "@NikkiFried https://t.co/lsWmN54wFt\n LatinosConNikki (@LatinosConNikki) April 8, 2022\nAnnette Taddeo:\nx\nMientras tanto la administracin de DeSantis ha empezado a enviar ms de $600 millones a corporaciones gigantes.",
    "He's spent the last three-and-a-half years taking power, limiting people's rights to vote, scapegoating communities, taking away women's rights to make a decision for her own body, making it harder to protest.",
    "Freeder suggested that if DeSantis continues to fight the company beloved by families, then a \"small but meaningful number of swing voters\" could end up siding with Disney over the Governor.",
    "Time and time again, everything he has done in the last three-and-a-half years of his administration is to gain power for one purpose and one purpose only -- to run for president in 2024.\"",
    "At a March political rally, former President Donald Trump falsely claimed that the voting rights advocate now lives in these gorgeous multi-multi-million-dollar houses,? the AP reported.",
    "https://t.co/st95a6jA1q\n Annette Taddeo (She/Her/Ella) (@Annette_Taddeo) April 7, 2022\nHealth and Democracy are on the ballot and we need to be ready to flip Georgia and Florida Blue.",
    "Also:\nFlorida Agriculture Commissioner and Democratic gubernatorial candidate Nikki Fried said there is one word that comes to mind when she thinks of current Gov.",
    "When Abrams ran for governor four years ago, her net worth was $109,000 and she owed $54,000 to the IRS for self-employment taxes that she didn't pay on time.",
    "If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a Cold War between Florida and Georgia at that point,\" DeSantis said.",
    "The latest example: a fundraising email from Team Nikki, spotlighting enthusiasm from far-right media personality Alex Jones for the Republican incumbent.",
    "So it's not surprising that just last week, Alex Jones called DeSantis better than Trump' and gave DeSantis his full support,? the email asserts.",
    "Abrams, who does not have an opponent in her upcoming Democratic primary in May, is seeking to unseat the current governor Republican Brian Kemp.",
    "x\nI simply believe the governor of Florida shouldn't focus on a run for president, a fight with Mickey Mouse or making headlines on Fox News.",
    "We've already made history in the State Senate, and we did it by earning the trust & support of diverse voters in a Trump +6 district.",
    "Disney is the largest on-site employee in Florida and a major source of income and even pride to those in the Sunshine State.",
    "Kemp's Republican primary challenger, David Perdue, reported a net worth of $50 million and an income of $9.3 million.",
    "Her political rivals painted her as financially irresponsible and questioned her ability to oversee state finances.",
    "Jones has said DeSantis was better than (Donald) Trump,? an endorsement that did not go unnoticed by Fried's team.",
    "\"Dictator,\" Fried told WPTV's Michael Williams during an interview Friday in advance of Sunday's \"To the Point.\"",
    "https://t.co/cXe2NilK4I\n Charlie Crist (@CharlieCrist) April 5, 2022\nx\nHave you seen the Crist Seniors plan?",
    "Our campaign is building a Florida where our seniors are treated with the respect and dignity they deserve.",
    "Las prioridades de Ron #DeSantis estn completamente al revs y lo peor, perjudican activamente a #Florida?.",
    "https://t.co/1SA1gQAkE0\n Annette Taddeo (She/Her/Ella) (@Annette_Taddeo) April 7, 2022\nx\nA Dnde Vamos?",
    " Nikki Fried (@NikkiFried) April 8, 2022\nx\n$300.000.000 de nuestras pensiones invertidos en #Rusia.",
    "\"We got a little bit going on in Georgia this week with the Masters golf tournament, big deal.",
    "First, Charlie Crist:\nx\nFlorida needs a leader who isn't afraid to stand up to Putin.",
    "Brian Kemp has a net worth of about $8.5 million and an income in 2021 of $551,000.",
    "Now, we will do it again as the first Latina Governor of Florida.",
    "Meanwhile, I've been liking how Democrats have been hitting Gov.",
    "$100.000.000 saqueados de nuestro fondo de viviendas asequibles.",
    "El 99% de las empresas de Florida no reciben ni un centavo.",
    "I just want you to know we really appreciate our Georgians.",
    "Hispanic voters want real leadership & real representation.",
    "This is her second run in the Georgia gubernatorial race.",
    "Ron DeSantis has always kept questionable company.",
    "\"Harsh language, some would say,\" Williams said.",
    "The governor of Florida should focus on Florida.",
    "\"Not at all,\" Fried replied.",
    "\"Look at what he's doing.",
    "DeathSentence.",
    "Incumbent Gov.",
    "Ron DeSantis.",
    "Ron DeSantis.",
    "Gov."
  ]
}