{
  "id": 2157,
  "mediaId": 65,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Georgia GOP gubernatorial clash: Gov. Kemp and Trump-backed challenger Perdue to face off at debates",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/7a799c4c-43cf-4b8f-95ad-c89730e316c4/ce1f1f63-7925-4520-97ae-61512ae1a194/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-gop-gubernatorial-clash-gov-kemp-trump-backed-challenger-perdue-debates",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1664,
    2087,
    2095,
    3082,
    146,
    226,
    428,
    2624,
    2672
  ],
  "sentences": [
    "WHAT THE LATEST FOX NEWS POLL SHOWS IN GEORGIA'S GOP CLASH FOR GOVERNOR\nPerdue, with the backing of former President Donald Trump, is primary challenging Kemp, but trails the incumbent governor in two key campaign metrics  public opinion polling and fundraising  with just under seven weeks to go until Georgia's May 24 primary.",
    "Brian Kemp of Georgia and his top GOP challenger, former Sen. David Perdue, will debate three times ahead of next month's primary in their high-profile and combustible intra-party face off, their campaigns announced on Wednesday.",
    "PERDUE SAYS TRUMP WILL DO WHATEVER IT TAKES' TO HELP HIM BEAT KEMP\nTrump for months urged Perdue to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "But Kemp earned Trump's ire starting in late 2020, after the governor certified President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "Perdue trailed Kemp in recent public opinion surveys, including a Fox News poll conducted March 2-6 that indicated Kemp led Perdue by 11 points among Republicans likely to vote in the primary.",
    "The debates are an April 24th showdown hosted by WSB-TV, an April 28th debate hosted by WTOC/Gray TV, and a May 1 face off hosted by the Atlanta Press Club and Georgia Public Broadcasting.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "CLICK HERE TO GET THE FOX NEWS APP\nAsked if the former president will return to Georgia ahead of the primary, Perdue said he and Trump are \"going to do some tele-rallies.",
    "Perdue declared his candidacy a few days after Abrams, a voting rights champion and rising star in the Democratic Party, launched her second straight bid for governor.",
    "Perdue added that ahead of the former president's rally, \"only about half of Republicans in the state understood that I had Trump's endorsement.",
    "Perdue in recent weeks has publicly said that he would debate Kemp, but until now had not committed to any specific debate.",
    "The former senator told Fox News in an interview on Tuesday that he \"absolutely\" got a political bump out of the rally.",
    "But all the surveys were conducted before Perdue teamed up with Trump at a rally in Commerce, Georgia, on March 26.",
    "Four years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "But the third debate is expected to also include two lesser known candidates  Catherine Davis and Kandiss Taylor.",
    "But a survey conducted following the rally and released on Wednesday indicated Kemp maintaining his lead.",
    "Perdue told Fox News that Trump is \"going to do whatever it takes to win this thing.\"",
    "Kemp and Perdue will be the only candidates on the stage at the first two debates.",
    "HE'S GOT TRUMP'S ENDORSEMENT, SO WHY IS DAVID PERDUE STRUGGLING AGAINST GOV.",
    "He wanted to make sure he laid that down with no misunderstanding.",
    "Kemp agreed six weeks ago to four proposed debates.",
    "It could very well be that he comes back.",
    " If he needs to, he'll be here.\"",
    "ATLANTA - Republican Gov.",
    "So that was huge thing.\"",
    "BRIAN KEMP?"
  ]
}