{
  "id": 2161,
  "mediaId": 195,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Kemp, Raffensperger lead Trump-backed challengers in Georgia: poll",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/kempbrian_perduedavid_split_getty-ap_georgia-campaign.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3260567-georgia-incumbents-kemp-raffensperger-lead-trump-backed-challengers-poll/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1320,
    1646,
    1664,
    2087,
    2095,
    2203,
    3082,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Perdue is in a strong position to win this primary and become Georgia's next governor.?\nThe poll, conducted April 1-3, comes less than a week after Trump visited Georgia to remind voters of his support for Perdue, who has embraced Trump's fables about the 2020 election he lost to President Biden.",
    "Trump's attacks have taken at least some toll on the governor: The poll shows 36 percent of those who plan to vote in the Republican primary disapprove of the job Kemp is doing, a higher disapproval rating among voters of his own party than is typical in a gubernatorial contest.",
    "But in a potential sign that Trump is losing his vaunted grip on the GOP base, just over a third of Republican voters, 37 percent, said Trump's endorsement of Perdue would make them more likely to support the former senator.",
    "Brian Kemp (R) maintains a lead over former Sen. David Perdue (R) in a bitter Republican primary that will test former President Donald Trump's hold over the Republican Party in a state he lost in 2020.",
    "A new poll conducted for The Hill by Emerson College finds Kemp leading a field of five candidates for the Republican nomination for governor with 43 percent of the vote, ahead of 32 percent for Perdue.",
    "After a Perdue rally and $3 million spent by him and his allies since February throwing mud at Brian Kemp, the governor still holds a double-digit lead,? said Cody Hall, Kemp's campaign spokesman.",
    "In an infamous phone call now under investigation by a grand jury in Fulton County, home of Atlanta, Trump urged Raffensperger to find? the votes he would need to carry Georgia's electoral votes.",
    "Catherine Davis (R), a frequent candidate for office, takes 5 percent of the vote; Kandiss Taylor (R), a teacher who ran for a U.S. Senate seat in 2020, would claim 2 percent.",
    "An incumbent stuck in the low 40s both on the full ballot and in a head-to-head matchup is the definition of a sinking ship,? said Jenni Sweat, Perdue's campaign spokeswoman.",
    "It is clear Georgians aren't buying what David Perdue is selling.?\nKemp's approval rating stands at just 42 percent among all Georgia voters, and the same share disapprove.",
    "The Emerson College poll conducted for The Hill surveyed 1,013 registered voters between April 1-3, for an overall margin of error of plus or minus 3 percentage points.",
    "Thirty percent said Trump's backing would make them less likely to support Perdue, and 32 percent said Trump's involvement would make no difference in their vote.",
    "The survey includes a subsample of 509 likely Republican primary voters for a margin of error of plus or minus 4.3 percentage points.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trump was incensed that Kemp and other Georgia officials would not and could not overturn Biden's victory in Georgia.",
    "The poll shows Raffensperger leading the Republican field as he seeks a second term with 29 percent of the vote.",
    "Trump has also targeted Secretary of State Brad Raffensperger (R), who oversees Georgia's election results.",
    "If no candidate wins a majority of the vote, the two top finishers would advance to a runoff election.",
    "Rep. Jody Hice (R), an election denialist who has Trump's support, finishes second with 26 percent.",
    "Kemp realizes he's in trouble with conservatives and is spending millions attacking Perdue.",
    "Those attacks aren't working, and Perdue's numbers will rise when he goes back on TV.",
    "But more than a third of potential Republican voters remain undecided, 37 percent.",
    "If you're undecided at this point, you're likely not going back to the incumbent.",
    "In that runoff, Kemp bests Perdue 44 percent to 39 percent, the poll found.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "These numbers once again show Kemp is in serious trouble.",
    "Georgia Gov."
  ]
}