{
  "id": 2162,
  "mediaId": 237,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Poll: Stacey Abrams on pace to be reelected as the not-governor of Georgia",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/6887ef2/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F3c%2F67%2F1c5422534fb1a144077273a3af60%2Fap-19093685589258.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/poll-stacey-abrams-is-on-pace-to-be-re-elected-as-the-not-governor-of-georgia",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Freddoso",
  "authorUrl": "",
  "termIds": [
    1147,
    1158,
    1951,
    2095,
    295,
    2672
  ],
  "sentences": [
    "She called for a boycott of her own state in a USA Today op-ed (this was later deleted by sympathetic editors) and persuaded Major League Baseball to withdraw the All-Star Game from Atlanta, costing hundreds of black-owned small businesses a boost they had been praying for during COVID.",
    "Abrams approached Election Day 2018 anticipating a loss, which is why she spread multiple false conspiracy theories in advance of election night about how her supporters in Georgia were being prevented from electing her governor.",
    "Instead of starting an election denialists' club with fellow conspiracy theorists Hillary Clinton and Donald Trump, Abrams took up an activist role that has made her very wealthy in the last four years.",
    "She continued to spread these same false conspiracy theories throughout the ensuing recount period, and liberal journalists continued parroting them even as the local media debunked many of them.",
    "Just In...\nStacey Abrams, who became famous for denying the outcome of an election she lost by more than 50,000 votes in 2018, is now on pace to lose once again, according to a new poll.",
    "In the time since, she has claimed at least a dozen times that she was the rightful winner, although she has claimed never to have done so.",
    "Against former Sen. David Perdue, who is challenging Kemp in the May 24 Republican primary, Abrams trails 44% to 49%.",
    "Having attained national stature and fame as the not-governor of Georgia, Abrams is now running for reelection.",
    "Abrams finally lost the election to the current incumbent, Brian Kemp, but specifically refused to concede.",
    "Emerson College's latest poll shows her losing again to Kemp by a much wider margin this time  44% to 51%.",
    "So, for now, it looks like Abrams is a safe incumbent, coasting to reelection as not-governor."
  ]
}