{
  "id": 2167,
  "mediaId": 19,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Georgia Poll: Possible Runoff Could Be Warning Sign for Kemp in Governor's Primary",
  "image": "https://media.breitbart.com/media/2021/12/GettyImages-1230441568-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/06/georgia-poll-possible-runoff-warning-sign-kemp-governors-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1320,
    1646,
    1951,
    2095,
    428,
    2661,
    2672
  ],
  "sentences": [
    "Kemp realizes he's in trouble with conservatives and is spending millions attacking Perdue.? She added, Perdue is in a strong position to win this primary and become Georgia's next Governor.?\nPerdue, a wealthy businessman and former one-term senator, received former President Donald Trump's backing as soon as Perdue announced he was challenging Kemp in December, and the former president's endorsement has become a central feature of Perdue's campaign.",
    "While those topline results of the poll are consistent with the last couple months of polls showing Kemp with a firm lead over Perdue, the incumbent governor's low-40s score indicates a runoff could follow the primary since the primary winner needs to achieve 50 percent of the vote for an outright victory.",
    "Perdue campaign spokeswoman Jenni Sweat said in a statement provided to Breitbart News that the poll findings meant Kemp was in serious trouble.?\nAn incumbent stuck in the low 40s both on the full ballot and in a head-to-head matchup is the definition of a sinking ship,? Sweat said.",
    "It is past time for David Perdue to realize he is the only thing standing in the way of Georgia Republicans achieving that goal.?\nThe two candidates are set to face off in their first debate, hosted by WSB-TV, on April 24, and the primary takes place on May 24.",
    "The poll, conducted by Emerson College Polling and the Hill from April 1 to 3, found Kemp held an 11-point lead over Perdue on a full primary ballot, with Kemp receiving 43 percent support compared to Perdue's 32 percent support.",
    "After a Perdue rally and $3 million spent by the former senator and his allies since February throwing mud at Brian Kemp, the Governor still holds a double-digit lead,? campaign spokesman Cody Hall said in a statement.",
    "It is clear Georgians aren't buying what David Perdue is selling.?\nThe poll also showed that in hypothetical general election matchups against the presumed Democrat candidate, Stacey Abrams, Kemp outperformed Perdue.",
    "Brian Kemp continues to lead former Sen. David Perdue in the Georgia Republican gubernatorial primary race, but if a runoff were to occur, the race would become much tighter, according to a poll released Wednesday.",
    "Trump has fundraised and rallied for Perdue as well as endorsed candidates who align with Trump's anti-Kemp campaign, which Trump has pursued because of his grievances with Georgia's 2020 election process.",
    "In a hypothetical runoff between Kemp and Perdue, the race becomes significantly closer, with Kemp receiving 44 percent compared to Perdue's 39 percent, while 16 percent of respondents are undecided.",
    "The poll found, however, that a majority of respondents, 58 percent, who were undecided on a gubernatorial candidate felt Trump's endorsement of Perdue had no impact on their voting decision.",
    "The Kemp campaign found reason to celebrate the poll, noting Perdue's rallying and spending had not helped the former senator close the polling gap between him and Kemp at this stage.",
    "Out of the 509 likely Republican primary voters polled, 17 percent of them said they were undecided, while three other primary candidates received single-digit support.",
    "Another 23 percent of undecideds said Trump's endorsement made them less likely to vote for Perdue, while 19 percent said it made them more likely to vote for Perdue.",
    "Perdue launched his first television ad of the cycle showing Trump speaking directly to voters and has heavily touted Trump's support along the campaign trail.",
    "The Republican primary polling questions were conducted among 509 likely Republican primary voters and had a margin of error of plus or minus 4.3 percent.",
    "The Emerson/Hill poll was conducted among 1,013 registered Georgia voters and had a margin of error of plus or minus three percent.",
    "Hall added, Every public poll shows Governor Kemp is the only Republican who will beat Stacey Abrams this November.",
    "Perdue led Abrams by five points, 49 percent to 44 percent.",
    "Kemp led Abrams by seven points, 51 percent to 44 percent.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver.",
    "Gov."
  ]
}