{
  "id": 2168,
  "mediaId": 195,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Georgia lawmakers pass bill empowering election force to investigate voter fraud",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2021/11/georgiaelectionvoter_110221_ap.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/3259631-georgia-lawmakers-pass-bill-empowering-election-force-to-investigate-voter-fraud/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    1646,
    2095,
    2203,
    4325,
    215,
    571,
    2661,
    2672
  ],
  "sentences": [
    "Dennis said, If the Bureau is now entrusted with investigating anything that could create doubt about our elections  we suggest they start, first, by investigating those who have been profiting by creating such doubt.?\nSo many different groups and partisan extremists have been working to undermine confidence in Georgia's elections,? Dennis said in a statement.",
    "Following the 2020 election, which former President Trump has claimed was rigged, Trump and his allies have gone on the offensive against Georgia Secretary of State Brad Raffensperger over his refusal to overturn state election results.",
    "Georgia Republicans passed a bill Monday that empowers state authorities to investigate election crimes and voter fraud, which critics called the latest GOP effort to undermine faith in elections.",
    "The bill gives the Georgia Bureau of Investigation (GBI) wide latitude to investigate allegations of voter fraud, allowing it to initiate the inquiries and subpoena people independently.",
    "Last year, Georgia passed a controversial election law that limited ballot boxes, creates a voter ID requirement for absentee ballots and gave lawmakers sweeping power over the election.",
    "An amendment giving the GBI authority to investigate any violation of the state's election code was added to the bill shortly before it cleared the Georgia General Assembly.",
    "Common Cause in Georgia, a watchdog group, slammed the bill and noted it funds the GBI with close to $580,000 a year to create an election police? force.",
    "The Criminal Record Responsibility Act passed along party lines, 98-69 in the House and 33-22 in the Senate, according to the state's bill tracker.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "It also removed the secretary of state as chair of the state board, making the secretary a nonvoting member.",
    "Florida's measure, which passed in March, creates a 25-member staff force to investigate election fraud.",
    "Aunna Dennis, the Georgia chapter's executive director, called the measure a waste of taxpayer money.",
    "Georgia follows Florida in creating an election force to respond to GOP voting integrity concerns.",
    "Kemp is facing a primary from former Sen. David Perdue (R-Ga.), who has been endorsed by Trump.",
    "Current law allows the secretary of state to investigate purported election impropriety.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Brian Kemp (R), who signed a strict election law last year.",
    "It now heads to the desk of Gov."
  ]
}