{
  "id": 2178,
  "mediaId": 195,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "The Memo: Trump gambles on Sarah Palin",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/trumpdonald_palinsarah_040422_split_GN_ap-Seth-Wenig_memo.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/administration/3258897-the-memo-trump-gambles-on-sarah-palin/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage/",
  "termIds": [
    1047,
    1059,
    1147,
    1549,
    2095,
    2470,
    2538,
    2661
  ],
  "sentences": [
    "Stil, Trump appeared to be all-in when he made his Sunday night endorsement, describing Palin as a wonderful patriot? and a true America First fighter.?\nIn characteristic Trump style, he also took aim at unnamed enemies from that long-ago McCain campaign, whom he described as very evil, stupid and jealous people.?\nTrump also noted that Palin had endorsed him during his 2016 presidential campaign.",
    "That's not to say he's not dangerous  especially in a Republican primary  but he's diminished.?\nThe former congressman said that Trump's interventions tended to be more powerful when they were negative  lambasting a candidate for supposed disloyalty, for example  than when they took the positive shape of an endorsement.",
    "He doesn't think the facts through.?\nDel Percio also argued that a Trump endorsement, though valuable in some Republican primaries, could come back to haunt candidates in general elections in competitive states or districts.",
    "And Trump last month rescinded his endorsement of Rep. Mo Brooks (R-Ala.) in Alabama's Senate primary  which in turn prompted Brooks to speak out about Trump's calls to overturn the 2020 election.",
    "Palin's star has dimmed since she fired up the conservative grassroots and rocketed to fame in 2008 as the running mate of the GOP presidential nominee, the late Sen. John McCain (Ariz.).",
    "One of the important factors in securing a Trump endorsement has been, and should always be, loyalty,? Corey Lewandowski, Trump's former campaign manager, told this column.",
    "There is, however, a degree of disquiet even within Trump's circle at the sheer number of endorsements he has made and the sometimes haphazard decision-making around them.",
    "The truth is that the Number One determining factor for electoral success for a candidate in a Republican primary is Donald Trump's endorsement,? Lewandowski insisted.",
    "Trump's 2022 got off to a strong start in Texas' primaries, with his 33 endorsed candidates all winning or going into runoff races in strong positions,? CBS noted.",
    "Like most things the former president does, it is poorly thought out and it is completely reactionary,? said Susan Del Percio, referring to the Palin endorsement.",
    "They also note that his electoral batting average is strong, suggesting that his critics disproportionately focus on a handful of endorsees who have floundered.",
    "On the other hand, the indifferent performance of some Trump-endorsed candidates has fueled doubts about the former president's political judgement and power.",
    "Trump's pick in Pennsylvania's Senate primary, Sean Parnell, suspended his campaign late last year amid a messy custody battle with his estranged wife.",
    "Trump's endorsement is sought by lots of Republican primary candidates, many of whom have journeyed to his Mar-a-Lago estate in Florida to pay homage.",
    "But given Trump's high-profile backing, Palin's performance will be seen as a proxy for the former president's influence within the GOP.",
    "There is no question in my mind some are going to lose,? said one GOP strategist who is broadly supportive of the former president.",
    "Similar questions have swirled around Rep. Ted Budd (R-N.C.), whom Trump endorsed in a Senate primary in the Tar Heel State.",
    "For a start, they ask why so many candidates so zealously compete for Trump's stamp of approval if it doesn't mean much.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The bigger issue is if he comes out against you.?\nPro-Trump figures within the party dispute that assessment, however.",
    "Trump is sensitive to any suggestion that he is backing the wrong horses, or that his endorsement is less than vital.",
    "Now, Palin is one of more than 50 candidates seeking to replace the late Rep. Don Young (R-Alaska) in Congress.",
    "She likened the former president's backing to an anchor around the neck of any candidate? in that scenario.",
    "Former President Trump is taking a fresh gamble with his political capital by endorsing former Alaska Gov.",
    "Put all the evidence together and Trump's critics say it points to a once-dominant figure losing his mojo.",
    "He has never forgotten that.?\nThe first round in the special election to replace Young happens June 11.",
    "Palin last ran for election under her own steam in 2006, when she first won the Alaska governorship.",
    "A recent CBS News report noted that Trump has endorsed almost 130 candidates in this election cycle.",
    "Young had represented the state for almost half a century by the time of his death last month.",
    "Sarah Palin was with Donald Trump in 2016 when he was fighting for the Republican nomination.",
    "A Fox News poll last month showed Kemp leading by 11 points among Republican primary voters.",
    "Trump critics are far more scathing, both of his endorsements in general and the Palin pick.",
    "The top four candidates, regardless of party affiliation, then head to an Aug. 16 run-off.",
    "One former GOP congressman who is critical of Trump argued that he's a diminished figure.",
    "But there's no sign yet that the stream of candidates seeking his approval is drying up.",
    "Keeping up the appearance of dominance over his party is critical to that quest.",
    "Donald Trump has endorsed an enormous amount of candidates  probably too many.",
    "The last point may have been the most important of all in winning his backing.",
    "The endorsement doesn't mean as much as most people think,? this person said.",
    "His endorsement of former Sen. David Perdue (R-Ga.) against incumbent Gov.",
    "Brian Kemp (R) in Georgia has not marked any sea-change in the race.",
    "She resigned abruptly in 2009 and has not held public office since.",
    "Del Percio is a Republican strategist but a staunch Trump critic.",
    "His internal rivals and GOP critics will pounce on any failures.",
    "He has strongly hinted at a third presidential campaign in 2024.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Pat McCrory (R) appears to have the advantage there.",
    "The Memo is a reported column by Niall Stanage.",
    "It's not an entirely hollow argument.",
    "Sarah Palin (R).",
    "Former Gov."
  ]
}