{
  "id": 2179,
  "mediaId": 1576,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "5 takeaways from Georgia's 2022 legislative session",
  "image": "https://www.wabe.org/app/uploads/2022/04/FPjZMsiXoAIg9Fv-336x189.jpg",
  "link": "https://www.wabe.org/5-takeaways-from-georgias-2022-legislative-session/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1178,
    2095,
    215,
    220,
    428,
    2672
  ],
  "sentences": [
    "Number one, stop passing legislation predicated on the big lie,'? referring to false claims about widespread election fraud in 2020. And number two, stop running campaigns predicated on the big lie.'?\nAnd now, as this legislative session comes to a close, that debate will bleed back onto the campaign trail.",
    "And while Republicans highlight Georgia's booming economy, Democrats are quick to point out that some of that budget surplus was made possible by pandemic relief dollars that flowed into state and local governments, the most recent round of which passed without Republican support in Congress.",
    "Perhaps the greatest testament to the need for HB 1013, its importance, and its transformational power is the fact that in a time of great political division, this legislation passed with full bipartisan support,? Kemp said before signing the bill in front of a huge crowd at the capitol.",
    "They included bills restricting how teachers talk about race in classrooms, making it easier for parents to lodge complaints about certain books in school libraries and efforts to restrict transgender kids from school sports.",
    "Bipartisanship isn't (totally) dead\nThe Georgia General Assembly considered plenty of bills that passed solely along party lines this session, but one of the hallmark pieces of legislation passed both chambers unanimously.",
    "Both these debates highlight growing tensions in a state that's changing politically and demographically  and spurred fights about who should be making decisions on school boards, county commissions and in the statehouse.",
    "Republicans unified behind legislation restricting how teachers talk about race in classrooms, allowing parents to opt their kids out of school mask mandates and allowing Georgians to carry handguns without a permit.",
    "Rep. Bee Nguyen, a Democrat running for Secretary of State, said the measure wouldn't restore faith in elections  and no bill will ever satisfy those who believe false claims about election integrity.",
    "House Speaker David Ralston supported giving the Georgia Bureau of Investigation subpoena power and the ability to initiate election cases without a referral from the Secretary of State's office.",
    "Republican lawmakers pushed farther to the right ahead of primary elections and debates in committee and on the floor sharpened divides over race, schools, redistricting and public safety.",
    "Debates about election integrity aren't going away\nRepublican legislators set out this session to make more changes to Georgia election law, following a sweeping overhaul passed in 2021.",
    "The original bill also added strict new requirements for documenting how ballots are handled and restricting election offices from accepting non-profit funding, among other changes.",
    "The centerpiece is enforcing parity  the standard that insurance companies have to treat mental health and substance abuse treatment the same as any other kind of medical care.",
    "And while the legislature literally passed hundreds of laws that will affect everyday life for Georgians, this session will also set the tone for the rest of the 2022 campaign.",
    "Georgia Republicans are still in the driver's seat\nAt the start of this session, Kemp outlined a lengthy list of conservative priorities in his State of the State address.",
    "Candidates for statewide office still need to win in a general election, at a time when Democratic candidates may be more competitive than they have been in decades.",
    "The politics around schools and redistricting highlighted growing frictions\nDebates over race, identity and representation spilled into the legislature this session.",
    "The state temporarily suspended its gas tax, will dole out tax rebates for Georgians and muscled through an income tax cut that will begin a few years down the road.",
    "Fights over local redistricting also got heated  with Republicans scrapping local redistricting maps for several of the state's most rapidly diversifying counties.",
    "Either way, these budget measures will give Republicans something tangible to take to voters this year as costs soar and pocketbook issues are front and center.",
    "The bill about trans sports now invites the sports associations, if they wish, to make a policy restricting trans girls from sports rather than an outright ban.",
    "Even a bill designed to restrict trans kids from playing school sports, which appeared dead until almost midnight on Monday, slid through both chambers.",
    "The only way that we can do away with it is putting absolutely irrefutable truth in how the election is being run,? said Rep. Alan Powell, a Republican.",
    "And a 40-page bill making more changes to the election law was tossed following testimony by election officials who criticized many of the measures.",
    "Democrats can claim a win with the bipartisan mental health reform and for doing their best to stop or shape bills they opposed wherever possible.",
    "Lawmakers removed higher education from the bills about how race is taught in schools and weakened the punishments for schools that don't comply.",
    "House Speaker David Ralston shouted sine die? as lawmakers shredded their bill text into confetti and cheered the end of the legislative session.",
    "And with lots of study and elbow grease on both sides of the aisle, the legislature passed a massive overhaul of mental health care in Georgia.",
    "Lawmakers tacked it into another bill on the final day of the session and it passed both chambers in the last few hours of sine die.",
    "Georgia's mental health system is so bad, ranked among the worst in the nation, that it became impossible for lawmakers to ignore.",
    "Many incumbents, including Kemp, are gearing up for primary challengers from the right backed by former President Donald Trump.",
    "The new budget includes raises for teachers and state employees, as many state agencies face extremely high staff turnover.",
    "Democrats, voting rights activists and even election officials organized pushback to additional election law changes.",
    "The state's coffers are flush with cash\nThe state has a record surplus  and the GOP leadership is putting it to use.",
    "Democrats accused Republicans of trying to dilute the voting power of minorities as they ascend to elected office.",
    "Still, Republicans can tout these bills on the campaign trail, even if they're watered down versions.",
    "Brian Kemp and his party have passed many of the priorities they set out to accomplish this year.",
    "These Republican wins also underscore the legislature's further push to the right this session.",
    "Republicans in Georgia wield immense power in state government, but even that has its limits.",
    "Here are five takeaways from this session of the Georgia General Assembly:\n1.",
    "Republicans shoved it into the bill restricting how teachers talk about race.",
    "In the end, only one of the proposed provisions was slid into another bill.",
    "That's made incumbents eager to shore up their conservative bonafides.",
    "That's been federal law for decades but never enforced in Georgia.",
    "It's already a key issue animating the primary for governor.",
    "And in about three months, he's gotten almost all of them.",
    "In the end, only the GBI provision will make it into law.",
    "The assembly passed a slew of legislation about schools.",
    "But these bills did not pass without adjustments.",
    "Republicans insisted their maps were more fair.",
    "I have a couple of ideas on how we can do that.",
    "Trending\nTop Stories",
    "Republican Gov.",
    "5.",
    "4.",
    "3.",
    "2."
  ]
}