{
  "id": 2186,
  "mediaId": 43,
  "date": "4/4/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/4",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/4/2089516/-Daily-Kos-Elections-Live-Digest-4-4",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2129,
    2129,
    2277,
    2277,
    2203,
    2203,
    1852,
    1852,
    1925,
    1925,
    967,
    811,
    811,
    1532,
    1532,
    1380,
    1380,
    1147,
    1147,
    1021,
    1021,
    967,
    327,
    327,
    80,
    80,
    428,
    428,
    2643,
    2643,
    2791,
    2791,
    2793,
    2793
  ],
  "sentences": [
    "Lamborn continued by saying he'd witnessed a shocking lack of transparency and basic competence in the handling of the delegate and alternate list for the 5th CD Assembly,? and that [p]articipants can't have confidence in the process if there is concern that the list has been tampered with.?\nColorado Politics' Ernest Luning writes that [n]umerous Republican candidates? have also leveled similar complaints against Tonkins by saying she and her allies, including Williams, have been hoarding lists of Republicans who attended precinct caucuses and party assemblies.? Navy veteran Rebecca Keltie, who like Lamborn collected enough signatures to qualify the primary ballot without going through the convention, told her supporters she'd also decided not to attend the assembly after it degraded into an absolute circus by those who disregard the rules.?\nBusiness owner Andrew Heaton, who is still waiting to learn if he submitted enough petitions before last month's deadline, also complained to Luning, Although we respect the assembly process, my campaign has requested the most recent delegate list three times, yet never received a list.?\nBut it was Lamborn's message that brought a furious response from Tonkins, who denied she favored any candidate while also making it clear how little she likes the incumbent.",
    "She further used the Big Lie to attack Lamborn, saying, The El Paso County Republican Party will not be lectured about election integrity by Doug Lamborn, especially when he supported the continued use of Dominion Voting Systems counting Republican primary ballots by forcing our Party to stay in a rigged open primary system controlled by Democrats.?\nA spokesperson for the state GOP responded to Tonkins' missive by saying, Even if a candidate criticizes the county party, the county party chairman has an obligation to run the operation he or she is entrusted with in a way that every candidate and voter can trust.?\n Monday, Apr 4, 2022  12:23:56 PM Pacific Daylight Time  Jeff Singer\nIN-01: Former LaPorte Mayor Blair Milo, who is the favorite to win the May 3 GOP nod to take on Democratic Rep. Frank Mrvan, uses her first TV ad to portray herself as a conservative Navy veteran who is running because Biden and Pelosi threaten all we hold dear.?\nThis is a short blurb about Daily Kos.",
    "When a politician breaks their word to voters in this way, the Party would normally stay silent and let the campaigns,? she emailed local Republicans, continuing, However, as the Party Chairwoman, I will not let any person besmirch our Party's good name nor attack the tireless volunteers who have served so honorably to ensure our efforts are successful in November.?\nThe chair also reminded her readers that the congressman is under investigation by the nonpartisan Office of Congressional Ethics for allegedly misusing official resources by having congressional staff perform personal and campaign-related tasks for him and his wife.",
    "Monday, Apr 4, 2022  10:47:27 AM Pacific Daylight Time  Jeff Singer\nSpecial Elections: We have a total of eight special legislative elections on Tuesday in California, Pennsylvania, and Georgia, but only the all-party primary for Georgia's 45th House District is being held on competitive turf:\nGA HD-45: Three Republicans and one Democrat are running to succeed Matt Dollar, a Republican who resigned in February to take a post at the state's Technical College System, in a longtime conservative stronghold that moved hard to the left during the Trump era.",
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nMonday, Apr 4, 2022  10:19:22 AM Pacific Daylight Time  Jeff Singer\nCA-22 (special): Tuesday's all-party primary for the existing version of California's 22nd Congressional Districting may end up answering one of the biggest questions in American politics: Will former Rep. Devin Nunes still have his job at Trump's social media company by the time his successor takes office?",
    "Since 2010, Mo Brooks has been one of the most conservative guys in Washington,? says the narrator, Weak, big spending, open border Republicans, Mo's fought them all.?\nThe closest the ad comes to alluding to Trump dumping Brooks is the line, But there's a cost of being a true conservative, and the swamp hates Mo Brooks.? The congressman, of course, still doesn't dare criticize Trump, and the spot instead him as an enemy of Senate Minority Leader Mitch McConnell.",
    "Monday, Apr 4, 2022  11:04:34 AM Pacific Daylight Time  Jeff Singer\nNV-Sen: Army veteran Sam Brown, who is the underdog in the Republican Senate primary, emphasizes his biography in his newest commercial, including how a Taliban bomb nearly killed me.? Brown, whose face remains scarred, continues, After 30 surgeries, years of recovery, turns out I'm hard to kill.? The campaign says the spot is running as part of a six-figure buy.",
    "None of the three Republicans, by contrast, are running for a full term: Team Red's lineup consists of former state Rep. Mitch Kaye, who left office in 2002 to wage an unsuccessful campaign for state superintendent; party activist Pamela Alayon; and Darryl Wilson, another conservative activist who was the 2006 Democratic nominee against Dollar: If no one wins a majority of the vote, a runoff would take place on May 3.",
    "Fully funding our schools, fighting for a tax cut for every Kansan.?\nMonday, Apr 4, 2022  11:31:17 AM Pacific Daylight Time  Jeff Singer\nMD-Gov, MD-AG: The Maryland State Education Association, which is the state's largest teachers union, has backed former nonprofit head Wes Moore in the July Democratic primary for governor and Rep. Anthony Brown for attorney general.",
    "Monday, Apr 4, 2022  12:16:01 PM Pacific Daylight Time  Jeff Singer\nCO-05: State Rep. Dave Williams, who is challenging Rep. Doug Lamborn for renomination, won Saturday's Republican primary convention with the support of 74% of the delegates, which earns him the top spot on the June primary ballot in this safely red Colorado Springs seat.",
    "The ad highlights the horrible condition of the state's economy four years ago, with the narrator describing, A reckless tax experiment left Kansas with huge budget deficits and dangerously underfunded schools.? He then touts how Kelly was elected and brought together Democrats and Republicans to balance the budget.",
    "Monday, Apr 4, 2022  11:23:10 AM Pacific Daylight Time  Jeff Singer\nIL-Gov: The DGA last week began an ad campaign attacking Aurora Mayor Richard Irvin ahead of the June GOP primary, and Irvin is responding with a spot arguing that this shows he's the candidate Democratic incumbent J.B. Pritzker is most afraid of.",
    "Four Republicans and two Democrats will compete on one ballot for a Central Valley seat Trump carried 52-46; if no one earns a majority, the top two vote-getters, regardless of party, would compete in the June 7 general election that would take place the same day as the regular statewide primary.",
    "Lamborn, who unlike Williams decided to collect signatures in order to advance it to the primary (we explain Colorado's ballot access laws here), originally had planned to compete at the convention, which is also known as the party assembly, as well.",
    "Monday, Apr 4, 2022  11:28:31 AM Pacific Daylight Time  Jeff Singer\nKS-Gov: Democratic incumbent Laura Kelly aired her first TV spot Saturday during the University of Kansas's Final Four game, and her team says it's part of a six-figure buy opening.",
    "Monday, Apr 4, 2022  10:28:39 AM Pacific Daylight Time  Jeff Singer\nMilwaukee, WI Mayor: Milwaukee holds its nonpartisan general election Tuesday to succeed longtime Mayor Tom Barrett, who resigned late last year to become ambassador to Luxembourg.",
    "Monday, Apr 4, 2022  11:00:50 AM Pacific Daylight Time  Jeff Singer\nAL-Sen: Rep. Mo Brooks is airing his first new commercial in the nearly two weeks since he lost Donald Trump's Complete and Total? endorsement for the May 24 GOP primary.",
    "Monday, Apr 4, 2022  11:13:51 AM Pacific Daylight Time  Jeff Singer\nWI-Sen: Opportunity Wisconsin says it's spending nearly $1 million on a new TV and digital buy that once again portrays Republican Sen. Ron Johnson as self-serving.",
    "The one Democrat in the running is businessman Dustin McCormick, who also faces no intra-party opposition in the regular May primary to take on Republican state Rep. Sharon Cooper in the new version of HD-45.",
    "Monday, Apr 4, 2022  11:07:08 AM Pacific Daylight Time  Jeff Singer\nUT-Sen: Donald Trump has endorsed Sen. Mike Lee, a former critic who reinvented himself as as a MAGA lackey, in the June Republican primary.",
    "Acting Mayor Cavalier Johnson took first place in the first round in February with 37%, while former Alderman Bob Donovan, who is the rare conservative politician in this blue municipality, earned 27%.",
    "John Carney has signed a bill that lawmakers recently passed making minor adjustments to Delaware's new legislative maps that officials say will improve the efficiency of election administration.",
    "The GOP side also includes Elizabeth Heng, who challenged Democratic Rep. Jim Costa in the 2018 race for the old 16th District and lost 58-42; and businessmen Matt Stoll and Michael Maher.",
    "That event, though, was overshadowed by ugly intra-party fighting days before between Lamborn and El Paso County party chair Vickie Tonkins, whose county makes up most of the 5th District.",
    "Biden took this seat, which includes part of Cobb County in the Atlanta suburbs, 50-49 four years after Trump carried it 54-42; however, Dollar himself won his final term 55-45 in 2020.",
    "However, he told delegates last week that he wouldn't take part in the assembly because he'd heard about troubling irregularities? that showed that party officials favored Williams.",
    "Monday, Apr 4, 2022  11:15:10 AM Pacific Daylight Time  Jeff Singer\nGA-Gov: The Atlanta Journal-Constitution reports that the RGA has reserved a total of $5 million to help Gov.",
    "Democrats, meanwhile, are fielding Marine veteran Eric Garcia and Lourin Hubbard, who is an official at the California Department of Water Resources.",
    "Maher, Stoll, and Garcia are challenging Costa for a full term in the new 21st District, while Heng and Hubbard are only competing in this special.",
    "The frontrunner appears to be Republican Connie Conway, a former state Assembly minority leader who is not running for a full term in Congress.",
    "AdImpact says that Irvin has spent a total of $13 million, which is far more than the $7.2 million it had tracked through the previous week.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "Monday, Apr 4, 2022  10:44:32 AM Pacific Daylight Time  David Nir\nDE Redistricting: Democratic Gov.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Brian Kemp fend off former Sen. David Perdue in the May 24 Republican primary.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The winner will be up for a full four-year term in 2024.",
    "It's also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}