{
  "id": 301,
  "mediaId": 63,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Trump Rescinds Support For BrooksLatest Mishap In His Bid To Control Midterms",
  "image": "https://imageio.forbes.com/specials-images/imageserve/623b44688d2094094404a2da/Donald-Trump-Holds-Campaign-Rally-In-Virginia-Beach/0x0.jpg?fit=crop&format=jpg&crop=3000,1688,x0,y151,safe",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/03/23/trump-rescinds-support-for-brooks-latest-mishap-in-his-bid-to-control-midterms/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    2475,
    2475,
    2137,
    2137,
    2095,
    2095,
    2087,
    2087,
    815,
    815,
    800,
    800,
    1646,
    1646,
    1147,
    984,
    984,
    1147,
    2537,
    2537
  ],
  "sentences": [
    "Brooks released a statement after the move claiming Trump had asked him to rescind the 2020 elections, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency.?\n\"Very sad but, since he decided to go in another direction, so have I, and I am hereby withdrawing my Endorsement of Mo Brooks for the Senate,\" Trump said.",
    "Polls still show his chosen candidate in the Georgia Senate race, former football star Herschel Walker, neck and neck with Sen. Raphael Warnock (D-Ga.), but Walker's campaign has been plagued by a series of bizarre gaffes, like Walker falsely claiming he graduated from the University of Georgia and publicly questioning evolution at an event last week.",
    "Trump has a strong record of endorsing successful candidates in the past, and he remains a heavy favorite to win the GOP nomination if he runs for president in 2024, but his insistence that bogus 2020 election fraud claims should be the biggest issue in the 2022 midterms appears increasingly out of touch with voters.",
    "In Texas, it's not clear legally embattled, Trump-backed Attorney General Ken Paxton (R) will even win the GOP nomination in his reelection effortPaxton gathered just 42.7% of the vote in the first round of the GOP primary and now faces Texas Land Commissioner George P. Bush in a runoff.",
    "Trump in a statement early Wednesday morning attributed Brooks' plunging poll numbersdown from more than 50% in some surveys last year to now under 20%to his decision to go \"woke\" and focus his campaign on issues other than Trump's false claims of fraud in the 2020 presidential election.",
    "Topline\nFormer President Donald Trump rescinded his endorsement Wednesday for one of his staunchest supporters in Congress, Rep. Mo Brooks (R-Ala.), who's fallen behind in the primary race for Alabama's open Senate seat, marking the latest sign his grip on the GOP might be slipping.",
    "Trump has also split from GOP leadership and conservative voters with his recent comments on Russia's invasion of Ukraine, calling Russian President Vladimir Putin \"very savvy\" and saying his move to recognize two pro-Kremlin breakaway states in eastern Ukraine was \"genius.\"",
    "Some top GOP figures like Senate Minority Leader Mitch McConnell (R-Ky.) have also been vocal about not rehashing false election claims in the midterms, arguing that doing so will only serve to hurt Republicans in what's expected to be a strong election for the party.",
    "A majority of Republican respondents in a Politico/Morning Consult poll last month said they believe it's time for the GOP to move past Trump's fraud claims, while only 37% said it should be a continued focus.",
    "Trump endorsed Republican Sean Parnell in the high-profile Pennsylvania Senate race, but Parnell dropped out in November after losing custody of his three children following abuse claims from his ex-wife.",
    "Many other prominent Trump-backed candidates who are parroting the fraud claims are also struggling, like former Sen. David Perdue (R-Ga.), who's trailing incumbent Gov.",
    "A Wall Street Journal survey earlier this month found 77% of GOP respondents supported a ban on Russian oil imports even though it would increase gas prices.",
    "Trump-backed candidates appear to be struggling in several other races, like the North Carolina Senate contest and gubernatorial races in Idaho and Kansas.",
    "Brian Kemp (R-Ga.) in the polls despite the ex-president launching a barrage of attacks against the governor.",
    "Cheney was stripped of her GOP leadership role after voting to impeach Trump over the January 6 Capitol riot.",
    "But polling shows a vast majority of Republicans support aiding Ukraine in the war and sanctioning Russia.",
    "Polling suggests Trump-endorsed Republican Harriet Hageman leads Rep. Liz Cheney (R-Wyo.)",
    "\"I don't think the great people of Alabama will disagree with me.\"",
    "in Wyoming's at-large House race."
  ]
}