{
  "id": 3142,
  "mediaId": 238,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Post Politics Now Bucking Trump, Pence to rally with Georgia Gov. Kemp this month",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/13/trump-pence-kemp-georgia-biden/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mariana Alfaro",
  "authorUrl": "https://www.washingtonpost.com/people/mariana-alfaro/",
  "termIds": [
    2095,
    2087,
    1434,
    1253,
    1147,
    3005,
    3014,
    3022,
    2672
  ],
  "sentences": [
    "And, per a White House fact sheet, Biden plans to renew his call for communities to invest more American Rescue Plan funding in strategies to make our communities safer and to deploy as many dollars as possible before the summer months, when many communities historically experience a seasonal increase in violent crime.?\nAs with most events in election years, this one also has political overtones.",
    "While he said he sympathizes with the Ukrainian people, Paul added that the United States cannot continue to spend money we don't have? because doing so is threatening our own national security.?\nThe bill  which would send $39.8 billion in economic, humanitarian and defense aid to Ukraine  passed in the House of Representatives this week with broad support.",
    "In an interview on Fox News Channel, Biggs argued without evidence that the committee doesn't really have the authority to issue subpoenas? and that he doesn't want to dignify what they are doing.?\nBrooks issued a lengthy statement in which he derided the panel as the Witch Hunt Committee? and repeated Trump's false claim that the 2020 election was stolen.",
    "In a statement, Pence called Kemp one of the most successful conservative governors in America.?\nWe're also watching fallout from the decision by the House committee investigating the Jan. 6, 2021 attack on the Capitol to subpoena five House Republican lawmakers, including House Minority Leader Kevin McCarthy (R-Calif.).",
    "In a brief interview with reporters, House Minority Leader Kevin McCarthy (R-Calif.) declined to say whether he would comply with his subpoena while reiterating his criticism of the committee, report The Post's Felicia Sonmez, Jacqueline Alemany, Leigh Ann Caldwell and Marianna Sotomayor.",
    "Return to menu\nWhile Democrats are hopeful a looming Supreme Court ruling on abortion will scramble the politics of the midterm elections, Rep. Tom Emmer (R-Minn.), who chairs the National Republican Congressional Committee, says he's convinced it won't be a major issue in November.",
    "The Post's Caroline Kitchener reports that the Louisiana House voted to remove some of the most contentious provisions of a controversial measure that would have classified abortion as homicide and allowed prosecutors to criminally charge women who undergo the medical procedure.",
    "It seems as though they just want to go after their political opponents.?\nReps. Mo Brooks (Ala.), Andy Biggs (Ariz.), Scott Perry (Pa.) and Jim Jordan (Ohio) also declined to say whether they would comply and said they hadn't yet seen the subpoenas as of Thursday afternoon.",
    "Return to menu\nSen. Rand Paul (R-Ky.) is standing by his move to delay a Senate vote on assistance for Ukraine despite a backlash to his single-handed holdup of legislation that lawmakers in both parties were pressing to get to President Biden's desk by the end of the week.",
    "Caroline writes:\nThe measure attracted national attention when it passed out of committee last Wednesday with a 7-to-2 vote, less than 48 hours after the leak of a draft opinion that showed the Supreme Court is potentially poised to overturn Roe v. Wade.",
    "The move puts Pence at odds with former president Donald Trump, who pushed David Perdue, a former U.S. senator, to challenge Kemp, whom Trump has lambasted for not doing enough to overturn the 2020 presidential elections results in Georgia.",
    "Return to menu\nHow likely is it that House Minority Leader Kevin McCarthy (R-Calif.) will comply with the subpoena he received from the committee investigating the Jan. 6, 2021, insurrection led by supporters of President Donald Trump?",
    "Writing in The Trailer, The Post's David Weigel assesses the phenomenon, in which candidates for Congress in the mold of Sen. Bernie Sanders (I-Vt.) have seen sizable PAC money flowing to more moderate Democratic opponents.",
    "But the Biden administration is trying to show that it hasn't lost sight of its key 21st century strategic competitor.? And it recognizes that its contest with China requires closer partnerships well outside Europe.",
    "Aaron notes that the closest comparison to this situation came in the early 1990s, when the Senate Ethics Committee subpoenaed Sen. Bob Packwood (R-Ore.) for his personal diaries amid a sexual harassment inquiry.",
    "Return to menu\nThe five Republican lawmakers subpoenaed by the House committee investigating the Jan. 6, 2021, insurrection have not committed to complying, setting a potential showdown at the end of the month.",
    "Return to menu\nOn Thursday night, the White House hosted a dinner with eight leaders of the Association of Southeast Asian Nations (ASEAN) as a part of a major U.S.-led summit with the regional bloc.",
    "Return to menu\nA tidal wave of political action committee money is transforming Democratic primaries, blindsiding left-wing candidates who went into the cycle targeting a handful of safe seats.",
    "Brian Kemp (R) one of the most successful conservative governors in America? as he announced plans to appear with him at a rally on the eve of Georgia's May 24 contested gubernatorial primary.",
    "According to the White House, Biden will announce that $10 billion in American Rescue Plan funds have been committed to public safety, including at least $6.5 billion in state and local funds.",
    "But in other cases, PACs with no particular focus on Israel have been spending to defeat left-wing candidates, often by portraying centrist candidates as more effective liberal legislators.",
    "Return to menu\nFrom the time of his candidacy, President Biden pushed back strongly on the Defund the Police? movement as it gained some traction among those in the left wing of his party.",
    "Kemp, who has been leading Perdue in polling, has also drawn the support of some of the nation's most prominent GOP governors, who have also demonstrated a willingness to break with Trump.",
    "He built a safer and stronger Georgia by cutting taxes, empowering parents and investing in teachers, funding law enforcement, and standing strong for the right to life,? Pence said.",
    "Those being highlighted have spent funds from the American Rescue Plan  the law passed to stabilize the country amid the pandemic  on policing and other public safety measures.",
    "Their first response has been condemnation, with supporters of their candidates, and sometimes other Democrats in the primary, denouncing the money flowing in to their races.",
    "Jeff Weaver, a former Sanders presidential campaign manager, has described the dynamic as The Empire Strikes Back.?\nIn some cases, the money is coming from pro-Israel PACs.",
    "The Trump presidency and its aftermath have led our politics to yet another apparently unprecedented place: A House committee subpoenaing its own colleagues for testimony.",
    "Paul requested that an inspector general be appointed to oversee the funding but rejected an offer from Senate leaders to hold an amendment vote on his provision.",
    "The decision to rally with Kemp is among the biggest breaks Pence has made with Trump as Pence positions himself for a potential 2024 White House bid of his own.",
    "Next week, Biden will embark on a five-day trip to South Korea and Japan, culminating in another meeting of the Quad? grouping with Australia, Japan and India.",
    "Return to menu\nIn Louisiana, which is among the many GOP-led states rushing to impose abortion restrictions, lawmakers stepped on the brakes Thursday night.",
    "My oath of office is to the U.S. Constitution, not to any foreign nation,? Paul tweeted Thursday night, repeating remarks earlier on the Senate floor.",
    "Trump pushed Perdue to challenge Kemp, whom Trump has lambasted for not doing enough to overturn the 2020 presidential elections results in Georgia.",
    "New battles with the Kremlin have enervated the doyens of the city's foreign policy establishment, many of whom cut their teeth during the Cold War.",
    "On Friday, he'll showcase his desire to invest more in public safety with a White House event featuring local leaders and law enforcement officers.",
    "The move puts Pence at odds with former president Donald Trump, who is backing former U.S. senator David Perdue against Kemp in the GOP primary.",
    "Paul was able to block the package's advancement because the Senate requires unanimous consent to quickly move such a bill to a final vote.",
    "On Friday, the Southeast Asian delegations are slated to continue discussions at the State Department before a plenary session with Biden.",
    "I trust the voters are gonna make up their mind based on the candidates that they're presented with and the primary issues.",
    "It's gonna be the crime wave that the Democrats, frankly, are responsible for with their defund the police? nonsense.",
    "In its fact sheet, the White House notes that every Republican in Congress voted against the American Rescue Plan.",
    "President Biden, meanwhile, has a full day of events in Washington, focused on both foreign and domestic affairs.",
    "Left-wing groups have not been able to match the PAC spending, and in some races, they haven't even tried.",
    "Today, former vice president Mike Pence announced that he will hold a rally with Georgia Gov.",
    "At 3 p.m. weekdays, return to this space and we'll address what's on the mind of readers.",
    "Pence has said Trump is wrong to remain as focused on the 2020 election as he has been.",
    "It's gonna be the instability that this administration has created around the globe.",
    "He ultimately resigned after the committee issued its report and he faced expulsion.",
    "Brian Kemp (R) on the eve of the state's contested May 24 GOP gubernatorial primary.",
    "His schedule includes a meeting with local leaders and law enforcement officials.",
    "Return to menu\nFormer vice president Mike Pence on Friday called Georgia Gov.",
    "Packwood fought the subpoena all the way to the Supreme Court but lost.",
    "Now, the chamber must jump through all the usual procedural hoops.",
    "My view on the committee has not changed,? McCarthy said.",
    "Changing the bill would have forced it back to the House.",
    "They're not conducting a legitimate investigation.",
    "Analysis: Will McCarthy ever testify about Jan. 6?",
    "Do I suspect [abortion] could affect some voters?",
    "It's gonna be inflation, the economy.",
    "Got a question about politics?",
    "It's gonna be the border.",
    "It's gonna be education.",
    "Submit it here.",
    "Sure."
  ]
}