{
  "id": 3144,
  "mediaId": 65,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Pence to campaign on eve of Georgia primary with Gov. Kemp, who's facing a Trump-backed challenge",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/17eb4e34-c81d-419a-b5e5-b54bbb1c4167/4f430501-4101-4c9a-b478-f0b97d05b355/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/pence-campaign-georgia-for-kemp-against-trump-challenger",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2095,
    2087,
    1951,
    1434,
    1646,
    1035,
    1147,
    425,
    2672
  ],
  "sentences": [
    "FIRST ON FOX: KEMP BRINGS IN BIG BUCKS IN GEORGIA'S GOP GUBERNATORIAL CLASH\nThe governor praised Pence, highlighting that \"the Vice President's leadership was instrumental in creating the most prosperous economy in American history, including here in Georgia, and his commitment to building a safer, stronger America represents the highest ideals of our party.\"",
    "FIRST ON FOX: CHRIS CHRISTIE TO JOIN KEMP ON GEORGIA CAMPAIGN TRAIL NEXT WEEK\nPence, a former Indiana governor before serving as vice president under former President Donald Trump, has been crisscrossing the country the past 15 months, helping to support and raise money for fellow Republicans running in the 2021 and 2022 elections.",
    "CLICK HERE TO GET THE FOX NEWS APP\nTrump, who remains the most popular and influential politician in the Republican Party as he continues to play a kingmaker's role in the 2022 GOP primaries, repeatedly teases another White House run in 2024.",
    "Members of the former vice president's political team have been assisting the Kemp reelection team in recent months and top Pence aide and adviser Marc Short came on board a week and a half ago as a senior adviser to the governor's campaign.",
    "But regardless of Trump's endorsement and support, with less than two weeks to go until Georgia's primary, Kemp enjoys large leads over Perdue in two key campaign metrics  public opinion polling and fundraising.",
    "But Kemp earned Trump's ire starting in late 2020, after the governor certified President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "SPLIT DECISION FOR TRUMP IN HIGH-PROFILE PRIMARIES IN NEBRASKA AND WEST VIRGINIA\nThe governor's getting plenty of high-profile company in the closing days of his primary campaign.",
    "\"He built a safer and stronger Georgia by cutting taxes, empowering parents and investing in teachers, funding law enforcement, and standing strong for the right to life.\"",
    "Perdue declared his candidacy a few days after Abrams, an election reform champion and rising star in the Democratic Party, launched her second straight bid for governor.",
    "Former Vice President Mike Pence will join Kemp on the campaign trail on the eve of Georgia's May 24 primary, the Kemp campaign will announce on Friday.",
    "Word of Pence's trip to the Peach State to team up with the governor was shared first on Friday morning with Fox News and two other news organizations.",
    "Kemp, who enjoys the backing of the Republican Governors Association, will be joined in the coming days on the campaign trail by RGA co-chairs Govs.",
    "Christie, who unsuccessfully ran for the 2016 GOP nomination, has also publicly discussed his interest in making another presidential bid in 2024.",
    "Trump for months urged Perdue to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "The former vice president also emphasized that \"Brian Kemp is my friend, a man dedicated to faith, family and the people of Georgia.",
    "As he works to fend off a Republican Party primary challenge from Trump-backed former Sen. David Perdue, conservative Georgia Gov.",
    "Georgia's Republican gubernatorial primary  to a degree  appears to be turning into a 2024 GOP presidential nomination proxy war.",
    "Chris Christie, a past RGA chair, will join Kemp for campaign stops in Canton and Alpharetta, Georgia, next Tuesday, May 17.",
    "I am proud to offer my full support for four more years of Brian Kemp as governor of the great state of Georgia!\"",
    "Four years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "\"Brian Kemp is one of the most successful conservative governors in America,\" Pence said in a statement.",
    "Meanwhile, Pence is making all the moves necessary in advance of a potential presidential run.",
    "Brian Kemp will get some last-minute help from a very high-profile surrogate.",
    "And Fox News was first to report on Thursday that former New Jersey Gov.",
    "Trump held a rally with Perdue in Georgia a month and a half ago.",
    "Doug Ducey of Arizona and Pete Ricketts of Nebraska."
  ]
}