{
  "id": 3145,
  "mediaId": 65,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Christie to stump with Kemp next week as Georgia governor works to fend off Trump-backed primary challenge",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9c04efba-85e0-459e-8fbf-a31d73771dca/c934a53d-62fd-4237-8582-8ad506b59253/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/chris-christie-stump-georgia-governor-brian-kemp-against-trump-backed-primary-challenger",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1951,
    2087,
    2095,
    761,
    1284,
    1147,
    1646,
    425,
    2672,
    2864
  ],
  "sentences": [
    "Christie, a former two-term governor of Pennsylvania and a former chair of the Republican Governors Association (RGA) who ran unsuccessfully for the 2016 GOP presidential nomination, will team up with Kemp at a bus tour stop in Canton and at a get out the vote rally in Alpharetta during his trip to Georgia next Tuesday, May 17, Fox News has learned.",
    "Christie, a one-time close Trump friend and adviser who's become a vocal GOP critic of the former president, responded on Twitter, writing \"Insightful commentary about three Republican Governors who were overwhelmingly re-elected by their people from a former President who lost to Joe Biden.",
    "FIRST ON FOX: KEMP BRINGS IN BIG BUCKS IN GEORGIA'S GOP GUBERNATORIAL CLASH\nFour years ago, with the support of then-President Donald Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "But regardless of Trump's endorsement, with less than two weeks to go until Georgia's primary, Kemp enjoys large leads over Perdue in two key campaign metrics  public opinion polling and fundraising.",
    "Soon after that news broke, Trump took aim, claiming in a statement that \"Today, the worst election integrity' Governor in the country, Brian Kemp, loaded the great state of Georgia up with RINOs.\"",
    "But Kemp earned Trump's ire starting in late 2020, after the governor certified President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "That tells you all you need to know about what you are getting in Georgia  just a continuation of bad elections and a real RINO if you vote for Brian Kemp,\" the former president argued.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "CLICK HERE TO GET THE FOX NEWS APP\nPundits also see Ricketts, the term limited Nebraska governor who's in his final year in office, as a potential White House contender in 2024.",
    "TRUMP TAKES AIM AT BARNETTE AS ONE-TIME LONGSHOT SOARS IN PENNSYLVANIA GOP SENATE PRIMARY\n\"Proud to stand with @DougDucey @GovRicketts supporting @BrianKempGA,\" Christie added.",
    "(Brian Kemp 2022 re-election campaign)\nTrump for months urged to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "SPLIT DECISION FOR TRUMP IN HIGH-PROFILE PRIMARIES IN NEBRASKA AND WEST VIRGINIA\nEarlier this week the Kemp campaign announced that Christie as well as RGA co-chairs Govs.",
    "Perdue declared his candidacy a few days after Abrams, an election reform champion and rising star in the Democratic Party, launched her second straight bid for governor.",
    "Earlier this week the candidate Ricketts was backing in the GOP gubernatorial primary to succeed him, defeated the contender Trump had endorsed and heavily supported.",
    "(REUTERS/Carlos Barria)\nTrump has repeated teased making a White House run, while Christie has also openly discussed making a second bid for president.",
    "Brian Kemp next week as the conservative governor works to fend off a primary challenge from Trump-backed former GOP Sen. David Perdue.",
    "Doug Ducey of Arizona and Pete Ricketts of Nebraska would be heading to Georgia to campaign with Kemp.",
    "The 2022 intra-party squabble could be an appetizer for the 2024 GOP presidential nomination race.",
    "Chris Christie, Doug Ducey from Arizona, and Pete Ricketts from Nebraska.",
    "Maybe the R' in RINO really stands for re-elected.\"",
    "Chris Christie will campaign with Georgia Gov.",
    "\"That's right, he had them all.",
    "FIRST ON FOX: Former Gov."
  ]
}