{
  "id": 3146,
  "mediaId": 195,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Chris Christie jabs Trump: Maybe the R in RINO really stands for re-elected'",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/ca_christiemasks_101620getty.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3486035-chris-christie-jabs-trump-maybe-the-r-in-rino-really-stands-for-re-elected/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Monique Beals",
  "authorUrl": "https://thehill.com/author/monique-beals/",
  "termIds": [
    761,
    1147,
    1284,
    1646,
    2087,
    2095,
    2136,
    4325,
    539,
    2672,
    2816
  ],
  "sentences": [
    "Meanwhile, Christie has been an outspoken critic of Trump's endorsements in the midterm elections, saying they have been emotional decisions? that weren't based on political analysis.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The former president has endorsed Perdue in the election, but recent polling has indicated that Kemp, who was once a Trump ally himself, is the favorite candidate for the upcoming primary.",
    "That tells you all you need to know about what you are getting in Georgia  just a continuation of bad elections and a real RINO if you vote for Brian Kemp,? he added.",
    "Chris Christie (R) criticized former President Trump on Twitter after Trump's comments about Christie and several other GOP governors supporting Georgia Gov.",
    "Insightful commentary about three Republican Governors who were overwhelmingly re-elected by their people from a former President who lost to Joe Biden.",
    "Today, the worst election integrity' Governor in the country, Brian Kemp, loaded the great state of Georgia up with RINOs,? Trump said in a statement.",
    "Pete Ricketts (R) and Christie RINOs,? meaning Republicans in name only,? for campaigning alongside Kemp ahead of his May 24 primary election.",
    "Brian Kemps (R) push for reelection instead of Trump's endorsed candidate in the primary race, former Sen. David Perdue (R-Ga.).",
    "Maybe the R' in RINO really stands for re-elected,? Christie tweeted on Wednesday.",
    "Proud to stand with @DougDucey @GovRicketts supporting @BrianKempGA,? he added.",
    "Chris Christie, Doug Ducey from Arizona, and Pete Ricketts from Nebraska.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "His tweet came after Trump called Arizona Gov.",
    "That's right, he had them all.",
    "Doug Ducey (R), Nebraska Gov.",
    "Former New Jersey Gov."
  ]
}