{
  "id": 3147,
  "mediaId": 195,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Nebraska loss raises questions about Trump's endorsement power",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/b2b39ccf9af243dc996e0be0de12d8c5.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/news/campaign/3485475-nebraska-loss-raises-questions-about-trumps-endorsement-power/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    761,
    967,
    1147,
    1332,
    1646,
    2095,
    2136,
    2365,
    4325,
    588,
    2816
  ],
  "sentences": [
    "I think they're going to have to make decisions much differently going into those later primaries than they did in these early ones, meaning they're going to potentially have to stop the negative flow of information about endorsements rather than riding high.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "So you couple that with the fact that he was actually a pretty good governor on Republican terms, and you've got the fact that Perdue has not been a great candidate.?\nMeanwhile, in Pennsylvania, Trump-backed GOP Senate candidate Mehmet Oz is facing a nail-biter of a primary against David McCormick and Kathy Barnette.",
    "If he doesn't endorse a candidate like that, then they're going to have problems.?\nMany election observers also pointed to the fact that Herbster's campaign was dealing with the fallout over the sexual misconduct allegations from eight women.",
    "Trump also rolled out there on a Sunday to go out and rally with him, so he put the full force of the brand behind him and he lost.?\nOther Trump-backed candidates are facing tough primary battles in the coming weeks.",
    "In a statement released on Wednesday, Trump referred to Ricketts, Christie and Ducey as RINOs,? or Republican in name only.? Trump has endorsed former Sen. David Perdue (R-Ga.) over Kemp in that primary race.",
    "Perdue, despite earning Trump's endorsement and frequently repeating the former president's unproven claims about the 2020 presidential election results, appears to have gained little traction in Georgia.",
    "It sends a message to a lot of other Republicans that you can take this guy on, and you can beat him.?\nPillen, a University of Nebraska regent, won the nine-way primary with nearly 34 percent of the vote.",
    "I don't think it's a death knell for any candidate if Trump endorses against them, I just think it depends on the dynamics of the race,? said Georgia-based Republican strategist Jay Williams.",
    "But various other Trump-endorsed candidates in states like Georgia and Pennsylvania are potentially facing uphill climbs in the weeks ahead, even with the former president's backing.",
    "The former president's endorsement is not only viewed as a seal of approval by various Republicans, but also as a test for his political brand going into 2022 and potentially 2024.",
    "Herbster's case was unique in some ways  he was grappling with multiple sexual misconduct allegations before Trump arrived to rally with him the week before the primary.",
    "Trump appeared at a rally with Herbster earlier this month in a push to drag him across the finish line amid the growing furor over the sexual misconduct claims.",
    "Charles Herbster's loss in Tuesday's Nebraska GOP gubernatorial primary is raising fresh questions about the strength of former President Trump's endorsement.",
    "Trump has yet to publicly comment on Herbster's defeat, but he did lash out at Ricketts, as well as former New Jersey Gov Chris Christie (R) and Arizona Gov.",
    "And before Tuesday, Trump's endorsement had already carried a number of Republican candidates over the finish line, including Ohio GOP Senate nominee J.D.",
    "Rep. Alex Mooney (R-W.Va.), who was backed by Trump, won his primary against Rep. David McKinley (R-W.Va.) in the state's 2nd Congressional District.",
    "While Greitens has denied the allegations, GOP leadership has already begun to distance itself from him, including retiring Sen. Roy Blunt (R-Mo.",
    "Kemp led Perdue, 53 percent to 27 percent, among likely voters, according to an Atlanta Journal-Constitution poll released late last month.",
    "On top of that, conservative outside groups like Club for Growth and Susan B. Anthony List have thrown their weight behind Barnette.",
    "The problem for the Trump brand is that they've created this false reality of undefeated,? one Republican strategist told The Hill.",
    "But some strategists argue that the weight Trump's endorsement or lack of an endorsement carries depends on the race itself.",
    "Herbster's loss could stand to impact Trump's decision on whether to endorse in Missouri's Aug. 2 Republican Senate primary.",
    "They humiliated Donald Trump in Nebraska,? MSNBC host Joe Scarborough said on his show Morning Joe? on Wednesday.",
    "Trump hedged his own bets in Alabama's GOP Senate primary, retracting his endorsement of Rep. Mo Brooks (R-Ala.).",
    "[Perdue] was going to have trouble just because an incumbent governor is incredibly powerful,? Williams said.",
    "Eric Greitens, arguably the front-runner in that primary, is facing domestic abuse charges from his ex-wife.",
    "Probably not, but it's a loss,? the first Republican strategist said regarding Tuesday's Nebraska primary.",
    "Jim Pillen's win marks the first race where a Trump-endorsed candidate lost a primary battle this cycle.",
    "I suspect with an August primary, he [Trump] probably waits regardless,? the Republican strategist said.",
    "On top of that, the incumbent governor is also leading the former senator in the fundraising game.",
    "Charles is a fine man, and he's innocent of these despicable charges,? Trump said at the rally.",
    "Vance and Ohio House nominees Max Miller and Madison Gesiotto Gilbert.",
    "Multiple polls have shown the three candidates to be neck-and-neck.",
    "Pete Ricketts (R), who is term-limited and has endorsed Pillen.",
    "Blunt said last week that the former governor should drop out.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Tuesday was not a total defeat for the former president.",
    "), whom Greitens is running to succeed in the Senate.",
    "McKinley was endorsed by Sen. Joe Manchin (D-W.Va.).",
    "Doug Ducey (R), for stumping for incumbent Gov.",
    "Is that a full condemnation of the Trump brand?",
    "Herbster trailed with 30 percent of the vote.",
    "He has to have a good candidate to endorse.",
    "Pillen is running to replace current Gov.",
    "They have to be credible,? he continued.",
    "They have to have a lot of money.",
    "He can't do it by himself.",
    "Brian Kemp (R) in Georgia."
  ]
}