{
  "id": 3150,
  "mediaId": 195,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Pennsylvania primary previews political polarization",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/voter08132020.jpg?w=925&h=551&crop=1",
  "link": "https://thehill.com/opinion/campaign/3485037-pennsylvania-primary-previews-political-polarization/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Bannon",
  "authorUrl": "",
  "termIds": [
    773,
    1713,
    1625,
    2491,
    2087,
    2145,
    2791,
    2972,
    2862
  ],
  "sentences": [
    "If the lieutenant governor wins his primary, there will be a clear-cut choice between a progressive Democrats who looks to the challenges of the future and a regressive Republican who wants to take America back to the 1950's.",
    "To maintain his status as the undisputed choice for the GOP presidential nod in 2024, Trump must continue to prove that he still retains his hold on the hearts, minds and wallets of rank-and-file Republicans.",
    "The road to the White House in 2024 will follow the same well-traveled path and the big races on the ballot this year will light the way\nThis fall will feature heated gubernatorial races in all three states.",
    "The key to unlocking victory in American politics is winning the industrial heartland that extends from the steel mills of western Pennsylvania to the automobile factories of Michigan and Wisconsin.",
    "McCormick responded aggressively to Trump's support his opponent, using his personal fortune to attack Oz's MAGA bona fides especially his support of abortion before he became a candidate.",
    "Now these states are a purple picket fence with a swinging gate that easily lets Democrats and Republicans in and out depending on the direction of the prevailing political winds.",
    "The incumbent Democratic governor of the Pennsylvania Tom Wolf is term limited but Attorney General Josh Shapiro will try to take the helm and keep the position for his party.",
    "Trump faces another tough test on May 24 when his endorsed candidate former Sen. David Perdue trails the incumbent Brian Kemp in the Georgia GOP gubernatorial primary.",
    "In the exit poll from the 2020 presidential election, a large majority of voters in the state indicated that they wanted abortion to be legal in all or most cases.",
    "Follow him on Twitter: @BradBannon\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Victories in competitive Senate races in Pennsylvania and in Wisconsin are vital to maintain Democratic control of the upper chamber of Congress.",
    "Whitmer was a finalist to be Biden's running mate in 2020 and she could have a presidential race of her own in the future if she wins this year.",
    "The three states used to form an impregnable blue wall that buttressed Democratic presidential candidates against intrusions from the Sunbelt.",
    "The Pennsylvania primary next week offers a fascinating sneak peek into the midterm elections this November and the presidential race in 2024.",
    "Democrats must take the opportunities they have to win the two states to offset potential losses elsewhere and maintain control of the Senate.",
    "This gives the Democrat an edge in a tight race that could feature a battle over the rejection of abortion rights by the U.S. Supreme Court.",
    "The governors of these three states may be the last line of defense for abortion rights if the U.S. Supreme Court overturns Roe v. Wade.",
    "Fetterman supported Sen. Bernie Sanders (I-Vt.) in the 2020 presidential race and is the favorite of the progressive wing of the party.",
    "Blast furnaces in Pennsylvania fuel the molten fires that produce hardened steel for cars manufactured in Michigan and Wisconsin.",
    "If Oz wins the primary on Tuesday, his victory will solidify Trump's status as the Republican strongman headed into 2024.",
    "Republicans have an opportunity to defeat Democratic Senate incumbents in Georgia, New Hampshire, Arizona and Nevada.",
    "Democratic governors in Michigan, Gretchen Whitmer, and in Wisconsin, Tony Evers, face difficult reelection fights.",
    "Vance, a venture capitalist and the author of Hillbilly Elegy? to a victory in a keenly contested primary.",
    "Another Republican, Sen. Pat Toomey of Pennsylvania is retiring and leaving his position up for grabs.",
    "Former President Donald Trump breached the blue wall in 2016 and won the trifecta and the White House.",
    "His podcast, Deadline D.C. with Brad Bannon,? airs on Periscope TV and the Progressive Voices Network.",
    "The contest for supremacy in the industrial Midwest starts with the Pennsylvania primary on May 17.",
    "The biggest battles on the ballot are the U.S. Senate primaries to select a nominee for each party.",
    "Ron DeSantis and Texas Sen. Ted Cruz  are more likely to challenge Trump for the 2024 nomination.",
    "The Republican race is an opportunity for Trump to demonstrate that he still leads the party.",
    "Democratic gubernatorial wins in this troika paved the way to President Biden's 2020 victory.",
    "There are two important races in the region that could tilt party control of the U.S. Senate.",
    "Wisconsin GOP Sen. Ron Johnson will have a tough time keeping his seat in the upper chamber.",
    "The Pennsylvania primaries will be a preview of the polarization that pervades politics.",
    "He endorsed TV celebrity and former heart surgeon Dr. Mehmet Oz over David McCormick.",
    "The ex-president is coming off a big victory on May 3 in Ohio when he helped J.D.",
    "This race illustrates the national battle for the soul of the Democratic Party.",
    "Her defense of reproductive rights there is the centerpiece of her campaign.",
    "Bannon is a Democratic pollster and CEO of Bannon Communications Research.",
    "The trinity of states often act in concert as a political power block.",
    "If McCormick wins, other GOP presidential aspirants like Florida Gov.",
    "This power trio is the key to the kingdom of our electoral system.",
    "There are economic and political links between the three states.",
    "In Pennsylvania, he has another chance to work magic or mayhem.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Oz now considers himself pro-life? and wants Roe overturned.",
    "Also in the mix is Kathy Barletta a conservative activist.",
    "On the Democratic side of Pennsylvania politics, Lt. Gov.",
    "John Fetterman is the frontrunner over Rep. Conor Lamb.",
    "Trump traveled to Pennsylvania last week to endorse Oz.",
    "Lamb has established himself as a moderate Democrat.",
    "Biden won Pennsylvania and Wisconsin in 2020.",
    "In 2020, he lost all three states."
  ]
}