{
  "id": 3155,
  "mediaId": 178,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Trump stays out of major Minnesota races ahead of GOP convention",
  "image": "https://chorus.stimg.co/23459871/1gopnew__1_.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/trump-stays-out-of-major-minnesota-races-ahead-of-gop-convention/600172783/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter Woodall",
  "authorUrl": "https://www.startribune.com/hunter-woodall/7456465/",
  "termIds": [
    2422,
    2095,
    2087,
    1147,
    3035,
    3045,
    430,
    428,
    2886,
    2796
  ],
  "sentences": [
    "While Trump continues to spread false claims that the 2020 election was rigged, and while he was impeached by the U.S. House for inciting the Jan. 6 insurrection, he holds significant influence over Republicans nationally and has shown signs he could seek the White House again in 2024.",
    "The online campaign bio for fellow Republican candidate Brad Finstad notes early on that he \"is proud to have served as President Donald J. Trump's State Director for USDA Rural Development in Minnesota,\" and lists one of his values as being \"Pro-Trump.\"",
    "Vance won a contentious Ohio Senate primary after getting the former president's endorsement, Trump also supported a controversial candidate for governor in Nebraska who lost a primary earlier this week after being accused of sexual assault.",
    "Trump's absence in Minnesota isn't keeping GOP contenders from trying to attach themselves to him before Republican delegates gather in Rochester this weekend to make an endorsement for governor at the party's state convention.",
    "Some delegates have said pandemic and education-related concerns  around parental control, school choice and critical race theory  have prompted a number of people to get involved with the GOP for the first time.",
    "Candidates for statewide office have called for additional election measures such as voter ID requirements, and many have danced around the question of acknowledging that President Biden won the 2020 election.",
    "And GOP state Rep. Jeremy Munson's congressional campaign website touts his support for the \"America-First agenda\" before featuring a photo of Munson at a Trump event in which the former president is visible.",
    "\"He hasn't seen a compelling reason to reward or punish,\" said David Sturrock, a former Minnesota Republican Party official and a political science professor at Southwest Minnesota State University.",
    "Support for law enforcement and a tougher approach to rising crime have also been top issues for gubernatorial candidates, as has opposition to now-expired pandemic-related government mandates.",
    "While a photo of Hagedorn, Carnahan and Trump is a fixture on the main page of her campaign website, she downplayed the fact that the former president hasn't endorsed in the race so far.",
    "Donald Trump's endorsement is helping shape Republican races across the country, but the former president hasn't picked a side in the party's unsettled race for Minnesota governor.",
    "Marty Seifert, a past candidate for governor and former Minnesota House leader, said he didn't know if a Trump endorsement would be an asset or a liability in a general election.",
    "State campaign finance records also show Republican governor candidate Kendall Qualls has paid thousands to a firm that lists Trump's 2020 campaign manager as a founding partner.",
    "\"There's a significant amount of the base that's going to look at that Trump endorsement as being very valuable,\" said Shah, a dermatologist who's never run for office before.",
    "Trump has also stayed out of the upcoming special Republican primary in the First Congressional District despite easily winning the area in both of his races for president.",
    "\"I think they're more interested in the future than the past, frankly, and they want a candidate who could win the election,\" Seifert said of his fellow GOP delegates.",
    "In races yet to be decided, the former president picked a side in a competitive Pennsylvania Senate primary and backed a Republican challenger against GOP Gov.",
    "After running uncontested in the state's 2020 primary, Trump lost Minnesota to Democrat Joe Biden by about 7 percentage points in the November 2020 election.",
    "He finished third in the state's caucuses in 2016 before losing to Democrat Hillary Clinton by about 1.5 percentage points in the general election.",
    "Early voting began weeks ago for the May 24 special primary as candidates seek to serve out the rest of the late GOP Rep. Jim Hagedorn's term.",
    "Election concerns have been a common theme among GOP candidates who have spent months courting voters at rallies, caucuses and conventions.",
    "In an e-mail blast last month, state Sen. Paul Gazelka said he \"defended President Trump vigorously on the campaign trail in 2020.\"",
    "Jennifer Carnahan, Hagedorn's widow who is seeking her husband's seat, tweeted in March about visiting Trump's Mar-a-Lago.",
    "Minnesota Republicans haven't won a statewide race since 2006, when Tim Pawlenty was re-elected to the governor's office.",
    "Republicans are meeting in Rochester on Friday and Saturday to make their picks in statewide races.",
    "\"Trump's endorsement in our race would certainly show who the real conservative is,\" Munson said.",
    "The power of Trump's endorsement is casting a long shadow over GOP races across the country.",
    "\"It was the right thing to do politically for the cause of re-electing my caucus' majority.",
    "And it was the right thing to do morally,\" wrote Gazelka, a former Senate Majority Leader.",
    "GOP gubernatorial candidate Neil Shah said a Trump endorsement \"would certainly help.\"",
    "Republicans in the race are trying to emphasize their Trump bona fides to voters.",
    "DFLers from across the state will do the same the following weekend.",
    "\"I don't think it shows anything to be honest,\" Carnahan said.",
    "Staff writer Jessie Van Berkel contributed to this report.",
    "Trump has never carried Minnesota in a competitive race.",
    "\"I think maybe there's other places he's looking at.",
    "I don't know; I am not the president.\"",
    "I think it is a crowded field.",
    "Brian Kemp of Georgia.",
    "\"He's big on both.\"",
    "While author J.D."
  ]
}