{
  "id": 3157,
  "mediaId": 136,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Donald Trump Launches Fresh Attack on 'Real RINO' Georgia Gov Brian Kemp",
  "image": "https://d.newsweek.com/en/full/2035948/donald-trump-brian-kemp-georgia-republican-primary.webp?w=790&f=906e85d59b3ef21b8f39460e82d24fe8",
  "link": "https://www.newsweek.com/donald-trump-launches-fresh-attack-real-rino-georgia-gov-brian-kemp-1705812",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    761,
    1147,
    1646,
    2087,
    2095,
    2136,
    428,
    2672,
    2816
  ],
  "sentences": [
    "Trump also lashed out at Arizona Governor Doug Ducey, Nebraska Governor Pete Ricketts and former New Jersey Governor Chris Christie as \"RINOs,\" or Republicans in name only, amid reports that the trio of Republicans are set to campaign for Kemp ahead of the May 24 primary.",
    "Christie predicted that Trump's \"emotional\" endorsements could \"backfire\" during an interview last month on ABC News' This Week, arguing that the former president's picks were \"all emotional decisions\" and based on \"who speaks to him last.\"",
    "\"I was secretary of state for eight years and I don't need to be lectured by someone that lost their last election about what our voting laws are and who has responsibilities for those in our state,\" Kemp responded.",
    "Kemp was leading Perdue by 23.3 points and was the choice of more than 50 percent of the state's Republican voters as of Wednesday, according to an average of polls from RealClearPolitics.",
    "Former President Donald Trump has blasted Republican Georgia Governor Brian Kemp as a \"real RINO\" as Kemp's campaign continues against Trump-backed GOP primary challenger David Perdue.",
    "Perdue opened his first debate with Kemp last month by insisting that election was \"rigged and stolen,\" accusing the governor of allowing \"radical Democrats to steal our election.\"",
    "As with Kemp in Georgia, Ducey failed to overturn Trump's narrow loss in Arizona, while Christie has blasted Trump's repeated claims of massive election fraud as \"dead wrong.\"",
    "Kemp, previously a Trump ally, fell out of favor with the former president after failing to overturn President Joe Biden's 2020 Georgia presidential election victory.",
    "\"Today, the worst 'election integrity' Governor in the country, Brian Kemp, loaded the great state of Georgia up with RINOs,\" Trump said in a statement on Wednesday.",
    "Ricketts drew Trump's disapproval after endorsing Republican Nebraska gubernatorial candidate Jim Pillen over Trump-backed agribusiness executive Charles Herbster.",
    "That tells you all you need to know about what you are getting in Georgiajust a continuation of bad elections and a real RINO if you vote for Brian Kemp.\"",
    "Perdue, a former U.S. senator, has focused much of his campaign on Trump's repeated false claims that the 2020 election was plagued with massive fraud.",
    "Despite Trump backing Perdue and strongly disapproving of Kemp, polls have shown that the incumbent maintains a substantial lead over his challenger.",
    "Pillen defeated Herbster in the state's GOP primary on Tuesday night, ending the former president's 55-0 streak of endorsee primary wins.",
    "Kemp maintaining a high margin would allow him to avoid a runoff and win the nomination outright if it holds.",
    "Trump has also heavily criticized Ducey and Christie over the 2020 election.",
    "Chris Christie, Doug Ducey from Arizona, and Pete Ricketts from Nebraska.",
    "Newsweek reached out to Kemp's office for comment.",
    "\"That's right, he had them all."
  ]
}