{
  "id": 3158,
  "mediaId": 195,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Trump derides RINO' governors backing Kemp",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/kemp_110418getty.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3484923-trump-derides-rino-governors-backing-kemp/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    761,
    1147,
    1284,
    1646,
    2095,
    2136,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Chris Christie as RINOs?  an acronym for Republicans in name only?  and warned that a vote for Kemp would further erode Georgia's election integrity.?\nToday, the worst election integrity' Governor in the country, Brian Kemp, loaded the great state of Georgia up with RINOs,? Trump said in a statement.",
    "Kemp, a onetime Trump ally who received the former president's support in 2018, has the support of prominent Republicans and Republican-aligned groups, including the Republican Governors Association and the National Rifle Association.",
    "Over the past month, public polls have shown Kemp notching more than 50 percent support in the primary matchup, suggesting that he is poised to win the GOP nomination outright and avoid an unpredictable June runoff against Perdue.",
    "On Tuesday, Trump's preferred candidate in the Nebraska GOP gubernatorial primary, business executive Charles Herbster, lost the nomination to Jim Pillen, who had the support of Ricketts.",
    "The race in Georgia is one of several early tests of Trump's continued sway among Republicans as he looks to position himself for a potential 2024 comeback bid for the White House.",
    "That tells you all you need to know about what you are getting in Georgia  just a continuation of bad elections and a real RINO if you vote for Brian Kemp,? he added.",
    "Brian Kemp over his plans to campaign with a handful of current and former GOP governors ahead of his May 24 primary contest against former Sen. David Perdue (R-Ga.).",
    "It's Trump's latest swipe at Kemp, whom he vowed to campaign against after the Georgia governor rebuffed his pleas to overturn his 2020 election loss in the state.",
    "Perdue, meanwhile, has centered his campaign on Trump's baseless claim that widespread voter fraud robbed the former president of a second term in the White House.",
    "But despite Trump's continued popularity among GOP voters, Perdue's message has so far failed to win him the kind of broad support needed to clinch the nomination.",
    "Trump has endorsed Perdue in the race, though recent polling shows Kemp as the clear favorite to clinch the nomination in the May 24 primary.",
    "The GOP gubernatorial primary in Georgia has emerged as something of a proxy battle between Trump and more established-aligned Republicans.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Chris Christie, Doug Ducey from Arizona, and Pete Ricketts from Nebraska.",
    "Former President Trump lashed out on Wednesday at Georgia Gov.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "In a statement, Trump ripped Kemp as well as Arizona Gov.",
    "Pete Ricketts and former New Jersey Gov.",
    "That's right, he had them all.",
    "Doug Ducey, Nebraska Gov."
  ]
}