{
  "id": 3160,
  "mediaId": 238,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "On our radar: A Senate vote on abortion that's destined to fail",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/11/biden-inflation-senate-abortion/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1764,
    2087,
    2095,
    2136,
    4325,
    571,
    2672,
    2707
  ],
  "sentences": [
    "These extreme laws are endangering the freedom and safety of all women, and they are particularly devastating for those who have fewer options and resources, such as low-income women and those in underserved communities, including women of color and many in rural areas.?\nReturn to menu\nBiden said that while it was heartening? to see a federal report Wednesday showing potential signs of the easing of inflation, the fact remains that inflation is unacceptably high.?\nBiden's reaction to the report by the Bureau of Labor Statistics came a day after he declared in a speech from the White House that fighting inflation is his top domestic priority.",
    "Rachel Roubein: What's clear and what's not clear about today's abortion vote  Democrats are set today to vote on legislation to codify Roe v. Wade's decades-old protections into federal law.What's clear: The vote  which is widely expected to fail  is viewed as largely symbolic, an effort by Democrats to mobilize their base after last week's draft opinion suggested a majority of the Supreme Court is prepared to overturn the right to an abortion.What's not clear: The next steps.",
    "Normally, Ukraine's grains would be getting exported to foreign markets, but that has not happened because of Putin's invasion.?\nAccording to a White House fact sheet, some of the steps Biden will announce Wednesday are: making adjustments to crop insurance to allow more farmers to plant a second crop on the same land in the same year; increasing assistance to farmers to use technology for nutrient management; and providing aid to reduce fertilizer prices.",
    "In its Statement of Administration Policy, the White House said abortion rights are under unprecedented threat now, despite strong support from the American people.?\nState laws designed to restrict access to abortion have increased at an alarming rate recently  in Texas, Mississippi, and many other states around the country,? the statement said.",
    "And they're coming after birth control.?\nReturn to menu\nThe Post's Josh Dawsey reports that campaign strategists and candidates in a number of states said that tying candidates to China has become a prime attack, with candidates seeking to differentiate themselves as they largely hew to former president Donald Trump's political agenda.",
    "While Wednesday's vote is largely a reprise of a failed February vote staged by Senate Democratic leaders, the issue has taken on new resonance after last week's leak of a draft opinion from Justice Samuel A. Alito Jr. suggesting the Supreme Court is poised to summarily reverse Roe and curtail guaranteed nationwide access to abortions.",
    "Marianna Sotomayor: An embrace of unions by the House  In a Monday night vote, the House paved the way for staffers to unionize and bargain collectively without fear of retaliation.It's a moment that was almost 30 years in the making, after legislation laying the framework for congressional staff members to unionize passed in 1995.",
    "But China has been seen as the primary world foe for at least the last decade or more.?\nReturn to menu\nAs Biden visits a family farm in Kankakee, Ill., on Wednesday, he is expected to lay much of the blame for higher food prices on Russian President Vladimir Putin and offer some steps to cut costs for farmers.",
    "Senate Majority Leader Charles E. Schumer (D-N.Y.) and other Democrats acknowledged Tuesday that the vote was about mobilizing voters, not passing legislation in a Congress where Democrats hold majorities but do not have the votes to defeat Republican filibusters or change the Senate rules to eliminate them.",
    "Return to menu\nAhead of what's certain to be a failed vote in the Senate to protect abortion rights, the Democratic Senatorial Campaign Committee unveiled a new advertising campaign that provides a window into how the party will try to use the issue against Republicans heading into the midterm elections.",
    "They could also vote on narrower guarantees, such as maintaining access to the procedure in cases of rape, incest and when the health of the mother is at risk, but some are concerned that could help some Republicans distance themselves from some of the GOP's more conservative elements.",
    "Return to menu\nAhead of Biden's trip, a new federal government report showed prices rose 8.3 percent in April compared with a year ago, giving policymakers some nascent hope that soaring inflation may be starting to slow down, even as households continue to feel the pain.",
    "But it could change Capitol Hill culture for many who have anonymously accused lawmakers or chiefs of staff of creating toxic workplaces.It also shows how much Democrats are trying to right a number of wrongs that have led to an exodus of staffers in recent years.",
    "Because when you destroy an egg, you're killing a preborn baby sea turtle or a preborn baby eagle.?\nMara notes that the senator's analogy sparked outrage on social media, where a clip of Daines's speech from C-SPAN had nearly 1 million views by Wednesday morning.",
    "There's a divide on whether to eliminate the filibuster, which requires the support of 60 senators to move a bill forward.Many Democrats say today is just the first vote of many more to come on related measures, an effort to keep the issue top of mind for voters.",
    "Democrats pledge today's vote is only the first step in a broader mobilization effort, Mike DeBonis and I reported today, but they're yet to coalesce around one coherent strategy to sustain public backlash for the six months leading up to November's elections.",
    "The ads, which the DSCC said are debuting Wednesday on the MSNBC homepage, depict rapidly burning matches and warn that if Republicans win in November, they will light women's rights on fire.?\nThey will make abortion illegal everywhere,? the spot says.",
    "Return to menu\nRepublican voters in Nebraska undermined Donald Trump's status as GOP kingmaker on Tuesday as they rejected a candidate for governor endorsed by the former president who had been accused of sexually assaulting multiple women.",
    "In the past few months, the war in Ukraine, along with coronavirus shutdowns in China, have roiled global energy markets and dealt the latest blow to supply chains, pushing prices even higher as families struggle to pay for the basics.",
    "Ricketts is fresh off a victory over Trump in his home state: In Tuesday's GOP Senate primary, University of Nebraska regent Jim Pillen, whom Ricketts supported, defeated Charles Herbster, an agribusiness executive supported by Trump.",
    "I would love to see us vote on every sub-issue that we can because I think there are many people that have an agenda that doesn't fit not just with Democrat or Republican, it doesn't fit with America,? said Sen. Cory Booker (D-N.J.).",
    "But Democrats plan to plow ahead with the effort anyway, hoping it will be a step in a larger strategy to mobilize Americans around reproductive rights as the Supreme Court considers overturning Roe v. Wade and related decisions.",
    "Vance made a startling observation: He argued that Biden's border policies had reverberated across the country, allowing not only undocumented immigrants but also deadly drugs to flow into the country  with a nefarious purpose.",
    "Vance suggested that Biden was intentionally allowing drugs such as fentanyl to flow into the country with the intention of trying to kill supporters of former president Donald Trump in the heartland? of the country.",
    "In his statement, Biden said the Federal Reserve plays a primary role in fighting inflation in our country? and thanked the Senate for confirming his nominee Lisa Cook to the Board of Governors on Tuesday night.",
    "Return to menu\nAhead of a Senate vote on abortion Wednesday, the White House formally endorsed the bill known as the Women's Health Protection Act of 2022 and said Biden looks forward to signing it into law.",
    "Supporters are expected to fall well short of the 60 votes needed to advance the legislation, but they hope to galvanize voters on the issue with the fate of Roe v. Wade in the hands of the Supreme Court.",
    "Speaker Nancy Pelosi (D-Calif.) also recently announced a floor for staff pay at $45,000, which comes less than a year after her decision to allow top staffers to be paid more than a Congress member.",
    "Meanwhile, in West Virginia, Rep. Alex Mooney prevailed in a Republican primary contest against fellow congressman David B. McKinley  a win for Trump, who endorsed Mooney and campaigned for him.",
    "Herbster has been accused by eight women of touching them inappropriately; two have spoken on the record to the Nebraska Examiner about Herbster doing so at a Republican fundraiser in 2019.",
    "In Georgia, polls have showed Kemp with a significant lead over Perdue, whose campaign has focused heavily on Trump's unfounded claim of election fraud in the 2020 presidential election.",
    "Putin's war has raised food prices as well, because Ukraine and Russia are two of the world's major breadbaskets,? Biden said, citing the production of wheat and corn in particular.",
    "University of Nebraska regent Jim Pillen prevailed in the Republican primary over Charles Herbster, an agribusiness executive who has denied the allegations of repeated misconduct.",
    "In that speech, he declared that fighting inflation is his top domestic priority and pointed to Russia's war on Ukraine as a major reason for higher prices on gas and other goods.",
    "Return to menu\nThere's no doubt about the outcome: There will not be the 60 votes needed to advance legislation writing abortion protections into law in the Senate on Wednesday.",
    "Josh writes:\nThe attacks have stretched from Texas to Ohio to Missouri, with candidates making aggressive and sometimes misleading claims about their opponents' views on China.",
    "High inflation has been a scourge on a recovery that has been strong by many other measures, hurting Biden's approval ratings and intensifying pressure on the Federal Reserve.",
    "There are China remnants in all these primaries,? said Tony Fabrizio, a prominent pollster who works for Trump and is working in many of this year's contested primary states.",
    "The report released Wednesday showed prices rose 8.3 percent compared with a year ago and 0.3 percent compared to the month before, the slowest increase since last summer.",
    "But we can certainly dig into the data to see whether there is even a basis for his claim that Biden has allowed the flow of drugs and deaths to increase.",
    "The Post's Rachel Siegel reports that data released by the Bureau of Labor Statistics shows prices rose 0.3 percent in April compared to the month before.",
    "Doug Ducey is headed to Georgia this weekend to campaign with Kemp, according to the Atlanta Journal-Constitution, which also reports that Nebraska Gov.",
    "Writing in The Early 202, Leigh Ann Caldwell and Theodoric Meyer say that Democrats are vowing that Wednesday's vote will not be the last on abortion.",
    "The point Daines sought to make is that under the bill proposed by Democrats, the eggs of sea turtles would have more protections than human fetuses.",
    "Herbster's defeat in Nebraska, after a nasty and expensive intraparty battle, dealt Trump a rare blow in a conservative state he won handily twice.",
    "You should make them vote on that to see where folks stand so they know where people's positions are and they informed as an electorate,? he said.",
    "All three have played roles with the Republican Governors Association, which is helping fund Kemp's effort to fend off the challenge from Perdue.",
    "He said that Democrats should put up votes on issues such as whether there should be exceptions for rape or incest and the use of contraception.",
    "Supporters are expected to fall well short of the 60 votes needed to advance the bill, which would write abortion protections into federal law.",
    "It has also tested Americans' ability to absorb more expensive rent, groceries or gas, with little sense of when the strain will fade away.",
    "They write of Democrats:\nThey will continue to make this a campaign issue until Election Day, hoping more votes means more headlines.",
    "While in Illinois, Biden will also address a labor union and raise money for the Democratic National Committee as the midterms loom.",
    "Today, President Biden is heading to a farm in Illinois to talk about the price of food and offer measures to cut costs for farmers.",
    "They're trying to figure out how to get it out of the country to market, which would reduce prices around the world,? Biden said.",
    "On Wednesday, Biden is traveling to a farm in Illinois to keep talking about the issue, this time with a focus on food prices.",
    "Return to menu\nProminent Republican governors are bucking former president Donald Trump by siding with incumbent Georgia Gov.",
    "Ahead of Biden's trip, the federal government issued a report showing that soaring inflation may be starting to slow down.",
    "Pete Ricketts and former New Jersey governor Chris Christie are also expected to rally for Kemp before the May 24 primary.",
    "Writing in The Fact Checker, The Post's Glenn Kessler says that's extreme even by today's standards of political rhetoric.",
    "It is unclear how quickly some offices will begin the process to be represented by a union or how many will seek to do so.",
    "If you coddle China, or you are soft on China, that makes you not so much America first and not so tough,? Fabrizio said.",
    "Meanwhile, an effort by Senate Democrats to write abortion protections into federal law is destined to fail Wednesday.",
    "Return to menu\nNo one expects the Senate vote to write abortion protections into federal law to succeed on Wednesday.",
    "made waves with a floor speech Tuesday delivered next to a poster comparing sea turtle hatchlings and human babies.",
    "The Senate still hasn't and probably won't.While House staffers, largely Democrats, are celebrating the move.",
    "The proposed bill, Daines said, would leave a fetus with fewer legal protections than certain animal eggs.",
    "The mixed results for the former president came in contests pitting him against local Republican leaders.",
    "If you were to take or destroy the eggs of a sea turtle, the criminal penalties are severe,? he said.",
    "Trump has repeatedly criticized Kemp for not doing enough to reverse election results in Georgia.",
    "Economic officials agree that it will take months of data to assess which way prices are heading.",
    "They served as the latest test of his influence on the selection of GOP nominees in the midterms.",
    "However, neither the House nor Senate passed resolutions that would make unionizing possible.",
    "The visit comes a day after he declared that fighting inflation is his top domestic priority.",
    "At 3 p.m. weekdays, return to this space, and we'll address what's on the minds of readers.",
    "Return to menu\nOn the eve of a Senate vote on abortion rights, Sen. Steve Daines (R-Mont.)",
    "Why do we have laws in place that protect the eggs of a sea turtle or the eggs of eagles?",
    "This could include protecting other rights, such as contraception and same-sex marriage.",
    "Return to menu\nShortly before he won the Republican primary for Ohio's Senate race, J.D.",
    "Biden offered a preview of his thinking during remarks from the White House on Tuesday.",
    "Brian Kemp over his Trump-backed GOP primary challenger, former senator David Perdue.",
    "Punishing women, even in cases of rape, incest or to save a mother's life.",
    "But some Democrats are determined to hold more of them.",
    "Glenn writes:\nWe're not sure how to even evaluate that.",
    "That, of course, is not going to happen anytime soon.",
    "Being tagged as soft on China is not a good thing.",
    "Cook is the first Black woman on the board.",
    "Trump focused and catalyzed some of it.",
    "The latest evidence: Arizona Gov.",
    "Got a question about politics?",
    "Submit it here."
  ]
}