{
  "id": 3163,
  "mediaId": 238,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Many GOP candidates are bashing each other for ties to China",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/11/republicans-china-primaries/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1281,
    1306,
    1646,
    2095,
    3038,
    428,
    571,
    2672,
    2863
  ],
  "sentences": [
    "And I remember during the early considerations of President Trump  putting heavy tariffs on China  there were voices within the White House and within the party that this goes against Republican traditions.?\nPillsbury and others note that many of the candidates launching the attacks have not delivered succinct policy positions on what they would do differently, and that some of the attacks seem to be fearmongering.",
    "McCormick campaign spokesperson Jess Szymanski said in a statement: Dave's battle-tested experience will make him one of the strongest Senators in Washington in holding China accountable and restoring pro-growth, America First policies.?\nFor their part, McCormick and his team have put together an extensive book of research attacking Oz for some for his investments in China.",
    "Ties to China  even spurious, misleading or hyperbolic ones  have become an albatross for GOP candidates across the country in 2022 races and an animating presence in campaign stops and advertisements, with much of the Republican Party holding increasingly negative views of China after two years of the coronavirus and Trump's rhetoric against the country.",
    "But China has been seen as the primary world foe for at least the last decade or more.?\nIn a poll Fabrizio conducted earlier this year, he said, Republican voters overwhelmingly viewed China as more of a national security threat than Russia, even as Russia launched missiles into Ukraine and killed thousands of civilians in a brutal land war.",
    "It is interwoven in the trade message, but it's more that Republicans see China as an existential threat to all of Western civilization.?\nTrump's team polled last year on various messages for his rallies, and learned that attacking China was among the most popular with his supporters.",
    "In Pennsylvania, Mehmet Oz has repeatedly slashed his foe David McCormick for conducting business deals with China as hedge fund CEO, while McCormick and his allies have attacked Oz for making money off Chinese state TV and using Chinese products for his companies.",
    "Oz's stance on China is unequivocal  the Chinese Communist Party's malign actions both within their own country and on the world stage are reprehensible.?\nAnd when Oz launched a bedding company, he contracted with a firm in China to make many of its products.",
    "Some McCormick allies said they viewed his Chinese business ties as his greatest disadvantage when he started the campaign; his first move was to write an op-ed for Fox Business defending himself and promising to be more aggressive on China.",
    "Campaign strategists and candidates in a number of states said that tying candidates to China has become a prime attack in a GOP primary  with candidates seeking to differentiate themselves as they largely hew to Trump's political agenda.",
    "A March poll by the Chicago Council on Global Affairs found that 75 percent of Republicans said China's development as a world power represented a critical threat? to U.S. interests, up from 67 percent in 2020 and 42 percent in 2018.",
    "In addition to Trump, who is weighing a reelection bid, other potential 2024 presidential candidates have focused on China, with former secretary of state Mike Pompeo and others offering harsh rhetoric against the country.",
    "That's why I believe it is past time for America's leaders to confront head-on the Chinese Communist Party (CCP), which poses the greatest economic and national security threat to the United States,? McCormick wrote.",
    "The Dr. Oz show has aired in over 100 countries for over 13 years to provide life-changing health information to millions of people across the globe,? said Brittany Yanick, a spokesperson for Oz.",
    "McCormick has been criticized frequently by Oz's campaign for his 2007 remarks on China while serving as a top Treasury Department official in the George W. Bush administration.",
    "There are China remnants in all these primaries,? said Tony Fabrizio, a prominent pollster who works for Trump and is working in many of this year's contested primary states.",
    "Before running for the Senate, McCormick's Bridgewater raised the equivalent of $1.25 billion for its third investment fund in China,? according to the Wall Street Journal.",
    "The attacks have stretched from Texas to Ohio to Missouri, with candidates making aggressive and sometimes misleading claims about their opponents' views on China.",
    "For example, Oz made money when his television show was syndicated in the country and acquiesced to Chinese state TV rules in order for the show to be broadcast.",
    "Michael Pillsbury, one of Trump's informal advisers who was slated to be his ambassador to the country if he had won a second term, said it once was different.",
    "Trump started calling for reparations from China over the coronavirus, receiving raucous cheers at his rallies  with no enforcement mechanism provided.",
    "In Pennsylvania, McCormick's work at the hedge fund Bridgewater  and its extensive business dealings with China  have been a key part of Oz's message.",
    "When Trump criticized McCormick last Friday night at a rainy rally, he lampooned him for being too kind to China in one of his most scorching attacks.",
    "The advertisement strikes an ominous tone from a familiar voice: Donald Trump inveighing against American companies sending their jobs to China.",
    "The party's supporters listened to Trump bad-mouth China throughout his term, even as he struck a more conciliatory tone behind the scenes.",
    "Oz's campaign defended the items being made in China, saying it was difficult to find materials to make such products in the United States.",
    "They called him the Wolf of Westport,? a reference to the affluent Connecticut town near New York City where Bridgewater is headquartered.",
    "Pillows, mattresses and mattress toppers, among other things, were all made in the country through a partnership with the company Malouf.",
    "We tested a number of hits, and that was the best-polling one  the outsourcing to China,? said Cody Hall, Kemp's communications director.",
    "In Georgia, a state more than 7,000 miles from China, it has been a centerpiece of Kemp's campaign in paid advertising and messaging.",
    "The spot accuses Perdue of outsourcing jobs in the private sector as a CEO before becoming a candidate for the Senate in Georgia.",
    "There is a confluence of reasons Republicans have escalated their anti-China rhetoric, according to strategists and candidates.",
    "And there is palpable and widespread blame on China for the coronavirus, which was first detected in the Chinese city of Wuhan.",
    "Let's go China!? two men paid by the Oz campaign, dressed in vests and calling themselves finance bros,? cheered in one ad.",
    "If you coddle China, or you are soft on China, that makes you not so much America first and not so tough,? Fabrizio said.",
    "There is deep frustration among some Rust Belt states that Chinese imports have cost American jobs and deflated towns.",
    "Brian Kemp, who is campaigning against David Perdue  the candidate the former president has picked to win in Georgia.",
    "The part of commonality across the MAGA base is being tough on China,? said Jason Miller, a longtime Trump adviser.",
    "That allowed Oz to make between $1 million and $5 million, according to a financial disclosure he filed.",
    "It is something quite new  Republicans used to be the business of party and free trade,? Pillsbury said.",
    "It is a shift from decades past, when many Republicans took a more conciliatory tone toward China.",
    "When China succeeds, the United States succeeds,? McCormick said, speaking in Beijing.",
    "It has been much less of an issue in Democratic primaries.",
    "But the advertisement is from Trump foe and Georgia Gov.",
    "Being tagged as soft on China is not a good thing.",
    "Trump focused and catalyzed some of it.",
    "Dr."
  ]
}