{
  "id": 3164,
  "mediaId": 195,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Republicans make final push for Kemp in Georgia, bucking Trump",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/kempbrian_perduedavid_051022ap-brynn-anderson_georgia-campaign.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/blogs/blog-briefing-room/news/campaigns/3483805-republicans-make-final-push-for-kemp-in-georgia-bucking-trump/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1078,
    1147,
    1287,
    1646,
    1951,
    2095,
    2230,
    4325,
    428,
    501,
    2672
  ],
  "sentences": [
    "With Kemp, you've got two factors: one, he's been a successful governor in the state, and two, he's running against someone who voters have already rejected.?\nTrump pledged to exact revenge on Kemp after he rebuffed the former president's pleas to help him overturn his 2020 electoral loss in Georgia, turning against a onetime ally whom he had previously endorsed.",
    "Ultimately, one very wise man told me that the job of being governor of Georgia is basically being the president of a very large chamber of commerce, and I think in that regard, Kemp has done incredibly well,? said Chuck Clay, a former Republican state senator and Georgia GOP chair.",
    "Heye said that Kemp's standing in the primary contest may also come down to a simple fact: He beat Democrat Stacey Abrams in the 2018 governor's race, while Perdue lost his 2020 reelection bid, costing Republicans a seat that helped hand Democrats control of the Senate.",
    "He signed a bill that would prohibit abortions six weeks after conception, implemented sweeping changes to the state's election system and signed a law allowing Georgians to carry guns in public without a license or background check.",
    "Trump has acknowledged the long odds Perdue faces in ousting Kemp in the primary, noting in an interview with conservative radio host John Fredericks last month that it's always hard to beat a sitting governor.?\nIt's hard.",
    "Trump eventually persuaded Perdue to launch a primary challenge to Kemp, betting that his endorsement and Perdue's focus on baseless claims of election fraud would galvanize conservative voters against Kemp.",
    "But Trump's endorsement has so far failed to materialize into overwhelming support for Perdue, who lost reelection last year after falling short in a hotly contested runoff against Sen. Jon Ossoff (D-Ga.).",
    "The outside help comes as polling shows that Kemp may have one of the best shots in the country at taking down a Trump-endorsed candidate in a state that has haunted the former president since 2020.",
    "One Georgia-based Republican strategist said that those moves have helped insulate Kemp from Trump's attacks, including his claim that the Georgia governor is a RINO,? or Republican in name only.",
    "I think folks see that and then they hear what Trump is saying and it just doesn't match up with reality.?\nKemp's record in office has helped earn him the support of groups that once opposed him.",
    "The former president's leadership PAC transferred $500,000 last month to a super PAC opposing Kemp's reelection, marking his political operation's first major financial foray into a midterm race.",
    "He also stumped for Perdue in person in March and, more recently, held a tele-rally for the former senator, where he warned that Kemp would drive down Republican voter turnout in November.",
    "Kemp, by comparison, has about $10.7 million in the bank, putting him on a much better financial footing in a potential match-up with Abrams, who currently has about $8 million on hand.",
    "Perdue, meanwhile, is trailing the incumbent governor by double digits; an Atlanta Journal-Constitution poll released last month showed Kemp leading Perdue by a nearly 2-to-1 margin.",
    "Casey Cagle, in 2018, the NRA endorsed Kemp late last month, praising his signing of the so-called constitutional carry law allowing residents to carry firearms without a license.",
    "In recent weeks, Kemp has received the endorsement of the National Rifle Association (NRA) and is slated to attend a fundraiser alongside former President George W. Bush.",
    "He's also been the beneficiary of some $5 million in spending by the Republican Governors Association, which has been running ads for months touting his record in office.",
    "While Trump has demonstrated the propensity to pick winners and losers in GOP primaries, the contest in Georgia may end up underscoring the limits of that ability.",
    "And I'll tell you, I don't believe the Republicans are going to go out and vote in the general election for Brian Kemp.?\nStill, Perdue is facing an uphill battle.",
    "Not only do recent polls show him badly trailing Kemp in the final weeks before primary day, but Perdue has less than $1 million left in his campaign coffers.",
    "Since taking office in early 2019, Kemp has aggressively pursued a conservative policy agenda that has largely pleased Republicans in Georgia and nationally.",
    "But we will see what happens.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Brian Kemp fends off a challenge from former Sen. David Perdue (R-Ga.), openly defying former President Trump in the state's closely watched primary.",
    "The one thing we always lose sight of because we want to focus on the Donald is the candidates themselves,? said Doug Heye, a Republican strategist.",
    "Republicans say that the decision to support Kemp in the primary is more of a practical one than an effort born out of a desire to undermine Trump.",
    "Over the past month, Kemp has notched above 50 percent in public polling, suggesting that he may be on track to win the May 24 primary outright.",
    "Likewise, the Georgia Chamber of Commerce, which sat on the sidelines in the 2018 gubernatorial election, is also supporting Kemp this year.",
    "If he falls short, it would send him into a June runoff against Perdue, potentially complicating his path to a second term in office.",
    "I think the key is: As far as a Republican governor goes, Kemp checks all the boxes,? one Georgia-based Republican strategist said.",
    "He will have to win more than 50 percent of the vote in the May 24 contest to clinch the nomination outright.",
    "Republican luminaries and groups in Georgia and across the country are making one final push to ensure Gov.",
    "Abrams, a star among Democrats both in Georgia and nationally, will also be on the ballot this year.",
    "His record on pretty much everything  guns, you know, law enforcement, taxes  it's squeaky clean.",
    "It's very hard to beat, because they have a lot of money behind them,? he said.",
    "A vote for Brian Kemp in this primary is a vote for Stacey Abrams,? he said.",
    "No Democrat is challenging her for the party's gubernatorial nomination.",
    "Brian Kemp is running as a winner and David Perdue can't,? Heye said.",
    "Trump has also sought to put his thumb on the scale for Perdue.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "After backing his main primary rival, former Lt. Gov.",
    "Kemp's victory in the primary isn't yet a given.",
    "You know, everybody is giving them money."
  ]
}