{
  "id": 3165,
  "mediaId": 65,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Georgia Secretary of State Raffensperger says media 'showed their bias' on state voting law, defends record",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a5499bd2-b923-43be-9382-d5c766d91d8d/975ad4a6-e1cb-49dd-9ea5-c774455fc5f4/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/raffensperger-georgia-media",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Rutz",
  "authorUrl": "https://www.foxnews.com/person/r/david-rutz",
  "termIds": [
    2517,
    2087,
    2203,
    2095,
    1147,
    2555,
    2672
  ],
  "sentences": [
    "He ran off a list of reforms he said had bolstered election integrity in Georgia, saying the state had accurate voter rolls, verifiable paper ballots, cross-checked registrations with other states, done a 100% citizenship audit, pushed for local prosecutions of voter fraud, investigated legal ballot-harvesting  he got subpoena power this week to find evidence on recent accusations on that front  and fought back on lawsuits challenging the Georgia voting law that created the media firestorm last year.",
    "Brian Kemp, R., last March, Georgia's new law required voter ID for absentee voting rather than relying on signature matching for verification; limited ballot drop boxes to one per county or one per 100,000 voters; shortened the absentee ballot application period to 67 days; and expanded early voting days and standardized early voting hours to a minimum of 9 a.m. to 5 p.m. and a maximum of 7 a.m. to 7 p.m.",
    "HERITAGE FOUNDATION TAKES VOTER FRAUD BATTLE STRAIGHT TO STATES: ON THE TARGET'\nWhile some more extreme accusations like Biden's claim that working people wouldn't be able to vote or the law was akin to \"Jim Crow\" received some media criticism, it was largely the subject of media and activist furor that ultimately led to Major League Baseball moving the 2021 All-Star Game out of Atlanta.",
    "EXCLUSIVE  Georgia Secretary of State Brad Raffensperger, R., said the national media \"showed their bias\" last year in the coverage of the state's election reforms, defending his record and the state's election security and integrity as he faces a primary challenger endorsed by former President Trump.",
    "REPORTER WHO FELL FOR PHARMA BRO' MARTIN SHRELI LAUNCHES SUBSTACK TO DETAIL BIZARRE RELATIONSHIP\nHe added incoming White House press secretary Karine Jean-Pierre, who also used the \"stolen\" rhetoric to describe the Georgia race and Trump's victory in 2016, shouldn't hold a \"position of authority.\"",
    "Raffensperger pushed back that there was no proof of such widespread fraud and earned himself a primary challenger in the offing, with Rep. Jody Hice, R-Ga., winning Trump's endorsement by continuing to push claims that irregularities handed the state to Democrats.",
    "MEDIA, ELON MUSK GO TO WAR AS EXPERTS GUESS NEW TWITTER CHIEF WON'T 'ADHERE BLINDLY TO LEFT-OF-CENTER DOGMAS\n\"When he is backed into a corner and called out on the mess he made, he resorts to name-calling and making false accusations,\" Hice said.",
    "Of course, Raffensperger has seen politicians from both sides of the aisle question the integrity of election results in his state, with Democrat Stacey Abrams famously not officially conceding her loss to Kemp in 2018 in the gubernatorial race.",
    "Perhaps the most well-known secretary of state in the U.S. due to Georgia's prominence in elections drama over the past four years, Raffensperger told Fox News Digital he's always \"followed the law and followed the Constitution\" in his position.",
    "Hosts like Don Lemon and Nicolle Wallace repeated the \"Jim Crow\" language used by President Biden and many Democrats and praised companies like Delta and Coca-Cola that spoke out against it under pressure from liberal activists.",
    "Trump famously pressed Raffensperger in a leaked phone call to \"find\" the number of votes necessary to put the state in his column, asserting that he had been cheated out of it through several forms of voter fraud.",
    "The legislation barred outside groups from passing out food and water to those in line, handed more election authority to the GOP-controlled state legislature and shortened runoffs from nine weeks to four.",
    "Raffensperger said \"two big lies\" cost Atlanta the All-Star Game: the notion that there were reduced early voting days, and the oft-repeated line that they'd made it illegal to hand out water in line.",
    "Trump lost Georgia, Raffensperger said, because of his campaign, noting that 28,000 Georgians didn't vote for president that year in the general election but voted straight Republican down-ticket.",
    "WEST VIRGINIA VOTERS SHARE HOW TRUMP AND MANCHIN ENDORSEMENTS INFLUENCE THEIR VOTES IN TUESDAY'S PRIMARY\n\"We had a 150-foot [zone] of no politicking, no electioneering,\" he said.",
    "The law caused a volcanic eruption in the media last year, which was framed on outlets like CNN and MSNBC as making it \"harder\" to vote and an effort at \"voter suppression.\"",
    "Marc Elias, a Democratic attorney who helped spearhead the infamous Christopher Steele dossier that helped started Russiagate, has filed a suit challenging the Georgia law.",
    "He made headlines last month when he suggested Georgians might be too confused to properly mark down their driver's license number when filling out an absentee ballot.",
    "\"The truth is this: Brad Raffensperger is 100% responsible for the disaster that was the 2020 election and for the complete lack of integrity in Georgia's elections.",
    "\"Jody Hice has been running around the state of Georgia for 18 months now lying, and point by point, everything he says is a lie,\" Raffensperger said.",
    "Kemp and Raffensperger took criticism that they spearheaded the law because of pressure from Trump's unsubstantiated claims of voter fraud in Georgia.",
    "Before that election law dust-up, though, Raffensperger came under fire from Trump and key allies after Trump narrowly lost Georgia in the 2020 race.",
    "She's frequently said since that she truly \"won\" the contest and that \"they stole it,\" although unlike Trump, she's become a national media darling.",
    "The primary is May 24, and the two are likely headed to a runoff with neither candidate likely to clear the 50-percent barrier to avoid one.",
    "Lambasted by both Trump and, indirectly, President Biden for the state's voting procedures, he holds a unique place in American politics.",
    "In a statement to Fox News Digital, Hice shot back that \"this is exactly why people believe that Brad Raffensperger is a Democrat.\"",
    "\"She's the one that really started this whole thing,\" Raffensperger said of the trend of more politicians questioning results.",
    "He also said he was working to hold Fulton County, the state's largest, accountable for its long-standing election issues.",
    "\"The national media, by and large, showed their bias, and it was all leaning on the left side of the aisle,\" he said.",
    "\"In fact, she was up in Virginia campaigning for the Democrat governor candidate [Terry McAulifffe] back in October.",
    "Our signature match rejection rate in 2020 was 11% higher for signature matching issues in 2020 than it was in 2018.",
    "\"In effect, what he's trying to do is destroy the security of the absentee ballot process,\" Raffensperger said.",
    "It's because you've been lying, Jody Hice, because you said we didn't have signature match in 2020.",
    "\"If someone said something, they never fact-checked it, said what is the actual truth about this?",
    "\"Candidates were coming within that 150-foot zone, not with their names, but with their cause.",
    "And then they were giving people water, but really saying, 'Can I count on your vote?'\"",
    "He failed to uphold the duties of his office and in turn failed the people of Georgia.",
    "By elevating the security, we're elevating, we believe, the confidence of the process.",
    "It took me three-and-a-half years to get the General Assembly to do that.\"",
    "It's not like D.C. where you write 1,000-page bills Ours is less than 100.",
    "You're going to see right there, point blank, 17 days of early voting.\"",
    "And so he says, well, voters don't have confidence in the system.",
    "Now, he's hoping it will be enough to keep him in office in 2022.",
    "If he had done his job, I wouldn't be running against him.\"",
    "\"We have accessibility, but we have security,\" he added.",
    "Fox News' Brooke Singman contributed to this report.",
    "She said just because you win doesn't mean you won.",
    "\"We now have moved absentee voting to photo I.D.",
    "That shores up security, shores up confidence.",
    "We now have photo ID for absentee voting.",
    "\"It's never supported by the facts.",
    "with your driver's license number.",
    "We've got the facts on our side.\"",
    "He ran on that platform in 2018.",
    "So she still has not conceded.\"",
    "You could have read that bill.",
    "And that's a good thing.\"",
    "It's less than 100 pages.",
    "\"We've had photo I.D.",
    "for in-person voting.",
    "Just read the bill.",
    "It's real easy.",
    "Signed by Gov.",
    "Very secure."
  ]
}