{
  "id": 3166,
  "mediaId": 151,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Mooney beats McKinley as GOP battles over future in primaries",
  "image": "https://www.politico.com/dims4/default/3361719/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F57%2Fa2%2Fdc1c4d824ba9a5fe1beef6bfa810%2Fap22127806397745.jpg",
  "link": "https://www.politico.com/news/2022/05/10/gops-primary-west-virginia-nebraska-00031616",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    812,
    1147,
    1332,
    1538,
    2095,
    2136,
    3024,
    428,
    2782,
    2969
  ],
  "sentences": [
    "| Gene J. Puskar/AP Photo\nBy Ally Mutnick and Zach Montellaro\n 05/10/2022 07:31 PM EDT\nUpdated: 05/10/2022 09:42 PM EDT\nGOP Rep. Alex Mooney defeated fellow Republican Rep. David McKinley in a West Virginia primary Tuesday night, demonstrating former President Donald Trump's kingmaking power in a rare race featuring two incumbents.",
    "McKinley tagged Mooney, a former Maryland state senator and party chair there, as a carpetbagger and attacked him over an ethics investigation, while Mooney highlighted his Trump endorsement and cast McKinley as insufficiently conservative, including for supporting the 2021 bipartisan infrastructure package.",
    "This primary is one of many throughout the month that will determine the size of the GOP's governing coalition? in a potential future majority  members who are willing to strike deals to pass legislation versus adopting a more hard-line posture.",
    "Republicans also chose a nominee to replace former Rep. Jeff Fortenberry, who resigned earlier this year after a federal jury convicted him of making false statements to investigators during a probe of his campaign financing.",
    "Trump has stood by Herbster despite the revelations in mid-April, reported by the Nebraska Examiner, that a number of women, including a sitting state senator, accused Herbster of groping or inappropriately touching them.",
    "Other House contests to watch\nDemocrats chose a nominee Tuesday to take on GOP Rep. Don Bacon in his Omaha-based swing seat: state Sen. Tony Vargas, the son of immigrants and a former public school science teacher.",
    "And Herbster, Pillen and state Sen. Brett Lindstrom have all run close in polls of the Republican primary ahead of Tuesday night, with the winner set to be heavily favored in the state's November election.",
    "For McKinley, a civil engineer who carries around an American Society of Civil Engineers report grading West Virginia's infrastructure as a D,? his yes vote on the infrastructure bill was easy.",
    "Trump's Nebraska play\nWhile Washington is focused on the federal race between McKinley and Mooney, the biggest statewide contest Tuesday is to replace the term-limited Republican Gov.",
    "Herbster  who owes at least some of his fortune to selling bull semen  has clashed with Ricketts, and the outgoing governor unsuccessfully tried to convince Trump to not back him.",
    "West Virginia Rep. Alex Mooney, Republican candidate for U.S. House, addresses a campaign rally at the Westmoreland Fair Grounds in Greensburg, Pa., Friday, May 6, 2022.",
    "Join Scott Bland, Ally Mutnick and Alex Isenstadt this Wednesday: https://politi.co/3yo43y1\nHerbster denied the allegations, and Ricketts and others condemned him.",
    "McKinley believed there would still be a political reward for bringing back federal funds for roads and bridges  despite Trump's opposition to the package.",
    "Trump threw himself into the race to replace Ricketts, the co-chair of the Republican Governors Association, by endorsing longtime ally Charles Herbster.",
    "Trump's clout, the political merits of infrastructure investment and the resuscitation of eight-year-old carpetbagging claims dominated the race.",
    "Mooney and McKinley were thrown into the same district in 2022 after West Virginia lost a congressional seat following the 2020 Census.",
    "But instead of stepping aside, Herbster ran a TV ad comparing himself to Supreme Court Justices Clarence Thomas and Brett Kavanaugh.",
    "To Mooney, a member of the House Freedom Caucus, the bill's price tag was too exorbitant and filled with too many poison pills.",
    "The race will be one of the first major tests of Trump's endorsement power in 2022, following Ohio Senate candidate J.D.",
    "Trump endorsed Mooney after McKinley backed the bipartisan infrastructure bill signed by President Joe Biden last year.",
    "GOP state Sen. Mike Flood easily won the GOP nomination  he jumped into the race even before Fortenberry bowed out.",
    "We'll hop on Twitter Spaces the day after every major primary at 12 p.m. EDT to break down the biggest takeaways.",
    "Brad Little on May 17, and Trump is heavily invested in former Sen. David Perdue's bid to knock off Georgia Gov.",
    "But Trump personally whipped against it and vowed to exact revenge on any House Republicans who supported it.",
    "It is also the first of three times this month that Trump is wading into a contested gubernatorial primary.",
    "But Mooney bet that Trump's backing  and a harder line on partisan politics  could propel him to victory.",
    "His primary victory all but ensures he will be the new member of Congress from this deep red-district.",
    "The bill received the votes of 19 GOP senators, including Sen. Shelley Moore Capito (R-W.Va.).",
    "Ricketts threw his support behind Jim Pillen, a member of the state board of regents.",
    "This is one of a handful of Republican-held seats that Biden carried in 2020.",
    "McKinley is the first member of Congress to lose reelection this year.",
    "Mooney also had support from Trump and the anti-tax Club for Growth.",
    "Trump rallied for Herbster in the runup to the primary.",
    "Janice McGeachin's primary challenge to Idaho Gov.",
    "His support for it earned him backing from Gov.",
    "Jim Justice and Democratic Sen. Joe Manchin.",
    "Vance's GOP primary win last week.",
    "Brian Kemp later this month.",
    "In the end, he was correct.",
    "Pete Ricketts in Nebraska.",
    "He endorsed Lt. Gov."
  ]
}