{
  "id": 3170,
  "mediaId": 19,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "After Nebraska Loss, Candidates Against Trump Endorsements See Hope",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1394862863-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/11/nebraska-loss-candidates-against-trump-endorsements-see-hope/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    1332,
    1147,
    1801,
    2136,
    2095,
    571,
    2816
  ],
  "sentences": [
    "While Ricketts had asked Trump not to become involved in Nebraska's race, the former president weighed in anyways, endorsing his loyalist, Herbster, in October and praising him as a tremendous supporter of America First and Make America Great Again, right from the beginning.?\nTrump doubled down and rallied for Herbster in May following allegations that surfaced in April of Herbster groping multiple women, which Herbster unequivocally denied.",
    "Other candidates with uncertain prospects at the outset of their races also prevailed with Trump's backing in Ohio, including conservative columnist Madison Gesiotto Gilbert and Max Miller, who sought to unseat impeachment voter Rep. Anthony Gonzalez before Gonzalez announced his retirement.",
    "Mooney was the farther right candidate who earned Trump's backing last year, while McKinley was more moderate and voted in favor of Democrat-led initiatives like the January 6 select committee and the $1.2 trillion infrastructure package.",
    "Former football star Herschel Walker, who is arguably a fan favorite in Georgia with or without Trump, only jumped into the Senate race after Trump urged him to do so and Trump's early backing may have helped solidify Walker's candidacy.",
    "But on April 14, less than two weeks out from the election and right after Vance saw a boost in a Trafalgar poll, Trump announced his endorsement decision and the move lit a fire under Vance's campaign just as it was building momentum.",
    "It also raises questions about how and why Trump endorsements work best, and whether Trump will endorse in some upcoming contested races he has thus far sat out like most particularly Missouri's or Arizona's U.S. Senate races.",
    "Vance once described himself as a Never Trump guy? and called Trump an idiot,? but Vance retracted his anti-Trump comments last year as he geared up for a Senate bid and then went on to run a Trump-aligned populist campaign.",
    " Tomorrow, it's back to work in the fight to keep Nebraska great.?\nUnlike in the Nebraska governor's race, Trump has seen enormous success with other candidates, some of whom have undeniably benefited from his endorsements.",
    "Pillen declared victory a few hours after polls closed, saying in a statement, Nebraska voters made it clear tonight that they value conservative leadership that represents their Christian, conservative values.",
    "Trump repeatedly and outspokenly criticizes Kemp over the 2020 election and has also made a number of other endorsements in the Peach State that align with his goal of unseating Kemp and Kemp's allies.",
    "While Trump does not appear to have any grievances with Little the way he does with Kemp, the Deseret News noted McGeachin aggressively courted Trump's endorsement while Little stayed passive.",
    "Herbster also heavily promoted Trump's endorsement, but despite the former president's involvement, Herbster ultimately came up short by about four percent, or close to 10,000 votes.",
    "But Nebraska's gubernatorial outcome indicates Trump's endorsements are fallible this midterm season, and polls suggest some of his bigger name endorsees are in danger of losing.",
    "Trump's primary record had been pristine heading into Tuesday night after seeing his endorsed candidates in the Texas, Indiana, and Ohio primaries all win or advance to runoffs.",
    "In Nebraska, two agriculture businessmen appeared as frontrunners in the gubernatorial race, Trump-backed Charles Herbster and Jim Pillen  who was endorsed by Nebraska Gov.",
    "Several other possible candidates stayed out of the Senate race as Walker has dominated, and the few who dared challenge him are not performing so well in any polling.",
    "Other Trump-backed candidates in the state, such as Rep. Jody Hice and former state Rep. Vernon Jones, could prevail but their wins do not appear guaranteed.",
    "Oz, who shares Trump's celebrity TV background, won Trump's endorsement despite several former Trump employees and MAGA devotees rallying around McCormick.",
    "Pennsylvania's Senate primary, which takes place next Tuesday, is a heated three-way battle between David McCormick, Dr. Mehmet Oz, and Kathy Barnette.",
    "But this first loss is on the books now, and that is likely to lead to others in other places strategizing how to navigate around a Trump endorsement.",
    "Herbster, a wealthy Republican donor and longtime supporter of Trump, appeared at Trump's 2015 campaign launch and donated to him in his primary.",
    "And even coming off of the evening, the former president is boasting a 581 record, albeit that number is padded with many safe incumbent wins.",
    "In West Virginia, two GOP incumbents, Reps. Alex Mooney and David McKinley, were forced into a primary faceoff because of redistricting.",
    "The Nebraska gubernatorial primary on Tuesday showed candidates endorsed by former President Donald Trump are not immune to losing.",
    "Pat McCrory off the ground in North Carolina, is now soaring in polls and is currently heavily favored to win his race next week.",
    "Despite Trump backing McGeachin last November, recent polling and betting markets give Little an outsized lead over McGeachin.",
    "After months of anticipation and public words of encouragement from Trump, Walker declared his Senate bid in late August.",
    "The contentious five-way primary meant Trump was under pressure from several directions to endorse other candidates.",
    "Each of these cases could break for the Trump endorsement, or against it, in coming weeks  it remains to be seen.",
    "Jim Justice and Democrat Sen. Joe Manchin but handily lost to Trump's candidate by nearly 20 points on Tuesday.",
    "Other prominent Trump-backed candidates in battleground states with upcoming primaries appear to be thriving.",
    "Vance's win had not been guaranteed and can be credited at least in part to the former president's influence.",
    "While Oz is ahead in recent polls, his lead is narrow and within the margins of error.",
    "Trump has invested heavily in seeing former Sen. David Perdue defeat incumbent Gov.",
    "However, Perdue is trailing Kemp by a wider and wider margin as election day nears.",
    "Rep. Ted Budd, who initially struggled to get his campaign against former Gov.",
    "Vance won his Senate primary after a last-minute endorsement from Trump.",
    "Janice McGeachin in a divisive gubernatorial primary bid against Gov.",
    "And even in cases where they lose, Trump undoubtedly helps them.",
    "In the most high-profile victory, Ohio Republican J.D.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "McKinley was backed by the once-billionaire Gov.",
    "Pete Ricketts and the powerful Ricketts family.",
    "Brian Kemp in Georgia's gubernatorial race.",
    "Follow her on Twitter at @asholiver.",
    "In Idaho, Trump is backing Lt. Gov.",
    "Brad Little."
  ]
}