{
  "id": 3174,
  "mediaId": 129,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "What We're Watching For in the Nebraska and West Virginia Primaries",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/05/10/us/elections-midterms-west-virginia-nebraska",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    819,
    1147,
    1332,
    1909,
    2095,
    2136,
    3024,
    2816,
    2969
  ],
  "sentences": [
    "I think that's insulting, it was a protest,? Mr. Mooney said to those calling it a riot or insurrection in recent interview with MetroNews' Talkline.?\nThe Republican-on-Republican blood feud developing in West Virginia is only over a single House seat, but the outcome of Tuesday's primary between Representatives David McKinley and Alex Mooney will signal the direction of a potential Republican majority in Congress: Will it be a party of governance or one purely of ideology, driven by former President Donald J. Trump?",
    "Anybody who the establishment cannot control, they are fearful of.?\nMr. Herbster, a longtime Trump ally who was with members of the Trump family during the Jan. 6, 2021, attack on the Capitol, is running against Jim Pillen, a University of Nebraska regent who is backed by the state's powerful Ricketts family political machine, and Brett Lindstrom, a youthful state senator who has consolidated support from the party's remaining moderates and Democrats.",
    "Hand counting encourages malicious actors to bribe, coerce, or infiltrate groups of poll workers tasked with hand counting the ballots.?\nRepresentative Alex Mooney, one of two Republican incumbents clashing Tuesday in a member-on-member primary in West Virginia, appears determined to distinguish himself from his opponent, Representative David McKinley, who voted to create a bipartisan commission to investigate the Jan. 6, 2021, attack on the Capitol.",
    "No matter who wins the Democratic primary, either candidate is well positioned to take on Don Bacon and his extremist policies in this Biden-won seat.?\nWhat to read\nFar-right activists associated with the QAnon conspiracy theory movement are intercepting migrant children at the southern border and collecting information about their families, based on an unfounded belief that they are falling prey to sex-trafficking rings, Miriam Jordan reports.",
    "The former president goes on to blast Mr. McKinley as a RINO?  Republican in name only?  who supported the fake infrastructure bill that wasted hundreds of billions of dollars on the Green New Deal? and Speaker Nancy Pelosi's phony narrative? on Jan. 6 that went against the interests of West Virginia.?\nA television advertisement also featuring Mr. Trump tells viewers that Mr. Mooney defended the former president from Ms. Pelosi's Jan.",
    "The Associated Press-NORC poll, conducted in December, found that nearly a third of U.S. adults agreed with the following statement: There is a group of people in this country who are trying to replace native-born Americans with immigrants who agree with their political views.? People whom the study identified as tending to engage in conspiratorial thinking? were twice as likely to agree with the statement.",
    "In reference to electronic tabulation equipment, his campaign website said: The hardware and software of these machines are not transparent and therefore should not be trusted.?\nMr. Evnen has refuted suggestions that there was voter fraud during the 2020 election, writing in a PowerPoint presentation in March that his office did not receive a single affidavit attesting to a possible breach.",
    "6 witch hunt.?\nSensing that any high-minded campaign on accomplishments was simply not going to work, Mr. McKinley has hit back at Maryland Mooney? as a carpetbagger  he once headed the Maryland Republican Party and ran for office in New Hampshire  who is under investigation by the House Ethics Committee for charges that he improperly used campaign dollars and staff for personal gain.",
    "He also played a leading role in the passage of new legislation that places new restrictions on drop boxes for absentee ballots and prohibited the acceptance of private donations to administer elections, a move enacted by several Republican states after the founder of Facebook, Mark Zuckerberg, gave nearly half a billion dollars to election offices across the country in 2020.",
    "Scott Jennings, a Republican strategist who has worked with Mitch McConnell and George W. Bush, said that with high Republican enthusiasm this year, he expected strong turnout, meaning that some voters who would normally turn out only during a presidential race  that is, when Trump is on the ticket  are likely to vote in the midterms.",
    "Neither candidate could exactly be called a moderate Republican, but Mr. McKinley thought his primary bid would be framed around his technocratic accomplishments, his support for the bipartisan infrastructure bill that was co-written by Mr. Manchin and his attentiveness to a state used to  and still in need of  federal attention.",
    "When you vote for Charles in the primary, you can give a stinging rebuke to the RINOs and sellouts and the losers who are so poorly representing your state.?\nLike Mr. Trump in the 2016 Republican presidential primary, Mr. Herbster is facing accusations that he has mistreated women and tried to use that fact to gain support.",
    "While Nebraska's Republican primaries are typically decided by conservative rural voters who are deeply loyal to Mr. Trump, Mr. Lindstrom, a wonky financial adviser, is betting his campaign on appealing to urban professionals around Omaha  where Mr. Trump lost one of the state's Electoral College votes to President Biden.",
    "In the latest challenge to a Republican secretary of state from the party's right flank, Nebraska's top election official is facing two primary foes who have sown false claims that electronic tabulation machines contributed to voter fraud in the 2020 election, and who want all ballots to be counted by hand.",
    "It spent millions on a last-ditch effort to block Mr. Trump from winning the Republican presidential nomination in 2016; Trump then said the family better be careful.?\nMr. Ricketts, who tried talking Mr. Trump out of endorsing Mr. Herbster last year, is blunt about his opposition to Mr. Herbster's bid.",
    "His 90-minute stump speech is packed with complaints about illegal immigrants, stories boasting of his business triumphs, a conspiracy theory connecting China, the coronavirus pandemic and the 2020 election, and denials of the recent accusations that he's groped women at political events.",
    "Mr. Pillen, a 66-year-old former defensive back for the University of Nebraska's football team with a grandfatherly demeanor, promised to ban critical race theory at the University of Nebraska and bar transgender women from participating in women's sports or using women's bathrooms.",
    "He begins his speeches, whether to Trump-hatted supporters in Wahoo or bankers in the Omaha suburbs, by offering greetings from the 45th president of the United States of America, Donald J. Trump.?\nLike Mr. Trump, Mr. Herbster casts doubt on the legitimacy of American elections.",
    "Redistricting and West Virginia's shrinking population forced the state's Republican Legislature to pit Mr. McKinley, a six-term Republican with a pragmatic bent, against Mr. Mooney, who has served four terms marked more by conservative rhetoric than legislative achievements.",
    "The former president sided with Mr. Mooney after Mr. McKinley voted for the infrastructure bill as well as for legislation to create a bipartisan commission to examine the Jan. 6, 2021, attack on the Capitol  legislation that was filibustered by Republicans in the Senate.",
    "The split over voting integrity among the three candidates  Bob Evnen, who is running for re-election as secretary of state, and challengers Rex Schroder and Robert J. Borer  reflects the broader tensions facing Republicans nationally over the administration of elections.",
    "In a state long known for genteel, collaborative politics and, for the last 24 years, one-party rule, Mr. Herbster's bid has cracked his party into three camps, with Trump supporters, establishment conservatives and business-friendly moderates battling for power.",
    "Across the aisle in Nebraska, Democrats are preparing to take another crack at an Omaha-based House seat  one with particular national relevance, considering it's the one congressional district in the state that gave Joe Biden an Electoral College vote in 2020.",
    "This is a proxy war between the entire Republican establishment in America against President Donald J. Trump,? Mr. Herbster, who campaigns wearing a white cowboy hat and a black vest bearing the logo of his cattle semen business, said in an interview Thursday.",
    "Allen Frederickson, the chief executive of a health care company who became a Republican to vote for Mr. Lindstrom, said electing Mr. Herbster would make it hard to recruit workers to Nebraska's booming economy, which has the nation's lowest unemployment rate.",
    "As my colleague Nicholas Confessore explained in a three-part series that analyzed 1,150 episodes of Tucker Carlson's show, it's just the latest iteration of a push to stoke fears of immigration  one that seems to be again gaining steam before the midterms.",
    "On Sunday, he traveled to Nebraska for a rally and appeared on a conference call for Herbster supporters Thursday night, where he cast Mr. Herbster's rivals as Republicans in name only.?\nCharles was a die-hard MAGA champion,? Mr. Trump said on the call.",
    "A poll looks at immigration views and a conspiracy theory\nLate last month, my colleague Jazmine Ulloa wrote about a fixation among Republican leaders and candidates on the false claim that undocumented immigrants are voting fraudulently.",
    "Mike DeWine declined to endorse a Senate candidate as he faced a primary challenge of his own, the Republican governors of Nebraska and West Virginia appear to have had few qualms about endorsing candidates overlooked by Trump.",
    "Jonathan Kott, a former spokesman and adviser to Mr. Manchin, said the Democratic senator has a genuine friendship and working relationship? with Mr. McKinley, a point Mr. Manchin made during a local radio interview last week.",
    "While they compete to be the Trumpiest and most authentically local candidates, voters could tire of the political sniping and throw their support behind Brett Lindstrom, a state senator who is the third main contender.",
    "It is only one House seat in a very particular state, but the narrative of the West Virginia race has caught the attention of a wider audience trying to divine how firmly Mr. Trump has the Republican Party in his grip.",
    "He called for ending the state's system of nonpartisan elections, eliminating the state board of education and said that, on his first day in office, he'd demand the tourism bureau change its quirky slogan: Nebraska.",
    "But the state has changed in the Trump era, and loyalties have hardened, said Scott Widmeyer, co-founder of the Stubblefield Institute for Civil Political Communications at Shepherd University in Shepherdstown, W.V.",
    "Aides close to Mr. McKinley say the race will be close, and as long as Mr. Trump does not swoop into the state at the last minute for a get-out-the-vote rally, either candidate could still win a low-turnout affair.",
    "Because whether you like it or not, they didn't want Donald J. Trump to be president for two terms, that's exactly what happened.?\nMr. Herbster has little use for or interest in the traditions of Nebraska politics.",
    "But Mr. Trump is popular in every West Virginia county, and on the power of his name, Mr. Mooney has been posting polls from national and local outfits showing him up by double digits ahead of Tuesday's primary.",
    "Eric Greitens has alarmed some Republican insiders by persisting with his bid for Senate even after his former wife accused him of abusing her and their children, the latest in a series of scandals for Greitens.",
    "But what seems to have really pushed the Democratic senator to intervene in a Republican primary was not his friendship with Mr. McKinley but his anger over Mr. Mooney's opposition to the infrastructure bill.",
    "The poll also found that 29 percent of adults were extremely? or very? concerned that U.S.-born Americans are losing economic, political and cultural influence? because of the growing immigrant population.",
    "Such worries have been elevated by the Fox News host Tucker Carlson, who has repeatedly borrowed from a racist conspiracy theory, the great replacement,? to argue that Democrats are importing supporters.",
    "One campaign official said many voters who long ago abandoned the Democrats but not their Democratic Party registration have been re-registering as independents or Republicans to vote against Mr. Mooney.",
    "Both Tony Vargas and Alisha Shelton have built their careers on helping hardworking Nebraska families get ahead,? said Johanna Warshaw, a spokeswoman for the Democratic Congressional Campaign Committee.",
    "That isn't really healthy.?\nAt a Wednesday fund-raiser for Mr. Lindstrom at an upscale Italian restaurant in Omaha, about half of the two dozen people interviewed said they voted for Mr. Biden in 2020.",
    "Ricketts, the departing governor, is term-limited, and has not only thrown his support behind a different candidate  Jim Pillen, a University of Nebraska regent  but also publicly disparaged Herbster.",
    "Later this year in Georgia, another Trump-endorsed candidate who has faced allegations of domestic violence, Herschel Walker, is running for Senate, though he does not face a competitive primary.",
    "Honestly, it's not for everyone.?\nThe question Nebraska's Republican primary voters will settle on Tuesday is whether any of that matters  or matters more than Mr. Trump's stamp of approval.",
    "Both the Pillen and the Herbster campaigns have focused on national issues of which they have little control over and they should have been more focused on state issues,? said former Gov.",
    "Our colleague Ruth Graham tells the story of Kevin Thompson, an evangelical pastor in Arkansas who parted with his church as Trump-era politics intruded on his work in disconcerting ways.",
    "He highlights cooperation with Democrats in Nebraska's unicameral legislature and, while he said he had no regrets about voting twice for Mr. Trump, said he'd prefer a new face? in 2024.",
    "But Mr. Evnen's positions on the oversight of elections apparently do not go far enough to appease those in the right wing of the Republican Party, including Mr. Schroder and Mr. Borer.",
    "A major donor for years to conservative candidates, Mr. Herbster has been abandoned by longtime political allies and seen his running mate quit his ticket to run for governor herself.",
    "These are the new Trump Republicans who came into the party with him, and these are the people least likely to care what an establishment or incumbent politician would say,? he said.",
    "governors\nBecause Nebraska and West Virginia are so deeply Republican, the winners of Tuesday's Republican primaries will be heavily favored to win in the November general election.",
    "Mr. Trump's endorsement of Mr. Herbster, a major donor to Mr. Trump's political career, isn't just the first-time candidate's top credential  it is his campaign's entire rationale.",
    "More than 8,000 Democrats and independents have switched their registration in recent weeks to have some influence on a governor's contest in an overwhelmingly Republican state.",
    "All of this is somewhat extraordinary in a state where federal largess has made politicians like the now-deceased Senator Robert C. Byrd and his protg, Mr. Manchin, folk heroes.",
    "In 2018, Kara Eastman, then an underfunded candidate backed by the progressive group Justice Democrats, defeated the district's former congressman, Brad Ashford, in the primary.",
    "Democrats, sure that Eastman was too liberal for this suburban Republican-held seat, largely ignored the district, but were surprised to see how close Eastman got to winning.",
    "I want to get rid of all of the vote counting machines,? Mr. Schroder, a business owner and entrepreneur, told the television station KHGI Nebraska TV in a recent interview.",
    "McKinley calls his Trump-backed opponent Maryland Mooney,? drawing attention to the congressman's past in the Maryland Legislature and in the Maryland Republican Party.",
    "Mr. McKinley has the backing of much of the state's power structure, including its governor, Jim Justice, and, in recent days, its Democratic senator, Joe Manchin III.",
    "The state's newly drawn district includes 19 of the 20 counties Mr. McKinley previously represented and only eight of the 17 counties in Mr. Mooney's current district.",
    "The main question is, are Nebraska primary voters going to ignore the negative attacks by Herbster and Pillen?? said Fischer, the Republican strategist in the state.",
    "In West Virginia, Governor Justice threw his support to Representative David McKinley in the state's House race after Trump had endorsed Representative Alex Mooney.",
    "Should Mr. Herbster win the Republican nomination, Mr. Ricketts will not endorse him unless he apologizes to the women he's done this to,? he said in an interview.",
    "It was timed perfectly to make sure that they could rig the elections so Mark Zuckerberg could put $400 million into the toll the last four months of the election.",
    "The Democratic primaries in Nebraska's Second Congressional District have been some of the most eventful in recent House history  even if few people have noticed.",
    "Keeping with the M? theme, Pillen has criticized his rival as Missouri Millionaire Charles Herbster,? citing reports that Herbster has a residence in Missouri.",
    "But in Nebraska and West Virginia, two of the candidates who lack support from Trump have a different asset: an endorsement from the state's current governor.",
    "I want to count paper ballots by hand at the precinct level after the polls close.?\nMr. Borer, a retired fire captain, also supports counting ballots by hand.",
    "Alex Mooney has proven he's all about Alex Mooney, but West Virginians know that David McKinley is all about us,? Mr. Manchin says in a McKinley campaign ad.",
    "He also calls Mr. Mooney a liar for suggesting that Mr. McKinley supported the far-reaching climate change and social welfare bill that Mr. Manchin killed.",
    "He had no initiative or willingness to do that.?\nBut Mr. Herbster's message resonated with Trump conservatives, and soon one of his rivals followed suit.",
    "Mr. Mooney's biggest population center, the capital in Charleston, was sent to Representative Carol Miller, the only other West Virginian in the House.",
    "Mr. Mooney, however, may have the endorsement that matters most: Mr. Trump's  in a state that gave the former president 69 percent of the vote in 2020.",
    "Mr. Evnen, 69, who is in his first term, supports a proposal that would require voters in Nebraska to present valid photo identification at the polls.",
    "The primary comes down to Tony Vargas, a state senator, and Alisha Shelton, a mental health practitioner who placed third in the 2020 Senate primary.",
    "Mr. Herbster spent Friday stumping across western Nebraska with Stephen Moore, the former Trump economic adviser who is a minor Trumpworld celebrity.",
    "Some Republicans bristled at his focus on the sort of divisive cultural issues that don't typically dominate the political conservation in the state.",
    "We need Nebraska to be an appealing state from a business perspective.?\nMr. Herbster makes little effort to appeal outside of the Trump constituency.",
    "But if Herbster loses, DuHaime said, Trump can point to the allegations against him as the culprit, rather than the waning power of his endorsement.",
    "While Herbster has the most prized asset in the primary  Trump's endorsement  he also faces the most serious questions about his personal history.",
    "Alex is the only candidate in this race that has my complete and total endorsement,? Mr. Trump says in a radio advertisement blanketing the state.",
    "On Thursday, he and Governor Justice were in the state's northern panhandle, not for a campaign rally but to visit a high-tech metal alloy plant.",
    "Hand counting of ballots is statistically less accurate than a machine count and will add weeks or months to the counting process,? he wrote.",
    "Mr. Lindstrom, a 41-year-old state senator who also played football for Nebraska, is running a campaign transported from the pre-Trump era.",
    "He campaigns on eliminating sex education in Nebraska's public schools, cracking down on illegal immigration and curbing China's influence.",
    "In a Republican primary for Senate in Nebraska in 2012, Deb Fischer won a narrow race after a bitter battle between two other candidates.",
    "He has repeatedly blamed the accusations on Mr. Ricketts, a conservative two-term incumbent who cannot run again because of term limits.",
    "Herbster has taken an approach long embraced by Trump, denying the allegations and calling them a political hit job by his detractors.",
    "Senate primary in Indiana in 2018, two of the state's congressmen engaged in a prolonged feud stemming from college decades earlier.",
    "In 2020, Eastman won again in the primary  this time with support from the Democratic establishment and with a messaging makeover.",
    "If you can win with these allegations in Nebraska, you can probably win anywhere,? said Mike DuHaime, a Republican strategist.",
    "In July, his running mate, the former state senator Theresa Thibodeau, quit the ticket and later jumped into the race herself.",
    "In the radio interview, Mr. Manchin also took a swipe at Maryland Mooney.?\nAlex came here, I think, for political opportunity.",
    "Republicans are eating their own.?\nInstitute officials invited both candidates to a debate, but only Mr. McKinley accepted.",
    " In his run for governor of Nebraska, Charles W. Herbster is doing his best imitation of former President Donald J. Trump.",
    "Today, one of the country's most reputable pollsters indicated just how widespread this view is among the American public.",
    "The results will probably decide whether acolytes of Donald Trump will be elected to Congress and state executive offices.",
    "In both West Virginia and Nebraska, the candidates endorsed by the governor have accused Trump's picks of being outsiders.",
    "We've seen heated political races, but I don't think anything has been as nasty and down and dirty as this one,? he said.",
    "Mooney's vote against the infrastructure bill shows he isn't interested in what's best for West Virginia,? Mr. Kott said.",
    "If you want to lead the state, you should get your knowledge up on policies that affect our state,? she said on Thursday.",
    "Those voters are some of Trump's most loyal followers  and some of the most wary of any other politician, Jennings said.",
    "Two women, including a Republican state senator, have publicly accused him of groping them at a political event in 2019.",
    "The style and brand that's going on in the Republican Party right now has created a lot of wedges,? Mr. Lindstrom said.",
    "Ms. McGeachin has struggled to gain traction, and Mr. Trump hasn't mentioned her since his endorsement in November.",
    "In one, Joe Biden couldn't crack 40 percent of the vote in 2020; in the other, he couldn't even get to 30 percent.",
    "Like his political role model  and chief backer  Mr. Herbster is proving to be a one-man political wrecking ball.",
    "Jim Justice of West Virginia  have publicly criticized Trump's endorsement decisions in their respective states.",
    "Then Brad Ashford crossed party lines to endorse Representative Don Bacon, a Republican who won re-election.",
    "But Mr. Trump's touch is looking less golden in other states, particularly in two-way contests for governor.",
    "Mr. Herbster is about to find out if a Trump endorsement alone is enough to win a major Republican primary.",
    "Donald Trump made similar false claims throughout his term as president, but they were repeatedly debunked.",
    "But if the messenger is more important than the message, the candidates endorsed by Trump have the edge.",
    "I think we'll all be watching the returns Tuesday night,? Mr. Widmeyer said, alluding to the author J.D.",
    "Two women, including a state senator, publicly accused him of groping them at a political event in 2019.",
    "Vance's come-from-behind victory in the Republican Senate primary in Ohio after Mr. Trump endorsed him.",
    "This will be the second week where we're watching the influence of Trump on one candidate.?\nWAHOO, Neb.",
    "That's why all the attention is on the primary,? said Sam Fischer, a Republican strategist in Nebraska.",
    "Nebraskans, we like to figure things out and solve our own problems and think for ourselves,? he said.",
    "Vance surged to the top of a crowded Republican primary after being endorsed by the former president.",
    "In West Virginia, two Republican incumbents are battling for a newly drawn congressional district.",
    "If Ohio's recent Senate primary is a guide, the three-way race is working in Mr. Herbster's favor.",
    "In Nebraska, the Republican primary for governor has become a dead heat among three candidates.",
    "Most remarkably, Mr. McKinley has turned to a Democrat, Mr. Manchin, for his closing argument.",
    "She said Mr. Herbster had little interest in anything other than trying to emulate Mr. Trump.",
    "Any allegation that was sent my way is 100 percent totally false,? he said in an interview.",
    "How voters respond to the allegations could signal  at least in Nebraska  where the G.O.P.",
    "Polling in the final days before Tuesday's vote shows the race is a three-way dead heat.",
    "In Georgia, former Senator David Perdue, Mr. Trump's choice, is lagging far behind Gov.",
    "Exhausted voters went with the little-known Mike Braun, now the state's junior senator.",
    "He also warned that counting ballots by hand would itself undermine election integrity.",
    "In Nebraska, the feud between Herbster and Pillen might have an unintended consequence.",
    "In Nebraska, Trump backed Charles Herbster, a wealthy owner of an agriculture company.",
    "It's everything,? said former Representative Lee Terry of Omaha, a Herbster supporter.",
    "Dave Heineman, a Republican who was on Mr. Herbster's payroll after leaving office.",
    "Brian Kemp in polling, leading Mr. Trump to distance himself from that campaign.",
    "Mr. Herbster has denied the claims and broadcast a TV ad slamming his accuser.",
    "They then suggested that the candidates come separately to town hall meetings.",
    "He even vows to clean up the swamp?  but he means Lincoln, the state capital.",
    "In Wahoo, he posited an outlandish theory about the former president's loss.",
    "Trumpism would impact our internal and external image as a state,? he said.",
    "On Tuesday, the power of a Trump endorsement will be put to the test again.",
    "How much do sexual misconduct allegations matter in Republican primaries?",
    "And in Missouri, where Trump has not yet made an endorsement, former Gov.",
    "I can't figure any other reason,? he told the radio host Hoppy Kercheval.",
    "A handful had switched parties to vote for Mr. Lindstrom in the primary.",
    "Pete Ricketts won the nomination with just over a quarter of the vote.)",
    "Vance, won in a crowded field, taking less than one-third of the vote.",
    "Behind all the drama is a question with resonance far beyond Nebraska.",
    "Mr. Trump's name is on Mr. Herbster's lawn signs, ads and billboards.",
    "base stands in tolerating candidates accused of mistreating women.",
    "And will Lindstrom benefit from that??\nThere would be precedent.",
    "This year, Democrats are trying again, but with a new candidate.",
    "Will Democrats' fresh start pay off in a battleground district?",
    "The allegations of groping are coming from fellow Republicans.",
    "Mr. Herbster was facing criticism well before the allegations.",
    "You guessed it: Most of the action is on the Republican side.",
    "Justice recently said he thought Trump had made a mistake.",
    "She defeated Ashford's wife, Ann Ashford, in the primary.",
    "Mr. Trump has thrown his full weight behind Mr. Herbster.",
    "Mr. McKinley entered the race at a structural advantage.",
    "Mr. Pillen downplayed Mr. Trump's influence in the race.",
    "His is built around one thing: Mr. Trump's endorsement.",
    "California will hold its primary elections next month.",
    "Two states are holding primary elections on Tuesday.",
    "Trump notched a victory in Ohio last week when J.D.",
    "Mr. Mooney is the one evincing confidence, however.",
    "He considers the groping allegations disqualifying.",
    "In Idaho, the former president has backed Lt. Gov.",
    " Leah\nIs there anything you think we're missing?",
    "Trump's endorsement battles with sitting G.O.P.",
    "The Ricketts family has feuded with Mr. Trump.",
    "The Trump-endorsed candidate for Senate, J.D.",
    "Mr. Mooney's campaign does not go for nuance.",
    "There's a lot of Trump people in Nebraska.?",
    "Janice McGeachin's challenge against Gov.",
    "(There's precedent for this in Nebraska.",
    "This is the truth,? he told supporters.",
    "Here are three races we're watching.",
    "races: The messenger or the message?",
    "Email us at onpolitics@nytimes.com.",
    "Pete Ricketts of Nebraska and Gov.",
    "He hasn't yet made an endorsement.",
    "Which is more important in G.O.P.",
    "Anything you want to see more of?",
    "Voter fraud in general is rare.",
    "The pandemic came from China.",
    "Only Mr. McKinley accepted.",
    "We'd love to hear from you.",
    "Here's what we're watching.",
    "In fact, both leaders  Gov.",
    "Unlike in Ohio, where Gov.",
    "And in another G.O.P.",
    "Eight years ago, Gov.",
    "Brad Little."
  ]
}