{
  "id": 3178,
  "mediaId": 943,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Nebraska Republicans to pick nominee for governor in bitter primary upended by groping allegations",
  "image": "",
  "link": "https://www.chicagotribune.com/nation-world/ct-aud-nw-nebraska-primary-governor-20220510-r6fwnemkcfhydolbf7zbpfoulu-story.html",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "GRANT SCHULTE",
  "authorUrl": "",
  "termIds": [
    1909,
    2136,
    3009,
    3041,
    428,
    2757,
    2816,
    2848
  ],
  "sentences": [
    "In Pennsylvania, his endorsed Senate candidate, TV's Dr. Mehmet Oz, is locked in a competitive race against former hedge fund CEO David McCormick and five others, while his candidate in North Carolina, U.S. Rep. Ted Budd, is competing in a field that includes a dozen other Republicans.",
    "Nebraska Republicans and Democrats will also pick their candidates to run for the seat previously held by Republican U.S. Rep. Jeff Fortenberry, who resigned from office and ended his reelection bid in March after he was convicted of federal corruption charges.",
    " Nebraska Republicans will pick a nominee for governor Tuesday in a bitter primary race that was upended in recent weeks after a leading candidate endorsed by former President Donald Trump was accused of groping at least eight women over the last few years.",
    "Other leading candidates include Jim Pillen, a veterinarian and hog farm owner endorsed by Ricketts, and state Sen. Brett Lindstrom, an Omaha financial adviser who gained traction recently with a surge of money and support from the city's Republican mayor.",
    "The former president backed Rep. Alex Mooney over Rep. David McKinley, who angered Trump by voting for President Joe Biden's bipartisan infrastructure package and the creation of the House committee investigating the Jan. 6 attack on the Capitol.",
    "One of the accusers, Republican state Sen. Julie Slama, said Herbster reached up her skirt and touched her inappropriately at the Douglas County Republican Party's annual Elephant Remembers dinner in 2019.",
    "State Sen. Mike Flood, a former speaker of the Nebraska Legislature, is a top contender for the Republican nomination, while state Sen. Patty Pansing Brooks is likely to win the Democratic nod.",
    "Nebraska Secretary of State Bob Evnen, a Republican, predicted that 35% of registered voters will cast ballots in the primary, the highest percentage since 2006, based on what he's seen so far.",
    "In a story last month, the Nebraska Examiner interviewed six women who claimed Herbster had groped their buttocks, outside of their clothes, during political events or beauty pageants.",
    "Flood will enter the race as a strong favorite in the Republican-heavy 1st Congressional District, which includes Lincoln, small towns and a large swath of eastern Nebraska farmland.",
    "Both Nebraska and West Virginia are holding primary elections on Tuesday night, with select races providing some measure of the former president's enduring sway with GOP voters.",
    "Trump blasted Bacon during his visit, calling him a bad guy.? The former president has criticized the three-term Republican for supporting Biden's infrastructure law.",
    "The Associated Press does not typically identify people who say they are victims of sexual assault unless they choose to come forward publicly, as Slama has done.",
    "In Nebraska, the allegations against Herbster, a longtime supporter of Trump's, didn't stop the former president from holding a rally with him earlier this month.",
    "Lindstrom has faced a barrage of attacks as well, with third-party television ads funded by Ricketts that portray him as too liberal for the conservative state.",
    "Herbster has suggested in television ads that Pillen and Ricketts conspired with Slama to falsely accuse him of sexual assault  allegations the three deny.",
    "Democrats Alisha Shelton and state Sen. Tony Vargas are running for their party's nomination as well in Nebraska's only competitive congressional district.",
    "I really think he's going to do just a fantastic job, and if I didn't feel that, I wouldn't be here,? Trump said at the rally at a racetrack outside Omaha.",
    "In the Omaha area, Republican U.S. Rep. Don Bacon faces a long-shot primary challenge from Omaha consultant Steve Kuehl in the 2nd Congressional District.",
    "A mail ad notes that Lindstrom was endorsed by U.S. Rep. Brad Ashford, a moderate Republican-turned-Democrat who died last month of brain cancer.",
    "Brian Kemp and Secretary of State Brad Raffensperger, both of whom defied him by rejecting his false claims of voter fraud in the 2020 election.",
    "In addition to the Nebraska governor's race, Trump has weighed in on a West Virginia congressional primary between two Republican incumbents.",
    "Charles Herbster, a businessman and cattle breeder who has denied the allegations, is in a nine-way GOP primary to replace Republican Gov.",
    "One digitally altered ad shows Lindstrom standing in front of a rainbow flag with a coronavirus mask superimposed over his face.",
    "Herbster filed a defamation lawsuit against Slama, saying she falsely accused him in an effort to derail his campaign.",
    "Bacon has been mildly critical of Trump in the past, saying he bore some responsibility for the Jan. 6 attack.",
    "The winner will emerge as a strong favorite in November's general election in Republican-dominated Nebraska.",
    "Trump is facing some of the biggest tests of his influence in Republican primary elections later this month.",
    "Trump stopped short of officially endorsing Kuehl, however, saying: I think Steve will do well.",
    "State Sen. Carol Blood is the top candidate for the Democratic nomination for governor.",
    "A seventh woman said Herbster once cornered her privately and kissed her forcibly.",
    "Slama responded with a countersuit against Herbster, alleging sexual battery.",
    "Pete Ricketts, who's prevented by term limit laws from running again.",
    "In Georgia, Trump has endorsed primary challengers to Gov.",
    "Good luck, Steve, whoever the hell you are.?",
    "OMAHA, Neb."
  ]
}