{
  "id": 3181,
  "mediaId": 19,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Tuesday's Nebraska Governor's Primary to Test Trump Endorsement",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1394862978-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/10/nebraska-governors-primary-test-trump-endorsement/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    906,
    1147,
    2095,
    2136,
    3010,
    588,
    2757,
    2816
  ],
  "sentences": [
    "Polls are open May 10th from 8:00AM to 8:00PM\nClick here to find your polling location: https://t.co/cCwDYF6SDH pic.twitter.com/xDvzrIoIhP\nSeveral in Trump's orbit have also rallied behind Herbster, including Trump's 2016 campaign manager Kellyanne Conway, who has been active in supporting Herbster from the outset of his campaign, as well as others such as Trump economic adviser Stephen Moore, Trump adviser Kimberly Guilfoyle, Rep. Matt Gaetz (R-FL), and CPAC chair Matt Schlapp.",
    "Meanwhile, Pillen, a University of Nebraska regent with the prominent Ricketts family in his corner, has picked up endorsements from a slew of state lawmakers, the Nebraska Farm Bureau, and personalities such as Larry the Cable Guy and the former longtime University of Nebraska football coach and former Rep. Tom Osborne.",
    "Trump, for his part, endorsed Herbster in October, praising him as having been a tremendous supporter of America First and Make America Great Again, right from the beginning.?\nHerbster's campaign took a hit in April after allegations that he inappropriately touched multiple women surfaced in the Nebraska Examiner.",
    "In another instance of Trump being at odds with the wealthy Ricketts family, Todd Ricketts, Pete Ricketts' brother, poured cash into supporting Vance's opponent Jane Timken, though Todd Ricketts told Breitbart News he had backed Timken well before Trump weighed in on the race.",
    "Herbster's campaign unequivocally? denied the allegations, calling them a political hit-piece built on 100% false and baseless claims.?\nTrump, undeterred, doubled down on his support for Herbster, holding a rally in Greenwood for him on May 1 and a tele-rally last week.",
    "Herbster is characterizing his campaign in part as a battle against Pillen and the Nebraska establishment and, evoking Trump, vows to make Nebraska great again.? His ability to prevail against Pillen, or Lindstrom, would be owed in no small part to Trump's influence.",
    "The Rickettses also donated against Trump in early 2016, but in his endorsement announcement of Herbster, Trump showed no sign of animosity, stating, It is particularly important that a great Governor (Pete Ricketts has been terrific!)",
    "Herbster, who has far outspent his opponents, has been largely self-funded, having donated to his campaign $11.5 million of the $11.8 million he has raised, according to the most recent financials reported in the Nebraska Examiner.",
    "Dr. Mehmet Oz, who shares Trump's TV celebrity background, is also in a tight seemingly three-way race in Pennsylvania, and when Trump endorsed Oz, he was met with significant backlash from some of his more prominent supporters.",
    "Spokesman John Gage told Breitbart News in no uncertain terms, We are confident Jim Pillen will be the winner on May 10th.?\nThere is no runoff in Nebraska, and the race could easily come down to a handful of votes.",
    "Herbster, an early supporter of Trump who appeared at Trump's 2015 campaign launch and donated to him in the primary, has heavily promoted the former president's endorsement as part of his campaign for governor.",
    "The latest polling, conducted April 30 to May 2 and released by the Pillen campaign, showed Pillen in first place, boasting a lead that had widened from the same polling firm's previous survey.",
    "A poll conducted in early March on behalf of Herbster by Conway's firm painted a different picture, however, showing Herbster up nine points over Pillen and ten points over Lindstrom.",
    "A closely divided primary battle occurred not too long ago, in 2014, when Ricketts defeated Jon Bruning by about one percent, or 2,300 votes, in that year's gubernatorial race.",
    "Two wealthy agriculture businessmen stand out as frontrunners in the primary: the Trump-endorsed candidate, Charles Herbster, and Jim Pillen, who is backed by Nebraska Gov.",
    "We've made it very prosperous, and I really think he's going to do just a fantastic job, and if I didn't feel that, I wouldn't be here.?\nMay 10th is Primary Election Day!",
    "Trump went 33 for 33 in Texas as his endorsees there all won or advanced to runoffs, and last week, 22 out of 22 of his candidates won their races in Ohio and Indiana.",
    "The Greenwood rally, which took place about two weeks after the misconduct allegations broke, drew thousands? of Trump supporters, according to local outlet WOWT.",
    "Trump said at the event, I think Charles is going to do very well, and if he [wins], you'll be very happy and you're gonna have an even more prosperous state.",
    "A hotly contested gubernatorial primary happening in Nebraska on Tuesday could put an end to former President Donald Trump's current primary winning streak.",
    "be elected to help fortify the State.?\nIn addition to Herbster in Nebraska, Trump faces a difficult road ahead with multiple other candidates.",
    "A third candidate, state Sen. Brett Lindstrom, is also considered a frontrunner and campaigns as the most moderate of the three candidates.",
    "While some, such as Rep. Ted Budd in North Carolina, are soaring in polls and favored to win, others may serve to test Trump's influence.",
    "Vance, who won a heated five-way primary contest after surging in momentum right as Trump endorsed him late in the election.",
    "The primary will follow Trump seeing sweeping victories for his endorsed candidates in Texas, Ohio, and Indiana.",
    "Former Sen. David Perdue, whom Trump has been highly vocal in supporting, is trailing Trump nemesis Gov.",
    "Polls will close in Nebraska on Tuesday at 8:00 p.m. Central time and 7:00 p.m. Mountain time.",
    "Pillen came in five points ahead of Herbster, at 31 percent compared to Herbster's 26 percent.",
    "But Nebraska's gubernatorial race shows signs of uncertainty for the former president.",
    "Trump is well-liked in Nebraska, a solid red state he won by nearly 20 points in 2020.",
    "In Ohio, Trump's endorsement was undoubtedly game-changing for Senate candidate J.D.",
    "Herbster received 27 percent support, Pillen 18 percent, and Lindstrom 17 percent.",
    "Brian Kemp by a wider and wider margin ahead of the May 24 primary in Georgia.",
    "The race has also been one of the most expensive state contests in history.",
    "Lindstrom received 16 percent, while 19 percent said they were undecided.",
    "Pillen has raised $8.4 million, and Lindstrom has raised $2.5 million.",
    "Nevertheless, the Pillen campaign anticipates a victory on Tuesday.",
    "A plurality of respondents, 35 percent, said they were undecided.",
    "Ricketts is term-limited this year and unable to seek reelection.",
    "Pete Ricketts (R) and the powerful Ricketts family.",
    "Get out and vote for Charles W. Herbster!"
  ]
}