{
  "id": 3184,
  "mediaId": 305,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Stacey Abrams Lands $1M Donation From George Soros",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/9ddf5d87c66548cf279ad13357a25d4d.jpg",
  "link": "https://www.theroot.com/stacey-abrams-lands-1m-donation-from-george-soros-1848901270",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Keith Reed",
  "authorUrl": "https://www.theroot.com/author/kreed3110",
  "termIds": [
    1646,
    1951,
    2095,
    2213,
    3013,
    4325,
    146,
    179,
    428,
    501,
    2672
  ],
  "sentences": [
    "The hold-up is because of a new law that Georgia's GOP-controlled General Assembly passed last year that was designed to put current Governor Brian Kemp at an early fundraising advantage, but because of lawsuits from Abrams and Kemp's Republican primary challengers, hasn't quite worked out that way.",
    "George Soros, the billionaire entrepreneur and philanthropist, is donating $1 million to Abrams' campaign, but she won't be able to spend any of the money until she's officially crowned as the Democratic nominee for the seat, reports the Atlanta Journal Constitution.",
    "Last week her campaign briefly suspended taking donations and encouraged supporters to instead give money to pro-choice organizations as the result of the leaked Supreme Court draft opinion that shows the Roe v. Wade decision is at peril of being reversed soon.",
    "The leadership committees are important tools for funding campaigns because there are limits on how much a candidate can raise from an individual or business interest that don't apply to leadership committees, so they can collect huge checks from donors.",
    "The new law allows candidates for certain offices in Georgia to set up so-called leadership committees, which are a special kind of political organization allowed to skirt the usual campaign fundraising limits and collect unlimited amounts from donors.",
    "Statewide candidates, such as those running for governor, are currently allowed to raise $7,600 from individual donors for the primary and again for the general election, plus $4,500 per runoff.",
    "From the AJC\nDavid Emadi, executive secretary of the state ethics commission, said the Abrams camp can keep the Soros contribution but not spend it until after the primary.",
    "Stacey Abrams's campaign for Georgia governor is in line for a seven-figure fundraising boost, but it has to wait a bit for the check to clear.",
    "Abrams and others, including Kemp's top GOP challenger, David Perdue, would have to wait until they officially won their party's primaries.",
    "In contrast, Kemp's leadership committee had taken checks up to $250,000 from individual donors in its first few months of operation.",
    "She lost that lawsuit but a federal judge also ruled that Kemp would have to wait to access his leadership committee funds, too.",
    "Abrams, sued, arguing that she's already the de facto Democratic nominee because she's running unopposed in the primary.",
    "As originally written, Kemp could immediately begin using his leadership because he's the gubernatorial incumbent.",
    "The voting rights organization she founded in 2018, Fair Fight Action, has since raised more than $100 million.",
    "Abrams' gubernatorial campaign raised $11.7 million in the quarter ended April 30.",
    "Abrams, as we've pointed out before, is already a fundraising juggernaut.",
    "The primary contests are scheduled for May 24."
  ]
}