{
  "id": 3186,
  "mediaId": 129,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Pennsylvania is the midterm campaigns' biggest abortion battleground.",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/05/09/us/midterms-primary-elections-nebraska",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1713,
    2095,
    3050,
    146,
    2991,
    2732,
    2791,
    2862,
    2972
  ],
  "sentences": [
    "Anybody who the establishment cannot control, they are fearful of.?\nMr. Herbster, a longtime Trump ally who was with members of the Trump family during the Jan. 6, 2021, attack on the Capitol, is running against Jim Pillen, a University of Nebraska regent who is backed by the state's powerful Ricketts family political machine, and Brett Lindstrom, a youthful state senator who has consolidated support from the party's remaining moderates and Democrats.",
    "The former president goes on to blast Mr. McKinley as a RINO?  Republican in name only?  who supported the fake infrastructure bill that wasted hundreds of billions of dollars on the Green New Deal? and Speaker Nancy Pelosi's phony narrative? on Jan. 6 that went against the interests of West Virginia.?\nA television advertisement also featuring Mr. Trump tells viewers that Mr. Mooney defended the former president from Ms. Pelosi's Jan.",
    "6 witch hunt.?\nSensing that any high-minded campaign on accomplishments was simply not going to work, Mr. McKinley has hit back at Maryland Mooney? as a carpetbagger  he once headed the Maryland Republican Party and ran for office in New Hampshire  who is under investigation by the House Ethics Committee for charges that he improperly used campaign dollars and staff for personal gain.",
    "The Republican-on-Republican blood feud developing in West Virginia is only over a single House seat, but the outcome of Tuesday's primary between Representatives David McKinley and Alex Mooney will signal the direction of a potential Republican majority in Congress: Will it be a party of governance or one purely of ideology, driven by former President Donald J. Trump?",
    "Lou Barletta, a former congressman and one of two front-runners in the race, has said he would sign any bill that comes to my desk that would protect the life of the unborn.?\nAnother top candidate, Doug Mastriano, said in a recent debate that he was opposed to any exceptions  for rape, incest or the health of the mother  in an abortion ban.",
    "The fall of Roe will make that less likely to happen.? Shavonnia Corbin-Johnson, political director of the State Democratic Party, said that the end of abortion access would add to compounding racial disparities and maternal health? for minority communities, and that the party was planning to organize aggressively around the issue.",
    "Neither candidate could exactly be called a moderate Republican, but Mr. McKinley thought his primary bid would be framed around his technocratic accomplishments, his support for the bipartisan infrastructure bill that was co-written by Mr. Manchin and his attentiveness to a state used to  and still in need of  federal attention.",
    "When you vote for Charles in the primary, you can give a stinging rebuke to the RINOs and sellouts and the losers who are so poorly representing your state.?\nLike Mr. Trump in the 2016 Republican presidential primary, Mr. Herbster is facing accusations that he has mistreated women and tried to use that fact to gain support.",
    "While Nebraska's Republican primaries are typically decided by conservative rural voters who are deeply loyal to Mr. Trump, Mr. Lindstrom, a wonky financial adviser, is betting his campaign on appealing to urban professionals around Omaha  where Mr. Trump lost one of the state's Electoral College votes to President Biden.",
    "Though there has not been any public district-level polling on the issue, 2018 data from the Public Religion Research Institute found that Hispanics in Texas are less likely than other Americans to say they believe abortion should be legal in all cases, with 53 percent saying it should be illegal in most or all cases.",
    "When we defeat the anti-choice Democrat, that's going to set the tone for the rest of the midterms that we want a pro-choice Democratic majority in power.?\nSeveral prominent left-wing lawmakers, including Representative Alexandria Ocasio-Cortez of New York, have made fund-raising appeals for Ms. Cisneros.",
    "It spent millions on a last-ditch effort to block Mr. Trump from winning the Republican presidential nomination in 2016; Trump then said the family better be careful.?\nMr. Ricketts, who tried talking Mr. Trump out of endorsing Mr. Herbster last year, is blunt about his opposition to Mr. Herbster's bid.",
    "In Hanover Township, outside Allentown, an affluent suburb in a onetime Republican enclave that has trended blue, Dave Savage and Vincent Milite, both center-right voters, were analyzing the abortion issue through the eyes of their adult daughters, while loading groceries outside a Wegmans supermarket.",
    "These voters, several of whom expressed support for abortion rights but said they would still vote for an anti-abortion congressman, revealed the uphill battle Ms. Cisneros faces as she tries to convince voters to oust a familiar political figure whose family has long been a fixture in the community.",
    "That reminds me every time I fill up, I want a change.?\nPennsylvania's large Roman Catholic population  about one in five adults  has afforded electoral space for a tradition of anti-abortion Democratic officials, including Senator Bob Casey Jr., and his father, Bob Casey Sr., who served as governor.",
    "Never!?\nPennsylvania, one of a handful of states where abortion access hangs in the balance with midterm elections this year, is a test case of the political power of the issue in a post-Roe world, offering a look at whether it will motivate party bases or can be a wedge for suburban independents.",
    "We're really at a moment where people are fired up and they know how much they are at risk of losing,? said Kristin Ford, the vice president of communications and research at the abortion rights group NARAL Pro-Choice America, which has sent organizers to Laredo to campaign for Ms. Cisneros.",
    "On that issue alone.?\nLinda Ward, also a Republican, said the state's current law allowing abortion up to 24 weeks was reasonable.?\nBut Ms. Ward said she would vote for a Republican for governor, even though all the leading candidates vowed to sign legislation sharply restricting abortion.",
    "His 90-minute stump speech is packed with complaints about illegal immigrants, stories boasting of his business triumphs, a conspiracy theory connecting China, the coronavirus pandemic and the 2020 election, and denials of the recent accusations that he's groped women at political events.",
    "Mr. Pillen, a 66-year-old former defensive back for the University of Nebraska's football team with a grandfatherly demeanor, promised to ban critical race theory at the University of Nebraska and bar transgender women from participating in women's sports or using women's bathrooms.",
    "He begins his speeches, whether to Trump-hatted supporters in Wahoo or bankers in the Omaha suburbs, by offering greetings from the 45th president of the United States of America, Donald J. Trump.?\nLike Mr. Trump, Mr. Herbster casts doubt on the legitimacy of American elections.",
    "Redistricting and West Virginia's shrinking population forced the state's Republican Legislature to pit Mr. McKinley, a six-term Republican with a pragmatic bent, against Mr. Mooney, who has served four terms marked more by conservative rhetoric than legislative achievements.",
    "Every one of my opponents would sign it into law, and I would veto it.?\nMr. Shapiro, the state's attorney general, has been primarily known for defeating multiple cases brought by supporters of Donald J. Trump claiming fraud after he lost Pennsylvania by 80,000 votes in 2020.",
    "Asked how the leaked draft Supreme Court opinion overturning Roe v. Wade might change the runoff, Gilberto Hinojosa, the chairman of the Texas Democratic Party, sounded skeptical that it would fundamentally alter the dynamics of the contest, as some advocates have predicted.",
    "My position is, I don't have a vagina so I have no skin in the game.?\nMr. Milite read aloud a text between his two daughters, abortion-rights supporters, in reaction to a Facebook post by a cousin who wrote sharply of her opposition to abortion after the Supreme Court leak.",
    "When the government forces women to have children too young, bring children into unloving households, born to mothers who don't love themselves, they get into a bad cycle.?\nJames Dobbins reported from Laredo, Jennifer Medina from Los Angeles and Katie Glueck from New York.",
    "The former president sided with Mr. Mooney after Mr. McKinley voted for the infrastructure bill as well as for legislation to create a bipartisan commission to examine the Jan. 6, 2021, attack on the Capitol  legislation that was filibustered by Republicans in the Senate.",
    "Nixon High School in the 1970s, and has voted for the congressman in every election since he first ran in 2006.\nHe's doing his job,? said Mr. Gomez, an antique store owner, adding that although he is Catholic and opposed to abortion, the issue does not determine his vote.",
    "Dr. Enrique Benavides III, a 51-year-old obstetrician-gynecologist who manages a women's health clinic with his father in Laredo, said that typically when patients request abortions, he gives them information about a clinic in San Antonio, more than a two-hour drive away.",
    "In a state long known for genteel, collaborative politics and, for the last 24 years, one-party rule, Mr. Herbster's bid has cracked his party into three camps, with Trump supporters, establishment conservatives and business-friendly moderates battling for power.",
    "This is a proxy war between the entire Republican establishment in America against President Donald J. Trump,? Mr. Herbster, who campaigns wearing a white cowboy hat and a black vest bearing the logo of his cattle semen business, said in an interview Thursday.",
    "Allen Frederickson, the chief executive of a health care company who became a Republican to vote for Mr. Lindstrom, said electing Mr. Herbster would make it hard to recruit workers to Nebraska's booming economy, which has the nation's lowest unemployment rate.",
    "Before this week's leaked Supreme Court opinion, abortion had not been the central issue in the primary campaign, though several national abortion rights groups had invested heavily in the district, focusing on the new state abortion restrictions in Texas.",
    "Democrats across the country hope the leaked draft Supreme Court opinion overturning Roe v. Wade will help galvanize their voters in the midterm elections, potentially rallying support for the party in a year that is widely expected to benefit Republicans.",
    "And several national Democratic leaders who have publicly made fiery vows to maintain abortion rights are nonetheless standing behind Mr. Cuellar, with some warning that a win for Ms. Cisneros later this month could give Republicans an edge in November.",
    "On Sunday, he traveled to Nebraska for a rally and appeared on a conference call for Herbster supporters Thursday night, where he cast Mr. Herbster's rivals as Republicans in name only.?\nCharles was a die-hard MAGA champion,? Mr. Trump said on the call.",
    "And during a recent virtual fund-raiser for Ms. Cisneros, Ms. Warren, speaking of Mr. Cuellar, said, When it comes to reproductive rights, Henry's got a record that makes my blood boil,? according to prepared remarks obtained by The New York Times.",
    "Gallup's Values and Beliefs poll last year found that low-income voters are also more likely to identify themselves as pro life,? a trend that has held steady for several years and could be a factor in Mr. Cuellar's largely working-class district.",
    "Mr. Clyburn's visit, which had been announced before the leaked opinion, put him in an awkward spotlight  supporting the only Democrat to vote against the Women's Health Protection Act, a bill that would have codified Roe v. Wade into law.",
    "But one of the first tests of just how much the issue will motivate Democratic voters will come in a primary runoff at the end of May, in the South Texas district held by Mr. Cuellar where conservative Democrats have regularly succeeded.",
    "HANOVER TOWNSHIP, Pa.  Jan Downey, who calls herself a Catholic Republican,? is so unhappy about the Supreme Court's likely reversal of abortion rights that she is leaning toward voting for a Democrat for Pennsylvania governor this year.",
    "After a draft of a Supreme Court opinion that would end the constitutional guarantee of abortion rights was leaked last week, Republicans downplayed the issue, shifting attention instead to the leak itself and away from its substance.",
    "They also argued that voters' attentions were fleeting, that abortion was hardly a silver bullet for Democratic apathy and that more pressing issues  inflation and President Biden's unpopularity  had already cast the midterm die.",
    "I think it's going to hurt the Republican Party.?\nLAREDO, Texas  When Representative Henry Cuellar stepped onstage at a campaign rally in San Antonio this week, he spoke of education, health care and his experience in Congress.",
    "Jonathan Kott, a former spokesman and adviser to Mr. Manchin, said the Democratic senator has a genuine friendship and working relationship? with Mr. McKinley, a point Mr. Manchin made during a local radio interview last week.",
    "It is a heavily Latino district that includes the border city of Laredo and parts of San Antonio, where Catholicism dominates, and where, as Mr. Cuellar showed from the stage, the subject of abortion often goes undiscussed.",
    "Mr. Cuellar, the most staunchly anti-abortion Democrat in the House, will face a primary runoff later this month against Jessica Cisneros, a 28-year-old immigration lawyer and a progressive supporter of abortion rights.",
    "It is only one House seat in a very particular state, but the narrative of the West Virginia race has caught the attention of a wider audience trying to divine how firmly Mr. Trump has the Republican Party in his grip.",
    "He called for ending the state's system of nonpartisan elections, eliminating the state board of education and said that, on his first day in office, he'd demand the tourism bureau change its quirky slogan: Nebraska.",
    "But the state has changed in the Trump era, and loyalties have hardened, said Scott Widmeyer, co-founder of the Stubblefield Institute for Civil Political Communications at Shepherd University in Shepherdstown, W.V.",
    "Aides close to Mr. McKinley say the race will be close, and as long as Mr. Trump does not swoop into the state at the last minute for a get-out-the-vote rally, either candidate could still win a low-turnout affair.",
    "Because whether you like it or not, they didn't want Donald J. Trump to be president for two terms, that's exactly what happened.?\nMr. Herbster has little use for or interest in the traditions of Nebraska politics.",
    "But Mr. Trump is popular in every West Virginia county, and on the power of his name, Mr. Mooney has been posting polls from national and local outfits showing him up by double digits ahead of Tuesday's primary.",
    "But what seems to have really pushed the Democratic senator to intervene in a Republican primary was not his friendship with Mr. McKinley but his anger over Mr. Mooney's opposition to the infrastructure bill.",
    "One campaign official said many voters who long ago abandoned the Democrats but not their Democratic Party registration have been re-registering as independents or Republicans to vote against Mr. Mooney.",
    "But in a poll from the Texas Politics Project at the University of Texas at Austin released last June, 54 percent of Hispanics said they were opposed to a ban on abortion if Roe v. Wade was overturned.",
    "That isn't really healthy.?\nAt a Wednesday fund-raiser for Mr. Lindstrom at an upscale Italian restaurant in Omaha, about half of the two dozen people interviewed said they voted for Mr. Biden in 2020.",
    "With Trump no longer aggravating suburban voters every week, Republicans were hoping to regain traction in the Philadelphia suburbs in 2022,? said J.J. Balaban, a Democratic strategist in the state.",
    "Cuellar is the best choice because he's not someone you can just brush off.?\nTexas' 28th Congressional District stretches from the Mexican border to San Antonio, and Laredo is its political center.",
    "I expect that level of concern, of fear, of worry, of anger is going to continue.?\nAll four of the top Republicans heading into the primary on May 17 have said they favor strict abortion bans.",
    "Honestly, it's not for everyone.?\nThe question Nebraska's Republican primary voters will settle on Tuesday is whether any of that matters  or matters more than Mr. Trump's stamp of approval.",
    "A law that the senior Casey pushed through the legislature in the 1980s included some abortion restrictions, which was challenged in the 1992 Supreme Court case Planned Parenthood v. Casey.",
    "Even among Democrats, support for abortion rights may not uniformly motivate voters, particularly working-class Latinos  a demographic that has shown signs of drifting away from the party.",
    "There must be exceptions in the case of rape, incest and danger to the life of the mother.?\nMr. Cuellar has repeatedly insisted that his stance mirrors the views of voters in the district.",
    "Both the Pillen and the Herbster campaigns have focused on national issues of which they have little control over and they should have been more focused on state issues,? said former Gov.",
    "When Mr. Shapiro began his campaign last year, he focused on voting rights, but he said in an interview last week that he expected the general election to become a referendum on abortion.",
    "In four states with politically divided governments and elections for governor this year  Pennsylvania, Michigan, Wisconsin and Kansas  the issue is expected to be a fulcrum of campaigns.",
    "He highlights cooperation with Democrats in Nebraska's unicameral legislature and, while he said he had no regrets about voting twice for Mr. Trump, said he'd prefer a new face? in 2024.",
    "South Texas, he said, is a different place.?\nAngie Martinez, a 40-year-old bartender, said that while she supports abortion rights, it will not prevent her from voting for Mr. Cuellar.",
    "A major donor for years to conservative candidates, Mr. Herbster has been abandoned by longtime political allies and seen his running mate quit his ticket to run for governor herself.",
    "Mr. Clyburn defended the incumbent, saying Democrats are a big-tent party.?\nI don't believe we ought to have a litmus test in the Democratic Party,? he told reporters in San Antonio.",
    "raided Mr. Cuellar's Laredo home as part of an ongoing investigation that appears to be linked to an inquiry into the political influence of Azerbaijan, the former Soviet republic.",
    "Mr. Trump's endorsement of Mr. Herbster, a major donor to Mr. Trump's political career, isn't just the first-time candidate's top credential  it is his campaign's entire rationale.",
    "Earlier this week, Senator Elizabeth Warren of Massachusetts, one of Ms. Cisneros's most prominent backers, used an appearance on MSNBC to make a full-throated fund-raising pitch.",
    "A broad middle group, 53 percent, said abortion should be legal under certain circumstances.?\nThe issue had not ranked high among the state's voters before the Supreme Court leak.",
    "The legislature is going to put a bill on the desk of the next governor to ban abortion,? said Josh Shapiro, a Democrat running unopposed for the party's nomination for governor.",
    "All of this is somewhat extraordinary in a state where federal largess has made politicians like the now-deceased Senator Robert C. Byrd and his protg, Mr. Manchin, folk heroes.",
    "More than 8,000 Democrats and independents have switched their registration in recent weeks to have some influence on a governor's contest in an overwhelmingly Republican state.",
    "We have to bring as many people into the party as we possibly can.?\nMr. Cuellar also has the support of Nancy Pelosi, the House Speaker, and Steny Hoyer, the majority leader.",
    "Pennsylvania, which has a conservative Republican-led legislature and a term-limited Democratic governor, is the only one of the four states with an open seat for governor.",
    "I don't have any kids, and I don't plan on having any yet, but if I was in a situation that required me to, I should be able to? choose the fate of a pregnancy, she said.",
    "In Michigan and Wisconsin, which have anti-abortion laws on the books predating Roe, Democratic governors and attorneys general have vowed to block their implementation.",
    "He frequently touts their endorsements, leaving many progressives privately grumbling that party leaders' promises to fight for abortion rights in Congress ring hollow.",
    "Mr. McKinley has the backing of much of the state's power structure, including its governor, Jim Justice, and, in recent days, its Democratic senator, Joe Manchin III.",
    "Just two days after the draft opinion was leaked, Mr. Cuellar campaigned alongside Representative James E. Clyburn, the House majority whip and third-ranking Democrat.",
    "The state's newly drawn district includes 19 of the 20 counties Mr. McKinley previously represented and only eight of the 17 counties in Mr. Mooney's current district.",
    "In a Monmouth University poll last month, abortion was cited as one of Pennsylvania voters' top two issues by just 5 percent of Democrats and 3 percent of Republicans.",
    "Mr. Savage, 63, said that his 30-year-old daughter felt strongly that abortion should be legal, and that therefore it would be an important issue for him in November.",
    "A working-class city, it has been a Democratic stronghold for decades but remains culturally conservative, with residents who fill Catholic church pews on Sundays.",
    "But supporters of Mr. Cuellar and some local Democratic officials say the district's voters, who lean socially conservative, are unlikely to be moved by the issue.",
    "Democrats are worried, in Pennsylvania and around the country, that their 2020 coalition lacks motivation this year after expelling Mr. Trump from the White House.",
    "Should Mr. Herbster win the Republican nomination, Mr. Ricketts will not endorse him unless he apologizes to the women he's done this to,? he said in an interview.",
    "It was timed perfectly to make sure that they could rig the elections so Mark Zuckerberg could put $400 million into the toll the last four months of the election.",
    "Speaking from Philadelphia after a road trip from his home in western Pennsylvania, Mr. Gleason said: I stopped on the turnpike and paid $5.40 a gallon for gas.",
    "There were so many people that thought that this could never happen.?\nIf Roe v. Wade is overturned, the power to regulate abortion would return to the states.",
    "Alex Mooney has proven he's all about Alex Mooney, but West Virginians know that David McKinley is all about us,? Mr. Manchin says in a McKinley campaign ad.",
    "Soleil Hartwell, 19, who works in a big-box store near Bethlehem, is typical of voters who drop off in midterm elections after voting in presidential years.",
    "In interviews with nearly a dozen men and women in Laredo, most said they would support Mr. Cuellar in spite of  or even because of  his stance on abortion.",
    "Democratic operatives hope abortion will keep those independent voters  who have since swung against the president in polls  from defecting to Republicans.",
    "Mr. Mastriano, a state senator, has introduced a bill in Harrisburg to ban abortions after a fetal heartbeat? is detected, at about six weeks of pregnancy.",
    "He also calls Mr. Mooney a liar for suggesting that Mr. McKinley supported the far-reaching climate change and social welfare bill that Mr. Manchin killed.",
    "Ms. Cisneros first challenged Mr. Cuellar in 2020, when she lost the Democratic primary by 4 percentage points, and quickly made plans to pursue a rematch.",
    "He had no initiative or willingness to do that.?\nBut Mr. Herbster's message resonated with Trump conservatives, and soon one of his rivals followed suit.",
    "Still, support for abortion rights in Pennsylvania has gradually increased, according to polling by Franklin & Marshall College over more than a decade.",
    "Mr. Mooney, however, may have the endorsement that matters most: Mr. Trump's  in a state that gave the former president 69 percent of the vote in 2020.",
    "Mr. Mooney's biggest population center, the capital in Charleston, was sent to Representative Carol Miller, the only other West Virginian in the House.",
    "Some Republicans bristled at his focus on the sort of divisive cultural issues that don't typically dominate the political conservation in the state.",
    "We need Nebraska to be an appealing state from a business perspective.?\nMr. Herbster makes little effort to appeal outside of the Trump constituency.",
    "Mr. Herbster spent Friday stumping across western Nebraska with Stephen Moore, the former Trump economic adviser who is a minor Trumpworld celebrity.",
    "I'm going to be talking about rights  from voting rights to reproductive rights  until the polls close at 8 p.m. on Election Day,? Mr. Shapiro said.",
    "Many describe themselves as apolitical, and said they are more focused on making ends meet than staking out positions on partisan political issues.",
    "Alex is the only candidate in this race that has my complete and total endorsement,? Mr. Trump says in a radio advertisement blanketing the state.",
    "Until the focus on abortion was renewed this week, the runoff had been a mostly sleepy affair, with observers predicting an extremely low turnout.",
    "On Thursday, he and Governor Justice were in the state's northern panhandle, not for a campaign rally but to visit a high-tech metal alloy plant.",
    "But as Mr. Cuellar, a nine-term Democratic congressman, faces his toughest re-election challenge yet, one word did not escape his lips: abortion.",
    "Ms. Cisneros argues that the district is not nearly as conservative as Mr. Cuellar and his backers suggest, and that attitudes are changing.",
    "He campaigns on eliminating sex education in Nebraska's public schools, cracking down on illegal immigration and curbing China's influence.",
    "Mr. Lindstrom, a 41-year-old state senator who also played football for Nebraska, is running a campaign transported from the pre-Trump era.",
    "He rejected the notion that voters, whose attention spans can be short, will absorb a major Supreme Court reversal and move on by the fall.",
    "If abortion ends, it's OK. Women go to Nuevo Laredo for abortions,? she said, referring to the Mexican city across the border from Laredo.",
    "He has repeatedly blamed the accusations on Mr. Ricketts, a conservative two-term incumbent who cannot run again because of term limits.",
    "Now, Ms. Cisneros and her supporters have moved to use the threat to abortion rights as a primary motivator for both voters and donors.",
    "Abortion rights advocates believe the Supreme Court's draft ruling will shake up the race, providing a helpful jolt for Ms. Cisneros.",
    "I'm a Republican because this county was always Republican.?\nHe said he was undecided about whom to support in this month's primary.",
    "The leaked draft of the court's opinion last week, written by Justice Samuel Alito, would overturn the Casey ruling along with Roe.",
    "Ms. Cisneros did not run a television advertisement on the issue until late last month, according to AdImpact, an ad tracking firm.",
    "In the radio interview, Mr. Manchin also took a swipe at Maryland Mooney.?\nAlex came here, I think, for political opportunity.",
    "In July, his running mate, the former state senator Theresa Thibodeau, quit the ticket and later jumped into the race herself.",
    "A retired municipal employee, Mr. Savage said he was an independent voter but had primarily voted Republican most of his life.",
    "Last month, 31 percent of registered voters said abortion should be legal in all circumstances, up from 18 percent in 2009.",
    "Republicans are eating their own.?\nInstitute officials invited both candidates to a debate, but only Mr. McKinley accepted.",
    "But several Texas Democratic officials cautioned against the idea that an intense focus on abortion would reshape the race.",
    " In his run for governor of Nebraska, Charles W. Herbster is doing his best imitation of former President Donald J. Trump.",
    "Mooney's vote against the infrastructure bill shows he isn't interested in what's best for West Virginia,? Mr. Kott said.",
    "We've seen heated political races, but I don't think anything has been as nasty and down and dirty as this one,? he said.",
    "If you want to lead the state, you should get your knowledge up on policies that affect our state,? she said on Thursday.",
    "The style and brand that's going on in the Republican Party right now has created a lot of wedges,? Mr. Lindstrom said.",
    "In March, Ms. Cisneros fell less than 1,000 votes short of Mr. Cuellar's total, forcing the two into the May 24 runoff.",
    "But Maxine Rebeles, a 39-year-old middle school writing teacher, said she is eager to see Mr. Cuellar out of office.",
    "Ms. McGeachin has struggled to gain traction, and Mr. Trump hasn't mentioned her since his endorsement in November.",
    "Another Republican bill would require death certificates and a burial or cremation after miscarriages or abortions.",
    "After what's happened this past year, I will never vote for a Democrat,? said Ms. Ward, a retired church employee.",
    "Like his political role model  and chief backer  Mr. Herbster is proving to be a one-man political wrecking ball.",
    "What's going to happen is, you're going to lose a lot of Republican votes? over abortion, Mr. Milite predicted.",
    "Those calling for abortion to be illegal in all circumstances declined to 16 percent, from 22 percent in 2009.",
    "The court upheld most of the state's restrictions, while affirming Roe v. Wade's grant of a right to abortion.",
    "Kansas voters face a referendum in August on codifying that the state constitution does not protect abortion.",
    "As many as 28 states are likely to ban or tightly restrict abortion, according to a New York Times analysis.",
    "But Mr. Trump's touch is looking less golden in other states, particularly in two-way contests for governor.",
    "Mr. Herbster is about to find out if a Trump endorsement alone is enough to win a major Republican primary.",
    "People are happy with the guy,? she said, adding that he had helped bring more funding into the district.",
    "I think we'll all be watching the returns Tuesday night,? Mr. Widmeyer said, alluding to the author J.D.",
    "Two women, including a state senator, publicly accused him of groping them at a political event in 2019.",
    "Vance's come-from-behind victory in the Republican Senate primary in Ohio after Mr. Trump endorsed him.",
    "This will be the second week where we're watching the influence of Trump on one candidate.?\nWAHOO, Neb.",
    "It was suburbanites, especially outside Philadelphia, who gave Mr. Biden his winning edge in the state.",
    "Nebraskans, we like to figure things out and solve our own problems and think for ourselves,? he said.",
    "His campaign said it had its best day of fund-raising after the Supreme Court draft leaked last week.",
    "Democrats here are very different than those on the coasts, very Catholic and conservative,? he said.",
    "Their people are depressed,? said Rob Gleason, a former chair of the Pennsylvania Republican Party.",
    "Come November, he would not support a candidate for governor who opposed abortion rights, he said.",
    "If Ohio's recent Senate primary is a guide, the three-way race is working in Mr. Herbster's favor.",
    "Mr. Cuellar, who declined to comment for this article, has long defended his anti-abortion stance.",
    "I would never have an abortion, but I don't have the right to tell? others what to do, she wrote.",
    "These are terrifying times,? said Nancy Patton Mills, chair of the Pennsylvania Democratic Party.",
    "Dr. Benavides described himself as a pro-choice Catholic Democrat who will vote for Mr. Cuellar.",
    "The listlessness extends to Black, Latino and younger voters, as well as suburban swing voters.",
    "Most remarkably, Mr. McKinley has turned to a Democrat, Mr. Manchin, for his closing argument.",
    "She said Mr. Herbster had little interest in anything other than trying to emulate Mr. Trump.",
    "Any allegation that was sent my way is 100 percent totally false,? he said in an interview.",
    "Polling in the final days before Tuesday's vote shows the race is a three-way dead heat.",
    "In Georgia, former Senator David Perdue, Mr. Trump's choice, is lagging far behind Gov.",
    "As a lifelong Catholic, I have always been pro-life,? he said in a statement this week.",
    "It's everything,? said former Representative Lee Terry of Omaha, a Herbster supporter.",
    "Dave Heineman, a Republican who was on Mr. Herbster's payroll after leaving office.",
    "As a Catholic, I do not support abortion, however, we cannot have an outright ban.",
    "If you're mad when you listen to this, send Jessica Cisneros ten bucks,? she said.",
    "He doesn't protect our water, and he doesn't protect our women,? Ms. Rebeles said.",
    "Mr. Milite, a supervisor in municipal government, said he supported his daughters.",
    "Republicans are deeply skeptical that abortion can reanimate the Democratic base.",
    "Brian Kemp in polling, leading Mr. Trump to distance himself from that campaign.",
    "Mr. Herbster has denied the claims and broadcast a TV ad slamming his accuser.",
    "They then suggested that the candidates come separately to town hall meetings.",
    "I unfollowed her immediately,? one of Mr. Milite's daughters texted the other.",
    "She is disgusted with inflation, mask mandates and woke philosophy,? she said.",
    "He even vows to clean up the swamp?  but he means Lincoln, the state capital.",
    "In Wahoo, he posited an outlandish theory about the former president's loss.",
    "Trumpism would impact our internal and external image as a state,? he said.",
    "Hector Gomez, 67, has known Mr. Cuellar since they were classmates at J.W.",
    "But Ms. Hartwell said she would vote this year to protect abortion rights.",
    "I can't figure any other reason,? he told the radio host Hoppy Kercheval.",
    "A handful had switched parties to vote for Mr. Lindstrom in the primary.",
    "Pete Ricketts won the nomination with just over a quarter of the vote.)",
    "Vance, won in a crowded field, taking less than one-third of the vote.",
    "Behind all the drama is a question with resonance far beyond Nebraska.",
    "Mr. Trump's name is on Mr. Herbster's lawn signs, ads and billboards.",
    "The allegations of groping are coming from fellow Republicans.",
    "Mr. Herbster was facing criticism well before the allegations.",
    "This ignited the urgency,? she said in an interview on Friday.",
    "I'm a Republican, but I'm a moderate Republican,? he said.",
    "His vote in the general election also seemed up for grabs.",
    "Mr. Trump has thrown his full weight behind Mr. Herbster.",
    "Mr. McKinley entered the race at a structural advantage.",
    "Inflation topped the concerns of voters in both parties.",
    "His is built around one thing: Mr. Trump's endorsement.",
    "Mr. Mooney is the one evincing confidence, however.",
    "He considers the groping allegations disqualifying.",
    "In Idaho, the former president has backed Lt. Gov.",
    "Nothing's going to be able to save them this year.",
    "The Ricketts family has feuded with Mr. Trump.",
    "The Trump-endorsed candidate for Senate, J.D.",
    "Mr. Mooney's campaign does not go for nuance.",
    "To Democrats, this time really is different.",
    "There's a lot of Trump people in Nebraska.?",
    "Janice McGeachin's challenge against Gov.",
    "(There's precedent for this in Nebraska.",
    "This is the truth,? he told supporters.",
    "People are very concerned about this.",
    "He hasn't yet made an endorsement.",
    "The pandemic came from China.",
    "Earlier this year, the F.B.I.",
    "Only Mr. McKinley accepted.",
    "Absolutely,? she said.",
    "Eight years ago, Gov.",
    "Brad Little.",
    "Mr."
  ]
}