{
  "id": 3188,
  "mediaId": 136,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Trump's Incredible GOP Primary Run at Risk With Charles Herbster: Polls",
  "image": "https://d.newsweek.com/en/full/2033962/charles-herbster-speaks-during-rally.webp?w=790&f=ec4989066db9a59898293f799446ec25",
  "link": "https://www.newsweek.com/trump-nebraska-gop-primary-charles-herbster-1704763",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    1147,
    1646,
    1801,
    1909,
    2095,
    4325,
    428,
    571,
    2555,
    2816
  ],
  "sentences": [
    "Trump has also been met with criticism in the Senate primary in Pennsylvania for backing celebrity heart surgeon Dr. Mehmet Oz, who has been unable to make significant inroads in any survey ahead of former hedge fund CEO David McCormick or political commentator and author Kathy Barnette.",
    "\"Despite Donald Trump traveling to Nebraska on Sunday to rally support for businessman Charles Herbster, Jim Pillen leads the way in the betting for the Republican primary Nebraska gubernatorial race,\" Betfair Spokesperson Sam Rosbottom told Newsweek.",
    "Fast forward nearly two months, a WPA Intelligence survey conducted between April 30 and May 2 shows that Pillen is holding a 5 percent lead over second place Herbster (31 percent to 26 percent), with Lindstrom behind in third place on 16 percent.",
    "Charles Herbster, who Trump endorsed to be the state's next governor last October, has seen his popularity decrease in the polls since he was accused of sexual assault by several women, which the agricultural businessman denies.",
    "Donald Trump's knack for endorsing primary candidates who go on to win their respective elections may come to an end on Tuesday, with polls and bookmakers suggesting his pick in the Nebraska gubernatorial race will lose.",
    "But, according to a number of polls conducted after the allegations first were revealed by the Nebraska Examiner in mid-April, Herbster has now fallen behind to businessman Jim Pillen ahead of the primary vote on May 10.",
    "On Friday, a number of Trump supporters booed and were seen turning their back on Oz when the former president introduced his candidate at a campaign rally at the Westmoreland Fairgrounds in Greensburg.",
    "The sexual assault allegations against Herbster have not only appeared to have an influence on voters, but may also end Trump's run of his endorsed candidates winning their elections.",
    "Vance went from third in the polls to being the clear winner after the former president intervened and declared the Hillbilly Elegy author his choice in the tightly contested race.",
    "Trump's success in picking winners in Ohio and Indiana followed the Texas primaries in March in which all 33 of his endorsed candidates won outright or were advanced into a runoff.",
    "However, Perdue has frequently been behind in the polls to Kemp, with a recent InsiderAdvantage/FOX 5 Atlanta poll putting Kemp on 54 percent, compared to 38 percent for Perdue.",
    "Just a few days earlier, another WPA survey found that Pillen was just ahead of Herbster24 percent to 23 percentwith Lindstrom at 20 percent, and 24 percent of voters undecided.",
    "On the eve of the voters going to the polls in the Nebrsaka GOP gubernatorial primary, bookmakers have ruled that Pillen is the favorite to be declared the winning candidate.",
    "In March, Herbster held a 9 percent lead over Pillen in a KAConsulting LLC survey and a 10 percent lead over fellow GOP primary candidate, Senator Brett Lindstrom.",
    "A total of 55 candidates that Trump has backed in Republican primaries in Ohio, Indiana and Texas have all either won their races or advanced to runoff elections.",
    "In the May 24 Republican gubernatorial primary in Georgia, Trump is backing former Senator David Perdue over incumbent Governor Brian Kemp.",
    "It is not just Herbster who may lose their upcoming election despite getting the highly sought after Trump endorsement.",
    "According to Betfair, Pillen's odds of winning the race are 5/4, followed by Herbster at 7/4 and Lindstrom on 5/2.",
    "On May 3, all 22 of Trump's endorsed candidates in the Ohio and Indiana primaries went on to win their races.",
    "This includes the Senate GOP primary, where Trump's choice J.D."
  ]
}