{
  "id": 3201,
  "mediaId": 65,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "2022/2024 Watch: Cruz heading to Pennsylvania to campaign with McCormick days after Trump rally for Oz",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2b16271b-b696-4fa4-85dd-b55f356a3a62/db986a9d-07f4-4105-987c-1bd18edc124d/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/2022-2024-watch-cruz-heading-to-pennsylvania-to-campaign-with-mccormick-days-after-trump-rally-for-oz",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    943,
    1147,
    1434,
    1653,
    1710,
    2095,
    2195,
    2409,
    428,
    571,
    2862
  ],
  "sentences": [
    "The latest public opinion poll in the race indicates Oz with a razor-thin edge over McCormick, a former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official in former President George W. Bush's administration, and veteran and conservative political commentator Kathy Barnette.",
    "PENCE PRAYS CONSERVATIVE SUPREME COURT JUSTICES HAVE COURAGE OF THEIR CONVICTIONS' TO OVERTURN ROE V. WADE\nKemp, a one-time ally, earned Trump's ire starting in late 2020, after the governor certified now-President Biden's narrow victory in Georgia in the presidential election following multiple recounts of the vote.",
    "Cruz's two days of campaigning with McCormick will come just ahead of Pennsylvania's May 17 primary, and it also comes less than a week after former President Donald Trump headlined a rally in western Pennsylvania with McCormick's rival for the nomination, Mehmet Oz, whom Trump endorsed just a couple of weeks ago.",
    "Cruz - who was runner-up to Trump in the marathon 2016 Republican presidential nomination race and who's also seriously mulling another White House run in 2024 - backed and campaigned for former Ohio treasurer and three-time Senate candidate Josh Mandel, who came in second to Vance in the primary.",
    "Pete Ricketts, whom some consider a possible White House hopeful, has endorsed University of Nebraska Board of Regents member Jim Pillen as his successor, with Trump backing GOP businessman Charles Herbster, who currently faces multiple allegations of sexual misconduct ahead of Tuesday's primary.",
    "And Trump's recent endorsement of JD Vance in neighboring Ohio, which was home to another jam-packed and combative GOP Senate primary, was instrumental in helping the former hedge fund executive and best-selling author come out on top in the Buckeye State's Tuesday primary.",
    "Fifteen months removed from the White House, Trump remains the most influential and popular politician in the Republican Party, as he continues to play a kingmaker's role in party primaries and repeatedly flirts with making another presidential run in 2024.",
    "Haley, who served as ambassador to the United Nations during the Trump administration, is backing Rep. Nancy Mace in the Republican primary in South Carolina's 1st Congressional District, while the former president is backing challenger Katie Arrington.",
    "\"My friend Mehmet Oz, he's a great man, \"Trump said on Friday night as he introduced the cardiac surgeon, author and well-known celebrity physician who until the launch of his Senate campaign late last year was host of TV''s \"Dr. Oz Show.\"",
    "While Trump remains the most powerful figure in the Republican Party, it isn't preventing other potential 2024 contenders from making their own choices by endorsing or continuing to support rivals to those the former president's backing.",
    "Both McCormick and Oz, who've traded fire for four months, have close connections to the former president, with former top Trump White House and presidential campaign officials endorsing or serving as advisers to both candidates.",
    "The race to succeed retiring GOP Sen. Pat Toomey in the crucial battleground state is one of a handful of contests across the country that could decide if Republicans win back the Senate majority in November's midterm elections.",
    "But Trump's clout faces plenty of tough tests ahead as some other high-profile candidates backed by Trump  he's made dozens and dozens of endorsements this cycle all the way up and down the ballot  face difficult primaries.",
    "\"There's no question that a Trump endorsement is helpful in a Republican primary, but we're finding that it doesn't always clear the field or ensure victory,\" longtime Republican consultant Ryan Williams told Fox News.",
    "But Trump's endorsement of Oz, who's conservative credentials have been questioned, angered some on the right, and the former president's introduction of Oz at Friday night's rally was met with a smattering of boos.",
    "The intra party face-offs between Trump and other potential 2024 presidential contenders may be like appetizers for things to come once the midterms are over and the contest for the next White House heats up.",
    "Word that Cruz, the conservative firebrand from Texas who endorsed McCormick soon after he declared his candidacy in January, was headed to Pennsylvania was shared first with Fox News Digital on Sunday.",
    "EXCLUSIVE - Republican Sen. Ted Cruz of Texas will team up on Thursday and Friday with Dave McCormick, one of the front-runners in Pennsylvania's crowded, combustible, and expensive GOP Senate primary.",
    "TRUMP WASN'T ON BALLOT BUT WAS BIG WINNER IN VANCE'S OHIO VICTORY\nVance's victory also reconfirmed Trump's continued sway within the GOP, and the former president quickly touted his prowess.",
    "(Rachel Mummey/Bloomberg via Getty Images)\nHours before Trump's rally in Pennsylvania, Pompeo  in a call organized by McCormick's campaign  raised questions about Oz's ties to Turkey.",
    "Trump, who had unsuccessfully urged the governor and other top Republican officials in the state to overturn the results, has now returned to Georgia twice to campaign against Kemp.",
    "Williams, a veteran of numerous GOP presidential campaigns, noted that \"it's giving other potential 2024 contenders the license to go out and endorse who they want.\"",
    "So is former Secretary of State Mike Pompeo, a former congressman from Kansas who served as CIA director and America's top diplomat during the Trump administration.",
    "ABORTION TAKES CENTER STAGE IN HIGH PROFILE PENNSYLVANIA GOP SENATE CLASH\nTrump repeatedly took aim at McCormick at the rally, ripping him as not \"MAGA\" enough.",
    "Trump and his former vice president  Mike Pence  appear to be on opposite sides in Georgia's bitter GOP gubernatorial clash between conservative incumbent Gov.",
    "Pence's political team has helped Kemp's campaign and last week longtime top Pence adviser Marc Short joined Kemp's campaign as a senior adviser.",
    "Trump for months urged Perdue to challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "Chris Christie, a 2016 GOP presidential candidate who has publicly said he's mulling another White House run in 2024, is also supporting Kemp.",
    "Nikki Haley, another potential 2024 contender, are on opposing sides in a GOP congressional primary in her home state.",
    "Haley has headlined a fundraiser for Mace and currently stars in the congresswoman's latest campaign commercial.",
    "CLICK HERE FOR THE LATEST FOX NEWS POWER RANKINGS IN THE MIDTERMS\nTrump and former South Carolina Gov.",
    "And in Pennsylvania, Cruz isn't the only potential 2024 White House hopeful backing McCormick.",
    "Pompeo graduated from the U.S. Military Academy a year ahead of McCormick.",
    "\"People remember who supported them in tough fights,\" Ryan noted.",
    "And he joined McCormick on the campaign trail late last month.",
    "And both contenders worked hard to land Trump's endorsement.",
    "Brian Kemp and challenger and former Sen. David Perdue.",
    "And in Nebraska, term-limited Republican Gov.",
    "And former two-term New Jersey Gov.",
    "It's not just Cruz and Pompeo."
  ]
}