{
  "id": 3207,
  "mediaId": 151,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Idaho GOP riven by primary civil war",
  "image": "https://www.politico.com/dims4/default/a59c0ba/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd3%2F9a%2F78ac573b4340b5282d5502fce982%2Fap19007775886028.jpg",
  "link": "https://www.politico.com/news/2022/05/07/idaho-gop-primary-elections-00030788",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1903,
    1106,
    3032,
    3036,
    3056,
    428,
    2987,
    2706
  ],
  "sentences": [
    "He recently signed a state ban on most abortions after six weeks of pregnancy  which is being challenged in state court  while expressing that the enforcement mechanism of the bill could be unconstitutional and unwise.?\nEven so, Little  a rancher by trade  tends to hail from the business wing of the party, a distinction at the root of many of the primaries in the state.",
    "And in a state as red as ours, that's still the narrative because that's what they do to get elected.?\nIn the state attorney general's race, former Rep. Ral Labrador  a founding member of the House Freedom Caucus  and his allies have cast five-term Attorney General Lawrence Wasden as a weak link in the national fight against Democrats.",
    "The more right-leaning side of the party led by the Freedom Foundation and others  they're certainly not in that alone  have been emboldened by some of their successes, and so have maybe been more aggressive than what we've seen in some prior elections,? said Brent Hill, the former president pro tem of the Idaho state Senate.",
    "And Rep. Mike Simpson is also facing a primary challenge from a handful of candidates  including attorney and Idaho Freedom Foundation board member Bryan Smith, whom Simpson beat back in a 2014 challenge  in a race that has attracted nearly $2 million in TV ad spending in a region where airtime is relatively inexpensive.",
    "The race to replace McGeachin sees Scott Bedke, who has been speaker of the state House for the last decade, squaring off against Priscilla Giddings  a state representative who was censured and stripped of a committee assignment after disclosing the identity of an intern who was raped by a then-state representative.",
    "Lawrence Wasden is no general,? the narrator of the Club ad says, knocking him for not joining multi-state actions that other GOP attorneys general backed  including the 2020 lawsuit led by Texas Attorney General Ken Paxton that tried to toss out the results of the last presidential election.",
    "That far-right? camp, Luna continued, would call themselves conservatives and everybody else moderates.?\nWe're probably a microcosm, in some ways, of a lot of places around the country,? said Tommy Ahlquist, a developer who finished third in the 2018 GOP gubernatorial primary.",
    "Smith's most-aired ad calls Simpson a liberal, and attacks him for wanting to breach dams on the Snake River, taking water from thousands of Idaho farms and families.?\nAnd a super PAC called America Proud PAC has also been laying into Simpson.",
    "Their horn-locking reached farcical levels: More than once, McGeachin used her power as acting governor while Little was out of the state to issue an executive order on the pandemic, which Little would angrily rescind shortly after returning.",
    "It's just this national rhetoric, and running to a narrative created by Trump that he started when he knew he was going to lose, and started telling the lie,? said Ahlquist, who is critical of the far-right slate of candidates.",
    "The rancor stems in part from the Idaho Freedom Foundation, an arch-conservative group that has driven challenges to so-called RINO politicians in the state, including a slew of intra-party legislative battles this year.",
    "But it's the governor's race that will headline the GOP primaries in Idaho, with Little facing down a challenge from McGeachin after years of public feuding between the two, especially over coronavirus policies.",
    "The Idaho Freedom Foundation has a stated media policy of not responding to reporters, believing the legacy news media to be agenda-driven propagandists.?\nAllies of Little have projected confidence in his bid.",
    "He has got backup on air from Defending Main Street, a long-running Republican group that backs candidates from the business wing of the party, along with air cover from the American Dental Association.",
    "But unlike Kemp  who had a well-documented public breakup with Trump in 2020, over his unwillingness to help Trump overturn the election results  Little never publicly drew the former president's ire.",
    "| Otto Kitsinger/AP Photo\nBy Zach Montellaro and Ximena Bustillo\n 05/07/2022 07:00 AM EDT\nIdaho's dominant Republican Party is at war with itself up and down the ballot ahead of its May 17 primaries.",
    "Two of the three candidates running in the GOP primary  state Sen. Mary Souza and state Rep. Dorothy Moon  said they did not believe that President Joe Biden fairly won the 2020 election.",
    "Luna  the state party chair who has remained neutral in the primaries  downplayed any suggestion that the contests would hurt the GOP's general election prospects in the ruby-red state.",
    "According to AdImpact, the national committee placed a small buy of around $21,000 on Fox News channel in the state that started running earlier this week and goes through the primary.",
    "She also has ties to the far right, having appeared at the same conference hosted by a white nationalist that drew condemnation and criticism for Rep. Marjorie Taylor Greene (R-Ga.).",
    "In an interview, Simpson compared the Idaho Freedom Foundation to the Freedom Caucus and said that there were business groups and others? in the state lining up to oppose them.",
    "Their top ad calls him anti-Trump? and resurfaces his criticism of Trump before the 2016 election, noting that he voted in favor of a Jan. 6 commission in the House.",
    "And contentious open races for lieutenant governor and the secretary of state  Idaho's chief election official  echo some of the national divisions within the party.",
    "But there's more to it in Idaho, where the party's longtime control over the booming state has bred sharp differences and fierce enmity between two wings of the GOP.",
    "(McGeachin accused a Boise TV reporter of trying to play guilt by association? by raising the conference, saying she didn't know the organizer before she spoke.)",
    "The Club for Growth, a longtime backer of Labrador's in Congress, has spent nearly $300,000 on TV ads in the race, according to AdImpact, an ad tracking firm.",
    "The two wings agree on 80 percent, but we have primaries to debate the 20 percent where we don't agree, and that's what they're doing,? he said.",
    "Smith  who has loaned his campaign about $350,000  has led the way in TV spending, launching ads ripping into the twelve-term congressman.",
    "Some people would describe it as conservative, and then far-right conservative,? said Tom Luna, the chair of the state Republican Party.",
    "Though the group hasn't formally endorsed Labrador, who finished second in the 2018 gubernatorial primary, they have gone after Wasden.",
    "But unlike some other Republicans Trump has tried to shoo aside, Little does not cut a moderate profile, particularly on social issues.",
    "Ada County Clerk Phil McGrane, who oversees elections in the state's most populous county, said that Biden did win the election.",
    "Brad Little, whose reelection campaign became national news when Donald Trump endorsed a primary challenge from Lt. Gov.",
    "But even so, the Republican Governors Association went on the air in Idaho this week with ads to boost Little.",
    "There is bound to be some infighting in a state where ambitious pols only have a few routes up the ladder.",
    "The state attorney general is staring down a challenge from a former rabble-rousing member of Congress.",
    "The senior of Idaho's two GOP House members is facing a primary that has drawn millions in spending.",
    "This really is an important election, I think, in which way the Republican Party is going to turn.",
    "Little is one of two sitting Republican governors whom Trump is opposing, joining Georgia Gov.",
    "The group has received the lion's share of its funding from a Boise man named Joe Russell.",
    "(That lawmaker, Aaron von Ehlinger, resigned in April 2021 and was convicted last week.)",
    "Not just in Idaho, but in the country.?\nAlly Mutnick contributed to this report.",
    "Brian Kemp, whose primary against former Sen. David Perdue is later this month.",
    "The normally invisible secretary of state race illustrates the situation.",
    "Janice McGeachin, right, after years of public feuding between the two.",
    "The governor's race will headline the GOP primaries in Idaho, with Gov.",
    "There is a lot of division within the Republican Party,? he said.",
    "(Simpson was a practicing dentist before coming to Congress.)",
    "McGeachin, however, was one of Trump's earliest supporters.",
    "Brad Little, center, facing down a challenge from Lt. Gov.",
    "And that filters down to Republicans in our state.",
    "But Simpson has not been alone.",
    "It's not just Gov.",
    "Janice McGeachin."
  ]
}