{
  "id": 3304,
  "mediaId": 409,
  "date": "d2022-05-13T17:30",
  "headline": "Mike Pence to Campaign for Brian Kemp in Georgia",
  "image": "https://www.nationalreview.com/wp-content/uploads/2020/12/Mike-Pence-2.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/mike-pence-to-campaign-for-brian-kemp-in-georgia/",
  "sentiment": "0.715",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Butler",
  "authorUrl": "https://www.nationalreview.com/author/jack-butler/",
  "termIds": [
    1131,
    1147,
    1284,
    1434,
    2095,
    2230,
    4325,
    428,
    2672
  ],
  "sentences": [
    "In a late-March article for National Review, Pence outlined a Freedom Agenda? and argued that we cannot afford to take our eyes off the task in front of us, or to be distracted by grievances of the past.?\nIt appears fairly evident that Pence has ambitions for himself that draw from his time as vice president but are constrained neither by that period nor by the man with whom he served.",
    "Politico argues that Pence has been carefully cultivating his public image in recent months, embracing the achievements and legacy of what he has called in these pages the Trump-Pence administration? while distancing himself from some of the more injurious aspects of Trump himself.",
    "During this period, Trump spent little time actually campaigning for Loeffler and Perdue and largely focused on his stolen-election obsessions when he did, promulgating and promoting counterproductive theories about how the Georgia Senate vote would be rigged.",
    "Supporting Kemp, and perhaps also sensing an opportunity to push back on Trump's grievances  worth distinguishing from the positive aspects of Trump's agenda and legacy  several influential individuals and organizations have turned toward Georgia.",
    "But Pence's support for Kemp  he proudly offered his full support for four more years of Brian Kemp as governor of the great state of Georgia? and will hold a rally for the governor  obviously stands out.",
    "Perdue was available because he had lost a runoff election to Democratic challenger Jon Ossoff in early 2021, despite prevailing over Ossoff on Election Day (but with less than 50 percent of the vote).",
    "Incumbent governor Brian Kemp earned Trump's ire after refusing to go along with the latter's desire to challenge the results of the 2020 presidential election in Georgia.",
    "The Georgia Republican gubernatorial primary, set for May 24, is shaping up to be yet another high-stakes test of the power of former president Donald Trump's endorsement.",
    "If that's accurate, then Georgia is looking like a good place to do it  for him, and for a country, movement, and party that should move on from Trump's grievances.",
    "And this morning brought news that former vice president Mike Pence has decided to increase the stakes  by campaigning against Trump's pick in the race.",
    "Ducey himself, along with Republican governor Pete Ricketts of Nebraska (fresh off a triumph over Trump in that state), will also campaign for Kemp.",
    "Perdue's loss, together with Kelly Loeffler's defeat at the hands of Democrat Raphael Warnock, secured Democratic control of the Senate.",
    "Both losses can fairly be attributed to Trump's effort, between Election Day 2020 and January 6, 2021, to overturn the 2020 election.",
    "In a familiar fit of pique, Trump encouraged David Perdue to challenge Kemp, and then endorsed Perdue when he announced his campaign.",
    "Recent polls have shown Kemp far enough ahead of Perdue to clear the 50 percent threshold that would force a runoff.",
    "If Kemp prevails, he will face would-be president of Earth Stacey Abrams, who is not currently governor of Georgia.",
    "The Republican Governors Association, headed by Arizona governor Doug Ducey, has spent heavily on the race.",
    "But so far, Perdue's campaign, heavily tied to Trump and to stolen-election claims, has been struggling.",
    "On at least one occasion, Trump has said he might prefer Abrams over Kemp.",
    "The aim of this seems to be to carve out a unique path for himself.",
    "This is the fraught background of the gubernatorial contest."
  ]
}