{
  "id": 3306,
  "mediaId": 21,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Mike Pence and other Republicans Trump has attacked are circling the wagons to campaign against his pick for Georgia governor",
  "image": "https://i.insider.com/627e58a427d5960019ee7057?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/mike-pence-against-david-perdue-trumps-pick-for-ga-governor-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    2095
  ],
  "sentences": [
    "Trump also endorsed an election denier candidate, Rep. Jody Hice, to challenge Republican Secretary of State Brad Raffensperger, Georgia's chief election official who also defied Trump by certifying the 2020 election and vocally standing up to Trump's claims that the 2020 election was rife with fraud and impropriety.",
    "Trump has endorsed Perdue, who lost reelection to the Senate in 2020 and has proven much more willing to espouse Trump's false claims that the 2020 election was stolen because of voter fraud including even saying that he wouldn't have certified the 2020 election in Georgia.",
    "Former Vice President Mike Pence speaks to reporters after touring a mobile ultrasound unit on Thursday, May 5, 2022, in Spartanburg, S.C. Meg Kinnard/AP\nMike Pence is rallying against President Donald Trump's pick for Georgia governor.",
    "But, like Pence, he fell out of favor with Trump for not repeating Trump's false claims that the 2020 election was stolen and declining to stand in the way of President Joe Biden being certified as the winner over Trump.",
    "But May's primaries will also test whether his endorsement is enough to unseat sitting governors, a somewhat more difficult feat than helping boost candidates through a crowded open Senate primary, for example.",
    "After Kemp certified the 2020 election in Georgia, Pence refused to use his ceremonial role presiding over the joint session of Congress on January 6, 2021, to reject slates of electoral votes for Biden.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Pence, who is laying the groundwork for a possible 2024 presidential campaign, called Trump \"wrong\" to suggest Pence had the power to overturn the 2020 election.",
    "Doug Ducey, who Trump also attacked for certifying the 2020 election, in campaigning on behalf of Kemp in the final stretch of the primary, CNN reported.",
    "Brian Kemp, who is facing a Trump-backed primary challenge from former Sen. David Perdue on May 24, CNN and the Atlanta Journal-Constitution reported.",
    "Vice President Mike Pence is yet again crossing President Donald Trump by campaigning against the former president's pick for Georgia governor.",
    "Trump's pick to replace Ricketts as Nebraska governor, Charlie Herbster, lost on Tuesday night amid multiple sexual misconduct allegations.",
    "Trump got a big win when his endorsed candidate, JD Vance, pulled out a victory in a competitive US Senate primary in Ohio.",
    "Pence and a group of other Republicans who have clashed with Trump are holding rallies or otherwise supporting Georgia Gov.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "The Republican primaries in May pose major tests of Trump's endorsement power and influence over the GOP.",
    "Kemp embraced the MAGA brand and Trump's style of politics when he was elected to the governor's office.",
    "Trump is backing former Sen. David Perdue over Kemp, who refused to promote Trump's 2020 election lies.",
    "In addition to backing Perdue to challenge Kemp, Trump has also endorsed Idaho's Lt. Gov.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Former President George W. Bush also appeared at a fundraiser for Kemp.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Pence and other Republicans are rallying behind Georgia Gov.",
    "Janice McGeachin, who is running against sitting GOP Gov.",
    "Brad Little, in a primary election on May 17.",
    "Stay up to date with what you want to know.",
    "Pence is joined by former New Jersey Gov.",
    "Sign up for notifications from Insider!",
    "Pete Ricketts, and Arizona Gov.",
    "Chris Christie, Nebraska Gov.",
    "Loading Something is loading.",
    "Brian Kemp, CNN reported."
  ]
}