{
  "id": 3313,
  "mediaId": 1576,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Judge dismisses Perdue suit pushing 2020 election fraud claims",
  "image": "https://www.wabe.org/app/uploads/2022/05/AP22103848649335-336x189.jpg",
  "link": "https://www.wabe.org/judge-dismisses-perdue-suit-pushing-2020-election-fraud-claims/",
  "sentiment": "-0.651",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2230,
    3026,
    4325,
    2670,
    2672
  ],
  "sentences": [
    "Perdue harshly criticized the ruling saying it was another example of how the establishment continues to cover up what happened in 2020, and we will vigorously appeal the decision.?\nThe lawsuit excoriates? county officials for having negligently, willfully, wantonly, outwardly, maliciously or corruptly and unapologetically acted with malfeasance' thereby causing electors in Fulton County to experience disenfranchisement, dilution, debasement, and corruption of their vote in the General Election,'? but it doesn't seek a remedy for the alleged violations of the petitioners' rights, McBurney wrote.",
    "In an order dated Wednesday dismissing the lawsuit, Fulton County Superior Court Judge Robert McBurney wrote that it is not really about Perdue's loss or Lennon's personal voting experience.? Its core claims, he notes, are that several batches of absentee ballots were scanned multiple times and thousands of unlawful counterfeit absentee ballots were counted and certified in Fulton County.",
    "The lawsuit also asks the judge to issue a series of orders that would empower the petitioners' experts to intrude upon the sealed ballot materials of tens of thousands of Fulton County voters, hunt for speculative voter fraud or error, and then determine for themselves what the actual' vote count should have been in the Election,? McBurney wrote.",
    "The lawsuit asks the judge to declare that county officials violated the petitioners' equal protection and due process rights, but such a declaration requires that they demonstrate that if the court doesn't act, their interests will be harmed in the future, McBurney wrote.",
    "The lawsuit seeks a declaration that the court is unable to provide and without such a declaration, the petitioners' requests are left supported only by sour grapes which make a wine this Court will not serve,? McBurney wrote.",
    "Perdue, who is trailing Kemp in polls as the May 24 Republican primary grows near, has made claims of a stolen and rigged? election a central pillar of his campaign and frequently talks about the lawsuit while campaigning.",
    "A Georgia judge has dismissed a lawsuit filed by former U.S. Sen. David Perdue that alleged fraudulent or counterfeit ballots were counted in the state's most populous county during the 2020 general election.",
    "The suit was similar to another filed by a group of voters that was dismissed in October because a judge found the group hadn't alleged a particularized injury? and therefore didn't have standing to sue.",
    "Investigators with the secretary of state's office found no evidence to support the fraud claims, but that hasn't stopped former President Donald Trump, Perdue and others from continuing to spread them.",
    "Perdue claims his particularized injury was that he was a candidate for reelection in November but failed to achieve a majority, forcing him into a runoff with Democrat Jon Ossoff that Perdue lost.",
    "Those are claims that were repeatedly pushed in the aftermath of the 2020 election by people who allege that widespread fraud caused the presidential election to be stolen from Trump.",
    "Among other things, the suit sought access to examine absentee ballots, saying that would allow the petitioners to prove that there had been fraud in Fulton County.",
    "Perdue and voter Elizabeth Grace Lennon argued that their state constitutional rights to equal protection and due process have been violated.",
    "Lennon says she sought to cast an in-person early vote in October 2020 but was told someone had already submitted a mail ballot in her name.",
    "Instead, they asked him to make a declaration about something that had already happened in the past, and the court can't do that, he wrote.",
    "Perdue filed the lawsuit, along with an individual voter, in December a few days after he announced that he would be challenging Gov.",
    "Associated Press writer Jeff Amy contributed to this report.",
    "This quixotic journey will not take place,? he added.",
    "Brian Kemp in the Republican primary.",
    "That ruling has been appealed."
  ]
}