{
  "id": 3315,
  "mediaId": 129,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "How Overturning Roe Could Backfire for Republicans",
  "image": "https://static01.nyt.com/images/2022/05/12/us/12roe-backfire05/merlin_206549985_3b8b1815-93f4-4679-9e90-dcc3a166bd0a-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/13/us/roe-overturned-women-republican-voters.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    773,
    1073,
    1689,
    2058,
    2087,
    2095,
    428,
    482,
    2555,
    2586,
    2945
  ],
  "sentences": [
    "We've never been in a situation like this,? Ms. Matthews said, adding, We are in a situation where abortion rights are now being threatened in a way they haven't been in nearly 50 years.?\nVoters, she added, were likely to see six-week abortion bans like Georgia's as well outside the mainstream.?\nNational Republicans have attempted to mute the political impact of Roe by urging their candidates to focus on unpopular elements of the Democratic Party's position on abortion, shifting the focus from the hard-line views of the right and making Democrats defend their opposition to most limits on abortion.",
    "Should the Supreme Court strike down Roe in the sweeping manner of Justice Samuel A. Alito Jr.'s draft opinion, it would unleash a ferocious state-by-state battle over abortion regulations  and introduce a powerful new issue into the calculus of voters who might otherwise be inclined to treat the midterm election as an up-or-down vote on Mr. Biden's performance in the presidency.",
    "That could create a major challenge for Republicans in their efforts to win back the centrist and center-right communities that shunned them during the Trump years and turned America's suburbs  from areas near Atlanta and Philadelphia to Minneapolis and Salt Lake City  into at least a temporary political desert for the party.",
    "In closely divided states and congressional districts around the country, many moderate voters suddenly find themselves choosing between a Democratic Party that has disappointed them since taking power in 2021, and a Republican Party newly emboldened to enact a right-wing social agenda that makes many voters deeply uneasy.",
    "The fiscals will work themselves out, but this is about our rights and what kind of country we want to live in.?\nSimona Vancea, 38, of Sterling Heights, Mich., described herself as a pro-choice? voter who cast her ballot for Mr. Trump in 2020 because she believed he would run the country better than Mr. Biden.",
    "The most extreme restrictions have been proposed in deeply conservative states like Louisiana, where legislators debated a bill that would have classified abortion as a form of homicide, and would have made it possible to bring criminal charges against women who end their pregnancies.",
    "In many states, however, the internal politics of the Republican Party are already pushing its candidates even further rightward on the issue, testing the tolerance of voters who like the party's agenda on other issues but oppose the strictest limits on abortion rights.",
    "The urgency of the abortion issue could be particularly intense in Georgia, where state lawmakers in 2019 passed a ban on abortion after the sixth week of pregnancy, knowing at the time that existing Supreme Court precedent would forbid the law from going into effect.",
    "Brian Kemp of Georgia, a conservative Republican who signed the six-week ban, is facing a primary challenge from a former senator, David Perdue, who is demanding that Mr. Kemp call a special session of the state legislature to outlaw abortion altogether.",
    "But leaving it to just men  I'm sorry, no.?\nIt is voters like Ms. Sloan, in communities like Buckhead, who may represent the greatest challenge for Republicans in a renewed national debate over the rights of women to legally terminate a pregnancy.",
    "Moderate women who have tilted back toward the Republicans might now have second thoughts; young people who feel let down by Mr. Biden could well find motivation to vote Democratic out of a feeling of fear and indignation about the Supreme Court.",
    "Ms. Turtenwald said she would prefer that abortion not be the main issue in the country's political discourse, citing access to health care, the cost of gas and housing, and the availability of baby formula as more important issues.",
    "A Pew Research Center poll published last week found that about three in five Americans believed that abortion should be legal in all or most cases, though many of those people said they preferred some restrictions on the procedure.",
    "Similar to Wisconsin, Michigan never repealed an archaic law that makes abortion a felony, meaning that the procedure could be instantly criminalized in the event of a court decision that closely resembled Justice Alito's draft.",
    "On the campaign trail, Republican candidates have been encouraged by party leaders to focus on the economy, crime and the border, according to a memo from the National Republican Senatorial Committee obtained by Axios.",
    "Ms. Sloan said she had followed the news recently about a leaked Supreme Court draft opinion striking down Roe v. Wade, as well as the passage of anti-abortion legislation in states like Texas and Oklahoma.",
    "In Washington, Senator Mitch McConnell, the minority leader, acknowledged it was possible that Republicans might seek to ban abortion at the federal level but stopped well short of pledging to do so.",
    "Ms. Wood, who identifies as libertarian, said she was frustrated with Democratic leaders in Washington but was not sure if she would vote Republican or cast her ballot for a third party this year.",
    "But she said it was too soon to gauge how voters would prioritize abortion rights as an issue relative to other close-to-home considerations, like the cost and availability of consumer goods.",
    "Other swing states have passed strict abortion laws, including a 15-week ban in Arizona, and Republican lawmakers in Wisconsin have introduced a measure to ban the procedure after six weeks.",
    "Christine Matthews, a pollster who has studied the abortion issue and worked in the past for Republicans, said she expected abortion rights to become a top concern of the 2022 elections.",
    "State Senator Jen Jordan, a Democrat running for attorney general of Georgia, said she expected the abortion rights issue to eclipse other concerns as a top consideration for voters.",
    "From Opinion: A Challenge to Roe v. Wade\nCommentary by Times Opinion writers and columnists on the Supreme Court's upcoming decision in Dobbs v. Jackson Women's Health Organization.",
    "Matthew Walther, Editor of a Catholic Literary Journal: Those who oppose abortion should not discount the possibility that its proscription will have some regrettable consequences.",
    "The ruling struck down laws in many states that had barred abortion, declaring that they could not ban the procedure before the point at which a fetus can survive outside the womb.",
    "On Wednesday, Senate Democrats voted to provide a broad guarantee of abortion rights nationwide, though they knew the bill lacked enough support to overcome Republican opposition.",
    "The state's Democratic attorney general, Dana Nessel, has announced that she would not enforce that law; like Ms. Whitmer, she is facing a competitive fight for re-election.",
    "That exodus was particularly pronounced among centrist and even Republican-leaning white women, a constituency that tends to favor abortion rights with modest limitations.",
    "So it might as well be safe and legal.?\nMaya King reported from Atlanta, Alexander Burns from Washington, Dan Simmons from Milwaukee and Ryan Patrick Hooper from Detroit.",
    "Ms. Deveson said she would still consider voting for Republican candidates on a case-by-case basis, mainly because she found the party appealing on fiscal issues.",
    "Nancy Turtenwald, 64, of West Allis, Wis., an inner-ring suburb of Milwaukee, said she had voted Republican her entire life but also supported abortion rights.",
    "Jamelle Bouie: The logic of the draft ruling is an argument that could sweep more than just abortion rights out of the circle of constitutional protection.",
    "Jessica Wood, a stay-at-home mother in Suwanee, Ga., grew politically active last year when she organized against pandemic-driven restrictions in schools.",
    "In Wisconsin, where the offices of an anti-abortion group were set on fire on Sunday, Republicans are defending a Senate seat and seeking to defeat Gov.",
    "Ms. Wood said she was 100 percent? supportive of women having access to abortion, though she would never feel comfortable having an abortion herself.",
    "Rose Deveson is a 60-year-old homemaker from Birmingham, Mich., a town in politically split Oakland County about 25 minutes from downtown Detroit.",
    "If that precedent is overturned, then Georgia voters could find themselves living under one of the most restrictive abortion bans in the country.",
    "Yet Ms. Sloan, a retired high school teacher who lives in Atlanta's upscale Buckhead neighborhood, is uneasy about the party for one main reason.",
    "Ms. Vancea said she believed that every woman should be able to do whatever she feels comfortable with? when it comes to pregnancy and abortion.",
    "ATLANTA  For months, Republicans have been poised to make inroads in the diverse and economically comfortable suburbs of cities like Atlanta.",
    "If Roe is overturned and Republicans attempt to ban abortion, Ms. Turtenwald said, she will consider crossing over to vote for Democrats.",
    "Sandra Sloan, 82, is the kind of voter Republicans are counting on to help them reclaim this contested section of a newly purple state.",
    "Ms. Deveson said she had been a reliable Republican voter for 20 years until disgust with Mr. Trump drove her to vote for Democrats.",
    "Previously, Ms. Jordan said she had been campaigning on issues related to the cost of living, vowing to crack down on price gouging.",
    "I think fundamental rights is a little bit above the day-to-day economic issues that have been batted around,? Ms. Jordan said.",
    "In the third, it allowed states to ban abortions so long as exceptions were made to protect the life and health of the mother.",
    "Justice Harry A. Blackmun, a modest Midwestern Republican and a defender of the right to abortion, wrote the majority opinion.",
    "Gail Collins: The push to restrict women's reproductive rights is about punishing women who want to have sex for pleasure.",
    "The practice would likely be banned or restricted heavily in about half of them, but many would continue to allow it.",
    "A crackdown on abortion could alienate some of the moderate voters who would otherwise be reliable Republican votes.",
    "But a decision striking down Roe would not change her overall inclination to support the Republican Party, she said.",
    "Thirteen states have so-called trigger laws, which would immediately make abortion illegal if Roe were overturned.",
    "The moderate communities here swung toward Democrats in recent years, led by women appalled by Donald J. Trump.",
    "I would vote pro-choice on that specific issue, but I still sway more to the Republican side,? Ms. Vancea said.",
    "But lately, rampant inflation and rising crime have taken a political toll on President Biden and his party.",
    "She said she was not sure how she would ultimately vote in the fall, but abortion rights would be a factor.",
    "The current Republican front-runner for governor, Rebecca Kleefisch, has said she totally opposes abortion.",
    "National Democrats have indicated they intend to campaign on the issue ahead of the midterms in November.",
    "Roe v. Wade created a framework to govern abortion regulation based on the trimesters of pregnancy.",
    "Roe v. Wade is a landmark Supreme court decision that legalized abortion across the United States.",
    "Gretchen Whitmer, Governor of Michigan: If Roe falls, abortion will become a felony in Michigan.",
    "The state already has a dormant law, enacted in 1849, that bans abortion in nearly all cases.",
    "I am a Republican, but I still believe that it's a woman's right to choose,? Ms. Sloan said.",
    "We still don't know, after the draft, when it's finished what it will say,? Ms. Sloan said.",
    "I have a moral obligation to stand up for the rights of the women of the state I represent.",
    "Some Republicans have been far less guarded about their intentions on abortion regulation.",
    "Individual states would be able to decide whether and when abortions would be legal.",
    "Gretchen Whitmer, a Democratic rising star, and pick up several congressional seats.",
    "But she said she could not embrace candidates who led an attack on abortion rights.",
    "In 1992, the court tossed that framework, while affirming Roe's essential holding.",
    "The leaked Supreme Court opinion completely changed the conversation,? she said.",
    "That point, known as fetal viability, was around 28 weeks when Roe was decided.",
    "She said the possibility of a six-week ban going into effect gave her pause.",
    "Many Republicans, however, are hesitant to discuss abortion outright.",
    "Lawmakers scrapped the bill on Thursday before it reached a vote.",
    "In the second, it allowed regulations to protect women's health.",
    "I cannot believe what they are trying to do,? Ms. Deveson said.",
    "Today, most experts estimate it to be about 23 or 24 weeks.",
    "In the first trimester, it allowed almost no regulations.",
    "The State of Roe v. Wade\nCard 1 of 4\nWhat is Roe v. Wade?",
    "In Michigan, Republicans are seeking to defeat Gov.",
    "I feel like people are just going to do it anyway.",
    "There's just so many gray areas,? Ms. Wood said.",
    "The 7-2 ruling was announced on Jan. 22, 1973.",
    "What would happen if Roe were overturned?",
    "I think a lot of women would,? she said.",
    "Plenty of voters feel more conflicted.",
    "Even so, it will be worth it.",
    "What else did the case do?",
    "What was the case about?",
    "Tony Evers, a Democrat.",
    "Gov."
  ]
}