{
  "id": 3316,
  "mediaId": 1576,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Pence to rally with Kemp in Georgia in break with Trump",
  "image": "https://www.wabe.org/app/uploads/2022/05/AP20150645411408-336x189.jpg",
  "link": "https://www.wabe.org/pence-to-rally-with-kemp-in-georgia-in-break-with-trump/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    761,
    1147,
    1434,
    2030,
    2095,
    4325,
    428,
    2672,
    2710
  ],
  "sentences": [
    "I am proud to offer my full support for four more years of Brian Kemp as governor of the great state of Georgia!?\nThe news comes as Pence has taken steps to distance himself from Trump as the former congressman and Indiana governor considers a 2024 presidential run that could put him into direct competition with his former boss.",
    "In a separate speech before top Republican donors, Pence urged the GOP to move on from Trump's 2020 election grievances and said there was no room in this party for apologists? for Vladimir Putin after Trump praised the Russian leader's maneuvering as genius? before his brutal invasion of Ukraine.",
    "Kemp had been substantially ahead of Perdue in polls in March and April, and many expect Kemp will be able to prevail without a June runoff, which would be triggered if no candidate won a majority of the vote.",
    "The Georgia race is a gamble for Trump, who notched a major victory in Ohio earlier this month when JD Vance, the candidate he endorsed, came from behind to win a competitive GOP Senate primary.",
    "Perdue, a former senator, has also been lagging in fundraising and had about $900,000 cash on hand on April 30, less than a month before the May 24 primary, while Kemp had $10.7 million.",
    "And Trump faces further challenges ahead, including in Pennsylvania next week, where his pick for Senate, celebrity heart surgeon Mehmet Oz, is locked in a tight, three-way race.",
    "But Trump this week panned a trio of current and former Republican governors, including New Jersey's Chris Christie, as RINOs?  or Republicans in Name Only?  for supporting Kemp.",
    "In February, Pence said Trump was wrong? to insist that Pence had the power to unilaterally overturn the results of the 2020 election  a power vice presidents do not possess.",
    "We cannot win by fighting yesterday's battles, or by relitigating the past.?\nA Trump spokesperson did not immediately respond to a request for comment on Pence's plans.",
    "That tells you all you need to know about what you are getting in Georgiajust a continuation of bad elections and a real RINO if you vote for Brian Kemp,? Trump said.",
    "Kemp is one of Trump's top targets this election cycle because of his refusal to cooperate with Trump's efforts to overturn the results of the 2020 election.",
    "Kemp's campaign announced Friday morning that Pence will headline a get-out-the-vote rally for Kemp on Monday, May 23rd, the day before the vote.",
    "Brian Kemp the day before this month's GOP primary in his most significant political break with former President Donald Trump to date.",
    "The winner will face Democrat Stacey Abrams, who has raised more than $20 million so far and had $8 million in cash on April 30.",
    "My fellow Republicans, we can only win if we are united around an optimistic vision for the future based on our highest values.",
    "That puts Pence in direct conflict with Trump-endorsed candidate David Perdue, who has been trailing in the polls.",
    "Brian Kemp is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said in a statement.",
    "But last week, his pick for governor in Nebraska, Charles Herbster, lost his primary amid groping allegations.",
    "Former Vice President Mike Pence will campaign with Georgia's incumbent Republican Gov.",
    "Maybe the R? in RINO really stands for re-elected,? Christie quipped back.",
    "Elections are about the future,? Pence said in March.",
    "That has included calling out Trump by name."
  ]
}