{
  "id": 339,
  "mediaId": 151,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Biden hits the fundraising circuit",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/03/14/biden-hits-the-fundraising-circuit-00016932",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEPHANIE MURRAY",
  "authorUrl": "https://www.politico.com/staff/stephanie-murray",
  "termIds": [
    2087,
    2087,
    2416,
    2416,
    1226,
    1226,
    947,
    947,
    600,
    600,
    403,
    403,
    145,
    145,
    2590,
    2590,
    2834,
    2834,
    2862,
    2862
  ],
  "sentences": [
    "And Trumpist Republicans are doing everything in their power to thwart her.?\nMIDTERM MESSAGING  You will see the wrath'  Progressives warn Biden against cutting down agenda,? by Adam Cancryn and Eugene Daniels, POLITICO: President Joe Biden's vision for building a vast care economy' has collapsed  and Democrats fear their party's political advantage with parents and caregivers could end up as collateral damage.?\n Dems catch a break from the culture wars,? by David Siders and Elena Schneider, POLITICO: For more than a year, Democrats have been on defense, with the party's own polling clarifying its vulnerability to the GOP's alarmingly potent' attacks in the culture wars.' But the war in Ukraine and the ensuing domestic economic fallout have given Democrats a chance to put those matters aside and focus on an unlikely, more favorable set of issues eight months before the midterms.?\n Democratic National Committee members launch new party reform push at winter meeting,? by Michael Scherer, The Washington Post: Dozens of voting members of the Democratic National Committee met Friday to organize a new voting bloc to push for changes to the internal governance of the national party and send more money to state party groups, according to multiple attendees.?\nFIRST IN SCORE: ENDORSEMENT ALERT  DMFI PAC endorsed 20 candidates in its second round of primary endorsements.",
    "GETTING IN  Republican Jan Kulmann 1st to qualify for primary ballot in Colorado's new congressional district,? by Ernest Luning, Colorado Politics: Republican Jan Kulmann, the mayor of Thornton, on Friday became the first candidate to qualify for the primary ballot in Colorado's newly created 8th Congressional District after election officials determined she submitted a sufficient number of valid signatures on nominating petitions.?\nNOTABLE FLOATABLES  House GOP winces as Hagedorn's scandal-plagued widow eyes his empty seat,? by Olivia Beavers, POLITICO: The late GOP Rep. Jim Hagedorn's widow is laying the groundwork to try to seek his old seat in Minnesota, according to multiple well-placed Republicans who are already raising alarms about her polarizing background.?\nEMPIRE STATE OF MIND  The Long Island Sound takes star billing in House race to succeed Suozzi,? by Bill Mahoney, POLITICO Pro New York: As the crowded Democratic primary field to succeed outgoing Rep. Tom Suozzi (D-NY) takes shape, candidates are beginning to address a question that is usually so fundamental that it doesn't come up in campaigns: What exactly is the district they're running for?",
    "POLL POSITION\n Biden, Democrats Lose Ground on Key Issues, WSJ Poll Finds,? by Michael Bender, The Wall Street Journal: President Biden and his fellow Democrats have lost ground to Republicans on several of the issues most important to voters, a new Wall Street Journal poll finds, a troubling sign for the party seeking to extend its controlling majority of Congress for another two years.?\nTHE CASH DASH\n Disney pledges to stop Florida campaign donations over Don't Say Gay' bill,? by Andrew Atterbury, POLITICO Florida: A rift between Walt Disney Co. and Florida's Republican leaders escalated on Friday when the California-based entertainment giant pledged to stop donating to political campaigns in the state over the controversial legislation branded the Don't Say Gay' bill.?\n Missouri Democrat Ben Samuels has raised $1 million for his MO-02 campaign against Rep. Ann Wagner (R-Mo.",
    "Last month, Hawley's campaign started selling a mug emblazoned with the photo, which was taken by a photographer for a Politico-owned publication called E&E News.?\nTRUMP CARD  Trump exacts revenge on 2 SC Republicans at Florence rally, tells voters to dump' them,? by Caitlin Byrd, The State: About 40 minutes into his South Carolina rally Saturday evening, former President Donald Trump took his chance to exact political revenge on a pair of Republican members of Congress who he claimed turned their backs on him and America's GOP voters: Nancy Mace and Tom Rice.?\n Trump to headline March rally in Georgia to boost Perdue, Walker,? by Greg Bluestein, The Atlanta Journal-Constitution: Donald Trump will headline a rally in Georgia this month to try to turn the tide of the election against Gov.",
    "Two lawsuits were filed on Friday that asked separate courts to take over the redistricting process and draw new maps for the state's 28 congressional districts.?\n Ohio Supreme Court rules that Ohio Redistricting Commission must respond to revised League of Women Voters of Ohio complaint by Tuesday,? by Kaylee Remington, Cleveland Plain Dealer: The Ohio Supreme Court has set a 4 p.m. Tuesday deadline for the Ohio Redistricting Commission to respond to new arguments from the League of Women Voters of Ohio and others that its latest congressional redistricting maps unconstitutionally favor the Republican Party.?\nAS SEEN ON TV\n Wisconsin Democrat Sarah Godlewski released the first ad of her Senate campaign.",
    "GOP candidates are already pummeling each other in monthslong advertising free-for-alls, fights intensified by unprecedented television spending.?\nTHE COWBOY STATE  Liz Cheney turns to Democrats to save her hide,? by Tara Palmeri, POLITICO: In 2007, in this blue bastion of one of the reddest states in the country, liberal activists wheeled a giant statue of Dick Cheney through town to protest his star role in the Iraq War  before toppling it, Saddam Hussein style, for good measure.",
    "Based on the early messaging from candidates, it seems plausible that the eventual victor will primarily be identified not by the city or county that they live in, but the body of water they happen to live near.?\nCANDID CAMERA  Newspaper Asks Sen. Josh Hawley To Quit Using Its Photo Of Him On Campaign Merch,? by Arthur Delaney, HuffPost: The newspaper that owns the rights to a photo of Sen. Josh Hawley (R-Mo.)",
    " But no such winner was flown to New Orleans last weekend, according to four people familiar with the matter.?\nCODA  HEADLINE OF THE DAY  The White House is briefing TikTok stars about the war in Ukraine?  The Washington Post\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "DMFI PAC is backing Rep. Tim Ryan (D-Ohio) and Rep. Val Demings (D-Fla.) for Senate, House Speaker Nancy Pelosi and Majority Leader Steny Hoyer, and Democratic Reps. Tony Crdenas of California, Rick Larsen of Washington, Kathy Manning of North Carolina, Brad Sherman and Juan Vargas of California and Susan Wild of Pennsylvania.",
    "But no winner met him.? by Josh Dawsey and Isaac Stanley-Becker, The Washington Post: Former president Donald Trump's political group sent at least 15 emails in recent weeks offering small-dollar donors the chance to win a coveted prize if they gave money: dinner with Trump in New Orleans last Saturday.",
    "Non-incumbent Democrats the PAC endorsed are Nikki Buzinski in IL-13, Don Davis in NC-01, Valerie Foushee in NC-04, Daniel Hernndez, Jr. in AZ-06, Sydney Kamlager in CA-37, Robert Menendez, Jr. in NJ-08, Kevin Mullin in CA-15, Brittany Petterson in CO-07 and Ruben Ramirez in TX-15.",
    "But in the House, DCCC Chair Sean Patrick Maloney is pleading with his party to embrace Biden's style, and appreciate that swing voters find Democrats preachy? and divisive.?\nThe problem is not the voters,? Maloney told The Washington Post during the party retreat in Pennsylvania.",
    "Presidential Big Board\n Iowa takes criticism at DNC but hangs onto its spot  for now,? by Elena Schneider and David Siders, POLITICO: Democratic National Committee members blasted Iowa's lack of diversity and spoke about shaking up the presidential nominating process on Friday.",
    "It's part of Trump's ongoing vendetta against Kemp and other state leaders who rejected his attempt to overturn his 2020 defeat in Georgia.?\nTHE MAP LINES  Two lawsuits filed over redistricting in Florida,? by Gary Fineout, POLITICO Pro Florida: The tug-of-war between Gov.",
    "Days until the CA-22 special election primary: 22\nDays until the Indiana and Ohio primaries: 50\nDays until the Texas runoff: 71\nDays until the general election: 239\nDays until the 2024 election: 967\nWant to receive this newsletter every weekday?",
    "Since Biden's signature social spending plan has failed to make it through the narrowly divided Senate, the politics surrounding the bill are so radioactive that some Democrats asked that the phrase Build Back Better? be retired.",
    "And although there's some optimism (inside the party, at least) that Democrats could perform better than expected this fall, the chances that liberals lose control of the House and Senate are still pretty good.",
    "CAMPAIGN INTEL\nCIRCULAR FIRING SQUAD  GOP Senate candidates thrash each other ahead of fight for majority,? by Natalie Allison, POLITICO: Democrats running for Senate are still holding their fire in primaries.",
    "The advisory council includes SKDK COO Jacqui Newman, The Management Center Founder Jerry Hauser, MissionWired Associate Vice President Andrea Ramos and Left Hook Partner Shripal Shah, among others.",
    "I don't want Joe Biden or anyone else from outside of Texas coming into this state to campaign for me or anyone else,? O'Rourke said during a South by Southwest event in Austin over the weekend.",
    "HAPPY PI DAY  Science-focused political group 314 Action is marking March 14, also known as Pi Day,? to celebrate its fifth anniversary and launch a new pilot program to recruit STEM candidates.",
    "But the Democratic National Committee isn't any closer to actually dethroning Iowa with formal changes yet.?\n Trump touted a contest for small-dollar donors to dine with him in New Orleans.",
    "STAFFING UP\n Progressive Pipeline launched a new program to help progressives recruit underrepresented, entry-level staff and announced its new advisory council and partners for 2022.",
    "The former president will headline a March 26 event in Commerce  a short hop from Kemp's hometown of Athens  to help former U.S. Sen. David Perdue and other GOP candidates.",
    "House Speaker Nancy Pelosi suggested a new phrase, Democrats deliver,? during a meeting with the White House last month, The New York Times reported, but it didn't stick.",
    "Biden hits the fundraising circuit\nBy STEPHANIE MURRAY\n03/14/2022 10:00 AM EDT\nTopLine\nPARTY PROBLEMS  President Joe Biden is stepping onto the political scene tonight.",
    "The PAC is supporting nine incumbent lawmakers, 10 candidates running in open seats and one House lawmaker running to knock out a GOP member of the Senate.",
    "Biden's fundraiser appearance comes 239 days ahead of the 2022 midterm election, and at a time when Democrats are scrambling for a new midterm message.",
    "Some Democrats are even pleading with the president to stay away from their races, like former Rep. Beto O'Rourke, who is running for Texas governor.",
    "Partner organizations include BerlinRosen, the Working Families Party, MissionWired, SKDK, Run for Something, Catalist and Rising Tide Interactive.",
    "It's his first in-person political fundraiser since he took office, and has already raised more than $3 million, according to The Washington Post.",
    "Ron DeSantis and the Florida Legislature over a new congressional map has sparked a push to have the courts step in and resolve the showdown.",
    "hired Fulkerson, Kennedy & Co as fundraising consultants, as part of his efforts to support congressional Democrats in the 2022 midterms.",
    "Republicans still have an advantage on the generic congressional ballot, according to the RealClearPolitics polling average.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "I grew up in Eau Claire, where we're more interested in common sense than conspiracies,? Godlewski says in the ad.",
    "The group will use geo-targeted ads and create a searchable file of STEM Democrats? to bolster its recruitment.",
    "You'll also receive daily policy news and other intelligence you need to act on the day's biggest stories.",
    "The problem is us.?\nThe party hasn't come to a consensus on what its midterm message should actually be.",
    "House lawmakers just huddled in Philadelphia to make a plan for the election and find some party unity.",
    "The group has raised $36.8 million and helped win 229 pro-science campaigns over the last five years.",
    "raising his fist on Jan. 6, 2021, said it never gave Hawley's campaign permission to put it on a mug.",
    "Godlewski takes aim at Sen. Ron Johnson (R-Wis.) and shares her biography in the 30-second spot.",
    "The president will attend a DNC fundraiser in Washington, according to the White House schedule.",
    "The beginning of the year was marked by tension between the White House and the DNC.",
    "is turning to the same rare species in Wyoming  Democrats  to save her House seat.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "And that could be setting the stage for an oddity in New York politics.",
    "Biden's approval rating is on the rise, but it remains underwater.",
    "Fifteen years later, his daughter Rep. Liz Cheney (R-Wyo.)",
    "Brian Kemp and other Republicans he's vowed to unseat.",
    "Republicans are stuck in the Thunderdome.",
    "Subscribe to POLITICO Pro.",
    "), his campaign announced.",
    " Sen. Chris Coons (D-Del.)",
    "Good Monday morning!"
  ]
}