{
  "id": 3399,
  "mediaId": 409,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump as GOP Kingmaker",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/cpac-2022-022622-11.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/trump-as-gop-kingmaker/",
  "sentiment": "-0.514",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fred Bauer",
  "authorUrl": "",
  "termIds": [
    1147,
    1282,
    1348,
    1713,
    1990,
    2095,
    3102,
    146,
    428,
    2862
  ],
  "sentences": [
    "Even though Barletta endorsed Trump in March 2016 and has strong populist credentials, other political calculations might have factored into the Mastriano endorsement: While Mehmet Ozs polling numbers have improved, the Trump-endorsed candidate for the Republican Senate nomination in the Keystone State remains locked in a very tight race.",
    "While many structural factors favor Republicans in 2022, Donald Trumps effort to promote his own status within the party remains a wildcard, and Trumps own interests (and piques) might sometimes diverge from those of Republican voters.",
    "The likely Democratic nominee, Josh Shapiro, has tried to elevate Mastrianos profile, and even populist-friendly journalists like Salena Zito have argued that Mastriano would be a political disaster for the GOP.",
    "This endorsement reveals a core element of Trumps political strategy right now: more focused on asserting dominance over the GOP than ensuring that Republicans win elections.",
    "His relentless criticism of Massachusetts governor Charlie Baker, for instance, helped prompt Baker not to run for reelection, despite being a likely favorite to win.",
    "Angry at the refusal of Brian Kemp to overturn the results of the 2020 presidential election in Georgia, Trump recruited David Perdue to run against him for governor.",
    "He has launched withering attacks on Republicans whom he views as insufficiently deferential, even if such attacks actively harm Republican general-election chances.",
    "For instance, Axios has reported that Trump was willing to endorse J. D. Vance in the Ohio Senate primary only after Vances polling numbers had begun to improve.",
    "Top Stories\nDeeply invested in branding, Trump has attempted  often with some success  to make himself the principal figure of the GOP brand.",
    "Trump has said that Barnette would never be able to win in the general election, but endorsing Mastriano might also give her a boost.",
    "However, because so many other candidates are running for the Republican nomination, thats enough for a substantial lead.",
    "Mastriano is running on a quasi-ticket with Kathy Barnette, who is surging in the polls for the GOP Senate nomination.",
    "But other Republicans  especially Dave White and Bill McSwain have remained in the race and kept the field fractured.",
    "Today, Donald Trump endorsed Doug Mastriano for governor in Tuesdays Pennsylvania Republican primary.",
    "Endorsing Mastriano could be a kind of insurance policy in case Oz does lose on Tuesday.",
    "Trump has used 2022 endorsements to try to position himself as a kingmaker in the GOP.",
    "Recently, Melissa Hart and Jake Corman dropped out the race to endorse Barletta.",
    "Doug Mastriano is widely regarded as maybe the weakest GOP nominee for governor.",
    "Trumps endorsement of Mastriano could also boomerang on the former president.",
    "Polling places Mastrianos support in the primary at somewhere in the 20s.",
    "To that end, he has often endorsed candidates with major polling leads.",
    "Even in closer races, he has often endorsed candidates with momentum.",
    "Lou Barletta is currently in second place in most polls.",
    "That divided field favors Mastriano.",
    "All this brings us to Pennsylvania."
  ]
}