{
  "id": 3402,
  "mediaId": 409,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "The Ron DeSantis Dog That Hasnt Barked Yet",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/ron-desantis-1.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/the-ron-desantis-dog-that-hasnt-barked-yet/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan McLaughlin",
  "authorUrl": "https://www.nationalreview.com/author/dan-mclaughlin/",
  "termIds": [
    661,
    2095
  ],
  "sentences": [
    "One of the big stories of 2022, the outcome of which will become clearer over the next two months, is Donald Trumps frantic effort to prove his continuing relevance and power within the Republican party by endorsing Republican candidates in primary elections.",
    "Hes also tending his own backyard, knowing that he needs a convincing re-election this fall and one more strong session of the Florida legislature next spring if he wants to use his governorship as a platform for a national bid in 2024.",
    "And if DeSantis remains in good shape in the fall, he can always do some campaign stops out of the state and/or dole out fundraising help as a way of building ties to other Republicans against Democrats.",
    "Amidst all the media attention to Trumps endorsements, however, there is a very big dog that hasnt barked: his chief rival for leadership of the national Republican party, Florida governor Ron DeSantis.",
    "He has waded into nearly every contested primary for senator or governor, sometimes exercising decisive influence, other times obviously trying to front-run by picking people who are already winning.",
    "It creates opportunities for rivals: Mike Pence is campaigning next week for Brian Kemp in Georgia, opposing the Trump-backed candidacy of David Perdue.",
    "By some counts, including incumbents who are running unopposed or effectively unopposed, Trump has endorsed around 150 Republicans across the nation.",
    "DeSantis has not been shy about endorsing in contested primaries within Florida, cementing his own control of his own state party.",
    "The profligacy of the endorsements puts Trump at risk, as voters can show that he is no longer dictating outcomes.",
    "This approach has its own risks: DeSantis is passing up the opportunity to pile up chits he could call in later.",
    "Time will tell if this is a wise choice, but it is quite different from the strategy Trump is following.",
    "It creates enemies within the party among candidates who had to overcome Trump to win nominations.",
    "Even when he spoke up for Kemp, it was to blast the Democrat, Stacey Abrams.",
    "But he has been entirely silent on primary races outside of his own state.",
    "Hes avoiding direct, premature tests of strength against Trump.",
    "But it also builds a cadre of people who owe him.",
    "But it has its own advantages.",
    "Hes not making enemies."
  ]
}