{
  "id": 3894,
  "mediaId": 129,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "G.O.P. Lawmakers Recast Abortion Stance, Wary of Voter Backlash",
  "image": "https://static01.nyt.com/images/2022/05/06/us/politics/06dc-abortion-gop-mcconnell/merlin_206337891_76418de9-1ded-4c72-95bb-d8513873c79a-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/06/us/politics/republicans-abortion.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1073,
    1765,
    2095,
    4181,
    146,
    428,
    482,
    545
  ],
  "sentences": [
    "The figure is about 12 percent now, said Dr. Nisha Verma, a fellow at the college and a gynecologist in Washington, D.C.\nThe need for abortion will never go away,? Dr. Verma said, but, she added, Weve definitely seen that people have been able to take more control in their reproductive health.?\nAnother study in the Journal of the American Medical Association found a 21.6 percent jump in the use of such contraception in the months after the 2016 election of Mr. Trump, with his vows to install justices who would overturn Roe.",
    "WASHINGTON  Republicans have spent decades attacking the landmark Supreme Court decision that legalized abortion nationwide, but with the toppling of Roe v. Wade seemingly imminent, their leaders in Congress and around the country have grown suddenly quiet on the issue, part of a bid to avoid a backlash against their party ahead of the midterm elections.",
    "State Representative Gene Wu, a Houston Democrat, said he worries that in Republican states that have been living with steadily rising restrictions on reproductive rights, the response to overturning Roe could be as muted as it has been in Texas, and that in Democratic states, voters will be reassured that their rights are safe.",
    "Even as some of their counterparts at the state level race forward with far-reaching abortion bans that could even affect some methods of contraception, Republicans appear determined to recast their position on the issue as one of moderation and avert the gaze of voters away from their anti-abortion-rights agenda.",
    "I hope thats not the case.?\nAnother factor mitigating the backlash might be the rising popularity of long-term contraception, such as IUDs, and the increased access to birth control in general, which has helped lower the nations abortion rate in recent years and given more women a sense of reproductive security.",
    "Still, the problem for Republican leaders in Washington who want to downplay the implications of the potential ruling is the very clear message coming from their partys state legislators about the severe restrictions many would enact if there were no longer a right to an abortion in the Constitution.",
    "New Hampshire State Representative Susan DeLemus was filmed responding to abortion-rights protesters at the State Capitol in Concord, N.H., on Thursday by screaming that they were murderers.?\nTo a certain extent, opponents of abortion say they really are in a moment of unreality.",
    "This is an issue that is defining for this country today, and if the American people dont stand up for equality for every American at this moment in time, we will be undermining a right to privacy in more than this context,? said Senator Kirsten Gillibrand, Democrat of New York.",
    "In the days after the leak of a draft Supreme Court opinion that would overturn the 50-year-old precedent, Republicans in Congress have notably refrained from taking a victory lap for having helped to install the conservative majority that has paved the way for such an outcome.",
    "Republicans, by contrast, believe their candidates job right now is to remain focused on the economy and not allow any other issue  particularly one that could alienate suburban independent voters whose backing they need to win congressional majorities  to distract them.",
    "A decade-old study by the American College of Obstetricians and Gynecologists found that the percentage of women in childbearing years using long-acting, reversible contraception had risen steadily, from 2.4 percent in 2002 to 8.5 percent in 2009 to 11.6 percent in 2012.",
    "She called the Democrats Womens Health Protection Act far outside the American mainstream.?\nAnd mainstream? is how the Republican campaign arms want their candidates to present themselves  as soft-spoken, compassionate, consensus builders,? as the talking points put it.",
    "That is what the midterms are going to be about  period, end of discussion.?\nFrom Opinion: A Challenge to Roe v. Wade\nCommentary by Times Opinion writers and columnists on the Supreme Courts upcoming decision in Dobbs v. Jackson Womens Health Organization.",
    "On Wednesday, lawmakers in Louisiana pushed forward legislation that would do precisely what the Washington talking points deny: grant constitutional rights to all unborn children from the moment of fertilization,? and classify abortion as homicide.",
    "Their leaders and candidates have built a campaign to reclaim control of the House and Senate around inflation, economic uncertainty, crime, border control and American doubts that President Biden, who is deeply unpopular, can right the ship.",
    "The approach is calculated to exploit the fact that Democrats, outraged about the ruling yet powerless to do anything about it, are planning a symbolic vote that puts their party on the record opposing almost any abortion limits.",
    "Big picture, tell me what the 30-year fixed mortgage rate will be and if anything has improved with gas and groceries, and Ill tell you the results,? said Corry Bliss, a veteran strategist who advises Republican candidates.",
    "On Wednesday, Senate Democrats will try  and likely fail  to take up legislation that would not only codify the right to an abortion, but also nullify restrictions that have passed muster with the courts.",
    "A document circulated by the National Republican Senatorial Committee and obtained by Axios urged candidates to be low-key about the issue, with a post-Roe America looming as early as next month.",
    "But if you disagree with me, my doors always open.?\nGovernors like Brian Kemp of Georgia and Ron DeSantis of Florida have said relatively little on the issue since the draft opinion came out.",
    "The Democrats are going to make this easy for us,? said Mallory Carroll, vice president of communications at Susan B. Anthony List, which works to elect officials who oppose abortion rights.",
    "Carol Tobias, president of the National Right to Life Committee, said she had been preparing for a good nights sleep in her Albuquerque home when the news first broke of the draft opinion.",
    "Such a law could, in fact, put women and doctors in prison and ban certain types of contraception, such as IUDs or morning-after pills, that block implantation of a fertilized egg.",
    "The ruling struck down laws in many states that had barred abortion, declaring that they could not ban the procedure before the point at which a fetus can survive outside the womb.",
    "Republicans in South Dakota, Indiana and Nebraska have called for special sessions of their legislatures to move on strict abortion bans as soon as a final decision is announced.",
    "And if any party is being extreme, it instructed Republicans to argue, it is the Democrats, who will not accept even modest restrictions on abortion that most Americans support.",
    "Not a leaked draft but the fact that the draft was leaked.?\nThe Republicans caution reflects the potential for the eventual ruling to change the midterm political landscape.",
    "Jamelle Bouie: The leak proves that the Supreme Court is a political body, where horse-trading and influence campaigns are as much a part of the process as legal reasoning.",
    "While Democrats decry a draft opinion that would eliminate the constitutional right to an abortion, Republicans who worked decades for this moment have been largely silent.",
    "Democrats have signaled that they plan to use the coming decision as a rallying cry for voters to reject Republicans, portraying its implications as vast and unacceptable.",
    "You need  it seems to me, excuse the lecture  to concentrate on what the news is today,? Senator Mitch McConnell of Kentucky, the Republican leader, said on Tuesday.",
    "Sway: In the latest episode of her podcast, Kara Swisher talks to an abortion rights advocate about the draft opinion and the future of abortion rights in America.",
    "Emily Bazelon: By suggesting in the draft that the progress women have made is a reason to throw out Roe, Justice Samuel Alito has turned feminism against itself.",
    "She raised the specter of a conservative Supreme Court going after gay marriage, consensual same-sex relations and even contraception if the decision stands.",
    "States should have the flexibility to implement reasonable restrictions.?\nRepublicans do not want to throw doctors and women in jail, the document continued.",
    "Even former President Donald J. Trump, who campaigned in 2016 on appointing Supreme Court justices who would overturn Roe, has refrained from gloating.",
    "Nobody knows exactly what it represents,? he told Politico, calling the leak of the opinion a terrible thing for the court and for the country.",
    "Now the prospect of eliminating abortion rights has added a tectonic change to American life into the mix, threatening to upend that focus.",
    "Weve taken so much abuse; whats a little more?? he said, likening women in states like Texas to the frog in the boiling pot of water.",
    "Justice Harry A. Blackmun, a modest Midwestern Republican and a defender of the right to abortion, wrote the majority opinion.",
    "In the third, it allowed states to ban abortions so long as exceptions were made to protect the life and health of the mother.",
    "A near-total abortion ban has been in place in Texas for eight months, and seemingly no political price has been paid so far.",
    "Its still possible a justice or two has changed positions.?\nRepublicans say their restraint on the issue makes sense.",
    "The practice would likely be banned or restricted heavily in about half of them, but many would continue to allow it.",
    "Thirteen states have so-called trigger laws, which would immediately make abortion illegal if Roe were overturned.",
    "Chief Justice John Roberts confirmed that the leak was authentic but cautioned that the decision was not final.",
    "I am pro-life, but this isnt about political labels,? the documents suggest Republican candidates say.",
    "And for all the caution Republican strategists might advise, there is still the passion of the issue.",
    "Roe v. Wade created a framework to govern abortion regulation based on the trimesters of pregnancy.",
    "Roe v. Wade is a landmark Supreme court decision that legalized abortion across the United States.",
    "It might mean overcoming ones own hesitation to provide procedures ike second-trimester abortions.",
    "Abortion should be avoided as much as possible,? the document advised candidates to say.",
    "I believe all Americans want us to welcome every child into the world with open arms.",
    "Individual states would be able to decide whether and when abortions would be legal.",
    "Alison Block: Offering compassionate care is a core aspect of reproductive health.",
    "In 1992, the court tossed that framework, while affirming Roes essential holding.",
    "That point, known as fetal viability, was around 28 weeks when Roe was decided.",
    "Well talk about it after we find out what the definitive version is,? he said.",
    "Bret Stephens: Roe v. Wade was an ill-judged decision when it was handed down.",
    "But overturning it would do more to replicate its damage than to reverse it.",
    "This has been done so incrementally, its like theres a learned helplessness.",
    "It is still possible that the court will not go as far as the draft.",
    "I certainly hope it is the final draft, but Ive been told it isnt.",
    "She said she thought someone had pulled a prank on the reporters.",
    "What came out earlier this week is three months old,? she said.",
    "In the second, it allowed regulations to protect womens health.",
    "Today, most experts estimate it to be about 23 or 24 weeks.",
    "In the first trimester, it allowed almost no regulations.",
    "Republicans are talking about abortion, just not openly.",
    "They certainly do not want to take away contraception.",
    "The 7-2 ruling was announced on Jan. 22, 1973.",
    "What would happen if Roe were overturned?",
    "Even now, she said she is cautious.",
    "Card 1 of 4\nWhat is Roe v. Wade?",
    "What else did the case do?",
    "What was the case about?"
  ]
}