{
  "id": 39,
  "mediaId": 151,
  "date": "3/20/2022 12:00:00 AM",
  "headline": "How the GOP's dirtiest slur got a new life",
  "image": "https://www.politico.com/dims4/default/af22ea3/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fb3%2F06%2F341eba334476adc1934e5c70dc3a%2F220319-liz-cheney-sign-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/03/20/republicans-2022-campaigns-00018591",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2095,
    1921,
    1921,
    2351,
    2351,
    2095,
    693,
    693,
    1248,
    1248,
    1147,
    1147,
    428,
    428,
    2910,
    2910
  ],
  "sentences": [
    "On ads on Facebook last year, one right-wing PAC spent heavily blistering Republicans who voted to impeach Trump or to investigate the insurrection at the Capitol on Jan. 6, labeling them RINO turncoats? or RINO traitors?  even RINO communist traitors.?\nTexas Attorney General Ken Paxton has begun running social media messages asking voters to choose RINO Establishment vs. Trump?  juxtaposing an image of him and Trump against one of George P. Bush and his father, former Florida Gov.",
    "In the long term, said Inglis, it's not a winning strategy to have a party where we figure out who to kick out.?\nAs Trump and others continue to throw people out of the party,? he said, maybe they're going to whittle it down to the point where all the folks who have had an attempt on their party membership rise up and say, Wait a minute, maybe you're the Republican-In-Name-Only.'?\nIf that happens, it likely won't be soon.",
    "That doesn't include the raft of RINO-focused appeals appearing on social media and in mailers  or the RINO Hunter? T-shirts worn by a group of far-right Republicans at a local GOP meeting in California's Orange County earlier this year, with crosshairs in place of the O.?\nIt's RINO season, and there's no bag limit!? Nick Taurus, a long-shot House candidate, said on Twitter, where he posted a photo of the group.",
    "Cheney is a pretty conservative person,? he said, and I won't say she's a RINO.?\nOne of the biggest problems we have in the Republican Party,? George said, is if you have an ultra-right conservative who has a slight disagreement with another Republican, it doesn't matter if they're in the same lane 90 percent of the time or 50 percent of the time, usually the term RINO gets thrown out there.?",
    "Claire Wirth, a Republican running to unseat Rep. Thomas Massie (R-Ky.), is calling out RINO Republicans? in a video, suggesting Massie's crime is that he turned his back on President Trump.?\nThe use of RINO has become so widespread that it can now include almost any Republican, including some of the most conservative stalwarts in the party.",
    "In Wyoming, where the RINO sticker has been plastered on Cheney more consistently than almost anywhere else, Richard George, a former Republican National Committee member from the state, said he won't vote for her reelection because of her handling of the Trump impeachment and its aftermath  not because her ideology is suspect.",
    "It's effective in part, said Jim McLaughlin, a veteran Republican pollster, because it's a phrase that comes out of the mouths of the voters, that comes out of the mouths of the base.? There is a sense of familiarity that is reinforced when a candidate insults squishy? Republicans just like they do.",
    "Reminding base voters of the stakes of the primaries  the potential elimination of many, many RINOs?  said Tom Tancredo, a former Republican congressman from Colorado, helps fuel the fire.?\nWhile the RINO term has been employed in some form for more than 100 years, its meaning has shifted over time.",
    "When a candidate uses that today against someone, I read that as a sign of desperation, that they don't have the ability or the willingness to specify what they have a problem with, so they're trying to just engender a sense that their opponent is not committed,? he said.",
    "The phrase's significance, said Mike Madrid, a Republican strategist who was a co-founder of the anti-Trump Lincoln Project, is in its ability to enforce discipline among the tribe.?\nWhat used to be about ideology is now about loyalty,? Madrid said.",
    "Rory McShane, a Republican strategist, has tested RINO as an attack with Republican primary voters and found the line effective, but only when the opponent's RINO-like behavior was explained  whether on immigration, gun control or any other issue.",
    "Today, he said, The level of the rhetoric is new.?\nIn Pennsylvania, a super PAC working to undermine Mehmet Oz's conservative credentials in that state's Senate primary ran TV ads depicting him crouching behind a rhinoceros.",
    "But former President Donald Trump's frequent use of the term has given it a new life, weaponizing a description once largely reserved for party moderates and turning it into a slur to be avoided at all costs.",
    "On Friday, an independent expenditure committee supporting former Sen. David Perdue, Trump's preferred candidate in the Georgia gubernatorial primary, began airing an ad featuring Trump calling Georgia Gov.",
    "He was tired,? he said, of debt junkie, weak-kneed, open-border RINOs who sell out our conservative values.?\nFor the MAGA set, the term has become a useful shorthand to refer to the establishment.",
    "Just last week, after Trump suggested he may reconsider his endorsement of Rep. Mo Brooks in the Alabama Senate primary, a desperate Brooks dropped a TV ad singing straight from Trump's songbook.",
    "| Michael Ciaglo/Getty Images\nBy David Siders\n 03/20/2022 07:01 AM EDT\nIn speeches, ads and on social media, it is fast becoming the defining smear of the 2022 primary campaign season: RINO.",
    "You have to explain how they've betrayed the conservative movement.?\nAnother Republican strategist who has poll-tested the effectiveness of RINO messaging came to a similar conclusion.",
    "Rejection of Trump's false claims of election fraud  or worse, a vote to impeach the former president  are common threads among those targeted by the former president for the insult.",
    "The intensity of it seems to grow ever stronger,? said Bob Inglis, a former Republican congressman who was labeled a RINO? himself in his defeat in a South Carolina primary in 2010.",
    "But so far in 2022, candidates have already spent more than $4 million on TV ads employing RINO as an attack, in races ranging from House and Senate contests to state House races.",
    "Another Republican strategist who has poll-tested the effectiveness of RINO messaging found Liz Cheney Republican? may be just as effective for a stand-in when RINO gets old.",
    "In 2018, during the last midterm election, RINO barely registered as a mention in TV ads, according to an analysis compiled for POLITICO by the ad tracking firm AdImpact.",
    "Brian Kemp a RINO governor.?\nThe term is now so ubiquitous, said James Dickey, the former chair of the Texas Republican Party, that it's suffering from overuse.",
    "Today, in a reflection of the GOP's murkier ideological grounding in the Trump era, it's a term reserved almost exclusively for lack of fealty to Trump.",
    "So is Sen. Lindsey Graham of South Carolina, former President George W. Bush and the entire Maricopa County Board of Supervisors.",
    "In previous decades, a Republican risked getting tagged as a RINO for supporting tax increases, gun control or abortion rights.",
    "The impact, Dickey said, is diminishing rapidly.?\nIt's true that some uses of the term are more effective than others.",
    "You're a traitor to the team, and that's a powerful emotion.?\nBut the term is also, plainly, an exclusionary one.",
    "During just the past six months, the list of Republicans Trump has branded with the term includes Arizona Gov.",
    "The party no longer has orthodoxy, so now it's, You're not loyal.'?\nThe evidence of that is explicit.",
    "Inglis, a victim of the tea party wave in 2010, said he used to run in fear of being branded a RINO.",
    "He also found Liz Cheney Republican? may be just as effective for a stand-in when RINO gets old.",
    "Doug Ducey and RINO Congressman Peter Meijer.? Loser Liz Cheney? is a Republican-In-Name-Only.",
    "The acronym  short for Republican-In-Name-Only'  is hardly new.",
    "Republican primary voters are anesthetized to that,? he said.",
    "It's a claim of apostasy, it's a claim of Benedict Arnold.",
    "The mushrooming of the insult is measurable.",
    "You can't just say this person is a RINO.",
    "For some Republicans, it already is.",
    "It's terribly effective,? he said.",
    "But the term may still wear out.",
    "I think it's become clich.",
    "Jeb Bush."
  ]
}