{
  "id": 4140,
  "mediaId": 65,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Landmark abortion ruling to be struck down, leak suggests; High prices here to stay, experts say",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/05/1862/1048/BT-thumb-scotus.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/us/landmark-abortion-ruling-to-be-struck-down-high-prices-here-to-stay-experts-say",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Durschlag",
  "authorUrl": "",
  "termIds": [
    661,
    1646,
    2095
  ],
  "sentences": [
    "- SEAN HANNITY\nFOLLOW FOX NEWS ON SOCIAL MEDIA\nYouTube\nSIGN UP FOR OUR NEWSLETTERS\nFox News Opinion\nFox News Lifestyle\nDOWNLOAD OUR APPS\nWATCH FOX NEWS ONLINE\nFox News Go\nThis edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "Continue reading \nWILL CAIN  Fox host roasted Dr. Anthony Fauci for skipping out on the White House Correspondents Dinner for health reasons while attending the before and after parties for the dinner, without wearing a mask.",
    "And here's what you need to know to start your day ...\nSUPREME LEAK - The Supreme Court is poised to strike down Roe v. Wade, according to an unprecedented leak of a draft opinion written by Justice Samuel Alito.",
    "Continue reading \nSWEET DEAL - Kansas politicians criticized the secrecy of a new law that could give $1 billion in public subsidies to an undisclosed company considering opening a plant in the state.",
    "Continue reading \nHIGHER COSTS - Experts and investors warned inflation is likely to plague the country for years, despite reassurance from President Biden and Fed Chairman Jerome Powell.",
    "Continue reading \nINSIDE JOB - An escaped Alabama murder suspect is on the run as a top official at the jail whom colleagues expected to retire has been linked to the jailbreak.",
    "Continue reading \nTWEET WIPED CLEAN - The New York Times deleted a tweet that Kathy Boudin, a member of the Weather Underground, had died, replacing it with softer language.",
    "Continue reading \nDR MARC SIEGEL - Patients must be seen and treated as individuals, guidelines are intended to guide, and not meant to be converted to mandates or dictums.",
    "Continue reading \nPRIMARIES HEAT UP - Midwestern states kick off a frenetic schedule this month, with 13 states  including North Carolina and Georgia - holding primaries.",
    "Continue reading \nLAURA INGRAHAM  Fox host explained that Democrats promoting sex-change surgeries and hormone blockers will create long-term ramifications for children.",
    "Continue reading \nRUFO FIRES BACK - Christopher Rufo called out MSNBC for referring to him as the \"far-right mastermind\" behind growing education issues in the country.",
    "Continue reading \nTODDLER ERRANDS - A Japanese reality TV show now on Netflix featuring scenes of children carrying out errands outside their homes is sparking debate.",
    "Continue reading \nOPINION\nMELANIA TRUMP, REP. JACKIE WALORSKI - Foster care protects children, strengthens families, and builds a better future for our nations youth.",
    "Continue reading \n'IT'S ABOUT DIVERSITY OF THOUGHT' - Emily Compagno hits back after \"The View\" host claims Elon Musk wants free speech for \"straight, White men.\"",
    "Continue reading \nANTISEMITISM, SQUAD WORDS TIED - Antisemitic incidents spiked around the same time members of \"the Squad\" were ramping up anti-Israel rhetoric.",
    "Continue reading \nSEAN HANNITY  Fox host discusses MSNBC host, Mehdi Hasan, claiming the neo-Nazi faction of GOP will grow because of Musk's Twitter purchase.",
    "Continue reading \nIN OTHER NEWS\nSTRONG FAITH - Chad Michael Murray explains keeping his faith strong in Hollywood: 'I stick to the things I believe in.'",
    "Continue reading \nR-E-S-P-E-C-T - NFL rookies receive advice from Super Bowl champions, other veterans on how to receive respect in the locker room.",
    "The draft leak obtained by Politico was written in early February, but it was not immediately clear if it has been rewritten or revised.",
    "Continue reading \nCASE DISMISSED - Kardashian-Jenners win Blac Chyna defamation lawsuit: \"Justice has prevailed,\" family attorney says.",
    "Continue reading \nDESANTIS UNDER FIRE - MSNBC, \"The View\" and late-night hosts repeatedly hurl personal attacks at Florida Gov.",
    "Continue reading \nUKRAINE AID - Reps. Mike Turner said Congress had to pull the Biden administration forward on Ukraine aid.",
    "Continue reading \nTUCKER CARLSON  Fox News host argues that the Ukraine war is designed to create regime change in Moscow.",
    "Continue reading \nJACK BREWER - MSNBC's Joy Reid and all critical race theory advocates owe our children an apology.",
    "Continue reading \nPOLITICS\nW LENDS SUPPORT - President George W. Bush is slated to appear at event for Georgia Gov.",
    "Continue reading \nDRESSING UP - Kim Kardashian wears Marilyn Monroe's \"Happy Birthday, Mr. President\" dress.",
    "Unlike a group of Apple employees who claim it's racist to force them to return to a physical office.",
    "All my critics, feel free to attack me because that's what free speech is all about.",
    "Continue reading \nFOX WEATHER\nWhats it looking like in your neighborhood?",
    "Good morning and welcome to Fox News morning newsletter, Fox News First.",
    "Continue reading\nTHE LAST WORD\n\"Elon Musk is saying, stay on Twitter.",
    "Continue reading \nGREG GUTFELD - We're happy to be back at work.",
    "Thank you for making us your first choice in the morning!",
    "Subscribe now to get Fox News First in your email.",
    "Brian Kemp, opponent of Trump-backed David Purdue.",
    "Well see you in your inbox first thing Wednesday.",
    "They're that upset.\"",
    "Ron DeSantis."
  ]
}