{
  "id": 4460,
  "mediaId": 223,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Georgia Sets Early Voting Record and Debunks 'Jim Crow 2.0' Fear-Mongering",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2020/310/3cac8080-5cfd-4d12-9359-27288f66131e.jpg",
  "link": "https://townhall.com/columnists/spencerbrown/2022/05/19/georgia-sets-early-voting-record-and-debunks-jim-crow-2-0-fear-mongering-n2607511",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Brown",
  "authorUrl": "https://townhall.com/columnists/spencerbrown/",
  "termIds": [
    2095
  ],
  "sentences": [
    "In the last year, Joe Biden called the election integrity law \"Jim Crow in the 21st Century? and Jim Crow 2.0? while claiming the legislation would cause voter suppression? and said such bills make Jim Crow look like Jim Eagle.?\nEd Bastian, the CEO of Delta Air Lines based in Atlanta, said the legislation was unacceptable,? wrong,? and claimed it was \"evident\" the law would make it harder? for Georgians to vote.",
    "The 2021 Major League Baseball All-Star game was even pulled from Georgia with President Biden's support and given to Colorado over the legislation, a decision MLB commissioner Bob Manfred said was necessary to demonstrate our values as a sport.?\nThe CEO of Coca-Cola, James Quincey, said the election integrity bill was \"wrong\" and needed \"to be remediated.\"",
    "What's more, the provisions passed in Georgia and other states  such as requiring a photo ID to vote  enjoy significant majority approval among the American people, even among Democrats, making leftist opposition to such laws aimed at making elections more secure all the more absurd.",
    "Those companies were joined by BlackRock, JPMorgan Chase, American Express, Citigroup, Google, Porsche North America, UPS, Microsoft, Aflac, Bank of America, Cisco and Viacom CBS  all of which also issued statements opposition the Georgia bill, as a list Newsweek compiled shows.",
    "So far, Georgia's election officials have received 422,565 in-person early voting ballots, a number that is some 200 percent higher than this point in the 2018 midterms and 150 percent more than this point in the 2020 cycle ahead of Friday's cutoff for early voting.",
    "Coming as no surprise to proponents of legislation to make it easier to vote and harder to cheat, the reality now playing out in Georgias 2022 elections is anything but the dystopian future Democrats and woke corporations predicted in their baseless fear-mongering.",
    "The party data shows that more than 260,000 are GOP ballots while nearly 200,000 are Democrat ballots  a disparity that is attributable to the fact that the GOP gubernatorial primary is contested while Stacey Abrams is unchallenged in the Democrat primary.",
    "Source: AP Photo/Brynn Anderson\nWhen Republican legislators in Georgia put forward the Election Integrity Act of 2021, liberal talking heads, mainstream media outlets, woke corporations, and Democrat politicians lost their collective mind.",
    "Despite the loud and hyperbole-filled opposition, the law was passed and Republican Governor Brian Kemp signed the measure into law while noting criticism of the legislation was disingenuous and completely false.? Kemp was right.",
    "Far from being disenfranchised, the election integrity policies passed by Republicans in Georgia have only boosted election participation  something President Biden and all those woke companies declared they wanted.",
    "As Townhall covered previously, a similar scenario played out in Texas  where a comparable election security measure was enacted  that showed secure elections see greater turnout and participation from citizens.",
    "If the American people want greater confidence in the integrity of elections, and the laws result in even more Americans participating in the democratic process, why do Democrats so staunchly oppose them?",
    "The inverse is also true: when people ascribe to the belief that elections are rigged, then there's no need for them to participate because the ultimate outcome has already been decided.",
    "When citizens know that their vote is less likely to be canceled out by a fraudulent ballot, they want to be engaged in the process because they know their voice counts in the outcome.",
    "In Texas, as in Georgia, the passage of election integrity laws did not disenfranchise voters, but gave them more confidence and motivation to vote  as the numbers prove.",
    "That is, if it wasn't blatantly obvious, Georgia voters are not facing \"suppression? or being disenfranchised as a result of the states 2021 election security law.",
    "But as Georgians vote in the 2022 midterms, the laws proponents are being vindicated and its opponents are looking more unserious than ever.",
    "But dont hold your breath for them to now issue statements applauding Georgia Republicans work to increase the number of active voters.",
    "Merck, Apple, and Facebook also came out against the secure election law, claiming that it would somehow disenfranchise voters.",
    "In Texas, the increased turnout debunked fear-mongering that was similar to what Georgia Republicans faced.",
    "In 2018, there were around 2.6 million votes cast, but in 2022 there were more than 2.9 million votes.",
    "In the Lone Star State's 2022 primary election, turnout was greater than the last midterm cycle.",
    "To do so would be to admit they were wrong all along.",
    "It's not rocket science."
  ]
}