{
  "id": 4466,
  "mediaId": 302,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Biden invokes Defense Production Act for baby formula shortage",
  "image": "https://www.tampabay.com/resizer//5kLKR193Co7lpWW74a-z34xFkXI=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/WPJQK4NFUJSM4ZFCTUWWCLZPJI.jpg",
  "link": "https://www.tampabay.com/news/nation-world/2022/05/18/biden-invokes-defense-production-act-for-baby-formula-shortage/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.tampabay.com/author/associated-press",
  "termIds": [
    821,
    1983,
    2087,
    2095,
    2107,
    2303,
    3102,
    196,
    548,
    562,
    3105,
    3617,
    2791
  ],
  "sentences": [
    "Biden is also authorizing the Defense Department to use commercial aircraft to fly formula supplies that meet federal standards from overseas to the U.S., in what the White House is calling Operation Fly Formula.?\nSupplies of baby formula across the country have been severely curtailed in recent weeks after a February recall by Abbott Nutrition exacerbated ongoing supply chain disruptions among formula makers, leaving fewer options on store shelves and increasingly anxious parents struggling to find nutrition for their children.",
    "Ive directed my team to do everything possible to ensure theres enough safe baby formula and that it is quickly reaching families that need it the most,? Biden said in the statement, calling it one of my top priorities.?\nThe White House actions come as the Democratic-led House is expected to approve two bills Wednesday addressing the baby formula shortage as lawmakers look to show progress on what has become a frightening development for many families.",
    "This is throwing more FDA staff at a problem that needs more production, not more FDA staff,? said Rep. Bill Huizenga, R-Mich.\nRep. Rosa DeLauro, the Democratic chair of the House Appropriations Committee, said the money would increase FDA staffing to boost inspections of domestic and international suppliers, prevent fraudulent products from getting onto store shelves and acquire better data on the marketplace.",
    "In a letter Wednesday to the Department of Health and Human Services and the Department of Agriculture, Biden directed the agencies to work with the Pentagon to identify overseas supply of formula that meets U.S. standards over the next week, so that chartered Defense Department flights can swiftly fly it to the U.S.\nImports of baby formula will serve as a bridge to this ramped-up production,? Biden wrote.",
    "WASHINGTON  President Joe Biden on Wednesday invoked the Defense Production Act to speed production of infant formula and authorized flights to import supply from overseas, as he faces mounting political pressure over a domestic shortage caused by the safety-related closure of the countrys largest formula manufacturing plant.",
    "Takeaways from Tuesdays primaries in Pennsylvania, North Carolina, Kentucky, Idaho and Oregon:\nTrump wins some, loses some\nThe former president entered the primary season on a high after JD Vance, his endorsed candidate in Ohios hypercompetitive GOP Senate contest, shot from third to first.",
    "As a parent and as a grandparent, I know just how stressful that is.?\nThe announcement comes two days after the Food and Drug Administration said it was streamlining its review process to make it easier for foreign manufacturers to begin shipping more formula into the U.S.",
    "And in the Pennsylvania governors race, a Trump-backed candidate who has spread lies about the 2020 vote count won the GOP nomination, putting an election denier within striking distance of running a presidential battleground state in 2024.",
    "Election denialist wins key Republican primary\nTrump has made election denial a key loyalty test in the Republican Party, and that may have kneecapped his party in Pennsylvania with the victory of Mastriano, a vocal election denier.",
    "Shapiro, who was uncontested, has appeared eager to take on Mastriano, running a television ad calling Mastriano one of Donald Trumps biggest supporters,? a move that seemed designed to boost the state senator with GOP voters.",
    "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right Doug Mastriano, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "WASHINGTON  Former President Donald Trumps support was enough to elevate his Senate candidate to victory in North Carolina on Tuesday, while his pick in Pennsylvania remained in a tough fight in that states Senate primary.",
    "Regulators said Monday that theyd reached a deal to allow Abbott Nutrition to restart its Sturgis, Michigan, plant, the nations largest formula plant, which has been closed since February due to contamination issues.",
    "Right from the get-go we were limited in our ability to determine with a causal link whether the product was linked to these four cases because we only had sequences on two,? FDAs food director Susan Mayne said.",
    "The other measure, a $28 million emergency spending bill to boost resources at the Food and Drug Administration, is expected to have less bipartisan support and its unclear whether the Senate will take it up.",
    "The goal is to give participants in an assistance program commonly known as WIC the ability to use vouchers to purchase formula from any producer rather than be limited to one brand that may be unavailable.",
    "He angered local Republicans by choosing to run in a different district after new congressional maps were drawn this year, then coming back to his original district when litigation shifted the lines again.",
    "After a six-week inspection, FDA investigators published a list of problems in March, including lax safety and sanitary standards and a history of bacterial contamination in several parts of the plant.",
    "When Little traveled out of state, McGeachin proclaimed herself the effective governor and issued executive orders banning mask and vaccine mandates, which he nullified upon returning to the state.",
    "Trump had shocked party faithful in North Carolina when he endorsed U.S. Rep. Ted Budd, a little-known congressman, last June for the Senate seat being vacated by retiring Republican Richard Burr.",
    "One bill expected to have wide bipartisan support would give the secretary of the Department of Agriculture the ability to issue a narrow set of waivers in the event of a supply disruption.",
    "The Defense Production Act order requires suppliers of formula manufacturers to fulfill orders from those companies before other customers, in an effort to eliminate production bottlenecks.",
    "In North Carolina, meanwhile, Rep. Madison Cawthorn lost his reelection bid Tuesday even after Trump urged voters to give Madison a second chance!? Trump also whiffed when Idaho Lt. Gov.",
    "His nod was widely seen as an effort to hedge his bets and guarantee a victory in the state in case his endorsed candidate for Senate, celebrity heart surgeon Mehmet Oz, loses his race.",
    "The young congressman, who uses a wheelchair after a car accident, became a media sensation when he first won a House seat at age 25, but he may have gotten singed under the spotlight.",
    "Rep. Cawthorn, the youngest member of Congress, was ousted from office on Tuesday by state Sen. Chuck Edwards after a rocky first term filled with salacious headlines and scandals.",
    "That raises questions about the 2024 presidential election and whether Mastriano, if elected, would follow the will of the voters if a candidate he opposes were to win the state.",
    "With Trump prioritizing fealty to his election lies over all else, many Pennsylvania Republicans fear the former president has undermined their chances in the crucial state.",
    "All the major statewide Republican hopefuls in one way or another cast doubt on the election results, but Mastriano was by far the loudest and thats what won him Trumps nod.",
    "Trump is facing down another possible defeat in next weeks high-stakes governors primary in Georgia, where his candidate is trailing in both polls and fundraising.",
    "Brian Kemp, whos also been using his incumbency to shore up his conservative bona fides against a challenger backed by the former president in next weeks primary.",
    "But after a rocky start, Budd easily captured his partys nomination, passing a crowded field of GOP rivals that included the states former governor, Pat McCrory.",
    "He touted steps hed taken to please conservatives by capitalizing on the benefits of office  signing tax cuts and a law banning abortion after about six weeks.",
    "I know parents across the country are worried about finding enough formula to feed their babies,? Biden said in a video statement released by the White House.",
    "Thats a warning for other Republicans who may feel that Trumps ability to hold his bases loyalty through repeated scandals makes them bulletproof, too.",
    "He organized buses to ferry Trump supporters to Washington for the Stop the Steal? rally that preceded the Jan. 6 U.S. Capitol insurrection.",
    "But FDA officials pushed back on that reasoning Monday on a call with reporters  their first time publicly addressing the companys argument.",
    "FDA staffers noted they were unable to collect bacterial strains from two of the four patients, limiting their chances of finding a match.",
    "Companies need to exhaustively clean the facility and equipment, retrain staff, repeatedly test and document there is no contamination.",
    "But in Idaho, with incumbency on his side, the sitting governor weathered a primary challenge from his far-right lieutenant governor.",
    "As part of the FDAs new import policy, regulators said companies would need to provide documentation of their factorys inspections.",
    "Mastriano backed baseless reviews of the election results in Pennsylvania, where Democrat Joe Biden won by nearly 100,000 votes.",
    "Still, the big picture wasnt that close  with eight candidates in the contest, Cawthorn won just 3 in 10 voters in the district.",
    "Abbotts voluntary recall was triggered by four illnesses reported in babies who had consumed powdered formula from its plant.",
    "Chicago-based Abbott has emphasized that its products have not been directly linked to the bacterial infections in children.",
    "She spoke at a conference sponsored by white nationalists and ran with several far-right allies for other statewide offices.",
    "And, most notoriously, Cawthorn insinuated that Washington Republicans had invited him to at least one cocaine-fueled orgy.",
    "Samples of the bacteria found at its plant did not match the strains collected from two babies by federal investigators.",
    "Under Mondays agreement, Abbott must regularly consult with an outside safety expert to restart and maintain production.",
    "Cawthorn last month was cited for carrying a handgun through an airport security checkpoint  his second such citation.",
    "Oz and former hedge fund CEO David McCormick were virtually tied early Wednesday, with more votes left to be counted.",
    "After getting the FDAs OK, Abbott said it will take eight to ten weeks before new products begin arriving in stores.",
    "And he says that if hes elected, hell ferret out fraud partly by making every single voter in the state reregister.",
    "It requires suppliers of formula manufacturers to fulfill orders from those companies before other customers.",
    "Mastriano will face Democrat Josh Shapiro, the states attorney general, in the November general election.",
    "Mastriano was the front-runner even before Trumps endorsement late last week helped cement his victory.",
    "That led them to try to coalesce around a last-minute alternative to Mastriano, but the effort failed.",
    "Mastriano has said he wouldnt have certified Bidens victory in Pennsylvania if hed been governor then.",
    "Power of incumbency in Idaho\nIn Idaho, Trump-inspired populism ran smack into the wall of incumbency.",
    "Fixing the violations uncovered at Abbotts plant will take time, according to former FDA officials.",
    "In March, he was cited for driving with a revoked license after being stopped for speeding twice.",
    "In a key congressional race, a Republican congressmans bad behavior finally caught up with him.",
    "Edwards, who was endorsed by Republican Sen. Thom Tillis, inched past Cawthorn in the primary.",
    "But Trumps tally Tuesday night included wins, losses and a marquee race too close to call.",
    "The company must overhaul its safety protocols and procedures before resuming production.",
    "All four infants were hospitalized with a rare type of bacterial infection and two died.",
    "Trump sought to give Cawthorn a boost on Monday, urging voters to keep him in office.",
    "But, in contrast to what happened in Pennsylvania, Republican voters in Idaho balked.",
    "GOP voters have had enough\nEven in Trumps Republican Party, there are limits.",
    "The WIC program accounts for about half of infant formula sales in the U.S.",
    "Little easily beat back a Republican primary challenge from Lt. Gov.",
    "McGeachin, despite her endorsement from the former president.",
    "The company didnt set a timeline to restart manufacturing.",
    "Its a good omen for the next Trump target  Georgia Gov.",
    "By ZEKE MILLER and KEVIN FREKING, Associated Press.",
    "Janice McGeachin, his pick, failed to defeat Gov.",
    "By JILL COLVIN and NICHOLAS RICCARDI",
    "McGeachin was deeply controversial.",
    "Brad Little in that states primary.",
    "Looking for real-time news alerts?",
    "Looking for real-time news alerts?",
    "But voters decided not to.",
    "Gov."
  ]
}