{
  "id": 4477,
  "mediaId": 195,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Little fends of Trump-backed primary challenge in Idaho governor primary",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/04/littlebrad_071620getty.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3491602-little-fends-of-trump-backed-primary-challenge-in-idaho-governor-primary/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    1106,
    1147,
    1903,
    2095,
    428,
    571,
    2706
  ],
  "sentences": [
    "Brad Little (R) successfully fended off several Republican challengers on Tuesday, one of whom was backed by former President Trump, and is projected to have secured Idahos GOP gubernatorial nomination.",
    "Trump saw one of his other endorsed gubernatorial candidates lose a primary last week, when businessman Charles Herbster lost to James Pillen in Nebraska.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "While McGeachin was seen as his most formidable opponent, Little was facing a total of seven primary challengers.",
    "Last year, McGeachin banned mask and vaccine mandates on two separate occasions when Little was out of state.",
    "Trump backed former Sen. David Perdue (R-Ga.) in his primary challenge against Georgia Gov.",
    "Little is one of two sitting GOP governors who Trump has gone against this primary season.",
    "Littles victory is seen as a defeat for Trump, who had thrown his support behind Lt. Gov.",
    "Little and McGeachin have clashed in the past, particularly on coronavirus policies.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "ABC News and CNN both called the race not long after 12 a.m.",
    "Janice McGeachin (R).",
    "Idahos incumbent Gov.",
    "Brian Kemp (R).",
    "ET."
  ]
}