{
  "id": 4485,
  "mediaId": 323,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "The Stonehenge of America Still Has Visitors Asking, What Is This Place?",
  "image": "https://images.wsj.net/im-545320/?width=700&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/stonehenge-of-america-georgia-tourists-11652801123",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron McWhirter",
  "authorUrl": "https://www.wsj.com/news/author/cameron-mcwhirter",
  "termIds": [
    1648,
    2095,
    3082,
    4325,
    4490,
    2672,
    2945,
    2953,
    4974,
    4975
  ],
  "sentences": [
    "Her publicly announced pledge to destroy the Georgia Guidestones? is the latest bout of wearying publicity for Elbert County and a roadside attraction the local Chamber of Commerce generously dubs the Stonehenge of America.?\nSet on a low hill about 7 miles outside of this town of 4,300, the cluster of monoliths is much smaller than the United Kingdoms Stonehenge and dont have quite the same bucket-list appeal (or a gift shop).",
    "Don Rains, who owns Cheap Deals Bargain Bazaar, says, Most of the tourists think its cool, not demonic, but when they get up there, its like, Is this it? Unfortunately for Elberton, when they get here theres not a whole lot else for them to do.?\nKrista Johnson, 43, of Detroit, visited the Guidestones on a road trip across the South.",
    "The inscriptions are a mix of direct and oblique messages, such as Avoid petty laws and useless officials.?\nThe state tourism board calls the Georgia Guidestones family friendly.? Some onlookers, though, see the monument as a possible road map of a coming Apocalypse.",
    "(Further afield, New Hampshire boasts a rocky site called Americas Stonehenge? and a foam replica in Virginia is known as Foamhenge.?)\nIn Elberton, no one has ever stepped forward to publicly disclose the identity of who designed and paid for the Guidestones.",
    "She has no idea who built them but says, Ill tell you for sure, somebody around here knows.?\nKandiss Taylor, a candidate in Georgias May 24 GOP primary for governor, claims the Guidestones were built by dark forces and tweets with the hashtag, #TearThemDown.",
    "The associations Elberton Granite Museum & Exhibit keeps a display about the Guidestones and sells postcards, but granite companies had nothing to do with the design or payment for the site, says Mr. Kubas.",
    "Yet the Guidestones have drawn strange attention since they were unveiled in 1980 under sunny skies and in the company of grazing cows,? according to a front-page article in the Elberton Star at the time.",
    "It would be a disaster to blow it up.?\nThe Guidestones are part of a string of countryside Georgia roadside attractions, which include the giant smiling peanut statue in Plains, home of Jimmy Carter.",
    "ELBERTON, Ga.A longshot Georgia gubernatorial candidate says one of her goals if elected is to demolish a mysterious 19-foot-three-inch high granite structure set in a remote cow pasture.",
    "The slabs are arranged to serve as an astronomical calendar and bear writings in living and dead languages including English, Arabic, Chinese, Hindi and Babylonian cuneiform.",
    "He was a marketer and he was pretty imaginative.?\nRoger Timura, 63, who lives nearby, doubts locals in the granite business could have orchestrated the elaborate Guidestones.",
    "The self-declared Granite Capital of the World? boasts about 40 quarries and produces roughly two-thirds of all the cemetery monuments in the U.S., according to Mr. Kubas.",
    "His daughter, Melissa Caruso, a real-estate agent in Elberton, says her father may have had a hand in the Guidestoness creation, though he never told her anything.",
    "Internet groups particularly chew over the inscription that declares the earth should have only 500 million people; about 7.9 billion are alive today.",
    "In a statement, the group sponsoring the monument urged people to contemplate the inscriptions and then announced the group was disbanding.",
    "Chris Kubas, executive vice president of the Elberton Granite Association Inc. smiled wanly when a reporter asked about the Guidestones.",
    "It is creepy, but its also kind of cool,? says Jessica Henry, a waitress at the Flat Tire Bar & Grill in sleepy downtown Elberton.",
    "Mr. Bridges says the monument is our instructions for when after everything goes to s---.?\nMs. Hutchins has a sunnier view.",
    "One persistent rumor posits the areas largest industrygranite monumentsbuilt the Guidestones to generate tourism and sales.",
    "He told the company president, Joe Fendley Sr., he represented a small group of Americans who seek the Age of Reason.? Mr.",
    "Over at the Guidestones, Nick Bridges, 40, and Elizabeth Hutchins, 23, of Anderson, S.C., had come to see for themselves.",
    "Christian? paid an undisclosed amount for the structure through an escrow account at a local bank, the booklet says.",
    "Mr. Fendley gathered with dignitaries and about 400 members of the public for an unveiling on March 22, 1980.",
    "Intrigue centers around the murky origins of the 119-ton monument and the mishmash of themes inscribed on it.",
    "Christian? walked into the Elberton Granite Finishing Corp., according to a booklet produced by the company.",
    "This is a really important thing in history and its weird that it was made in the 1980s,? she says.",
    "A man came to town that wanted a monument built.?\nIn 1979, a fellow calling himself R.C.",
    "I dont know that guys making countertops and tombstones could have come up with that.?",
    "Speculators have claimed the Guidestones appeared suddenly in the cow pasture.",
    "Shes had customers from as far away as Germany who came to see the monument.",
    "Vandals strike enough that authorities erected 24-hour security cameras.",
    "She learned about them down the rabbit hole of the Internet,? she says.",
    "Ill say this, its in the middle of nowhere,? says one Yelp reviewer.",
    "I think it was put here to help people,? but she isnt sure how.",
    "In Elbert County, people gossip about who ordered the monument.",
    "Forums discuss the monuments alignment with the moon and stars.",
    "He says he often fields calls about them from the public.",
    "Their campaigns declined to comment on the Guidestones.",
    "The Elberton Granite Association Inc. denies the rumor.",
    "I bet my daddy had something to do with it,? she said.",
    "If they did, then theyre smart as hell,? he says.",
    "Cable television shows bring curiosity seekers.",
    "Or a spaceship is buried underneath the stones.",
    "We sell monuments, thats what we do,? he says.",
    "Mr. Fendley became Elbertons mayor in 1980.",
    "Brian Kemp and former Sen. David Perdue.",
    "She trails in polls behind Gov.",
    "Mr. Fendley died in 2005."
  ]
}