{
  "id": 4518,
  "mediaId": 129,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Pence will headline a rally for Kemp in Georgia, splitting with Trump.",
  "image": "https://static01.nyt.com/images/2022/05/13/us/politics/13midterm-briefing-pence1/13midterm-briefing-pence1-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/live/2022/05/13/us/primary-elections-pennsylvania-midterm",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1434,
    1622,
    2095,
    2491,
    3102,
    4325,
    2672,
    5128
  ],
  "sentences": [
    "But Mr. Lambs ads have been exclusively positive, promoting his own biography and calling him our best chance to beat the Republicans this fall.?\nFor the life of me, Ill never understand why the jogger incident wasnt on TV and in mailboxes,? said Mr. Mikus, who ran a Democratic Senate primary race in the state in 2016. They should have been on offense, putting him on his heels, letting people know what his flaws are.?\nJosh Shapiro, the Democratic attorney general of Pennsylvania, is employing a familiar but risky tactic in that states governors race: Hes paying for a TV ad that appears intended to help one of his opponents in the Republican primary.",
    "Our campaign is prepared to start the general election now and make sure Pennsylvanians know his real record.?\nMeddling in an opposing primary can backfire, said Mike Murphy, a longtime Republican strategist who opposes Mr. Trump, calling Mr. Shapiros move irresponsible.?\nSam Katz, a three-time former Republican candidate for mayor of Philadelphia, ran ads attacking one of the candidates in that races 1999 Democratic primary, hoping it would bolster his preferred opponent, John Street.",
    "Women have delivered both parties big victories in recent years: Female Democratic candidates helped take back the House for their party in 2018, and Republican women recovered many of those losses in 2020.\nIn some ways, its because women are really good candidates that theyre in the most competitive races, particularly the incumbents,? Dr. Dittmar said of the 2022 governor contests.",
    "As the election approaches on Tuesday, Ms. Barnette, 50, a Black mother of two who has never held office and whose life story has moved many white anti-abortion conservatives, poses a late threat to the two presumptive favorites, David McCormick, a retired hedge fund manager, and Dr. Mehmet Oz, a television celebrity endorsed by former President Donald J. Trump.",
    "For six years, she said, she home-schooled her son and daughter while appearing as a conservative commentator on Fox & Friends.?\nShes a new face in government,? said Conrad J. Kraus, a real estate broker and builder who lives around the corner from Ms. Barnette and handed out fliers advertising a neighborhood open house for the candidate on Sunday.",
    "The end of Roe would also put Democratic female governors in a position both powerful and precarious: unique messengers on an urgent issue for the party, who hold more real ability to effect change than their counterparts in a gridlocked Congress  and who must balance a range of other priorities for voters in a challenging election year.",
    "Democratic strategists in Pennsylvania said the Lamb campaigns missteps included running the race as if Mr. Lamb were the front-runner, failing to aggressively attack Mr. Fetterman and focusing almost exclusively on the message that Mr. Lamb was the most electable Democrat, when base voters appeared to want someone more partisan.",
    "And I had the best day of my life today.?\nLater, talking to reporters who were mainly barred from the event, she said she interpreted Mr. Trumps comments as favorable.? The former president had said that she would never be able to win? the general election in November, but that she had a wonderful future? in the Republican Party.",
    "I want somebody who knows how much a hamburger costs and fills their own gas tank.?\nMs. Barnette, the author of Nothing to Lose, Everything to Gain: Being Black and Conservative in America,? left Alabama after graduating from college, and has been living in Pennsylvania for eight years, according to her campaign manager.",
    "In nine months, hes built a broad, diverse coalition of union workers, African Americans, women, men, progressives, moderates, religious leaders, teachers, firefighters, nurses, construction workers  people from all parts of Pennsylvania and all parts of the Democratic Party,? Ms. Nassif-Murphy said in a statement.",
    "People can say establishment officials all they want, but these people are the trusted people in their communities, who people elected, and they have to have some sort of favorability amongst the masses,? said State Representative Ryan Bizzarro, a Lamb supporter who escorted him on a trip to Erie County on Tuesday.",
    "Everyones going to love it. But they were behind from the day he got in the race and ran the wrong campaign to close the gap.?\nSeveral strategists said the Lamb campaign, with its aversion to going negative and emphasis on endorsements from Democrats statewide, seemed modeled on elections from decades past.",
    "Stacey Abrams, the presumptive Democratic nominee for governor of Georgia, recently promised attendees at an Emilys List gala that we will fight every day from now to Election Day and beyond, because this is a fight for who we are.?\nIn red states, Democratic candidates for governor are walking a finer line.",
    "I am proud to offer my full support for four more years of Brian Kemp as governor of the great state of Georgia!?\nThe former vice presidents visit will follow a series of campaign events Mr. Kemp has planned with a handful of Republican governors, who were blasted by Mr. Trump for their support of Mr. Kemp.",
    "That year, Laura Kelly of Kansas campaigned on education, and Gretchen Whitmer of Michigan pledged to fix the damn roads.? Janet Mills of Maine, Michelle Lujan Grisham of New Mexico and Kate Brown of Oregon benefited, in an especially favorable climate, from running in states that lean toward Democrats.",
    "The seeming meltdown for Mr. Lamb  whose initial victories in Western Pennsylvania had been a model for President Bidens 2020 race  reflects a frustration among Democrats nationally with politicians who promise bipartisan accord, including Mr. Biden, and who have yielded meager results in Washington.",
    "And I look forward to working with the president.?\nIn campaign videos and in front of voters, she explains that she spent at least part of her childhood living on a pig farm in southern Alabama, in the one stop sign? town of Nichburg, in a house without insulation, running water or an indoor toilet.",
    "More than three dozen applications for mail-in ballots listed the same post office box in South Philadelphia on them, placing them among the addresses with the most applications in the city and drawing the attention of the Philadelphia City Commissioners Office, the agency in charge of elections.",
    "Two Republican field workers had their contracts terminated this week by the Pennsylvania Republican Party after dozens of mail-in ballots were requested for Republican voters in South Philadelphia without the voters knowledge, a lawyer for the former party operatives said on Thursday.",
    "If Mastriano wins, its a win for what Donald Trump stands for.?\nIt ends by asking: Is that what we want in Pennsylvania??\nThe ad went live in six media markets across the state on May 5, three days after the news emerged that the Supreme Court appeared ready to overturn Roe v. Wade.",
    "Kelly Dittmar, a professor at the Center for American Women and Politics at Rutgers University, said that when she interviewed women in Congress, she found that both Republicans and Democrats saw themselves as the best messengers, leveraging their identities as women and mothers.",
    "The revelations could seemingly undermine Republican supporters of former President Donald J. Trump as they continue to make false claims that ballot harvesting tipped the 2020 presidential election to Joseph R. Biden Jr. in Pennsylvania and other battleground states.",
    "Seth Grove, a Republican state legislator from York, Pa., who is chairman of the House State Government Committee, said in a statement on Tuesday that the revelations proved the need for legislation placing tighter controls over how people can obtain mail-in ballots.",
    "She has been a registered Republican since at least 2015, and in a new video she said she never voted for Barack Obama, rebutting claims that she had once supported him, after a Change.org petition surfaced that indicated she hoped to erect a statue in his honor.",
    "Kevin Stitt, a Republican, for signing into law some of the most restrictive legislation on abortion in the country, a measure prohibiting the procedure after about six weeks of pregnancy and requiring enforcement from civilians rather than government officials.",
    "Long a battleground represented by center-right or center-left statewide officials, Pennsylvania could host a matchup in the fall between far less consensus-minded candidates, especially since the leading Republicans have all professed loyalty to Donald Trump.",
    "Some strategists said Mr. Lamb should have been aggressively attacking Mr. Fetterman in his ads  especially over a 2013 incident when Mr. Fetterman, who was the mayor of the town of Braddock at the time, brandished a shotgun to stop an unarmed Black jogger.",
    "Holly Richardson, a Republican former state representative in Utah who described herself as pro-life? and supports access to contraception and sex education, said she had been a little horrified? by what Republicans in other states have said about abortion.",
    "I look at him as another Joe Manchin,? said Elen Snyder, a Democrat and member of Newtown Townships board of supervisors in Bucks County, referring to Senator Joe Manchin III of West Virginia, the Democrat who has stymied the White House on many issues.",
    "Christine Heitman, a 50-year-old software engineer, said she respected the difficult choice Ms. Barnettes mother made to carry her pregnancy to term, noting that even opponents of abortion often make room for exceptions in the case of rape or incest.",
    "I think a lot of people are still waiting to make decisions.?\nOne advantage for Mr. Lamb in winning the endorsements from Democratic officials is that when he visited a town or city far from home, local officials often pulled in a crowd to hear him.",
    "After voting for establishment-endorsed candidates in the past, Ms. Brodie, who lives in Westmoreland County, said she and other Democrats were disappointed in the results; she mentioned the likely reversal of abortion rights by the Supreme Court.",
    "Public polls have shown Mr. Shapiro faring better in a head-to-head matchup against Mr. Mastriano than against the other two leading candidates in the Republican primary, former Representative Lou Barletta and Bill McSwain, a former U.S. attorney.",
    "Parker, 24  had both held unpaid positions with the Republican Registration Coalition, a political action committee with the post office box address that had been listed on those ballot applications, according to Matt Wolfe, a lawyer for both men.",
    "Once they learned what was going on, they resigned from the PAC.?\nMr. Wolfe said state party officials had explained to his clients that they were at-will employees and that the party did not have to show cause for terminating their contracts.",
    "Mr. Fetterman has made his lack of endorsements into a kind of badge of honor: He has long disdained glad-handing other elected officials and is an unpopular figure even in the statehouse, where he officially presides over the State Senate.",
    "Governor Stitt is leading us down a path where miscarriage bounty hunters could swipe a womans private health information for a $10,000 reward, or abortion is criminalized with up to 10 years in prison for physicians,? Ms. Hofmeister said.",
    "Mr. Custodio said that the office had alerted the district attorney about the situation and had contacted the voters for whom ballots had been requested by the PAC to determine if they wanted replacement ballots sent to them directly.",
    "The PACs chairman, Billy Lanzilotti, defended the practice when asked about it by The Inquirer, telling the newspaper that it was a service to the voters? and that he had intended to hand deliver the ballots to them once they arrived.",
    "While both Mr. Lamb and Mr. Fetterman support eliminating the Senate filibuster to pass Democratic priorities, Mr. Fetterman has gone further by making a frequent target of Mr. Manchin, the Democrat who has blocked filibuster reform.",
    "Joy Hofmeister, a Democrat running for governor of Oklahoma who left the Republican Party last year, described herself as pro-life,? but said she believed women should make choices about their reproductive health with their doctor.",
    "She avoided taking a position on Roe v. Wade specifically, saying that the Supreme Court would not be calling to ask my opinion.?\nMs. Hofmeister, who serves as the superintendent of public instruction in Oklahoma, criticized Gov.",
    "Mr. Lamb, 37, a native of the Pittsburgh area, boasts of scores of endorsements, including from the mayors of Pittsburgh and Philadelphia, officials in the all-important Philadelphia suburbs and members of the state legislature.",
    "Theyre there because they won races that people didnt think they could win, like Kansas and even Michigan.?\nMale Republican candidates, especially those in battleground states, face greater risks when talking about abortion.",
    "Brendan McPhillips, who ran the Biden campaign in Pennsylvania, said Democratic voters are looking for something different: candidates committed to fighting a Republican Party they view as lurching dangerously to the right.",
    "In a 2010 essay, published online by the Canada Free Press, she argued that the gay rights movement  which she called immoral and perverse?  sought domination? and should be thwarted, citing the Bible as justification.",
    "It doesnt look like she drove up from out of town to take a Senate seat,? Dr. Mannarino added, taking a swipe at Dr. Oz and Mr. McCormick, both of whom moved back to Pennsylvania relatively recently from out of state.",
    "The opponent, a QAnon-linked retired military officer and state senator, Doug Mastriano, is leading the nine-person field by about 10 percentage points, according to the RealClearPolitics average of polls in the race.",
    "In a guest essay for The New York Times, Governor Whitmer highlighted a lawsuit she filed last month asking the Michigan Supreme Court to examine whether the states Constitution included the right to abortion access.",
    "Will Bunch, a columnist for The Philadelphia Inquirer, has accused the Shapiro campaign of playing a dangerous game,? arguing that Mr. Mastrianos support for conspiracy theories makes him a uniquely toxic candidate.",
    "The outcomes of all these races will determine whether, in the year that a landmark ruling on abortion rights is set to be overturned, the ranks of female governors may shrink  or even make it to the double digits.",
    "Two distinct forces appear to have worked against Mr. Lamb: his campaigns strategic missteps and his misfortune to be running at a time when Democrats, much like Republicans, are rejecting their partys centrists.",
    "Mr. Trump has focused his fire on Mr. Kemp for refusing to overturn the results of the last presidential election in the state, and has backed former Senator David Perdue, once a Kemp ally, in the May 24 primary.",
    "But this country allowed me to be able to create a different narrative for myself,? she told Republicans at a campaign forum on Wednesday held by a group that is dissatisfied with Pennsylvanias mainstream G.O.P.",
    "Ms. Barnette  a hard-right conservative locked in a seven-way Republican primary for an open Pennsylvania Senate seat  is suddenly surging in the polls, statistically tied for first place with two ultrarich men.",
    "In a statement, Mr. Pence praised Mr. Kemp as one of the most successful conservative governors in America.?\nBrian Kemp is my friend, a man dedicated to faith, family and the people of Georgia,? Mr. Pence said.",
    "She has mastered Mr. Trumps knack for sticking to a simple campaign message, distilling the financial effect of the complicated economic forces causing a rise in inflation to a one-syllable word: squeeze.",
    "After a Washington Examiner article published on Wednesday raised questions about her upbringing, her military experience and her academic degrees, she used it as fodder at a campaign stop later that day.",
    "The question is, who do they want in charge of making decisions about pregnancy??\nMore effective messengers\nOn both sides of the aisle, strategists often prefer women to carry out messaging on abortion.",
    "Shes authentic,? said Dr. Anthony Mannarino, an eye surgeon who said his parents moved to the United States from Italy when he was 2, and neither of them had any formal education beyond the fifth grade.",
    "The ad notes that Mr. Mastriano wants to outlaw abortion? and is one of Donald Trumps strongest supporters.? It continues: He wants to end vote by mail, and he led the fight to audit the 2020 election.",
    "How many of you feel that something has gone wrong??\nShe is competing in a primary for a seat held by a Republican senator, Pat Toomey, who announced he would retire after voting to impeach Mr. Trump.",
    "And to the line of people who hovered nearby at campaign events on Wednesday and Thursday hoping to snap a selfie with Ms. Barnette, her outspokenness and her life story were primary selling points.",
    "Because theyre saying, Now we have to hold the line.?\nFrom Michigan to Oklahoma\nAmong Democratic female governors, theres virtually no debate about whether women should have access to an abortion.",
    "Electability Concerns: Starting with Pennsylvania, the coming weeks will offer a window into the mood of Democratic voters who are deeply worried about a challenging midterm campaign environment.",
    "As the Supreme Court stands poised to overturn Roe v. Wade and throw regulations on abortion to the states, governors are set to be on the front lines of the political clashes that would follow.",
    "Make no mistake about it, homosexuality is a targeted group in the Bible, right along with cheats, drunkards, liars, foul-mouths, extortionists, robbers, and any other habitual sin,? she wrote.",
    "Rose Centeno, 59, one of the registered Republicans for whom a mail-in ballot was requested, told The Inquirer that she would never vote by mail and echoed false claims about election fraud.",
    "While polling has tended to show abortion relatively low on the list of voters priorities, supporters of abortion rights argue that this conventional wisdom should be tossed out the window.",
    "Democrats and their allies believe that focusing on abortion will resonate from red states like Kansas to blue states like Oregon, even if candidates tailor their messaging to their states.",
    "What to read\nFederal prosecutors are said to have begun a grand jury investigation into whether classified White House documents that ended up at Donald Trumps Florida home were mishandled.",
    "Representative Conor Lamb was supposed to be a Democratic rising star  a Marine veteran, former prosecutor and Pennsylvania moderate who had won in Trump territory and swing suburbs alike.",
    "Still, his progressive politics  he was an early backer of Bernie Sanders  and iconoclastic style have made him well-liked by the party base and created an online fund-raising juggernaut.",
    "The nations Republican female governors  Kay Ivey of Alabama, Kristi Noem of South Dakota and Kim Reynolds of Iowa  oversee solidly red states, and have long campaigned against abortion.",
    "Scores of Democratic officials endorsed him in his run for Senate, eager to pick up a Republican-held open seat and have him roll into Washington next year to bridge the partisan chasm.",
    "Some Shapiro advisers had been toying with the ad maneuver for months, although the leadership of the campaign did not discuss the idea until it was clear that Mr. Mastriano was ahead.",
    "Mr. Wolfe said his clients had resigned from the PAC last weekend after The Philadelphia Inquirer reported on Friday about the effort, which critics called a case of ballot harvesting.",
    "Some Democrats have warned that the incident will figure in Republican attacks in the fall if Mr. Fetterman is the nominee, in what they described as an effort to lower Black turnout.",
    "Mr. Wolfe said on Thursday that Mr. ODonnell and Mr. Parker, both of whom continue to serve as Republican ward leaders in Northeast Philadelphia, did not play a role in the effort.",
    "The former vice presidents visit presents yet another front of the growing proxy war between former President Donald J. Trump and Republicans who want to see Mr. Kemp re-elected.",
    "After launching its first TV ads in March, the Lamb campaign was forced to take them off the air for almost all of April, a crucial month when voters were tuning in to the race.",
    "The campaign returned to TV late in April, and during the first week of May it spent $543,600 for ads in Philadelphia and Pittsburgh, according to AdImpact, an ad-tracking firm.",
    "The 30-second spot is ambiguous enough that Republicans have wondered aloud whether the ploy was meant to help or hurt Mr. Mastriano, whose shoestring campaign is short on cash.",
    "In an interview, Mr. Katz defended the ads bolstering Mr. Street as his least bad option, since the two other top Democrats in that contest were likely to beat him more easily.",
    "Based on the 2020 presidential results, Whitmer should be the next most vulnerable female governor, after President Biden won the state by less than three percentage points.",
    "According to his LinkedIn profile, he was a head field organizer for the Republican National Committee in Philadelphia from April 2019 through the general election in 2020.",
    "She earned a degree in finance from Troy State University in Alabama in 1997, according to the school, making her the first person in her family to graduate from college.",
    "Hard-Liners Gain: Republican voters appear to be rallying behind far-right candidates in two pivotal races, worrying both parties about what that could mean in November.",
    "The House committee investigating the Capitol riot issued subpoenas to five Republican members of Congress, including Representative Kevin McCarthy, the minority leader.",
    "And they said the campaign placed too much emphasis on winning endorsements from the Democratic establishment, when voters seemed to show that they did not really care.",
    "Other Democrats, perhaps recognizing that the party has few legislative or judicial options nationally, have stuck to broader pledges to try to protect abortion rights.",
    "Not even the news on Thursday that Mr. Trump had questioned elements of her past and declared that only Dr. Oz could defeat Democrats in November seemed to bother her.",
    "Mr. Street would go on to become the second Black mayor in the citys history, though he won the general election against Mr. Katz that year by fewer than 8,000 votes.",
    "But that country is about to come to a close,? she warned in a singsong stump speech that blended the confidence of the pulpit and the intimacy of the confessional.",
    "In the 1990s, she spent seven years in the Army National Guard and the Army Reserve, attaining the rank of specialist, said Madison Bonzo, a U.S. Army spokeswoman.",
    "Ms. Barnette, who has publicly espoused homophobic and anti-Muslim views, has been propelled mainly by her strong debate performances and her rags-to-riches story.",
    "This is nothing more than ballot harvesting and was done, in nearly all cases, without the knowledge of the voters whose names are on the ballots,? Mr. Grove said.",
    "We need to reach for bolder ideas.?\nFrom the outset, Mr. Lambs fund-raising couldnt compete with Mr. Fettermans appeal to a national cohort of small online donors.",
    "Melinda Wedde, a 37-year-old yoga teacher who is a volunteer door-knocker for the Lamb campaign in the Pittsburgh suburbs, said it was too early to count him out.",
    "In Kansas, Laura Kelly has reiterated her support for abortion rights, but she has so far focused more on education and taxes, issues that helped her win in 2018.",
    "So we need good people now to stand up and begin to fight for the greatest nation that has ever existed.?\nHer vision of what that might look like is unambiguous.",
    "Understand the Pennsylvania Primary Election\nThe crucial swing state will hold its primary on May 17, with key races for a U.S. Senate seat and the governorship.",
    "I like that.?\nThe Barnettes have also owned property in Texas, property records show, and her book biography on Amazon indicates that she has lived in Virginia.",
    "He trails by double digits in polling behind John Fetterman, the shorts-wearing lieutenant governor whose outsider image has resonated with the Democratic base.",
    "Both public and private polling indicates that Doug Mastriano is poised to become the Republican nominee on May 17,? said Will Simons, a campaign spokesman.",
    "Neither of them had any involvement in or knowledge of what Billy Lanzilotti was doing in terms of soliciting mail ballots in South Philly,? Mr. Wolfe said.",
    "One day after the report emerged, Mr. Lanzilotti was removed as a ward leader in South Philadelphia by the Republican City Committee, The Inquirer reported.",
    "Senate Race: Kathy Barnette, a conservative commentator, is making a surprise late surge against big-spending rivals, Dr. Mehmet Oz and David McCormick.",
    "He had rock star potential  their campaign flittered that away,? said Mike Mikus, a longtime Democratic operative in Pennsylvania and a Lamb supporter.",
    "Mr. Fettermans approval with Democrats in the state was 67 percent in a recent Franklin & Marshall College Poll, compared with 46 percent for Mr. Lamb.",
    "The Pennsylvania Republican Party and the chairwoman of the Republican City Committee did not immediately respond to requests for comment on Thursday.",
    "Fetterman astutely ran a campaign focused on Democratic voters more than Democratic elites,? said J.J. Balaban, a Democratic strategist in the state.",
    "Mr. ODonnell was the PACs treasurer, and Mr. Parker was the groups vice chairman, according to Mr. Wolfe, who is a ward leader in West Philadelphia.",
    "Abortion Battleground: Pennsylvania is one of a handful of states where abortion access hangs in the balance with midterm elections this year.",
    "Some Democrats appear more eager to elect fighters than candidates who might be tempted, like party moderates, to block their priorities.",
    "Mr. Lamb now heads into the states Democratic primary on Tuesday on a much less competitive footing than he or his supporters had hoped.",
    "Hes going to connect with different kinds of voters.?\nAt a recent debate, Mr. Lamb said he knew how swing voters felt about many issues.",
    "Theyre coming out with long knives at this point,? she told the audience in Southampton, about a half-hour drive north of Philadelphia.",
    "But in rooms filled almost entirely with white voters, it was Ms. Barnettes staunch opposition to abortion that seemed to matter most.",
    "During campaigns, he said, you wont get a defining moment but maybe once  and now is that moment.?\nKirsten Noyes contributed research.",
    "Were moving into a completely new world,? Cecile Richards, the former president of Planned Parenthood and the daughter of former Gov.",
    "This is extremism.?\nKathy Hochul of New York is the only Democratic female governor all but guaranteed to remain in office next year.",
    "Still, Mr. Lambs electability argument, the core of his pitch to party leaders, seems to have left many rank-and-file voters unmoved.",
    "One operative invoked Michael Dukakis, the 1988 Democratic presidential nominee who projected reserve and lacked a killer instinct.",
    "She opposes gun control and abortion rights and proposes limiting the federal governments involvement in the health care industry.",
    "She said Mr. Lamb entered the race as an underdog and grew support that was more substantial than dubious polls? have suggested.",
    "Those polling questions, they say, were asked when the idea of losing the constitutional right to abortion was only theoretical.",
    "She and her husband, Carl, own a four-bedroom home in Huntingdon Valley, a Philadelphia suburb, according to property records.",
    "Board of Elections staff discovered an unusual number of applications for Republican ballots being requested to a single P.O.",
    "Multiple Philadelphia officials endorsed him, even though a third candidate in the race, Malcolm Kenyatta, is from the city.",
    "His refusal to apologize was criticized by both Mr. Lamb and Mr. Kenyatta at the only debate featuring all three candidates.",
    "Its a different story on the Democratic side, where most of the women rode in on the 2018 wave, flipping Republican seats.",
    "Kate Brown of Oregon will not run again because of term limits, and the rest are likely to face respectable challengers.",
    "He spent $537,000 in the first week of May, reaching the states two major cities as well as Wilkes-Barre and Harrisburg.",
    "The most vulnerable is undoubtedly Ms. Kelly of Kansas, who represents the most Republican-leaning state of the group.",
    "In 2022, however, everything has changed for Democrats  and one big issue has become a five-alarm fire for the party.",
    "The fundamental issue that gets lost in reporting isnt how voters feel about abortion personally,? Ms. Richards said.",
    "box,? Nick Custodio, a deputy to Lisa Deeley, the chairwoman of the city commissioners, said in an email on Thursday.",
    "Kathy Barnette, who has surged in the final days, has actively promoted conspiracy theories about the 2020 election.",
    "I dont think theyre reading the voters,? Laura Brodie, a high school history teacher, said of Democratic officials.",
    "Republicans in particular sometimes find that it is more effective to have women affirm that they oppose abortion.",
    "Chris Christie of New Jersey are all scheduled to tour Georgia during the final week of early voting in the state.",
    "She has ridiculed the Muslim faith in online posts and promotes Mr. Trumps lie that the 2020 election was stolen.",
    "She lost a House race by 19 percentage points to the Democratic incumbent, Representative Madeleine Dean.",
    "He said that they do not plan to challenge their ouster, which was reported on Wednesday by The Inquirer.",
    "But Republicans have struggled to find a candidate to take on Ms. Whitmer  and her $10 million war chest.",
    "The effort came to light less than two weeks before Pennsylvania holds its primary elections on Tuesday.",
    "This whole citys screwed up.?\nEfforts to reach Ms. Centeno were not immediately successful on Thursday.",
    "When the newspaper told her that an application had been submitted in her name, she was not surprised.",
    "Philadelphia, one of the nations bluest cities, has often been at the forefront of those fraud claims.",
    "But Mr. Kemp has maintained a double-digit lead over Mr. Perdue and out-raised him nearly 10-to-one.",
    "We need to decrease the perceptive need for abortion, and we do that by supporting women,? she said.",
    "Mr. Fetterman has said he made a split-second decision after hearing what he thought was gunfire.",
    "Brian Kemp on the day before the states primary election, Mr. Kemps campaign announced on Friday.",
    "In Maine, Ms. Mills faces a tougher fight against a Republican former governor, Paul LePage.",
    "It sounds like she had a worthwhile life, even though she was dirt poor,? Ms. Heitman said.",
    "And one of them has the lone thing more valuable than money or name recognition in a G.O.P.",
    "In an interview, she said she had no plan to move toward the center if she wins next week.",
    "Mr. Lanzilotti, 24, also did not immediately respond to requests for comment on Thursday.",
    "He has the backing of the Black Clergy of Philadelphia and Vicinity, and of labor unions.",
    "And in New Mexico, Ms. Lujan Grisham should be safe unless theres a huge Republican wave.",
    "She wrote that the suit could offer a course of action? for other politicians to follow.",
    "Democratic Senate Race: Representative Conor Lamb had all the makings of a front-runner.",
    "It comes as the left sees a rising Republican extremism on voting rights and abortion.",
    "Mr. McPhillips said that caution was the wrong message for the Democratic base today.",
    "And today the media just found out about me,? Ms. Barnette said, eliciting laughter.",
    "Former Vice President Mike Pence will travel to Georgia to headline a rally for Gov.",
    "SOUTHAMPTON, Pa.  Kathy Barnettes opposition to abortion could not be more personal.",
    "Where the messaging might change more is on the Democratic side,? Dr. Dittmar said.",
    "Hours after Mr. Trumps statement, Ms. Barnette spoke at a Republican Party dinner.",
    "and hopes to elect a slate of more conservative candidates to the state committee.",
    "Abby Nassif-Murphy, Mr. Lambs campaign manager, disputed such characterizations.",
    "Her local Democratic committee interviewed Mr. Lamb but declined to endorse him.",
    "But that message, with its echoes of Mr. Bidens 2020 campaign, may be outdated.",
    "The Mastriano ad is very shrewd? and essential,? said Mr. Katz, a Shapiro ally.",
    "In several other states, women in both parties are challenging male governors.",
    "Nursing homes and election offices typically account for high-volume requests.",
    "He doesnt look like a guy who walked out of an Ivy League school,? she said.",
    "(Senator Toomey told Axios that there was a lot voters dont know? about Ms.",
    "Mr. Mastrianos rise has alarmed many Republicans in and outside the state.",
    "Ms. Barnettes success, Ms. Heitman said, is proof of the sanctity of life.",
    "Her mother was raped and gave birth to her at age 12. It wasnt a choice.",
    "She never conceded the race, said Timothy D. Mack, Ms. Deans spokesman.",
    "Theyre looking for stability and caution in their leadership,? he said.",
    "Im going to have to send him a thank-you card,? Mr. Mastriano has said.",
    "She went on to get an M.B.A. from Fontbonne University in Missouri.",
    "Hes out there talking to voters every single day,? Ms. Wedde said.",
    "Yet she began her Senate campaign almost immediately afterward.",
    "We know that President Trump does not mince words,? she said.",
    "Mr. Shapiro is running unopposed in the Democratic primary.",
    "He has refused to apologize or say he did anything wrong.",
    "And his central-casting image may be working against him.",
    "Every female governors seat is up for election this year.",
    "The three Republicans are likely to sail to re-election.",
    "Mr. Fettermans TV ads have run continuously since March.",
    "They ran a campaign that said, Lets stay above the fray.",
    " Leah & Blake\nIs there anything you think were missing?",
    "Her first time running for office, in 2020, was a flop.",
    "The former field workers  Shamus ODonnell, 27, and C.J.",
    "His campaign did not respond to a request for comment.",
    "That might not shift much, even if Roe is overturned.",
    "A fresh face,? he said on Thursday, predicting a win.",
    "People feel squeezed right now,? she said this week.",
    "Ms. Brodie cast her vote early for Mr. Fetterman.",
    "The two former rivals have since become friends.",
    "How long did I say Ive been running for Senate?",
    "My life,? an emotional campaign video starts.",
    "Ms. Barnette refers to them as carpetbaggers.",
    "I want a regular person,? Dr. Mannarino said.",
    "Thats what they do,? she told The Inquirer.",
    "Thats why you cant trust the mail ballots.",
    "A doormat reading Dont Blame This Family.",
    "Pete Ricketts of Nebraska and former Gov.",
    "The stakes could not be higher,? he said.",
    "Ann Richards of Texas, told me recently.",
    "We Voted for Trump,? welcomes visitors.",
    "Were running against literal fascists.",
    "Shapiros team is making no apologies.",
    "Email us at onpolitics@nytimes.com.",
    "Kitty Bennett contributed research.",
    "It hasnt quite worked out that way.",
    "I think that letter was favorable.",
    "Anything you want to see more of?",
    "A Trump flag hangs on his tree.",
    "primary: a Trump endorsement.",
    "It hasnt worked out that way.",
    "Doug Ducey of Arizona, Gov.",
    "Wed love to hear from you.",
    "All nine of them.",
    "Thirteen months.",
    "It was a life.",
    "Barnette.)",
    "Right?",
    "G.O.P.",
    "Gov.",
    "Gov."
  ]
}