{
  "id": 4519,
  "mediaId": 169,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Mike Pence and top Republicans flock to Georgia to defeat Trump's candidate in key primary",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/brian-kemp-mike-pence-0513221.jpg",
  "link": "https://www.salon.com/2022/05/13/mike-pence-and-top-flock-to-georgia-to-defeat-candidate-in-key-primary/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    1035,
    1147,
    1284,
    1434,
    2095,
    2136,
    2623,
    2672,
    2934
  ],
  "sentences": [
    "Throughout Kemp's campaign, Trump has repeatedly questioned his Republican bonafides, largely because the governor rebuffed the former governor's attempt to overturn the 2020 election in Georgia, a battleground state that Trump narrowly lost.",
    "Ever since January 6, when Pence was scorched by the president for refusing to go along with a legally dubious scheme to overturn the election, the former vice president has been increasingly willing to break from Trump's hold over the GOP.",
    "RELATED: Georgia GOP outraged Trump turned against Brian Kemp: 'I am just so mad  beyond words\"\nBack in March, the president held a tele-rally in support of Perdue, lining the candidate's campaign coffer with half a million dollars.",
    "Brian Kemp in a marked departure from Donald Trump, who is currently backing Kemp's opponent, former Sen. David Perdue, R-Ga.\n\"Brian Kemp is one of the most successful conservative governors in America,\" Pence wrote in a statement.",
    "RELATED: Trump's Georgia election revenge plot backfires: Every poll shows his candidate losing \"bitter\" race\nThe move comes months after Pence first signaled that he would support GOP incumbents in gubernatorial elections.",
    "On Wednesday, Trump called Kemp \"the worst 'election integrity' Governor in the country,\" saying that he \"loaded the great state of Georgia up with RINOs,\" an acronym for \"Republicans in name only.\"",
    "The governor has also seen support from former President George Bush, who is organizing a fundraiser in Texas for the governor this month, according to Politico.",
    "According to Axios, Pence's former chief of staff, Marc Short, has already stepped in to serve as one of Kemp's senior campaign advisers.",
    "Kemp has received endorsements from a number of Republican governors who have come under Trump's wrath, including New Jersey Gov.",
    "\"I am proud to offer my full support for four more years of Brian Kemp as governor of the great state of Georgia!\"",
    "Despite Trump's anti-Kemp crusade, it still appears that the race is still the governor's to lose.",
    "Pence's endorsement of Kemp underscores growing tensions between him and the former president.",
    "Trump has also helped facilitate the rollout of various attack ads against Kemp.",
    "Kemp has also raised twelve times more campaign funds than the former senator.",
    "Former Vice President Mike Pence has promised to campaign for Georgia Gov.",
    "Polling reveals that Perdue is still lagging behind Kemp by a 22% margin.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Subscribe to our morning newsletter, Crash Course.",
    "Chris Christie, Arizona Gov.",
    "Doug Ducey and Nebraska Gov.",
    "Pete Ricketts."
  ]
}