{
  "id": 4537,
  "mediaId": 233,
  "date": "d2022-05-12T15:43",
  "headline": "'It was disturbing': Attorneys question Georgia county deputies' search of Delaware State bus",
  "image": "https://www.gannett-cdn.com/presto/2022/05/09/PWIL/9383b0e5-1d9e-4447-a089-d8eb5ea440ad-ds.jpg?crop=479,269,x0,y141&width=479&height=269&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/sports/college/lacrosse/2022/05/12/georgia-sheriff-deputies-search-delaware-state-hbcu-lacrosse-team/9739592002/",
  "sentiment": "0.0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Abraham Kenmore",
  "authorUrl": "https://www.augustachronicle.com/staff/5241220001/abraham-kenmore/",
  "termIds": [
    2095,
    4521,
    3219,
    3543,
    2555,
    2643,
    2661,
    2672,
    5041
  ],
  "sentences": [
    "How Black agent, white rookie QB forged 'rare' NFL partnership High stakes: Trevor Bauer's fight over ban moves to powerful MLB figure The good (Blue Jays), bad (Yankees) and downright ugly (A's) of MLB attendance this season Astros owner Jim Crane has advice for other cheaters: 'I'd keep my mouth shut' Sports Newsletter: Get the biggest stories delivered",
    "ACLU of Delaware Staff Attorney Dwayne Bensing told the Delaware News Journal that while he cannot speak to Georgia law, in Delaware, police must provide reasonable and articulable suspicion  a requirement just below the legal standard of probable cause  to extend a traffic stop beyond their initial reason for pulling over a car.",
    "Jonathan Rapping, a professor at Atlanta's John Marshall Law School and founder of Gideon's Promise, an organization to educate public defenders, said that using a dog to sniff a vehicle is legal so long as it does not prolong the traffic stop, but that dogs can be unreliable.",
    "\"I have to say, when I first heard the (deputy) saying, 'Tell me if you have something, I'm not looking for a little bit of marijuana but if I have to search and find it I won't be able to help you,' what came to my mind was this is a tactic to try and gain consent,\" he said.",
    "\"Especially what people don't understand who haven't experienced ... it's a traumatizing experience to be stopped, to be searched, to be criminalized and, you know, people are left with, 'This is happening to me because of my race, because I'm Black.'\"",
    "Prominent Georgia attorneys question the actions of sheriff's deputies in Liberty County, Georgia, some even speculating that they violated the civil rights of student-athletes from a Delaware HBCU when they searched the lacrosse players' motorcoach.",
    "Video footage of a traffic stop by Liberty County deputies, who pulled over and searched a bus filled with student-athletes from Delaware State University traveling home from a match in Florida, has already brought calls for legal consequences.",
    "\"There is a lot of things that go on in our country that a lot of people consider to be racial, but here in Liberty County that is not something that we practice, I will not allow it, and I will not let it happen,\" he said in an interview.",
    "What to know about your rights during a traffic stop\nDavis said that when he does \"know your rights\" trainings he tells people to be respectful, but assert their right not to let law enforcement search their vehicles.",
    "Rapping also pointed to the deputies stepping onto the bus and asking students if they had anything they did not want deputies to find, which he saw as a tactic to gain the consent of students to search the luggage.",
    "Davis said Bowman was correct that an alert from a K9 unit would constitute probable cause, but he thought it was unnecessary to bring in a K9 unit to investigate a bus full of college athletes in the first place.",
    "Starks, Rapping and Davis all said said that they thought race played a factor, with Starks saying that even if officers could not see the passengers, they likely could see the race of the driver before the stop.",
    "I would hope if my daughter was taking a trip, a school-sponsored trip, and an officer pulled the driver over for driving in the left lane, that my daughter's belongings would be treated with more respect.\"",
    "Because officers did not cite the driver, there would be no opportunity for the deputies' behavior to be reviewed by judges or attorneys if the students did not bring a civil lawsuit, according to Starks.",
    "Both Davis and Redmon said that any civil suits stemming from this would face challenges from qualified immunity, the standard that any reasonable deputy would have known that their conduct was unlawful.",
    "Sam Starks, a senior attorney with the Cochran Firm in Atlanta, said he also thought the deputy was delaying by walking onto the bus and speaking to the students after the driver stepped off of the bus.",
    "\"What we say ... when you're pulled over, make sure they can see your hands, answer them respectfully, and if they asked if you will consent to a search of your vehicle just say no,\" he said.",
    "Georgia Attorney General Chris Carr has been in contact with the Delaware Attorney General, but said he does not have jurisdiction over the incident, according to his spokesperson.",
    "\"Even if the dog truly alerted to something, before they start rummaging through multiple bags, they should have the dog sniff the bags and alert to that particular bag,\" he said.",
    "He has since said that his officers did nothing wrong, \"but we could have done things a lot better, and we would like to get more feedback from the university and the students.\"",
    "\"As both a civil rights attorney and a civil rights activist and advocate, it's disheartening to continue to see these kinds of stops and this kind of profiling,\" Davis said.",
    "\"Due to the nature of the detail, a K9 was part of the stop and an alert was given by the K9.?\nWas the Liberty County deputies' stop, search of the Delaware State bus legal?",
    "Liberty County Sheriff William Bowman on Tuesday denied that players' luggage was searched, but photos, video and players' accounts of the incident seem to contradict him.",
    "\"Every bus that's pulled over for a legitimate traffic stop, assuming it's legitimate, just because it's a bus they don't say, 'Well it's a bus, we get to search any bus.'",
    "At that point they saw a vehicle, a white bus with dark tinted windows, traveling on I-95 North in the left hand lane, which is a clear violation of Georgia state law.\"",
    "The womens lacrosse team was motoring along Interstate 95 through Liberty County on April 20 after playing at Stetson University the previous night in DeLand, Florida.",
    "She was also concerned that the deputy might have been delaying the process of writing a ticket to give the dog time to sniff the vehicle, which she said is illegal.",
    "\"(But) do we want to empower the (deputies) to just pull over any vehicle based on a hunch or suspicion that they could be some violation of the law that occurred?\"",
    "\"It was disturbing,\" said Melissa Redmon, clinical assistant professor and prosecutorial justice program director at the University of Georgia School of Law.",
    "\"It was a four-person unit that was out there, and the K9 unit was one of them,\" Bowman said in an exclusive interview provided to the Savannah Morning News.",
    "\"There were several commercial vehicles stopped that morning, including another bus where contraband was located,\" Bowman said during a news conference.",
    "The Delaware Attorney General has called for a federal civil rights investigation and several Georgia attorneys also questioned the deputies' behavior.",
    "While the law does prevent trucks from traveling in the left hand lane, the law excludes \"busses and motorcoaches\" from the definition for a truck.",
    "If deputies conduct a search anyway, Davis advises following instructions, but filing a complaint afterwards to put the information on the record.",
    "Once the search started, even if it was legal due to the dog alerting, Rapping said it also seemed excessive to search multiple bags.",
    "The standard is similar in Georgia, according to Mawuli Davis, a partner with Georgia-based Davis Bozeman Johnson Law.",
    "Rapping also noted that the officer stepped onto the bus and spoke to the students before searching the vehicle.",
    "Civil rights concerns\nBowman, who is Black, has repeatedly denied that the incident was racially motivated.",
    "The bus was stopped for traveling improperly in the left lane  which is illegal for trucks but not busses.",
    "\"It doesn't look like (the deputy) was being particularly diligent in writing out the ticket,\" she said.",
    "Bowman said in a follow-up interview that the stop was proper, and K9 units were already on the scene.",
    "\"There was no markings on the bus that indicated it was an HBCU or what the bus was being used for.\"",
    "\"The (deputies) in this case, they informed the driver very quickly why he was being pulled over.",
    "Bowman later said he misspoke, and meant to say none of the passengers on the bus were searched.",
    "Redmon said that while the search may have been legal, the stop itself was likely improper.",
    "They took the extra step of informing the passengers why the bus was being pulled over.",
    "\"There still needs to be a basis for a search, regardless of if it's a car or a bus.",
    "They still have to articulate the reason they are searching this bus,\" said Davis.",
    "Deputies subsequently searched luggage stored in the compartment under the bus.",
    "Starks disagreed, saying this was a clear case of a Fourth Amendment violation.",
    "\"There's nothing on the bus that indicates ... who was inside,\" she said.",
    "\"The Supreme Court has said that a dog's sniff is not a search,\" he said.",
    "\"I think that those student's civil rights were violated,\" Starks said.",
    "Still, she is concerned by the fact that the bus was stopped at all.",
    "Redmon said it is not uncommon for K9 units to travel with deputies.",
    "\"I know how intrusive those stops may be, even if they're legal.\"",
    "\"No one had to call for the K9 unit, the dog was already on site.",
    "\"What law enforcement purpose did he have to walk onto the bus?\"",
    "Redmon also said she does not think it was racially motivated.",
    "Bowman said he has not heard from the Attorney General or Gov.",
    "Freelance photographer Lewis Levine contributed to this story.",
    "\"You don't win these cases on the side of the road,\" he said.",
    "They would seem to be courteous at the scene,\" she said.",
    "\"But they will frequently have false positive alerts.\"",
    "He has defended the stop as legal and justified.",
    "I think it was a stop for an excuse to search.\"",
    "\"I'm a father, I have a teenage daughter.",
    "\"I think that was a pretextual stop.",
    "No contraband was uncovered.",
    "That's not constitutional.\"",
    "That's not lawful.",
    "Brian Kemp.",
    "he asked."
  ]
}