{
  "id": 4563,
  "mediaId": 65,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Greg Gutfeld: Karine Jean-Pierre's tweets matter",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/67d3165f-738b-4641-a0ba-9365ad0a3a0f/46d3ebdb-910e-42fe-9664-df8d4c9506e9/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/opinion/greg-gutfeld-karine-jean-pierres-tweets-matter",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Gutfeld",
  "authorUrl": "https://www.foxnews.com/person/g/greg-gutfeld",
  "termIds": [
    841,
    1024,
    1147,
    1223,
    1951,
    2095,
    4770,
    200,
    327,
    2672
  ],
  "sentences": [
    "I don't know if she's got a show coming her way, but I hear that her office duties will involve feeding Joy Reid and changing Lawrence O'Donnell  half the duties she performed for Biden.",
    "It's when a huckster takes some lies and makes them sound precocious, by saying something in Congress or in mainstream outlet, so this information's origins are slightly less atrocious.",
    "You haven't heard much of it, but Stacey Abrams filed a federal lawsuit over Georgia's management of elections, and the trial actually began last month.",
    "I think the difference is as they have been, they are all in on being state TV for Donald Trump and so they will continue to give them misinformation.",
    "It's funny that Psaki is scheduled to leave her job Friday where she will end up right where her replacement was when she said we were all racist.",
    "They go together like peanut butter and jelly, pizza and beer, nipple clamps and Cheez-Whiz, and they want elections as secure as the border.",
    "There's this video from MSNBC where she describes Fox News as racist back in March 2020, which she then shared from her Twitter account.",
    "So as part of her new job, she'll be dealing with all of these racist Fox News reporters, especially our own dumb S.O.B., Peter Doocy.",
    "Even more if you're a Democrat and you're about to become White House press secretary, something tells me you'll get a pass on this.",
    "Back on April 2nd, 2020, she tweeted \"Reminder Brian Kemp stole the gubernatorial election from Georgians and Stacey Abrams.\"",
    "Now, if you don't know the network, it's the news station that makes the Weekly World News look like Face the Nation.",
    "I remember when this show started, someone started leaking these erotic videos I'd made back when I needed the money.",
    "(Photo by Sarah Silbiger/Getty Images)\nBut she's merely echoing exactly what the Dems get away with saying already.",
    "But I remember those days, you know, when the left actually did care about Asian Americans, not so much anymore.",
    "But I get it, when someone gets a fancy job embarrassing tweet surface like a bloated corpse in the East River.",
    "Of course, no Dem has called this an attack on democracy, a claim they're always making against Republicans.",
    "But did you know she once falsely claimed that the 2018 Georgia gubernatorial election was actually stolen?",
    "Now, as you know, Psaki's leaving her job to go to work at MSNBC so she can now lie while sitting down.",
    "STAFFER 2: President Biden believes that every American deserves to feel at home in their own country.",
    "But Jean-Pierres tweet matters because that sort of thing would disqualify anyone who isn't a lefty.",
    "The danger is so, yes, you have Asian Americans right now whose lives are seriously in danger.",
    "Anyway because she's a Dem that stuff doesn't matter, mainly because the press is on her side.",
    "And as long as you're on the right side, meaning the left side, you can say anything you want.",
    "Assaults on the press are another one of those things that can only come from Republicans.",
    "So will the new face of the administration face questions about her hatred for Fox News?",
    "You could say the lawsuit is an attempt to undermine the integrity of Georgia elections.",
    "But like a plane full of passengers during the safety demonstration, no one's listening.",
    "That's why he's working with all of our global partners to ensure a strong economy.",
    "STAFFER 2: Well, the supply chain is a top priority for the Biden administration.",
    "Greg Gutfeld currently serves as host of FOX News Channel's (FNC) \"Gutfeld!\"",
    "So, as you know, talking about a stolen election can get you into trouble.",
    "Now that Asian hate crimes erupted and the culprits aren't in MAGA hats.",
    "They're too busy trying to find gas and baby formula, which causes gas.",
    "But they wouldn't know democracy if it bit them in their elitist butts.",
    "That one tweet isnt the only thing to erupt from Jen's replacement.",
    "His latest is \"The Plus: Self-Help for People Who Hate Self-Help.\"",
    "But I guess someone has to do the work they pay Rachel Maddow for.",
    "STAFFER 1: I was talking about, like, staples or pens or anything.",
    "NINA JANKOWICZ: Information laundering is really quite ferocious.",
    "We're just kicking all of their a***** and they're out of ideas.",
    "(weekdays 11PM/ET) and co-host of \"The Five\" (weekdays 5PM/ET).",
    "STAFFER 1: You know, you're not press secretary anymore, right?",
    "KARINE JEAN-PIERRE: Fox News was racist before coronavirus.",
    "It's the equivalent of shouting fire in a crowded theater.",
    "Which tells you it's only a crime if a Republican does it.",
    "Except you can actually shout fire in a crowded theater.",
    "Well, anyway, she's been tapped to replace Jen Psaki.",
    "But I guess that's what Democrats mean by both sides.",
    "Sounds like the goalie for the Montreal Canadiens.",
    "Especially if there's a fire and you started it.",
    "Click here for more information on Greg Gutfeld.",
    "He joined the network in 2007 as a contributor.",
    "Like Shemp and Curly, they just switched roles.",
    "But unlike the left, we won't try to stop you.",
    "Well, at least you didn't parody Mary Poppins.",
    "Fox News will be racist after the coronavirus.",
    "I just hope Jen enjoys her first day at MSNBC.",
    "It's how you hide a little lie, little lie.",
    "It's how you hide a little lie, little lie.",
    "It's the best way to make you look stupid.",
    "But I should point out, we're not racists.",
    "STAFFER 2: No more questions at this time.",
    "Since when do Democrats care about theft?",
    "I just felt they needed a wider audience.",
    "They are racist during the coronavirus.",
    "You know, like marrying your brother.",
    "So that's why they call us racist.",
    "He is the author of several books.",
    "But only from people at Fox News.",
    "Why bother reporting them at all?",
    "Let me know if you need anything.",
    "Let me know if you need anything.",
    "True, I was the one leaking them.",
    "I call it the circle of strife.",
    "Hope youre getting settled in.",
    "Anyway, make yourself at home.",
    "So there is nothing new here.",
    "Office supplies or whatever.",
    "Stooges Reference Kat.",
    "Is that a real team?",
    "Karine Jean-Pierre.",
    "Oh, he's so racist.",
    "Think about that.",
    "I want her job.",
    "Welcome aboard.",
    "STAFFER 1: Oh.",
    "Who hasn't?",
    "Hey, Jen.",
    "I know.",
    "Maybe."
  ]
}