{
  "id": 4625,
  "mediaId": 43,
  "date": "d2022-05-07T00:00",
  "headline": "Breaking: Trumpy judge rules in favor of MTG",
  "image": "https://images.dailykos.com/images/908920/story_image/QAnon_Marjorie-Greene_Mask_Stupid.jfif?1611283392",
  "link": "https://www.dailykos.com/story/2022/5/6/2096437/-Breaking-Trump-judge-rules-in-favor-of-MTG",
  "sentiment": "-0.495",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2203,
    2279,
    545,
    2672
  ],
  "sentences": [
    "Those of us without lives who sat through the hearing before the Georgia administrative judge as to Rep. Marjorie Taylor Greenes eligibility to be on the ballot for re-election saw quite clearly that Judge Charles Beaudrot never planned on being so serious a question, and that he was as far over his head that he might as well have been swimming in Antarctic groundwater.",
    "In a recent debate, the four of them ganged up on Raffensperger, who replied that he and incumbent Governor Brian Kemp had been stalwart in their efforts to keeping Those People from voting.",
    "Marjorie Greene has had amnesia for as long as she can't remember\nIm not surprised that the MAGA judge in Georgia has just ruled that Perjury Taylor Greene can run for Congress.",
    "Readers Digest version:\nOn Friday, a state administrative judge said that the lawyers challenging Greene's run failed to prove that she engaged in insurrection on Jan. 6, 2021.",
    "He got glowing reviews when he refused to ratfck the 2020 election in Georgia, but hes still a Republican dedicated to voter suppression, and hes also running for re-election.",
    "Georgia Secretary of State Brad Raffensperger accepted a judges findings Friday and said Rep. Marjorie Taylor Greene is qualified to run for reelection.",
    "So, its no surprise that, on Friday, he tossed the hot potato to George Secretary of State Brad Raffensperger, as he was obligated to do so by law.",
    "His opponents are Rep. Jody Hice, a MAGA true-believer and three other nutballs.",
    "I dont believe theres any way that Raffensperger bumps MTG off the ballot.",
    "He dismissed the plaintiffs challenge under the 14th Amendment.",
    "Ill update this diary after I get a six pack of beer.",
    "The comments here are always better than my diaries.",
    "This puts Raffensperger in an interesting position.",
    "Hed lose the entire northern part of the state.",
    "Heres the link:\nwww.esquire.com/...",
    "In the meantime, please comment.",
    "Oops!"
  ]
}