{
  "id": 4631,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Brad Raffensperger Sides With Judge, Keeps Marjorie Taylor Greene on Ballot",
  "image": "https://d.newsweek.com/en/full/2033043/brad-raffensperger-marjorie-taylor-greene.webp?w=790&f=6b9c9781a78b040bc87c27ab253cef67",
  "link": "https://www.newsweek.com/brad-raffensperger-marjorie-taylor-greene-revenge-trump-1700245",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zoe Strozewski",
  "authorUrl": "https://www.newsweek.com/authors/zoe-strozewski",
  "termIds": [
    883,
    1147,
    1604,
    2087,
    2095,
    2203,
    2279,
    545,
    562,
    2672
  ],
  "sentences": [
    "She said she was forced to cancel visits with her grandchildren at her home over fears that someone would act on those threats, and that her family had to go into hiding for almost a week in late November after intruders broke into her widowed daughter-in-law's home, according to Reuters.",
    "\"The Governor of Georgia, Brian Kemp, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene,\" Trump said in a statement Thursday.",
    "The Fourteenth Amendment's provision specifies that any member of Congress who has taken an oath to uphold the Constitution cannot hold an office again if they \"have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.\"",
    "Raffensperger, however, had the final say in deciding if she's kept off the ballot, giving him a chance to send a message to Trump and others who have made enemies out of election officials who refused to overturn the results and promote unproven voter fraud claims.",
    "Georgia Secretary of State Brad Raffensperger opted not to exact revenge on former President Donald Trump, choosing to side with a judge and keep Representative Marjorie Taylor Greene, one of the former president's most loyal supporters in Congress on the ballot.",
    "The lawsuit that seeks to keep her off the midterm ballot in Georgia centers around her alleged role in the attack on the U.S. Capitol on January 6, 2021, accusing her of facilitating the riot through actions like spreading unproven claims of voter fraud.",
    "Raffensperger's rebuttal of Trump's claims that he won the state and refusal to comply with his request lumped him in with other elections officials across the U.S. who said they were harassed and threatened for not heeding the former president's calls.",
    "Greene, a Georgia lawmaker who has had several brushes with controversy during her tenure, faced an administrative hearing over a lawsuit that seeks to use a Civil Warera amendment provision to constitutionally bar her from seeking re-election.",
    "After President Joe Biden defeated Trump in the contentious 2020 presidential election, Georgia's top election official said he and his family received a wave of death threats and harassment because of Trump's surprising loss in the state.",
    "Raffensperger's wife, Tricia Raffensperger, told Reuters in an interview published in June 2021 that they almost immediately began receiving death threats after Trump's surprising loss in Georgia, which he won in the 2016 election.",
    "While testifying at her hearing Friday, she said that she called for a peaceful protest ahead of the Capitol riot and did not ask people to \"actively engage in violence or any type of action.\"",
    "Trump's feud with Raffensperger continued this week when he blamed Raffensperger and other Georgia election officials for the \"hell\" Greene was going through amid the lawsuit.",
    "Judge Charles Beaudrot, who presided over Greene's administrative hearing, issued his recommendation on Friday that Greene should be not disqualified from seeking re-election.",
    "Biden won Georgia in the 2020 election, but in a January 2021 phone call with Raffensperger, Trump reportedly encouraged him to \"find\" enough votes to reverse the results.",
    "Trump has repeatedly criticized and blamed Raffensperger for his loss in Georgia, including calling him an \"enemy of the people\" during a November 2020 press conference.",
    "Shortly after the judge ruled on the case, Raffensperger announced that he accepted the judge's recommendation, sealing Greene's ability to remain on the ballot.",
    "\"Jody has been a steadfast fighter for conservative Georgia values and is a staunch ally of the America First agenda,\" Trump said in a March 2021 statement.",
    "He even endorsed one of Raffensperger's challengers, Congressman Jody Hice, for an upcoming Georgia secretary of state election.",
    "\"She is now going through hell in their attempt to unseat her, just more of an election mess in Georgia.\"",
    "Raffensperger said in a book he published later last year that he viewed Trump's call as a \"threat.\"",
    "ET: This article was updated to reflect that Brad Raffensperger accepted the judge's recommendation.",
    "Greene has repeatedly denied any wrongdoing in connection with the events on January 6, 2021.",
    "\"Unlike the current Georgia Secretary of State, Jody leads out front with integrity.",
    "Newsweek reached out to Raffensperger and a spokesperson for Trump for comment.",
    "Update 05/06/22 6:49 p.m."
  ]
}