{
  "id": 4643,
  "mediaId": 12,
  "date": "d2022-05-06T10:00",
  "headline": "Suspended Clayton Sheriff Victor Hill added to Grand Theft Auto video game",
  "image": "https://www.ajc.com/resizer/QBYHIPICBSO5xoHRp-hMIvMvkGc=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/WDUFI7HDN5BSJCHYMNXPF522GE.png",
  "link": "https://www.ajc.com/news/atlanta-news/clayton-sheriff-victor-hill-cheers-video-game-inclusion/57M3EMNEFRGPBEVYO2WHHSK4UE/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leon Stafford",
  "authorUrl": "https://www.ajc.com/staff/leon-stafford/",
  "termIds": [
    2095,
    2613
  ],
  "sentences": [
    "The longtime Clayton lawman, who has been on suspension since last year after being indicted by federal authorities, posted on Twitter page his excitement that fans of Grand Theft Auto V put his name on one of the games police cars.",
    "Federal authorities in April 2021 indicted Hill on charges he violated the civil rights of four Clayton County jail detainees by putting them in restraint chairs as punishment.",
    "Grand Theft Auto V is one of the most popular video games of all time and allows players to take on the roles of cops and criminals in the mythical city of Los Santos.",
    "Authorities later filed two superseding indictments that added allegations of civil rights abuses against Hill that involved three more detainees.",
    "Hill, who calls himself The Crime Fighter,? has boasted of elite units of deputies, such as his COBRA squad and one that addressed stalking.",
    "Grand Theft Auto Gamers solidified the legendary Black Hawk Traffic Enforcement Unit by placing their patrol car in the game!",
    "Clayton County Sheriff Victor Hill on Thursday appeared to cheer his inclusion in a popular video game.",
    "Cant wait for the return of the Sheriff and his elite units!,? Hill posted on his Twitter feed.",
    "Fans are able to modify or mod? elements of the game such as cars or clothing.",
    "Hill has pleaded not guilty to the charges and remains free on bond.",
    "Brian Kemp suspended him from duty last June.",
    "Gov."
  ]
}