{
  "id": 4648,
  "mediaId": 43,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "High school association now requires youth to compete on sports teams that match birth certificate",
  "image": "https://images.dailykos.com/images/1066733/story_image/GettyImages-12336745241.jpg?1651869687",
  "link": "https://www.dailykos.com/story/2022/5/6/2096348/-High-school-association-now-requires-youth-to-compete-on-sports-teams-that-match-birth-certificate",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2672
  ],
  "sentences": [
    "RELATED: Openly queer teacher fired after allowing students to paint LGBTQ flags in art class\nRobin Hines, who serves as the executive director of the GHSA, told CNN in an interview that he wasnt aware of any students in the state that would be impacted by the change, but that they dont actually keep information on that.?\nAs background, Republican Gov.",
    "This is also dangerous because it can essentially out? trans youth who might not be out about their identity to classmates or teammates, but would suddenly find themselves having to explain why theyre no longer in a league or trying out for a team.",
    "As Daily Kos has covered, trans and nonbinary youth are uniquely ill-protected when it comes to basic rights and dignities, including everyday things like having access to bathrooms that align with their gender identity.",
    "There is no need for a 10-person committee to decide this, but of course, At the signing, Kemp made a point of saying he was signing this legislation so every young girl? will have every opportunity? to succeed.",
    "And perhaps the topic that proves most controversial, even among the left, is whether or not trans youth should be able to participate on sports teams that align with their gender identity (they should).",
    "Research has shown that trans women and girls do not have any sort of direct (much less consistent) advantage over cisgender girls in sports, though conservatives continue to insist that they do.",
    "For example, Oklahoma, South Dakota, Arizona, Mississippi, Montana, Texas, Tennessee, Alabama, Arkansas, Florida, West Virginia, and Iowa have pushed comparable legislation already.",
    "The law creates an oversight committee to decide whether or not trans students in the state will be able to participate on sports teams that align with their gender identity.",
    "Conservatives like to say theyre protecting girls sports, but if they cared at all, to begin with, theyd put actual funding and resources into those teams and associations.",
    "This is especially a possibility in Georgia, where the organizations current guidelines direct schools to honor the athletes gender identity as understood by the school.",
    "This decision, sadly, had a unanimous vote to amend its guidelines to clarify that a students sex is determined by what is listed on their original birth certificate.",
    "It only isolates and punishes an already marginalized, vulnerable group of young people who do not have the resources to fully defend themselves, much less vote.",
    "Its also worth stressing that this ban requires the original birth certificate, so young people who are able to get the document changed are still kept out.",
    "Trans youth already face a disproportionate risk of mental health issues, including anxiety and depression, s well as a higher risk for suicidal ideation.",
    "There is absolutely nothing to gain by further punishing trans youth and stripping them of friendship, camaraderie, and a safe place to be themselves.",
    "Contribute now to support abortion funds providing financial assistance to people seeking abortion care\nThis is a short blurb about Daily Kos.",
    "As reported by CNN, trans high schoolers in Georgia have been banned from competing on sports teams that align with their gender identities.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The Georgia High School Association used the anti-trans bill signed into law last week as justification for the decision.",
    "Brian Kemp signed House Bill 1084 (misleading called the Protect Students First Act?) into law barely two weeks ago.",
    "Then demonizing vulnerable kids has quite a lot to offer, if youre looking for an easy way to rile up your fanbase.",
    "Weve also seen efforts to ban already difficult to access safe, age-appropriate, gender-affirming health care.",
    "Trans youth are also more likely to be bullied, harassed, and leave high school without a diploma.",
    "Even if it was only one state, or one league, or one organization, though, it wouldnt be okay.",
    "Sadly, Georgia is not the only state to enact anti-trans legislation in recent memory.",
    "Thanks to hateful legislation, however, some are already being kept on the sidelines.",
    "Theyd also work on legislation to keep players safe from predators, but I digress.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Thanks to Republican hate and queerphobia, trans youth are already suffering.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Unless youre a Republican worried about midterms, that is.",
    "There is no need for this hateful legislation.",
    "The ban goes into effect immediately.",
    "Imagine if that included trans girls!",
    "Donate $25\n'\nDonate $10 monthly",
    "There is no need for this ban.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "In a word: Deplorable.",
    "Please read it.",
    "Imagine."
  ]
}