{
  "id": 4666,
  "mediaId": 12,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Decatur schools urges mask wearing again due to uptick in COVID cases",
  "image": "https://www.ajc.com/resizer/TnwWN5rWoANi1CYfbFXGr0SlnOA=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/EDOLGZ4EYX2A4I7B6HLKGETQVM.JPG",
  "link": "https://www.ajc.com/education/decatur-schools-urges-mask-wearing-again-due-to-uptick-in-covid-cases/BVXGRN7DXVAYVOFEKAVLE5JUEU/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Reyes",
  "authorUrl": "https://www.ajc.com/staff/josh-reyes/",
  "termIds": [
    2095
  ],
  "sentences": [
    "As we can see, COVID is a disease we will continue to live with and as we see spikes in our community, we must continue to adjust our mitigation strategies accordingly,? Superintendent Maggie Fehrman said in a letter sent to the school community on Wednesday.",
    "Fehrman said the law makes implementing a mask mandate very difficult for our staff to manage.?\nAlong with wearing masks, Fehrman asked parents to report cases, keep their children home if they are sick and limit chances for exposure to the virus.",
    "She said she will strongly encourage all staff and students to wear masks to protect themselves and others as we finish the last few weeks of the school year.?\nDecaturs last day of school is May 27.",
    "Brian Kemp signed into law the Unmask Georgia Students Act.? That allows parents who dont want their children to wear masks to opt out of district mandates.",
    "Most metro Atlanta districts, including Decatur, had dropped their mask mandates by the time Kemp had signed the bill into law.",
    "City Schools of Decatur is asking staff and students to wear masks due to rising COVID-19 cases over the past two weeks.",
    "The district reported 56 cases of COVID-19 last week  its second-highest weekly count this academic year.",
    "The districts count peaked at 64 in mid-January as the omicron variant surged.",
    "But the district is stopping short of a mandate due to a new Georgia law.",
    "Overall, the district has recorded more than 500 cases since August.",
    "In March, Gov."
  ]
}