{
  "id": 4683,
  "mediaId": 19,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Georgia High School Association Begins Transgender Sports Ban",
  "image": "https://media.breitbart.com/media/2020/01/womens-relay-race-female-sports-file-getty-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/05/georgia-high-school-association-begins-transgender-sports-ban/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Simon Kent",
  "authorUrl": "https://www.breitbart.com/author/simon-kent/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Women athletes, feminists, and Christians have joined forces to speak out about the harm to women that comes from forcing them to compete against biological men who want to live as women, or transgender women.? https://t.co/KfILVqxWZJ\n Breitbart News (@BreitbartNews) September 9, 2020\nOpponents argue such proposals violate Title IX of federal education law prohibiting sex discrimination, as well as rulings by the U.S. Supreme Court and 11th U.S.",
    "Im proud to have championed this effort in Georgia!? he tweeted:\nFollowing my signature on HB 1084, the Georgia High School Association today voted to protect fairness in school sports by unanimously approving youth to compete according to the sex determined on his/her birth certificate.",
    "Last year, Alabama, Arkansas, Florida, Mississippi, Montana, Tennessee, Texas and West Virginia enacted similar sports bans, infuriating LGBTQ advocates, who argue conservatives are hurting the feelings and hopes of transgender youth.",
    "GHSA executive director Robin Hines told CNN he was not aware of any students in the state who would immediately be affected by the decision, but that we dont keep information on that.? He added that the ban takes effect immediately.",
    "The Georgia High School Association (GHSA) moved unanimously Wednesday to reflect that basic truism and changed its bylaws to prevent transgender athletes from competing in sports under the gender they choose to identify with.",
    "Following my signature on HB 1084, the Georgia High School Association today voted to protect fairness in school sports by unanimously approving youth to compete according to the sex determined on his/her birth certificate.",
    "The GHSA had previously allowed individual member schools to make the determination but all will now comply with a new law to implement the restriction, the Atlanta Journal-Constitution reports.",
    "Others point to an executive order signed by Democratic President Joe Biden that prohibited discrimination based on gender identity in school sports and elsewhere, as Breitbart News reported.",
    "Brian Kemp signed a bill into law last week giving the GHSA authority to enact such a ban, a departure from similar bans in other states that came directly from their legislatures.",
    "pic.twitter.com/m0bTA27Oas\n Governor Brian P. Kemp (@GovKemp) May 4, 2022\nThe measure passed the associations executive committee 62-0, per a copy of the meetings minutes.",
    "The lawmaker responsible for the measure, Senate President Pro Tem State Sen. Butch Miller, R-Gainesville, appeared prepared for the outcome.",
    "Miller, a candidate for lieutenant governor, released a TV ad Tuesday saying the law would protect girls from unfair competition in sports.",
    "The move comes as the issue of transgender participation in all sports sparks more debate and responses from those opposed to the move.",
    "So far this year, a number of other GOP-led states have enacted such bans, including Arizona, Iowa, Oklahoma and South Dakota.",
    "Athletes will henceforth be required to compete under the sex listed on their birth certificate without exception.",
    "Follow Simon Kent on Twitter: or e-mail to: skent@breitbart.com",
    "I'm proud to have championed this effort in Georgia!",
    "Kemp applauded the GHSA move on social media.",
    "Boys will be boys and girls will be girls.",
    "Circuit Court of Appeals.",
    "Republican Gov."
  ]
}