{
  "id": 4706,
  "mediaId": 163,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Democrats look to abortion-rights threat to boost midterm election prospects",
  "image": "https://www.reuters.com/resizer/7y0gvOznsml62wCG0HVCrqRxWGs=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/A4MZGXHI5BKAXAVCWQCJ5L56WQ.jpg",
  "link": "https://www.reuters.com/world/us/democrats-look-abortion-rights-threat-boost-midterm-election-prospects-2022-05-03/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Oliphant",
  "authorUrl": "https://www.reuters.com/authors/james-oliphant/",
  "termIds": [
    773,
    781,
    2087,
    2095,
    146,
    331,
    428
  ],
  "sentences": [
    "Alongside other abortion rights groups Planned Parenthood Action Fund and Emily's List it has announced a $150 million investment in spending on the midterm elections, mostly in swing states and states that will be pivotal to preserving abortion access across the country.",
    "The nonpartisan University of Virginia Center for Politics suggests there could be a voter backlash in states including Arizona, New Hampshire, North Carolina and Pennsylvania, where support for abortion rights is strong but where Republicans are seeking to curb them.",
    "\"There's going to be a whole swath of voters who may not consistently vote for Democratic candidates, but who will be really animated around the dramatic change in the landscape for abortion access,\" said Kristin Ford, a spokesperson for NARAL Pro-Choice America.",
    "\"You have a right that is wildly popular with the electorate, and you have an electorate that has not really grappled with the fact that it could be taken away,\" said Jessica Floyd, president of American Bridge, a Democratic political action committee.",
    "\"If this draft opinion... is resemblant of the final opinion, this will be a huge encouragement to the pro-life movement because it will reflect a return on investment of our political engagement these last 50 years,\" Carroll said.",
    "A leaked draft showing the court's conservative majority apparently poised to overturn the landmark 1973 Roe v. Wade decision has set off a political firestorm over abortion rights just as the 2022 election season heats up.",
    "But if the high court follows through and does away with constitutional protection for terminating a pregnancy, the issue will crystallize for millions of voters like never before, Democratic advocates and strategists say.",
    "Democrats quickly seized on the issue as one that could reshape a difficult political environment going into the November elections, when control of both the U.S. Senate and the House of Representatives will be at stake.",
    "read more\nDemocrats contend the clear-and-present danger to reproductive rights will galvanize independent voters, particularly suburban women and women without college degrees, to vote for their candidates.",
    "\"Every single one of my GOP (Republican) opponents supports dangerous, restrictive anti-abortion laws,\" congressman Tim Ryan, who is running for Senate in Ohio, wrote in an email to supporters on Tuesday.",
    "A Reuters/Ipsos poll conducted on Tuesday found 63% of respondents, including 78% of Democrats and 49% of Republicans, would be more likely to back candidates who support abortion rights in November.",
    "Geoffrey Skelley, an elections analyst for the website FiveThirtyEight, was skeptical the abortion issue would be enough to improve the chances of Democrats holding onto the House and the Senate.",
    "Mallory Carroll, a spokesperson for Susan B. Anthony List, said the group's political action committee has been on the ground talking to voters in nine battleground states since last summer.",
    "With opinion polls showing Democratic President Joe Biden unpopular with a majority of Americans, analysts have forecast Republicans to take over the House and perhaps the Senate as well.",
    "WASHINGTON, May 3 (Reuters) - Democrats have needed something to turn around their flagging midterm election fortunes, and the U.S. Supreme Court may have just given it to them.",
    "\"If you were looking for a message to reactivate the suburbs in Georgia, this is a great one,\" said Jared Leopold, a former aide to the Democratic Governors Association.",
    "\"I promise you this: I will fight like hell to make sure abortion remains safe, legal, and accessible in our state,\" Whitmer said on Twitter on Monday.",
    "Skelley said he expected the economy, jobs and inflation to remain the top concerns for many voters, including those who support abortion rights.",
    "\"Midterm elections are still mostly about the president and the president's party, and Joe Biden has approval ratings in the low 40s,\" he said.",
    "Their Republican opponents oppose abortion rights and would support legislative efforts in those states to ban the procedure.",
    "Democratic candidates and party-aligned groups sent out fundraising pleas pegged to the prospect of Roe being overturned.",
    "The issue also could boost Democrat Stacey Abrams in Georgia, who narrowly lost to Governor Brian Kemp four years ago.",
    "Anti-abortion groups also plan to use the upcoming court decision - due by the end of June - to drive turnout.",
    "NARAL said it had seen a \"big uptick\" in donations and website traffic since the news broke late on Monday.",
    "Should the Supreme Court overturn Roe, the legality of abortion will be left to individual states.",
    "read more\nBoth Michigan's Gretchen Whitmer and Wisconsin's Tony Evers are up for reelection.",
    "read more\nU.S. abortion rights have been under direct threat for years, if not decades.",
    "read more\nBut polls have also shown the right to abortion to be broadly popular.",
    "The prospects could be better for Democrats in state governor's races, he said.",
    "The party in power typically loses seats in the first term of a new president.",
    "\"I think that it's going to mobilize people on both sides.\"",
    "\"The dynamic here is fairly unprecedented.\""
  ]
}