{
  "id": 4724,
  "mediaId": 33,
  "date": "d2022-05-04T00:00",
  "headline": "Fact check: Jody Hice, running to oversee Georgia elections, makes yet more false 2020 claims",
  "image": "https://www.i.cdn.cnn.com/.a/2.294.0/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/05/04/politics/fact-check-jody-hice-georgia-secretary-of-state-raffensperger/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Dale",
  "authorUrl": "https://www.cnn.com/profiles/daniel-dale",
  "termIds": [
    1147,
    1951,
    2095,
    2203,
    2279,
    146,
    428,
    501,
    2617,
    2672
  ],
  "sentences": [
    "But the Raffensperger campaign said Abrams had no involvement in or influence on Raffensperger's decision, made public about a week after that news report, to send ballot request forms to voters of all ages; Raffensperger campaign spokesperson Lance Dutson said Raffensperger's office \"pushed back on Stacey Abrams and her liberal allies\" on various proposals, as Abrams-founded group Fair Fight Action noted in tweets criticizing Raffensperger at the time.",
    "If Hice was referring, as he has in the past, to a March 2020 legal settlement between Raffensperger and Democratic Party entities about the state's signature verification process for absentee voters, Abrams was not involved in that agreement -- as one of the debate panelists, Atlanta Journal-Constitution reporter Mark Niesse, pointed out to Hice.",
    "Abrams campaign spokesperson Seth Bringman said Monday that Abrams was among the voting rights advocates who urged Raffensperger to send ballot request forms to Georgia voters of all ages rather than just older voters, as an Atlanta Journal-Constitution report in March 2020 had said Raffensperger was initially planning.",
    "Even before the settlement agreement, the elections law passed by Georgia Republicans in 2019 had required counties to \"promptly\" notify voters of problems that were about to get their ballots tossed out, such as missing or nonmatching signatures, and give the voters a chance to correct these issues.",
    "Washington (CNN)At a Monday debate between the Republican candidates for Georgia secretary of state, incumbent Brad Raffensperger said his leading opponent, US Rep. Jody Hice, \"has just not been honest for the last 18 months, and he has been spreading misinformation, disinformation.\"",
    "In general, the phrase refers to the practice of organizations or activists collecting voters' completed absentee ballots and submitting them for counting -- rather than voters sending in their ballots themselves or getting a family member or friend to submit them.",
    "As Niesse noted to Hice, the percentage of absentee ballots rejected over signature problems in the 2020 general election, after the settlement agreement, was nearly identical to the rate in the 2018 midterm election, before the settlement agreement.",
    "Absentee voting and voter identification\nHice said that Raffensperger had opened the door to changes that harm \"election integrity,\" including \"sending out absentee ballot requests, having virtually no voter identification associated with these.\"",
    "In 2021, Kemp signed a law that required absentee voters to provide a kind of identification other than just their signature and that banned governments and government officials from sending out unsolicited absentee ballot request forms.",
    "Hice claimed that Raffensperger \"was making deals with Stacey Abrams\" -- the Democratic gubernatorial candidate and former state House minority leader -- \"and opened wide the door for election fraud in this state in every way.\"",
    "Signature verification\nWhen debate panelist Niesse pressed Hice to explain how the settlement agreement supposedly weakened absentee ballot verification, Hice insisted, \"Well, it did weaken the signature verification.",
    "Hice, who has been endorsed by former President Donald Trump, has centered his campaign on false claims about the 2020 election -- including the claim that Trump would have won Georgia if the election had been \"fair.\"",
    "It's possible that a smattering of Georgia ballots were fraudulent, but there is no evidence of voter fraud even close to widespread enough to have changed the outcome in a state Joe Biden won by 11,779 votes.",
    "Facts First: It's not true that Georgia hasn't \"corrected\" the issue of requiring voter identification for absentee voting or the issue of the secretary of state sending out absentee ballot request forms.",
    "The 2019 law gave Georgia voters two basic options: \"personally\" mail in or deliver their absentee ballots, or have the ballots mailed in or delivered by someone they live with or by a family member.",
    "Raffensperger and Stacey Abrams, Part 2\nHice decried Raffensperger's decision to send an absentee ballot request form to each of Georgia's active registered voters during the 2020 party primaries.",
    "The settlement agreement set out specific deadlines for notifying the voters, instead of relying on the vague word \"promptly,\" and laid out the methods by which the notifications had to be done.",
    "It's at least possible that there was some ballot harvesting in Georgia in the 2020 election; Raffensperger's office is investigating harvesting allegations made by a right-wing group.",
    "Hice said, \"We had a conference call, the Georgia delegation, with Brad, urging him, urging him not to send out absentee ballot requests to everyone on our voter registration file.",
    "And Raffensperger's settlement agreement with the Democratic Party entities had nothing to do with his decision to mail out the absentee ballot request forms during the primaries.",
    "And there is no basis for the claim that this legal settlement or anything else Raffensperger did \"opened wide the door for election fraud in this state in every way.\"",
    "A signature audit of a sample of more than 15,000 absentee ballot envelopes in Cobb County, a major Atlanta-area county won by Biden, found zero fraudulent ballots.",
    "In addition, Raffensperger wasn't the reason that identification other than a signature was not previously required for applications to vote by mail.",
    "Hice added, \"Those are the things that really must be corrected that have not been dealt with under this current leadership of Brad Raffensperger.\"",
    "Regardless, there is zero indication that there was any kind of \"deal\" between Raffensperger and Abrams about this Raffensperger decision.",
    "And there is no evidence that the 2020 settlement agreement about signature verification led to any widespread fraud.",
    "But even if illegal harvesting did happen, that wouldn't mean Raffensperger \"created ballot harvesting in Georgia.\"",
    "In other words, the law prohibited third-party groups from collecting and submitting the ballots of strangers.",
    "He repeated later: \"Ballot harvesting was created, in the state of Georgia, because of Brad Raffensperger.\"",
    "(Raffensperger, like officials in other states, sent out these forms because of the Covid-19 pandemic.",
    "In fact, the settlement agreement did not say anything about who should be sent a ballot request form.",
    "(It also wouldn't mean the actual ballots delivered by ballot collectors were fraudulent or invalid.)",
    "And Hice has repeatedly made false claims about Raffensperger's actions as Georgia's elections chief.",
    "Hice referred to Raffensperger's supposed \"deal\" with Abrams at other moments of the debate as well.",
    "Claim after claim about supposed major election fraud in Georgia in 2020 has been debunked.",
    "In fact, less than three months after Raffensperger became secretary of state in 2019, Gov.",
    "Ballot harvesting\nHice said to Raffensperger: \"You created ballot harvesting in Georgia.\"",
    "In fact, the deal was already made with Stacey Abrams before that call ever took place.\"",
    "He did not send out unsolicited ballot request forms during the 2020 general election.)",
    "State law, not Raffensperger policy, had specified that only a signature was required.",
    "\"Ballot harvesting\" can be described more neutrally as \"ballot collection.\"",
    "Here is a fact check of some of the things Hice said at the Monday debate.",
    "The agreement was about the signature-matching process in particular.",
    "Brian Kemp signed a law that outlawed ballot harvesting in Georgia.",
    "Hice's campaign didn't respond to a CNN request for comment.",
    "Raffensperger did not create ballot harvesting in Georgia.",
    "Again, Raffensperger did not make a deal with Abrams.",
    "It made it much more difficult for it to take place.",
    "You had to eventually notify the voter themselves.\"",
    "Raffensperger did not make a deal with Abrams.",
    "Facts First: Hice's claims are false.",
    "Facts First: Hice's claim is false.",
    "Facts First: This is misleading.",
    "Facts First: This is false.",
    "He did it anyways."
  ]
}