{
  "id": 4733,
  "mediaId": 675,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "These 26 states likely would restrict abortion if Roe overturned",
  "image": "https://www.wnd.com/wp-content/uploads/2014/08/america-at-night-power-grid-lights-map-600.jpg",
  "link": "https://www.wnd.com/2022/05/26-states-likely-restrict-abortion-roe-overturned/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    2095
  ],
  "sentences": [
    "World\nCommentary\nJerry Newcombe\nDennis Prager\nStar Parker\nRead all of today's COMMENTARY...\nDiversions\nU.S.\nJustice for JonBent / Change.org\nMoney\nFaith\nPolitics\nEducation\nHealth\nMORE COMMENTARY\nLarry Tomczak\nStephen Moore\nAndy Schlafly\nRead all of today's COMMENTARY...\nNew Section",
    "The 22 states, the New York Post reported, are Alabama, Arizona, Arkansas, Georgia, Idaho, Iowa, Kentucky, Louisiana, Michigan, Mississippi, Missouri, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Texas, Utah, West Virginia, Wisconsin and Wyoming.",
    "A total of 26 states are likely to restrict abortion, according to the pro-abortion Guttmacher Institute, including 22 with anti-abortion laws that would be reinstated or triggered as soon as Roe falls.",
    "If the U.S. Supreme Court overturns Roe v. Wade as the leaked draft opinion by Associate Justice Samuel Alito indicates, any restrictions or bans on abortion would be left up the states.",
    "In the draft Supreme Court opinion in a case challenging Mississippi's restriction on abortion after 15 weeks, Alito wrote that Roe \"was egregiously wrong from the start.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "The Post reported that in the wake of the Supreme Court leak, lawmakers in several states are planning to propose more restrictions on abortion.",
    "Brian Kemp call a special session of the Georgia General Assembly to impose further restrictions, beyond the state's 2019 \"heartbeat bill.\"",
    "Another four Republican-controlled states are on the verge of passing laws restricting abortion: Indiana, Montana, Nebraska and Florida.",
    "The Post reported that even more strict measures could be passed, including a complete ban on abortion in the state.",
    "In Georgia, the Atlanta Journal-Constitution reported, Republicans are discussing having Republican Gov.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "And if Roe is overturned, California is considering making the state an \"abortion sanctuary.\"",
    "But if Roe is overturned, Georgias ban on abortion after six weeks would go into effect.",
    "Abortion, meanwhile, is protected in 16 states and the District of Columbia.",
    "The Georgia law is on hold after having been struck down by a federal court."
  ]
}