{
  "id": 4796,
  "mediaId": 43,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Biden suspends Gov. Kemps attempt to block ACA site from hundreds of thousands of Georgia residents",
  "image": "https://images.dailykos.com/images/1059237/story_image/GettyImages-1230146559.jpg?1649962140",
  "link": "https://www.dailykos.com/story/2022/5/2/2095311/-Biden-smacks-down-Georgia-Gov-Brian-Kemp-s-plan-to-block-ACA-website-from-residents",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    855,
    1147,
    2087,
    2095,
    4491,
    148,
    501,
    2672,
    2972
  ],
  "sentences": [
    "In September 2020, the Center on Budget and Policy Priorities wrote that Kemps 1332 waiver proposal could force consumers to navigate the type of fragmented insurance system of brokers and insurers the ACA was intended to remedy? and would end up decreasing enrollment, raising premiums, and leading more Georgians to enroll in substandard plans instead of comprehensive coverage.?\nOn April 29, the Centers for Medicare & Medicaid Services (CMS) sent a 26-page letter to Grant Thomas, director of the Office of Health Strategy and Coordination, suspending the 1332 waiver and giving the state until July 28, 2022, to send a corrective action plan? in compliance with the statutory guardrails,? ensuring Georgians that the waiver will provide coverage to a comparable number of residents, that the coverage will be at least as comprehensive and affordable as coverage provided without the waiver, and that the waiver will not increase the federal deficit.?\nKemp has long advocated for private insurance as a better alternative for Georgians.",
    "In an email statement sent to The Atlanta Journal-Constitution, Colbert said, Any plan that would meaningfully disrupt health insurance for 700,000 folks should be carefully considered.? She added, Georgia leaders have refused to answer questions about their plan to separate from healthcare.gov, and disregarded evidence that their plan will mean some hard-working Georgians lose their coverage.?\nRELATED STORY: Game on!",
    "An update on Ukraine and Democrats win by hitting Republicans hard in Wisconsin\nDaily Kos' The Brief\nFollowShare\n0:001:01:31\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThe waivers? allow states such as Georgia to waive the federal order and mold the ACA or Medicaid to the needs of the state.",
    "Bill Custer, a health insurance expert at Georgia State University, told The Current in June of 2021: None of these work requirements have passed muster in the courts  The courts have said these violate the original purpose of Medicaid.?\nBoth of Kemps proposals will likely end up in court.",
    "Georgia DA impaneling special purpose grand jury for Trump investigation\nKemps waiver? plan, approved by former President Donald Trump in 2020 before he left office, would redirect shoppers from plans on healthcare.gov to individual companies or private brokers, the AJC reports.",
    "But who can trust a lawmaker who would also propose that in order for residents to receive Medicaid coverage, a low-income adult would need to prove they worked 80 hours a month, were enrolled in an education program or were a volunteer for a qualifying organization?",
    "Listen to Markos and Kerry Eleveld talk Ukraine and speak with Wisconsin Democratic Party Chair Ben Wikler on how hitting back at Republicans helps win elections on Daily Kos The Brief podcast\nx\nx\nYou need to enable JavaScript to run this app.",
    "Brian Kemp to block residents from gaining access to health insurance via the Affordable Care Act (ACA) marketplace has been suspended by a very sensible President Joe Biden.",
    "If the governor is feeling an urgency to act and get Georgians covered, the quickest and easiest way to do that would be through Medicaid expansion, Colbert told The Current.",
    "During Trumps term, he urged more and more allowances to chip away at the ACA and give the states private insurance carriers more power.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Kemp obviously doesnt care about the 700,000 Georgians who signed up for coverage through the marketplace.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Georgians for a Healthy Future Director Laura Colbert is not a fan of Kemps plan.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n62.",
    "This is a short blurb about Daily Kos.",
    "A plan by Republican Georgia Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Georgia Gov.",
    "Brian Kemp."
  ]
}