{
  "id": 4810,
  "mediaId": 151,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trumps criminal justice reform bill becomes persona non grata among GOPers",
  "image": "https://www.politico.com/dims4/default/0fe444c/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F71%2F91%2Ff3af54b44b03843a1030db4cb95d%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1240191127",
  "link": "https://www.politico.com/news/2022/05/01/trump-republicans-first-step-act-00029104",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "If you embed unfairness in our system, you will undermine it, and the EQUAL Act is designed to create that fairness and thats the foundation for juries coming back with fair sentencing and results.?\nSo far, the bill has the support of 11 Republican senators, the National District Attorneys Association, the Major Cities Chiefs Association and the American Civil Liberties Union.",
    "Theres always a certain push and pull with President Trump between being the hardliner and the deal-maker and this is a classic example of where that conflict emerged in the policy sense.?\nThose who worked on the issue with the Trump administration tried to defend the act from the fire it now faces from certain quarters.",
    "I personally think theres just as many people that want to do criminal justice reform as the last several years, but I think their voices are quiet now, and those that are opposed to the First Step Act are still opposed and have gotten louder,? said Brett Tolman from the conservative group Right on Crime.",
    "After blocking common sense police reform, enacting soft-on-crime policies, and cheering to defund the police, [President Joe] Biden and Democrats words and actions have come to fruition as American cities face record surges in crime,? said Republican National Committee spokesperson Emma Vaughn.",
    "The First Step Act was not just hailed as a rare bipartisan achievement for the 45th president but as the beginning of a major shift in GOP politics, one that would move the party past the 1980s tough-on-crime mindset to a focus on rehabilitation, racial fairness and second chances.",
    "It feels like we just have to bide our time a bit and get past when the emotion of all of the political rhetoric is at the forefront.?\nWhile it didnt go as far as advocates hoped, the First Step Act was widely regarded as a significant overhaul of the criminal justice system.",
    "| Drew Angerer/Getty Images\nBy Meridith McGraw\n 05/01/2022 07:00 AM EDT\nWhen Donald Trump signed a long-sought criminal justice reform measure into law in 2018, he had visions of using the legislation to make major inroads with Black and moderate swing voters.",
    "Republicans who support reforms say the party can be both in line with that vision and adopt a tough-on-crime posture  that voters will be able to differentiate between crackdowns on violent crime and accountability in the justice system.",
    "President Trump was always skeptical that it was the right policy and that it would be received well by voters, and he has remarked to almost anyone whod listen that it was something Jared talked him into,? said one former Trump official.",
    "Supporters of the bill, which the House passed in September with the support of some of the most conservative members, say it would address racial disparities, noting 90 percent of those serving federal time for crack offenses are Black.",
    "Trump himself rarely, if ever, mentions criminal justice reform when he issues statements or gives political speeches, having grown convinced the First Step Act never produced the spike in support from Black voters that he expected.",
    "He bragged about the First Step Act, hosted a prison reform summit at the White House and even aired a Super Bowl ad featuring Alice Johnson, a Black woman and first-time drug offender whose life sentence he pardoned in 2018.",
    "Democrats may be too out of touch surrounded by private security to know the reality of rising crime, but for Americans the consequences of their policies are very real.?\nRepublicans arent alone in tightening their messaging.",
    "Then-Senate Judiciary Chair Chuck Grassley (R-Iowa) and Trumps son-in-law, Jared Kushner, labored to convince him that embracing criminal justice reform wouldnt tarnish his image  and could even be a political boon.",
    "Despite the changing political winds, reform advocates still say they are optimistic that Congress will pass the EQUAL Act, which would end federal sentencing disparities between crack and cocaine offenses.",
    "Theres a lot of polarization there and with this being an election year, [Republicans] are treading carefully on what they want to comment on and what they want to be silent on,? Scott said.",
    "His administration unveiled pardons for three people and clemency plans for 75 inmates this week, including $145 million for reentry and job training plans for formerly incarcerated people.",
    "The law aimed to shorten sentences for nonviolent drug offenders and improve incarceration conditions at the federal level, and sought to address racial inequalities in the justice system.",
    "But for lawmakers and advocates on the right who worked on the First Step Act, the shift has been similarly disconcerting, raising concern it freezes political momentum for further reform.",
    "recently called the First Step Act  which he opposed  a deadly mistake.? And in Georgia on Monday night, Republican gubernatorial candidates, former Georgia Sen. David Perdue and Gov.",
    "People will probably be motivated in the fall to vote for folks who take the law and order approach and theyre not going to believe people who say they dont have a crime problem.?",
    "Pastor Darrell Scott, a Trump ally who talked regularly with administration officials, said he understood why Republicans seemed to be running away from criminal justice reform.",
    "Asa Hutchinson, who served as Drug Enforcement Agency administrator under then-President George W. Bush and has personally encouraged Republican senators to sign onto the bill.",
    "Biden, who ran in 2020 on increasing police budgets, has continued pushing for more money, even calling on states to use Covid-19 aid to hire more law enforcement officers.",
    "But congressional aides warn the legislation is not a slam dunk, especially without the support of Grassley, now the top Republican on the Judiciary Committee.",
    "And in a midterm election year when public focus is on rising crime in communities, some conservatives say they do not see a path forward for federal reforms.",
    "Talk of additional legislation has taken a back seat to calls for enhanced policing and accusations that Democratic-led cities are veering toward lawlessness.",
    "On Capitol Hill, Republicans made stiffer criminal sentencing a main focus during the Supreme Court confirmation hearings for Judge Ketanji Brown Jackson.",
    "The support of influential conservatives, and celebrities like Kim Kardashian, further convinced Trump the move would win over certain demographics.",
    "But a police reform bill stalled in the Senate, and advocates say Biden has fallen far short of his campaign promises to enact significant changes.",
    "In the past year, violent crime rates have risen dramatically, with at least 12 major U.S. cities breaking annual homicide records in 2021.",
    "His skepticism became more pronounced after a summer of protests and violence following the murder of George Floyd while in police custody.",
    "Support for the EQUAL Act is very consistent with the support of tough policies and fighting violent crime,? said Republican Arkansas Gov.",
    "Recent polling reflects public concerns about rising crime rates and dissatisfaction with how public leaders are addressing the problem.",
    "In major Democrat-led cities like San Francisco, Chicago and Washington, D.C., leaders are calling for more, not less, police funding.",
    "For some advocates, the Republican Partys cooling to criminal justice reform confirms the belief the interest wasnt ever sincere.",
    "Former U.S. President Donald Trump speaks during a rally at the Delaware County Fairgrounds on April 23, 2022, in Delaware, Ohio.",
    "With spikes in crime registering as a top concern for voters, Republicans have increasingly reverted back to that 1980s mindset.",
    "I think the politics of it are too difficult,? said Charles Stimson, a crime expert at the conservative Heritage Foundation.",
    "And out on the campaign trail, GOP candidates are running ads demonizing Democrats for not doing enough to support police.",
    "But he later snubbed it on the campaign trail, choosing instead to attack Democrats over calls to defund the police.",
    "From the federal government I dont see anything passing this year on criminal justice reform, I think theyre done.",
    "Three-and-a-half years later, few Republicans  Trump included  seem not at all interested in talking about it.",
    "This week, the senator introduced a separate bill tackling crack and cocaine sentencing disparities.",
    "And there are achievable solutions available,? said Zack Roday, a Republican political strategist.",
    "While he had branded himself as a tough-on-crime Republican, getting Trump on board wasnt simple.",
    "While Biden has not backed away from criminal justice reform, he has struggled to implement it.",
    "Brian Kemp clashed in a debate over who and what is to blame for rising crime in the state.",
    "Early on, Trump was proud of his work on the issue, according to people close to him.",
    "Theres nothing inconsistent there, this is one thing that will build confidence.",
    "Republicans pointed to the trends as evidence of a Democratic failure.",
    "Were not the same country,? said Republican pollster Frank Luntz.",
    "Discussions of rising crime are a daily focus on Fox News.",
    "The focus has changed because the situation has changed.",
    "Tolman added that much work continues behind the scenes.",
    "But trends arent helping the reformers cause.",
    "Reform and calling out truths can coexist.",
    "Its not a binary decision.",
    "Sen. Tom Cotton (R-Ark.)"
  ]
}