{
  "id": 4820,
  "mediaId": 25,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Special grand jury considering Trump election interference in Georgia convenes Monday",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/24/1dd19b07-0965-4f94-b69b-2276fbbc6ccc/thumbnail/140x90/65ca2777b3a56c554d1aa10b05e8c1ae/mark-meadows-ginni-thomas-getty-images.jpg",
  "link": "https://www.cbsnews.com/news/trump-georgia-2020-election-interference-grand-jury/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Kates",
  "authorUrl": "",
  "termIds": [
    1147,
    1434,
    2087,
    2095,
    2203,
    2246,
    501,
    2670,
    2672
  ],
  "sentences": [
    "Election 2020\n More\n Georgia grand jury convenes Monday in Trump election probe\n Ginni Thomas and Mark Meadows texted about overturning 2020 election\n Barr: Trump got \"madder and madder\" when rebuffed on election fraud claims\n Draft order would have had DHS seize voting machines\n Pence says \"Trump is wrong\" that he could have overturned election\n More\nIn:\nGeorgia\nDonald Trump\n Graham Kates\nGraham Kates is an investigative reporter covering criminal justice, privacy issues and information security for CBS News Digital.",
    "Fulton County prosecutors will begin selecting participants Monday for a special grand jury to consider whether former president Donald Trump should be charged for his attempts to pressure Georgia officials to overturn the results of the 2020 election, which he lost.",
    "Willis notified at least four state officials of her investigation in February 2021, sending document preservation notices to Georgia Governor Brian Kemp, Lieutenant Governor Geoff Duncan, Secretary of State Brad Raffensperger and Attorney General Chris Carr.",
    "Willis said in an April 19 interview with the Atlanta Journal-Constitution that she will wait until after the state's May 24 primaries to issue subpoenas to public officials  meaning the special grand jury may not hear witnesses until June.",
    "Fulton County District Attorney Fani Willis asked a panel of judges in January for the special grand jury because of \"information indicating a reasonable probability\" that the election \"was subject to possible criminal disruptions.\"",
    "A spokesperson for Trump claimed Friday in a text to CBS News that an \"illegal ballot trafficking ring\" had influenced the outcome of Georgia's election, referring to unproven claims often made by Trump and his supporters.",
    "Willis has said in interviews that the investigation includes a January 2, 2021 phone call in which Trump told Georgia Secretary of State Brad Raffensperger, \"I just want to find 11,780 votes.\"",
    "Willis wrote in the request that \"a significant number of witnesses and prospective witnesses have refused to cooperate with the investigation absent a subpoena requiring their testimony.\"",
    "They focus on just one investigation, and can be impaneled for far longer than typical grand juries, which often consider charging recommendations for a variety of investigations.",
    "This grand jury will have \"an investigatory focus appropriate to the complexity of the facts and circumstances involved,\" Willis said in her January request.",
    "\"I don't want anyone to say 'oh, she's doing this because she wants to influence the outcome of this upcoming election,'\" Willis told the newspaper.",
    "\"A grand jury should be opened for the massive voter fraud in Georgia in 2020,\" said Liz Harrington, the Trump spokesperson.",
    "Trump said in a January 20 statement that \"My phone call to the Secretary of State of Georgia was perfect.\"",
    "Trump lost the state to Joe Biden by that margin  an outcome that was affirmed by several recounts.",
    "Contact Graham at KatesG@cbsnews.com or grahamkates@protonmail.com",
    "Special grand juries are unusual."
  ]
}