{
  "id": 4841,
  "mediaId": 33,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "CNN Exclusive: New text messages reveal Fox's Hannity advising Trump White House and seeking direction",
  "image": "https://www.i.cdn.cnn.com/.a/2.294.0/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/04/29/politics/hannity-text-messages-meadows-trump-white-house/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jamie Gangel",
  "authorUrl": "https://www.cnn.com/profiles/jamie-gangel-profile",
  "termIds": [
    2095
  ],
  "sentences": [
    "Washington (CNN)Former White House chief of staff Mark Meadows and Fox's Sean Hannity exchanged more than 80 text messages between Election Day 2020 and Joe Biden's January 2021 inauguration, communications that show Hannity's evolution from staunch supporter of former President Donald Trump's election lies to being \"fed up\" with the \"lunatics\" hurting Trump's cause in the days before January 6.",
    "Ask people to peacefully leave the capital,\" Hannity texted Meadows at 3:31 p.m.\nLater that evening, after Trump had sent another tweet attacking Vice President Mike Pence, Hannity expressed more alarm to Meadows, \"Wth (What the hell) is happening with VPOTUS.\"",
    "But several weeks later, as Trump's team lost court challenges and the wild claims from attorneys Rudy Giuliani and Sidney Powell failed to materialize into anything more than false conspiracy theories, Hannity's tone shifted.",
    "On December 6, Meadows sent Hannity an article about then-Fox host Chris Wallace (who has since been hired by CNN) interrupting Trump's HHS Secretary Alex Azar when Azar called Biden vice president instead of president-elect.",
    "'I'm beginning to feel down'\nAs the returns were coming in on Election Night, Hannity pinged Meadows to share a tweet about early vote totals out of North Carolina, a state that was crucial to Trump's reelection hopes.",
    "The texts also show the two men debating Trump's strategy to challenge the election, complaining about Fox, and plotting about what to do after Trump left office -- including possibly working together.",
    "The texts provide evidence of what many White House and Fox sources claimed during Trump's time in office: That Hannity acted as a \"shadow chief of staff\" while also juggling radio and TV shows.",
    "Hannity and Meadows' texts underscore the insular effects of the right-wing media echo chamber, where little if any accurate information about the election results was able to break through.",
    "Hannity and Meadows also began making plans for after the Trump administration, discussing how Trump could fashion a comeback bid and how Meadows could work against the Biden administration.",
    "In his book, \"Frankly, We Did Win This Election,\" reporter Michael Bender reported that Hannity had scripted an ad for the Trump campaign, which then paid Fox more than $1 million to run.",
    "\"We will follow the facts,\" Hannity claimed on his December 2 program, one day after Trump's attorney general, William Barr, declared there was no evidence of widespread election fraud.",
    "Guests including then-White House press secretary Kayleigh McEnany made near-nightly appearances to sow doubt about the election results and stoke support for doomed legal challenges.",
    "In contrast to Hannity's messages, these reporters were frequently seeking the White House chief of staff's confirmation of breaking news or trying to secure an interview with Trump.",
    "Meadows received texts from reporters with the New York Times, Washington Post, Wall Street Journal, Associated Press, Politico, Bloomberg, NBC, ABC, CBS and CNN, among others.",
    "In one noteworthy text, Bartiromo messaged Meadows on the morning of November 29, less than an hour before she was set to conduct Trump's first interview since Election Day.",
    "I think we set up a group of administrative lawyers, with a communication arm that fights election laws in every state and fight Biden actions every day, starting on Jan 20.",
    "While the logs show Meadows communicating with multiple Fox personalities, as well as a number of journalists from other organizations, Hannity stands out with 82 messages.",
    "The texts, including dozens of newly disclosed messages, offer a real-time window into how Hannity, a close friend of Trump, was reacting to the election and its aftermath.",
    "CNN obtained Meadows' 2,319 text messages, which he selectively provided in December to the House committee investigating the January 6, 2021, attack on the Capitol.",
    "On the other side of this, he's exposed a very dark side of the swamp that's far worse than I ever imagined and I am not particularly optimistic for the future.\"",
    "While Hannity never appeared to dispute Trump's false claims about the election itself, he expressed alarm at the tactics of some of those pushing Trump's case.",
    "Hannity also appeared to accept the fact that the election was over and the President's best course of action was to go to Florida and engage Biden from there.",
    "Senate GOP Leader Mitch McConnell gave a floor speech on January 19 saying the mob was \"provoked\" by Trump, prompting Hannity to share the video with Meadows.",
    "Hannity said he wanted Trump never to speak about the 2020 election again, but that Trump was unwilling, and Hannity appeared at a loss for what to do next.",
    "The committee previously released texts from both Kilmeade and Ingraham expressing alarm over the attacks at the Capitol and its effect on Trump's legacy.",
    "Throughout the logs, Hannity both gives advice and asks for direction, blurring the lines between his Fox show, his radio show and the Trump White House.",
    "Tucker Carlson appears in only one exchange in the Meadows text logs, when he was trying to speak to Meadows while prepping for his show on November 17.",
    "Hannity responded with a jab at Fox and a suggestion about what Meadows should do after leaving the White House: \"I've been at war with them all week.",
    "On January 6, after the Capitol was breached by pro-Trump rioters, Hannity was one of a number of people texting Meadows urging Trump to intervene.",
    "By mid-December, both Hannity and Meadows were concerned about the two Senate run-offs in Georgia that would decide control of the chamber in 2021.",
    "After the letter was sent, Hannity's attorney, Jay Sekulow, told CNN, \"We are reviewing the committee's letter and will respond as appropriate.\"",
    "Hannity's text messages to Meadows are of interest to the House select committee, which wrote to Hannity in January requesting an interview.",
    "\"Doing this to try and get ratings will not work in the long run and I am doubtful it is even a short term winning strategy,\" Meadows wrote.",
    "Trump would frequently call into Hannity's show -- and Hannity appeared on stage with the President during his final 2018 campaign rally.",
    "& he's in control,\" Bartiromo texted at 9:21 a.m. \"1Q You've said MANY TIMES THIS ELECTION IS RIGGED... And the facts are on your side.",
    "In addition to Hannity, Fox's Laura Ingraham, Tucker Carlson, Maria Bartiromo and Brian Kilmeade all sent messages to Meadows as well.",
    "Very tough days but I will keep fighting,\" Meadows said, referring to the Trump team's objections to votes from Cobb County, Georgia.",
    "On November 29, he texted Meadows saying he had his team trying to prove election fraud: \"I've had my team digging into the numbers.",
    "That month, the panel released some of Hannity's texts to Meadows showing his concern about what would happen on January 6, 2021.",
    "The logs also show there were dozens of journalists from other organizations who texted with Meadows during this time period.",
    "I think I can raise around 10 million dollars to hire a team to make sure the fight continues and prepares the way for 2024.\"",
    "The next day, as Hannity pitched Meadows about working for Fox, he also offered an insightful window into how he views Trump.",
    "In the January 6 aftermath, Hannity sounded a glum note to Meadows as many Republicans looked to cast Trump out of the party.",
    "He sometimes complained about Trump's conduct and fretted that the President was hurting the Republican Party writ large.",
    "I will ask him about big tech & media influencing ejection as well Toward end I'll get to GA runoffs & then vaccines.\"",
    "\"I did not talk with (Fox News CEO) Suzanne (Scott) because I got tied up with pardons but I will make sure I connect.",
    "\"You also need to spend at least half your time doing business with us,\" Hannity texted Meadows on December 12.",
    "I'll make a deal with you, If you (elect) 2 R's to the senate, I'll run again in 2024,\" Hannity wrote of Trump.",
    "On the afternoon of Election Day, Hannity texted Meadows at 1:36 p.m. to ask about turnout in North Carolina.",
    "Initially after the November 2020 election, Hannity appeared to be all in with Trump's false election claims.",
    "Hannity expressed his frustrations again several days later, telling Meadows that he had made a campaign ad.",
    "Then I will drill down on the fraud including the statistical impossibilities of Biden magic (federalist).",
    "Hannity has said he is not a journalist, and Fox does not hold him to traditional journalistic standards.",
    "The Trump-aligned channel infuriated the former President by calling Arizona for Biden on Election Night.",
    "And worse, I'm not sure what is left to do or say, and I don't like not knowing if it's truly understood.",
    "'I've been at war with them all week'\nThe text messages also shed light on Hannity's tensions with Fox.",
    "On December 11, Meadows asked Hannity to send him the phone number of Suzanne Scott, the Fox News CEO.",
    "The call did not go well, Hannity wrote in a group text to Meadows and GOP Rep. Jim Jordan of Ohio.",
    "By New Year's Eve, Hannity warned about the fallout if top White House lawyers resigned in protest.",
    "While Hannity was fiercely loyal to Trump on-air, his off-air relationship was more complicated.",
    "But in his texts with Meadows, Hannity sounded resigned to the fact that the election was over.",
    "\"Mr President, you've said many times that this election was rigged, that there was much fraud.",
    "Hannity did not respond to requests for comment from CNN; neither did Meadows or his attorney.",
    "1- Directing legal strategies vs Biden 2- NC Real estate 3- Other business I talked to Rudy.",
    "\"Thank you for talking with us in the first interview since Election Day,\" Bartiromo said.",
    "When Bender's book was published last year, Hannity denied writing a Trump campaign ad.",
    "\"Also if this doesn't end the way we want, you me and Jay are doing 3 things together.",
    "He is more akin to a GOP activist and entertainer, like some of his fellow Fox hosts.",
    "In November and early December, Hannity's show often amplified Trump's election lies.",
    "As January 6 approached, Hannity expressed his concern about what would transpire.",
    "\"I can call through switchboard but that makes it a bigger deal,\" Meadows said.",
    "\"I was screaming about no ads from Labor Day on,\" Hannity wrote on December 8.",
    "He should announce will lead the nationwide effort to reform voting integrity.",
    "By that point, Trump had started his harsh attacks on Republican Georgia Gov.",
    "Her line of questions mirrored much of what she laid out in the text message.",
    "At 10:12 a.m., Trump called into Bartiromo's show, \"Sunday Morning Futures.\"",
    "Hannity checked in with Meadows on December 22, asking him how he was doing.",
    "A week later, Hannity checked in again to see how Meadows was \"holding up.\"",
    "He texted Meadows on January 5, \"Im very worried about the next 48 hours.",
    "I do NOT see January 6 happening the way he is being told,\" Hannity said.",
    "\"Very disorganized but I have been busting heads yesterday and today.",
    "A spokesperson for Fox did not respond to a request for comment.",
    "Two hours later, Meadows responded: \"Stress every vote matters.",
    "It's so sad for this country they can pull this off in 2020.",
    "A spokesman for the January 6 committee declined to comment.",
    "Figured it out I think, but I appreciate it,\" Carlson wrote.",
    "We want to know he is strong he is a fighter & he will win.",
    "ACLU filed over 400 lawsuits against Trump administration.",
    "Brian Kemp for certifying the state's election for Biden.",
    "\"Guys, we have a clear path to land the plane in 9 days.",
    "\"Well this is as bad as this can get,\" Hannity texted.",
    "\"I agree that he has to give some hope for the future.",
    "The text included questions she planned to ask Trump.",
    "You are a true patriot and I am so very proud of you!",
    "Hannity responded to Meadows, \"You fighting is fine.",
    "\"You really think it's possible,\" Hannity responded.",
    "Hannity spoke to Trump several days after January 6.",
    "Hannity texted, \"I truly feel sorry for our friend.",
    "But according to Bender, the ad only ran one time.",
    "We need a major breakthrough, a video, something.\"",
    "\"The seats are slipping away,\" Meadows responded.",
    "\"I vacillate between mad as hell and sad as hell.",
    "\"Hi the public wants to know he will fight this.",
    "We can make a powerful team,\" Meadows responded.",
    "That's another discussion,\" Hannity wrote back.",
    "We are going to fight and win,\" Meadows said.",
    "\"We can't lose the entire WH counsels office.",
    "Still ballots to count,\" Meadows wrote back.",
    "Pls make sure he doesn't go off on tangents.",
    "\"I did not have a good call with him today.",
    "2 of the worst candidates I've ever seen.\"",
    "Let NOT your heart be troubled my friend.\"",
    "Your friendship means a great deal to me.\"",
    "We will talk wen I see u,\" Hannity wrote.",
    "Connect the future to these candidates.\"",
    "There is no way Biden got these numbers.",
    "Any place in particular we need a push.\"",
    "Everyone,\" Hannity wrote on December 8.",
    "Went to Cobb county to review process.",
    "Go to Fl and watch Joe mess up daily.",
    "'He can't mention the election again.",
    "He can't mention the election again.",
    "They want to hear a path to victory.",
    "We need Jim to front the messaging.",
    "When he speaks people will listen.\"",
    "Wtf happened to our country Mark.\"",
    "Characterize what took place here.",
    "Meadows continued, \"Additionally.",
    "\"I made my own they never ran it.",
    "\"He has to make this about him.",
    "And the facts are on your side.",
    "Just mathematically impossible.",
    "The fing lunatics is NOT fine.",
    "I'm fed up with those people.\"",
    "Characterize what took place.\"",
    "To (sic) much disorganization.",
    "\"Arizona now down just 12813.",
    "Everyone knows it was stolen.",
    "\"I'm beginning to feel down.",
    "Please go through the facts.",
    "This is no longer about him.",
    "He's never had a days peace.",
    "I've been at war with them.\"",
    "\"Yes sir,\" Hannity replied.",
    "\"Texas case is very strong.",
    "\"Honestly we think alike.",
    "Working around the clock.",
    "Someone that's credible.\"",
    "I'm not pointing fingers.",
    "\"Can he make a statement.",
    "They are NOT helping him.",
    "Still a Herculean climb.",
    "I was writing the show.",
    "WH counsel will leave.\"",
    "We need to do the same.",
    "Did u ever talk to Fox.",
    "Hannity asked Meadows.",
    "Thx for helping him.\"",
    "Ever,\" Hannity wrote.",
    "\"Fighting like crazy.",
    "\"Sorry I missed you.",
    "This is about ????.",
    "What are the facts?",
    "\"Make it about him.",
    "Let's start there.",
    "Let's start there.",
    "\"I am doing well.",
    "\"And I'm serious.",
    "Get out and vote.",
    "\"After the 6 th.",
    "\"Will we hold??\"",
    "I'm frustrated.\"",
    "I saw the tweet.",
    "Pence pressure.",
    "Stay engaged.",
    "On radio.\"",
    "\"I agree.",
    "\"On it.",
    "Ideas?\"",
    "Ever.'"
  ]
}