{
  "id": 4842,
  "mediaId": 1576,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Political Antics: Democrats take aim at Kemps education bill signing blitz",
  "image": "https://www.wabe.org/app/uploads/2019/06/AP_99031201969.jpg",
  "link": "https://www.wabe.org/political-antics-democrats-take-aim-at-kemps-education-bill-signing-blitz/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "How can you not teach intersectionality when you have to teach about the lived experience of people throughout history who have different identities and different experiences??\nThe legislation doesnt mention critical race theory, which is typically taught in graduate-level coursework but has become a catchall term for conservative opponents of diversity and inclusion training and education.",
    "I do discuss with them how racism can be embedded in policy, and we learn about what policy is how they should be engaged civically, and that it doesnt necessarily just come from one person, but that it is, it can be a part of an institution or system,? she said.",
    "And why are politicians so afraid of students learning about real events that happened in our country??\nRepublican supporters of the bills have said they dont keep teachers from teaching about historical events, including slavery and the Civil Rights Movement.",
    "Students and teachers should be free to examine the history and its legacy in Georgias public school classrooms without interference from politicians.?\nAryani Duppada, a student at Forsyths Denmark High School, expressed bewilderment at the bill signing.",
    "Its interesting to me that theyre calling this the parents bill of rights because what about a parents right to have their child receive a complete and well-rounded education thats free of political antics?? McAdam said.",
    "The stack of legislation included a bill banning the teaching of divisive concepts,? a bill Kemp referred to as a parents bill of rights,? and a measure that would bar transgender girls from playing school sports.",
    "Forsyth County does have a very troubling racial past.?\nWhite mobs set fire to Black churches and Black-owned businesses in Forsyth County in 1912 after two white women were raped, one of them murdered.",
    "Jennifer Susko is a school psychologist who resigned from her job with the Cobb County School District after the school board passed a resolution banning CRT and the 1619 Project from being taught.",
    "But Democrats said concern over what they can and cant teach could have a chill effect? on teachers, who may shy away from discussing any controversial subjects for fear of losing their jobs.",
    "We werent elected by the people of this state to shy away from what some would call controversial because the bills were signing into law today are about doing the right thing,? Kemp said.",
    "Some also took issue with the parents bill of rights,? which lets parents request a range of school records and requires administrators to respond in a certain amount of time.",
    "Students who have been speaking at board meetings and fighting for truthful history have faced backlash from adults, the same adults who say racism does not exist,? she said.",
    "They attacked the divisive concepts? law, which prohibits schools from teaching nine specific concepts, including the idea that the U.S. is a fundamentally racist country.",
    "Its not lost on any of us that the governor did choose Forsyth County as the backdrop for signing these bills,? said Forsyth schools parent Mitzi McAdam.",
    "Forsyth has few black residents because of racially motivated violence that made them leave, losing virtually everything that they had,? she said.",
    "How are you going to teach the three-fifths compromise if you cannot teach white supremacy and that the United States is racist?? he said.",
    "Anthony Downer, who teaches American Government at Douglass High School in Atlanta, said hes not going to stop teaching that concept.",
    "Brian Kemp signed a batch of controversial education bills Thursday flanked by parents, teachers and children in Forsyth County.",
    "Kemp is signing bills that harm students of color, especially black students, who are already underrepresented,? she said.",
    "Democrats, who held a press conference after the event, said the scene sent a message to right-wing voters.",
    "Andrea Young, executive director of the ACLU of Georgia, said the state has a complex history with race.",
    "Denmark High School student Aryani Duppada said the debate over the bills has exposed hypocrisy in some.",
    "In 1987, Oprah Winfrey traveled to the county to highlight the hatred that still existed there.",
    "Why is teaching actual history that real people have experienced so controversial?",
    "She says she also used principles associated with CRT when speaking with students.",
    "Forsyth continued to be known as a county that was hostile to Black people.",
    "That in itself, to me is a dog whistle to a white nationalist voter base.",
    "The entire Black population was terrorized and forced out of the county.",
    "Now, 4% of Forsyths population is Black, compared to 33% of the state.",
    "Downer said he wont change the way he teaches, despite the new law.",
    "Downer said while he doesnt teach CRT, he does teach tenets of it.",
    "I had ancestors who were enslaved in Gov.",
    "Kemps hometown.",
    "Trending",
    "Gov.",
    "Gov."
  ]
}