{
  "id": 4848,
  "mediaId": 33,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "READ: 82 texts between Sean Hannity and Mark Meadows",
  "image": "https://www.cnn.com/media/sites/cnn/video-placeholder.svg",
  "link": "https://www.cnn.com/2022/04/29/politics/mm-sh-texts/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Working on breakthrough\nSean Hannity to Mark Meadows\nOk. Would be phenomenal\nDecember 6, 2020\nMark Meadows to Sean Hannity\nhttps://thehill.com/homenews/528940-wallace-interrupts-at-azar-over-bidens-title-hes-the-president-elect\nMark Meadows to Sean Hannity\nDoing this to try and get ratings will not work in the long run and I am doubtful it is even a short term winning strategy\nSean Hannity to Mark Meadows\nIve been at war with them all week.",
    "Finishing the signature audit of the ballot envelopes will not tell you which ballots were improperly counted because the ballots are separated from the envelopes, however it will tell you, county by county, the exact number of mail-in ballots that were counted that should not have been counted Those numbers are all we need to determine if the ballots were counted accurately and the election result was valid.",
    "(8:43 PM)\nSean Hannity to Mark Meadows\nNC PRES: 69% of precincts reporting Trump (R): 46.4 Biden (D): 52.4\nMark Meadows to Sean Hannity\nWe are still good\nSean Hannity to Mark Meadows\nK\nSean Hannity to Mark Meadows\nNC PRES: 71% of precincts reporting Trump (R): 46.9 Biden (D): 52\nSean Hannity to Mark Meadows\nThis looks scary\nMark Meadows to Sean Hannity\nYes\nSean Hannity to Mark Meadows\nWe still win NC?",
    "Ask people to peacefully leave the capital\nMark Meadows to Sean Hannity\nOn it\nSean Hannity to Mark Meadows\nWth is happening with VPOTUS\nSean Hannity to Mark Meadows\nhttps://twitter.com/edokeefe/status/1346993660718698496?s=21\nJanuary 10, 2021\nSean Hannity to Mark Meadows and Jim Jordan\nGuys, we have a clear path to land the plane in 9 days.",
    "For example, if this early phase of the signature audit calculates a 5% signature rejection rate on mail-in ballots while the election itself rejected less than 1% of those signatures that means that 4% of the mail-in ballots that were counted in the election were in fact invalid and should not have been counted.",
    "And that is where I start speaking Georgian. When I served in legislature, our famed House Speaker the-late Tom Murphy used to say, as the legislative session was in its last days, that we were down to the lick log (a farming term) meaning time was up for our efforts.",
    "November 16, 2020\nSean Hannity to Mark Meadows\nIm Going to Speak in Georgian A Realistic Primer on the Runoffs in Georgia By Matt Towery In the classic movie The Godfather, Michael Corleone travels to a small restaurant in the Bronx to meet with a rival Mafia boss.",
    "Dont want that out there\nSean Hannity to Mark Meadows\nAgree\nSean Hannity to Mark Meadows\n((THREE BLANK MESSAGES))\nSean Hannity to Mark Meadows\n@ec_schneider : Important early totals out of NC in Wake, Mecklenburg counties, home to Raleigh & Charlotte.",
    "In other words, the process of comparing the signature on the ballot envelope with the voters signature on file with the state was done by one party and hidden from observers from the other party in violation of state laws and regulations.",
    "November 14, 2020\nSean Hannity to Mark Meadows\nNATIONWIDE PRESIDENTIAL ELECTION Several Democratic counties systematically prevented Republican observers from looking at and verifying the signatures on the envelopes of mail-in ballots.",
    "First, the messaging to Atlanta suburban white voters, many of whom are on the verge of becoming permanent Democrat voters, must be specific as to how a victory for the Democratic nominees will impact them in a very personal way.",
    "Sean Hannity to Mark Meadows\nNC PRES: 68% of precincts reporting Trump (R): 52.9 Biden (D): 46\nSean Hannity to Mark Meadows\n@ec_schneider : Also VERY important for NC right now: Were getting the urban/suburban counties first.",
    "None of this will change the course of a recount in which not enough monitors were allowed, those allowed in many of the larger counties were forced to observe from a far, and signature verification was not even considered.",
    "CNN \nCNN has obtained 2,319 text messages that former President Donald Trumps White House chief of staff Mark Meadows sent and received between Election Day 2020 and President Joe Bidens January 20, 2021, inauguration.",
    "November 29, 2020\nSean Hannity to Mark Meadows\nhttps://thefederalist.com/2020/11/23/5-more-ways-joe-biden-magically-outperformed-election-norms\nSean Hannity to Mark Meadows\nIve had my team digging into the numbers.",
    "And for good measure, a calculation of their soon to be new tax hikes in their city or county, courtesy of lost revenues due to Covid, might make these voters think twice about oncoming federal tax hikes.",
    "As a result of this partisan signature verification process, it is probable that many mail-in ballots that were counted in the election should not have been counted because the signatures do not match.",
    "Sean Hannity to Mark Meadows\nOn with boss\nMark Meadows to Sean Hannity\nWe are going to lose both\nSean Hannity to Mark Meadows\nYup\nJanuary 6, 2021\nSean Hannity to Mark Meadows\nCan he make a statement.",
    "And while former state Representative Stacey Abrams has announced that she has already crossed the 600,000 mark in requested absentee ballots, Georgia Republicans are busy fighting with each other.",
    "I think I can raise around 10 million dollars to hire a team to make sure the fight continues and prepares the way for 2024\nSean Hannity to Mark Meadows\nI talked to Jay about this and he agrees.",
    "In this piece Im going to speak Georgian, not to keep anyone out, but to hopefully add some realistic context to two situations that have been a cluttered media mess in the past week.",
    "The Republican candidates in these Senate races are down to that lick log. Advanced in-person voting starts in less than a month and absentee ballots start being mailed this week.",
    "In a few days, after a portion of the mail-in signatures are reviewed, the audit will indicate if there is a serious problem that potentially changed the outcome of the election.",
    "The communications show Hannitys evolution from a staunch supporter of Trumps election lies to being fed up? with the lunatics? hurting Trumps cause in the days before January 6.",
    "Mark Meadows to Sean Hannity\nHe will sign it omnibus and Covid relief package today\nDecember 31, 2020\nSean Hannity to Mark Meadows\nWe cant lose the entire WH counsels office.",
    "January 19, 2021\nSean Hannity to Mark Meadows\nhttps://twitter.com/therecount/status/1351578348783341571?s=21\nSean Hannity to Mark Meadows\nWell this is as bad as this can get",
    "I think we set up a group of administrative lawyers, with a communication arm that fights election laws in every state and fight Biden actions every day, starting on Jan 20.",
    "I can call through switchboard but that makes it a bigger deal\nSean Hannity to Mark Meadows\nYes\nSean Hannity to Mark Meadows\n3 years we expose the deep state, what happens?",
    "In Perdues instance, it appears that the well-worn he is liberal TV ad (which rarely resonate with voters in Georgia) has been substituted with a hes too socialist version.",
    "Our lawsuit requests an independent non-partisan election audit that compares the signatures on the ballot envelope with the voters signatures on file with the state.",
    "With the silence of the Republican Governor Brian Kemp over the voting issues in Georgia, both rank-in-file Republicans and many state leaders are bitterly divided.",
    "On the other side of this, hes exposed a very dark side of thework swamp thats far worse than I ever imagined and I am not particularly optimistic for the future.",
    "If you want to see if the mail-in ballots were properly counted and the election was fairall you have to go back and look at the signatures on the envelopes.",
    "Ill make a deal with you, If you 2 Rs to the senate, Ill run again in 2024\nSean Hannity to Mark Meadows\nElect\nSean Hannity to Mark Meadows\nMake it about him.",
    "How about those many voters who have moved out of Georgia or who have not voted in ages but somehow managed to send an absentee ballot this go around?",
    "The recount in Georgia, despite assertions by the Secretary of State and some of the local media, has been an exercise in futility and disingenuous.",
    "In summary, the only verification of mail-in ballots is matching the signatures on the ballot envelopes to the signatures on file with the state.",
    "And running Sen. Chuck Schumer in attack ads wont work either because most Georgia voters have only a vague concept of who he is or what he does.",
    "Resentment towards Kemp among Trump supporters reeling from a loss many are suspicious of will make turnout for Perdue and Loeffler problematic.",
    "For the two Republican incumbents, and for the balance of power in the Senate, we are truly at the lick log. Now you know how to speak Georgian.",
    "Indeed they are faced with two branches of their party, one being a narrow Atlanta suburban, Athens, Savannah, and Sea Island establishment GOP.",
    "I come to this conclusion not just as a pollster who usually gets Georgia right, but who served as a state Representative, a GOP nominee for Lt.",
    "At the table the boss tells a corrupt policeman who is there to serve as a third party witness that he is going to speak to Michael in Italian.",
    "Mark Meadows to Sean Hannity\nYou saw and I saw it and others said Dont worry we have got it covered\nSean Hannity to Mark Meadows\nYes they did.",
    "Loeffler advocates have gone to the airwaves linking her opponent, Raphael Warnock, to support of the controversial Reverend Jeremiah Wright.",
    "There is a short window in which, under Georgia law, their status can be challenged by appealing to their local county election board.",
    "Meadows selectively provided these messages to the House select committee investigating the January 6, 2021, attack on the US Capitol.",
    "While that may convert a few suburban white voters, it could also inflame Georgias phenomenally strong African-American demographic.",
    "These are not wild assertions, the names, addresses and voting history of everyone of these voters has been obtained and verified.",
    "Get out and vote\nMark Meadows to Sean Hannity\nOn radio\nSean Hannity to Mark Meadows\nYes sir i\nSean Hannity to Mark Meadows\nOn it.",
    "Kemp has been asked to call a special legislative session to clean up Georgias chaotic absentee ballot laws but refuses to do so.",
    "January 5, 2021\nSean Hannity to Mark Meadows\nIm very worried about the next 48 hours\nSean Hannity to Mark Meadows\nPence pressure.",
    "Theres a lot of rural Republican-leaning counties outstanding and that will (inevitably) tighten things up very quickly, too.",
    "Mark Meadows to Sean Hannity\nSo upset to see what we allowed to happen\nSean Hannity to Mark Meadows\nHonestly we think alike.",
    "Im convinced now, that he defied all odds, beat the deep state twice and they were never going to let him win this election.",
    "But these dubious voters could have their status challenged for the upcoming runoff, yet so far no effort has materialized.",
    "Let NOT your heart be troubled my friend\nNovember 13, 2020\nSean Hannity to Mark Meadows\nWhat is happening with Haspel?",
    "Did u ever talk to Fox\nSean Hannity to Mark Meadows\nIve been at war with them\nMark Meadows to Sean Hannity\nI agree.",
    "We r so Fd as a country\nDecember 12, 2020\nMark Meadows to Sean Hannity\nI am afraid you are not missing anything.",
    "NC AZ\nSean Hannity to Mark Meadows\nYup\nMark Meadows to Sean Hannity\nNevada\nSean Hannity to Mark Meadows\nGot it.",
    "This is very easy to determineeven if the ballots have been separated from the signed envelopes they came in.",
    "Data shows that over 15,000 individuals who have moved out of Georgia, voted in the recent General Election.",
    "Whether it is the Wright commercial, or something else, you can bet that Loeffler will be accused of racism.",
    "That means ads showing solar panels being forced on their homes and social workers substituting for police.",
    "Im frustrated\nDecember 11, 2020\nMark Meadows to Sean Hannity\nSend me Suzanne Scotts number if you can.",
    "And worse, Im not sure what is left to do or say, and I dont like not knowing if its truly understood.",
    "2 of the worst candidates Ive ever seen\nMark Meadows to Sean Hannity\nThe seats are slipping away.",
    "They are completely devoted to Donald J. Trump and only Trump can deliver them back to the polls.",
    "The question is exactly how many mail-in ballots were counted that should not have been counted?",
    "Biden is a semi conscious corpse, and he will be controlled by a very radical left wing element.",
    "I did not talk with Suzanne because I got tied up with pardons but I will make sure I connect.",
    "November 3, 2020\nSean Hannity to Mark Meadows\nHey\nSean Hannity to Mark Meadows\nNC gonna be ok?",
    "The question is, why are Republicans this far into the next round without any effort to do so?",
    "But we must continue to fight\nSean Hannity to Mark Meadows\nOk Not sure what a senator can do.",
    "Higher turnout in both, Biden running a couple points ahead of how Clinton performed in 2016.",
    "1- Directing legal strategies vs Biden 2- NC Real estate 3- Other business I talked to Rudy.",
    "My colleague estimates those numbers have a high percentage of fraudulent or illegal votes.",
    "Very tough days but I will keep fighting\nSean Hannity to Mark Meadows\nYou fighting is fine.",
    "Among the trove of texts are more than 80 from Foxs Sean Hannity, which are included below.",
    "In Georgia, Trump not a political figure among most Republicans, hes closer to a religion.",
    "Despite statements to the contrary, there was a failure to properly authenticate ballots.",
    "We are going to fight and win\nSean Hannity to Mark Meadows\nYou really think its possible.",
    "Add to that over 14,000 low propensity voters who basically have not voted in ten years.",
    "Governor, and as the political analyst for three of the four Atlanta network affiliates.",
    "Your friendship means a great deal to me\nSean Hannity to Mark Meadows\nFeeling is mutual.",
    "Again, still waiting on 100K votes or so in both counties, but good signs for Ds there.",
    "Perdues opponent, Jon Ossoff has carefully cultivated image of a progressive moderate.",
    "Everyone\nSean Hannity to Mark Meadows\nI vacillate between mad as hell and sad as hell.",
    "He flatly declares, in a California version of our Georgia lingo, that dog wont hunt.",
    "Also if this doesnt end the way we want, you me and Jay are doing 3 things together.",
    "Any place in particular we need a push\nMark Meadows to Sean Hannity\nPennsylvania.",
    "Kemp is a total idiot\nSean Hannity to Mark Meadows\nHe has to make this about him.",
    "And the early campaign messages in the two races may further complicate matters.",
    "Just ask the esteemed last living pollster for Ronald Reagan, Craig Keshishian.",
    "We will talk wen I see u. Im at the party with my kids next Sunday night at 7.",
    "He should announce will lead the nationwide effort to reform voting integrity.",
    "If I had a dollar every time o asked before the election of this was covered.",
    "Id like to see him announce hes going to prioritize changing election laws.",
    "Its a time honored tradition in Georgia politics and trust me, its coming.",
    "Almost all of the votes were cast before the November 3rd same day voting.",
    "Throwing the S word around wont do enough to dent the Democratic nominee.",
    "December 8, 2020\nSean Hannity to Mark Meadows\nTexas case is very strong.",
    "Make no mistake, these voters really could care less about the two U.S.",
    "The country has foundational corruption that likely can never be fixed.",
    "You also need to spend at least half your time doing business with us.",
    "Errors in spelling and grammar reflect the messages as they were sent.",
    "Blank messages contain images or attachments not included in the logs.",
    "In the movie they switch languages to keep the policeman in the dark.",
    "We have to avoid a shutdown and get a bill passed or Ga is gone imho.",
    "That means we will no longer be the America we once thought we were.",
    "That is a house divided that must come together quickly and may not.",
    "Very disorganized but I have been busting heads yesterday and today.",
    "Sean Hannity to Mark Meadows\nThese 2 senate seats are slipping away.",
    "The other a massive North and South Georgia Trump Republican party.",
    "The Republican incumbents, Perdue and Loeffler, are the underdogs.",
    "Another 8800 inactive voters magically cast a vote in this cycle.",
    "November 10, 2020\nSean Hannity to Mark Meadows\nHow u holding up.",
    "By the time the public wakes up to this it will be too far gone.",
    "December 27, 2020\nSean Hannity to Mark Meadows\nYou ok my friend?",
    "Thanks for all you do\nSean Hannity to Mark Meadows\nNo worries.",
    "December 22, 2020\nSean Hannity to Mark Meadows\nHey my friend.",
    "But some of our people said it was going to be a landslide.",
    "Consider some statistics uncovered by one of my colleagues.",
    "Secondly, the huge Republican Trump base must be reengaged.",
    "Its so sad for this country they can pull this off in 2020.",
    "And announce hes running in 2024. President Trump in exile.",
    "ACLU filed over 400 lawsuits against Trump administration.",
    "I do NOT see January 6 happening the way he is being told.",
    "Sean Hannity to Mark Meadows\nSorry, I cant talk right now.",
    "Note: CNN has removed personal information from the texts.",
    "Mark Meadows to Sean Hannity\nArizona now down just 12813.",
    "Mark Meadows to Sean Hannity\nStress every vote matters.",
    "Everywhere\nSean Hannity to Mark Meadows\nIs turnout low?",
    "Finally, lets return to that discussion of the recount.",
    "Ive lost all confidence in our institutional strength.",
    "You are a true patriot and I am so very proud of you!",
    "I agree that he has to give some hope for the future.",
    "(8:34 PM)\nSean Hannity to Mark Meadows\nWill we hold??",
    "And that gets us the two Georgia U.S. Senate runoffs.",
    "The evil prevails for a time and they are rejoicing.",
    "The winning Republican strategy must be threefold.",
    "We need a major breakthrough, a video, something.",
    "Mark Meadows to Sean Hannity\nYoure exactly right.",
    "Mark Meadows to Sean Hannity\nFighting like crazy.",
    "I was screaming about no ads from Labor Day on.",
    "Mark Meadows to Sean Hannity\nI am doing well.",
    "Mark Meadows to Sean Hannity\nI am doing fine.",
    "The ramifications of this are incalculable.",
    "I did not have a good call with him today.",
    "Nothing The Media protects Joe and Hunter.",
    "There is no way Biden got these numbers.",
    "Connect the future to these candidates.",
    "Went to Cobb county to review process.",
    "Go to Fl and watch Joe mess up daily.",
    "I think I know the place pretty well.",
    "I thought she was close with Pompeo?",
    "Nobody will dare take this on again.",
    "Talked to everyone at length today.",
    "He cant mention the election again.",
    "We need Jim to front the messaging.",
    "When he speaks people will listen.",
    "I truly feel sorry for our friend.",
    "Wtf happened to our country Mark.",
    "I made my own they never ran it.",
    "Mark Meadows to Sean Hannity\nNo.",
    "Just mathematically impossible.",
    "Its already a heavy heavy lift.",
    "The fing lunatics is NOT fine.",
    "Everyone knows it was stolen.",
    "Im fed up with those people.",
    "We can make a powerful team.",
    "Hes never had a days peace.",
    "Im beginning to feel down.",
    "Working around the clock.",
    "Thats another discussion.",
    "They are NOT helping him.",
    "Still a Herculean climb.",
    "Im not pointing fingers.",
    "To much disorganization.",
    "Someone thats credible.",
    "Still ballots to count.",
    "They steal an election.",
    "What am I missing Mark?",
    "We need to do the same.",
    "WH counsel will leave.",
    "Eventful week or so.",
    "Art of the comeback.",
    "Thx for helping him.",
    "How are you doing?",
    "I saw the tweet.",
    "I would be rich.",
    "After the 6 th.",
    "And Im serious.",
    "Stay engaged.",
    "Additionally.",
    "Let me blunt.",
    "Seems good.",
    "Senators.",
    "Any Hope?",
    "Ideas?",
    "Ever."
  ]
}