{
  "id": 4855,
  "mediaId": 1576,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "WABE's Week In Review: Georgia's new education laws, Kemp v Perdue and saving thousands of bees",
  "image": "https://www.wabe.org/app/uploads/2022/04/AP22114469955679-1-336x189.jpg",
  "link": "https://www.wabe.org/wabes-week-in-review-georgias-new-education-laws-kemp-v-perdue-and-saving-thousands-of-bees/",
  "sentiment": "-0.383",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    4325,
    428,
    608,
    2662,
    2672
  ],
  "sentences": [
    "For more analysis of the gubernatorial race, check out WABEs political podcast Georgia Votes 2022\ng?NEW episode of @wabenews Georgia Votes 2022 w/ @Emma_Hurt @rahulbali  we talk ads, debates and early voting.g?\ngSubscribe and rate us  wherever you get your @wabeatl podcasts!https://t.co/l5trXsThAE\n Sam Gringlas (@gringsam) April 29, 2022\nAtlantas tech scene over the last 20 years\nAtlantas tech scene has evolved a lot over the past decade.",
    "How can you not teach intersectionality when you have to teach about the lived experience of people throughout history who have different identities and different experiences??\nOthers criticized Kemp for signing the bills in Forsyth County, where Black residents were terrorized and forced out more than 100 years ago.",
    "The bills were signing into law today are about doing the right thing.?\nHow are you going to teach the three-fifths compromise if you cannot teach white supremacy and that the United States is racist?? said Anthony Downer, who teaches American Government at Douglass High School in Atlanta.",
    "The controversial measures include how teachers can talk about race, making it easier for parents to get books reviewed in school libraries and that open the door to prohibiting transgender kids from playing on the sports team that matches their gender identity.",
    "Saving bees\nMore than 600 pounds of bees were supposed to go from Sacramento to Anchorage, but, due to flight cancellations, the bees ended up at the Delta cargo bay in Atlanta.",
    "Major tech companies are establishing offices here, hoping to tap into the citys supply of tech workers, while tech entrepreneurs continue to compete for funding and attention.",
    "On this weeks episode we feature a conversation with Emman Small Eyez? Twe, whos hosted the Atlanta tech podcast Digital Good Times? since 2014.",
    "Both were centered on Perdue, who is backed by former President Trump, and their false narrative that the 2020 election was stolen.",
    "Senate looks at military housing\nA U.S. Senate investigation alleges ongoing abuses in military housing at Fort Gordon in Augusta.",
    "We werent elected by the people of this state to shy away from what some would call controversial,? said Kemp at the bill signing.",
    "Georgia became the latest state to approve sweeping conservative classroom priorities ahead of the midterm election.",
    "It is a bipartisan investigation into a military housing contractor, led by Georgia U.S.",
    "Now, four percent of Forsyths population is Black, compared to 33 percent of the state.",
    "Kemp and his chief Republican rival for the nomination for governor, former U.S.",
    "Brian Kemp signed a slew of controversial education bills on Thursday.",
    "Senator David Perdue, battled in two debates over the last week.",
    "Then, Georgia beekeepers rushed to the airport to save them.",
    "But the heat started killing the bees.",
    "Senator Jon Ossoff.",
    "Kemp v Perdue\nGov.",
    "Gov."
  ]
}