{
  "id": 4875,
  "mediaId": 195,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Ask me nicely: Trump demanded loyalty from governors for help, says book",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trumpdonald3_08242020getty.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3470441-ask-me-nicely-trump-demanded-loyalty-from-governors-for-help-says-book/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    2095
  ],
  "sentences": [
    "It says everything and nothing at the same time.?\nIn another call with governors revealed by the book, after Trump said he would cut back federal funding for all but two states that deployed the National Guard to battle the coronavirus pandemic, he told governors who wanted the full costs covered: You have to call me and ask me nicely.?\nTrumps unorthodox and at times boorish approaches to politics alarmed many governors, who told the authors his uneven and sometimes disinterested concern with the coronavirus pandemic made battling the virus more difficult.",
    "Well, ask me nicely.?\nThe anecdote, reported by the New York Times journalists Jonathan Martin and Alexander Burns in their forthcoming book, This Will Not Pass,? is just one of a series of Trumps interactions with governors that struck many state executives as blatant departures from the norms of cooperative governing.",
    "The book, obtained by The Hill prior to its release on Tuesday, depicts Trump as a mafia don, demanding loyalty from supplicants and political opponents alike, by turns using the largest bully pulpit in the world to beat them into submission and cajoling them in private to offer support.",
    "Republican governors, frustrated by the lack of direction from a White House under the control of their own party, took to holding private conference calls outside of the administrations earshot to strategize and share best practices to combat the pandemic.",
    "As Brown, the Oregon governor, worked a back channel to then-Vice President Mike Pence to get federal agents out of Portland, a Trump administration official sounded an alarming warning to Browns top aide, according to the book.",
    "In the days after Floyds death, as the virus still raged across the nation, Trump was planning his return to in-person events with a rally in Tulsa, Okla., where he hoped for a packed house to show off his electoral strength.",
    "The book reports that Cooper told Trump he was worried about the delegates who would celebrate Trumps renomination, many of whom were older, almost all of whom would travel from other parts of the country to come together.",
    "Have you ever heard of such a ridiculous thing??\nSpokespeople for the governors quoted in the book, contacted for this story, either confirmed their recollection of the events or declined to deny those recollections.",
    "President Trumps comments, his rhetoric and his almost flippant attitude in some contexts made it difficult for a governor like me to really push the seriousness of the medical emergency that were in,? Arkansas Gov.",
    "On the other hand, some in the Trump administration saw a political benefit to the violence that raged in American streets, including clashes in Portland, Ore., between federal agents and antifa activists.",
    "You gotta sit here and listen to this because I think the president of the United States is having a nervous breakdown or something, and its scary,? Mills recalled telling the guard, according to the book.",
    "I dont want to be sitting in a place thats, you know, 50 percent empty or more.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "In a call with governors after nationwide protests following the death of George Floyd at the hands of Minneapolis police officers, Trump demanded they crack down to restore order in their states.",
    "Gavin Newsom (D) to discuss a cruise ship moored in San Francisco Bay, on which passengers were sick with the coronavirus, Trump agreed to allow the ship to dock so passengers could be treated.",
    "Brian Kemp (R) ordered his state reopened, contrary to guidance from the Centers for Disease Control and Prevention, Trump took the opportunity to blast his onetime ally in public.",
    "Roy Cooper (D) to allow the Republican National Committee to hold his renominating convention as normal, without requiring masks or social distancing inside the arena in Charlotte.",
    "But he did not seem to grasp the significance of the holiday, which commemorates the enforcement of the Emancipation Proclamation and the end of slavery in the United States.",
    "Ive never had an empty seat, from the day I came down the escalator,? Trump told Cooper, recalling his campaign announcement at Trump Tower in New York.",
    "Trump was aware that the rally was scheduled for Juneteenth, a holiday that carried extra weight amid the racial justice protests.",
    "In the aftermath of devastating storms that knocked out power to tens of thousands of people in Connecticut in August 2020, Gov.",
    "He used to say that even privately  that was one of his favorite words,? Newsom recalled later to authors Martin and Burns.",
    "Trump showed his lack of enthusiasm for containing the virus later that summer, as he tried to push North Carolina Gov.",
    "Privately, Trump dispatched then-press secretary Kayleigh McEnany to demand Kemp rescind his order, the book reports.",
    "Can you imagine changing the day of the rally in Oklahoma to accommodate these people?? Trump asked the Murphys.",
    "Phil Murphy (D) was taken aback when Trump showed him a room adjoining the Oval Office crammed with MAGA gear.",
    "They literally hand you a shopping bag, and you took anything youd like,? Murphy recalled to the authors.",
    "Theres something you want to ask me about FEMA?? Trump said, according to Lamonts recollection.",
    "Not everyone wants to de-escalate this,? the official told Nik Blosser, Browns chief of staff.",
    "Dining at his golf club in Bedminster, N.J., he shared his plans with Murphy and his wife.",
    "Janet Mills (D) called a security guard into the room to listen in on the same call.",
    "The coronavirus pandemic was another excuse Trump used to even political scores.",
    "Trump said he would be watching, for the reciprocity,? according to the book.",
    "Kate Brown (D) called her husband into the room to listen in, the book said.",
    "On a visit to the White House early in the pandemic, New Jersey Gov.",
    "Arent you worried about them, particularly?? Cooper asked Trump.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Ned Lamont (D) called the White House seeking federal help.",
    "Asa Hutchinson (R), no liberal himself, told the authors.",
    "You cant make this shit up,? Brown told her husband.",
    "Hours later, then-President Trump called back.",
    "His rant was so unhinged that Oregon Gov.",
    "When Trump called California Gov.",
    "No, no, Im not,? Trump replied.",
    "Across the country, Maine Gov.",
    "When Georgia Gov."
  ]
}