{
  "id": 4880,
  "mediaId": 32,
  "date": "d2022-04-28T15:28:37",
  "headline": "Georgia just became the latest state to require personal finance education",
  "image": "https://image.cnbcfm.com/api/v1/image/106997134-16414059892022-01-05t180200z_1636768802_rc22tr9aeqgt_rtrmadp_0_usa-politics-georgia.jpeg?v=1641406066&w=740&h=416&ffmt=webp",
  "link": "https://www.cnbc.com/2022/04/28/georgia-is-now-the-latest-state-to-mandate-personal-finance-education.html",
  "sentiment": "0",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carmen Reinicke",
  "authorUrl": "",
  "termIds": [
    2095,
    3453,
    2661,
    2672,
    2881,
    2907,
    2910
  ],
  "sentences": [
    "More from Invest in You:\n16 U.S. cities where women under 30 earn more than their male peers\nGreat Resignation is spurring employers to offer financial-wellness benefits\nA four-day workweek pilot program is now underway in the U.S. and Canada\nA growing trend\nGeorgia is the 13th state to mandate personal finance education for its students, according to nonprofit Next Gen Personal Finance, which tracks such bills.",
    "The measure will ensure that [students] learn financial literacy in our schools, like the importance of good credit and how to budget properly so that they can be better prepared for the world beyond the classroom,? said Kemp during the signing event.",
    "Having such education in schools is popular among adults in the U.S. Nearly 90% said they support having a personal finance course required in schools, according to a recent survey from the National Endowment for Financial Education.",
    "Now that Georgias legislation has become law, South Carolina is the only state in the Southeast that does not have mandated personal finance coursework, according to Tim Ranzetta, co-founder of Next Gen Personal Finance.",
    "Georgia Governor Brian Kemp makes remarks during a visit to Adventure Outdoors gun shop as he pushes for a new state law to loosen requirements to carry a handgun in public, in Smyrna, Georgia, January 5, 2022.",
    "CHECK OUT: 74-year-old retiree is now a model: You dont have to fade into the background with Acorns+CNBC\nDisclosure: NBCUniversal and Comcast Ventures are investors in Acorns.",
    "Starting in the 2024-2025 school year, all 11th- and 12th-grade students will need to take at least a half-credit course in financial literacy before graduation.",
    "There are high schools that offer personal finance courses in states without mandates, but access is not equal, according to a recent report from the nonprofit.",
    "In the last 12 months, Florida, Nebraska, Ohio and Rhode Island have passed similar laws and are in the process of implementing them for all students.",
    "Alyssa Pointer | Reuters\nHigh school students in Georgia will soon have guaranteed access to a personal finance course before they graduate.",
    "Once Georgias bill is implemented, it will mean that more than 35% of students in the U.S. will have access to a financial literacy class.",
    "Thats more than double the share of students that had access to such coursework in 2018, according to Next Gen Personal Finance.",
    "Legislation in Michigan, Minnesota and New Hampshire is also nearing the finish line and could be passed in the coming months.",
    "And 80% of those surveyed said that they wish they had been required to take a personal finance course to graduate.",
    "What state may be next\nThere are still a few states with pending legislation that may be passed later in the year.",
    "That share drops to 1 in 20 in schools where 75% of students are nonwhite or receive free and reduced lunch.",
    "Having laws requiring personal finance education are important to ensure students have equal opportunities.",
    "Brian Kemp signed into law SB 220, a bill requiring personal finance classes for high school students.",
    "SIGN UP: Money 101 is an 8-week learning course to financial freedom, delivered weekly to your inbox.",
    "Only 10% of students in states without guaranteed access to personal finance can take such a course.",
    "Its the latest in a growing trend of states adding personal finance education.",
    "South Carolina, for example, has a bill currently in conference committee.",
    "For the Spanish version Dinero 101, click here.",
    "On Thursday, Republican Gov."
  ]
}