{
  "id": 4881,
  "mediaId": 305,
  "date": "d2022-04-28T15:00",
  "headline": "Republican Gov. Brian Kemp Signs Bill Limiting Race Discussions In Classrooms",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/3064a544312b69d99d94dadb08b699b0.jpg",
  "link": "https://www.theroot.com/republican-gov-brian-kemp-signs-bill-limiting-race-dis-1848855131",
  "sentiment": "0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    1303,
    2095,
    147,
    3340,
    2672,
    2945
  ],
  "sentences": [
    "In a statement, The Democratic Party of Georgia said new laws will will pit parents against teachers, attack educators, politicize Georgia schools, and jeopardize kids education  all for Kemps own political gain.?\nFrom the moves to censor whats taught in classrooms, to the efforts to make it easier to ban books and to attack the parent-teacher partnership, its clear that for Kemp, this is about politics and inserting a partisan agenda into our classrooms,? Elaine Padgett, a Forsyth County parent running for the local Board of Education, wrote in the statement.",
    "House Bill 1084 or the Protect Students First Act? outlines divisive concepts as being those that teach the United States of America is fundamentally racist; an individual, by virtue of his or her race, is inherently or consciously racist or oppressive toward individuals of other races,? and an individual, solely by virtue of his or her race, bears individual responsibility for actions committed in the past by other individuals of the same race.?\nThe ACLU of Georgia fired back and said parents want their children to be taught accurate curricula.",
    "Kemp also signed HB 1178, or the Parents Bill of Rights,? which provides greater transparency to parents and legal guardians regarding what their students are being taught, and SB 226, which bans literature or books deemed offensive from school libraries.",
    "HB 1084 will set up an athletic executive oversight committee? in the state that has the authority to establish a ban on transgender women participating on sports teams consistent with their gender at high schools in the state.",
    "Whether you are white, Black, Hispanic or Asian most parents want their children to learn about history the way they learn about math as accurately as possible? Andrea Young, the groups executive director, said in a statement.",
    "Georgia governor Brian Kemp signed a few education bills into law, including one that targets divisive concepts? in the classroom, as reported by CNN.",
    "The Republican party continues the legislative crusade to bend history to its warped view of America."
  ]
}