{
  "id": 4895,
  "mediaId": 1164,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Georgia Gov. Brian Kemp signs measure restricting discussion of race in classrooms",
  "image": "https://cdnph.upi.com/svc/sv/upi/9881651193903/2022/1/75692dbddd382208c378d69b0e5a06c3/Georgia-Gov-Brian-Kemp-signs-measure-restricting-discussion-of-race-in-classrooms.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/04/28/Brian-Kemp-signs-measure-restricting-discussion-race-classrooms/9881651193903/",
  "sentiment": "0.0",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Uria",
  "authorUrl": "https://www.upi.com/author/Daniel-Uria/",
  "termIds": [
    2095
  ],
  "sentences": [
    "The \"Protect Students First Act\" broadly restricts how teachers present \"divisive concepts\" including that the United States is \"fundamentally racist\" and that an individual by virtue of their race are \"inherently or consciously racist or oppressive toward individuals of other races\" or \"bears individual responsibility for actions committed in the past by other individuals of the same race.\"",
    "Andrea Young, executive director of the American Civil Liberties Union of Georgia, said the organization's legal teams were \"prepared to defend the constitutional rights of students and educators if this law impedes their ability to learn and teach.\"",
    "Kemp also signed a measure banning literature or books deemed offensive from school libraries as well as a \"Parents' Bill of Rights,\" which provides greater transparency to parents and legal guardians about the curriculum taught to their students.",
    "The law also establishes an athletic executive oversight committee in the state with the authority to establish a ban on transgender athletes competing on sports teams consistent with their gender at high schools in the state.",
    "\"It ensures all of our state and nation's history is taught accurately, because here in Georgia our classrooms will not be pawns to those who indoctrinate our kids with their partisan political agendas,\" he said.",
    "\"Whether you are White, Black, Hispanic or Asian -- most parents want their children to learn about history the way they learn about math -- as accurately as possible,\" said Young.",
    "On Thursday, Kemp said the legislation puts the state's children \"ahead of partisan agenda and gets parents back in charge of their kids education.\"",
    "Kemp said Thursday during a press conference at the Forsyth County Arts and Learning Center that the measure protects \"academic freedom.\"",
    "Brian Kemp on Thursday signed a series of education bills into law including one restricting discussion of race in classrooms.",
    "April 28 (UPI) -- Georgia Gov."
  ]
}