{
  "id": 4913,
  "mediaId": 12,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Wisconsin meat snack firm to build 800-worker plant in Perry",
  "image": "https://www.ajc.com/resizer/psyLSxW9d0f4Srv4TSSPZFZwiAY=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/HXS2XDQE5JETZIFGQEOA4T2Y4Y.jfif",
  "link": "https://www.ajc.com/news/georgia-news/wisconsin-meat-snack-firm-to-build-800-worker-plant-in-perry/6DDZIQHAHNGZZDGNKUMCDSHMII/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael E. Kanell",
  "authorUrl": "https://www.ajc.com/staff/michael-e-kanell/",
  "termIds": [
    2095,
    3175,
    3317,
    2674,
    2972,
    4932,
    5014
  ],
  "sentences": [
    "The promised investment came after negotiation with state officials, as well as those of the county, city, public schools and the Central Georgia Technical College, with the ultimate goal of bringing quality jobs to our citizens,? according to a statement by Ben Hulbert, chair of the countys development authority.",
    "Jack Links, a Wisconsin-based manufacturer, will build a plant on a 120-acre site near I-75 in the Houston County town, aiming to start production by the end of next year, according to a statement from company and government officials.",
    "Because it is privately-held, Jack Links is not required to release financial details, but online jobs site Zippia estimates that the company last year had revenues of about $145 million.",
    "The company said it expects to hire for positions that include management, production and production supervision, as well as maintenance, engineering, and general office support.",
    "Houston County, which is south of Macon and includes the city of Warner-Robins, has a workforce of about 72,000, according to the Georgia Department of Labor.",
    "However, the company will utilize the states Quick Start program for training and placing workers, according to a statement from Gov.",
    "A maker of meat snacks has announced plans to invest $450 million and create 800 jobs at a planned manufacturing plant in Perry.",
    "No details were released about any economic subsidies or incentives given by the state or local government to the company.",
    "The company, known for its Messin with Sasquatch? ad campaign, makes jerky, meat sticks, sausages and Bloody Mary mixes.",
    "Many companies have complained in recent months that low unemployment has made finding qualified workers a challenge.",
    "The company has facilities in the Midwest, as well as in New Zealand, Brazil, and Germany, officials said.",
    "The countys unemployment rate is just 3.1%, the same as the jobless rate for the state.",
    "Founded in 1985, the company is family-owned and operated.",
    "Brian Kemp."
  ]
}