{
  "id": 4923,
  "mediaId": 558,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Gov. Kemp signs state income tax cuts into law. Heres what that means for you:",
  "image": "https://s.yimg.com/ny/api/res/1.2/JHlXkcSAmnfhh39uCEVXOQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTQyMDtoPTIzNztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/gPdTceLQBzgSajqUDuAvnA--~B/aD0xNjk7dz0zMDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/wsb_cox_articles_232/ead71675194f2fcaa184a589c3b74e11",
  "link": "https://news.yahoo.com/gov-kemp-signs-state-income-194046136.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Hes been calling for a complete elimination of the state income tax for months now, something other GOP lawmakers like House Speaker David Ralston worry would hamstring state finances.",
    "Brian Kemp signed into law Tuesday one of the largest state income tax cuts in Georgia history  and he did it in the very county where his chief GOP rival David Perdue grew up.",
    "We have a governor who was embattled, and who I think really showed the true colors of why he is a weak leader, and why we need to make a change,? Perdue said.",
    "But the law does have some built-in circuit breakers in case a recession causes the state to miss some specific economic growth targets.",
    "He joined Kemp for a big economic announcement bringing 800 jobs to Houston County, but he was not there as part of a campaign event.",
    "I strongly believe that government should take in the very least amount possible needed to serve the people properly,? Kemp said.",
    "I really believe that a weakened governor was exposed.?\nHouston County is also where Perdues first cousin, former Georgia Gov.",
    "Perdue wants to eliminate the state income tax altogether, though many top lawmakers dont think thats a good idea.",
    "Starting Jan. 1, 2024, that tax rate will drop incrementally for five years until it reaches just 4% in 2029.",
    "TRENDING STORIES:\nIf that happens, the tax cut will be delayed a full year until those targets are met.",
    "So they came up with this incremental tax cut that will cut your state taxes over five years.",
    "On Monday, Perdue said its time Georgia made a change in leadership.",
    "We must never forget that taxpayer dollars are the peoples money.",
    "Perdue doesnt think the tax cuts go nearly far enough.",
    "Right now, the state income tax rate is just below 6%.",
    "Theyre not the governments,? Kemp said.",
    "Sonny Perdue, is from.",
    "IN OTHER NEWS:",
    "Gov."
  ]
}