{
  "id": 4948,
  "mediaId": 63,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Florida Gov. DeSantis Signs Bill To Form Election Police Force",
  "image": "https://imageio.forbes.com/specials-images/imageserve/62673261f9cc01f46e8c70eb/CPAC-DeSantis/0x0.jpg?fit=crop&format=jpg&crop=3387,1905,x0,y0,safe",
  "link": "https://www.forbes.com/sites/masonbissada/2022/04/25/florida-gov-desantis-signs-bill-to-form-election-police-force/",
  "sentiment": "0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mason Bissada",
  "authorUrl": "https://www.forbes.com/sites/masonbissada/",
  "termIds": [
    661,
    2095
  ],
  "sentences": [
    "DeSantis is one of several Republican officials to propose more stringent investigations into voter fraudwhich researchers say is vanishingly rareas part of a broad push to emphasize election integrity.? Georgia gubernatorial candidate David Perdue, a former senator who lost his seat to Sen. Jon Ossoff (D) last year and is now challenging incumbent Gov.",
    "Brian Kemp (R), said in January he would create an election law division in the state to investigate such crimes and arrest those who commit these offenses.? Arizona State Sen. Wendy Rogers (R) also proposed a bill to establish a bureau of elections? with the power to investigate voter fraud claims in her state last year.",
    "Ron DeSantis (R) signed a bill Monday that will create a state police force to investigate voter fraud and other election crimes, as Republicans nationwide fixate on voter fraud following former President Donald Trumps unsubstantiated claims that the 2020 election was stolen.",
    "A poll of attendees at the Conservative Political Action Conference in February found DeSantis was the preferred 2024 candidate if Trump doesnt run, receiving 28% of the vote, though he fell far behind the former president, who garnered 59% of the vote, according to CBS.",
    "Key Facts\nLed by officers appointed by DeSantis, the Office of Election Crimes and Security? will conduct investigations of alleged voter fraud independent of local prosecutors, whom DeSantis says may lack the expertise or resources needed to look into voter fraud.",
    "Though Trump won Florida in 2020, a contest DeSantis called the best-run election in this state [weve] probably ever had,? the fervently pro-Trump governor has avoided commenting on whether he believed the election was rigged in favor of President Joe Biden.",
    "Last year, the non-profit MITRE Corporation analyzed the 2020 presidential election results in eight battleground states, including Florida, and found there was no evidence of fraud, manipulation, or uncorrected error? in the election.",
    "Republicans in numerous states have made election law a key priority over the last year, a trend driven partly by Trumps false claims that his 2020 election loss was driven by widespread vote-rigging.",
    "Thats how many claims of voter fraud Floridas Department of State referred to law enforcement or prosecuting authorities in 2020, compared to more than 11 million votes cast in the 2020 election.",
    "Zeeshan Aleem, an opinion columnist at MSNBC, deemed the concept of a dedicated election police force a scare tactic? and a waste of taxpayer money.",
    "The bill also increases the punishment for ballot-harvesting and requires election officials to conduct more frequent maintenance of voter lists.",
    "The plan will cost $3.7 million, said state Rep. Daniel Perez (R), one of the bills sponsors, according to CNN.",
    "If Trump chooses not to seek the 2024 Republican presidential nomination, DeSantis could be a top contender.",
    "Floridas Senate passed the bill on March 4, and the state House approved it five days later.",
    "Topline\nFlorida Gov.",
    "75."
  ]
}