{
  "id": 4983,
  "mediaId": 157,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "'He knows better!' Former Pence staffer shreds David Perdue for trying to run on election conspiracy theories",
  "image": "https://www.rawstory.com/media-library/cnn-sounds-the-alarm-on-georgia-s-david-perdue-figuring-out-just-how-much-money-he-s-making-is-hard.jpg?id=27821754&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/david-perdue-trump-coup-2657212202/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    1147,
    1434,
    2095,
    4325,
    4524,
    428,
    2672
  ],
  "sentences": [
    "On CNN Monday, former Mike Pence press secretary Alyssa Farah Griffin slammed former Sen. David Perdue (R-GA) for continuing to push former President Donald Trump's \"Big Lie\" in his newest bid for office.",
    "Rising gas prices, unbelievable inflation, the brink of war  all of that started here in Georgia when our governor allowed radical Democrats to steal our election.\"",
    "\"Georgia, one of these places Donald Trump falsely claimed a whole bunch of fraud that did not exist, etcetera, etcetera ... here's David Perdue in a debate.\"",
    "\"David Perdue, former senator, formerly respected CEO, is now challenging incumbent Republican governor Brian Kemp in Georgia,\" said anchor Jake Tapper.",
    "He's running on, it was stolen and Governor Kemp should not be governor from upholding the democratic election.\"",
    "People weren't turning out because everyone was saying, hey, your vote doesn't count, it's all rigged.",
    "\"Let me be very clear tonight,\" said Perdue in a clip of the recent gubernatorial debate.",
    "By the way, he lost that race because he echoed election fraud claims.",
    "\"The election of 2020 was rigged and stolen.",
    "I was advising the Georgia Senate runoffs.",
    "\"I don't think so,\" said Farah Griffin.",
    "\"Does he believe that?\"",
    "People around him do.",
    "\"He knows better.",
    "asked Tapper.",
    "Watch below:"
  ]
}