{
  "id": 4984,
  "mediaId": 136,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Donald Trump's 'Emotional' Endorsements Will 'Backfire': Chris Christie",
  "image": "https://d.newsweek.com/en/full/2025114/donald-trumps-endorsements-will-backfire-chris-christie.webp?w=790&f=f9b33b5a62c383a1feb59e2aa69c9644",
  "link": "https://www.newsweek.com/donald-trumps-emotional-endorsements-will-backfire-chris-christie-1700415",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    2095,
    3103
  ],
  "sentences": [
    "Trump's endorsements, long sought after among Republican candidates, have faced criticism from some of his supporters in recent weeks, as many feel he is endorsing candidates not entirely aligned with his hardline conservative style of politics.",
    "\"I do think though, when we get to June, we're going to look back and say that most of the big endorsements he madenot the ones in deep red House districtsbut the big endorsements he made, are going to turn out to not have been right,\" he said.",
    "He is also reportedly considering backing Lynda Blanchard, who was his U.S. ambassador to Slovenia, over Governor Kay Ivey in Alabama, according to AL.com\nChristie predicted all of the Republican incumbents \"are going to win their primaries.\"",
    "Trump has endorsed candidates for all types offices ranging from gubernatorial and Senate to state legislative racesleaving many Republicans vying for his endorsement in hopes it would boost their campaign credentials with his supporters.",
    "Notably, his endorsement of Dr. Mehmet Oz for Pennsylvania's Senate drew criticism from many conservatives, who took issue with past comments Oz seemingly made in support of gun control and abortion.",
    "Christie, who supported the former president's campaigns, echoed the sentiment during an appearance on ABC News' This Week on Sunday morning, offering his insight on how Trump makes his endorsements.",
    "The former president has officially endorsed former Senator David Perdue over Governor Brian Kemp in Georgia and Lieutenant Governor Janice McGeachin over Governor Brad Little in Idaho.",
    "He first pointed to Trump endorsing several incumbent Republican governors, who have disputed his unfounded election fraud claims as potentially tarnishing his track record.",
    "Former President Donald Trump's \"emotional\" endorsements will \"backfire\" on him within the next few months, predicted former New Jersey Governor Chris Christie.",
    "Trump earlier in April endorsed Vance, who in the past was highly skeptical of him, over several other Republican candidates, leaving some supporters upset.",
    "His Vance endorsement also faced similar criticism, with some pointing out that Vance had been trailing opponent Josh Mandel in the polls.",
    "Christie warned that endorsement, along with others, could end up landing \"all over the place.\"",
    "\"The idea that he makes these decisions based on political analysis is sophistry,\" he said.",
    "He also expressed skepticism that the former president's controversial endorsement of J.D.",
    "It was called a \"mistake\" by Laura Ingraham, a longtime Trump supporter.",
    "Other Republicans have also slammed some of Trump's recent endorsements.",
    "Vance in Ohio's Senate race may not be a \"lay up\" proxy victory.",
    "\"This is all emotional decisions, and who speaks to him last.\"",
    "Newsweek reached out to Trump's office for comment."
  ]
}