{
  "id": 5030,
  "mediaId": 12,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Sonny Perdue says Georgia must sell value of college degree",
  "image": "https://d1fegwn2wjh0cs.cloudfront.net/04-20-2022/t_7b125237f6bd4fc5a04159624fe91564_name_s3___ajc_arc_photo_integration_Freelancer_042022_SONNY_PERDUE_003.JPG",
  "link": "https://www.ajc.com/education/sonny-perdue-says-georgia-must-sell-value-of-college-degree/ZFG5S5M675DEHLOA2DJ6DL4MNI/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Stirgus",
  "authorUrl": "https://www.ajc.com/staff/eric-stirgus/",
  "termIds": [
    2095
  ],
  "sentences": [
    "One recruitment strategy could be encouraging adult learners to seek degrees or certificates through some of its online programs, the former two-term governor told The Atlanta Journal-Constitution in his first interview since becoming chancellor earlier this month.",
    "The American Association of University Professors took the rare step of censuring the University System of Georgia last month over the changes, a move some believe will hurt in recruiting top-flight professors from other schools.",
    "Perdue expressed his support for recent changes to the systems post-tenure review process, which some faculty say will make it tougher for professors to speak candidly about campus issues for fear they may lose their jobs.",
    "University System of Georgia Chancellor Sonny Perdue said its schools must find more ways to recruit students and help them graduate as it faces a projected enrollment decline in a few years.",
    "Weve got to sell the long-term value of higher education,? Perdue said Wednesday in his sparsely decorated office, a block away from his old workspace at the state Capitol.",
    "Sonny Perdue\nBirthplace: Perry, Georgia\nPolitical History: Georgia state senator, 1991-2002; governor, 2003-2011; U.S. Department of Agriculture secretary, 2017-2021.",
    "Perdues interest in the job sparked a rare protest outside the systems office last year and an online campaign against his candidacy by some students and faculty.",
    "He said the states budget increase for the system, which resulted in the system removing its special institutional fee, will help many students stay in school.",
    "Were not at that point now.?\nPerdues appointment came after a yearlong battle waged by critics who said he lacked higher education administrative experience.",
    "The states Board of Regents approved a plan about a decade ago to consolidate some of its schools as a cost-cutting measure after the Great Recession.",
    "The criticism shifted to the selection process administered by the state Board of Regents, a 19-member group with several Kemp campaign contributors.",
    "The board voted without opposition to make Perdue its sole finalist for the job after private interviews with him and two other candidates.",
    "Perdue, who met with student government leaders and other groups before becoming chancellor, said hell continue to visit with stakeholders.",
    "Perdue said he understood the criticism, but pointed to his leadership track record to show that he can be an effective chancellor.",
    "Since the pandemic began, more young people went into the workforce instead of enrolling in college to support their families.",
    "His first cousin  former U.S. Sen. David Perdue  is running against Kemp for the Republican Partys nomination for governor.",
    "Theyre meant to hold people accountable for what theyre doing.?\nPerdue said hell explore ways to keep tuition affordable.",
    "We talked about whether I had any interest in applying for the job of chancellor, and thats how it began,? Perdue said.",
    "Perdue had just completed a four-year stint in then-President Donald Trumps Cabinet as agriculture secretary.",
    "System leaders have said there may be greater declines ahead because of decreasing birth rates nationally.",
    "Perdue said recruitment and retention are key as employers offer higher starting salaries across Georgia.",
    "Perdue said he does not have plans to ideologically reshape the systems 26 colleges and universities.",
    "Weve got some challenged institutions and there may be some tough decisions down the road,? he said.",
    "The 340,000-student system had a slight enrollment decline last fall, its first in about a decade.",
    "The 75-year-old Republican said his interest in the job stemmed from a conversation with Gov.",
    "Brian Kemp after former Chancellor Steve Wrigley announced his plans to retire a year ago.",
    "He also suggested having more advisers work one-on-one with struggling students.",
    "Several of the systems schools have six-year graduation rates below 50%.",
    "Personal: Perdue was a walk-in for the Georgia Bulldogs football team.",
    "I believe in First Amendment rights for everyone,? he said.",
    "The fee ranged from $200 to more than $500 a semester.",
    "Sometimes, he said, the meetings will be a surprise.",
    "The systems budget is largely based on enrollment.",
    "Perdue said he has no current consolidation plans.",
    "The policies are not mean-spirited,? Perdue said.",
    "He served as a captain in the U.S. Air Force.",
    "Im in listening mode right now,? he said.",
    "We talked about the state as a whole.",
    "I believe in freedom of expression.",
    "... We talked about my interests.",
    "Perdue was also a veterinarian.",
    "I believe in academic freedom."
  ]
}