{
  "id": 5037,
  "mediaId": 157,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Crazytown: Former senator aghast Marjorie Taylor Greene has more power than Kevin McCarthy and Mitch McConnell",
  "image": "https://www.rawstory.com/media-library/marjorie-taylor-greene.png?id=27403045&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/marjorie-taylor-greene-crazytown/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1017,
    1609,
    1765,
    2071,
    2095,
    327,
    414,
    428
  ],
  "sentences": [
    "QAnon-promoting Rep. Marjorie Taylor Greene (R-GA) may not even sit on a single congressional committee, but the first-term Republican has more political power than GOP Leader Kevin McCarthy (R-CA), an MSNBC analyst argued on Thursday.",
    "And it is unbelievable when you look at the history of the Republican Party and the smart people and people who I disagreed with but who had integrity and would stand up for the right thing in the moment of history when it's important.",
    "McCaskill referred to Greene as \"the QAnon lady\" in reference to one of the conspiracy theories voiced by the congresswoman who infamously suggested that California wildfires were started by a Jewish space laser.",
    "Former Sen. Claire McCaskill (D-MO) explained her thinking during an interview on MSNBC with \"Deadline: White House\" host Nicolle Wallace.",
    "\"That's who's in charge in the Republican Party are these crazytown people along with the liar-in-chief down at Mar-a-Lago playing golf.",
    "Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene",
    "\"She had more power today, I think, than Kevin McCarthy,\" she explained.",
    "\"She is going to white nationalist rallies and they do nothing.",
    "\"He thinks he's some big genius  and Mitch McConnell, too.\"",
    "That's how afraid of her they are,\" McCaskill continued.",
    "Watch:\nRELATED: 'She is going through hell!'",
    "none of these folks pass that test.",
    "None of them.\""
  ]
}