{
  "id": 5040,
  "mediaId": 157,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Greg Abbott gave Crime Stoppers $6 million  and theyre attacking Democrats: report",
  "image": "https://www.rawstory.com/media-library/gov-greg-abbott.jpg?id=29710476&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/greg-abbott-houston-crime-stoppers/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2095
  ],
  "sentences": [
    "I was in San Antonio today to meet with the men & women of law enforcement.\\n\\nIn Texas, we ALWAYS back the blue.\\n\\nThat is why I signed laws that defund cities that defund police & made attacks on law enforcement officers a hate crime.\\n\\nThank you for keeping us safe.pic.twitter.com/fPs7lR8FzC\n Greg Abbott (@Greg Abbott) 1650578380\nNOW WATCH: Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene\nStories Chosen For You",
    "And it illustrates how nonprofit organizations technically barred from participating in political campaigns can nonetheless exert outsize influence, especially when they wade into a potent issue like violent crime,\" the newspaper reported.",
    "On television, Twitter and videos, the traditionally nonpartisan nonprofit organization has been condemning more than a dozen elected judges  all Democrats, four of whom lost primaries last month  while praising the crime policies of Gov.",
    "According to a New York Times report, \"Crime Stoppers of Houston has been blasting out a different, more political message: Activist judges are letting 'dangerous criminals' out of jail to threaten the safety of law-abiding residents.",
    "#standingforpublicsafetyhttps://twitter.com/tomsramsey2/status/1517218772456726530\\u00a0\\u2026\n Rania Mankarious (@Rania Mankarious) 1650577858\nThe reports came as Abbott was in San Antonio campaigning on his tough-on-crime platform.",
    "\"Financial documents and government records, along with dozens of interviews, show that the organization, with an annual budget of about $2.4 million, has in recent years become reliant on state grants backed by Mr. Abbott.",
    "\"Many of the Democratic judges Crime Stoppers is slamming have cut into the organizations revenue by curbing a common practice requiring many people sentenced to probation to pay a $50 fee that goes to Crime Stoppers.",
    "And as homicides have risen across the city, judges and criminal justice reform advocates say Crime Stoppers has taken a partisan turn and is engaging in misleading conversations about crime across the city.\"",
    "Those grants included $4 million in 2017 that was never publicized by Mr. Abbott or Crime Stoppers, which had previously trumpeted smaller donations from other government entities.",
    "\"The evolution of Crime Stoppers of Houston underscores the potential conflicts of interest that can arise when charities become dependent on financial support from politicians.",
    "On Twitter, Mankarious described the reporting of the group's partisanship and conflicts of interest as a \"coordinate attack\" while retweeting local Republican Tom Ramsey.",
    "\"Detractors argue the organization has strayed from its core mission and criticize CEO Rania Mankarious for using the nonprofit as a personal launchpad.",
    "In the past five years, the Texas government under Mr. Abbott has given the group more than $6 million, state records show,\" the newspaper reported.",
    "The nonprofits revenue from those fees has fallen by half since Democrats swept the countys judicial races in 2018,\" the newspaper reported.",
    "Greg Abbott is facing another potential scandal after only days after his border stunt caused massive disruption of the Texas economy.",
    "The newspaper conducted an investigation of the organization's financial interests in conjunction with The Marshall Project.",
    "\"In recent weeks its CEO warned Houstonians at a local Republicans lunch club about out-of-control crime.",
    "And there appears to be a direct conflict of interest with judges the organization is attacking.",
    "When you\\u2019re committed to public safety, you\\u2019re sure to infuriate those who are not.",
    "Thanks Commissioner @TomSRamsey2 We knew a coordinate attack has been in the works.",
    "Its victims assistance director blasted a local judge on television.",
    "Its staff trained METRO police officers,\" the newspaper reported.",
    "The organization was also investigated by the Houston Chronicle.",
    "The newspaper noted two big takeaways from the investigation.",
    "She vowed nothing will change at Houston Crime Stoppers.",
    "Greg Abbott of Texas, a Republican.\"",
    "We will only keep going,\" she said.",
    "We will only keep going.",
    "\"As for us?",
    "As for us?",
    "Texas Gov."
  ]
}