{
  "id": 5047,
  "mediaId": 157,
  "date": "d2022-04-21T00:00",
  "headline": "Capitol rioter gets smacked down by judge after claiming he was not 'part of that mob'",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29710205&width=1200&coordinates=0%2C21%2C0%2C29&height=600",
  "link": "https://www.rawstory.com/maga-rioter-richard-watrous/",
  "sentiment": "-0.796",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ray Hartmann",
  "authorUrl": "https://www.rawstory.com/u/ray_hartmann",
  "termIds": [
    883,
    1335,
    2095,
    3976,
    4884,
    84,
    182
  ],
  "sentences": [
    "Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene\nWatrous said that after sitting on the steps for approximately 15 minutes, he walked away and met a woman who had a YouTube channel whom he told he had gone inside and there wasnt much to see.? The woman wanted to go inside the Capitol and Watrous stated he reentered the Capitol with her.?\nPerhaps sealing Watrous fate was this interchange with the judge, as reported by Syracuse.com:\nWatrous, who was seeking probation rather than jail, told Howell that he was 100% on the side of Capitol Police,? according to MacFarlane.",
    "It cited a Tweet from BuzzFeed News reporter Zoe Tillman who noted that the sentence was more than DOJ had requested.?\nHowell said that the fact that Watrous entered the Capitol twice during the riots is a very serious aggravating factor? for his sentencing, Syracuse.com reported.",
    "A New York man who entered the U.S. Capitol twice during the January 6 but tried to convince a judge that he was 100 percent on the side of the Capitol police? was sentenced today to 14 days of jail time and three years of probation.",
    "Some other Capitol riot defendants have received probation only for entering the same guilty plea, Watrous received a stiffer sentence from U.S. District Court Judge Beryl A. Howell, according to a report at Syracuse.com.",
    "Heres how the FBI described how Watrous managed to enter twice into the same riot:\nWatrous estimated he was inside the Capitol for approximately five minutes and then left out the same door he had entered.",
    "Watrous said the man entered the Capitol and then came back out crying because he had clearly been pepper-sprayed but was now holding a bottle of wine that said Democratic Convention.",
    "Watrous will serve the intermittent confinement in two 7-day periods, along with 60 days of home detention, a $2,500 fine and $500 restitution per a plea deal, the report said.",
    "Watrous stated that outside, he sat on the Capitol steps and observed an unknown male who said he was going to Nancy Pelosis office.",
    "Richard Watrous, 59, of Homer, N.Y., had plead guilty to a misdemeanor count of parading in the Capitol.",
    "You understand,? Howell replied, you were a part of that mob.?\nYou read the FBI criminal complaint here.",
    "NOW WATCH: Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene",
    "Watrous stated the man said, I got Nancy Pelosis wine!?\nIN OTHER NEWS: 'She is going through hell!'",
    "I would never be a part of that mob,? Watrous said."
  ]
}