{
  "id": 5048,
  "mediaId": 157,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Gableman deleting records as he conducts partisan 2020 election review in Wisconsin",
  "image": "https://www.rawstory.com/media-library/special-counsel-michael-gableman.jpg?id=29452062&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/2657193699/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    780,
    1596,
    1608,
    2095,
    4200,
    4522,
    624,
    3595,
    3622,
    2972
  ],
  "sentences": [
    "An irrelevant or useless document includes documents that the OSC is not intending to further investigate, and is not intending to rely upon for its recommendations or reports.?\nFor months, American Oversight has been pursuing lawsuits against Gableman and Assembly Speaker Robin Vos (R-Burlington) seeking access to records relating to the investigation.",
    "[American Oversight] faces irreparable harms stemming from [Gablemans] practice of routinely destroying records, whether they be responsive to petitioners prior requests, current requests, or even requests made by other individuals that would inform petitioner and the public about the investigation,? the American Oversight motion states.",
    "Dane County Circuit Court Judge Frank Remington ordered the former Wisconsin Supreme Court Justice conducting a partisan review of the 2020 presidential election to stop deleting emails, text messages and documents produced during the investigation that he finds irrelevant, court documents show.",
    "The loss of records is not compensable to damages: it is a harm to democracy and the publics right to know, and it needs to stop now.?\nThose records revealed that Gableman was doing little actual investigating and his staff was still buying furniture months after the review was started.",
    "James Bopp, an attorney representing Michael Gableman in an open records lawsuit against Gablemans investigation, told attorneys in an April 8 letter that the Office of Special Counsel regularly deletes records it finds irrelevant or useless? to the review.",
    "This inquiry is nothing more than an attempt to prop up conspiracy theories and undermine free and fair elections.?\nThe Legislatures own attorneys have said Gableman is required to retain records created during his review.",
    "If this investigation was above board, the Office of Special Counsel would have maintained and released records of its work required by law,? American Oversight Senior Advisor Melanie Sloan said in a statement.",
    "In October 2021, the deputy director of the nonpartisan Legislative Council said in a letter to then-Assembly Minority Leader Gordon Hintz (D-Oshkosh) that the legislative exemptions did not apply to Gableman.",
    "In the April 8 letter, Bopp said that all the responsive records were printed and turned over while the digital copies were deleted, which resulted in the deletion of related attachments.",
    "Attorneys for American Oversight, the government watchdog group that brought the lawsuit, filed a motion on Wednesday against Gableman asking Remington to put an end to the practice.",
    "Most state agencies must retain records for a certain amount of time, but legislators can delete documents such as emails as long as theres not a currently pending request for them.",
    "In March, Remington ordered Gableman to turn over all relevant records to American Oversights requests, resulting in more than 700 pages of documents being handed over.",
    "Therefore, the Special Counsel and his or her office are generally subject to the Public Records Retention Law requirements,? Dan Schmidt, the deputy director, wrote.",
    "Numerous reviews, audits, lawsuits and recounts have affirmed that Joe Biden won Wisconsins election in 2020 and proven allegations of fraud to be false.",
    "The Assembly Special Counsel is an officer appointed by the Committee on Assembly Organization to oversee the AOSC and not a member of the Legislature.",
    "Despite denying the requests, these responsive documents were printed and saved in accordance with (state law), in case production was later ordered.",
    "In light of this standard procedure, the OSC routinely deletes documents and text messages that are not of use to the investigation,? he continues.",
    "Wisconsin Examiner is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "So far, the review has only resulted in rehashed conspiracy theories and innuendo about the alleged wrongdoing by election officials.",
    "American Oversight is now alleging that Gablemans office did not turn over all the relevant records, in violation of the March order.",
    "In court, Bopp has said the states open records laws do not apply to Gableman because hes conducting an active investigation.",
    "If it is, that document is downloaded and kept for further investigation, or for use in the OSCs reports and recommendations.",
    "Remington has set a scheduling conference in the American Oversight lawsuit, which had been closed, for April 26.",
    "If the document is irrelevant or useless to the investigation, the OSC deletes that document,? Bopp wrote.",
    "When a document comes to the OSC, the OSC evaluates whether the document is of use to the investigation.",
    "NOW WATCH: Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene",
    "The digital copies of the documents were then deleted as a matter of routine procedure,? he wrote.",
    "Gableman has frequently been slow to respond or ignored the requests altogether.",
    "Wisconsin legislators are exempt from some portions of the state records law.",
    "Instead, it is fighting tooth and nail to hide its work from the public.",
    "Last year, Vos gave Gableman a $676,000 budget to review the election.",
    "Contact Editor Ruth Conniff for questions: info@wisconsinexaminer.com.",
    "Wisconsin Examiner maintains editorial independence.",
    "Follow Wisconsin Examiner on Facebook and Twitter."
  ]
}