{
  "id": 5050,
  "mediaId": 157,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "'She is going through hell!' Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene",
  "image": "https://www.rawstory.com/media-library/trump-advisers-have-been-avoiding-him-because-they-fear-he-ll-ask-them-to-do-something-crazy-report.jpg?id=24836035&width=1200&coordinates=0%2C42%2C0%2C43&height=600",
  "link": "https://www.rawstory.com/trump-marjorie-taylor-greene-2657193233/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    2095
  ],
  "sentences": [
    "NEW!\\n\\nPresident Donald J. Trump:\\n\\n\\u201cThe Governor of Georgia, Brian Kemp, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene...pic.twitter.com/IJsGPSoIPK\n Liz Harrington (@Liz Harrington) 1650564245\nWatch below:",
    "\"The Governor of Georgia, Brian Kemp, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene,\" Trump wrote.",
    "Trump then went through his usual litany of false claims about supposed voter fraud costing him Georgia in the 2020 election, and he finished off by subtly threatening to sabotage Kemp's reelection chances.",
    "Greene is currently facing a legal challenge to her eligibility to serve in Congress on the grounds that she supported the January 6th insurrection at the United States Capitol building.",
    "\"REMEMBER, Brian Kemp will never be able to win the General Election against Stacey 'The Hoax' Abrams because a large number of Republicans just will not vote for him,\" Trump wrote.",
    "Former President Donald Trump on Thursday lashed at Georgia Republicans over the purported plight of Rep. Marjorie Taylor Greene (R-GA).",
    "\"She is going through hell in their attempt to unseat her, just more of an election mess in Georgia.\"",
    "Due to this, she is scheduled to testify under oath on Friday -- and is loudly complaining about it.",
    "Trump released a statement Thursday coming to her aid.",
    "Read the full statement below."
  ]
}