{
  "id": 5066,
  "mediaId": 19,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "26 Governors Mobilize Against Migration Chaos at Border",
  "image": "https://media.breitbart.com/media/2022/03/20220310_110537-640x480.jpg",
  "link": "https://www.breitbart.com/border/2022/04/20/26-governors-mobilize-against-migration-chaos-at-border/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Price",
  "authorUrl": "https://www.breitbart.com/author/bob-price/",
  "termIds": [
    661,
    2095
  ],
  "sentences": [
    "The pact is signed by the following governors:\nGovernors Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), Brian Kemp (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "DHSs own numbers say there will be 18,000 people a day additional streaming over the border.?\nThe pact signed by the 26 governors says the Border Strike Force will coordinate efforts between the states to:\nPartner at the state fusion center level to disrupt and dismantle cartels:\nShare criminal justice information to improve investigations in the border region and nationwide, especially\nin communities adjacent to or crossing state boundaries.",
    "Border security has always been a federal government responsibility  until the Biden administration.?\nGovernor Abbott called the action by the 26 governors an indictment on the Biden administration and its failure to do its fundamental job of national security in securing our border.?\nGovernor Ducey said the majority of American governors are stepping up to do what the Biden administration refuses to do.",
    "Due to President Bidens disastrous border policies, dangerous transnational criminal organizations continue flooding our communities with drugs while reaping billions of dollars from human smuggling and causing a record-breaking number of apprehensions at the Southern Border,? the 26 Republicans wrote in a pact creating the American Governors Border Strike Force.",
    "The governors, led by Texas Governor Greg Abbott and Arizona Governor Doug Ducey join together to disrupt and dismantle transnational criminal organizations in order to stop the flow of dangerous drugs and combat human smuggling.",
    "Together, governors will improve public safety, protect victims from horrific crimes, reduce the amount of drugs in our communities, and alleviate the humanitarian crisis at the Southern Border,? they added.",
    "Focus state law enforcement efforts to disrupt and dismantle cartels:\nTarget cartel finances that fund criminal activity in the border regions to seize the tools used to assist the\ncartels.",
    "Review state criminal statutes regarding human trafficking, drug trafficking, and transnational criminal\norganizations to ensure the laws deter, disrupt, and dismantle criminal activity.",
    "A group of 26 Republican governors joined forces to address the chaotic border policies of the Biden administration that led to an unprecedented crisis along the U.S. border with Mexico.",
    "Assist border states with supplemental staff and resources at state fusion centers, such as on rotation\nassignments, to share information obtained both on the border and in other states.",
    "Monitor cybersecurity issues that may increase vulnerability along the Southern Border, such as criminal\nnetworks that operate on social media to recruit traffickers.",
    "Co-locate intelligence analysts in border states to improve collaboration, real time response, intelligence\nsharing, and analysis connected to border security.",
    "Its not supporting the men and women of law enforcement at the city level, the state level, or the county level.?\nLifting Title 42 is a mistake,? Ducey stated.",
    "The Memorandum of Understanding (attached below) lays out additional coordination efforts and action items for the states response to the Biden border crisis.",
    "By partnering across state lines, governors can serve as a force multiplier to target cartels and criminal networks financially and operationally.",
    "Develop interstate procedures to fill any identified gaps or identified inconsistencies in existing plans to\naddress border crime.",
    "Review state criminal justice statistics and information to determine crimes that can be traced to the\nSouthern Border.",
    "If Biden will not come to the border, were sending the border to Biden,? Governor Abbott told Fox News on Tuesday.",
    "Bob Price serves as associate editor and senior news contributor for the Breitbart Texas-Border team.",
    "Coordinate and improve interdiction on interstates to combat drug trafficking and human smuggling.",
    "Send law enforcement to train in border states to detect, track, and curb border-related crime.",
    "The federal government is derelict in its duty,? the Arizona governor added.",
    "Price is a regular panelist on Fox 26 Houstons Whats Your Point?",
    "He is an original member of the Breitbart Texas team.",
    "Follow him on Twitter @BobPriceBBTX and Facebook.",
    "Sunday-morning talk show."
  ]
}