{
  "id": 5078,
  "mediaId": 151,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Florida's redistricting session: Quick, partisan, and bitter",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/04/19/floridas-redistricting-session-quick-partisan-and-bitter-00026162",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1572,
    1587,
    2095,
    3889,
    4496,
    4577,
    428,
    2661,
    2926
  ],
  "sentences": [
    "Among the group  Rep. Val Demings of Florida, who is challenging Sen. Marco Rubio (R-Fla.), seemed to defend the Biden administrations move earlier this month, but her campaign said on Monday that until there is a plan to put more boots on the ground and support our law enforcement officers at the border, Chief Demings does not support lifting Title 42.?\nBidenology\nSCHOOL DAZE  GOP governors demand changes to Biden administration charter school plan,? by POLITICOs Juan Perez Jr.: Conservative state governors on Monday opened a new line of attack against an Education Department proposal to further regulate how charter schools apply for and spend hundreds of millions of dollars in federal grants.",
    "Liftoff from Kennedy Space Centers Launch Pad 39-A is set for Saturday at 5:26 a.m.?\n Sensors were adjusted on ride where teen fell to death,? by Associated Press Mike Schneider\n Start of Parkland killers penalty phase trial moved to June, judge rules,? by Sun Sentinels Angie DiMichele and Rafael Olmeda\nODDS, ENDS AND FLORIDA MEN\n Florida man skipped bathroom breaks to achieve Spider-Man: No Way Home viewing record,? by NBC News Kalhan Rosenblatt: A Florida man set a Guinness World Record for most cinema productions attended of the same film after seeing the latest 'Spider-Man' installment in theaters a whopping 292 times  sans bathroom breaks.",
    "Lawmakers failed to come up with a legislative solution during the regular session because Republicans were at odds over what steps to take  and whether to require consumers to bear more costs as part of the solution.?\nCORONAVIRUS UPDATES\nSUSPENDED  TSA wont enforce mask mandate for travel, following Florida ruling,? by POLITICOs Alex Daugherty and Erin Banco: The administration said Monday evening that it will stop enforcing the federal mask mandate for travel  for now  after a federal judge in Florida earlier in the day struck down the CDCs mask requirement for planes and trains, ruling that the agency overstepped its statutory authority.",
    " Bank records shed light on dark-money group in ghost candidate scandal,? by Orlando Sentinels Jeff Weiner and Annie Martin\n Republican Shawn Harrison files to run against incumbent Janet Cruz for SD 14,? by Florida Politics Kelly Hayes\nDATELINE D.C.\nSOCIAL DISTANCE  More Dem Senate hopefuls split with Biden on border,? by POLITICOs Burgess Everett and Holly Otterbein: Five more Democratic Senate candidates told POLITICO they disagree with the way the Biden administration is phasing out Title 42, the latest sign that Bidens policy position is a big loser among purple-state Democrats facing tough elections.",
    "The new charges accompany previous allegations that Brown illegally possessed two guns and a set of hand grenades, which federal agents found when they executed a search warrant last year at his Tampa home.?\nPENINSULA AND BEYOND\nUP, UP AND AWAY  Astronaut slated to become first Black woman to stay long-term on space station,? by Orlando Sentinels Richard Tribou: A couple of space rookies are joining a couple of veterans on a trip to the International Space Station this week, but one of them will open a new door of diversity as the first Black woman assigned for long-term duty on board.",
    "The announcement from the Florida Department of Education surprised educators who selected textbooks from a state list and worked for months to review the various publishers offerings to pick ones they thought best met Floridas new math standards.?\n South Florida schools face chaos as state bans math books with prohibited topics,? by Sun Sentinels Scott Travis, Brooke Baitinger and Leslie Postal\nREAP THE WILD WIND  DeSantis calls for May property insurance special session,? by POLITICOs Gary Fineout: Florida Gov.",
    "Sharp criticism  Black Democrats on Monday decried the proposed map  which completely dismantles the seat held by Rep. Al Lawson, a Black Democrat, and changes the demographic makeup of the one now held by Rep. Val Demings  with state Sen. Shevrin Jones calling it a racist tactic.? Protesters are scheduled to hold a rally on the Capitol steps this morning where they will blast the governor, who contends that recent court decisions justify his proposal to draw up what he calls race neutral? boundaries.",
    "BIRTHDAYS: State Rep. Colleen Burton  state Rep. Cord Byrd  Towson Fraser of Fraser Solutions\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "MEANWHILE  School districts taken aback over states banning of math books,? by Orlando Sentinels Leslie Postal: Every Central Florida school district recently selected new elementary school math textbooks, then learned Friday their choices had been rejected by the state, which accused publishers of trying to indoctrinate? students by mixing critical race theory? and other objectionable content into math lessons.",
    "In order to achieve the record, Alanis watched the film without interruptions  meaning while the movie was playing, he couldnt do things like use his phone, take a nap or use the restroom.?\n Police: Man cuts arm, uses own blood to deface Holocaust memorial,? by WPLGs Rosh Lowe and Michelle Solomon: It is a place where people come to pay their respects to the six million Jews who were murdered in the Holocaust.",
    "The state of Florida has sued the federal government over various Covid-related restrictions throughout the pandemic, but Mondays ruling was based on a lawsuit by the Health Freedom Defense Fund, a nonprofit that has brought legal challenges to Covid restrictions across the country, and two women in Florida who said the mask mandate led to anxiety and medical issues.",
    "TRUMPLANDIA AND THE SWAMP\nNEW CHARGES  Feds say Jan. 6 defendant held old secret military documents,? by Tampa Bay Times Dan Sullivan: A retired U.S. Army Special Forces soldier who is among those accused in the Jan. 6, 2021, riots at the U.S. Capitol faces new charges that he held onto secret national defense documents from his time in the service.",
    "Lets be clear and call it what it is: Its racist. In an email response, DeSantis spokesperson Christina Pushaw wrote that they wont be responding to unsubstantiated allegations from partisan critics.?\n Two alternative maps for Florida congressional districts submitted to federal court,? by Florida Politics Jacob Ogles\n... DATELINE TALLAHASSEE ...",
    "CAMPAIGN ROUNDUP  Maxwell Alejandro Frost, a Democratic candidate for Floridas 10th Congressional District, has picked up multiple endorsements for his campaign including from California Rep. Ro Khanna, State Sen. Victor Torres, the Black Lives Matter PAC, Florida Young Dems, Orange County Young Dems and the Florida Immigration Coalition.",
    "SCREEN TIME  Brave New Films is partnering with several voting groups, including Equal Ground, Florida Rising, All Voting is Local, the League of Women Voters of Florida, For Our Future FL, Hispanic Federation, Black Voters Matter and Poder Latinx to screen a new documentary called Suppressed and Sabotaged 2022? on Wednesday night.",
    "Get in touch: gfineout@politico.com\nMAPMAKER, MAPMAKER\nWE WILL SEE HIM  Black lawmakers call DeSantis for racist actions in redrawn congressional map,? by Miami Heralds C. Isaiah Smalls II: State Sen. Shevrin Jones said that the framing of Floridas last legislative session as culture wars? masked what was really happening.",
    "Sure, there may be a moment of discomfort or two for Republicans over the next two days as they try to explain how this latest map is suddenly legal when a few weeks ago it was a novel legal theory.? Republicans will probably also just shrug as Democrats call them sheep? or that they have abdicated all power to DeSantis.",
    "Both airline employees and passengers deserve to have this misery end.?\nCAMPAIGN MODE\nMAKING THE GRADE  Much is riding on the 2022 midterm elections: the fate of President Joe Bidens agenda, leadership in state capitals across the country and a potential 2024 comeback by former President Donald Trump.",
    "POLITICOs Caitlin Oprysko reports that Florida Rep. Vern Buchanan, who has seniority over the Smiths on the panel and is seen as the frontrunner, pulled in $1.1 million in the first three months of the year, filings show, compared to $439,000 during the same period in 2020.",
    "Ron DeSantis on Monday defended the states decision to disqualify dozens of proposed math textbooks for broaching critical race theory and other impermissible? topics while fending off demands from Democrats to release examples of allegedly indoctrinating? information.",
    "Brian Kemp  demanded that Education Secretary Miguel Cardonas administration scrap planned requirements for the federal Charter School Programs that have whipped up fury from an array of charter supporters, and delay any proposed changes until the next fiscal year.",
    "Instead it will be a drive-by moment of legislating where the Senate will be ready to take up DeSantis map by late afternoon and then place it in a posture to have both chambers pass it sometime on Wednesday and legislators will then head to the exits.",
    "An administration official said the federal government is still determining how it will respond to the ruling, but that the CDC masking order, which is enforced by the TSA, is not in effect at this time.?\nReaction  Florida Gov.",
    "DeSantis said he would be open to the state making public examples of the textbooks, but maintained that the content is considered proprietary information? as publishers weigh possible appeals to the rejections.",
    "DeSantis move comes as homeowners' insurance rates are spiking in the state as some providers are teetering amid multiple problems, including ongoing lawsuits and troubles obtaining affordable backup insurance.",
    "A federal grand jury in Tampa last week returned an indictment alleging that Jeremy Brown had unauthorized possession of the documents, which relate to military activities that occurred in 2004 and 2005.",
    " POLITICO Influence delved into what lobbyists are giving money to Republicans in the running for the highly coveted spot as Ways and Mean chair, should the GOP regain control of the House.",
    "And it probably means that the governors staff wont have to spend too much time explaining unanswered questions about who helped them draw it up and whether it was done for partisan gain.",
    "Ron DeSantis abruptly announced on Monday that he will call state legislators back to Tallahassee in May for a special session to deal with the states ongoing property insurance crisis.",
    "For Florida, the forecast has both the governors race and Senate race as likely Republican.? There are no forecasts for House races because there is still not a final congressional map.",
    "Supposedly, legislative leaders wanted to avoid the knockdown legal battles of the last decade that resulted in previous GOP legislators acknowledging they violated the constitution.",
    "The state has an obligation to ensure that every child is getting the math instruction they need with the highest quality materials,? FEA president Andrew Spar said in a statement.",
    "Floridas constitution says legislators cant draw maps designed to favor one party, yet the DeSantis map would create a scenario where Republicans pick up four seats this fall.",
    " Americans for Prosperity Action Florida announced it was endorsing a list of 13 Republican legislative candidates including Rep. Paul Renner, the next House speaker.",
    "DeSantis will hold a press conference in The Villages with Education Commissioner Richard Corcoran, Senate President Wilton Simpson and House Speaker Chris Sprowls.",
    "So this time around GOP leaders such as House Speaker Chris Sprowls and Senate President Wilton Simpson threw in the towel and decided to defer to the governor.",
    "Tick, tick, boom  In the next 48 hours, Floridas Republican-controlled Legislature will likely take up a new congressional map for the state proposed by Gov.",
    "Jessica Watkins, 33, is heading the ISS for her first trip to space as part of the Crew-4 mission set to launch on a new SpaceX Crew Dragon named Freedom.",
    "Several lobbyists contributed the maximum amount of $2,900 but Buchanan also received cash from the U.S. Chamber of Commerces political action committee.",
    "Flashback  Just remember this January quote from a current Republican legislator who was granted anonymity: They are not going to embarrass Ron DeSantis.",
    "THE NEW MATH  DeSantis defends math textbook rejection as Dems seek proof of critical race theory lessonss,? by POLITICOs Andrew Atterbury: Florida Gov.",
    "But looming deadlines for this years election means that the map passed in the next two days will probably be the one that is locked in place for 2022.",
    "Ron DeSantis is essentially the speaker of the House, the president of the Senate and the chief justice of the Supreme Court right now.?\n WHERE'S RON?",
    " The Florida Education Association, the states largest teachers union, joined Democrats in calling for more transparency over the textbook decisions.",
    "You have one minute to comment  The timeline laid out means that there will be limited time for the public to weigh in on the maps.",
    "According to police, several people witnessed Green at the memorial as he began to dig into his left forearm to make his arm bleed.",
    "Ramiro Alanis sat through 'Spider-Man: No Way Home' roughly five times per day between the film's release in December until March.",
    "The haul included contributions from more than three dozen registered lobbyists looking to get  or stay  in Buchanans good graces.",
    "Florida's redistricting session: Quick, partisan, and bitter\nBy GARY FINEOUT\n04/19/2022 07:00 AM EDT\nHello and welcome to Tuesday.",
    "How we got here  The reason Florida legislators are at this moment is because DeSantis vetoed the last map that was sent to him.",
    "After the film there will be a panel discussion featuring those who sued to challenge Floridas election last passed last year.",
    "Great to see a federal judge in Florida follow the law and reject the Biden transportation mask mandate,? DeSantis tweeted.",
    "We want kids to learn to think so they get the right answer,? DeSantis told reporters Monday at an event in Jacksonville.",
    "(Worth noting: Legislators running in nonfederal races cant accept campaign donations as long as they are in session.)",
    "Lawyer up  Once all of the finger-pointing and arguing is over there will likely be a race to the courthouse door.",
    "In the Senate, Democratic control of the 50-50 chamber hinges on Vice President Kamala Harris tie-breaking vote.",
    "But, according to an arrest report, 44-year-old Christopher Green, defaced a Holocaust memorial in Miami Beach.",
    "Use our Election Forecast to see which races you need to watch this year  and who we think will win each one.",
    "It's centered on what the filmmaker calls voter suppression? efforts in Florida and other states.",
    " The session schedule has lawmakers coming in at noon today and potentially working until Friday.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "I would like it to be released, but I also respect the process,? DeSantis told reporters Monday.",
    "Ron DeSantis, muscle it through over the loud opposition of Democrats, and go back home.",
    "Were using culture wars as a nice way to call out whats actually happening, Jones said.",
    "The letters he wrote did not spell anything readable,' according to an arrest form.\"",
    "'The defendant then used his blood to smear it against the Holocaust museum wall.",
    "And an increasing number of Democrats say the whole thing needs to be paused.",
    "The defendant wrote numerous letters of the alphabet in his blood.",
    "In the House, Democrats five-seat majority is highly endangered.",
    "Ron DeSantis praised the ruling minutes after it was announced.",
    "Ron DeSantis and Sen. Marco Rubio will win this fall.",
    "Those interested in the screening can register here.",
    "POLITICOs Steve Shepard lays out why he thinks Gov.",
    "The film will be released to the public in June.",
    "But don't expect them to hang around that long.",
    "Eighteen Republicans  including Florida Gov.",
    "Heres a clip from the film about Florida.",
    "Heres your hat, whats your hurry?",
    "Greg Abbott and Georgia Gov.",
    "Ron DeSantis, Texas Gov.",
    "But thats all gone now.",
    "WHATS IN YOUR WALLET?",
    "X+Y = ?",
    " Gov."
  ]
}