{
  "id": 5081,
  "mediaId": 157,
  "date": "d2022-04-19T00:00",
  "headline": "30 people called to testify in Georgia's Trump investigation have refused",
  "image": "https://www.rawstory.com/media-library/trump-bashed-gop-s-brian-kemp-at-lie-filled-rally-hours-after-governor-refused-to-overturn-georgia-s-election-results.jpg?id=24814905&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-georgia-fraud-case-witnesses/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    1147,
    1223,
    2095,
    2203,
    428,
    501,
    2670,
    2672
  ],
  "sentences": [
    "Willis said witnesses should ideally begin appearing before the grand jury by June 1.\nI dont want anyone to say oh, shes doing this because she wants to influence the outcome of this upcoming election,? Willis told reporters.. The people will decide the outcome of this upcoming election.",
    "Fulton County District Attorney Fani Willis revealed to the Atlanta Journal-Constitution on Tuesday that 50 people have voluntarily testified to investigators, while she is seeking subpoenas for at least 30 others who have refused.",
    "Willis hasn't publicly named the lead prosecutor on the case for security reasons, but the office would continue to move forward with about 60 additional people she wants to speak to about the Georgia election interference case.",
    "The selection of the special grand jury will begin on May 2 and over the course of four weeks, the jury can review the evidence gathered and approve the subpoenas for those refusing to cooperate.",
    "It will have nothing to do with this district attorneys office.?\n(Correction: A previous version of this story incorrectly stated that more than half of those called to testify had refused.)",
    "NOW WATCH: White House reporters laugh at Peter Doocy after Jen Psaki reminds him he's not a doctor\nWhite House reporters laugh at Peter Doocy after Jen Psaki reminds him he's not a doctor",
    "For the first time in 14 months, Willis walked through the degree to which her team has progressed the probe into former President Donald Trump's actions.",
    "After losing the 2020 election, Trump put pressure on Republican leaders in many states to change the result of the election to hand him the win.",
    "Fulton County took over the investigation because so many state officials were part of the investigation.",
    "The calls where Trump demanded votes be \"found\" were recorded and given to media outlets.",
    "Such was the case in Georgia, where Trump pressured both Gov.",
    "Brian Kemp (R-GA) and Secretary of State Brad Raffensperger."
  ]
}