{
  "id": 5086,
  "mediaId": 12,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Rivian CEO reportedly warns about supply chain issues",
  "image": "https://www.ajc.com/resizer/Z6xkCsTx_Br5Ay2wrNOViwfmDdg=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/5QOPAFB3K5DO3XJ6VOCRDRINPY.jpg",
  "link": "https://www.ajc.com/news/rivian-ceo-reportedly-warns-about-supply-chain-issues/JZOYBLRTVBDZFCBHQVKXQRVZA4/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J. Scott Trubey",
  "authorUrl": "https://www.ajc.com/staff/j-scott-trubey/",
  "termIds": [
    2095,
    3909,
    436,
    493,
    2590,
    2672,
    2707,
    2945
  ],
  "sentences": [
    "The CEO of electric vehicle maker Rivian, which plans a sprawling factory an hour east of Atlanta, said in media interviews published Monday that computer chip shortages hampering his company and the auto industry could pale compared to looming challenges in sourcing components for EV batteries.",
    "But its a self-fulfilling prophecy, because if Intel believes were not going to produce more than the next number, then thats the number were going to produce.?\nScaringe told reporters he regularly calls chip companies to help assure them his factory is running, the Bloomberg article said.",
    "Battery squeeze\nChina is a major player in sourcing of rare earth metals needed in battery production, and the U.S. is having to play catchup, Brett Smith, director of technology at the Center for Automotive Research told The Atlanta Journal-Constitution late last year.",
    "Rivian Chief Executive R.J. Scaringe told the Wall Street Journal and Bloomberg that Rivians manufacturing plant in Illinois is operating well-below peak capacity because of global parts shortages, including computer chips, which have affected scores of companies.",
    "Automotive experts have warned that Rivian faces a high hurdle in perfecting mass production while also contending with supply chain challenges and battling rivals such as Tesla and the EV expansion plans of traditional automakers.",
    "Put very simply, all the worlds cell production combined represents well under 10% of what we will need in 10 years,? the Journal reported Scaringe as saying during a media tour of the companys plant in Normal, Illinois.",
    "Meaning, 90% to 95% of the supply chain does not exist.?\nThe problem exists across the entire supply chain, from mining to refining raw materials to assembly of battery packs, Scaringe told the Journal.",
    "But a longer-term headwind for the auto industry is the intense global battle to source the raw materials such as cobalt and lithium to make the batteries that power plug-in vehicles.",
    "In December, the state of Georgia and Rivian announced plans for a sprawling factory and battery plant on about 2,000 acres along I-20 in southern Walton and Morgan counties.",
    "Production delays and other challenges have hurt Rivians stock price  shares were valued at about $39 in mid-day trading Monday  down from $78 a share at its IPO.",
    "The company had one of the biggest initial public offerings in U.S. history last year, and Rivian shares were briefly valued higher than Ford and General Motors.",
    "But Bloomberg reported that Rivian is at a disadvantage as a newcomer compared to rivals, because chipmakers allocate limited supplies based on past production.",
    "The plan includes initiatives to improve domestic sourcing of critical materials for making EV batteries and improvements to the supply chain.",
    "Semiconductors are a small appetizer to what we are about to feel on battery cells over the next two decades,? Scaringe told the Journal.",
    "It spent those years developing its flagship R1T pickup, which was just named MotorTrends Truck of the Year, along with the R1S SUV.",
    "China decided to go after electric vehicles not because they care about the environment but because we want to control the future.",
    "The allocation is being set based on whether they think were using the chips or not,? Scaringe said in the Bloomberg article.",
    "That figure has been expected to grow exponentially as fuel and emissions standards tighten and costs to build EVs drop.",
    "Sandy Schwartz, a Cox executive who oversees the AJC, is on Rivians board of directors and holds stock personally.",
    "Earlier this year, his administration announced a multi-billion-dollar plan to boost production of EVs.",
    "But Rivian this year cut its production forecast for its Illinois plant citing supply chain problems.",
    "Cox Enterprises, owner of the AJC, owns about a 4% stake in Rivian and supplies services to it.",
    "California-based Rivian makes the R1T truck and R1S SUV as well as delivery vans for Amazon.",
    "Sourcing computer chips hasnt been a problem for just Rivian, or even for automakers alone.",
    "Rivian has said it plans to make up to 400,000 vehicles a year at the future plant.",
    " Thats a huge challenge.?\nEVs are a major policy priority for President Joe Biden.",
    "Construction is expected to start this year, with the factory opening in 2024.",
    "Brian Kemp called it the biggest economic development deal in state history.",
    "But choke points in battery development could cool the red hot EV industry.",
    "At the end of last year, EVs made up about 2% of U.S. auto sales.",
    "Rivian has said it will hire 7,500 workers at the Georgia plant.",
    "Just about everything goes through China,? Smith said.",
    "He does not take part in the AJCs coverage of Rivian.",
    "Rivian was founded about a dozen years ago.",
    "Gov."
  ]
}