{
  "id": 5091,
  "mediaId": 169,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Does Trump still have the juice? His spotty endorsement record suggests decline",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/05/gettyimages-858366572.jpg",
  "link": "https://www.salon.com/2022/04/18/does-still-have-the-juice-his-spotty-endorsement-record-suggests-decline/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Digby Parton",
  "authorUrl": "https://www.salon.com/writer/heather_digby_parton",
  "termIds": [
    1133,
    1147,
    1349,
    1462,
    2095,
    3103,
    4162,
    296,
    571,
    2672
  ],
  "sentences": [
    "Many eyes are on Georgia as a microcosm of the \"Mar-a-Lago Machine\" in action, where Trump has waged a particularly ugly crusade against GOP Governor Brian Kemp and Secretary of State Brad Raffensberger, along with anyone associated with them, endorsing their challengers and insisting that all GOP candidates running for any office sign off on the Big Lie.",
    "A phalanx of Trump whisperers has emerged with candidates paying them in hopes of lining up meetings, ensuring that he sees damaging research on their rivals or strategically slipping him a survey showing a surge in the polls, even as Trump alumni warn that it is always buyer-beware in the Trump influence game.",
    "In his endorsement statement he said he chose Vance because he can \"win,\" noting: \"This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race  they've said great things about 'Trump'...\"\nThe \"Mar-a-lago Machine\" may just turn out to be a wrecking crew.",
    "Mostly, it seems to be based upon a mixture of his gut feeling, his desire to punish anyone who displeases him by supporting their opponents, rewarding those who most eagerly push The Big Lie and a desire to place sycophants and true believers in a position of power to influence the outcome of elections.",
    "Naturally, Trump is personally making money from it and he's not the only one:\nAn entire political economy now surrounds Mr. Trump, with Trump properties reaping huge fees: Federal candidates and committees alone have paid nearly $1.3 million to hold events at Mar-a-Lago, records show.",
    "Endorsements based upon Trump's own personal vendettas against RINO incumbents or his belief that celebrity of any kind is an automatic ticket to success in politics (because it worked for him) are causing Republicans grief in other states as well.",
    "His endorsement of Dr. Oz in Pennsylvania for the Senate seat being vacated by Republican Pat Toomey reportedly has the state in an uproar since they had what they considered to be a strong candidate who thought he had Trump's support.",
    "When you read about all the ring kissing and boot-licking that's going on at Trump's Mar-a-Lago resort these days, it is clear that Republicans of all stripes see him as president-in-exile, our once and future Dear Leader.",
    "The New York Times' Shane Goldmacher characterized Trump as a \"modern-day party boss\" and quotes insiders comparing his \"Mar-a-Lago Machine\" to the notorious Tammany Hall, which dominated New York politics for centuries.",
    "But Trump capriciously endorsed Oz, a clumsy political novice without any real ties to the state and who has a record of liberal commentary over the years that makes him anathema to the hardcore right in that state.",
    "What he did read were accounts of Vance's recent ostentatious Trump worshiping and decided to endorse him against the advice of just about everyone (except Don Jr and Sean Hannity who pushed him relentlessly).",
    "He is believed to be so powerful that his endorsement will make or break any candidate, from the loftiest seat of power in the U.S. Senate to a lowly election clerk in a small jurisdiction in Real America.",
    "But Oz is a celebrity, which impresses Trump, and he's one who did Trump a major solid back in 2016 when he had him on his show and validated his quack doctor's assessment that Trump was in good health.",
    "A couple of months ago, Salon's Igor Derysh reported that there were more than 80 pro-Trump 2020 election deniers running for election posts around the country and there are not doubt even more today.",
    "We'll soon find out that that is as valuable as people think it is, but in the meantime, there is apparently a long line of supplicants night after night seeking his favor, and he is reveling in it.",
    "Goldmacher writes:\nAs Tammany's corrupt Boss Tweed was portrayed saying, as he leaned on a ballot box in a famous 1870s cartoon: \"As long as I count the votes, what are you going to do about it?\"",
    "One of his spokesmen, Taylor Budowich, explained that the benefit of Trump's support lies not in money, but in the fact that voters value his endorsement and it generates a lot of \"free media.\"",
    "And yes, he immediately endorsed former Republican vice presidential candidate and reality star Sarah Palin, who is running for the seat opened up by the death of Alaska Congressman Don Young.",
    "It seems as if Republican voters care less and less about such things but in states where they need to attract non-Trumpers, the \"Mar-a-Lago Machine\" may just turn out to be a wrecking crew.",
    "Meanwhile, Trump's handpicked candidate to oppose Georgia's Democratic Sen. Rafael Warnock, 1980s NFL star Herschell Walker, is causing plenty of heartburn in the state as well.",
    "Or, as Mr. Trump told Breitbart News this month, \"There's an expression that the vote counters are more important than the candidate, and you could use that expression here.\"",
    "Goldmacher points out, however, that while Tammany Hall kept its grip on power by doling out patronage, Trump isn't spending much of his massive war chest at all.",
    "No less that Senate Majority Leader Mitch McConnell said last week:\nFrom an atmospheric point of view, it's a perfect storm of problems for the Democrats.",
    "In the Senate, if you look at where we have to compete in order to get into a majority, there are places that are competitive in the general election.",
    "It may be that these lower-level endorsements will end up being much more important than his support for servile candidates for the House and Senate.",
    "Walker is ducking debates, showing himself to be extremely weak on policy and dealing with many long-standing personal scandals.",
    "I think we all know how much he loves flattery and how he requires his supporters to love who he loves and hate who he hates.",
    "The question in all of this is if he still has the juice to get his candidates the nomination much less win in the fall.",
    "So far, however, it does not appear to be having much of an effect, with the incumbents still leading in the polls.",
    "Vance, the author of the book \"Hillbilly Elegy\" which I'm sure Trump has never heard of much less read.",
    "So you can't nominate somebody who's just sort of unacceptable to a broader group of people and win.",
    "Those are just a few of the celebrity gadflies, sycophants, grifters and weirdos he is backing.",
    "And new reports from around the country suggest that it may not be as clear-cut as many think.",
    "Of course, if they can install the right Trump-friendly \"vote-counters\" it may not matter.",
    "There are reportedly certain protocols for getting Trump's attention and impressing him.",
    "Will all this activity solidify his self-defined characterization as a kingmaker?",
    "There is no system by which Trump is making his endorsements for the midterms.",
    "There is no system by which Trump is making his endorsements for the midterms.",
    "So far, it does not appear to be a slam dunk, particularly in the primaries.",
    "The big question facing the GOP now is whether or not that's actually true.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "The electoral terrain for Republicans looks very good for the fall.",
    "We had that experience in 2010 and 2012\nIndeed they did.",
    "And we've had some experience with that in the past.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"He likes compelling visual material matters, too.",
    "But that's not enough, according to Goldmacher.",
    "He's mentioned it several times recently.",
    "How could you screw this up?",
    "But Republicans are nervous.",
    "Last week he endorsed J.D.",
    "With photos and graphics.",
    "It's actually possible.",
    "Big fonts are crucial.",
    "Of course, he did.",
    "In color.\"",
    "Maybe."
  ]
}