{
  "id": 5105,
  "mediaId": 209,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "Putting more guns on the street",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1650034862/iStock-185059996.jpg",
  "link": "https://theweek.com/us/1012590/putting-more-guns-on-the-street",
  "sentiment": "0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Week Staff",
  "authorUrl": "",
  "termIds": [
    2095,
    176,
    2537,
    2590,
    2672,
    2710,
    2799,
    2845,
    2945,
    2972
  ],
  "sentences": [
    "Greg Abbott stops secondary inspections at border\nBiden ends moratorium on federal drilling leases\nTwitter board turns to 'poison pill' to stop Elon Musk takeover\nZelensky: Repeating requests to leaders makes me feel like 'it's Groundhog Day'\nU.S. soldier 'so excited' to reunite with homeless dog he bonded with overseas\nU.S. grants temporary protection to Cameroonian immigrants",
    "To demonstrate their unwavering support for the Second Amendment to conservative voters, Republican candidates have sought to outdo one another in proposing free-carry laws, with many states legalizing weapons in schools, houses of worship, and public transportation.",
    "Now to walk into a bar, restaurant, store, or other place with a gun, \"you don't have to know how to turn on the safety, how to carry your weapon, or even which end of the gun goes 'bang,'\" said Gary Wolske, president of the state's largest police union.",
    "This week President Biden announced new rules, a year in the making, that hold gun kits to the same regulations as regular guns, requiring manufacturers to add serial numbers and commercial sellers to be licensed and run background checks on buyers.",
    "In New York City, one of many U.S. cities that's seen surging numbers of gun crimes over the past two years, that would bring a predictable result, said Iesha Sekou, an anti-violence activist in Harlem.",
    "Law enforcement agencies strongly oppose permitless carry, and a national Quinnipiac survey in 2019 found that 77 percent of Americans  including 68 percent of gun owners  back mandatory gun licensing.",
    "Until Texas did away with licensing last year, anyone who wanted to carry a concealed handgun in public had to undergo a background check, fingerprinting, training, a written exam, and a shooting test.",
    "The plaintiffs argue that the law violates their Second Amendment rights  and questioning during oral arguments last November gave strong indications that the court's six conservative justices agreed.",
    "It's based on a lawsuit brought by two men denied carry permits by New York state, which requires applicants to offer \"proper cause\" for why they need to carry a gun in public for self-defense.",
    "The National Rifle Association has lobbied to eliminate permits for years; when the Georgia law passed last month, NRA president Wayne LaPierre said it was \"the result of decades of hard work.\"",
    "If New York's law is struck down, the state will be required to dramatically expand the number of permits it grants, as would other restrictive states such as California and Massachusetts.",
    "In Missouri, gun homicides rose by 47 percent and gun suicides by 24 percent after the state repealed its licensing law, according to a study in the American Journal of Public Health.",
    "It's part of an aggressive effort to roll back state gun restrictions; at the same time, congressional Republicans have blocked all efforts to expand federal gun-safety laws.",
    "These are largely unregulated weapons built out of parts ordered online or made using 3D printers, and they lack serial numbers and can evade metal detectors.",
    "Advocates say regulations such as mandatory training unfairly infringe on the Second Amendment's guarantee that citizens can carry guns for self-protection.",
    "Meanwhile, gun-control advocates are watching with alarm a pending Supreme Court case that they fear will weaken state controls on firearms even further.",
    "But gun-control advocates say allowing unregulated carry of concealed weapons endangers police and the public, and there are statistics to back that up.",
    "The NRA's efforts were aided by a sharp anti-regulatory shift among Republicans, who increasingly oppose any gun restrictions as unconstitutional.",
    "Such laws, said Joshua Horwitz, executive director of the Coalition to Stop Gun Violence, are a way of saying, \"'I'm as far right as I can go.'\"",
    "Last year some 2,000 applicants were denied permits after background checks, he said; all of them are now free to carry concealed firearms.",
    "It's another product of the country's intensely polarized politics, which discourages common-sense compromise and rewards extremist views.",
    "In California over the past 18 months, police officials said, ghost guns accounted for 25 to 50 percent of firearms found at crime scenes.",
    "They allow any citizen over 18 or 21, depending on the state, to carry a concealed weapon with no requirements for licensing or training.",
    "Gun purchases hit a record 22.8 million sales in 2020  and in the same year, gun-related deaths reached a new high, at more than 45,000.",
    "Calling ghost guns \"the weapons of choice for many criminals,\" Biden said those who make them can \"expect federal prosecution.\"",
    "Ghost guns: A growing problem\nAs the nation's police grapple with a surge in gun violence, they face a new enemy: \"ghost guns.\"",
    "For those legally prohibited from owning guns, \"they're a dream come true,\" said John Feinblatt of Everytown for Gun Safety.",
    "Right-to-carry laws don't eliminate the background checks federal law requires of those buying guns from licensed dealers.",
    "National statistics for 2021 aren't yet compiled, but many cities have reported even worse numbers for gun violence.",
    "As gun violence soars across the nation, many states are making it far easier to buy and carry concealed weapons.",
    "A growing number of states have passed laws authorizing citizens to carry weapons in public without a license.",
    "One study found that gun homicides in Wisconsin rose by a third after a right-to-carry law was passed in 2011.",
    "The rule goes into effect in 120 days  but is likely to be the target of lawsuits from gun advocates.",
    "But many sales, such as those at gun shows or from person to person, are not subject to such checks.",
    "In Ohio, applicants had to undergo a background check and take an eight-hour class in gun safety.",
    "But as of last month, when Georgia, Indiana, Ohio, and Alabama passed such laws, 25 states do.",
    "The vast majority of suspects caught with them had been legally prohibited from having guns.",
    "Get the latest news from The Week\nSign up for our free newsletter\nSo why eliminate permits?",
    "If you want to read more like it, you can try six risk-free issues of the magazine here.",
    "\"We're going to see more of young people's bodies bleeding out on concrete,\" she said.",
    "The removal of restrictions comes at a time when gun violence in the U.S. is surging.",
    "Wisconsin Supreme Court approves GOP-drawn state legislative maps\nTexas Gov.",
    "This article was first published in the latest issue of The Week magazine.",
    "Police are finding them and confiscating them in increasing numbers.",
    "In 2011, only a single state, Vermont, allowed \"permitless carry.\"",
    "Eleven of those states passed their laws within the past year.",
    "\"The Constitution should be our carry permit,\" Georgia Gov.",
    "Brian Kemp said last month, as he signed Georgia's law.",
    "For many, \"constitutional carry\" is the favored term.",
    "Here's everything you need to know:\nWhat has changed?",
    "What do permitless carry laws do?",
    "Why are these laws passing?",
    "What is that case about?"
  ]
}