{
  "id": 5111,
  "mediaId": 1576,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "WABE's Week In Review: Guns, school lunches and voting rights",
  "image": "https://www.wabe.org/app/uploads/2021/03/ap319094130909-2adcb56b25c5d6134a188742fcb5867518152e28-scaled.jpg",
  "link": "https://www.wabe.org/wabes-week-in-review-guns-school-lunches-and-voting-rights/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "#gapol pic.twitter.com/iF1HKYfoHl\n Rahul Bali (@rahulbali) April 12, 2022\nSupporters called it a move that allows citizens to further protect themselves, but Democrats like state Sen. Donzella James say more than 5,000 permits were rejected in 2020 for reasons such as criminal convictions and mental health issues.",
    "But I am glad it is getting done.?\nWe have been in the fight on all of these issues for a long time,? said Kemp, who made national headlines in 2018 when he aired a campaign ad featuring himself toting a gun at a stammering man trying to date one of his daughters.",
    "They are trying to pivot from other issues in the country right now because of bad policies in Washington that have driven a 40-year high in inflation, well before the war in Ukraine,? Kemp said.",
    "Its too bad it took four years to get it down, and its too bad it took me getting into the race them get them to get the energy to get that done,? said former U.S. Sen. David Perdue of Georgia.",
    "#gapol pic.twitter.com/Pf26008123\n Rahul Bali (@rahulbali) April 12, 2022\nKemp called the criticisms partisan politics? and says more than two dozen other states have passed similar measures.",
    "With Governor Kemps signature on this bill, individuals similar to those who may have been flagged from the permitting process will carry guns in our communities,? said James.",
    "The Two Sides Of Constitutional Carry\nOn the right, Gable Sporting Goods, where Governor Kemp will sign SB 319, allowing the carrying of firearms without a permit in Georgia.",
    "Governor Signs Constitutional Carry Legislation\nGovernor Brian Kemp signs Senate Bill 319, which allows the concealed carrying of firearms without a permit in Georgia.",
    "So he [Perdue] is going to say those things but that is all he has to say.?\nThe new law does not change where a weapon can and can not be carried.",
    "For more on the Constitutional Carry Act and how it could play into the upcoming elections, check out our Georgia Votes 2022 podcast.",
    "Also in this episode\nMartha Dalton has more on how a federal school meal program is set to expire on June 30.",
    "If Congress doesnt extend the plan, more than a million Georgia students could be left without a safety net.",
    "But Kemps chief rival for the Republican nomination for governor called the signing a political play.",
    "On the left, Douglas County Government Annex, where Democratic state lawmakers will condemn it.",
    "Emily Wu Pearson has more on the National Urban Leagues State of Black America.",
    "Emil Moffatt looks at how startups in Atlantas tech sector are performing.",
    "Governor Brian Kemp signed the Constitutional Carry Act on Tuesday.",
    "Georgians can now carry a concealed firearm without a permit.",
    "But you also gotta have the votes.",
    "The law takes effect immediately.",
    "It takes effect immediately."
  ]
}