{
  "id": 5128,
  "mediaId": 33,
  "date": "d2022-04-15T00:00",
  "headline": "READ: Mark Meadows' texts with Mike Lee and Chip Roy",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220414181047-roy-meadows-lee-split-super-169.jpg",
  "link": "https://www.cnn.com/2022/04/15/politics/read-mark-meadows-texts-mike-lee-chip-roy/index.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CNN",
  "authorUrl": "https://www.cnn.com/profiles/cheri-mossburg",
  "termIds": [
    652,
    1039,
    1147,
    1580,
    2095,
    2215,
    3972,
    4135,
    4605,
    4859,
    3209
  ],
  "sentences": [
    "Sincerely, Senator Mike Lee Congressman Andy Biggs Congressman Mike Johnson Brent Bozell, Founder and President, Media Research Center Adam Brandon, President, FreedomWorks Bill Walton, President, Council for National Policy Marjorie Dannenfelser, President, Susan B. Anthony List David McIntosh, President, Club for Growth PAC Matt Schlapp, Chairman, American Conservative Union Jenny Beth Martin, Chairman, Tea Party Patriots Citizens Fund David Bozell, President, ForAmerica Tom Fitton, President, Judicial Watch Seymour Fein M.D., MRC Board of Directors\nFrom Mike Lee to Mark Meadows\nWe're sending this as a private communication from us to him through you.",
    "From Mike Lee to Mark Meadows\nI'm not sure doing nothing is a good option\nFrom Mike Lee to Mark Meadows\nUnless Powell can immediately substantiate what she said today, the president should probably disassociate himself and refute any claims that can't be substantiated\nFrom Mike Lee to Mark Meadows\nHe's got deep pockets, and the accusations Powell made are very, very serious\nFrom Mike Lee to Mark Meadows\nThat is an especially bad combination when you consider the damages that could easily be claimed (and indeed proven) and the deep pockets involved.",
    "From Chip Roy to Mark Meadows\nHey brother - we need substance or people are going to break...\nFrom Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nIf we don't get logic and reason in this before 11/30 - the GOP conference will bolt (all except the most hard core Trump guys)\nFrom Chip Roy to Mark Meadows\nFrom Mark Meadows to Chip Roy\nFrom Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nNote: John Eastman is a law professor who helped craft Trump's false argument that the 2020 election was stolen.",
    "Goal 1b is to expose corruption where found in a way that motivates public officials to bring about effective change to the voting process which brings meaningful and effective election reform allowing for every vote to be counted in an open/transparent and fair manner to all parties the end game for future elections is for a clear winner to be declared and accepted by all parties.",
    "From Mike Lee to Mark Meadows\nThere is a third way exhausting legal remedies while cooperating with the transition procsss\nPlease give this to the president:\nFrom Mike Lee to Mark Meadows\nDear Mr. President, We the undersigned offer our unequivocal support for you to exhaust every legal and constitutional remedy at your disposal to restore Americans faith in our elections.",
    "From Mike Lee to Mark Meadows\nThe potential defamation liability for the president is significant here\nFrom Mike Lee to Mark Meadows\nFor the campaign and for the president personally\nFrom Mike Lee to Mark Meadows\nUnless Powell can back up everything she said, which I kind of doubt she can\nFrom Mark Meadows to Mike Lee\nI agree.",
    "After many discussions with men and women in my peer group, and others involved in policy strategy concerning the potential corruption in the voting process here is my $1.27 worth, which will not get you a cup of coffee at starbucks, but is free of charge moving forward: 1.",
    "From Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nIf POTUS allows this to occur... we're driving a stake in the heart of the federal republic...\nFrom Chip Roy to Mark Meadows\nI am truly sorry I am in a different spot then you and our brothers re: Wednesday.",
    "(CNN)CNN has obtained text messages of separate conversations that then-White House chief of staff Mark Meadows had with Republican Sen. Mike Lee of Utah and Republican Rep. Chip Roy of Texas after the 2020 presidential election and through early January 2021.",
    "Goal 1a is to get the president re-elected by counting every \"legal\" vote through recounts in states where the margins qualify, and filing lawsuits in states where there is enough circumstantial voting irregularities evidence to justify the legal action.",
    "From Mike Lee to Mark Meadows\nhttps://www.washingtonexaminer.com/washington-secrets/exclusive-trump-urges-state-legislators-to-reject-electoral-votes-you-are-the-real-power\nFrom Mike Lee to Mark Meadows\nShould I take this as a good sign that he gets it?",
    "We must urge the President to tone down the rhetoric, and approach the legal challenge firmly, intelligently and effectively without resorting to throwing wild desperate haymakers, or whipping his base into a conspiracy frenzy.",
    "Once the final determination has been made, if we lose, we have an orderly transfer of power, and push hard for election process reform so that this does not happen again if we win, full speed ahead on all conservative fronts.",
    "From Mark Meadows to Mike Lee\nI am working on that as of yesterday\nFrom Mike Lee to Mark Meadows\nAlso, if you want senators to object, we need to hear from you on that ideally getting some guidance on what arguments to raise.",
    "Some believe today might be the deadline for some of this in PA.\nFrom Mike Lee to Mark Meadows\nIf a very small handful of states were to have their legislatures appoint alternative slates of delegates, there could be a path.",
    "I told him that you and I have been working it hard on his behalf\nTEXTS BETWEEN CHIP ROY AND MARK MEADOWS\nFrom Chip Roy to Mark Meadows\nWe have no tools / data / information to go out and fight RE: election / fraud.",
    "I am preaching to the choir, but had to get this off my chest we must not let the more flamboyant members of his advisory team rule the process and screw this up there is a lot on the table for us to win.",
    "I am trying to piece together 11th Cir, Nevada, Pa Hearing, etc... and I think there is a strong message that would be louder and better than Sydney/Rudy have been doing, but it's hard to keep up.",
    "From Mike Lee to Mark Meadows\nUse it however you deem appropriate\nFrom Mike Lee to Mark Meadows\nAnd if it's helpful to you for you to leak it, feel free to do so\nFrom Mark Meadows to Mike Lee\n??",
    "From Mark Meadows to Mike Lee\nI am not sure\nFrom Mike Lee to Mark Meadows\nFrom Mark Meadows to Mike Lee\nApparently, he was told that you came out with a letter against the electoral objections.",
    "We need a message that isn't wild-eyed\nFrom Chip Roy to Mark Meadows\nIf you are receiving this email, you have direct access to the President (which I do not), or you advises someone who does.",
    "You have in us a group of ready and loyal advocates who will go to bat for him, but I fear this could prove short-lived unless you hire the right legal team and set them loose immediately.",
    "This process must not jeopardize the Senate runoffs in GA by turning moderate republicans and independents against our party we must turn out our people for these runoff elections.",
    "From Mike Lee to Mark Meadows\nThere are plenty of others, perhaps, who are advocating this strategy with the best of intentions, but without fully understanding the ramifications.",
    "We simply have no authority to reject a state's certified electoral votes in the absence of a dueling slates, with the Trump slate coming from a state legislative determination.",
    "TEXTS BETWEEN MIKE LEE AND MARK MEADOWS\nFrom Mike Lee to Mark Meadows\nI want to offer words of encouragement to the president, and have reached out to Molly for that purpose.",
    "But I really think this could all backfire badly unless we have legislatures submitting trump slates (based on a conclusion that this was the proper result under state law).",
    "I'm trying to figure out a path that I can persuasively defend, and this won't make it any easier, especially if others now think I'm doing this because he went after me.",
    "Not sure what to suggest\nFrom Mike Lee to Mark Meadows\nIf you haven't yet watched tonight's episode of Life, Liberty, and Levin, you should do so if you can fit it in.",
    "From Mark Meadows to Mike Lee\nHe thinks the legislatures have the power but that the Vp has power too\nFrom Mike Lee to Mark Meadows\nVP but not the House and Senate?",
    "In any event, these actions need to be filed and announced in the next 48 hours or the public relations momentum we need to have behind it will start to dissipate.",
    "From Mike Lee to Mark Meadows\nI think we're now passed the point where we can expect anyone will do it without some direction and a strong evidentiary argument.",
    "From Mike Lee to Mark Meadows\nMeanwhile, we are struggling to figure out how to respond to things like this:\nFrom Mike Lee to Mark Meadows\nI am working on it.",
    "God bless each of you every day Bill\nFrom Chip Roy to Mark Meadows\nThese folks don't get that they don't win the senate seats if they don't fight for potus.",
    "From Mark Meadows to Chip Roy\nFrom Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nWho has catalogued / is tracking the best case for fraud / issues?",
    "From Mark Meadows to Chip Roy\nWe are going to do a manual recount\nFrom Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nI fly here from Tx to help.",
    "From Chip Roy to Mark Meadows\nGet Eastman to file in front of pa board of elections...\nFrom Chip Roy to Mark Meadows\nGet data in front of public domain.",
    "This doesn't have to come down to a binary choice between (1) an immediate concession, and (2) a destruction of the credibility of the election process.",
    "If we substitute the will of states through electors with a vote by Congress every 4 years... we have destroyed the electoral college... Respectfully.",
    "The messages reveal how two GOP allies of then-President Donald Trump lobbied and encouraged the White House in its efforts to overturn the election.",
    "Nor do I think he's grasping the distinction between what certain members are saying that sound like they could help him, but would really hurt him.",
    "From Mike Lee to Mark Meadows\nI have a simple question: how many vbm ballots were tossed in PA and WI for not meeting the requirements of state law?",
    "From Mike Lee to Mark Meadows\nIt was at the president's request that Sydney has been working on a strategy and has been trying to get in to see him.",
    "From Mark Meadows to Chip Roy\nFrom Chip Roy to Mark Meadows\nMessage: we should be passing ppp and having bipartisan hearings on election integrity.",
    "They gotta get a manual recount before they certify and sec states being stubborn and kemp won't pressure... and party establishment don't get it.",
    "From Mike Lee to Mark Meadows\nNote: Sidney Powell was a pro-Trump lawyer who was part of the effort to overturn the 2020 presidential election.",
    "From Mike Lee to Mark Meadows\nSidney told us that the campaign lawyers who I do not know are not focused on this and are obstructing progress.",
    "Note: Cleta is likely a reference to Cleta Mitchell, a pro-Trump lawyer who was part of the effort to overturn the 2020 presidential election.",
    "From Mark Meadows to Chip Roy\nWe are working on exactly that\nFrom Chip Roy to Mark Meadows\nI'm heading to Atlanta - let me know what I can do.",
    "From Mike Lee to Mark Meadows\nI don't think the president is grasping the distinction between what we can do and what he would like us to do.",
    "These GA state GOP losers are Mia...\nFrom Chip Roy to Mark Meadows\nOnly folks here are Cleta's folks & a handful of you get folks down hall.",
    "From Mike Lee to Mark Meadows\nEverything changes, of course, if the swing states submit competing slates of electors pursuant to state law.",
    "From Mike Lee to Mark Meadows\nThere are a few of us in the Senate who want to be helpful (although I sense that number might be dwindling).",
    "We're all just making generic statements...\nFrom Mark Meadows to Chip Roy\nIf observers are not present then votes should not be uploaded.",
    "From Mike Lee to Mark Meadows\nSydney Powell is saying that she needs to get in to see the president, but she's being kept away from him.",
    "From Mike Lee to Mark Meadows\nFrom Mike Lee to Mark Meadows\nI have grave concerns with the way my friend Ted is going about this effort.",
    "From Mike Lee to Mark Meadows\nAgain, all of this could change if the states in question certified Trump electors pursuant to state law.",
    "The good news is is that Eastman is proposing an approach that unlike what Sidney Powell has propose could be examined very quickly.",
    "Even if they can't convene, it might be enough if a majority of them are willing to sign a statement indicating how they would vote.",
    "My purpose in having the meeting was to socialize with Republican senators the fact that POTUS needs to pursue his legal remedies.",
    "I think it could be proven or disproven easily with an audit (a physical counting of all ballots cast) in PA, WI, GA, and MI.",
    "The fair and open process should be subject to observation\nFrom Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nGood.",
    "Bad intel\nFrom Mike Lee to Mark Meadows\nI've been spending 14 hours a day for the last week trying to unravel this for him.",
    "Even setting aside constitutional concerns, this will be harmful to the president if we don't channel this effort properly.",
    "From Mike Lee to Mark Meadows\nWe had steering executive meeting at CPI tonight, with Sidney Powell as our guest speaker.",
    "To have him take a shot at me like that in such a public setting without even asking me about it is pretty discouraging.",
    "But I've been calling state legislators for hours today, and am going to spend hours doing the same tomorrow.",
    "From Mike Lee to Mark Meadows\nBut if not, this could help people like Ted and Josh to the detriment of DJT.",
    "From Mike Lee to Mark Meadows\nBetween you and me, I fear that for some this could be a feature, not a bug.",
    "From Chip Roy to Mark Meadows\nI'm going to object today to all the voice vote requests on suspensions.",
    "From Chip Roy to Mark Meadows\nNote: \"Rudy\" is likely a reference to Rudy Giuliani, a lawyer for Trump.",
    "But in the absence of that, this effort is destined not only to fail, but to hurt DJT in the process.",
    "I know only that this will end badly for the president unless we have the Constitution on our side.",
    "I have no way of verifying or refuting that on my own, but I've found her to be a straight shooter.",
    "From Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nThe President should call everyone off.",
    "We need something from state legislatures to make this legitimate and to have any hope of winning.",
    "Mark Levin makes a very compelling case for the need for litigation related to this election.",
    "And unless these states submit new slates of Trump electors pursuant to state law, we do not.",
    "Note: Lee's mention of \"Molly\" likely refers to Molly Michael, Trump's executive assistant.",
    "Very concerned\nFrom Mike Lee to Mark Meadows\nThe temptation will be to do nothing for now.",
    "From Mike Lee to Mark Meadows\nBut now, my ability to do that with credibility is impaired.",
    "From Chip Roy to Mark Meadows\nI'm not going to - for various reasons but we need a fight.",
    "But in the primaries it was above the current margin of victory with much lower turnout.",
    "From Mike Lee to Mark Meadows\nJohn Eastman has some really interesting research on this.",
    "Apparently she has a strategy to keep things alive and put several states back in play.",
    "From Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nWhere do we stand, brother?",
    "This seems hard to sell:\nFrom Chip Roy to Mark Meadows\nAny help on message appreciated.",
    "From Chip Roy to Mark Meadows\nNote: \"boe\" is likely a reference to Board of Elections.",
    "From Mike Lee to Mark Meadows\nI don't purport to know who fits into which category.",
    "From Mike Lee to Mark Meadows\nThis will not inure to the benefit of the president.",
    "This fight is about the fundamental fairness and integrity of our election system.",
    "The text messages were obtained by the House select committee and reviewed by CNN.",
    "Note: CNN has removed personal information from the texts and adjusted profanity.",
    "From Mike Lee to Mark Meadows\nAnd I've been working on doing that all day today.",
    "From Mark Meadows to Chip Roy\nFrom Chip Roy to Mark Meadows\nWhat's the message?",
    "From Mike Lee to Mark Meadows\nAlso, I have an additional idea for the campaign.",
    "From Mike Lee to Mark Meadows\nI'm worried about the Powell press conference.",
    "From Mike Lee to Mark Meadows\nBut to do this, you'd have to act very soon.",
    "From Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nThis is great.",
    "From Chip Roy to Mark Meadows\nFrom Chip Roy to Mark Meadows\nFix this now.",
    "Errors in spelling and grammar reflect the messages as reviewed by CNN.",
    "From Mike Lee to Mark Meadows\nPlease tell me what I should be saying.",
    "From Mike Lee to Mark Meadows\nPlease give me something to work with.",
    "From Chip Roy to Mark Meadows\nYou know this but that's the deal.",
    "He will call\nFrom Mike Lee to Mark Meadows\nIt's not your fault.",
    "Not as good as it appears\nFrom Mike Lee to Mark Meadows\nHow so?",
    "That opportunity could be harmed in multiple ways this effort.",
    "If they played games with that Trump has a really strong case.",
    "If you need / want it, we all need to know what's going on.",
    "Please man, help us up together a message to go on offense.",
    "Congratulations btw\nFrom Chip Roy to Mark Meadows\nRoger.",
    "From Chip Roy to Mark Meadows\nHappy Thanksgiving, Mark.",
    "do we have anything to put out that can make the case?",
    "Note: \"Ted and Josh\" likely refers to Republican Sens.",
    "This fight is about much more than just this election.",
    "Fwiw...\nFrom Mark Meadows to Chip Roy\nThanks so much.",
    "The nation is depending upon your continued resolve.",
    "He's got a very real opportunity for a win in 2024.",
    "From Mike Lee to Mark Meadows\nWe should chat then.",
    "Note: \"vbm\" likely refers to vote-by-mail ballots.",
    "If you're still in the game... dude, we need ammo.",
    "Did we file any of the evidence with the PA BOE?",
    "I'd love to be proven wrong about my concerns.",
    "Ted Cruz of Texas and Josh Hawley of Missouri.",
    "I just need to know what I should be saying.",
    "Stay strong and keep fighting Mr. President.",
    "From Mark Meadows to Mike Lee\nSo very sorry.",
    "I told him that you were being very helpful.",
    "From Mark Meadows to Mike Lee\nI pushed back.",
    "This just makes it a lot more complicated.",
    "Will we get this chance in PA, AZ, GA, WI?",
    "We are not issuing it as a press release.",
    "Note: Kemp likely refers to Georgia Gov.",
    "Something is not right in a few states.",
    "Working on it for surrogates briefing.",
    "From Mark Meadows to Mike Lee\nWell.",
    "It wasn't in the prepared remarks.",
    "Now let's hold GA, & take az & pa!",
    "I can't find the stats anywhere.",
    "And it was complicated already.",
    "From Mark Meadows to Chip Roy",
    "Brian Kemp, a Republican.",
    "But she's being kept out.",
    "Can you help her get in?",
    "We need it this weekend.",
    "We need fraud examples.",
    "Not business as usual.",
    "Stay healthy and well.",
    "But I will defend all.",
    "It's the only path.",
    "I'm here at 9 pm.",
    "Yessir, thx.",
    "Do we know?",
    "So sorry.",
    "Be well.",
    "2.",
    "5.",
    "3.",
    "4."
  ]
}