{
  "id": 5141,
  "mediaId": 12,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Kemp signs bill protecting farmers from lawsuits filed by neighbors",
  "image": "https://www.ajc.com/resizer/VGAkgaJdIGdVTNDxij3VwjKoALo=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/OX6FQCUBJ6GHPJYIMX3ZTQ6PA4.jpg",
  "link": "https://www.ajc.com/politics/georgia-state-legislature/kemp-signs-bill-protecting-farmers-from-lawsuits-filed-by-neighbors/FNF64JIAPFEX3HGKCBEDGBMOQU/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Quinn",
  "authorUrl": "https://www.ajc.com/staff/christopher-quinn/",
  "termIds": [
    2095,
    461,
    2672,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "It balanced the right of landowners against farms, saying anyone who moved near a farm could not sue, and existing landowners near a farm had a maximum of four years to sue if the operation began creating problems that affected their lives or property values.",
    "Upon signing the bill, Kemp said: As the global marketplace continues to react to Russias unprovoked and unjust war in Ukraine  Europes breadbasket  the importance of the ag sector here in America, and especially here in Georgia, will only continue to grow.",
    "House Bill 1150, called the Freedom to Farm bill, limits the ability of landowners who live near farms or agricultural-related processing facilities such as slaughterhouses to sue because of noises, smells or other impingements on their property.",
    "Under current law, residents who were there first can protect their property rights any time an agricultural nuisance occurs, even if the nuisance occurs 20 years after the agricultural facility began operating,? she wrote.",
    "One recent lawsuit out of south Georgia involves small farmers and landholders suing a mega diary operation alleging the company polluted waterways, attracted vermin and created overpowering smells.",
    "But agricultural interests and sponsors of the bill wanted to cut the window of time for neighbors to sue farms to one year, saying they were fearful of future lawsuits.",
    "Our farming families are more important than ever, and thats one of many reasons why its so crucial we protect their way of life.?\nVisit AJC.com\nWant more politics news?",
    "April Lipscomb, an attorney for the Southern Environmental Law Center who testified in the hearings, wrote a summary of why she believed the new law was bad.",
    "Under HB 1150, existing residents can only protect their property rights from nuisances created during the first two years of the facilitys operation.",
    "Brian Kemp signed a bill into law Wednesday afternoon giving Georgia farmers layers of protection against nuisance lawsuits from neighbors.",
    "Critics say the legislation restricts the legal rights of nearby landowners harmed by agricultural companies, including other farmers.",
    "Get the latest news and in-depth coverage from the Georgia Legislature, political campaigns, and state issues on ajc.com/politics.",
    "That is not a compromise; its an assault on property rights.?\nThe bill passed in the waning hours of the legislative session.",
    "No one testifying in the hearings on HB 1150 could cite an increase in lawsuits or farms being put out of business by them.",
    "That would prevent, for example, nonprofit environmental organizations from suing.",
    "The new law could quash future suits before theyre ever filed, critics say.",
    "Georgia had a Right to Farm law that had been held up as a national model.",
    "The bill also prohibits lawsuits by non-neighbors.",
    "That was later changed to two years.",
    "Gov."
  ]
}