{
  "id": 5157,
  "mediaId": 43,
  "date": "d2022-04-14T00:00",
  "headline": "Georgia governor signs bill protecting farms from suits filed by neighbors, environmental groups",
  "image": "https://images.dailykos.com/images/1059237/story_image/GettyImages-1230146559.jpg?1649962137",
  "link": "https://www.dailykos.com/story/2022/4/14/2091990/-Georgia-governor-signs-bill-protecting-farms-from-suits-filed-by-neighbors-environmental-groups",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    1951,
    2095,
    4025,
    501,
    2672,
    4995
  ],
  "sentences": [
    "And under the current bill, we still have protection to litigate against something like that.?\nHouse Agriculture and Consumer Affairs Committee Chairman Robert Dickey III, one of the bills seven all-Republican sponsors, claimed during the hearing in February that the bill was just trying to give farmers some protection to farm their land like they've always done it, when you have some neighbors who might move in and have a little different opinion.?\nIn a written statement to AJC, April Lipscomb, an attorney for the Southern Environmental Law Center, explained why she thought the amended bill would hurt residents living near the farms.",
    "That is not a compromise; its an assault on property rights.?\nAgriculture is Georgias leading industry, bringing in more than $74 billion to the state annually and leading the nation with its production of peanuts, eggs, and broilers (chickens), as well as cotton, pecans, blueberries, and more.",
    "Under current law, residents who were there first can protect their property rights any time an agricultural nuisance occurs, even if the nuisance occurs 20 years after the agricultural facility began operating,? she wrote.",
    "As the global marketplace continues to react to Russias unprovoked and unjust war in UkraineEuropes breadbasketthe importance of the ag sector here in America, and especially here in Georgia, will only continue to grow.",
    "The bill was endorsed by the Georgia Farm Bureau, the Georgia Agribusiness Council, the Georgia Poultry Federation, and the Georgia Forestry Association, The Moultrie Observer reports.",
    "Brian Kemp signed a bill Wednesday making it a lot easier for farms to get away with funking up the environment and forcing residents to live with noxious smells or polluted water.",
    "The bill additionally blocks any non-neighbors, such as an environmental nonprofit organization, from suing a farm, as reported by the Atlanta Journal-Constitution (AJC).",
    "Our farming families are more important than ever, and thats one of many reasons why it's so crucial we protect their way of life.?\nThis is a short blurb about Daily Kos.",
    "And for the most part, especially in Gordon County, thats been happening,? Charlotte Swancy, a Gordon County farmer said during a hearing for the bill in February.",
    "Kemp, files suit to use law he signed for himself in her favor\nCritics of the bill include at least one farmer who said she had no issues with the previous laws.",
    "Under HB 1150, existing residents can only protect their property rights from nuisances created during the first two years of the facilitys operation.",
    "Lawsuits could come in the form of noise or smell complaints, or any other problems caused by a farm, industrial processing plant, or slaughterhouse.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "HB 1150, titled Freedom to Farm,? essentially limits the time in which a neighbor of a farm can sue to two years.",
    "The bill amends a previous one that gave residents four years max to sue over issues related to a nearby farm.",
    "Kemp used Russias invasion of Ukraine to justify why signing this bill was so important.",
    "But in our county, there was a proposal of bringing in a 150 chicken house operation.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "RELATED STORY: Stacey Abrams turns tables on Gov.",
    "We want to be good stewards of the land.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Brian Kemp\nGeorgia Gov.",
    "Daily Kos is different.",
    "Please read it.",
    "Georgia Gov."
  ]
}