{
  "id": 5168,
  "mediaId": 21,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "McConnell told Republican senators they've 'got to stay focused on Georgia' immediately after Trump told them that he could overturn the 2020 presidential election: book",
  "image": "https://i.insider.com/625707879c862b00181aa6ba?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/mcconnell-republicans-stay-focused-on-georgia-trump-overturn-2020-election-2022-4",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    2095
  ],
  "sentences": [
    "Even as then-Senate Majority Leader Mitch McConnell avoided discussing his concerns about former President Donald Trump's baseless claims about the 2020 presidential election being stolen or fraudulent, he privately worried that Trump would cost their party control of the Senate by derailing two Georgia Republicans' run-off campaigns.",
    "A McConnell spokesman declined to comment to CNN, while Trump spokesman Taylor Budowich told the outlet that the former president \"has been clear and consistent about the indisputable evidence of fraud in the 2020 presidential election and the need to hold those criminals accountable.\"",
    "That's according to new details from \"This Will Not Pass: Trump, Biden, and the Battle for America's Future,\"a forthcoming book from New York Times reporters Jonathan Martin and Alex Burns, that were reported by CNN on Wednesday.",
    "On the call, Burns and Martin report that Trump also claimed that Georgia voters wouldn't tolerate Kemp's assurances about the security of the election, and that Perdue and Loeffler should speak up lest they lose their races.",
    "Trump reportedly told McConnell and other Republican senators in a December 2020 call that he'd personally been told by state officials in Pennsylvania and Michigan that they would take steps to keep him in power.",
    "Brendan Smialowski/AFP via Getty Images\n\"We've got to stay focused on Georgia,\" McConnell told his colleagues right after the December 2020 call with Trump, according to Martin and Burns.",
    "\"What it looks to me like he's doing is setting this up so he can blame the governor and the secretary of state if we lose,\" McConnell told the book's authors ahead of the 2021 runoffs.",
    "The book also reported that McConnell sought to maintain a \"strategic silence\" about Trump's false claims in order to prevent him from sabotaging the party's chances in the runoffs.",
    "Trump and McConnell haven't spoken since December 15, 2020, when the Republican leader went to the floor of the Senate and declared that \"the Electoral College has spoken.\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Ultimately, Ossoff and Warnock prevailed in an upset that many attributed to depressed Republican turnout due to Trump's false claims about the 2020 election.",
    "That would've flipped Biden's 306-232 electoral college victory to a 284-254 victory for Trump, keeping him in the White House for a second term.",
    "Brian Kemp to de-certify President Joe Biden's election victory in Georgia, then other states would follow suit in a \"domino effect.\"",
    "Trump has since criticized McConnell in blistering terms while calling for him to be overthrown as the Senate Republican leader.",
    "Tom Brenner/Reuters\nMcConnell worried that angering Trump ahead of the Georgia Senate runoffs could cost his party the Senate.",
    "He privately told Republicans to \"stay focused on Georgia\" even as Trump claimed he could overturn the presidential election.",
    "\"I've been calling folks in those states and they're with us,\" Trump told the senators on the call, per Martin and Burns.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"I've been calling folks in those states and they're with us,\" Trump boasted to senators in a December 2020 call.",
    "Senate Minority Leader Mitch McConnell after Senate Republicans weekly luncheon on Capitol Hill on April 5, 2022.",
    "But McConnell was far more focused on the upcoming January 5 runoff elections in Georgia, where Republican Sens.",
    "David Perdue and Kelly Loeffler faced close races with Democrats Jon Ossoff and Raphael Warnock, respectively.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "He also reportedly believed that if he could pressure Georgia Gov.",
    "That contention was reportedly met with silence from McConnell.",
    "David Perdue and Kelly Loeffler in Georgia ahead of a rally.",
    "Then-President Donald Trump speaking with then-Sens.",
    "\"He's always setting up somebody to blame it on.\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}