{
  "id": 5174,
  "mediaId": 12,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Top Georgia transportation official leaves for the private sector",
  "image": "https://www.ajc.com/resizer/FalVVY2LhqX5mpaU5gk2F4Zmzbk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/ARFSL2S22IC2LJUA2SBFLSATKY.jpg",
  "link": "https://www.ajc.com/politics/top-georgia-transportation-official-leaves-for-the-private-sector/P7EWNKIJ6NAUVPO3FPXGTLFSSE/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Wickert",
  "authorUrl": "https://www.ajc.com/staff/david-wickert/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Chris Tomlinson is executive director of three Georgia transportation agencies  the State Road and Tollway Authority (SRTA), the Georgia Regional Transportation Authority (GRTA) and the Atlanta-Region Transit Link Authority (the ATL Board).",
    "Serving as the executive director for the state of Georgias mobility authorities has been the most challenging and fulfilling experience of my professional career,? Tomlinson said in announcing his departure.",
    "Under his leadership, the agency also negotiated agreements with Florida and North Carolina to allow Georgia residents with Peach Passes to use those states toll lanes, and vice versa.",
    "Among other things, the agency has created an evolving regional transit plan and is creating a mobile app that would allow passengers to plan trips across multiple transit operators.",
    "For years GRTA operated the states Xpress commuter bus network, and Tomlinson oversaw the replacement or refurbishment of nearly 60% of the original bus fleet.",
    "Tomlinsons responsibilities expanded in 2018, when the General Assembly created the ATL Board to oversee transit planning and funding in metro Atlanta.",
    "Chris has been a valued member of the team and a key leader in the transportation sector within Georgia and nationally,? Kemp said.",
    "Tomlinson oversaw the addition of three new tolled lanes, and SRTA expanded to more than one million customers with Peach Passes.",
    "GRTA also reviews proposals for large regional commercial and residential developments, analyzing their impact on traffic.",
    "Tomlinson has had the unusual task of managing three agencies simultaneously through a time of substantial change.",
    "He later managed the transition of the Xpress bus network from GRTA to SRTA and then to the ATL Board.",
    "One of Georgias top transportation officials is leaving to take a job in the private sector.",
    "Hes leaving after 24 years in state government, including nine in his current position.",
    "The agencys ultimate goal is to create a more seamless metro transit system.",
    "The agencies did not announce where he will be working next.",
    "SRTA operates metro Atlantas growing network of toll lanes.",
    "Brian Kemp will appoint the next director of the agencies.",
    "Tomlinson will leave in May.",
    "Gov."
  ]
}