{
  "id": 5186,
  "mediaId": 1576,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Public college costs to fall in Georgia as fee goes away",
  "image": "https://www.wabe.org/app/uploads/2022/04/AP19316792829102-336x189.jpg",
  "link": "https://www.wabe.org/?p=271412",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    221,
    224,
    598,
    3237,
    2672,
    2770,
    2900,
    5135
  ],
  "sentences": [
    "Amounts are for four-year degrees at each schools main campus:\n Abraham Baldwin Agricultural College: $3,806, down 9.5%\n Albany State University: $6,500, down 6.5%\n Atlanta Metropolitan State College: $3,712, down 9.7%\n Augusta University: $8,122, down 8%\n Clayton State University: $6,084, down 7.6%\n College of Coastal Georgia: $4,124, down 9.8%\n Columbus State University: $6,844, down 6.7%\n Dalton State College: $3,294, down 9.3%\n East Georgia State College: $3,306, down 13.1%\n Fort Valley State University: $6,408, down 6.4%\n Georgia College and State University: $8,794, down 5.8%\n Georgia Gwinnett College: $5,652, down 8.5%\n Georgia Highlands College: $3,514, down 10.2%\n Georgia Southern University: $6,998, down 7.7%\n Georgia Southwestern University: $5,996, down 7.5%\n Georgia State University: $10,268, down 7.3%\n Georgia Tech: $11,764, down 8.5%\n Gordon State College: $4,116, down 7.1%\n Kennesaw State University: $6,898, down 8.6%\n Middle Georgia State University: $4,762, up 0.4%\n Savannah State University: $6,514, down 5.8%\n South Georgia State College: $3,540, down 8.8%\n University of Georgia: $11,180, down 7.5%\n University of North Georgia: $7,012, down 6%\n University of West Georgia: $7,034, down 7.6%\n Valdosta State University: $7,100 down 7.5%\nSource: Board of Regents of University System of Georgia",
    "They gave a total of $661 million in new state money to the system, boosting funding by 27% to not only offset the fee, but add $219 million for a full year of $5,000 pay raises for university employees, $107 million to cover increases in students and buildings and $66 million for building repairs and renovations.",
    "Some students who receive the HOPE scholarship  or the HOPE grant awarded to technical college students  could also get more help because lawmakers ordered the Georgia Student Finance Commission to cover at least 90% of the cost of tuition with such aid, boosting spending by $25 million.",
    "Overall, lawmakers will spend $3.12 billion in state money on universities in the year beginning July 1, part of a $9.2 billion overall budget that also includes a projected $3.13 billion in tuition, $1.63 billion in federal money and $1.32 billion in research money.",
    "The only exception is Macon-based Middle Georgia State University, where total costs for in-state undergraduates will rise $20 next year to $4,762 as part of a three-year plan to increase tuition to line up with similar universities.",
    "Tuition will drop by the largest percentage at schools with many students seeking two-year degrees, such as East Georgia State, Rome-based Georgia Highlands College, and Georgia State Universitys Perimeter College campuses.",
    "But a charge called the special institutional fee? was imposed in addition to tuition amid $1 billion in state budget cuts during the Great Recession in 2009 and had remained even though it was supposed to be temporary.",
    "University System of Georgia regents, meeting Tuesday at Albany State University, approved tuition and fee rates for the systems 26 schools that will result in overall costs going down by 7.6% at the typical school.",
    "College cost increases nationwide slowed sharply in 2021-22, with the College Board finding that tuition and fees rose only 1.6% for in-state students at four-year public colleges.",
    "Unlike tuition, Georgias lottery-funded HOPE scholarships cant be used.to pay the special institutional fee, meaning it reached into more students pockets.",
    "Students will save anywhere from $226 for a full two-semester load at Georgia Southern Universitys Armstrong campus in Savannah to $1,088 at Georgia Tech.",
    "Georgias typical tuition and fees are lower than all but three other states in the 16-state region covered by the Southern Regional Education Board.",
    "But more than 40% of Georgia students now borrow to pay for college, with students borrowing more than $6,000 on average at some universities.",
    "Thats thanks to a big boost in state funding granted in exchange for eliminating a budgetary hangover that had lasted more than a decade.",
    "Most mandatory fees are earmarked for specific purposes, such as technology, intercollegiate athletics, student activities or transit.",
    "Heres a look at tuition and fees for two semesters (fall and spring), as well as the percentage change from the current academic year.",
    "Then, university leaders said the $230 million it generated was too much to eliminate, unless it was replaced by state money.",
    "This is a huge win for students,? Tracey Cook, the executive vice chancellor for fiscal affairs, told regents on Tuesday.",
    "The typical Georgia school is charging in-state undergraduates $6,716 this year, which will drop to $6,360 next year.",
    "For almost all of the 340,000 students at Georgias public universities and colleges, theyll be going down next fall.",
    "This is the best budget Ive seen in a very long time, actually, since my time at the university system,? Cook said.",
    "HOPE scholarships go to students who graduate high school with a B average and maintain a B average in college.",
    "But the special institutional fee existed just to raise money for general spending, in addition to tuition.",
    "Costs will range from $11,764 at Georgia Tech to $3,306 at Swainsboro-based East Georgia State College.",
    "Regents have held tuition flat for three straight years, and five years out of the last seven.",
    "The elimination of that special fee is a big deal for our students,? said regent Neal Pruitt.",
    "There, because tuition has been low, the fee made up a large share of overall costs.",
    "In each case, costs will still be lower after the other fee increases, though.",
    "Many students pay less than the sticker price because of other types of aid.",
    "Last December, a legislative committee recommended getting rid of the fee.",
    "But because of dazzling growth in state revenue, Gov.",
    "Brian Kemp and lawmakers agreed to do just that.",
    "Five schools will increase other fees.",
    "College costs do not always go up."
  ]
}