{
  "id": 5192,
  "mediaId": 1164,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Georgia Gov. Brian Kemp signs law to allow conceal carry without a permit",
  "image": "https://cdnph.upi.com/svc/sv/i/5551649829326/2022/1/16498337892315/Georgia-Gov-Brian-Kemp-signs-law-to-allow-conceal-carry-without-a-permit.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/04/13/Georgia-conceal-carry-law/5551649829326/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darryl Coote",
  "authorUrl": "https://www.upi.com/author/Darryl-Coote/",
  "termIds": [
    1662,
    2095,
    147,
    341,
    2555,
    2648,
    2672,
    2945
  ],
  "sentences": [
    "pic.twitter.com/afawOELSjR Georgia Democrats (@GeorgiaDemocrat) April 12, 2022\nFollowing the signing, the gun lobby National Rifle Association thanked its members for their work in support for such bills, stating that nine states have passed conceal carry bills since President Joe Biden was inaugurated.",
    "\"Senate Bill 319 makes sure law-abiding Georgians -- law-abiding Georgians, including our daughters, and your family, too -- can protect themselves without having to have permission from your state government,\" Kemp, who campaigned on passing such legislation in 2018, said during the press conference.",
    "The Republican governor signed Senate Bill 319, better know as the Constitutional Carry Act, Tuesday outside of a sporting goods store in Douglasville, near Atlanta, where he said he bought his daughter Lucy her first firearm, a Glock 43X 9mm.",
    "Opponents of the bill have argued that it creates a legal loophole to allow some residents convicted of crimes to carry concealed weapons in public, with the Georgia Democratic Party budding the S.B.",
    "\"By signing this into law, Kemp is ignoring warnings from law enforcement and actually making it easier for criminals to carry hidden, loaded guns in public,\" state Rep. Kimberly Alexander said.",
    "\"This bill protects every Georgians' right to keep and bear arms while maintaining the protections that ensure our legal law aiding citizens can carry a firearm in the state of Georgia.\"",
    "Brian Kemp has signed legislation to allow residents to carry a concealed gun in public without a license, making it the 25 state to do away with firearm requirement.",
    "Kemp on Tuesday also signed House Bill 218 to allow people from outside Georgia to be armed while visiting as long as they are licensed in their home state.",
    "The signing ceremony was held after the bill passed the state's Senate 34-22 early this month and the House 100-67 late last month.",
    "State Sen. Jason Anavitarte called Tuesday a history day and a victory for safety, security and constitutional rights in Georgia.",
    "It's about disincentivizing criminals and empowering law-abiding citizens to defend themselves and their families,\" he said.",
    "Ahead of the bill's signing, Georgia Democrats held their own press conference in opposition to the act.",
    "\"'Criminal carry' puts our communities, our neighbors, our loved ones and all Georgias at risk.\"",
    "Earlier today, Georgians gathered to oppose Brian Kemp's dangerous \"criminal carry\" law.",
    "\"The Constitution of the United States gives us that right, not the government.\"",
    "Brian Kemp should listen more to his constituents and less to special interests.",
    "\"This bill is about self protection and self empowerment.",
    "70% of Georgians agree - this law puts us in danger.",
    "\"Half the country down, half to go,\" it tweeted.",
    "319 the \"criminal carry\" legislation.",
    "April 13 (UPI) -- Georgia Gov."
  ]
}