{
  "id": 5200,
  "mediaId": 157,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "GOP's Brian Kemp loses patience with Trump-loving hecklers over 2020 election: 'I'm the governor -- not a dictator!'",
  "image": "https://www.rawstory.com/media-library/georgia-gov-brian-kemp.png?id=27361036&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/brian-kemp-georgia/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    1147,
    1951,
    2095,
    2203,
    428,
    501,
    2672
  ],
  "sentences": [
    "Kemp and GOP secretary of state Brad Raffensperger resisted Trump's pressure campaign to overturn the loss, and the governor compared right-wing conspiracists to Stacey Abrams and her allies questioning him for overseeing his own election when they faced off in Georgia's 2018 gubernatorial race.",
    "The GOP governor lost his patience with a group of critics sitting at a handful of tables at the Fulton County Republican Party meeting Saturday, and he pushed back on their shouted conspiracy theories about Donald Trump's election loss in the state, reported the Atlanta Journal-Constitution.",
    "#gapolhttps://youtu.be/WwoxFB2n4Yc\n Greg Bluestein (@Greg Bluestein) 1649530838\nNOW WATCH: Leaked probe into Hillsong megachurch reveals a shocking culture of abuse and sexual misconduct\nLeaked probe into Hillsong megachurch reveals a shocking culture of abuse",
    "I\\u2019m not a dictator.\\u201d Georgia @GovKemp gets spicy during a Q&A this morning at the Fulton GOP from pro-Trump activists who challenged him on his role in the 2020 election.",
    "Now theyre trying to blame me for something that I had no constitutional authority to do.?\nOne of the hecklers called Kemp a \"liar,\" and he snapped at the critic.",
    "If you want to know what the truth is about the election,\" Kemp said, \"you should first relearn what the laws and the Constitution say.\"",
    "I fought them every single time when none of these naysayers over here even cared about it,? Kemp said.",
    "I know theres a lot of people that lied to people about what my powers are,\" Kemp said.",
    "Brian Kemp faced conspiracy-minded hecklers at a Republican Party event.",
    "\"I mean, Im the governor, Im not a dictator.",
    "I was secretary of state for nine years.\"",
    "\\u201cI\\u2019m the governor.",
    "Georgia Gov."
  ]
}