{
  "id": 5209,
  "mediaId": 33,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Georgia governor signs bill allowing most residents to carry a concealed gun without a permit",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220412171736-gov-brian-kemp-gun-signing-0412-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/04/12/us/georgia-permitless-gun-carry-law-signed/index.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Rose and Theresa Waldrop",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "The measure -- which supporters call \"constitutional carry\" -- passed the legislature April 1 and allows anyone who was previously eligible for a concealed carry license in Georgia to begin carrying a concealed handgun without a permit.",
    "Georgia is now one of more than 20 states that allow permitless carry, according to data compiled by Everytown for Gun Safety, a non-profit that focuses on gun violence prevention.",
    "Georgia's law does not apply to people who are barred from handgun ownership for other reasons, such as minors and convicted felons who have not had their civil rights restored.",
    "Controversial permitless carry laws have gained momentum during this year's legislative sessions in several states, including Wisconsin, South Carolina, Indiana and Nebraska.",
    "Kemp, who is running for reelection this year amid criticism from former President Trump, used the concealed carry law Tuesday to put his conservative credentials on display.",
    "The new law allows Georgia citizens \"to protect themselves without having to have permission from your state government,\" Kemp said at a signing ceremony.",
    "Brian Kemp signed a bill into law Tuesday that makes it legal for most residents to carry a concealed firearm without a license.",
    "Law enforcement officials and advocacy groups nationwide have been sounding the alarm about the policy's safety risks.",
    "On the same day the bill became law, a subway passenger in New York shot 10 people, and several others were injured.",
    "Mike DeWine signed legislation that will allow adults to carry a concealed handgun without a license or training.",
    "The rash of legislation comes amid an increase in gun violence and homicides and after homicides spiked in 2020.",
    "\"I have no doubt that the Left will come out against us like they have before,\" Kemp said.",
    "It still bans guns in airports and secured government buildings.",
    "CNN's Emma Tucker and Amanda Musa contributed to this report.",
    "Kay Ivey signed a similar bill, and Ohio Gov.",
    "(CNN)Georgia's Republican Gov.",
    "In March, Alabama Gov."
  ]
}