{
  "id": 5226,
  "mediaId": 558,
  "date": "d2022-04-10T00:00",
  "headline": "How Rich Are Biden, Trump and These Other Potential 2024 Presidential Candidates?",
  "image": "https://s.yimg.com/ny/api/res/1.2/mbjiTr536dU2H0VGnz2KKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Gerb_PlFOkMaafoLwD2IrQ--~B/aD0xMDgwO3c9MTkyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/gobankingrates_644/255ad3e3cbd40d640f9e7e73c3f9dc9b",
  "link": "https://finance.yahoo.com/amphtml/news/rich-biden-trump-other-potential-143039688.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam DiSalvo",
  "authorUrl": "",
  "termIds": [
    895,
    1147,
    1951,
    2087,
    2095,
    2368,
    2429,
    4282,
    223,
    428
  ],
  "sentences": [
    "Stacey Abrams\nNet Worth: $500,000\nAbrams served in the Georgia House of Representatives for 10 years and has since founded Fair Fight Action, an organization with the goal of fighting voter suppression.",
    "Find: 20 Genius Things Mark Cuban Says To Do With Your Money\nLet's take a look at the net worth of those who are likely candidates or have openly discussed running for president in the 2024 election.",
    "However, she lobbied to be President Joe Biden's running mate which ultimately went to Vice President Kamala Harris in 2020, so a run for president in 2024 isn't out of the question.",
    "Many politicians have already discussed the potential of running for president in the next election, which will take place November 5, 2024.",
    "The U.S. president earns $400,000 a year, which might be a pay cut for some of these White House hopefuls and a huge pay bump for others.",
    "Abrams, a Democrat, is now turning her sights to the 2022 governor's race after losing the same race in 2018 to Republican Brian Kemp.",
    "His net worth reportedly dropped $700 million in his last year of his presidency, and has dropped $600 million since leaving office.",
    "President Joe Biden\nNet Worth: $8 Million\nPresident Joe Biden has said he has every intention of running for reelection in 2024.",
    "Donald Trump\nNet Worth: $2.5 Billion\nThe former Republican president has strongly hinted at the possibility of running again.",
    "It feels like we just went through an election, and yet the 2024 presidential showdown isn't that far away.",
    "In addition to his political salary, it's reported Biden made $11 million from book advances in 2017.",
    "Before that, he served as a Delaware senator from 1973 until he took office as VP.",
    "She talked about running for president in 2020, but ultimately decided against it.",
    "See: How Rich Are Mike Krzyzewski and Other Top-Paid College Basketball Coaches?",
    "Biden served as former President Barack Obama's vice president from 2009-2017.",
    "Before he was president, Trump was a media personality and businessman."
  ]
}