{
  "id": 5238,
  "mediaId": 558,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Stacey Abrams win in Georgia will lead to cold war with Florida, DeSantis says",
  "image": "https://s.yimg.com/ny/api/res/1.2/bAHpFEPXPnyLLmRyGqJykg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/GCALSXTAOjxL2qk.uapiAQ--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/theguardian_763/78ae8404239f235fcd215e923ee14e2f",
  "link": "https://sg.news.yahoo.com/stacey-abrams-win-georgia-lead-121340466.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Pengelly",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1951,
    2095,
    146,
    428,
    2590,
    2661,
    2672,
    2934
  ],
  "sentences": [
    "A spokeswoman for DeSantiss office : If Stacey Abrams wins the governorship of Georgia, we know that her approach to leadership will involve more heavy-handed government, taxes and bureaucratic influence.?\nAmid controversy, Craig Pittman, a Florida reporter and author, the governor was trying desperately to get attention from Fox News for saying something outrageous to own the libs and diss Black people?.",
    "Abrams work to turn out Democratic votes, particularly among minorities, helped flip Georgia to Joe Biden in the 2020 presidential election and then elect two Democratic senators in runoffs in January the following year.",
    "A former state representative and a successful author, she ran for governor in 2018 and lost narrowly to Brian Kemp, refusing to concede while protesting his role as secretary of state in controlling his own election.",
    "If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a cold war between Florida and Georgia,? DeSantis said at a press event in the north-west of his own state.",
    "So I hope you guys take care of that and well end up in good shape.?\nDeSantis polls strongly among potential Republican nominees for president in 2024, with or without Donald Trump in the race.",
    "Accordingly, he has positioned himself as a major player on culture-war issues, recently signing a bill regarding the teaching of LGBTQ+ issues which critics labeled dont say gay?.",
    "The Florida governor, Ron DeSantis, predicted a cold war? with Georgia if it elects the Democrat and voting rights campaigner Stacey Abrams as governor this year.",
    "We will not back down on that.?\nAbrams has become a major player in her own state, to the west of Florida, and a hate figure among conservatives.",
    "Such moves have also led DeSantis into direct confrontation with Disney, a major employer and economic engine in his state.",
    "In California, Los Angeles county has banned business travel to Florida and Texas over anti-LGBTQ+ policies.",
    "I cant have [former Cuban leader Ral] Castro to my south and Abrams to my north, that would be a disaster.",
    "On Friday, he said: I dont really care what the media says about that.",
    "I dont care what, you know, very leftwing activists say about that.",
    "I do not care what big companies say about that.",
    "We are standing strong."
  ]
}