{
  "id": 5254,
  "mediaId": 33,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Opinion: These laws tie law enforcement's hands behind their backs",
  "image": "https://www.i.cdn.cnn.com/.a/2.287.3/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/04/08/opinions/permitless-carry-gun-law-enforcement-acevedo/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Acevedo",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Those numbers are comparatively small, but significant: Every day, the permitting system stops dangerous folks -- like convicted domestic abusers and people with severe mental health problems who pose a threat to themselves or others -- from carrying guns in public.",
    "Lawmakers loudly profess their unwavering support for the men and women in blue, but the moment law enforcement urges them to stand up to the gun lobby and reject permitless carry, those same lawmakers suddenly get really, really quiet.",
    "One thing law enforcement officers cannot do, however, is fight crime and violence with one hand tied behind our backs, which is what \"permitless carry\" laws being introduced around the country require us to do.",
    "People who apply for a gun permit in states mandating one might be required to take some sort of firearm safety course including a number of hours at a shooting range to show they know how to use it.",
    "Recent moves to loosen guns laws also defy reason: Studies show weakening the concealed carry permitting system resulted in increased gun violence, and put officers and the public at risk.",
    "In Ohio last year, for instance, 2,668 requests for concealed carry licenses were denied and 420 licenses were revoked because of felony convictions and other disqualifying factors.",
    "In return, lawmakers owe them respect by listening to their views and passing gun safety laws to help police officers do their jobs and keep them and the American people safe.",
    "The gun lobby wants you to think the permitting system hinders law-abiding gun owners, but a 2019 poll by PBS News Hour, NPR and Marist found 72% of Americans support permits.",
    "If we can impose strict laws to regulate the use of firearms for hunting, surely we can do the same to keep firearms in the hands of law-abiding Americans of sound mind.",
    "Acevedo has been active in the national debate over police reform and public safety, including his call for a national standard on the use of force by police officers.",
    "Law enforcement is on the front lines of the nation's gun violence crisis and is being asked every day to put their lives on the line to protect our communities.",
    "As a former police chief with 35 years in law enforcement, my answer is we can reform the nation's police departments and combat violent crime at the same time.",
    "According to research by Everytown, states with weaker gun laws -- especially those not requiring concealed carry permits -- have higher rates of gun violence.",
    "Every time politicians pass another permitless carry bill and weaken our gun safety laws, they make the work of our police officers harder and more dangerous.",
    "In most states which do not require background checks for all gun sales, the permitting system is possibly the only vetting a person will ever go through.",
    "I say all this not only as someone who has spent decades in law enforcement, but as one who also spent most of my adult life as a registered Republican.",
    "Studies have shown gun permits make it less likely these potentially deadly weapons end up in the hands of people who are likely to hurt or kill others.",
    "It would protect the lives of our children, women, families, extended communities and the men and women in uniform who serve the American people.",
    "Without permitting laws, officers have no way to distinguish between a law-abiding gun owner and someone seeking to wreak havoc in a community.",
    "Most states require a permit to carry a concealed handgun in the United States, according to Everytown.org, an anti-gun violence group.",
    "In the era of mass shootings and a gun violence epidemic, permitless carry only makes the difficult challenges officers face harder.",
    "Meanwhile, far from putting an undue burden on lawful gun owners, the numbers show very few suffer an adverse impact from licensing.",
    "Requiring a gun permit also ensures the people who want to carry them on their person are sufficiently mentally stable to do so.",
    "It's just a fraction of the total 202,920 concealed carry licenses issued to responsible, law-abiding gun owners in the state.",
    "He served as police chief in Austin, Houston and Miami, during a career in law enforcement spanning three and a half decades.",
    "Kay Ivey signed a permitless carry measure, while Georgia's legislature earlier this month passed a similar bill, which Gov.",
    "Greg Abbott signed a permitless carry law in August of last year, over the vehement objections of law enforcement officers.",
    "But there are now some two dozen states with permitless carry on the books, and more are joining their ranks all the time.",
    "I heard back-and-forth on this often in my home state of Texas, while serving as chief of police in Houston and Austin.",
    "I've always felt we can adopt common sense gun safety laws while respecting the gun rights of law-abiding Americans.",
    "Lawmakers also debate whether embracing gun rights precludes enacting common sense gun safety legislation.",
    "With permitless carry, anyone wishing to carry a firearm essentially can do so with no questions asked.",
    "(CNN)Politicians spend a lot of time arguing about police reform and how best to combat violent crime.",
    "Police departments across the country have been urging state lawmakers to oppose permitless carry.",
    "Simply put, it causes confusion for police officers in dynamic, stressful and deadly situations.",
    "They might also be expected to show they know how to disassemble and safely store a firearm.",
    "Permits are one of law enforcement's most valuable tools in the fight against gun violence.",
    "Permitless carry makes the complex job of policing even more dangerous than it already is.",
    "Last year, six states enacted permitless carry laws, according to the Pew Research Center.",
    "Nebraska also appears to be on the cusp of instituting a permitless carry law.",
    "Almost no one thinks permitless carry a good idea except for the gun lobby.",
    "Permitless carry, however, could have the opposite effect.",
    "They have to make split-second decisions at every turn.",
    "The views expressed in this commentary are his own.",
    "Art Acevedo is a CNN law enforcement analyst.",
    "The two are not mutually exclusive.",
    "In my home state of Texas, Gov.",
    "Just last month, Alabama's Gov.",
    "Brian Kemp has vowed to sign.",
    "View more opinion on CNN."
  ]
}