{
  "id": 5273,
  "mediaId": 12,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "TSA catches record number of guns at Hartsfield-Jackson in first quarter",
  "image": "https://www.ajc.com/resizer/TtdgAoKbYpEO1KJ1Si_uM39pPqM=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/YQSREBDV42JUZUTO6P2QYFE2KI.JPG",
  "link": "https://www.ajc.com/news/atlanta-airport-blog/tsa-catches-record-number-of-guns-at-hartsfield-jackson-in-first-quarter/M74WAEPQVFAI7OMT6JKWLLDDVU/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Yamanouchi",
  "authorUrl": "https://www.ajc.com/staff/kelly-yamanouchi/",
  "termIds": [
    2095,
    244,
    533,
    2555,
    2722
  ],
  "sentences": [
    "Howell said nearly every gun discovery at security checkpoints results in a fine, which varies depending on whether the firearm was loaded, if ammunition is accessible, if there was an attempt to hide it or multiple offenses.",
    "A gun caught last year at Hartsfield-Jackson generated national attention when the firearm discharged at the main security checkpoint, causing frightened passengers to run from the terminal and disrupting flights.",
    "Airline passenger counts nationally are up so far in the first three months of this year compared to the same period in 2021, but they remain lower than in 2019, the year before the pandemic hobbled air travel.",
    "In addition to the large volume of passengers passing through the Atlanta airport, you also have a lot of gun owners here in the state,? Howell said, including people who carry as part of their daily routine.",
    "When a similar constitutional carry? law went into effect last year in Tennessee, gun discoveries at security checkpoints at Nashvilles airport soared more than 68% compared to 2019 and 2020.",
    "Transportation Security Administration officers caught 94 guns at Atlanta airport security checkpoints in the first three months of this year, setting a record for the first quarter.",
    "Travelers face federal civil penalties of up to $13,900 if they bring firearms in carry-on luggage to airport security checkpoints and risk being charged with a crime.",
    "TSA recommends passengers who want to travel with a gun check airline restrictions for traveling with a firearm and review firearm restrictions for their destination.",
    "Out of all of the guns detected at airport security checkpoints nationwide, one out of 11 is caught at the Atlanta airport, according to TSA spokesman Mark Howell.",
    "But several U.S. airports in large cities with heavier local traffic typically have more departing passengers who pass through security checkpoints than Atlanta.",
    "Hartsfield-Jackson International Airport has had the most guns caught at security checkpoints among any U.S. airport in each of the past six years.",
    "Brian Kemp is expected to soon sign legislation allowing Georgians to carry concealed handguns without first getting a license in the state.",
    "How to properly transport guns as checked baggage\nFirearms are prohibited in carry-on bags, but can be legally packed as checked luggage.",
    "To pack firearms in checked luggage, they must be unloaded, packed in a locked hard-sided case and declared to the airline.",
    "The man, Kenny Wells Jr., faces multiple charges, including possession of a firearm by a convicted felon, police said.",
    "Hartsfield-Jackson is among the worlds busiest airports when connecting passengers are counted.",
    "He said the average penalty is $2,000 for an unloaded firearm and $4,000 for a loaded firearm.",
    "Last year, Hartsfield-Jackson shattered previous annual records with 507 firearms detected.",
    "That compares to 89 guns detected in carry-on bags in the same period last year.",
    "He said thats more common in states with more permissive gun laws.",
    "And Atlanta hasnt even reached its peak travel seasons.",
    "So far, 2022 has started off with a bang.",
    "Gov."
  ]
}