{
  "id": 5285,
  "mediaId": 305,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Georgia Republicans Pass Bill To Allow State Police To Investigate Voter Fraud Claims",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/dd66ec81b7378c1b0ecc6e2873630588.jpg",
  "link": "https://www.theroot.com/georgia-republicans-pass-bill-to-allow-state-police-to-1848756663",
  "sentiment": "0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    1646,
    2095,
    2203,
    215,
    428,
    571,
    2661,
    2672
  ],
  "sentences": [
    "Executive director of the Georgia chapter of the watchdog group Common Cause, Aunna Dennis, says this is a waste of taxpayer money.?\nDennis said, If the Bureau is now entrusted with investigating anything that could create doubt about our elections  we suggest they start, first, by investigating those who have been profiting by creating such doubt.?\nSo many different groups and partisan extremists have been working to undermine confidence in Georgias elections,? Dennis said in a statement.",
    "This measure is almost similar to the Florida law proposed in March that created a 25-member staff, including 10 law enforcement officers, to investigate allegations of election-related crime.?\nGeorgia Bureau of Investigations (GBI) will now be able to initiate the inquiries and subpoena people independently.",
    "In January, former Senator and current Republican Gubernatorial candidate David Purdue called for an election police unit, to do what Brian Kemp has failed to do? to make Georgia elections the safest and securest.? Secretary of State Brad Raffensperger stated that voter fraud is not widespread in Georgia.",
    "State election workers pushed back on elements of an early version of the bill, which would have made rules about ballot handling and outside donations.",
    "NBC News reports that SB 441, or The Criminal Record Responsibility Act.? would give state authorities to investigate election crimes and voter fraud.",
    "The bill was also due to give the GBI jurisdiction over election crimes and voter fraud, but was later removed.",
    "After passing through the Georgia House and Senate along party lines, it now awaits a signature from Gov.",
    "Now Georgia Republicans are looking to take things further with a new bill passed on Monday.",
    "Brian Kemp from passing SB 202 or the Election Integrity Act? into law.",
    "That didnt stop Georgia Republicans and Gov.",
    "Kemp."
  ]
}