{
  "id": 5287,
  "mediaId": 98,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Residents of Southern states clear storm debris as more severe weather looms",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/4c3d670/2147483647/strip/true/crop/4032x3024+0+0/resize/840x630!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7c%2Fe1%2F9fd57455edfe6b232089a9d4dd68%2Fb48a583be96447c7bc17f80a1096bc8e",
  "link": "https://www.latimes.com/world-nation/story/2022-04-06/southern-residents-clear-storm-debris-as-more-severe-weather-looms",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2537,
    2798,
    2900,
    2934,
    4935,
    4956,
    5093
  ],
  "sentences": [
    "The atmosphere will be primed again for more severe storms as we go through Wednesday,? said Jared Guyer, a forecaster at the Storm Prediction Center in Norman, Okla.\nParts of Georgia, Alabama and Tennessee will be at greatest risk of severe weather.",
    "In Bryan County, Ga., officials were urging residents to halt any cleanup work by midafternoon Wednesday and take shelter for the night as new storms began forming in western Georgia and in parts of Alabama and Mississippi.",
    "As the storms moved into South Carolina late Tuesday, debate was delayed for nearly an hour in the South Carolina Legislature after the state House chamber was evacuated for a tornado warning for Columbia.",
    "National Weather Service forecasters planned to survey damage from several possible tornadoes in Georgia and South Carolina, but said that effort could be interrupted by more storms Wednesday.",
    "A motorists cellphone video taken in Bryan County showed a large funnel cloud crossing Interstate 16 as drivers braked and pulled to the side of the roadway about 30 miles west of Savannah.",
    "In southeastern Georgia, a woman was found dead Tuesday night amid the shredded wreckage of her mobile home in the unincorporated community of Ellabell, said Bryan County Coroner Bill Cox.",
    "More than 7,000 customers in Texas and more than 3,000 in Georgia remained without power Wednesday afternoon, according to PowerOutage.us, which tracks outages nationwide.",
    "In the Bryan County seat of Pembroke, large sections of the courthouse roof were torn off and the entryway to a government building was demolished by an apparent tornado.",
    "PEMBROKE, Ga. \nSoutherners were clearing trees from roads and buildings, but the threat of more severe weather Wednesday in Georgia was complicating recovery efforts.",
    "Soloman, 71, died when storm winds toppled a tree onto his home in Whitehouse, about 100 miles southeast of Dallas, Whitehouse Mayor James Wansley said.",
    "Lightning struck a flea market in the northern Alabama community of Laceys Spring, causing a fire that gutted the building, news outlets reported.",
    "Kemp said it was fortunate the twister did not stay on the ground very long, or the damage and loss of life would likely have been much worse.",
    "Tuesdays storms killed at least two people  one in Texas and another in Georgia  and left thousands of people without power across the South.",
    "Other storms caused damage to solar panels near Bowman and flipped vehicles and shopping carts in a Walmart parking lot in Manning.",
    "In Alabama, the weather service said it was sending survey teams to examine potential tornado damage in the Wetumpka area.",
    "Several people in nearby neighborhoods were injured as their homes were damaged, said Matthew Kent, a county spokesperson.",
    "Several tornadoes were expected across a large part of the South on Wednesday, the national Storm Prediction Center said.",
    "Tractors and other equipment were flipped and twisted on a number of farms in South Carolinas least populated county.",
    "In Mississippi, fallen trees and limbs closed a stretch of highway in Newton County for hours.",
    "Its like it exploded.?\nCox said the dead womans husband was taken to a hospital with injuries.",
    "Its nothing but a foundation with a water heater sitting there.?\nIn Texas, W.M.",
    "About a dozen homes were destroyed or heavily damaged in Allendale County, S.C.",
    "We walked through a house where theres no wood left on that house.",
    "Brian Kemp on Wednesday toured the destruction in Bryan County.",
    "It is literally total devastation for some homes,? Kemp said.",
    "It was just completely ripped to pieces,? Cox said Wednesday.",
    "Places where it did touch down, he said, got hit hard.",
    "Georgia Gov."
  ]
}