{
  "id": 5289,
  "mediaId": 21,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "MyPillow CEO Mike Lindell has been served with another defamation suit. This time, it's from a former Dominion employee he once accused of being a 'traitor to the United States of America.'",
  "image": "https://i.insider.com/61e76ee77c6a200018427d49?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/mypillow-ceo-mike-lindell-served-defamation-suit-eric-coomer-dominion-2022-4",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.businessinsider.com/author/cheryl-teh",
  "termIds": [
    2095
  ],
  "sentences": [
    "\"Despite Defendants' baseless claims of election fraud being disproven by credible authorities across political parties, they persist in their campaign to profit from the 'Big Lie' by destroying the lives of private individuals like Dr. Coomer,\" read the court filing.",
    "\"Eric Coomer, if I were you right now, instead of going over and making deals at Newsmax, if I were you, I'm turning myself in and turning in the whole operation,\" he said, \"so maybe, just maybe you get immunity and you only get to do, I dunno, ten to twenty years.\"",
    "Dominion noted in a January court filing that there is no \"realistic possibility\" of it settling its $1.3 billion lawsuit with Lindell, given the \"devastating harm\" he and Trump allies Rudy Giuliani and Sidney Powell caused the company.",
    "MyPillow CEO Mike Lindell has been served with another lawsuit  this time, from Eric Coomer, a former Dominion Voting Systems employee vilified by right-wing figures who Lindell once accused of being a national traitor.",
    "Lawyers for Coomer, Dominion's former director of product strategy and security, filed a court complaint against Lindell on April 4 to kick off a defamation case against the pillow CEO and his platform, Frank Speech.",
    "Coomer added that Lindell had posted \"numerous false statements, defamatory interviews, and other dishonest content\" maligning him on Frank Speech, along with \"a sales pitch for products from MyPillow.\"",
    "Coomer also said that Lindell made claims about him at the pillow CEO's cyber-symposium in August in Sioux Falls, South Dakota, where Lindell spent 72 hours pushing debunked voter-fraud claims.",
    "When asked about the lawsuit and the possibility of being sued by more individuals linked to Dominion, Lindell demurred and said that people like Coomer were \"trying to cancel (his) voice.\"",
    "The filing added that Coomer received \"frequent credible death threats,\" which they attributed to the \"unwarranted distrust\" inspired by what he said were Lindell's \"lies.\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "In September, Lindell appeared on Frank Speech and urged Coomer to surrender to the authorities for a reduced prison term of \"10 to 20 years.\"",
    "Lindell was served with the lawsuit on April 5 at a mini-rally he hosted in Denver, Colorado, on behalf of indicted clerk Tina Peters.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Coomer alleged that his reputation had been \"irreparably tarnished\" by Lindell and Frank Speech in the complaint.",
    "\"They have not acknowledged the harm they have caused, nor have they retracted any of their false statements.\"",
    "He is being sued by voting tech companies Dominion and Smartmatic for pushing baseless election claims.",
    "Insider found, however, that Lindell actually mentioned Coomer on the Frank Speech platform last year.",
    "You know what, I can say that, just like I can about Brian Kemp and Brad Raffensperger,\" Lindell said.",
    "Manuel Balce Ceneta/AP Photo\nMyPillow CEO Mike Lindell has been served with another defamation suit.",
    "It's unclear what Lindell was referring to here, as Coomer is not facing any criminal indictments.",
    "MyPillow CEO Mike Lindell is being sued by former Dominion Voting Systems employee Eric Coomer.",
    "He was sued by former Dominion employee Eric Coomer, who he once accused of being a \"traitor.\"",
    "Coomer is suing Lindell and Lindell's Frank Speech platform for \"destroying\" his life.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Coomer has, separately, sued the Trump campaign and its allies for defamation.",
    "I don't even know if I've ever mentioned Eric Coomer,\" Lindell told Insider.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"They're trying to cancel Frank Speech, your favorite show!\"",
    "Lindell is currently facing a number of other lawsuits.",
    "You are a traitor to the United States of America.",
    "\"MyPillow and Frank Speech didn't do nothing.",
    "Stay up to date with what you want to know.",
    "\"You're disgusting and you are treasonous.",
    "Sign up for notifications from Insider!",
    "\"These are things I have evidence of.",
    "Loading Something is loading.",
    "The evidence is there.",
    "It's sitting there.\""
  ]
}