{
  "id": 5290,
  "mediaId": 136,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Watch: Twisters Slamming Georgia, South Carolina Captured on Video",
  "image": "https://d.newsweek.com/en/full/2015381/tornado-videos-south-carolina-georgia-severe-weather.webp?w=790&f=43e78e7104b2d367b8551ceb7165ff43",
  "link": "https://www.newsweek.com/watch-twisters-slamming-georgia-south-carolina-captured-video-1695354",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    2095
  ],
  "sentences": [
    "\"We will continue to do everything we can to support all impacted by today's severe weather and the emergency personnel who are responding to the needs and damage on the ground,\" Georgia Governor Brian Kemp tweeted in response to a tornado video from Andrew Gorton, a meteorologist for CBS affiliate WTOC.",
    "Also on Tuesday afternoon, Twitter user @myahcowart shared a video that showed what appeared to be a very close encounter with a twister in Ellabell, Georgia, alongside the comment \"not my stepdad standing in the middle of a tornado in ellabell???\"",
    "Cory Smith, a meteorologist for South Carolina CBS affiliate WLTX, tweeted photos of an overturned car in a Walmart parking lot a short time later, commenting that the photos show possible \"tornado damage near Manning from earlier this evening.\"",
    "In addition to the twisters reported in Georgia and South Carolina, the National Weather Service office in Jackson, Mississippi, confirmed that four tornadoes rated EF-1 had touched down in the state on Tuesday morning.",
    "Bill Cox, coroner for Georgia's Bryan County, confirmed that at least one person in Pembrokeroughly eight miles west of Ellabellhad been killed as a result of the storm, according to Fox affiliate WTGS.",
    "On Tuesday, severe weather including tornadoes, thunderstorms and flash flooding blanketed a large portion of the Southeast, potentially affecting millions of people who live in the path of the storms.",
    "https://t.co/aVBgaChRxf\n Governor Brian P. Kemp (@GovKemp) April 6, 2022\nThe storms came as parts of Texas were recovering from flooding and power outages caused by severe thunderstorms.",
    "We will continue to do everything we can to support all impacted by todays severe weather and the emergency personnel who are responding to the needs and damage on the ground.",
    "An unprecedented wave of tornadoes struck six Southern states in December, resulting in nearly 100 deaths, hundreds more injuries and billions of dollars in property damage.",
    "A video posted to Facebook by Brannon Deal and later shared to Twitter by user @ChadBlue83 shows a large tornado touching down from a distance in South Carolina.",
    "By Tuesday night, there had been at least 33 reports of tornadoes stretching from Mississippi to South Carolina, according to the National Weather Service.",
    "Viral videos of the storms in Texas, showing overturned vehicles including a semi-truck, were shared to social media on Monday.",
    "Twister videos shot in the two states were shared to social media as severe weather battered the region on Tuesday afternoon.",
    "\"What you're seeing is a tornado in Allendale, South Carolina,\" a narrator says in Deal's 32-second video.",
    "\"We've watched it build around us ... Lord help the ones that are in the path of that tornado right now.\"",
    "Last week, a tornado touched down in Florida's Panhandle, killing two people and injuring several others.",
    "The video appears to show the twister approaching a house as a narrator says, \"not good\" and \"crazy.\"",
    "Dramatic videos shared online appear to show tornadoes touching down in South Carolina and Georgia.",
    "The tornado eventually appears to strike the house directly, tearing off a portion of the roof.",
    "Twisters were also reported in Arkansas, Alabama, Louisiana and Mississippi.",
    "Newsweek reached out to the National Weather Service for comment.",
    "The South has recently suffered repeated bouts of severe weather.",
    "\"Quiet and mild conditions\" were expected in the evening.",
    "Manning is about 90 miles northeast of Allendale."
  ]
}