{
  "id": 5291,
  "mediaId": 43,
  "date": "d2022-04-06T00:00",
  "headline": "Georgia prisons demanding DOJ sign nondisclosure before they hand over documents for investigation",
  "image": "https://images.dailykos.com/images/1056355/story_image/GettyImages-125713095.jpg?1649257803",
  "link": "https://www.dailykos.com/story/2022/4/6/2090395/-Georgia-is-refusing-to-allow-the-DOJ-to-investigate-allegations-of-violence-in-the-state-s-prisons",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    2095,
    4411,
    501,
    550,
    3316,
    2672,
    2722
  ],
  "sentences": [
    " In the interim, GDC cannot and will not forfeit the safety and security of our staff and offenders.?\nOn Sept. 14, 2021, the DOJ announced its official investigation into the Georgia prisons in order to explore whether Georgia provides prisoners reasonable protection from physical harm at the hands of other prisoners,? and whether Georgia provides lesbian, gay, bisexual, transgender, and intersex prisoners reasonable protection from sexual abuse by other prisoners and by staff.?\nAccording to The Georgia Voice, the DOJ began an investigation based on the case of Ashley Diamond, a transgender woman.",
    " Our aging prison facility infrastructure was not intended to house the level of offender who resides there today, and it requires higher levels staffing and facility maintenance to manage these dangerous environments.?\nCriminal justice activists argue that Kemps $600 million would be better spent on improving mental health facilities and educational programs as a preventative measure to being incarcerated, The Current reports.",
    "RELATED STORY: Inmates filing lawsuit after medical staff gave them ivermectin for COVID, said it was vitamins\nIn addition to not allowing DOJ access inside any of the states prisons or to speak with inmates or staff, the AJC reports, the DOJ also alleges that thus far, the GDC has given them only an incomplete set of policies? amounting to a fraction of those requested,? and blank form documents,? the filing reads.",
    "In a January budget report, Kemp wrote: As our judicial system has focused on providing rehabilitative support in the community where appropriate for low-level, nonviolent offenders to avoid recidivism, our state prison population has become filled with increasingly violent offenders.",
    "Transgender inmates like Ashley have a right to be kept safe and to receive medically necessary treatment, including hormones.?\nThe frightening thing is that the GDC is also declining to offer documentation on the homicide rates inside the states prisons.",
    "28, the Department of Justice (DOJ) filed a petition against the state demanding that the Georgia Department of Corrections (GDC) comply with a subpoena and hand over documents related to an investigation into a slew of alleged issues.",
    "In 2015, the Southern Poverty Law Center (SPLC) filed a suit on Diamonds behalf alleging that the GDC denied her doctor-prescribed hormone medication while she was imprisoned and that shed been sexually assaulted by several inmates.",
    "Ultimately, the GDC and its attorneys are claiming that the DOJ hasnt laid out a framework for why it's investigating the prisons, and that the NDA is vital because privacy is at the center of inmates' health records.",
    "Georgia has long had a problem with its prison systemeverything from brutal sexual abuse and assault on LGBTQ inmates, to unchecked gang violence, to the deaths of incarcerated people at the hands of fellow prisoners.",
    "In a press release at the time, Chinyere Ezie, a staff attorney for SPLC, wrote:\nAshley Diamond was not sentenced to sexual assault and a gender change when she was imprisoned for a parole violation.",
    "But The Atlanta Journal-Constitution (AJC) reports that the GDC is refusing, citing the need for the DOJ to sign a nondisclosure agreement (NDA) in order to maintain the safety of staff and inmates.",
    "In an email sent to the AJC, GDC spokesperson Joan Heath wrote:\nGDC will provide DOJ with the requested information once the DOJ agrees to take the appropriate precautions with these documents.",
    "An officer with the Georgia Department of Corrections is seen at the entrance of the Georgia Diagnostic and Classification Prison in Jackson, Georgia.",
    " Tragically, the state of Georgia is forcing Ashley to transition from female to male by denying her the protection and medical care she needs.",
    "AJC reported last month that at least 57 inmates were murdered while imprisoned in Georgia, with 29 deaths in 2020 and 28 in 2021.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Brian Kemp is pushing to allocate $600 million to begin building two new prisons in exchange for closing four others.",
    "Georgia boasts one of the largest prison systems? in the nation, with nearly 53,000 inmates.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Meanwhile, according to The Current, Georgia Gov.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "On Mar."
  ]
}