{
  "id": 5316,
  "mediaId": 558,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Stacey Abrams now a millionaire as she aims to take governor's office",
  "image": "https://s.yimg.com/ny/api/res/1.2/WnM0DUFjWdLTwaH0kyZVmA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/3dO5tY8aRsqjt1pbn834IQ--~B/aD03MjA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/fox_news_text_979/69df7d74bf200ba3f93093f09e437e67",
  "link": "https://news.yahoo.com/stacey-abrams-now-millionaire-she-165440746.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "And because I had three years where I was in the private sector, I leveraged all three years, and in that time, Ive done my best to not only be successful personally, but to do what I can to help Georgians.\"",
    "The $975,000 property she bought outside Atlanta is financed by a $760,000 mortgage, and she bought her parents a $370,000 house in suburban Atlanta in 2019.",
    "During a rally in Georgia in March, former President Donald Trump knocked her for living in \"gorgeous multi-multi-million-dollar houses.\"",
    "Now, as she launches her second bid for the office, the voting rights activist says criticism of her current status is ironic.",
    "She was paid more than $700,000 over a three-year period as executive director of the Southern Economic Advancement Project.",
    "\"It is remarkable to me that success is now being demonized by the Republicans,\" she told The Associated Press.",
    "That figure is compared to a net worth of $109,000 when she first ran for Georgia governor four years ago.",
    "Abrams said she did not pay the self-employment taxes on time because her parents needed financial help.",
    "The Democrat reports that she is worth $3.17 million, according to state disclosures filed in March.",
    "Then-gubernatorial candidate Brian Kemp criticized Abrams in 2018 for owing $54,000 to the IRS.",
    "Abrams, who released a book last year, also reports investments in a number of companies.",
    "I believe that every person should have the opportunity to thrive.",
    "Abrams has not purchased a home for a price exceeding $1 million.",
    "She also paid off student loans and credit card debt in 2019.",
    "You cant delay cancer treatments,\" Abrams said at the time.",
    "Kemp defeated Abrams in the general election.",
    "Stacey Abrams says she is now a millionaire.",
    "\"You can delay IRS payments.",
    "\"I believe in success."
  ]
}