{
  "id": 5337,
  "mediaId": 12,
  "date": "4/4/2022 12:00:00 AM",
  "headline": "Gov. Kemp to sign Georgias mental health bill Monday",
  "image": "https://www.ajc.com/resizer/sOtGJl0fP3SamsnA4THOGdROpGg=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/GIQ4MUU35AMKME5TZGUCHT237M.jpg",
  "link": "https://www.ajc.com/politics/gov-kemp-to-sign-georgias-mental-heath-bill-monday/IOGFGVQ5R5F23MHK3RM4J5XNBM/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maya T. Prabhu",
  "authorUrl": "https://www.ajc.com/staff/maya-t-prabhu/",
  "termIds": [
    1178,
    2095,
    2672,
    4988
  ],
  "sentences": [
    "Under the new law, set to go into effect July 1, the state would enforce a federal law that requires parity? in health coverage, forgive student loans for mental health providers who work in underserved areas of the state and take other steps to improve care.",
    "Georgia ranks low nationally on most measurements of mental health treatment and high in the percentage of residents who face challenges, according to a 2021 report by Mental Health America, a century-old nonprofit advocacy group.",
    "Public health insurers, such as Medicare and Medicaid, and private insurers will have to file reports on parity to the commissioners of the Department of Public Health and Department of Insurance, respectively.",
    "The federal government in 2008 enacted a law that aimed to require parity  meaning insurance companies were to cover mental health care the same way they do for physical health care.",
    "State agencies would have to create grant programs for outpatient treatment and accountability courts that would serve mental health patients and those with substance abuse issues.",
    "The measure is the result of recommendations from the Georgia Behavioral Health Reform and Innovation Commission, which developed more than 50 suggestions to change Georgias laws.",
    "The American Academy of Child and Adolescent Psychiatry says Georgia has only eight psychiatrists per 100,000 children; the academy suggests a better ratio is 47 per 100,000.",
    "The issue was a priority of House Speaker David Ralston, a Blue Ridge Republican, saying it one of the most important bills lawmakers would vote on in their careers.",
    "They said the bill would require private insurance companies to cover treatments that go against the religious beliefs held by business owners.",
    "As passed, the bill would require all insurance companies who offer mental health coverage to cover it the same way physical health is covered.",
    "Wrapping up: Georgia Legislature 2022\nThe last day of the 2022 Georgia Legislature, adjournment Sine Die, is scheduled for Monday April 4.",
    "Passage of the bill was delayed by concerns from conservative groups and voters who said it would protect pedophiles from prosecution.",
    "HB 1013 seeks to increase the number of mental health professionals in Georgia and improve mental health data and transparency.",
    "Data has not been collected in Georgia to determine whether that is happening, but anecdotal evidence has shown it is not.",
    "After weeks of meetings, revisions and compromises, the Legislature on Wednesday unanimously approved House Bill 1013.",
    "Brian Kemp is set to sign a bill that aims to increase access to mental health and substance abuse care.",
    "It also empowers the insurance and public health commissioners to enforce the 2008 federal law.",
    "Follow the AJC coverage on Twitter via @AJCGaPolitics and on Facebook at AJC Georgia Politics",
    "Bill sponsors denied the legislation did those things, but they still made changes.",
    "It put Georgia last for the number of mental health professionals per capita.",
    "Less than a week after the General Assembly approved the legislation, Gov.",
    "The bill signing is scheduled for 1:30 p.m. at the Georgia Capitol."
  ]
}