{
  "id": 5355,
  "mediaId": 12,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Georgia Legislature approves Juneteenth holiday for state employees",
  "image": "https://www.ajc.com/resizer/si8w8X_5-VqA3WnSt4FX_eTPcSo=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/M5XOEYVYHCGSL25HU7V53HHQKM.JPG",
  "link": "https://www.ajc.com/politics/georgia-legislature-approves-juneteenth-holiday-for-state-employees/UOGAWXG2KFBN7EOIGULCRMG4JU/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maya T. Prabhu",
  "authorUrl": "https://www.ajc.com/staff/maya-t-prabhu/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Officially, Juneteenth National Independence Day  which normally falls on June 19  recognizes the day in 1865 when some slaves in Galveston, Texas, first learned they were free, despite the Emancipation Proclamation ending slavery in the Confederate states two years prior.",
    "Kemp asked Smyre, who is retiring after serving 48 years in the state House, to carry the legislation as one of his last pieces of legislation on the governors behalf.",
    "With its passage, and Kemps expected signature, the governor is allowed to expand the number of paid state holidays observed by Georgia employees from 12 to 13.",
    "The bill updates state law to stay in line with the federal government, which designated Juneteenth as a holiday last year.",
    "Brian Kemp placed the day on the calendar of state holidays in December, the Legislature had to approve House Bill 1335.",
    "The Georgia Senate on Friday gave final approval to a bill that makes Juneteenth a paid day off for Georgia employees.",
    "HB 1335 would also recognize the week that includes Sept. 11 of each year as Public Safety Week? in Georgia.",
    "Smyre also sponsored the legislation that established Martin Luther King Jr. Day as a state holiday in 1984.",
    "The holiday was approved by Congress earlier this year and signed into law by President Joe Biden.",
    "Because the holiday will fall on a Sunday in 2022, Georgia will observe Juneteenth on June 20.",
    "HB 1335, sponsored by retiring state Rep. Calvin Smyre, D-Columbus, passed the Senate 49-1.",
    "Since then, several metro Atlanta cities have made Juneteenth an official or paid holiday.",
    "State Sen. Carden Summers, R-Cordele, was the only senator to vote against the measure.",
    "His confirmation process is expected to resume later this year.",
    "President Joe Biden has nominated Smyre to serve as the U.S.",
    "The bill now goes to the Kemp for his signature.",
    "Ambassador to the Dominican Republic.",
    "Even though Gov."
  ]
}