{
  "id": 5357,
  "mediaId": 12,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "MUST Hope House: Expanded Marietta homeless shelter to open this spring",
  "image": "https://www.ajc.com/resizer/kD64zbCI8Lk7YPaUNPAehwUxzJo=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/6UHV52MPNBH5DHA6FVIIRSYMK4.jpg",
  "link": "https://www.ajc.com/news/atlanta-news/must-hope-house-expanded-marietta-homeless-shelter-to-open-this-spring/7HNEH7WJHBBZFDTA6PVYH2UM6Y/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Eason",
  "authorUrl": "https://www.ajc.com/staff/brian-eason/",
  "termIds": [
    696,
    2095,
    4572,
    428,
    3344,
    2555,
    2672,
    2778
  ],
  "sentences": [
    "The need for affordable housing and temporary shelter has increased substantially over the last few years, as rising housing costs have collided with the coronavirus pandemic and drug and mental health problems to displace thousands of residents across metro Atlanta from their homes.",
    "Funded mostly through private donations, the 136-bed Hope House at 1297 Bells Ferry Road will eventually replace the nearby Elizabeth Inn, whose 72 short-term shelter beds are typically filled to capacity.",
    "MUST Ministries will open a 44,000-square foot shelter in May that could eventually allow the Marietta-based nonprofit to house about twice as many homeless residents.",
    "This year, the ministry expects to serve around 60,000 people, about double the 30,000 clients it had in 2019, said Katy Ruth Camp, a spokeswoman for the ministry.",
    "Before the pandemic, the group spent about $5,000 a month to house people temporarily in hotels, said Dwight Ike? Reighard, the groups president and CEO.",
    "The facility will also have workforce development services, a computer lab and showers available even to those who arent staying there.",
    "In addition to bed space, the two-story shelter has a dining hall, a playground and learning center for children, and a medical clinic.",
    "The Christian charitable ministry held an open house Friday attended by community leaders and top political officials, including Gov.",
    "At last official count before the pandemic, there were more than 10,000 homeless people in Georgia.",
    "It will have 10 separate dormitories for families, up from just three at the current shelter.",
    "MUST has seen demand for its services rise substantially since the pandemic hit.",
    "Camp said the ministry planned to begin moving people to the new shelter in May.",
    "The groups spending on temporary housing has risen even more dramatically.",
    "But housing experts believe the true number to be much higher today.",
    "The event capped a five-year effort to make the facility a reality.",
    "This facility is needed now more than ever,? Gov.",
    "Brian Kemp, a Republican, said at the event.",
    "Roy Barnes and Cobb Chairwoman Lisa Cupid.",
    "Today, it spends $40,000 a month.",
    "Brian Kemp, former Gov."
  ]
}