{
  "id": 5358,
  "mediaId": 12,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Georgia Senate gives final approval to permit-less carry gun bill",
  "image": "https://ajc.com/pf/resources/logos/AJC/placeholder.jpg?d=472",
  "link": "https://www.ajc.com/politics/georgia-state-legislature/georgia-senate-gives-final-approval-to-permit-less-carry-gun-bill/NWATEZOGZZDZTES7N6UHE3ADV4/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Wickert",
  "authorUrl": "https://www.ajc.com/staff/david-wickert/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Democratic Party of Georgia spokesman Max Flugrath said Kemps approval of the bill would ignore law enforcements warnings that it would put officers in greater danger  all in an effort to gain the support of special interests and extremists? as Kemp seeks reelection.",
    "This is a great day for gun owners, as fully half of the states in America will have restored the constitutional right to bear arms without government infringement or taxation on that right,? said Dudley Brown, president of the National Association for Gun Rights.",
    "Those who could not carry a concealed weapon include people who have prior drug convictions, have been convicted of a felony or are facing felony charges, or have been treated for mental health issues or substance abuse issues within the past five years.",
    "The House voted 96-64 to require prosecutors to charge someone who already was convicted of a felony and later was arrested with multiple firearms to be charged with a separate offense for each weapon.",
    "The proliferation of weapons without safeguards is what makes our streets dangerous and causes so much bloodshed,? Sen. Elena Parent, D-Atlanta, said during a debate Friday.",
    "The Georgia Senate on Friday gave final approval to a bill that would let Georgians carry a concealed handgun without getting a license from the state.",
    "Guns would still be prohibited in the secured areas of airports, government buildings that have security at the entrance and other secured areas.",
    "The state would still issue concealed-carry permits to allow Georgians to take advantage of gun carry reciprocity? with other states.",
    "Senate Bill 319 would allow Georgians to carry a concealed handgun everywhere license holders currently are allowed to carry them.",
    "Brian Kemp, who has said he supported passing legislation to allow handguns to be carried without a permit.",
    "Such agreements allow gun owners to carry concealed handguns in states that offer the same permissions.",
    "Critics say dispensing with the licensing process will loosen restrictions that help prevent crimes.",
    "Under the bill, only those who are legally allowed to carry a gun could carry a concealed handgun.",
    "The General Assembly also sent another firearms measure, Senate Bill 479, to Kemp on Friday.",
    "Lets stop blaming an inanimate object,? said Sen. Randy Robertson, R-Cataula.",
    "Supporters say the right to bear arms is guaranteed by the U.S. Constitution.",
    "They say people, not guns, are responsible for rising crime.",
    "The measure quickly drew praise and condemnation.",
    "SB 319 passed by a vote of 34-22.",
    "The measure now goes to Gov."
  ]
}