{
  "id": 5360,
  "mediaId": 12,
  "date": "d2022-04-01T19:00",
  "headline": "Georgia Senate approves bill to limit classroom race discussions",
  "image": "https://www.ajc.com/resizer/1tJ_x5VvKj1FmQl3v0UiZv_L_oU=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/LRLOHZ2OC6CI7TYNTZFBCBNTVI.jpg",
  "link": "https://www.ajc.com/education/georgia-senate-approves-bill-to-limit-classroom-race-discussions/63H2O6BUPRH5LOAY27HCDHY4AY/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ty Tagami",
  "authorUrl": "https://www.ajc.com/staff/ty-tagami/",
  "termIds": [
    2040,
    2095,
    4408,
    232,
    562,
    571,
    2671,
    2672,
    2945
  ],
  "sentences": [
    "We dont want to continue to push the conversation back and make the next generation have to deal with it.?\nKemp said during his State of the State address in January that he would work with lawmakers to stop the divisive ideology? of critical race theory in schools.",
    "The prohibited concepts involve generalizations, like saying one race is inherently superior, moral character is racially determined, a person is responsible for past actions by others of the same race or America is fundamentally racist.",
    "Maurice Brewton, who teaches U.S. history in a Clayton County high school, thinks the legislation betrays a fear among white conservatives about a reckoning with Americas brutal history of slavery and racism.",
    "We can teach U.S. history, the good, the bad and the ugly, without dividing children along racial lines,? Senate President Pro Tem Butch Miller, R-Gainesville, said before the 32-21 party line vote.",
    "This legislation is an attack on Georgia students and teachers, and government censorship of the worst kind,? Max Flugrath, spokesman for the Democratic Party of Georgia, said in a news release.",
    "I have talked personally to several teachers who said theyre going to either move or quit if these bills pass,? she said after delivering the petitions two weeks ago.",
    "HB 1084 was sponsored by Rep. Will Wade, R-Dawsonville, who used to be a Dawson County school board member and a president of the Georgia School Boards Association.",
    "They were copied almost line for line from a September 2020 executive order by then-President Donald Trump banning them from federal worker training.",
    "The debates in legislative hearings and on chamber floors have elicited partisan rancor followed by votes that fell mostly along party lines.",
    "The state House already passed House Bill 1084, which now returns to that chamber for final approval after small changes in the Senate.",
    "Even so, Republicans have crusaded against it, introducing legislation or taking other steps in dozens of states, according to reports.",
    "I believe that there is a path for us to end racism in America.?\nSo far, the legislation has attracted protest rather than unity.",
    "The Georgia Senate approved controversial legislation Friday that bans certain ways of talking about race in K-12 classrooms.",
    "The academic theory is taught in college courses to explore the influence of racism on institutions and society.",
    "It is about building unity? and shielding students from the political fringes, he said at a hearing on Monday.",
    "We must teach patriotism and that America is good, though not perfect, that America is good,? he said.",
    "His legislation would establish a process allowing parents to have their complaints heard.",
    "Students and teachers have traveled to the Capitol for rallies and marches in opposition.",
    "?Its time for us to be able to have these uncomfortable conversations candidly,? he said.",
    "Decatur teacher Amelia Copp gave lawmakers copies of a petition against the legislation.",
    "Many of the bills, like HB 1084, target nine concepts considered divisive.",
    "Georgia school districts say it isnt taught in K-12 classrooms.",
    "If approved, the bill would go to Gov.",
    "Brian Kemp to be signed into law.",
    "Wade has high hopes for his bill.",
    "More than 1,300 have signed it."
  ]
}