{
  "id": 5363,
  "mediaId": 12,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Georgia lawmakers pass parents bill of rights advocated by Kemp",
  "image": "https://www.ajc.com/resizer/GUZuQlo_lnugbR0eOpBKi1TIxyY=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/AMSSNWC36X6VR4NS5GYEADT2GA.jpg",
  "link": "https://www.ajc.com/education/georgia-lawmakers-pass-parents-bill-of-rights-advocated-by-kemp/HN4WLWDRHJGBVOMAFGV2HNWRBM/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ty Tagami",
  "authorUrl": "https://www.ajc.com/staff/ty-tagami/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Melissa Jackson, state president of the group No Left Turn in Education, said supplemental materials are the crux of our problem.? She said in an interview that most recent parental complaints shes heard were about rogue teachers bringing in supplemental resources.?",
    "The legislation, introduced by Kemp ally Rep. Josh Bonner, R-Peachtree City, guarantees access to classroom instructional materials.?\nThat is curriculum defined by the Georgia Board of Education or approved by a local school board.",
    "It does not go into what we would refer to as supplemental materials.?\nHe gave an example of what wouldnt be covered: a video clip of Russias invasion of Ukraine.",
    "Georgia lawmakers on Friday approved legislation that says parents have a right to see the curriculum used in their childs classroom.",
    "Non-approved content, such as news articles, websites and other reference material teachers give students, isnt covered by the bill.",
    "This is essentially the curriculum thats being taught,? Bonner explained at a committee hearing in February.",
    "Kemp said during his State of the State address in January that he would back a parental rights bill.",
    "He didnt want to make teachers spend time documenting their use of such non-approved material.",
    "Groups that have come to the Capitol to lobby for parent rights were disappointed by that.",
    "It is not meant to put any additional burden on our teachers,? Bonner said.",
    "Such materials are already subject to public review under state law.",
    "House Bill 1178  the Parents Bill of Rights?  now goes to Gov.",
    "Brian Kemp for his signature after the 31-22 party line vote."
  ]
}