{
  "id": 5366,
  "mediaId": 12,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "The Jolt: See Sonny Perdues resume for his new $524,000 job as chancellor",
  "image": "https://www.ajc.com/resizer/REP1X6TkK_JLjykRnbY7bzu2Fjk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/JJ4A3GX7ENDONJ4JSBQNGYEWQA.JPG",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-see-sonny-perdues-resume-for-his-new-524000-job-as-chancellor/3UFZ6EZK4ZA2JLO4CRFE5ABVRM/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    973,
    1884,
    2095,
    3826,
    4067,
    220,
    513,
    2672
  ],
  "sentences": [
    "Under public service,? he notes that he defeated the incumbent, despite being outspent $20 million to $3 million.?\nAlso under public service, he includes the fact that he led the Georgia Republican Party out of decades in the minority,? and says his term as chair of the Republican Governors Association from 2006 to 2007 led to the election of now 33 Republican governors.?\nRepublicans held 22 governors offices after the 2006 elections and 21 governors mansions after the 2008 elections.",
    "Perdue takes over at the top of the university system just as schools at every level have become a flashpoint for hot-button political debates from transgender sports to curriculum content to discussions of race and so-called divisive topics.?\nIts now his job to navigate those choppy waters for students, faculty and other stakeholders in a way that makes Georgias higher education system stronger in the end.",
    "The Daily Mail of London, which typically covers scandals, Royals, and other high-traffic topics, wrote about it under the headline, House Democrats unite to pass $35-a-month cap on insulin as vote puts pressure on Republicans senators to approve bill ahead of midterms.?\nThe U.S. Senate has now confirmed a second federal judge to serve in the Atlanta-based district court.",
    "When I was initially approached to measure my interest, I simply said that I wanted the University System of Georgia to secure the best Chancellor available.?\nAfter summarizing his experience with the System during his two terms as governor and with the Hope Scholarship as a state lawmaker, Perdue writes that he simply wants the best chancellor possible for the system.",
    "Since its Friday, we always like to send you into the week with a little light reading, including:\nJamie DuPrees Washington Insider column Thursday, Georgia at the tip of the spear?;\nFridays Political Insider column, A legislative session for Brian Kemp to take to the bank.?\nAs always, Jolt readers are some of our favorite tipsters.",
    "If thats him, I commit with all my being to never cause you to regret that decision.?\nStatement of Interest If you are like most people, I imagine you have mused to yourself or openly to others, why does Sonny Perdue want this job?? That a valid and important question, to which I gladly respond.",
    "You can even tell your smart speaker to play Politically Georgia podcast.?\nWeve uncovered audio of Republican Senate candidate Herschel Walkers speech to a private closed-door fundraiser in Texas earlier this month where he makes broad statements about climate change.",
    "We found part of the answer yesterday when Perdues job application and resume for the job were posted publicly, the results of an open records request from self-described citizen journalist? Brian Bannon and first spotted by Abraham Kenmore of the Augusta Chronicle.",
    "With that confluence of commitment, not only was Georgia able to attract the best and brightest students from inside the state, it had the commensurate effect of attracting the best and brightest students and professors from outside of Georgia, just like a magnet.",
    "CNN recently fact-checked Trumps remark:\nHowever, despite Trumps claim, the 20th annual State of the Air report, supported by the American Lung Association, found that pollution in the US has gotten measurably worse over the last three years.",
    "Working with Chancellor Stephen Portch as he laid out his strategic vision for what the USG could become, coupled with the new found lottery resources, and dedicated support from the Governor, was indeed a special time in Georgia.",
    "A super PAC focused on helping Democrats retain control of the U.S. House has reserved $2.6 million of ad space in three media markets to boost Rep. Sanford Bishops re-election campaign, the New York Times reports.",
    "Its Day 39 at the Georgia General Assembly, The last days of the 40-day session always provide a crush of bills you didnt expect to pass make it across the finish line, while once sure-fire measures hit the skids.",
    "That was a personally selfish answer, since with fourteen grandchildren who all live in Georgia, my desire is for all of them to have an opportunity for a world class higher education right here in Georgia.",
    "In the meantime, we break down all the latest from the Legislature on this weeks Politically Georgia podcast, with the best Capitol reporters in the state, namely the AJCs Mark Niesse and Maya Prabhu.",
    "I truly believe that this educational renaissance, together with the 1996 Olympics, placed Georgia on a trajectory, both educationally and economically, that continues to serve us well even today.",
    "In fact, Mary and I, as well as all four of our children, have each benefited from the diverse and varied educational opportunities that our USG provides from Valdosta to Kennesaw to Athens.",
    "Governor Miller recognized intuitively that a world class higher education system would be the key to attracting world class companies and jobs for these newly trained Hope scholars.",
    "Though many state Democrats assailed the decision, it became a rallying cry for Republicans, who said fearmongering from critics of the law deprived metro Atlanta of a premier event.",
    "Perdues resume offers other insights into his background, including his two years as a practicing veterinarian, and into how he frames his own experience in government and politics.",
    "Sonny Perdue officially takes over as the Chancellor of the University System of Georgia today, starting the $524,000-per-year job after a contentious, year-long effort by Gov.",
    "Several GOP officials delivered an invoice for Stacey Abrams to the headquarters of the Democratic Party of Georgia for revenue lost? as a result of the leagues decision.",
    "While I am keenly interested in serving as your next Chancellor, I cannot say that I pursued or wanted this job,? he wrote to the members of the State Board of Regents.",
    "Perdue has been mostly mum about what he plans to do in the powerful post overseeing the state of Georgias colleges and universities, or even why he sought it at all.",
    "Along with the commitment of the Governor and Lt Governor, it was an exciting ride to see Georgia propelled into the national spotlight of public higher education.",
    "In endorsement news:\nThe Collective PAC, a national group focused on supporting Black candidates for office, endorsed Michael Owens for Georgia Secretary of State.",
    "We have some of the cleanest climate in the world, we have some of the cleanest air and water in the world, and were talking about climate change?? Walker said.",
    "When I was initially approached to measure my interest, I simply said that I wanted the University System of Georgia to secure the best Chancellor available.",
    "In concert with Governor Miller, the legislature began crafting one of the most innovative higher education programs in the country, the HOPE Scholarship.",
    "Georgia Republicans pulled a publicity stunt to mark the one-year anniversary of Major League Baseballs decision to yank the All-Star game from Atlanta.",
    "The legislation championed by Georgia U.S. Sen. Raphael Warnock and U.S. Rep. Lucy McBath passed with 12 Republicans joining Democrats in the majority.",
    "The bill now heads to the Senate where members are working to reach an agreement on language that can garner bipartisan support and avoid a filibuster.",
    "We are proud that the oldest two are graduating this year from two of our wonderful universities, Georgia Southern and University of North Georgia.",
    "Bishop, D-Albany, is Georgias only frontline Democrat, meaning he is running in a competitive district and will receive extra help from the party.",
    "It was a thrill to work alongside Governor Miller and the Regents as they recruited former Chancellor Stephen Portch from Wisconsin to Georgia.",
    "It is my deeply held opinion that as public higher education goes in Georgia, so follows the state and its people shortly thereafter.",
    "Two Republicans, Lindsey Graham of South Carolina and Susan Collins of Maine, joined Democrats in voting to confirm her on Thursday.",
    "The AJCs James Salzer writes that the tax credit language was removed from a bill that otherwise focused on cutting income taxes.",
    "He already has several GOP challengers in his district, which was redrawn by the Republicans last year to be more conservative.",
    "Hes echoing a line pushed by former President Donald Trump, his political patron, that the U.S. need not worry about pollution.",
    "Already the state Senate has backed off of a proposal to severely curtail the tax credits enjoyed by the film and TV industry.",
    "The buy is part of House Majority PAC $102 million ad campaign in 51 media markets ahead of this Novembers midterm elections.",
    "Major League Baseball yanked the game in April in protest of a new Georgia election law that imposes restrictions on voting.",
    "House Rules meets at 9:00, Senate Rules meets at 12:00 p.m.;\n10:00 am: The House convenes;\n10:00 a.m.: The Senate gavels in.",
    "In Perdues cover letter to become the chancellor, he wrote that applying for the role was not his idea in the first place.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "The House Republican Caucus Trust held a fundraiser Thursday at the Piedmont Driving Club featuring former New Jersey Gov.",
    "The U.S. House on Thursday signed off on a bill capping insulin costs at $35 a month for patients with private insurance.",
    "Georgias delegation split strictly along party lines with all six Democrats in favor and all eight Republicans opposed.",
    "The passage of this legislation propelled Georgia on a rocket ship trajectory to national prominence and reputation.",
    "In January of 1993, Lt Governor Pierre Howard asked me to chair the higher education committee in the State Senate.",
    "While I am keenly interested in serving as your next Chancellor, I cannot say that I pursued or wanted? this job.",
    "Sarah Geraghty previously worked as a civil rights attorney with the Southern Center for Human Rights in Atlanta.",
    "But it is well known that remaining at the peak is even more challenging than that first ascent to the pinnacle.",
    "Earlier this month, the Senate also confirmed federal public defender Victoria Calvert for a similar position.",
    "Listen and subscribe to the podcast for free at Apple Podcasts, Spotify, Google Podcasts, or Stitcher.",
    "The group is also backing Christian Wise Smith in his race for Georgia Attorney General.",
    "Keep an eye on this bill for its potential to generate positive publicity for Democrats.",
    "The year Governor Zell Miller was elected was the year I entered the State Senate.",
    "The revised legislation was approved by the Senate Rules Committee on Thursday.",
    "Well have a full rundown of whats passed and whats left in the Jolt on Monday.",
    "Now, she will join the bench in the U.S. District Court for Northern Georgia.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "We also get the view from the campaign trail with David Perdue this week.",
    "UNDER THE GOLD DOME, Friday, April 1:\n8:30 a.m.: Committee work begins.",
    "Georgians will also accept an apology in lieu of payment,? it added.",
    "Brian Kemp also attended the event, which drew a large crowd.",
    "Brian Kemp to position him to get it.",
    "Chris Christie.",
    "Were told Gov."
  ]
}