{
  "id": 5378,
  "mediaId": 1576,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Pay raise arrives for Georgia state employees, teachers",
  "image": "https://www.wabe.org/app/uploads/2021/11/Scottweb2-336x189.jpg",
  "link": "https://www.wabe.org/pay-raise-arrives-for-georgia-state-employees-teachers/",
  "sentiment": "0.0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "For both teachers and other state employees, bonuses are supposed to be converted into regular pay raises beginning July 1, under the 2023 state budget that lawmakers are scheduled to finish by Monday.",
    "The more than $800 million in additional compensation was pushed into the amended budget for the remaining three months of the state budget year by Republican Gov.",
    "However, they wont be getting the $3,750 bonus, because senators said paying a bonus to elected and a handful of appointed officials is illegal under state law.",
    "The 177,000-student Gwinnett County school district, Georgias largest, announced Thursday that it would pay the one-time salary supplement at the end of April.",
    "Teachers and other K-12 workers are supposed to get their payments by June 30, but some districts are using local money to send out the bonus more quickly.",
    "Each state and university employee will get an additional $1,250 over the last three months of the budget year, plus a bonus of up to $3,750.",
    "Teachers and other school employees are getting less than state employees because lawmakers earlier granted them a $3,000 pay raise.",
    "The remaining $2,000 will complete the $5,000 raise that Kemp promised to teachers when he was running for governor in 2018.",
    "That district, like some others, said it would pay the bonus to all of its employees, even those not covered by the state.",
    "Among those getting pay raises are all the states elected officials including the 56 state senators and 180 House members.",
    "They sought to frontload a pay raise so cash will reach employees pockets quickly in an election year.",
    "For the 100,000 state and university employees, its the first day that a $5,000 pay raise kicks in.",
    "Kemp spokesperson Katie Byrd said state agencies hope to hand out the bonuses by the end of April.",
    "Friday is payday, of a sort, for 270,000 state, public university and K-12 employees in Georgia.",
    "Meanwhile, for the 170,000 K-12 employees, a $2,000 bonus is on the way before June 30.",
    "The pay increases will begin when state employees get their next paycheck in mid-April.",
    "Employees hired since July 1 will get a smaller, prorated amount.",
    "Brian Kemp and lawmakers."
  ]
}