{
  "id": 5384,
  "mediaId": 12,
  "date": "d2022-03-31T15:00",
  "headline": "Fulton County Schools faces surge in student disciplinary issues",
  "image": "https://www.ajc.com/resizer/daU1bHvPULquuQiNg6MU_PFD_CA=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/3FZHL55Y52NDKHQUNNY46ZRWZM.JPG",
  "link": "https://www.ajc.com/education/fulton-county-schools-faces-surge-in-student-disciplinary-issues/UKGFYYW6MVFWFIVABVEEEFZAB4/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vanessa McCray",
  "authorUrl": "https://www.ajc.com/staff/vanessa-mccray/",
  "termIds": [
    2095,
    501,
    3589,
    4989,
    4990,
    5149
  ],
  "sentences": [
    "Preventions in Place\nContracted for 10 additional security workers to monitor cameras and buildings for remainder of this school year\nUpgraded video surveillance equipment\nInstalled a tip line reporting icon on staff and student devices\nElevated group fighting to the most serious tier of offenses, punishable by out-of-school suspension or further actions\nExpanded positive behavior intervention and supports in schools\nTeach success skills to all students\nPreventions Under Consideration\nHire more social workers next school year\nAdd safe centers to provide student supports at North Springs and Tri-Cities high schools\nExtend the school police officer calendar by 10 days so that officers work 200 days a year\nDevelop therapeutic plan for elementary school students who show violent behaviors\nImprove security lighting on campuses\nStrengthen mentoring programs",
    "The sessions push students to delve into facts not feelings,? said Carmena Woods, an administrative assistant who works with the program: ?Our ultimate goal is to keep them in school.?\nThe district plans to open safe centers? next fall at Tri-Cities and North Springs high schools.",
    "It involves law-and-order minded strategies that are in place or under consideration such as upgrading video surveillance equipment and lighting, paying school police to work more days, filing criminal charges and setting strict standards for behavior.",
    "Were not proud of the fact that we have to expel students, and so thats why as a school district were leaning into what proactive measures we can take on the front end to prevent some of those incidents from happening,? said Superintendent Mike Looney.",
    "?Kids really have struggled through this pandemic, and I dont know if we understood the full scale of those impacts until they returned to us full-time this year,? said Chris Matthews, assistant superintendent of student services.",
    "The DeKalb district said it could not provide current school year discipline data because it is still being collected and verified.?\nFulton started sounding the alarm at school board meetings soon after classes started.",
    "Students are bringing more weapons to campus compared to recent years and brawling in hallways and cafeterias, said leaders of the states fourth-largest district, which enrolls about 90,000 students.",
    "So we have to be the ones who want to improve our schools.?\nFinding solutions\nThe security response is part of what Fulton leaders say is a two-pronged approach to addressing disciplinary problems.",
    "The districts actions thus far are a start,? she said, but theres more that can be done.?\nHartwell, the Westlake mother and PTA council president, said law enforcement measures arent enough.",
    "Were just having difficulty with the interaction we havent seen in the past,? said Kim Hartwell, president of the South Fulton PTA Council and mother of a Westlake High School student.",
    "But Ingraham, who previously served as the districts director of student discipline, said how students behave is often a manifestation of something else happening in their lives.",
    "At Tri-Cities, students flagged as high-risk because theyve had a physical altercation or other problems participate in restorative circles led by a conflict-resolution expert.",
    "That number already surpasses expulsion totals for each of the previous four school years, and is more than double the number expelled the year before the pandemic started.",
    "With very little exception, it has been (that) theres issues in the community.?\nLooney said hes concerned about not just the number but the severity of student misconduct.",
    "The district expelled 158 students in nearly six months this school year, according to data obtained by The Atlanta Journal-Constitution through an open-records request.",
    "That means hiring more social workers and counselors, setting high expectations and making sure students see themselves in the curriculum? so theyre engaged in class.",
    "The centers are designed to provide students with services and community resourcesneeded to succeed in school, such as clothing, mentoring and work-based learning.",
    "Vincent Edmonds has three children in Fulton schools and leads the parent teacher student association at Bear Creek Middle School, where he has a seventh grader.",
    "Since then, the district added 10 more security workers, at a cost of $157,200, to monitor cameras and supervise exits, stairwells and other campus spots.",
    "During a recent session, Jacqueline Beard-Cathey guided several girls through a discussion of how to calm down when emotions cloud their judgment.",
    "More adults are needed to model good behavior and supervise chaotic cafeterias and hallways in between classes, when students sometimes scuffle.",
    "Brian Kemp, superintendents asked for help as their schools respond to social media challenges urging bad behavior, student suicides and fights.",
    "After one major fight in August involving about 10 students, school police officers recovered two handguns, according to police reports.",
    "From August through early February, Fulton schools reported 17 incidents involving a handgun, more than any of the previous four years.",
    "When they returned to schoolhouses in August, students had to relearn routines and figure out how to resolve conflicts in healthy ways.",
    "In Henry County Schools, the superintendent has said discipline incidents are down this year but those that do occur are more intense.",
    "School safety\nMany school districts are confronting student safety issues, which some say reflects a rise in violent crime in cities.",
    "Most campus weapons and fights can be traced to situations that started outside of school the previous night or weekend, Looney said.",
    "In September, a student at Centennial High School in Roswell was stabbed and sent to the hospital with non-life-threatening injuries.",
    "Fulton County Schools is cracking down on discipline and ramping up prevention efforts in response to a rise in behavioral problems.",
    "Fights involving three or more students now fall into the highest tier of offenses, making group fighting punishable by expulsion.",
    "Strategies to address misconduct\nFulton County Schools identified a number of strategies to address student misconduct and safety.",
    "The district closed school buildings in March of 2020, and many students remained in virtual learning during the 2021 year.",
    "Some violations are so serious that suspension or expulsion is warranted, said Deana Holiday Ingraham, mayor of East Point.",
    "She said it also will require engaged parents and community members and attention to childrens social and emotional health.",
    "Two of the three alternative schools that serve expelled students are full, while the third is nearing capacity, he said.",
    "The first year of high school is always challenging as students develop social skills and test boundaries, Looney said.",
    "The additional personnel are assigned to five south Fulton high schools that have had three or more group fights.",
    "Depending on the specifics of the melee, it also can lead to criminal charges, as do weapons cases, Looney said.",
    "They found a loaded .38-caliber handgun, with one bullet in the chamber and one in the magazine, in a bookbag.",
    "Leaders said theyre also supporting students social and emotional needs to prevent incidents from occurring.",
    "Gwinnett officials reported in January that numbers are similar to pre-pandemic levels, but remain too high.",
    "Banneker already has a center, which provides counseling, discipline support and necessities such as food.",
    "But this years freshman class also spent much of their formative middle school years in virtual learning.",
    "The district, which contracts with an outside provider to run those sites, is looking to add more seats.",
    "The district reported more than 3,000 fighting incidents in each of the two years prior to the pandemic.",
    "In January, two students were stabbed when a fight broke out at Banneker High School near Union City.",
    "Though shes heard about more group fights this year, she doesnt feel her son is in danger in school.",
    "A series of fights disrupted the first few weeks of classes at Tri-Cities High School in East Point.",
    "Reporter Cassidy Alexander and data specialist Jennifer Peebles contributed to this article.",
    "Nearly a third of the students expelled in the first part of this year were in ninth grade.",
    "It comes as students struggle to readjust to classrooms upended by the COVID-19 pandemic.",
    "She said schools need to make sustained financial investments to tackle the root cause.",
    "That includes building stronger school communities and rewarding positive behaviors.",
    "This pandemic has done something to all of us in general, adults and children alike.",
    "I dont think our parents understand that our presence is whats needed,? he said.",
    "Theres been 58 incidents in nearly six months, up from 54 for all of 2018-2019.",
    "Theyre bringing a gun to school for protection to and from school,? he said.",
    "Incidents involving knives and handguns reported by Fulton County Schools.",
    "He said more parent involvement, not extra security, is the answer.",
    "The 2022 data is from the start of this year through Feb. 1, 2022.",
    "I do trust that the administration has eyes on this,? she said.",
    "Looney also proposed hiring more social workers next year.",
    "Theyre not bringing the gun to school to do harm per se.",
    "In nearly six months this school year, it logged 2,052.",
    "When he volunteers in the lunchroom, students shape up.",
    "Students bringing knives to school is also a concern.",
    "Their ideas: Listen to music, talk to someone, write.",
    "Note: Only one handgun incident was reported in 2021.",
    "I dont have a problem with him going to class.",
    "Without us, nothing improves.",
    "In a recent meeting with Gov."
  ]
}