{
  "id": 5386,
  "mediaId": 12,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "The Jolt: For mental health overhaul, truth is a powerful force",
  "image": "https://www.ajc.com/resizer/4HREjEPGmmwX3RReAQmRes2PPL4=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/Z3HKH6JSJ7DEURAYTONSCW423U.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-for-mental-health-overhaul-truth-is-a-powerful-force/ID3K5D6NW5BNZGN2A3LDC2ME5M/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    2095
  ],
  "sentences": [
    ");\nSB 226, a bill that gives school principals 7 days to decide whether to remove books and other content seen as harmful to minors,? won final approval;\nThe state Senate passed House Bill 1146 to let state troopers put blue lights on the front or back of their cars instead of on top.",
    "I just think it deserves some real thoughtful consideration.?\nJudiciary Chairman Brian Strickland, R-McDonough, told the bills sponsor, state Rep. Scott Holcomb, D-Atlanta, that the panel wants to work with him in the year ahead after they spend more time reviewing it.",
    "Supporters would like to see it move this year, and that is being explored.?\nPOSTED: A measure intended to bring down the cost of insulin for people with diabetes by capping prices at $35 a month is headed to the U.S. House floor for a vote later today.",
    "And unlike most big-ticket efforts these days, the legislative effort was led by a Republican, state Rep. Todd Jones, and a Democrat, state Rep. Mary Margaret Oliver, who early on urged their colleagues to suggest changes as the process went on.",
    "Even though it was championed by House Speaker David Ralston and a coterie of powerful bipartisan leaders, the measure was targeted by a group of far-right advocates who rallied against it by spreading mistruths and misinformation.",
    "On the final vote, even the trio of House Republicans who initially opposed the bill  and, in some cases, egged on the backlash in the state Senate  ended up supporting the final version after some of their input was incorporated.",
    "They erroneously claimed the mental health legislation would amount to a vast government takeover and, in a callback to the dangerous QAnon conspiracy theory, bizarrely contended it would protect pedophiles from prosecution.",
    "Many worried that a House-Senate fight over the proposal would dominate the closing days of the session  and send a signal to Georgians that their politicians couldnt respond to one of the most important crises of our time.",
    "As Hallerman wrote earlier this month, critics say that Georgias current process for paying people who have been wrongfully convicted and later exonerated is slow, inconsistent and often political.",
    "The U.S. Senate late Wednesday confirmed Deborah Lipstadt, an Emory University professor, to serve as special envoy in the U.S. State Department with a mission to monitor and combat anti-Semitism.",
    "As the Walton County Tribune noted in its obituary, his familys farm was the home to an annual barbecue that drew hundreds of the GOP faithful  and the politicians who hoped to curry their favor.",
    "In a rare unanimous vote by both chambers, state legislators approved an overhaul that will make it easier for Georgians in crisis to access mental health services and substance abuse treatment.",
    "In case you missed it Wednesday:\nThe House passed Senate Bill 319, the so-called Constitutional Carry bill to let Georgians carry a concealed firearm or weapon without a permit.",
    "A tax proposal that popped up in the state Senate this week could stifle Georgias booming film and TV industry by putting limits on the tax credits used by production companies.",
    "Our colleague Tamar Hallerman sends word that HB 1354, the bill standardizing the way Georgia compensates the wrongfully imprisoned, appears to be stalled in the state Senate.",
    "We told you yesterday that we heard rumors the insulin bill might be added to this weeks agenda, and House Majority Leader Steny Hoyer made it official Wednesday afternoon.",
    "Key to the efforts success were the years of work that went into it behind the scenes, including a two-year study committee headed by former state Rep. Kevin Tanner.",
    "Our condolences to the family and friends of Roy Nunnally Roberts Sr., the longtime chairman of the Walton County Republican Party, who died Wednesday morning.",
    "Since most major studios shooting in Georgia are based in California or New York, the tax credits themselves have little direct value without this provision.",
    "We are reminded again today,? he said, that truth is a powerful force.?\nUNDER THE GOLD DOME, Thursday, March 31:\n9:00 a.m.: A full committee workday begins.",
    "Even with the bill stuck in committee, its possible similar language could find its way onto legislation moving through the Senate before Sine Die Monday.",
    "President Joe Biden nominated Geraghty to an empty seat on the U.S. District Court in Northern Georgia based on the recommendation of Georgia U.S. Sens.",
    "Were watching the Senate Rules Committee to see which bills will get the greenlight for consideration on the last two days of this legislative session.",
    "Geoff Duncan, his top aide Macy McFall and other Senate leaders that helped ensure the legislation didnt get derailed by the Upper Chamber as feared.",
    "The program helps law enforcement officers respond to calls involving people in mental health crisis with support from mental health professionals.",
    "Georgia U.S. Sen. Jon Ossoff, who is Jewish, delivered a rare floor speech to call for Lipstadts appointment to be brought to the Senate floor.",
    "But the studios are on notice that some Republican leaders are willing to curtail benefits to an industry often aligned with liberal politics.",
    "Lipstadt specializes in modern Jewish history and Holocaust studies at Emory and is the founding director of its Institute for Jewish Studies.",
    "It hit the skids Tuesday in the Senate Judiciary Committee after state Sen. John Kennedy, R-Macon, told the committee it needs more vetting.",
    "Im not advocating for doing nothing, but this is admittedly a very complex matter and maybe how were doing it today is not the best way.",
    "Both Georgia U.S. Sen. Raphael Warnock and U.S. Rep. Lucy McBath are heavily involved in pushing the issue in their respective chambers.",
    "Civil rights attorney Sarah Geraghty is expected to be confirmed later today to serve as a judge for the Atlanta-based federal court.",
    "It now goes back to the Senate for consideration;\nThe Senate passed* SB 403, a bill from state Sen. Ben Watson and pushed by Lt. Gov.",
    "He spoke about his great-grandparents who arrived in America in the early 1900s after fleeing anti-Semitism in eastern Europe.",
    "Because of the huge impact of the legislation and its late arrival, it is a longshot to become law this legislative session.",
    "But just days ago, the most significant bipartisan legislation of this years session seemed headed for a far different fate.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "Senators preparing to vote on the bill were inundated with emails from constituents and activists infused with the lies.",
    "Weeks of committee hearings led by state Rep. Sharon Cooper and, later, state Sen. Ben Watson dug into the fine print.",
    "The biggest question is how many Republicans will join Democrats in supporting a measure that is popular among voters.",
    "Ralston, who has called this the most important work of his career, praised the good-faith negotiations with Lt. Gov.",
    "It now to the House to agree or disagree (*an earlier version of the Jolt incorrectly said the bill passed the House.",
    "The bill would cap the credits at $900 million a year, where currently there is no limit, the AJCs Rodney Ho writes.",
    "Holcomb told Hallerman yesterday the bill has support from prosecutors, chiefs of police, and defense lawyers.",
    "But perhaps more impactful is the legislation would make these credits non-transferable to other parties.",
    "President Joe Biden appointed her to the role, which comes with a rank equal to that of an ambassador.",
    "A sweeping overhaul of the states mental health system will soon be signed into law by Gov.",
    "Also appointed with Geraghty was Victoria Calvert, who was confirmed earlier this month.",
    "For a few days, senior lawmakers worried the measure would be held up or hollowed out.",
    "Both have scheduled news conferences ahead of the vote to champion the legislation.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "I dont know that this is the best way,? Kennedy said, referring to the bill.",
    "The House and Senate stand adjourned until 10:00 a.m. Friday for Day 39.",
    "In the end, the years of legwork overcame the days of misinformation.",
    "Theres significant support and a lot of work went into it,? he said.",
    "Everyone from parents to caseworkers to sheriffs weighed in.",
    "Geoff Duncan, to create a statewide co-responder? program.",
    "As always, Jolt readers are some of our favorite tipsters.",
    "The bill cruised through the House earlier this month.",
    "He choked back tears as he celebrated its passage.",
    "The Georgia General Assembly proved otherwise.",
    "It passed 49 to 5, and now goes to Gov.",
    "She was confirmed by voice vote.",
    "Jon Ossoff and Raphael Warnock.",
    "Brian Kemp for his signature.",
    "About the Authors",
    "Brian Kemp."
  ]
}