{
  "id": 5391,
  "mediaId": 33,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Biden considera liberar 1 milln de barriles de petrleo por da de reservas estratgicas",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220331105642-oil-usa-biden-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/03/31/biden-considera-liberar-1-millon-barriles-petroleo-reservas-estrategicas-trax/",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Liptak",
  "authorUrl": "https://cnnespanol.cnn.com/author/kevin-liptak/",
  "termIds": [
    1394,
    2030,
    2087,
    2095,
    4199,
    2590,
    2772,
    2945
  ],
  "sentences": [
    "Aprovechar la reserva --600 millones de barriles de petrleo crudo almacenados en cavernas de sal subterrneas en Louisiana y Texas-- generalmente solo tiene un efecto limitado en los precios del gas debido a la cantidad de petrleo que se puede liberar a la vez, pero actuara como una seal poltica de que Biden contina enfrentando el problema.",
    "Y mientras la gobernadora demcrata Janet Mills enfrenta una campaa de reeleccin competitiva en Maine, ha propuesto algunos de los alivios ms generosos para los contribuyentes calificados en su estado, en forma de cheques de US$ 850, para amortiguar el golpe de la inflacin y los precios de la gasolina.",
    "En Georgia, el gobernador republicano Brian Kemp, quien enfrenta una de las carreras de reeleccin ms duras del pas, firm un proyecto de ley que otorgar reembolsos de impuestos de US$ 250 a $ 500 a los georgianos, una medida que varios de sus rivales criticaron como politiquera de ao electoral.",
    "La semana pasada, el gobernador demcrata de California, Gavin Newsom, present una propuesta de US$ 9.000 millones para entregar tarjetas de dbito de US$ 400 a los conductores en el estado para ayudar a suavizar el impacto de los precios ms altos de la gasolina en el pas.",
    "En comentarios a principios de este mes, Biden trat de atribuir la responsabilidad del aumento de los precios al presidente de Rusia: \"No se equivoquen: el aumento actual en los precios de la gasolina es en gran parte culpa de Vladimir Putin\".",
    "Un plan que se est considerando implica liberar alrededor de 1 milln de barriles por da de la Reserva Estratgica de Petrleo para los prximos meses, dice una persona familiarizada con las deliberaciones.",
    "Tambin liber alrededor de 60 millones de barriles en noviembre, lo que dijo que en ese momento era la mayor liberacin de la reserva en la historia de Estados Unidos.",
    "El anuncio podra llegar tan pronto como el jueves, cuando est previsto que Biden pronuncie comentarios desde la Casa Blanca sobre los precios de la gasolina.",
    "Biden anunci a principios de mes una liberacin coordinada de petrleo de las reservas junto con otras naciones.",
    "(CNN) -- El presidente Joe Biden est evaluando liberar una cantidad rcord de petrleo de las reservas de EE.UU.",
    "Luego de la invasin rusa de Ucrania, el precio de la gasolina regular en EE.UU.",
    "se dispar, alcanzando un rcord de US$ 4,33 por galn a principios de marzo.",
    "han intentado reducir los precios de la gasolina a nivel estatal.",
    "a medida que persisten los altos precios de la gasolina.",
    "Los gobernadores de EE.UU."
  ]
}