{
  "id": 5392,
  "mediaId": 238,
  "date": "d2022-03-31T00:00",
  "headline": "Opinion: Trumps lies are failing in Georgia. Thats good news for all of us.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/01/georgia-gop-primaries-trump-lies/",
  "sentiment": "-0.956",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1951,
    2095,
    2203,
    2279,
    2459,
    4066,
    428,
    2672,
    2845
  ],
  "sentences": [
    "But Perdues campaign promoted his lock him up? moment, the Atlanta Journal-Constitution reported, boosting the idea that Kemp should be imprisoned for disloyalty to Trump, in an effort to gain ground? against Kemp among Trump voters.",
    "But if it turns out theres little political payoff for campaigning on an open vow to treat future election results as illegitimate and nonbinding  well, that would certainly bode better for democracys future than the alternative.",
    "To take just one other bonkers example: the Associated Press reports that a GOP candidate for secretary of state in Ohio who previously acknowledged Trumps 2020 loss has now backflipped and declared the election stolen.",
    "True, liberals might argue that Kemp winning in Georgia  where the primary winner will face voting rights advocate Stacey Abrams in the general election  might be terrible for democracy in other ways.",
    "Its also fair to ask whether as governor Perdue would certify a fake slate of electors for Trump or an imitator in 2024, in defiance of the states popular vote, which could be counted by a GOP House.",
    "Nowhere is this more pressing than in Georgia, where Trump has staked a great deal on his endorsements of a slate of Trumpist candidates who are challenging establishment Republican incumbents.",
    "But something else is on the ballot, too: Whether running on a vow to subvert future election losses by any means necessary will be a political winner for Republicans going forward.",
    "He ran an ad featuring Trump, who intoned that Kemp had let us down.? That implicitly criticized Kemps refusal to steal the election for Trump, but without saying so directly.",
    "Indeed, as Josh Kraushaar reports, Perdue is trailing Kemp even though most GOP voters do know Trump endorsed him, a clear sign his 2020 lies may be falling flat.",
    "Thats because Kemp is still seen as conservative, due to things like his opposition to covid-19 mandates and his support for Georgias voter suppression law.",
    "It was actually ratified by numerous audits and recounts, but as Steve Benen notes, this was plainly necessary to keep Trump happy with Perdues candidacy.",
    "In a new report on the Georgia primaries, NPR finds that Republicans in the state have little confidence that Trumps candidate for governor will prevail.",
    "Were at a hinge point in our politics: In the coming weeks, we will get a clearer sense of the influence that Donald Trump wields over GOP primaries.",
    "Perdues argument basically amounts to pitching himself as more willing than Kemp to debase himself and corrupt our democracy for the Trumpist cause.",
    "Hes really running on an implicit willingness to do what Raffensperger would not, i.e., use his official powers to overturn a future loss.",
    "But Perdue lags behind Kemp in fundraising and polling,? reports NPR, and Georgia Republicans say Kemp appears likely to hang on.",
    "Republican voters appear to think Kemp delivered for them, despite refusing to irredeemably corrupt himself on Trumps behalf.",
    "Its reasonable to read this as an implicit vow not to certify a future loss on the basis of made-up voter fraud claims.",
    "Trumps candidates may be in trouble, and some observers are interpreting as a sign of his weakening hold on the GOP.",
    "Apparently because hes facing primary challengers who full-throatedly embrace that lie, and he needed to keep pace.",
    "Trump has endorsed Rep. Jody Hices (R-Ga.) primary challenge to Georgia Secretary of State Brad Raffensperger.",
    "On top of all this, Perdue has openly declared that he would not have certified Trumps 2020 loss, as Kemp did.",
    "If Perdue loses, it will be a comeuppance for one of the sleaziest political hustlers weve seen in some time.",
    "Trump endorsed Perdue for the express reason that Kemp refused to help Trump steal the 2020 election.",
    "Trump has endorsed former senator David Perdue, who is running a primary challenge to sitting Gov.",
    "He rebuffed Trumps pressure to literally manufacture votes out of thin air to reverse the outcome.",
    "But now Perdue is all in, declaring outright this week that the 2020 election was indeed stolen.",
    "A great deal is at stake in seeing candidates like these lose wherever possible.",
    "And yes, Kemp did sign one of the worst voter suppression bills in the country.",
    "Hice may still win, but this is proving much closer than observers expected.",
    "Hice, then, is not just a loyal devotee of Trumps lies about 2020.",
    "At first, Perdue kept this subtle, if thats the word for it.",
    "This sort of mania is unfolding in many other states.",
    "Trumps lies are not proving as potent here, either.",
    "Indeed, this is partly why Trump endorsed him!",
    "One of Raffenspergers chief transgressions?",
    "Perdue subsequently backtracked.",
    "But it gets even worse.",
    "Brian Kemp.",
    "Why?"
  ]
}