{
  "id": 5393,
  "mediaId": 33,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Biden anunci una liberacin histrica de reservas de petrleo y presiona a las compaas petroleras para que hagan su parte para reducir los precios de la gasolina",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220322122122-dinero-sot-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/03/31/biden-liberacion-historica-reservas-petroleo-reducir-precios-gasolina-trax/",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Liptak",
  "authorUrl": "https://cnnespanol.cnn.com/author/kevin-liptak/",
  "termIds": [
    2030,
    2087,
    2095,
    2945
  ],
  "sentences": [
    "Biden aborda un problema poltico importante\nAprovechar la reserva, la reserva de 600 millones de barriles de petrleo crudo almacenados en cavernas subterrneas de sal en Louisiana y Texas, generalmente solo tiene un efecto limitado en los precios del gas debido a la cantidad de petrleo que se puede liberar a la vez, pero actuara como una seal poltica de que Biden contina enfrentando el problema.",
    "Las empresas que estn produciendo a partir de sus acres arrendados y pozos existentes no enfrentarn aranceles ms altos?, dice la hoja informativa, pero las empresas que continan sentadas en acres que no producen tendrn que elegir si comienzan a producir o pagan un impuesto por cada pozo inactivo y acre no utilizado?.",
    "Y mientras, la gobernadora demcrata Janet Mills enfrenta una campaa de reeleccin competitiva en Maine, ha propuesto algunos de los alivios ms generosos para los contribuyentes calificados en su estado, en forma de cheques de US$ 850, para amortiguar el golpe de la inflacin y los precios de la gasolina.",
    "(CNN) -- El presidente de Estados Unidos, Joe Biden, anunci el jueves una liberacin sin precedentes de petrleo de las reservas estadounidenses y varias medidas para castigar a las compaas petroleras por no aumentar la produccin de arrendamientos no utilizados en tierras federales, dijo la Casa Blanca.",
    "En Georgia, el gobernador republicano Brian Kemp, que enfrenta una de las carreras de reeleccin ms duras del pas, firm un proyecto de ley que otorgar reembolsos de impuestos de US$ 250 a US$ 500 a los georgianos, una medida que varios de sus rivales criticaron como politiquera.",
    "La semana pasada, el gobernador demcrata de California, Gavin Newsom, present una propuesta de US$ 9.000 millones para entregar tarjetas de dbito de US$ 400 a los conductores del estado para ayudar a suavizar el impacto de los precios ms altos de la gasolina en el pas.",
    "Durante meses, la administracin de Biden ha rechazado pblicamente la idea de que las regulaciones estn impidiendo que los productores de petrleo produzcan ms en el pas, sealando millones de hectreas de tierra con permisos aprobados para la produccin de petrleo y gas.",
    "En comentarios a principios de este mes, Biden trat de atribuir la responsabilidad del aumento de los precios al presidente ruso: \"No se equivoquen: el aumento actual en los precios de la gasolina es en gran parte culpa de Vladimir Putin\".",
    "Ninguno de los dos movimientos tuvo un efecto significativo en los precios de la gasolina, que han seguido aumentando debido a que los lmites globales a las exportaciones de energa rusa han provocado que los precios se disparen.",
    "El presidente tambin pedir al Congreso que haga que las empresas paguen aranceles por los pozos de sus contratos de arrendamiento que no han utilizado en aos y por acres de tierras pblicas que estn acaparando sin producir?.",
    "La Casa Blanca ha expresado su frustracin porque las compaas petroleras no han devuelto su produccin a los niveles anteriores a la pandemia, centrndose en cambio en pagar dividendos a los inversores.",
    "En cambio, dijeron que su objetivo era abordar la falta de suministro debido a la salida del mercado del petrleo ruso, y agregaron que se traducira en un alivio para los consumidores estadounidenses.",
    "Las naciones [se estn] uniendo para negarle a Putin la capacidad de armar sus recursos energticos contra las familias estadounidenses y las democracias de todo el mundo?, dijo Biden.",
    "El paso dramtico, que Biden anunci desde la Casa Blanca, enfrenta lo que se ha convertido en un problema poltico inminente meses antes de las elecciones de mitad de perodo.",
    "Estados Unidos repondr barriles en la reserva cuando los precios del petrleo bajen, dijo el presidente, lo que podra ayudar a incentivar an ms la produccin en el futuro.",
    "Biden los ha reprendido en comentarios anteriores, pero algunos funcionarios creen que una campaa a todo pulmn contra las empresas podra resultar contraproducente.",
    "Tambin liber alrededor de 50 millones de barriles en noviembre, lo que dijo en ese momento fue la mayor liberacin de la reserva en la historia de Estados Unidos.",
    "Ha habido un debate interno entre los funcionarios de la administracin sobre la dureza de perseguir a las compaas de petrleo y gas por no aumentar la produccin.",
    "Sin embargo, los aumentos de costos actuales comenzaron hace meses, a medida que aumentaba la demanda de petrleo mientras disminua la pandemia de coronavirus.",
    "Tras la invasin rusa de Ucrania, el precio estadounidense de la gasolina regular se dispar, alcanzando un rcord de US$ 4,33 el galn a principios de marzo.",
    "Ninguna empresa estadounidense debera aprovechar una pandemia o las acciones de Vladimir Putin para enriquecerse a costa de las familias estadounidenses.",
    "Biden dijo que la segunda parte de su plan para abordar el aumento de los precios es crear la independencia energtica estadounidense a largo plazo.",
    "en el extranjero, incluso en Europa, aunque los funcionarios se negaron a decir si otros pases tambin estaban liberando barriles de sus reservas.",
    "Los pasos son un intento de reducir los precios de la gasolina y, al mismo tiempo, obligan a las compaas petroleras a aumentar el suministro.",
    "Y la conclusin es que si queremos precios ms bajos de la gasolina, necesitamos tener ms suministro de petrleo en este momento?, dijo Biden.",
    "El presidente agreg: \"Sus presupuestos familiares para llenar un tanque, nada de eso debera depender de si un dictador declara la guerra\".",
    "Estados Unidos consume alrededor de 20 millones de barriles de petrleo por da, y el consumo mundial ronda los 100 millones de barriles.",
    "An as, los funcionarios se negaron a decir qu tan rpido o cunto podran bajar los precios de la gasolina como resultado del comunicado.",
    "En ltima instancia, nosotros y el mundo entero necesitamos reducir por completo nuestra dependencia de los combustibles fsiles.",
    "El presidente dijo que actuara como un \"puente en tiempos de guerra\" a medida que la produccin de petrleo de EE.UU.",
    "El presidente advirti a las compaas petroleras que no se aprovecharan de la situacin para aumentar sus ganancias.",
    "Las liberaciones planificadas de Biden pondran ms petrleo en el mercado global, lo que podra reducir los costos.",
    "Biden anunci a principios de mes una liberacin coordinada de petrleo de las reservas junto con otras naciones.",
    "Y dijeron que no abordaran los \"movimientos de precios inmediatos a corto plazo\" en el mercado del petrolero.",
    "Necesitamos elegir la seguridad a largo plazo sobre la vulnerabilidad energtica y climtica?, dijo Biden.",
    "Nuestros precios estn aumentando debido a las acciones de [el presidente ruso, Vladimir] Putin.",
    "Juntos, nuestros esfuerzos combinados suministrarn ms de un milln de barriles por da.",
    "Invertir esas ganancias en produccin e innovacin, eso es lo que deberan hacer.",
    "La invasin rusa de Ucrania le ha proporcionado a Biden otro contraste.",
    "Ha repetido la frase \"la subida de precios de Putin\" desde entonces.",
    "han intentado reducir los precios de la gasolina a nivel estatal.",
    "La liberacin ascendera a 180 millones de barriles de petrleo.",
    "La decisin se tom en coordinacin con los aliados de EE.UU.",
    "y el mundo aumenta despus de la pandemia de coronavirus.",
    "Invierta en sus clientes?, dijo Biden.",
    "La independecia energtica de EE.UU.",
    "No hay suficiente suministro.",
    "Los gobernadores de EE.UU."
  ]
}