{
  "id": 5395,
  "mediaId": 33,
  "date": "d2022-03-31T00:00",
  "headline": "Biden announces historic oil reserve release and presses oil companies to do their part to reduce gas prices",
  "image": "https://www.cnn.com/media/sites/cnn/video-placeholder.svg",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vd3d3LmNubi5jb20vMjAyMi8wMy8zMC9wb2xpdGljcy9zdHJhdGVnaWMtcGV0cm9sZXVtLXJlc2VydmUtcmVsZWFzZS1vaWwtam9lLWJpZGVuL2luZGV4Lmh0bWzSAQA?oc=5/",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Liptak",
  "authorUrl": "https://www.cnn.com/profiles/kevin-liptak-profile",
  "termIds": [
    2030,
    2087,
    2095,
    2934,
    2945
  ],
  "sentences": [
    "Companies that are producing from their leased acres and existing wells will not face higher fees,? a fact sheet released by the White House reads, but companies that continue to sit on non-producing acres will have to choose whether to start producing or pay a fee for each idled well and unused acre.?\nBiden also will issue a directive to invoke the Defense Production Act to spur domestic production of critical minerals needed to manufacture batteries for electric vehicles and long-term energy storage.",
    "Biden tackles a major political problem\nTapping the reserve  the stockpile of 600 million barrels of crude oil stored in underground salt caverns in Louisiana and Texas  generally has only a limited effect on gas prices because of how much oil can be released at a time, but would act as a political sign that Biden is continuing to confront the problem.",
    "The move from the White House adds critical minerals such as lithium, nickel, graphite, cobalt and manganese to the list of items covered by the 1950 Defense Production Act, a Korean War-era law allowing the President to use emergency authority to make large orders of a certain type of product or expand productive capacity and supply.",
    "In remarks earlier this month, Biden sought to put the onus for the rising prices on the Russian President: Make no mistake: The current spike in gas prices is largely the fault of Vladimir Putin.? He has repeated the phrase Putins price hike? since then.",
    "For months, the Biden administration has publicly pushed back on the idea that regulations are holding oil producers back from more domestic production, pointing to millions of acres worth of land with approved permits for oil and gas production.",
    "CNN \nPresident Joe Biden on Thursday announced an unprecedented release of oil from US reserves and several steps his administration is taking to punish oil companies for not increasing production from unused leases on federal land.",
    "Janet Mills faces a competitive reelection campaign in Maine, she has proposed some of the most generous relief to qualified taxpayers in her state  in the form of $850 checks  to cushion the blow of inflation and gas prices.",
    "The President is also calling on Congress to make companies pay fees on wells from their leases that they havent used in years and on acres of public lands that they are hoarding without producing,? one official said.",
    "Brian Kemp  who is facing one of the toughest reelection races in the country  signed a bill that will give $250 to $500 tax refunds to Georgians  a move several of his rivals blasted as election-year politicking.",
    "The Department of Defense will implement this authority, according to the White House, and will do so in consultation with tribal communities and using strong environmental, labor, and community standards.",
    "The decision was made in coordination with US allies overseas, including in Europe, though officials declined to say whether other countries were also releasing barrels from their reserves.",
    "Instead, they said their goal was addressing a lack of supply due to Russian oil coming off the market, adding that it would translate into providing relief for American consumers.",
    "The White House has voiced frustration that oil companies have not returned their production to levels from before the pandemic, focusing instead on paying dividends for investors.",
    "Nations (are) coming together to deny Putin the ability to weaponize his energy resources against American families and families and democracies around the world,? Biden said.",
    "The President added: Your family budgets to fill a tank  none of it should hinge on whether a dictator declares war.?\nThe release would amount to 180 million barrels of oil.",
    "Gavin Newsom rolled out a $9 billion proposal to hand out $400 debit cards to drivers in the state to help soften the impact of the highest gas prices in the country.",
    "The dramatic step, which Biden announced from the White House, confronts what has become a looming political problem months ahead of the midterm elections.",
    "Neither move had a significant effect on gas prices, which have continued to rise as global limits on Russian energy exports have caused prices to spike.",
    "The US will restock barrels in the reserve when oil prices are lower, the President said, which could help further incentivize production going forward.",
    "There has been an internal debate among administration officials at how harshly to go after oil and gas companies for not ramping up production.",
    "No American company should take advantage of a pandemic or Vladimir Putins actions to enrich themselves at the expense of American families.",
    "It will allow the administration to support the production and processing of these critical minerals needed for a clean energy transition.",
    "He also released around 50 million barrels in November, which he said at the time was the largest release from the reserve in US history.",
    "Following Russias invasion of Ukraine, the US price of regular gasoline spiked, hitting a record high of $4.33 a gallon earlier in March.",
    "The President said the second part of his plan to address the rising prices is to create American energy independence in the long term.",
    "The President said it would act as a wartime bridge? as US and global oil production ramps back up after the coronavirus pandemic.",
    "The United States consumes around 20 million barrels of oil per day, with global consumption hovering around 100 million barrels.",
    "Biden has chided them in previous remarks, but some officials believe a full-throated campaign against the firms could backfire.",
    "CORRECTION: A previous version of this story incorrectly stated the release from the Strategic Petroleum Reserve last year.",
    "Biden earlier in the month announced a coordinated release of oil from the reserves in conjunction with other nations.",
    "Still, officials declined to say how quickly, or by how much, gas prices might come down as a result of the release.",
    "Yet the current cost increases began months ago, as demand for oil increased while the coronavirus pandemic waned.",
    "The steps are an attempt to reduce gas prices while also putting an onus on oil companies to increase supply.",
    "And the bottom line is if we want lower gas prices we need to have more oil supply right now,? Biden said.",
    "And they said they to address not focused on immediate short-term price movements? in the oil market.",
    "Bidens planned releases would put more oil on the global market, potentially bringing down costs.",
    "Ultimately, we and the whole world need to reduce our dependence on fossil fuels altogether.",
    "We need to choose long-term security over energy and climate vulnerability,? Biden said.",
    "The President warned oil companies against exploiting the situation to increase profits.",
    "Governors across the US have been attempting to curb gas prices at the state level.",
    "Investing those profits in production and innovation, thats what they should do.",
    "Together, our combined efforts will supply well over a million barrels a day.",
    "Our prices are rising because of (Russian President Vladimir) Putins actions.",
    "Russias invasion of Ukraine has provided Biden another foil.",
    "This story has been updated with background information.",
    "Invest in your customers,? Biden said.",
    "Last week, California Democratic Gov.",
    "In Georgia, Republican Gov.",
    "It was 50 million barrels.",
    "There isnt enough supply.",
    "And as Democratic Gov."
  ]
}