{
  "id": 5402,
  "mediaId": 12,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Bill passes to allow removal of blue lights from Georgia trooper cars",
  "image": "https://www.ajc.com/resizer/usH58jaEo0SNvhiAczDEDbWXwP4=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/A6L27QADHTDSOIHA67MPAPWILQ.jpg",
  "link": "https://www.ajc.com/politics/bill-passes-to-allow-removal-of-blue-lights-from-georgia-trooper-cars/UGFRXHBVENE7FO32SLHYYRR22Q/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Niesse",
  "authorUrl": "https://www.ajc.com/staff/mark-niesse/",
  "termIds": [
    2095,
    2295,
    231,
    2770
  ],
  "sentences": [
    "So why would we remove the lights on the top of the car so folks will not realize who theyre approaching??\nState Sen. John Albers said some new police vehicles already come with LED lights built in, eliminating the need for rooftop lights.",
    "LEDs are much better used than the traditional revolving and rotating light bars.?\nState law currently allows no more than two vehicles per Georgia State Patrol post without exterior roof lights.",
    "Supporters of House Bill 1146 said it gives the Georgia State Patrol flexibility with their car lighting, but critics worried that drivers wouldnt be able to identify police as easily.",
    "We recognize the State Patrol because of the blue bars sitting on the top of the car,? said state Sen. David Lucas, a Democrat from Macon who voted against the bill.",
    "The legislation allows state troopers to stop using rooftop lights on patrol cars, instead relying on lights displayed on the front, back or sides of vehicles.",
    "Flashing blue police lights atop Georgia State Patrol cars could be removed under a bill that passed the General Assembly with a final vote Wednesday.",
    "Brian Kemp following a 49-5 vote in the state Senate on Wednesday.",
    "This gives flexibility,? said Albers, a Republican from Roswell.",
    "The bill previously passed the state House.",
    "Were not removing the lights.",
    "The measure now heads to Gov."
  ]
}