{
  "id": 5403,
  "mediaId": 12,
  "date": "d2022-03-30T18:00",
  "headline": "A year later, Kemp touts success of states Crime Suppression Unit",
  "image": "https://www.ajc.com/resizer/Ei8SLfddw76kzV5LCZhnLG8iKIc=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/UM67CJXIVNDKROPQUHZTQUBCM4.jpg",
  "link": "https://www.ajc.com/news/crime/a-year-later-kemp-touts-success-of-states-crime-suppression-unit/JK2AEDCGZFAXZC7B6VFQGHNABQ/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shaddi Abusaid",
  "authorUrl": "https://www.ajc.com/staff/shaddi-abusaid/",
  "termIds": [
    2095,
    2555,
    2672
  ],
  "sentences": [
    "Brian Kemp said the states multi-agency Crime Suppression Unit was responsible for:\n- 23,600 traffic stops\n- 588 DUI stops\n-213 drug arrests\n-572 pursuits\n-Nearly 1,300 vehicle impounds\n-Nearly 16,000 citations\n-451 fugitive arrests, 26 of whom were murder suspects\n-The seizure of 342 stolen or missing weapons\n- The recovery of 312 stolen vehicles valued at nearly $6.5 million",
    "Flanked by GBI Director Vic Reynolds, Atlanta Police Chief Rodney Bryant, Fulton County Sheriff Patrick Labat and the heads of several state agencies, Kemp praised those involved for taking the fight to criminals.? He also touted the unit as an example of what can happen when law enforcement agencies combine resources and work together.",
    "Since its creation a year ago, Georgias Crime Suppression Unit has been responsible for more than 23,000 traffic stops, 213 drug arrests and the capture of more than 450 fugitives, 26 of whom were wanted on murder charges, Gov.",
    "Its unacceptable to the law enforcement organizations represented here today and its certainly unacceptable to the people that we serve.?\nSimilar operations are underway in other large cities, including Columbus and Macon.",
    "These brave officers are on the front lines of the fight against criminals and street gangs,? said Kemp, surrounded by dozens of officers, deputies, state troopers and wardens from the Department of Natural Resources.",
    "Department of Public Safety Commissioner Col. Chris Wright said the unit has also arrested nine major street racing organizers over the past year as officials continue efforts to crack down on dangerous driving.",
    "Speaking at Liberty Plaza outside the State Capitol, Kemp touted the work of the multi-agency unit he created in April 2021 to help reduce rising crime rates and curb street racing across the metro area.",
    "They dont pay attention to county lines.?\nFor Atlantas police chief, its nice being able to reach out to the sheriffs office or the state patrol if his department ever needs assistance.",
    "But in metro Atlanta alone, the multi-agency unit accounted for 588 DUI stops, 572 pursuits and the recovery of 342 stolen or missing weapons in its first year, the governor said.",
    "He credited the partnership with helping reduce crime across the city over the past year, calling it a force multiplier? that helps officers cover even more territory.",
    "The rise in crime that weve been facing in many communities across Georgia is unacceptable to me,? said Kemp, who is seeking a second term as governor this year.",
    "The unit  comprised of state troopers, local police and other Georgia law enforcement agencies  was formed last spring using $5 million in emergency funds.",
    "Reynolds said he has undercover GBI agents gathering information on the streets and reporting back to the agencys intelligence unit.",
    "Another 1,300 vehicles were impounded, and police seized more than 300 stolen cars and trucks valued at an estimated $6.5 million.",
    "Having a network of agencies working together is vital, Reynolds said, because bad actors dont pay attention to city limits.",
    "Thats what were seeing inside the city of Atlanta and throughout the region.?\nSince its creation in April 2021, Gov.",
    "1 responsibility of government? and praised the officers involved for going above and beyond? in the face of danger.",
    "We are stronger together and the results have helped make our capital city much safer,? he said.",
    "When you have this level of collaboration ... you cant help but see a reduction.? Bryant said.",
    "That information is then sent out to patrol officers in real time so they know where to be.",
    "And that was just in metro Atlanta.",
    "He called public safety the No.",
    "Brian Kemp announced Wednesday."
  ]
}