{
  "id": 5413,
  "mediaId": 43,
  "date": "d2022-03-30T00:00",
  "headline": "Hillary Clinton Is Back & She's Ready To Help Stacey Abrams (D) Become Governor",
  "image": "https://images.dailykos.com/images/1054223/story_image/ScreenShot2022-03-30at10.54.25PM.png?1648706084",
  "link": "https://www.dailykos.com/story/2022/3/30/2089217/-GA-Gov-Hillary-Clinton-Is-Back-She-s-Ready-To-Help-Stacey-Abrams-D-Become-Governor",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1158,
    1951,
    2095,
    4325,
    2672
  ],
  "sentences": [
    "Senator, Secretary of State and Presidential candidate, Hillary Rodham Clinton, in support of Stacey Abrams (D. GA) gubernatorial campaign:\n Stacey Abrams (D. GA)\nIn just a moment, Im going to ask you to dig deep and give whatever you can to help elect Stacey Abrams as the first Black woman governor in American history, but first let me explain why.",
    "In the last year, weve seen coordinated attacks on the legitimacy of our government, and meanwhile, Republicans all over the country  including Brian Kemp and David Perdue  are abandoning any concern for our future.",
    "Staceys got a true vision for the future of Georgia and shes the only candidate with bold new plans to ensure Georgians have access to good jobs, quality public schools, affordable child care and higher education.",
    "The people of Georgia sent the state's first Black and first Jewish senators to Washington last year, and now weve got an incredible shot to make even more history by electing Stacey in November.",
    "So Im asking: Will you donate $250 right now ahead of tomorrows midnight deadline to help make sure Staceys team has the resources they need to reach voters in every corner of the state?",
    "But its going to take every single member of this team to make her vision for One Georgia, where every Georgia family has the freedom and the opportunity to thrive, a reality.",
    "We have a tremendous opportunity to make our government better reflect our country by electing dynamic leaders like Stacey.",
    "Georgia is now a blue state and a crucial part of the Democratic firewall against this very extremism.",
    "This is a people-powered movement and weve seen what happens when we come together to make progress.",
    "I hope youll give what you can right now so this team can make the investments itll take to win.",
    "Thank you so much for standing with me in this essential fight for the future of our democracy.",
    "Trumps already paid Georgia a visit to attack Stacey and uphold his brand of bigotry.",
    "But theres hope: Stacey Abrams and all of us working together to fight back.",
    "Tomorrow, Staceys campaign has a major end-of-month fundraising deadline.",
    "Hillary Clinton\nReceived this e-mail today from former First Lady, U.S.",
    "And I know that this team has never shied away from tough fights.",
    "Hillary Clinton\nClick here to donate to Abrams campaign.",
    "We are and have always been stronger together.",
    "We cant afford to give up our momentum now."
  ]
}