{
  "id": 5415,
  "mediaId": 12,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Opinion: Part-time faculty at Georgia colleges deserve better pay",
  "image": "https://www.ajc.com/resizer/EjKoeJmG6QaBtAqiBvJu0M0UtVY=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/SLNBPVCM4VGUBANBQ3D55OHHDE.jpg",
  "link": "https://www.ajc.com/education/get-schooled-blog/opinion-part-time-faculty-at-georgia-colleges-deserve-better-pay/YOOKDEBHPBCAHA3YYDOZGH5OCI/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maureen Downey",
  "authorUrl": "https://www.ajc.com/staff/maureen-downey/",
  "termIds": [
    2095,
    2518,
    3846,
    598,
    3374,
    3627,
    2672,
    2778
  ],
  "sentences": [
    "The fallout led UCLA to explain the applicant could be paid by grants, saying: Some positions may be without salary when individuals are compensated by other sources.? However, last week, UCLA announced the position would be paid.",
    "We are some of the lowest-paid workers in the University System and, unlike many full-time, low-paid staff, we are not eligible for benefits, whether our actual hours meet the federal threshold or not.",
    "A 2020 American Federation of Teachers report, An Army of Temps,? found nearly 25% of adjunct faculty rely on public assistance and 40% have trouble covering basic household expenses.",
    "We were left out of the COVID-19 related bonus, even though we were on the front lines, too, making it possible for state institutions to keep their doors open during the pandemic.",
    "In talking with prospective parents over the years, I have found that the general public is in the dark about the faculty distinctions and inequities of higher education.",
    "An ad earlier this month for an assistant adjunct professor in UCLAs chemistry and biochemistry department listing no compensation? ignited a bonfire of criticisms.",
    "Part-time faculty members have endured many slaps in the face by the Board of Regents and USG, as well as whoever is sitting in the governors seat.",
    "I call on Kemp and newly appointed Chancellor Sonny Perdue to treat us with dignity and give part-time faculty a fair share of bonuses and rewards.",
    "In this guest column, Wichman addresses the status and salary of part-time college instructors in Georgia, an issue roiling campuses nationwide.",
    "Adjuncts anchor their institutions instructional work, yet so many are living hand to mouth,? said AFT President Randi Weingarten at the time.",
    "Most, if not all part-time faculty I know, work far more than 30 hours per week, even though we are discouraged from reporting our true time.",
    "Kemp has made yet another grand gesture, an amended budget item that will provide a $5,000 cost-of-living adjustment for state employees.",
    "During that time, I have won numerous awards and accolades from both colleagues and students because I love what I do, and it shows.",
    "Part-time faculty are treated as less than worthy even though our time and labor enable campuses to open their doors each semester.",
    "I fell instantly in love, so I continued to work my full-time, benefited job while teaching part time at night and on weekends.",
    "Soon after making the announcement, the Board of Regents confirmed the one-time bonus applied only to full-time USG employees.",
    "She founded the Part-Time Faculty Council, which represents part-timers across both the Kennesaw and Marietta campuses.",
    "Brian Kemp and the Legislature of a $1,000 bonus for state employees making less than $80,000 per year is another one.",
    "However, once again, the governor excluded part-time, non-benefited employees who work less than 30 hours per week.",
    "By Yvonne Wichman\nI did not go to college until I was 40, earning my bachelors degree at 45 and my masters at 50.",
    "Otherwise, the state would be forced to offer us health insurance coverage and other employee benefits.",
    "Finally, in 2005, I left the corporate world in order to devote my full efforts to the classroom.",
    "My service  and that of thousands of other part-time faculty  is neither recognized nor rewarded.",
    "Why do the governor, the Board of Regents and college administrators support this unfair system?",
    "The Board of Regents actions signaled that part-time faculty are not worthy of fair treatment.",
    "If you look at the salaries for KSUs part-time professors, many earn less than $20,000.",
    "Yet, advanced degrees are required to teach at KSU, even if you teach only part time.",
    "On the afternoon of my thesis defense in 1999, I was invited to teach my first class.",
    "I have been teaching freshmen composition at Kennesaw State University for 23 years.",
    "At my institution alone, there were almost 900 part-time professors and instructors.",
    "That affection, however, has not been returned by the University System of Georgia.",
    "The raises and improved benefits to USG employees never filter down to my level.",
    "Yvonne Wichman is a longtime instructor at Kennesaw State University.",
    "She is a member of the United Campus Workers of Georgia.",
    "My pay for teaching six classes in 2021 was $17,325.",
    "(You can search state salaries here.)",
    "The recent announcement by Gov."
  ]
}