{
  "id": 5421,
  "mediaId": 12,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "OPINION: Meet the 2022 David Perdue",
  "image": "https://www.ajc.com/resizer/DvK_dGElulpjNEzaLViewuHvxVU=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/TSG7TPUPSUXKQ6BBNIRZZCIRZ4.jpg",
  "link": "https://www.ajc.com/politics/opinion-meet-the-2022-david-perdue/XSSVWE7Z55CDDDXHNSU6U2PSQI/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia Murphy",
  "authorUrl": "https://www.ajc.com/staff/patricia-murphy/",
  "termIds": [
    1101,
    1147,
    1951,
    2095,
    2429,
    428,
    2672,
    2959,
    4981
  ],
  "sentences": [
    "Perdue didnt chant Lock him up!? or declare the election stolen, but instead said, The truth is going to come out sooner or later.?\nThat was good enough for Linda Hall, who wore a Trump won? t-shirt and said shes opposing Kemp because of what Kemp did during the 2020 election.?\nAfter his speech, Perdue told me that he had misunderstood the chant Saturday night of Lock him up!? about Kemp.",
    "She said she decided to vote for Perdue for governor once she realized, Hes not a RINO, hes like Donald Trump.?\nDressed in a tailored windowpane blazer and open-collared shirt, Purdue told the standing-room-only crowd that hes challenging Kemp for many reasons, but especially to make sure a Republican wins the U.S. Senate seat up for grabs in Georgia.",
    "On stage with Trump on Saturday, Perdue falsely declared that the 2020 election and his own runoff were absolutely stolen!? Moments later, he promised to jail the people responsible? and gave a big thumbs up to the crowd chanting, Lock him up!? referring to Brian Kemp.",
    "Gone is the nice dad, suddenly replaced by an angry grandpa alongside former president Donald Trump, channeling Trumps rage about the 2020 elections and challenging Kemp, his former ally, in the same GOP governors race Perdue once promised to support Kemp for.",
    "Greg Clifton, a Republican and a former mayor of Fayetteville, was one of several in the room I spoke with who is worried that a brawl like the one playing out between Perdue and Kemp will only guarantee a Stacey Abrams victory in November.",
    "Perdue added that hed also like to see the states $4 billion surplus, which the Legislature is using to finance tax refunds, and other election-year giveaways,? as Perdue called them, go toward eliminating the income tax entirely.",
    "The Perdue I saw Tuesday was a smooth, cheerful handshaker, smiling the nice-dad smile we knew from 2014.\nNice jean jacket!? he told a Trump supporter named Lisa, who asked that her name not be in the paper.",
    "I really thought they were saying, Lock them up,? something Kemps team called, yet another embarrassing gaffe.\n?Perdues clown car campaign just went from sad to downright dangerous,? his spokesman said.",
    "The final piece of Perdues candidacy that hasnt always added up, even for other Republicans, is the idea that challenging the incumbent Republican governor is the way to unify the deeply divided party.",
    "If we want different results in Washington, we have to send a different type of person to Washington.?\nHis nice dad approach worked and Georgia did send a different kind of person to Washington.",
    "To see which Perdue is out in the real world meeting voters away from Trump rallies, I went to Fayetteville Tuesday to see him stumping, along with former House Speaker Newt Gingrich.",
    "The last time David Perdue won a statewide race in Georgia, it was 2014, Barack Obama was the president, and Purdue was a recent Fortune 500 CEO who had never run for office.",
    "Included on Georgias famously long list of items that are not subject to sales taxes are groceries, gold, personal services like hair cuts, hearing aids and oxygen.",
    "First of all, you have to rationalize the sales tax and all the credits and tax deductions there, and you rationalize the state income tax,? he said.",
    "That would flip the chamber to the GOP, stop the Biden Administration in its tracks, he said, and make way for a Republican president in 2024.",
    "He also talked about the woke mob,? eliminating the state income tax, crime in Atlanta, and giving parents more control over schools.",
    "Theyre the same voters who will decide between Perdue and Kemp in May and between one of those two men and Stacey Abrams in November.",
    "but thats like herding cats, so I dont know about that.?\nIt has to be said that Perdue is campaigning more now than he did in 2020.",
    "Along with his sometimes Trumpish demeanor, some other elements of Perdues campaign have not immediately added up this year.",
    "Kemp told me in an interview as the legislative session got underway this year that he was open to a conversation about it.",
    "In Fayetteville, Perdue said the state income tax would actually be pretty easy to eliminate if someone would just try.",
    "At events like the one Tuesday, hes telling Trump supporters what they want to hear, but hes smiling at the same time.",
    "?Rationalizing? tax exemptions means eliminating or changing them, although Perdue did not say which ones hed change.",
    "But fast forward eight years, and the biggest difference between Perdues 2022 race for Governor against Gov.",
    "Help me change the childish behavior up there,? he said, as convincing and calm as a hostage negotiator.",
    "Clifton is looking for the most conservative person who can win.? He believes thats Kemp right now.",
    "What happens in 2022 wont just tell us who David Perdue is, but who Georgia Republicans are, too.",
    "The $14 billion it generates makes up nearly half of the states $30 billion budget.",
    "Brian Kemp and the man who ran for Senate in 2014 seems to be Perdue himself.",
    "Its the most frequent question I get from people outside of Trumps world.",
    "Hes staying for pictures with voters and doing interviews with the press.",
    "They can win in November, he said, If Republicans come to their senses.",
    "Its a cross between 2014 Perdue, who won, and 2020 Perdue, who lost.",
    "Its an idea that was implemented in Florida and eight other states.",
    "Thats something thats easy to say,? but hard to do, Kemp told me.",
    "Take his proposal to eliminate the state income tax in Georgia.",
    "But hes never seen the math that would make it feasible.",
    "But it was election fraud that got people going.",
    "Where has the old David Perdue gone?",
    "And he seems happier doing it."
  ]
}