{
  "id": 543,
  "mediaId": 238,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Trump attacks McConnell after he criticizes RNC censure of two House Republicans probing Jan. 6 insurrection",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/09/trump-attacks-mcconnell-after-he-criticizes-rnc-censure/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    1147,
    1147,
    1646,
    1646,
    1765,
    1765,
    571,
    571,
    562,
    562,
    255,
    255,
    425,
    425,
    427,
    427
  ],
  "sentences": [
    "In his statement, Trump attacked McConnell on several unrelated issues as well, saying he had not done enough to counter the Biden administration on the invasion of our Borders,? rising Inflation,? Unconstitutional mandates? and the incompentent (sic) Afghanistan withdrawal.?\nIf Mitch would have fought for the election, like the Democrats would have if in the same position, we would not be discussing any of the above today, and our Country would be STRONG and PROUD instead of weak and embarrassed,? Trump said.",
    "Pushing back against language in the RNC resolution that described the committee's work as a persecution of ordinary citizens engaged in legitimate political discourse,? McConnell described the attack as a violent insurrection for the purpose of trying to prevent the peaceful transfer of power.?\nThe issue is whether or not the RNC should be sort of singling out members of our party who may have different views from the majority.",
    "He did nothing to fight for his constituents and stop the most fraudulent election in American history.?\nTrump's statement, in which he continued to repeat false claims about election fraud, came a day after McConnell became the highest-ranking Republican elected official to criticize the RNC for the resolution censuring Reps. Liz Cheney (R-Wyo.)",
    "Grab your popcorn and get ready,? Democratic National Committee spokesman Hyma Moore said in a statement in which he described the RGA as being at war with Donald Trump.?\nGeorgia Republicans know a little about messy intraparty fights and this primary is already a disaster,? Moore said.",
    "Former president Donald Trump lashed out Wednesday at Senate Minority Leader Mitch McConnell (R-Ky.), saying he did not speak for most GOP voters when he criticized the Republican National Committee for censuring two House Republicans investigating the Jan. 6, 2021, insurrection.",
    "Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Trump said in a statement issued through his Save America PAC.",
    "Donald Trump's stranglehold on the Republican Party ensures that regardless of which Republican survives this primary, Georgia Republicans are guaranteed to have a rough time.?",
    "Trump is heavily featured in Perdue's first television ad, in which Trump criticizes Kemp for not intervening to overturn the presidential election results in Georgia.",
    "The back-and-forth between Trump and McConnell underscored fissures between the two men as well as between factions of the Republican Party that they represent.",
    "The broader divide was on display Wednesday as the Republican Governors Association unveiled a television ad, with a reported $500,000 buy, backing Georgia Gov.",
    "The RGA ad makes no mention of Perdue, instead promoting Kemp as a conservative leader fighting back? against policies of the Biden administration.",
    "The Republican incumbent faces a primary challenge from David Perdue, the former U.S. senator who was lured into the race by Trump.",
    "and Adam Kinzinger (R-Ill.) for serving on the House panel investigating attack on the Capitol by a pro-Trump mob.",
    "That's not the job of the RNC,? he said.",
    "Brian Kemp (R)."
  ]
}