{
  "id": 5432,
  "mediaId": 157,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Trump fears being labeled with 'humiliating experience' if David Perdue loses to Brian Kemp",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29611316&width=1200&coordinates=0%2C38%2C0%2C12&height=600",
  "link": "https://www.rawstory.com/trump-perdue-kemp-georgia/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1147,
    2087,
    2095,
    4325,
    428,
    2672
  ],
  "sentences": [
    "If I lose one along the way, which you have to, right, they\\u2019re going to say, \\u2018This was a humiliating experience.\\u2019\\u201d #gapolpic.twitter.com/cPbN9Js3WO\n Greg Bluestein (@Greg Bluestein) 1648607883\nThe former US president suggests Putin get back at the US for supporting Ukraine by undermining the current US president - and not the first time he\\u2019s asked Russia to interfere in his behalf.https://twitter.com/atrupar/status/1508955848298704901\\u00a0\\u2026\n Jim Sciutto (@Jim Sciutto) 1648607867",
    "At the rally, Trump also voiced his fears Perdue would lose, saying, \"I hope, David, youre going to be the governor or I just wasted a helluva lot a time tonight.?\nTrump: \\u201cI endorse a lot of people that are are long shots \\u2026 Hopefully David Perdue is going to win.",
    "At a low-turnout rally in Commerce, Georgia where the crowd was \"hardly applauding,\" Trump lashed out at Kemp not going along with his efforts to overturn the 2020 presidential election, which was decisively won by Joe Biden.",
    "Only days after traveling to Georgia to campaign for former Sen. David Perdue (R-GA), Donald Trump described his endorsed candidate as a \"long shot\" against incumbent GOP Gov.",
    "But even with the support of the former president, Trump called Perdue a \"long shot\" in an interview where he also asked Russia for dirt on Biden.",
    "Trump worried the press would brand it a \"humiliating experience\" if he lost the race.",
    "Trump allies aggressively sought to respond to reports of an anemic rally.",
    "These are not sure things.",
    "Brian Kemp."
  ]
}