{
  "id": 5436,
  "mediaId": 25,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Here's where drivers are seeing the biggest breaks on gas prices",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/02/03/f8274bc7-ea0f-4166-8fe2-341e076a20ec/thumbnail/140x90/5753e6454955d4ba53907bbe1f0cc478/gettyimages-1351813234.jpg",
  "link": "https://www.cbsnews.com/news/gas-prices-gas-tax-holiday-where-gas-prices-are-lowest/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aimee Picchi",
  "authorUrl": "",
  "termIds": [
    2095,
    3305,
    2590,
    2626,
    2672,
    2782,
    2845,
    2969
  ],
  "sentences": [
    "(MD=gray, GA=orange) pic.twitter.com/vUAuybkj93\n Patrick De Haan ?g (@GasBuddyGuy) March 28, 2022\nAlready, demand for gas in Maryland has jumped, although De Haan noted it could be due to drivers from neighboring states and Washington, D.C., driving across the border to fill up.",
    "Meanwhile, some industry organizations are arguing that gas tax holidays don't provide meaningful relief to consumers, with a study from the American Road & Transportation Builders Association finding that past gas tax holidays only delivered 18% of the tax cut to consumers.",
    "Typically, stations fill up their tanks every three to five days, so some stations may need to sell their current supply, which could be still subject to taxes, before they can refill and sell gas without the state tax.",
    "Maryland: a 41-cent drop\nMaryland drivers have seen an even bigger benefit, with the average price for a gallon plunging from $4.23 on March 16 to $3.82 on March 29  a reduction of 41 cents per gallon.",
    "Higher gas prices have a very real impact on household budgets: A typical family may incur additional costs of $2,000 this year simply due to the higher costs, according to one Wall Street estimate.",
    "But consequences of a tax break might actually feed the problem, given that lower gas prices result in higher demand for gas  which then can push prices up even higher, experts say.",
    "\"It lowers costs at the retail level, but it insulates motorists from the true reality of prices,\" Patrick De Haan, GasBuddy's head of petroleum analysis, told CBS MoneyWatch.",
    "I can't give everything away free so I chopped off the axis and this is only part, but here is MD charted against national consumption and GA... big boost in gasoline demand.",
    "Oil-producing states\nSome states are experiencing lower-than-average prices partly due to their location, such as Texas and Oklahoma, which are oil- and gas-producing states.",
    "State Senate Republicans in Ohio have introduced a bill to temporarily cut the motor fuel excise tax rate for both gas and diesel to 28 cents per gallon for five years.",
    "\"At this point, supply is constrained  and if supply continues to be constrained and demand goes up, it has the potential to make the problem worse,\" De Haan noted.",
    "Sometimes the relief is passed on immediately to consumers, but it can also take several days for the lower prices to show up at the pump, GasBuddy's De Haan said.",
    "But there are a few locations where drivers are getting some breaks and seeing prices fall  largely due to lawmakers who have suspended gas taxes in their states.",
    "Potential rebates or tax breaks\nResidents of other states may soon get relief through proposals from lawmakers to either send rebate checks or suspend gas taxes.",
    "But the reason for today's $4-plus gas prices is due partly to demand  Americans are driving more in 2022 as the economy recovers from the COVID-19 pandemic.",
    "He added, \"The consensus is that lowering the taxes is a direct benefit to the consumer, and that direct benefit can increase gasoline consumption.\"",
    "Connecticut: Tax cut coming in April\nDrivers in Connecticut haven't seen a big break yet, but they will probably experience relief in early April.",
    "More states may soon pass additional measures to cut or suspend gas taxes, with proposals currently in states including Ohio and West Virginia.",
    "Drivers were paying about $4.26 a gallon for regular unleaded on March 16, not far from the national average of $4.30 per gallon that same day.",
    "Brian Kemp signed a bill on March 18 to temporarily suspend the state's excise tax on motor fuel sales, the per-gallon price began to decline.",
    "That's because a temporary measure to suspend the state's 25-cent-per-gallon tax will start at the beginning of April through the end of June.",
    "Gavin Newsom has proposed giving $400 payments to the owner of a vehicle registered in California as a way to address skyrocketing gas prices.",
    "Cruise ship docks in San Francisco with COVID-19 cases on board\n Workers quitting at near record rate amid \"brutal\" hiring race\nIn:\ngas prices",
    "Georgia: a 32-cent drop\nGas prices in Georgia have dropped by about 32 cents per gallon in recent weeks, according to data from AAA.",
    "A third state, Connecticut, has also passed a law that suspends its gas tax, but that doesn't go into effect into early April.",
    "The relief has been almost immediate in Maryland and Georgia, the two states that so far have enacted the tax cuts.",
    "The average per gallon price in Texas was $3.87 on March 29, while Oklahomans are paying $3.81 a gallon, AAA said.",
    "That applies to the state's 36.1 cents per gallon tax on gas and 36.85 cents per gallon tax on diesel fuel.",
    "It's an issue that's picking up steam given that the national average gas price remains above $4 a gallon.",
    "But so far, data show that drivers in states with gas tax holidays are enjoying significant price drops.",
    "Jim Justice to call a special session to suspend the state's 35.7 cents per gallon gas tax for 30 days.",
    "Russia's war on Ukraine has added to the pressures, leading to the recent spike in gas prices.",
    "Maryland, the first state to suspend its gas tax, suspended the levy for 30 days on March 18.",
    "The state's rate is 29.1 cents per gallon for gasoline and 32.6 cents per gallon for diesel.",
    "Gas prices remain near record highs, dinging wallets and budgets across the nation.",
    "On March 29, motorists in Georgia were paying about $3.94 per gallon, AAA said.",
    "That's about 30 cents lower than the national average of $4.24 that same day.",
    "\"It will help motorists, but we are digging ourselves into a deeper hole.\"",
    "Trending News\n How would Biden's \"Billionaire Minimum Income Tax\" work?",
    "In West Virginia, a group of Democratic lawmakers have asked GOP Gov.",
    "Don't click on anything\n Some tax refunds may be delayed this year.",
    "But supply hasn't been keeping up, which has pushed prices higher.",
    "The tax relief is only temporary, however: It expires on May 31.",
    "If the measure is passed, the checks could be delivered in July.",
    "\"There is a cost to gas cost holidays,\" De Haan noted.",
    "Maryland's gas tax holiday has surged gasoline demand.",
    "The move is expected to cost the state $100 million.",
    "The current state tax is 38.51 cents.",
    "Did you get a text from yourself?",
    "But after Georgia Gov.",
    "Saw that coming!",
    "California Gov.",
    "Here's why."
  ]
}