{
  "id": 5452,
  "mediaId": 43,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "TFG Tells Perdue if He Doesn't Win, \"I've Wasted My Time\"",
  "image": "https://images.dailykos.com/images/917942/story_image/AP20311099472105-1.jpg?1613450318",
  "link": "https://www.dailykos.com/story/2022/3/27/2088522/-TFG-Tells-Perdue-if-He-Doesn-t-Win-I-ve-Wasted-My-Time",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2095,
    3691,
    4325,
    232,
    517,
    3553,
    2672
  ],
  "sentences": [
    "The New York Times (which Political Wire also linked to) gives some evidence that TFG may, indeed, be wasting his time:\nMr. Perdues sputtering start may hint at a deeper flaw in Mr. Trumps plan to punish the governor for refusing to work to overturn Georgias 2020 election results: Mr. Trumps grievances may now largely be his alone.",
    "Atlanta Journal-Constitution: Trump brings his anti-Kemp campaign to Georgia\nFormer President Donald Trump escalated his grudge Saturday against Brian Kemp at a rally in northeast Georgia, urging supporters to oust the incumbent he once endorsed and purge state government of many of the governors allies.",
    "David Perdue, who lost his Georgia Senate seat thanks in part to Trumps insistence that the Georgia November election was stolen, is now running for the Republican nomination for Georgia governor, hoping to unseat Brian Kemp.",
    "And that seems to have gotten to Trump, because the AJC put this at the end of its story:\nTrump, meanwhile, issued his own sharp message to Perdue as some in the crowd began filing out.",
    "voters believe lies about fraud and irregularities in the 2020 election, there is little evidence that Republicans remain as fixated on the election as Mr. Trump.",
    "[emphasis added]\nTrump may well succeed in dividing the Republicans over his grievances and thereby keep them from gaining control in the midterms.",
    "The challenge for Mr. Perdue, as well as for other candidates backed by Mr. Trump, is to make a case that goes beyond exacting revenge for 2020.",
    "The crowd wasnt all that big:\nx\nFor the Twitter-deficient, Eric Erickson posted this:\nThe Trump turnout on a Saturday in Georgia was anemic.",
    "Lost for senator, now losing for governor\nThis is the 3,690,539th (approximately) diary about TFG's ego  the grift that keeps on grifting.",
    "I hope, David, youre going to be the governor,? he said, or I just wasted a helluva lot a time tonight.?\nClassic Trump.",
    "Trump hates Kemp for being loyal to the Constitution instead of to him, so he is pushing Perdue.",
    "(With a h/t to Political Wire, which brought the highlights to my attention.)",
    "Not all the people there were from Georgia or even able to vote.",
    "And Perdue and the other candidates had to foot the bill.",
    "That does not bode well for [Trumps] slate of candidates.",
    "In that case, hes welcome to waste all the time he wants.",
    "If you dont make me look good, Ive wasted my time.",
    "While polls show many G.O.P.",
    "Please proceed.",
    "Oof."
  ]
}