{
  "id": 608,
  "mediaId": 43,
  "date": "2/5/2022 12:00:00 AM",
  "headline": "The Cracks in the Republican Party are Expanding: Saturday's GNR",
  "image": "https://images.dailykos.com/images/1020185/story_image/snow-drops.jpg?1640379390",
  "link": "https://www.dailykos.com/story/2022/2/5/2078675/-The-Cracks-in-the-Republican-Party-are-Expanding-Saturday-s-GNR",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2465,
    2465,
    2214,
    2214,
    2087,
    2087,
    1434,
    1434,
    1098,
    1098,
    1248,
    1248,
    1147,
    1147,
    428,
    557,
    557,
    428,
    427,
    427
  ],
  "sentences": [
    "The ruling requires the Republican-dominated legislature not only to submit new maps to the court, but to offer a range of statistical analyses to show a significant likelihood that the districting plan will give the voters of all political parties substantially equal opportunity to translate votes into seats? in elections\nThe decision not only sets a precedent for judging the legality of future maps in the state, but could play an important role in the struggle for control of the House of Representatives in elections this November.",
    "@NBCNews\n Kyle Griffin (@kylegriffin1) February 2, 2022\nJan. 6 Panel Examining Trump's Role in Proposals to Seize Voting Machines\nThe House Jan. 6 committee is scrutinizing former President Donald J. Trump's involvement in proposals to seize voting machines after the 2020 election, including efforts to create a legal basis for directing national security agencies to take such an extreme action, according to three people with knowledge of the committee's activities.",
    "If you need me, I'll be right here:\nMeanwhile:\nBiden and the Democrats are doing Great Things\nBiden begins crackdown on power plant pollution\nBiden administration officials are kicking off a crackdown on power plant pollution, aiming to shift the nation's electricity supply to cleaner energy in the face of congressional resistance and a Supreme Court that could limit the federal government's ability to tighten public health standards.",
    "pic.twitter.com/vqCnDc70HR\n The Lincoln Project (@ProjectLincoln) February 4, 2022\nBiden administration to give states $1.15 billion to plug orphaned wells, which leak planet-warming methane\nThe White House on Monday announced new steps to help curb emissions of methane, saying it will send $1.15 billion to states to clean up thousands of orphaned oil and gas wells that leak the powerful planet-warming gas.",
    "CRUSHING Expectations.pic.twitter.com/fs5Rl7xO71\n Ritchie Torres (@RitchieTorres) February 4, 2022\nWith Hard Work, We Can Win in November\nx\n$22.3 million: That's the amount of money in Georgia Sen. Raphael Warnock's campaign account as of Dec. 31, the most of any Senate candidate, according to an NBC News analysis.",
    "Maus' Sales Surge After Tennessee School District Bans The Holocaust Graphic Novel\nTitles from Maus  a Pulitzer Prize-winning series about the Holocaust  made up nearly half of Amazon's 10 best-selling comics and graphic novels Friday after one of the books was controversially banned by a Tennessee school district.",
    "The New Jersey Supreme Court on Thursday voted 5-0 to side with Democrats and dismiss a GOP lawsuit that asked the court to remand the map to the redistricting commission for further consideration and require the tie-breaker commissioner, former Supreme Court Justice John Wallace, to recuse himself.",
    "x\nThanks to President Biden's executive orders, nearly 70,000 federal workers will immediately start to earn $15 an hour beginning Sunday, and 300,000 employees of federal contractors will start to see a raise to $15 an hour reflected in their paychecks over the course of the year.",
    " Kyle Griffin (@kylegriffin1) February 3, 2022\nStacey Abrams raises $9.2M after entering gov race in December\nStacey Abrams has raised more than $9.2 million since entering the race for governor in December, setting a blistering fundraising pace that eclipsed Republican Gov.",
    "Political Maps Are Unconstitutional\nThe North Carolina Supreme Court on Friday upended Republican efforts to lock in political dominance in the state, saying that congressional and state legislative maps were partisan gerrymanders that violated the State Constitution.",
    "#BidenBoom pic.twitter.com/kdxFwqAebK\n CAP Action (@CAPAction) February 4, 2022\nx\nSay it with me: #BidenBoom pic.twitter.com/PD6snN7TjH\n Bill Pascrell, Jr. (@BillPascrell) February 4, 2022\nStocks climb as investors weigh a surprising jobs report and Amazon earnings.",
    "Stocks on Wall Street rose on Friday, as an unexpectedly strong jobs report scrambled investors' expectations for coming interest rate increases and as the latest round of earnings reports offset some fears about declining corporate profits.",
    "This is not legitimate political discourse.? pic.twitter.com/lKgbVyVcJr\n Rep. Liz Cheney (@RepLizCheney) February 4, 2022\nAnd Pence said\n \"President (Donald) Trump is wrong\" in claiming that Pence had the right to overturn the 2020 election.",
    "The Republican-drawn maps had effectively allotted the party control of at least 10 of the 14 House seats the state will have in the next Congress, even though voters statewide are roughly equally divided between the two parties.",
    "In addition, a diverse portfolio of vaccines frees up supply bottlenecks, provides options for those allergic to vaccines ingredients, and, among vaccines that use more traditional biotechnologies, will reduce vaccine hesitancy.",
    "Other Good News\nTwo underdog but game changing vaccines: NVX-CoV2373 (Novavax) and CORBEVAX\nOne way (maybe the only way) we're going to get out of this pandemic is to vaccinate a large portion of the global population.",
    " Kyle Griffin (@kylegriffin1) February 3, 2022\nThe 1/6 Commission is working hard:\nx\nNBC News: Ex-Trump DOJ official Jeffrey Clark, who tried to overturn the election for Trump, is meeting with the Jan. 6 Committee.",
    "he retirement of Supreme Court Justice Stephen Breyer presents the president with a unique opportunity to re-energize his base, as he fulfills his campaign promise to appoint a Black woman to the Supreme Court.",
    "The Democrat will report about $7.2 million in cash on hand at the end of the financial quarter after collecting contributions from more than 100,000 donors in just two months, a campaign aide said Wednesday.",
    "x\nSay it with me: #BidenBoom pic.twitter.com/eksl8IuXhU\n Bill Pascrell, Jr. (@BillPascrell) February 3, 2022\nx\nBREAKING: Our economy added 467,000 jobs last monthand a record 6.6 million over the last year.",
    "But Pence went further still Friday, saying not only that what Trump did was wrong and that his idea was un-American? but that it was corrosive to democracy and that it's something Republicans should abhor.",
    " Kyle Griffin (@kylegriffin1) February 4, 2022\nCrisis and Opportunity Could Lead to a Biden Bounce Very Soon\nJoe Biden's poll numbers can only go up from here, and there's good reason to believe they will.",
    "The report smashed the projections of economists, who had been expecting the wave of coronavirus cases associated with the Omicron variant to lead to anemic gains, if not an outright decline in jobs.",
    "The move signals a broader effort by the administration to cut greenhouse gases and other pollutants from U.S. power plants, which rank as the nation's second-biggest contributor to global warming.",
    " Kyle Griffin (@kylegriffin1) February 4, 2022\nNew Jersey Supreme Court dismisses Republican challenge to congressional map\nA Republican challenge to the new congressional district map has failed.",
    "But I can tell you this: the Republican party is sure acting like some really bad stuff is coming out really soon and they are fighting really hard to make the best of it to save their own butts.",
    "I am now even more committed to fighting conspiracies and lies: pic.twitter.com/NzKK2s2kkC\n Adam Kinzinger (@AdamKinzinger) February 4, 2022\nMichael Steel tweeted this:\nx\nI stand with Adam.",
    "1 on the Amazon Best Sellers List after being banned by a Tennessee school board.https://t.co/5qV80RPLqW\n Kyle Griffin (@kylegriffin1) February 1, 2022\nOn the Lighter Side\nWhat can you do?",
    "Trump-backed candidates confront cash wave\nSome of Donald Trump's handpicked candidates are hitting an obstacle in their efforts to purge the Republican Party of Trump skeptics: money.",
    "So for him to come out and say anything means that he sees that sides are being taken in this and that he is safer on the side of the people who didn't try to overturn the government.",
    "Driving the news: Key Trump-backed Republican challengers were heavily outraised by their Republican primary opponents late last year, newly filed financial reports show.",
    "This pivot came because the Jan 6th House Commission is working hard and getting real information on just how awful 1/6 was AND just how many Rs played a role in it.",
    "To the WHO, this means reaching 70% of the population by mid-2022, which is ~3 billion unvaccinated people with 6-9 billion doses before another variant of concern.",
    "Judge temporarily halts Youngkin order making masks optional in Va. schools after lawsuit from school boards\nAn Arlington judge on Friday barred enforcement of Gov.",
    "Strong Jobs Report Shows Resilient Economy Despite Covid Wave\nEmployers added 467,000 jobs in January, seasonally adjusted, the Labor Department said on Friday.",
    "And we should all be cheering as these add diversity to our vaccine portfolio, which will get us one step (or more like leaps) closer to ending the pandemic.",
    "Glenn Youngkin's mask-optional order for schools  a major victory for the seven school boards that sued to stop it, and a sharp rebuke for the new governor.",
    "x\nSpeaker Pelosi says House Democrats have already hosted more than one thousand events around the nation to highlight the bipartisan infrastructure law.",
    "Good thing Biden already delivered on getting a bipartisan infrastructure deal passedan accomplishment for which he's received little credit, thus far.",
    "There's also the underrated 6 percent growth in GDP, an accomplishment for which most presidents would be basking in praise after one year in office.",
    "Judge Davis would be the first Black woman to serve on the Sixth Circuit from Michigan and only the second Black woman to serve on the Sixth Circuit.",
    "I am sure of very few things in this world, but here is one thing I am sure of: Mike Pence has less backbone than any human in the history of humans.",
    "On Monday, the Environmental Protection Agency affirmed its authority to curb mercury from smokestacks, reversing a 2020 Trump administration policy.",
    "And though it feels strange to say so, last week's bridge collapse in Pittsburgh underscores America's desperate need for infrastructure upgrades.",
    "The League of Women Voters work year-round to combat voter suppression through advocacy, grassroots organizing, legal action and public education.",
    "x\nTOPEKA, Kan. (AP) -- Governor vetoes GOP redistricting map that would make it harder for Kansas' lone Democrat in Congress to get reelected.",
    "This is a giant and important fight for us but, win or lose, we keep fighting and voting and organizing and spreading truth and light.",
    "They are taking buses around Florida to empower returning citizens, remove financial barriers to voting, and increase public safety.",
    "As gross as it is, it brought me joy, because it is such a pathetic attempt to save their party from the ruin the truth will bring.",
    "Romney tweeted this:\nx\nShame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "Look, I can't pretend that I know all that the 1/6 commission will tell us or all that the justice department will find or do.",
    "x\nBiden's 14th judicial nominations announcement: Stephanie Dawkins Davis, the nominee to the Sixth Circuit Court of Appeals.",
    "Now why in the heck would the RNC censure two of their own and call the Jan 6th insurrection legitimate political discourse??",
    "Kathy Hochul has signed off on new maps for the state's congressional districts that could net Democrats 3 more House seats.",
    "They have on the ground work in 10 states and people from other states can write postcards, phone bank, fundraise, and text.",
    "https://t.co/piOYicYeki\n Michael Steele (@MichaelSteele) February 4, 2022\nLiz Cheney tweeted this:\nx\nThis was January 6th.",
    "The mRNA pharmaceutical companies are also not sharing their vaccine patent, which doesn't allow others to manufacture.",
    "While mRNA vaccines are innovative and effective, they pose logistical storage challenges to reach remote communities.",
    "Sign up at Democracy Docket to stay informed about the fight against voter suppression and the fight for voter rights.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.",
    "A diverse portfolio of vaccines that utilizes a number of different biotechnologies is of critical importance.",
    " Mitt Romney (@MittRomney) February 4, 2022\nAdam Kinzinger tweeted this:\nx\nMy statement on the RNC censure.",
    "Then they called it senseless acts of violence.?\nSure it is hugely distressing to hear them talk like that.",
    "They are reacting to the coming shitstorm of truth by trying to distance themselves even further from it.",
    "If we lose faith in the Constitution, we won't just lose elections  we'll lose our country,? Pence said.",
    " Kyle Griffin (@kylegriffin1) January 29, 2022\nBiden took out a major ISIS threat\nx\nNote the difference.",
    "Standing up and talking about how awful the crime was and, gosh darn it, how you are disgusted by it!",
    "Once that is no longer possible, you have to pretend like it wasn't really much of a crime at all.",
    "Pence added quickly that frankly, there is no idea more un-American? than the one Trump pushed.",
    "The fellow who is too afraid to eat with a woman without his wife there (whom he calls mother).",
    "x\nTwo weeks ago, I spoke about the historic strength of the #BidenBoom economy on @RealTimers.",
    "The S&P 500 climbed half a percent, a day after its steepest one-day drop in nearly a year.",
    "You can get involved with them at this link\nVolunteer with Black Votes Matter at this link.",
    "Do you remember the Trump years (don't go back and think about them if you don't have to).",
    "The white haired fellow who spent four years sucking up to trump and playing his lap dog.",
    "@NBCNews\n Kyle Griffin (@kylegriffin1) February 2, 2022\nNorth Carolina Court Says G.O.P.",
    "The first step in trying to get away with a crime is denying that you were a part of it.",
    "Two new vaccines have been added to our global repertoire: NVX-CoV2373 and CORBEVAX.",
    "Abrams outpaced Kemp, who raised $7.4 million over the final six months of the year.",
    "They are really amazing\nMake phone calls FROM YOUR OWN HOME to protect voter rights.",
    "TODAY: In new #JobsReport the US added 467k jobs in January despite a COVID surge.",
    "But lets face it, we already knew they were awful, terrible, rudderless halfwits.",
    "The ACLU plays a key role in filing lawsuits that often stop voter suppression.",
    "First, just a few days ago Trump admitted to trying to overturn the election.",
    "Pence rolled over for the biggest dummy this country has ever elected DAILY.",
    "\"Look, I understand the disappointment many feel about the last election.",
    "\"But whatever the future holds, I know we did our duty that day.\"",
    "Influence voters in key areas from the comfort of your own home!",
    "I mean that wasn't the tune they were singing the day after it.",
    "If Mike Pence is talking like this, the writing is on the wall.",
    "These will be nothing short of game changers for the pandemic.",
    "Now, the RNC is claiming that 1/6 was totally normal and good.",
    "Spread The Vote works to get voters IDs before voting begins.",
    "and he said that \"the time has come to focus on the future.\"",
    "I am lucky and proud to be in this with you g?g?gggggg?g?",
    "He ended the year with about $12.7 million in the bank.",
    "There are phone banks on Wednesdays and on Saturdays.",
    "The index ended the week with a gain of 1.6 percent.",
    "Donate to the AMAZING Florida Rights Restoration!",
    "The Nasdaq composite rose 1.6 percent on Friday.",
    "They did plenty of that in the days after 1/6.",
    "We aren't perfect, but they are fucking evil.",
    "You can volunteer with them at this link.",
    "And that is exactly what they are doing.",
    "Holy Moses: what a day we had yesterday!",
    "Of course not all of them are on board.",
    "I have to think that it came from fear.",
    "Get involved with the Democratic party.",
    "Get involved with Postcards to voters!",
    "Those who are not in trouble for 1/6.",
    "They are working on races right now!",
    "Get involved with them at this link.",
    "call it what it is THE BIDEN BOOM!!",
    "Instead, employers kept on hiring.",
    "The underdogs are pulling through!",
    "I was on the ballot,\" Pence said.",
    "So my main question is: why now?",
    "His job was to have no backbone.",
    "Most important: DON'T LOSE HOPE.",
    "Where did yesterday come from?",
    "Y'all, Pence has no backbone.",
    "Get involved with Swing Left.",
    "Guess who isn't on board?",
    "Pence said those things.",
    "x\n'Maus' has now hit No.",
    "And I am here for it.",
    "Less than Ted Cruz!",
    "Not an inch of it.",
    "Run for something!",
    "We never give up.",
    "You remember him.",
    "x\nNew York Gov.",
    "Why not you?",
    "Brian Kemp.",
    "Lots of it.",
    "Mike Pence.",
    "Seriously?",
    "Really."
  ]
}