{
  "id": 6524,
  "mediaId": 136,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Native Americans Made 'Sacrifice' for 'Our Right to Worship Jesus': Taylor",
  "image": "https://d.newsweek.com/en/full/2042623/kandiss-taylor-says-native-american-sacrifices-christianity.webp?w=790&f=31b6cd94b8e9d0a844372def4a904724",
  "link": "https://www.newsweek.com/native-americans-made-sacrifice-our-right-worship-jesus-taylor-1708855",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    2095,
    3082
  ],
  "sentences": [
    "She is set to face off against Kemp, as well as former Senator David Perdue on Tuesday May 24, but polls show Kemp as the favorite in the final days before the GOP primary, while Taylor is mostly polling in the single digits.",
    "Others, meanwhile, pointed out that the Founding Fathers actually supported freedom of religion, rather than only the freedom to worship Christianity, as they included the separation of church and state in the Constitution.",
    "Taylor previously faced criticism for appearing to dismiss the separation of church and state, saying during a speech last month that \"church and state was written because the state has no business in our church.",
    "Her remarks received swift backlash on social media, with some accusing her of being insensitive to the atrocities endured by Native Americans when European colonizers arrived to the Americas.",
    "Kandiss Taylor, a Republican running in Georgia's gubernatorial race, said last week Native Americans made a \"huge sacrifice\" so Christians could \"worship Jesus freely\" in the United States.",
    "The video of her speech was picked up by the Twitter account PatriotTakes and has been viewed more than 580,000 times as of early Saturday afternoon.",
    "\"Actually, our founding fathers came to America free to worship whomever they chose to worship,\" wrote Twitter user Kelley Trott.",
    "\"Native Americans died because of systematic murder at the hands of white settlers and later the United States government.",
    "In her speech, Taylor spoke of the \"sacrifice\" Native Americans made for settlers to have the freedom to worship Jesus.",
    "\"Look at what they went through, the Native Americans for sacrifice for us to have the freedom that we have today.\"",
    "\"Native Americans did not die so that white European settlers could worship Jesus,\" pastor Teer Hardy tweeted.",
    "Taylor, who is challenging incumbent GOP Governor Brian Kemp, has made religion a cornerstone of her campaign.",
    "On the Democratic side, Stacey Abrams, who previously ran for governor in 2018, appears to be the favorite.",
    "That's why we had our Founding Fathers come over here and destroy American Indians' homes and their land.",
    "She made the remarks last Monday while speaking at the Conservative Republican Women of North Atlanta.",
    "\"The First Amendment right, which is our right to worship Jesus freelythat's why we have a country.",
    "Taylor defended her remarks Thursday on Twitter by writing: \"I said what I said.",
    "The key swing state's general election could be among the closest come November.",
    "White Christian Nationalism is alive and well in @KandissTaylor's agenda.\"",
    "\"Our founding fathers came to America to be free to worship Jesus.",
    "Yes, that includes our Native American brothers and sisters.",
    "Newsweek reached out to Taylor's campaign for comment.",
    "This includes our military fighting and dying.",
    "We are the church, and we run the state.\"",
    "She continued doubling down on Friday.",
    "Don't throw it away,\" she wrote.",
    "Huge sacrifice since day 1.",
    "That's why we have Georgia.",
    "They took it,\" she said.",
    "But we are the church.",
    "Freedom is not free.",
    "Get offended.\""
  ]
}