{
  "id": 6532,
  "mediaId": 21,
  "date": "d2022-05-20T19:00",
  "headline": "Trump may stop endorsing candidates for competitive GOP primaries, report says: 'This is not how he expected this to go'",
  "image": "https://i.insider.com/5d56947acd978406bf565774?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-might-stop-endorsing-gop-primary-candidates-cnn-2022-5",
  "sentiment": "-0.823",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    882,
    1147,
    2095,
    2303,
    2379,
    2491,
    2524,
    3102,
    4019,
    4325,
    106,
    428
  ],
  "sentences": [
    "US President Donald Trump pats his bicep and pumps his fist at the end of his rally with supporters in Manchester, New Hampshire, U.S. August 15, 2019 REUTERS/Jonathan Ernst\nTrump is considering putting a pause on endorsing GOP primary candidates, CNN reports.",
    "The former president's pick for Senate in Pennsylvania, celebrity doctor Mehmet Oz, is locked in a still-t00-close-to-call primary after Trump's first pick, Sean Parnell, dropped out after losing custody of his children.",
    "Eric Greitens, who resigned from office amid multiple scandals in 2018, in a crowded primary to replace retiring Sen. Roy Blunt that also includes Attorney General Eric Schmidtt, Rep. Vicky Hartzler, and Rep. Billy Long.",
    "Trump's endorsement win percentage\nin contested elections\nWin\nRunoff/Unclear\nLoss\n0255075100%\n80%\n20%\n0%\n97%\n0%\n3%\n63%\n26%\n11%\nSenate\nHouse\nState/Local\nNote: Accurate as of the morning of May 18, 2022.",
    "Four more of Trump's endorsed candidates for state-level offices are headed to runoffs, including embattled Texas Attorney General Ken Paxton, who will face George P. Bush in a May 24 runoff election.",
    "Oz, Perdue, or both faltering could make Trump less likely to endorse candidates in upcoming, competitive GOP Senate primaries in Arizona and Missouri set for August, sources told CNN.",
    "Just 0.09 percentage points separate Oz from David McCormick as of Friday, meaning the race is almost certainly headed to a recount as Oz has resisted Trump's calls to declare victory.",
    "\"If Oz loses, it puts him in an awkward spot because he absolutely trashed David McCormick at his rally and pissed off quite a few allies who never thought he should have endorsed Oz.\"",
    "One source close to Trump told CNN he has \"burned a lot of bridges\" by backing Oz, which went against his former close aides Stephen Miller and Hope Hicks who had supported McCormick.",
    "Critics also cite Mastriano's role in trying to overturn Trump's 2020 election loss in the state, which they worry could jeopardize the party's chances of flipping the governorship.",
    "Trump boasted another win with the victory of state Sen. Doug Mastriano, an additional endorsement that roiled some Pennsylvania Republicans due to the candidate's extreme views.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "President Donald Trump is considering taking a hiatus from endorsing Republican primary candidates following some high-profile stumbles for his picks, CNN reports.",
    "Trump's rubber stamp also failed to save embattled Rep. Madison Cawthorn, the first of his endorsed House candidates to lose in 2022, according to Insider.",
    "Trump's pick for Senate in Ohio, JD Vance, won out in a crowded GOP primary thanks in part to lots of financial backing from billionaire Peter Thiel.",
    "But in Arizona, Trump has not yet endorsed another Thiel-backed candidate, Blake Masters, in the GOP primary to take on Democratic Sen. Mark Kelly.",
    "Perdue acknowledged the numbers, telling NBC News on Friday: \"We may not win Tuesday, but I can damn guarantee you that we are not down 30 points.\"",
    "And Trump's endorsed candidates for federal and state offices have won 63.5% of the vote, on average, so far in 2022, an Insider analysis found.",
    "Trump bet big on several candidates in competitive races in the 2022 midterms, hoping to wield considerable influence in Republican primaries.",
    "The latest poll of the race, conducted by Fox News, showed Kemp leading Perdue by 32% among likely Republican primary voters.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "But Trimp's endorsed candidate for governor in Nebraska, Charles Herbster, lost an open primary to replace Gov.",
    "Brian Kemp, former Sen. David Perdue, appears to be on track for at least a loss and a potential clobbering.",
    "My guess is that will have the biggest effect on the endorsement process,\" a Trump official told CNN.",
    "Perdue has struggled to match Kemp in campaign spending, and Trump hasn't parachuted in to help him.",
    "NBC News reported that Trump is frustrated by Perdue's performance and is pulling back support.",
    "\"This is not how he expected this to go,\" a Trump adviser told CNN of Dr. Oz's razor-thin race.",
    "\"This is not how he expected this to go,\" a Trump adviser told CNN of Oz's razor-thin race.",
    "But Trump, who touted his endorsement record as a badge of honor, has seen some setbacks.",
    "And in Missouri, Trump has leaned toward endorsing but has not backed former Gov.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Some of Trump's biggest endorsements have lost or underperformed expectations.",
    "\"He does not want August to be a repeat of May,\" a Trump adviser told CNN.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Janice McEachin challenged the incumbent Gov.",
    "Stay up to date with what you want to know.",
    "And Trump's pick to challenge Georgia Gov.",
    "Brad Little and lost badly by 20 points.",
    "Sign up for notifications from Insider!",
    "\"Georgia will be an absolute bloodbath.",
    "Trump-endorsed Idaho Lt. Gov.",
    "Loading Something is loading.",
    "Pete Ricketts."
  ]
}