{
  "id": 6538,
  "mediaId": 195,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "The Memo: Trump faces critical popularity test in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/trumpdonald_perduedavid_051922ap-joe-maiorana_john-bazemore_split_trump-georgia.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/administration/3495125-the-memo-trump-faces-critical-popularity-test-in-georgia/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage/",
  "termIds": [
    815,
    2095,
    2303,
    3102,
    3103
  ],
  "sentences": [
    "Raffensperger is, however, mounting a strong fight and has accused Hice of lying about our election process.\nThe Peach State has been vexing territory for Trump, where he lost to Biden by about 12,000 votes out of around five million cast for the two main candidates.",
    "Incumbent Brad Raffensperger, who also resisted Trump's entreaties over the 2020 election  most infamously a January 2021 phone call in which Trump urged Raffensperger to find enough votes to undo President Biden's victory in Georgia  is running for reelection.",
    "Having lost his Senate seat to Sen. Jon Ossoff (D-Ga.), he would clearly be a risk for Republicans as their gubernatorial choice  especially since he would be facing Stacey Abrams, a national figure who is running unopposed on the Democratic side.",
    "Polling in that race has been sparse but appears to show a competitive race with a large number of undecided voters, though Raffensperger is generally seen as less well-placed than Kemp to hold off a Trumpian challenger.",
    "Absolutely, I think it depressed turnout but I also think it just took the messaging away, said Williams, contending that controversy over the election allegations supplanted any scrutiny of Ossoff or Warnock.",
    "Mehmet Oz, the TV personality whom Trump backed in Pennsylvania's Senate primary, appears likely to face an automatic recount in a very tight race with businessman David McCormick.",
    "When it comes to endorsements, we tend to look at the individual running rather than who endorses them, said Andy Garner, a former chairman of the Floyd County Republican Party.",
    "Trump wants to demonstrate his own strength, partly for the bragging rights and partly to maintain his position as the frontrunner for the 2024 GOP presidential nomination.",
    "Former football star Herschel Walker is all but guaranteed to win the GOP Senate primary, setting up a general election match-up with Sen. Raphael Warnock (D) in November.",
    "Earlier this month, taking part in a tele-rally for Perdue, Trump blasted Kemp as a truly horrendous RINO, the derisory acronym that stands for Republican in Name Only.",
    "By all markers, outside the Trump stuff, [Kemp] has done a pretty good job, said Jay Williams, a GOP strategist in Georgia who is not aligned with either candidate.",
    "That Kemp should have taken probably illegal actions to overturn the election? said Amy Steigerwalt, a professor of political science at Georgia State University.",
    "In Pennsylvania, Doug Mastriano, who backs Trump's false claims of election fraud and marched to the Capitol on Jan. 6, will be the GOP's gubernatorial candidate.",
    "When it comes to Trump's influence, said Steigerwalt, the further we get away from 2020, the lower down it goes.\nThe Memo is a reported column by Niall Stanage.",
    "But, at that time, there were still two Senate run-off elections to come in Georgia, where a candidate must win more than 50 percent of the vote to be elected.",
    "That leaves Perdue's candidacy essentially dependent upon a single argument  that Kemp should have cooperated in Trump's efforts to overturn the election.",
    "The elections come on the heels of key contests this week, particularly in Pennsylvania and North Carolina, where Trump-backed candidates met mixed fates.",
    "Trump's backing was not enough to save controversial congressman Rep. Madison Cawthorn (R-N.C.) from a primary defeat in North Carolina's 11th district.",
    "Kemp's main sin, in Trump's eyes, is his refusal to back Trump's efforts to overturn the results of the 2020 presidential election.",
    "Trump has urged Oz to claim victory in the too-close-to-call race but the TV doctor has not yet followed that prescription.",
    "A Fox News poll released Wednesday put Kemp ahead of Perdue by more than 30 points, compared to an 11-point edge in March.",
    "Then there is the worry, among some Georgia Republicans, that listening too much to Trump has had baleful effects before.",
    "We don't like folks telling us how to vote.\nThere are also concerns, in general, about Perdue's abilities as a candidate.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "But there is no real evidence that it is sufficient to create a winning campaign to oust a powerful incumbent governor.",
    "The stakes are growing higher by the day for former President Trump in advance of Georgia's GOP primaries on Tuesday.",
    "Republicans and independent observers point to one overarching fact to explain Kemp's strong polling lead.",
    "Brad Long beat back a challenge from another Trump pick, Long's own lieutenant governor, Janice McGeachin.",
    "Some Republicans in the state say Trump risks pushback by being seen as meddling in the state's politics.",
    "Some Republicans are still sore about Trump's role, which they believe sapped conservative turnout.",
    "In the RealClearPolitics polling average, Kemp had a lead of almost 25 points on Thursday evening.",
    "In the immediate wake of Election Day 2020, Trump made sweeping  and false  accusations of fraud.",
    "The new poll had Kemp on 60 percent and Purdue on 28 percent among Republican primary voters.",
    "Its primaries also come after results this week that offered a mixed bag, at best, for Trump.",
    "Brian Kemp (R) again and again, backing his main opponent, former Sen. David Perdue (R-Ga.).",
    "The primaries will be the latest test of Trump's muscle within the Republican Party.",
    "The incumbent governor, they note, is very conservative by any reasonable standard.",
    "Trump has endorsed Rep. Jody Hice (R-Ga.) in the hope of unseating Raffensperger.",
    "Democrats ended up winning both of those seats  and taking control of the Senate.",
    "Rep. Ted Budd (R-N.C.) easily won the GOP Senate primary in North Carolina.",
    "Trump is a longtime booster of Walker, having endorsed him last September.",
    "Trump will likely be assured of at least one victory in Georgia.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "But Georgia looks like it might buck his wishes, yet again.",
    "Earlier this month, Trump scored a big win when author J.D.",
    "The only thing Perdue is able to point to is, what?",
    "In Georgia, Trump has railed against incumbent Gov.",
    "That argument is enough to win over MAGA diehards.",
    "To be sure, Trump candidates scored some wins too.",
    "But Republican voters don't seem to be listening.",
    "The race for secretary of state is less certain.",
    "Vance won the Republican Senate primary in Ohio.",
    "But Georgia could be a tougher nut to crack.",
    "He has solid approval ratings in most polls.",
    "Kemp has a commanding lead in the polls.",
    "Georgians tend to be fairly independent.",
    "And in Idaho, Republican Gov.",
    "It's a test he could fail."
  ]
}