{
  "id": 6605,
  "mediaId": 33,
  "date": "d2022-05-19T00:00",
  "headline": "Trump may hold off on more endorsements for coming primaries, advisers say",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220519100111-donald-trump-file-051422-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/05/19/politics/trump-endorsement-risk-pennsylvania/index.html",
  "sentiment": "-0.91",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr",
  "authorUrl": "https://www.cnn.com/profiles/gabby-orr",
  "termIds": [
    1147,
    2095,
    2303,
    2491,
    2524,
    3102,
    3103,
    4325,
    428,
    571,
    2550,
    2862
  ],
  "sentences": [
    "A loss for Oz in Pennsylvania would not only add another blot to Trump's endorsement record -- even as he claimed Wednesday to have had a \"spectacular\" primary night -- but advisers say it will also make the former President reluctant to wade into other contentious primaries in Alabama, Arizona and Missouri unless and until a clear front-runner emerges.",
    "Oz's shifting positions over the years on issues such as abortion and guns raised early questions among Trump allies and MAGA personalities about the candidate's conservative bona fides, and Oz has refused to go as far as the former President in claiming -- falsely -- that the 2020 presidential election was rigged.",
    "One person close to the former President said he \"burned a lot of bridges\" with his late-stage endorsement of Mastriano and his decision to back Oz -- rebuffing Trump White House alums such as Stephen Miller and Hope Hicks, who had signed on to help McCormick and actively lobbied their former boss for his support.",
    "Missouri is a unique race, given that Trump has faced both tremendous pressure from supporters of Eric Greitens to endorse the disgraced former governor and tremendous pressure to endorse an alternative to Greitens from Republicans who are concerned about the former governor's electability in November.",
    "Trump also failed to rescue Rep. Madison Cawthorn from a primary defeat on Tuesday in North Carolina's 11th Congressional District, despite urging Republicans to give the scandal-plagued freshman congressman \"a second chance\" hours before voters went to the polls.",
    "(CNN)Republican candidates in upcoming primaries may have a tougher time scoring a coveted endorsement from Donald Trump, according to the former President's allies, who say he is feeling more risk-averse amid the deadlocked Senate GOP contest in Pennsylvania.",
    "The pair of losses in Idaho and North Carolina, coupled with Oz's inability to close the deal on election night and Perdue's seemingly doomed bid in Georgia, has left Trump much less inclined to roll the dice in new contests, according to people close to him.",
    "Brian Kemp is widely favored to fend off a GOP primary challenge from former Sen. David Perdue, who was hand-picked and recruited by Trump last year amid the former President's frustration with Kemp's refusal to contest the 2020 election results in Georgia.",
    "The former President waited until later in the campaign to throw his weight behind Vance in Ohio and gubernatorial candidate Doug Mastriano in Pennsylvania, and he would be late to intervene if he endorses Britt or Durant in Alabama in the coming days.",
    "One of those allies described Trump as \"agitated\" by the uncertain outcome in the Keystone State primary, where his endorsement of celebrity doctor Mehmet Oz failed to translate into a decisive win against former hedge fund manager David McCormick.",
    "And while Tuesday's primaries in Pennsylvania and North Carolina may have delivered mixed results for the former President, next week's much-anticipated gubernatorial primary in Georgia is looking increasingly likely to hand Trump a major setback.",
    "One outside Trump adviser, who told CNN earlier this week that the former President was on the brink of backing Masters, reversed course late Tuesday to say the endorsement was now \"indefinitely\" on hold as Trump awaits a result in Pennsylvania.",
    "Greitens faced fresh allegations of marital abuse from his ex-wife earlier this spring and is up against two candidates -- Missouri Attorney General Eric Schmitt and US Rep. Vicky Hartzler -- who have drawn support from prominent GOP Sens.",
    "On Wednesday, Trump urged Oz to simply \"declare victory\" in a series of comments on his Truth Social platform, while also making unsubstantiated claims about attempts \"to cheat with the ballots\" in Pennsylvania.",
    "Trump has been closely monitoring the Alabama Senate race between US Rep. Mo Brooks, Army veteran Mike Durant and Katie Britt, a former aide to retiring GOP Sen. Richard Shelby, which will takes place Tuesday.",
    "Trump allies admit that the point of the strategy so far is to help protect him from unexpected losses, though his April endorsement of Oz still came after mail-in voting had already begun in Pennsylvania.",
    "\"He does not want August to be a repeat of May,\" one of the Trump advisers said, referring to two late-summer primaries in Arizona and Missouri, where Trump has not yet chosen candidates to get behind.",
    "Any steps Trump takes to support Senate candidates in Arizona and Missouri or gubernatorial hopefuls in Michigan and Wisconsin may ultimately be determined by how each race looks later this summer.",
    "The former President has not yet commented on Cawthorn's loss, though several of his allies attempted to distance themselves from the MAGA-aligned incumbent as he headed for a loss Tuesday night.",
    "The frustration with Trump's pick was palpable at a May 7 campaign rally in Greensburg, Pennsylvania, where attendees repeatedly booed the celebrity doctor, according to footage from the event.",
    "\"I think it will depend on how big of a lead Britt builds up,\" said one former Trump campaign official, who noted that Trump privately favors Britt, with whom he met at Mar-a-Lago in February.",
    "And although he promised to select a new candidate in the race after withdrawing his endorsement of Brooks in March, some of his allies say the situation in Pennsylvania has given him pause.",
    "One of the former Trump campaign officials said the Idaho outcome was a perfect example of why the former President is likely to be more cautious as the rest of the primary season unfolds.",
    "A Fox poll released Wednesday showed Perdue trailing Kemp by 32 points, suggesting that Kemp could potentially avoid a runoff contest if he remains above 50 percent support on primary day.",
    "But even if Trump presses on with successful endorsements in these contests, the outcome of Tuesday's primaries could come back to haunt him this fall and in the 2024 presidential primary.",
    "A newly cautious approach to upcoming primaries by Trump would underscore his belief that in order to maintain influence inside the Republican Party, his endorsement must remain powerful.",
    "\"If Oz loses, it puts him in an awkward spot because he absolutely trashed David McCormick at his rally and pissed off quite a few allies who never thought he should have endorsed Oz.\"",
    "As of Thursday morning, the race remains tight and appears likely to head to an automatic recount as required by Pennsylvania law when the vote margin falls below 0.5%.",
    "It also gives him a chance to review multiple polls for trends that might show a certain candidate with momentum behind them, one of the Trump advisers said.",
    "\"He could have been an absolute star long-term in the party,\" one Trump adviser said, adding that Cawthorn \"only has himself to blame.\"",
    "\"We have to secure a massive victory for Dr. Oz,\" Trump told his supporters at the time to mixed enthusiasm from the crowd.",
    "My guess is that will have the biggest effect on the endorsement process,\" one of the former Trump campaign officials said.",
    "Vance, another Thiel confidant and Trump-endorsed candidate, won the Ohio Republican Senate primary earlier this month.",
    "With a flood of support from big-name Republicans such as former Vice President Mike Pence and former New Jersey Gov.",
    "In the Arizona Senate race, a Trump endorsement of Peter Thiel protg Blake Masters seemed likely after J.D.",
    "Janice McGeachin, who had Trump's support in a state he carried by more than 30 points in 2020.",
    "At his election night event, Oz told attendees, \"When all the votes are counted, we will win.\"",
    "But people close to Trump now expect him to hold off on picking a candidate anytime soon.",
    "\"He'll be a lot more selective for sure,\" another former Trump campaign official said.",
    "He has repeatedly touted his endorsement record and the \"winners\" he's picked.",
    "\"This is not how he expected this to go,\" said one of the advisers.",
    "Brad Little winning his GOP primary by some 20 points over Lt. Gov.",
    "Ted Cruz and Josh Hawley, respectively.",
    "\"Georgia will be an absolute bloodbath.",
    "Nor has Trump weighed in on Idaho Gov.",
    "Chris Christie, incumbent Gov."
  ]
}