{
  "id": 7065,
  "mediaId": 151,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Georgia's Latino population keeps growing. Why are there so few in office?",
  "image": "https://www.politico.com/dims4/default/f32c8df/2147483647/legacy_thumbnail/1200x900%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fb5%2F28%2Fd15880cb40f7a4bdbafd342d6172%2Fap22059715672382.jpg",
  "link": "https://www.politico.com/news/2022/05/21/latinos-georgia-battleground-state-00034228",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "The last 10 years has been one of increased political involvement of Latinos in Georgia,? said Esteves, who is Puerto Rican and became the first Latino elected to a Georgia school board in 2013. Organizations like Latino Victory and ones on the ground like GALEO and the Latino Community Fund have been trying to cultivate and grow the pipeline of potential candidates to go hand-in-hand with what weve seen the momentum be on the professional, business and civic side of things.?\nFor Jason Anavitarte, the first Latino Republican elected to the state Senate, the prospect of having more Latinos, regardless of their party affiliation, elected to the General Assembly is welcome  and much needed.",
    "Latino Victory Fund has endorsed three candidates ahead of the May 24 primary: Jason Esteves, the chair of the Atlanta Board of Education who is running for state Senate; Phil Olaleye, the head of an Atlanta-based education nonprofit running for state House; and Michelle Schreiner, a psychologist and community advocate running for state House.",
    "Rayes explained that part of the reason why there has been a limited number of Latinos running for office in Georgia and across the country is that the infrastructure is not set up for our success, unfortunately,? given the amount of money, and access to a donor and political network, needed to run a successful campaign.",
    "I think we are going to come out with more Latinos on the November ballot than weve ever had before, and thats for certain, given that we have folks both on the Republican and Democratic side running,? said Gonzalez, the founding and current CEO of GALEO.",
    "Latino leaders in the state are quick to tout the progress thats been made in recent years, but want to get past all the talk of firsts. Because at present, they say, Latinos represent less than 1 percent of elected officials in the state.",
    "Latino Victory Fund plans to spend at least six figures to help the candidates after the primaries, as well as Democratic Sen. Raphael Warnocks reelection and Democrat Stacey Abrams bid for governor, in the lead-up to the general election.",
    "The first step for groups like GALEO and Latino Victory Fund has been to get more Latinos engaged in politics and running for office, in an attempt to harness the power of the fast-growing community.",
    "Georgias surprising dearth of Latinos in elected office has sparked a concerted effort by state and national groups to elect more Latinos, backed by a financial commitment to accomplish the goal.",
    "With the national spotlight now fixed on Georgias battleground status  and the state poised to play a pivotal role in the 2024 presidential race  Latino leaders are on a mission to change that.",
    "In a sign of Latino Victory Funds commitment, the D.C.-based groups top leaders, including Board Chair Luis Miranda, Jr., were in Atlanta last week to canvass for the three candidates.",
    "Other barriers, such as at-large voting in many of the local jurisdictions and lack of access to Spanish-language materials in Latino-heavy areas, are also significant obstacles.",
    "| Jeff Amy/AP Photo\nBy Sabrina Rodriguez\n 05/21/2022 07:01 AM EDT\nNot so long ago, Jerry Gonzalez remembers, it was hard to find even one Latino running for office in Georgia.",
    "That in and of itself is going to be historic  Now, we still have quite a ways to go.?\nOver the past five years, there have been several firsts for Latinos in the state.",
    "The most recent round of redistricting in the state sliced and diced our communities to make it more difficult for folks to run for those offices,? Gonzalez said.",
    "Theres no doubt our presence has grown, but I dont think that its grown at the speed the population has grown,? said Anavitarte, who is of Puerto Rican descent.",
    "Theres no doubt our presence has grown, but I dont think that its grown at the speed the population has grown,? said Republican state Sen. Jason Anavitarte.",
    "He was one of the only Latinos he knew involved in politics at the time, so serving as the only Latino in the state Senate was a familiar experience.",
    "Suburban Atlantas Gwinnett County is currently the only county in the state required by law to offer Spanish-language election materials.",
    "GALEO, specifically, for almost two decades has led summits and programs aimed at getting Latinos more involved in their communities.",
    "The two candidates, both Democrats, are being supported by major Latino groups, such as Latino Victory Fund and GALEO Impact Fund.",
    "Either way, for a state with more than a million Latinos  almost 10 percent of the population  thats a stunningly small figure.",
    "Today, the longtime head of the Georgia Association of Latino Elected Officials can list eight just off the top of his head.",
    "We cant say were a representative government and have only 1 percent of Latinos in political power [in Georgia].",
    "The actual number running for the state Legislature and statewide and federal office this year is closer to 10.",
    "This year, Georgia could elect the first Afro-Latino to the state Senate and state House of Representatives.",
    "Were definitely going to see some Republican and Democratic Latinos elected this cycle,? Anavitarte added.",
    "Anavitarte first got involved in politics as a council member in his hometown of Doraville in 2003.",
    "Brian Kemp made history appointing the first Latino to hold a statewide constitutional office.",
    "In 2017, Georgia elected its first Hispanic mayor and first Latina to the state Legislature.",
    "To that end, the groups help candidates with fundraising, hosting events and voter outreach.",
    "Thats simply unacceptable,? said Nathalie Rayes, president and CEO of Latino Victory Fund.",
    "Other parts of the state with significant Latino populations dont go that far.",
    "But those are just a few of the challenges faced by Latino candidates.",
    "The basis of our government is that were a representative government.",
    "In 2021, the first Latino Republican was elected to the state Senate.",
    "And there are only three in the states 236-member General Assembly.",
    "The progressive group also hosted a fundraiser for the candidates.",
    "Now comes the trickier part  actually getting people elected.",
    "We need to have Latinos at the table.?",
    "And thats good, its positive.",
    "Two years later, Gov."
  ]
}