{
  "id": 7067,
  "mediaId": 238,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Voting is surging in Georgia despite controversial new election law",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/21/voting-is-surging-georgia-despite-controversial-new-election-law/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Brown",
  "authorUrl": "https://www.washingtonpost.com/people/matthew-brown/",
  "termIds": [
    2095
  ],
  "sentences": [
    "The law imposes new identification requirements for those casting ballots by mail, curtails the use of drop boxes for absentee ballots, makes it a crime for third-party groups to hand out food and water to voters standing in line, blocks the use of mobile voting vans  as Fulton County did in 2020 after purchasing two vehicles at a cost of more than $700,000  and prevents local governments from directly accepting grants from the private sector for election administration.",
    "From day one, I said that Georgias election law balanced security and access, and the facts have proved me right.?\nThe states GOP-controlled legislature became one of the first of dozens across the nation last year to approve restrictions on how ballots are cast and counted following the 2020 presidential election, when then-President Donald Trump attacked, without evidence, the validity of results in six states he lost, including Georgia.",
    "GRIFFIN, Ga.  When the Spalding County Board of Elections eliminated early voting on Sundays, Democrats blamed a new state law and accused the Republican-controlled board of intentionally thwarting Souls to the Polls,? a get-out-the-vote program among Black churches to urge their congregations to cast ballots after religious services.",
    "If we encourage the areas that havent gotten out, then maybe wed get a better representation of the people who are here and then theyll feel they have more of a voice and would be a little bit happier about the politics.?\nRepublican members of the Spalding County elections board did not respond to requests for interviews.",
    "A lot of people are concerned about their democracy.?\nDefenders of the law accused Democrats, including President Biden and Stacey Abrams, the presumed Democratic nominee for Georgia governor this year, of hyping accusations of voter suppression because it resonated with their base and helped them raise money.",
    "Spalding County does not and has not had any extended wait times at polling locations to as yet justify the addition of the optional Sunday overflow advance voting days.?\nPatsy Reid  70 years old, Black and retired  said she was surprised she didnt encounter problems when she voted early this month.",
    "At a public library in Dunwoody, in the northern Atlanta suburbs, polling manager Renata Fleming said that in the weeks ahead of Election Day in 2020, the mail-ballot drop box was filled with scores of ballots at the end of each day when teams of election workers emptied it.",
    "It may contradict the voter suppression narrative but those are the facts.?\nVoting rights groups said they have stepped up their voter registration and education efforts to ensure that Georgians know how to vote under the new rules and are not afraid to do so.",
    "Raffensperger, too, likes to point out in public speeches that voting-rights groups are suing him over the new requirement to include an identification number on mail ballots, even though Minnesota has imposed a similar requirement for about a decade.",
    "Activists are gearing up to work around that rule by setting up tables away from long lines and encouraging voters to step off the line  and for their neighbors to hold their places  if they are hungry or thirsty or weary of standing.",
    "Biden called it Jim Crow 2.0.? Abrams accused its authors of reviving Georgias dark past of racist voting laws.? The clothing retailer Patagonia condemned the bill, and Major League Baseball moved its All-Star Game out of Atlanta.",
    "I didnt want to take any chances.?\nTurnout numbers for early and mail voting in Tuesdays primary show a dramatic drop in mail voting over 2020, when the primary was conducted during the early months of the coronavirus pandemic.",
    "With the businesss recently unveiled mural of the late congressman and civil rights leader John Lewis as a backdrop, the group hoped the event would help energize the surrounding community, which is predominantly Black.",
    "Local and national organizations, including the Metro Atlanta Chamber of Commerce and Atlanta-based Delta Air Lines, had put enormous pressure on state Republicans to strip out some of the more contentious provisions.",
    "The countys elections board removed only a handful of the registrations after New Georgia Project sent a letter warning of the legal consequences of removing voters from the rolls without sufficient evidence.",
    "In Spalding County, for instance, local activists moved Souls to the Polls to a Saturday, and they defiantly promised that they would work twice as hard if that was what it took to protect voter access.",
    "He noted that Spalding is now required to offer early voting on two Saturdays, rather than just one, so the elimination of Sunday voting does not reduce the overall number of weekend early-voting days.",
    "But after three weeks of early voting ahead of Tuesdays primary, record-breaking turnout is undercutting predictions that the Georgia Election Integrity Act of 2021 would lead to a falloff in voting.",
    "The optional Sunday voting days are intended to be used in the event that there are extended wait times to vote, necessitating the addition of the optional advance voting days,? he wrote.",
    "Cliff Albright of Black Voters Matter, a Georgia-based voting rights group, said that issue will probably be more pronounced in November, when turnout will be higher than on Tuesday.",
    "In Griffin, Republicans gained a majority on the Spalding County Board of Elections last year and decided this spring to eliminate Sunday voting, as allowed under the new state law.",
    "And in case you didnt know, Minnesota is a blue state,? Raffensperger who, along with Kemp, is running for reelection, said in a recent speech to local business leaders in Savannah.",
    "By Friday, the final day of early in-person voting, more than 700,000 Georgians had cast ballots  three times the number in 2018, and higher even than in 2020, a presidential year.",
    "With 95 percent of eligible voters actually registered, Georgia currently boasts the highest registration rate in the nation, and voting groups take some of the credit for that.",
    "Contrary to the hyperpartisan rhetoric you may have heard inside and outside this gold dome, the facts are that this new law will expand voting access in the Peach State,? Gov.",
    "I had heard that they were going to try to deter us in any way possible because of the fact that we didnt go Republican on the last election, when Trump didnt win,? Reid said.",
    "He said an internal analysis found a 400 percent increase in mail-ballot rejection rates in last years municipal elections, which took place after the new law was implemented.",
    "Reid cast her ballot for Abrams in the Democratic primary but feared that her vote could be discounted given reports of voter suppression against people of color in Georgia.",
    "Paul Glaze, a spokesman for the New Georgia Project, a voter registration group founded by Abrams, said there is already evidence of the chilling effect of Senate Bill 202.",
    "With drop boxes now required to be inside of polling locations rather than curbside, and accessible only during voting hours, its just as easy to vote in person, they said.",
    "Brian Kemp (R) said last March as he signed the bill, noting that every county in Georgia would have expanded early voting on the weekends for the first time in history.",
    "He also noted that the bills provision allowing any voter to challenge registrations led to an attempt in Forsyth County to reject the registration of 13,000 voters.",
    "Its just going to be letting them know that because of this voter suppression law, they need to be more mindful about being prepared for long lines,? Albright said.",
    "And so we are both using the same process.?\nSome voters interviewed at polling locations said they were unwilling to take any chances with the new ID requirement.",
    "It was a direct way to send a message to the Black community that theyre in charge now,? said Elbert Solomon, vice chairman of the county Democratic committee.",
    "Johnson also pushed back on the idea that Souls to the Polls? is a long-standing tradition in Spalding, with Sunday voting having existed only for a few years.",
    "But the group is using Tuesday as a dry run, and is sending out text messages and radio ads urging voters to bring their own water, chairs and phone chargers.",
    "To go in there and vote as easily as I did and to be treated with the respect that I knew I deserved as an American citizen  I was really thrown back.?",
    "But in a letter provided to The Washington Post, the board chairman, Ben Johnson, denied that the elimination of Sunday voting was racially motivated.",
    "Abrams and President Biden lied to the people of Georgia and the country for political gain,? Georgia Secretary of State Brad Raffensperger (R) said.",
    "The requirement that prohibits third-party groups from distributing food or water to voters waiting in line drew sharp criticism last year.",
    "They said some of the drop in mail voting is to be expected, given that Georgia was never a big vote-by-mail state before the pandemic hit.",
    "However, state election officials said comparing mail voting numbers this year to a presidential election during a pandemic is misleading.",
    "Since then, local Democrats have mobilized around the issue of voting rights, holding registration drives and expanding their membership.",
    "The party teamed up with Black Voters Matter this month to host a Mothers Day-themed voter registration festival at a Griffin laundromat.",
    "Before the pandemic, Georgians voted in person at the same rate theyre voting in person now,? said Raffensperger spokesman Ari Schaffer.",
    "Republicans agreed to drop, for instance, language barring most Georgians from voting by mail and curtailing early voting on weekends.",
    "They made it hard,? said Preston Wallace, a retiree from Chamblee who voted by mail in 2020 but chose to do so in person this year.",
    "In the 2018 midterm primary, for instance, 7 percent of early votes were mail ballots  slightly less than the percentage this year.",
    "Roughly one-third of early voters cast their ballots by mail that year, while this year that figure has dropped to 8 percent.",
    "This year, a log taped to the side of the drop box listed the numbers of ballots collected in the first two days of activity.",
    "They opted to vote in person this year because they were afraid their ballot might be rejected under the new ID requirements.",
    "But much of the rhetoric directed at the bill was actually based on draft legislation that was subsequently scaled back.",
    "Voting-rights groups and Democrats say they have changed their strategies to mobilize voters under the new rules.",
    "This area specifically is not known for getting out and voting,? said Vett Johnson, the laundromats owner.",
    "The Election Integrity Act, also known as Senate Bill 202, unleashed a furious backlash when it passed.",
    "Im not certain about the drop-offs, or if the mail is going to get picked up on time.",
    "They say the turnout numbers prove that the rhetoric around the law was false.",
    "But every day we get people walking through the door, White and Black.",
    "They even expanded early-voting hours in the final bill.",
    "What were seeing is a return to pre-pandemic normal.",
    "On May 3, the number was eight.",
    "The next day, it was three.",
    "I just dont trust it.",
    "We are a red state."
  ]
}