{
  "id": 7077,
  "mediaId": 129,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "In Georgia, a G.O.P. Primary Tests the Power of a Trump Vendetta",
  "image": "https://static01.nyt.com/images/2022/05/20/multimedia/20pol-gasos-raffensperger-photo01/20pol-gasos-raffensperger-photo01-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/20/us/politics/georgia-republican-primary-secretary-of-state.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Ultimately, the guy took as much heat as anybody and came out on the other side standing.?\nDespite the high interest in the showdown, less than $1 million has been spent on television advertising in both the Democratic and Republican primary races for Georgias secretary of state, according to AdImpact, an ad-tracking firm, with the candidates exchanging attacks over the outcome of the 2020 presidential election and voting integrity.",
    "He has claimed, falsely, that Mr. Trump would have won in Georgia if the election had been fair.?\nAt a meeting with the Atlanta Young Republicans on Thursday, Mr. Hice made unsupported claims about ballot harvesting,? said he no longer wanted to use Dominion Voting machines and slammed Mr. Raffensperger for sending out unsolicited absentee ballots ahead of the last election.",
    "When voters see that kind of activity around the concern they have, it just becomes difficult to drive an argument that people who are in office are being inattentive to the issue,? said Brad Alexander, an Atlanta-based political consultant and Raffensperger supporter, who was among several who argued that the potency of the stolen? election debate has started to wane.",
    "While polls have shown that leagues of Republican voters in Georgia and elsewhere largely embraced the fiction that the 2020 election was stolen? in its immediate aftermath, it is not clear those concerns alone, or Mr. Trumps personal vendetta, are enough to drive voters choices.",
    "The district attorneys office in Westchester County, N.Y., appears to be focused at least in part on whether the Trump Organization misled local officials about the value of a golf course, Trump National Golf Club Westchester, to reduce its taxes.",
    "The attorney general for the District of Columbia sued Mr. Trumps inaugural committee, saying it vastly overpaid the Trump Organization for space at the Trump International Hotel during the January 2017 inaugural celebration.",
    "The biggest spender on broadcast television has been Bee Nguyen, the leading candidate in the Democratic primary who has cast herself as a bulwark against Republican efforts to restrict voting access and meddle in elections.",
    "But now theyre keenly aware of it.?\nMr. Hice is one of more than a dozen candidates running for secretary of state under the America First banner, alongside others in battleground states like Arizona, Michigan and Ohio.",
    "Most of the voters, convened by the group, the Republican Accountability Project, knew little about the race between Brad Raffensperger, Georgias secretary of state, and his leading challenger, Representative Jody Hice.",
    "Even if youre not a dogmatic, election-was-stolen person, there are a lot of people with reasonable doubt, and that reasonable suspicion is fair,? said Chris Campbell, 39, a national accounts manager at SmartFeeds.",
    "County officials in Georgia identified 64 cases of potential fraud out of the states roughly 5 million votes in the 2020 election, according to an Associated Press survey of all but 11 of the states 159 counties.",
    "But Mr. Trump has been unexpectedly quiet about the race, beyond lumping Mr. Raffensperger in with Mr. Kemp in statements railing against what he calls the R.I.N.O.s  Republicans in name only  running the state.",
    "Two years after Mr. Trump lost Georgia by the slimmest of margins and Democrats captured both of the states open Senate seats, wounds from the 2020 election have still not completely healed for some partisans.",
    "ATLANTA  An anti-Trump Republican advocacy group recently organized a focus group of G.O.P voters in Georgia to get their take on perhaps the most competitive and consequential primary election in the state.",
    "Thats what weve got to protect at all costs.?\nMost of the young Republicans in the room said they wanted to hear what Mr. Hice would do differently from Mr. Raffensperger in elections should he be elected.",
    "Sarah Longwell, the founder of the Republican Accountability Project, which conducted the focus group last week, said that Mr. Trumps limited involvement could be playing a role in some voters indecision.",
    "Mr. Trump himself is under scrutiny in Georgia, where the district attorney of Fulton County has been investigating whether he and others criminally interfered with the 2020 election results in the state.",
    "Mr. Raffensperger has worked to win back Republicans by casting himself as a defender of election integrity,? even as he has spent hours debunking a laundry list of false claims about the 2020 election.",
    "Looking back at 2020 isnt productive.?\nMany Republicans declared Mr. Raffensperger all but defeated as soon as he announced he would run for re-election, citing Mr. Trumps ire and that of many voters.",
    "At an event hosted by the Buckhead Young Republicans, Mr. Raffensperger discussed the 2020 election, but said his office was focused on the real issue? of preventing noncitizens from voting.",
    "and one of the worst secretary of states in America.?\nMr. Raffenspergers ads have tried to rally Republicans against a common opponent  Stacey Abrams, the Democratic nominee for governor.",
    "For voters still enthralled with false claims of fraud, Mr. Kemp can point to the Election Integrity Act of 2021, which limits provisions like ballot drop boxes and mobile voting centers.",
    "The New York attorney generals office has been assisting with the Manhattan district attorneys investigation while conducting its own civil inquiry into some of the same conduct.",
    "In January, 43 percent of Georgia Republican voters said they were confident that the November elections would be fair and accurate, according to a University of Georgia poll.",
    "He later took part in a White House meeting alongside Representative Marjorie Taylor Greene to try to determine how the election results could be flipped in Mr. Trumps favor.",
    "As the state official responsible for certifying the 2020 presidential election results, Mr. Raffensperger rejected President Donald J. Trumps attempt to overturn his defeat.",
    "The investigation is focused on the discovery by the National Archives that Mr. Trump had taken 15 boxes of documents from the White House to Mar-a-Lago when he left office.",
    "The exchange offered a glimpse into why the Republican primary race for the office that oversees elections remains a dogfight just days from Election Day, on May 24.",
    "Mr. Kemp has been adept at using his office to win over skeptical Republicans, passing a slew of conservative policies on elections, law enforcement and education.",
    "But I do have confidence in Hice and trust that he would run the office with integrity.?\nThe Trump Investigations\nCard 1 of 8\nWhite House documents investigation.",
    "But in this race here, Im leaving it to the goodness of my fellow Georgians who stood for the law, made sure that we followed the Constitution and follow the law.",
    "There wasnt anything that anyone else would have done to do anything,? said Bradley Schober, 27, an attorney who said he had already voted for Mr. Raffensperger.",
    "The civil inquiry is focused on whether Mr. Trumps statements about the value of his assets were part of a pattern of fraud or were simply Trumpian showmanship.",
    "And a record number of voters have already participated in the states primary elections, topping more than 700,000 voters on the final day of early voting.",
    "I think 2020 was really a turning point in how closely people looked at things,? said Salleigh Grubbs, chairwoman of the Cobb County Republican Party.",
    "Mr. Hice, a four-term congressman, was one of the 147 House Republicans who voted against certifying the election results for President Joe Biden.",
    "The Justice Department has begun a grand jury investigation into the handling of classified materials that ended up at Mr. Trumps Florida home.",
    "Mr. Hices ads have showcased footage of him and Mr. Trump at a rally in Georgia, where the former president called Mr. Raffensperger a R.I.N.O.",
    "Mr. Raffensperger has called for amending the state Constitution to prohibit noncitizens from voting, something that state law already forbids.",
    "Mr. Raffensperger has raised more money than his competitors, courting far-right voters and touting what he calls true conservative? values.",
    "And thats all I can do.?\nThe roughly 15 people present at the event  mostly 20-something conservatives  were receptive to his message.",
    " arent healthy,? said Allen English, the president of the Atlanta Young Republicans, who remained undecided between the candidates.",
    "Mr. Trump has hardly weighed in publicly on Mr. Perdues prospects since hosting a tele-rally? for the former senator in April.",
    "His former vice president, Mike Pence, is set to visit the state to campaign for Mr. Kemp on the eve of the primary election.",
    "Before, people might not have even realized that the secretary of state was in charge of running the elections for the state.",
    "While some still had concerns about election oversight, they said they appreciated his candor in the face of ongoing attacks.",
    "It all has made the race one of the purest tests yet of whether the 2020 election lie can be weaponized to win elections.",
    "Brian Kemp after the governor refused to overturn the election results, is trailing Mr. Kemp in polls and fund-raising.",
    "Mr. Trumps attempt at payback for 2020 in Georgia is floundering in the states other marquee primary on Tuesday.",
    "But Mr. Hice has tried to make his case about more than just 2020  raising the prospect of fraud in the future.",
    "If the election itself is compromised or violated, then all the effort out there really doesnt matter anymore.",
    "Mr. Raffensperger seemed to get the benefit of the doubt  until the voters were reminded of the back story.",
    "Some are calling for a law enforcement arm to more aggressively prosecute violators of election laws.",
    "The issue is not who wins an election, but the issue is absolutely, Was it a fair election?? he said.",
    "The group she founded, Fair Fight, sued the state over discriminatory election practices in 2018.",
    "The committee and Mr. Trumps family business later agreed to pay $750,000 to settle the lawsuit.",
    "They share an unflinching loyalty to Mr. Trump and a belief that the 2020 election was marred.",
    "When Stacey Abrams attacked Georgias elections, Jody Hice did nothing,? the ads narrator says.",
    "Mr. Raffensperger acknowledges that his pitch has done little to pacify some Republicans.",
    "Raffensperger didnt address those concerns well, and people dont have confidence in him.",
    "I just think that some people werent pleased with the election results,? he said.",
    "A state review found no instances of ballots being cast by noncitizens in 2020.",
    "Questions around the 2020 election  like, Was it stolen, or was it not stolen?",
    "When our voting rights are attacked,? Ms. Nguyen says in one ad, we all lose.?",
    "But marshaling that residual anger to unseat an incumbent is not an easy feat.",
    "A special investigative grand jury has been seated in the case.",
    "Many never had strong opinions about their secretary of state.",
    "The voice of the people had been violated? in 2020, he said.",
    "By April, that number had increased to nearly 60 percent.",
    "Former Senator David Perdue, his pick to challenge Gov.",
    "But there were clear divisions over that conclusion.",
    "Mr. Raffensperger was censured at a state G.O.P.",
    "Some voters memories and passions have faded.",
    "Mr. Trump recruited Mr. Hice to seek revenge.",
    "Westchester County criminal investigation.",
    "And thats what weve got to defend.",
    "Go Jody, I guess?? said one voter.",
    "The lawsuit is currently in court.",
    "Three out of six others agreed.",
    "They heard a lot of indecision.",
    "New York State civil inquiry.",
    "I was never Public Enemy No.",
    "Washington, D.C., lawsuit.",
    "Georgia criminal inquiry.",
    "convention last year.",
    "1."
  ]
}