{
  "id": 7084,
  "mediaId": 558,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Hyundai's first all-EV factory in the US will be in Georgia",
  "image": "https://s.yimg.com/ny/api/res/1.2/klwHUb.L51mZP1DkOqDUUw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/f5e00590-d877-11ec-bbbb-5990af2d7ebd",
  "link": "https://sg.news.yahoo.com/hyundai-ev-factory-us-georgia-213034691.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Fingas",
  "authorUrl": "https://www.yahoo.com/author/jon-fingas",
  "termIds": [
    2095,
    2986,
    2990,
    2672,
    2900,
    2945
  ],
  "sentences": [
    "This represents a major commitment to EVs, however, and suggests Hyundai is racing to compete with Tesla, Rivian, Volkswagen and other brands expanding their electric car production in the country.",
    "Hyundai pointed to \"favorable business conditions\" that included speedy market access, a large talent pool and an existing network that includes Kia's main manufacturing hub as well as suppliers.",
    "The factory is less than 31 miles from Savannah's port, which is the largest container stopover in the US and has two railway facilities at its disposal.",
    "They estimate the investment to be worth $5.54 billion, with Governor Brian Kemp claiming it will be the \"largest project\" in state history.",
    "Add the proximity of two major highways (the I-95 and I-16) and it will be easy for Hyundai to receive supplies and ship finished EVs.",
    "Hyundai further claimed the plant would create 8,100 jobs, although it's not clear how many of those are full-time, permanent roles.",
    "The 2,923-acre plant near Savannah will make cars and batteries when production is projected to start in the first half of 2025.",
    "The company expects to manufacture 300,000 EVs per year at the facility, covering a \"wide range\" of models.",
    "The annual production level won't be quite as strong as Hyundai's conventional manufacturing output.",
    "The automaker has struck a deal with Georgia to build its first dedicated EV factory in the US.",
    "The company's Montgomery, Alabama plant can make up to 399,500 vehicles per year.",
    "Not surprisingly, both Georgia and Hyundai are touting economic benefits.",
    "Unnamed incentives play a part, according to Savannah Morning News.",
    "Hyundai is betting big on American electric vehicle sales.",
    "However, it's also a prime spot for transportation.",
    "Multiple factors led to the location choice.",
    "Construction starts in early 2023."
  ]
}