{
  "id": 7085,
  "mediaId": 136,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Pence-Backed Kemp Pulls Away From Trump-Endorsed Perdue: GA Primary Poll",
  "image": "",
  "link": "https://www.newsweek.com/pence-kemp-pulls-away-trump-endorsed-perdue-georgia-primary-poll-republicans-1708506",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    2095
  ],
  "sentences": [
    "The poll also found that 36 percent of respondents said Trump's endorsement of Perdue had had no effect on their views, while 37 percent said it made them more supportive and 24 percent said they had become less supportive of Perdue as a result.",
    "Trump has been critical of Pence for not doing enough to try to overturn the results of the last presidential election, while Pence has defended his actions on January 6, 2021, and distanced himself from his former boss.",
    "A new poll shows Georgia Governor Brian Kemp enjoys a huge lead over his Republican challenger, former Senator David Perdue, ahead of the primary that's due to take place on May 24.",
    "Donald Trump has endorsed Perdue, who has supported the former president's unfounded claims of mass voter fraud and other irregularities in the 2020 presidential election.",
    "A Fox News poll published on Wednesday showed Kemp with 60 percent support among Republican primary voters in Georgia, compared to just 28 percent for the former senator.",
    "Kemp now enjoys the backing of former Vice President Mike Pence who is set to appear at a rally for the Republican governor on May 23 - a day before voters go the polls.",
    "Kemp strongly defended the integrity of Georgia's election results, while former Senator Perdue has made claims of electoral fraud a major part of his primary campaign.",
    "In an ad released in April, Perdue directly accused Kemp of allowing the election to be stolen and blamed him for the state of the country under Biden.",
    "The Georgia gubernatorial race will be yet another test of the power of his endorsement, which has brought mixed results in the most recent primaries.",
    "'Successful Governor'\nIn announcing his visit to Georgia last week, Pence called Kemp \"one of the most successful conservative governors in America.\"",
    "The Fox News survey was conducted from May 12 to 16 among 1,004 Georgia Republican primary voters and has a margin of error of +/- 3 percent.",
    "Trump campaigned for Perdue at a rally in the state in March, but since that visit, Kemp's lead over his Republican rival has only risen.",
    "The Georgia GOP primary may be seen as the first real contest between Trump and Pence since the pair left office on January 20, 2021.",
    "Support for Kemp has risen sharply since a Fox News poll in March found the governor had 50 percent support to Perdue's 29 percent.",
    "Trump has also frequently criticized Kemp over the 2020 election results in a similar way to the complaints he's made about Pence.",
    "\"Folks, that all started right here when Brian Kemp sold us out and allowed radicals to steal the election,\" Perdue said.",
    "His endorsement of Kemp will add to ongoing speculation that Pence is considering a presidential bid in 2024.",
    "The former president lost Georgia, long considered a red state, to President Joe Biden.",
    "I'll make sure our elections are never stolen again,\" the former senator added.",
    "Newsweek has asked the Kemp and Perdue campaigns for comment.",
    "\"Enough is enough."
  ]
}