{
  "id": 7094,
  "mediaId": 1576,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Announcement expected to confirm $7B auto plant in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/05/AP21361547573276-336x189.jpg",
  "link": "https://www.wabe.org/announcement-expected-to-confirm-7b-auto-plant-in-georgia/",
  "sentiment": "0.0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Brian Kemp planned to travel to the site Friday for what his office would only describe as a special economic development announcement.?\nA Washington official has previously told The Associated Press the project will be a massive auto plant where Hyundai Motor Group will manufacture electric cars.",
    "Expected to cost $7 billion and employ up to 8,500 workers, according to two Georgia officials familiar with the plans, the plant would rank among the largest development deals ever in Georgia.",
    "Perdue says the deal transfers money to liberal financiers and the state failed to consulted with local residents who fear the plant threatens their rural quality of life.",
    "In his primary campaign against Kemp, Perdue has attacked the Rivian deal and its promises of $1.5 billion in incentives and tax breaks by Georgia and local governments.",
    "A year after the state of Georgia and local government partners spent $61 million to buy a sprawling tract of land for future industrial development, Gov.",
    "The land sits adjacent to Interstate 16 that links Savannah and Macon, not far from its intersection with Interstate 95 that spans the eastern seaboard.",
    "State and local officials purchased the 2,200-acre (890-hectare) site a year ago in Bryan County, about 25 miles (40 kilometers) inland from Savannah.",
    "Rivian Automotive announced in December plans for a $5 billion electric truck plant east of Atlanta thats expected to employ about 7,500 workers.",
    "Bryan County and neighboring Chatham County, which includes Savannah, each chipped in $9 million toward the $61 million purchase price.",
    "The announcement comes five days before Kemp faces a contested Republican primary election against former U.S. Sen. David Perdue.",
    "The South Korean automaker already operates two American assembly plants in Montgomery, Alabama, and in West Point, Georgia.",
    "None of the three officials were authorized to discuss the project publicly and spoke on condition of anonymity.",
    "It also coincides with President Joe Bidens visit to South Korea, where Hyundai is headquartered.",
    "It would be the second huge electric vehicle plant announced in Georgia in less than a year.",
    "Its also near to the Port of Savannah, the fourth-busiest U.S. seaport.",
    "Hyundai Motor Group sells cars under the Hyundai and Kia brands.",
    "Amy reported from Atlanta and Madhani reported from Washington."
  ]
}