{
  "id": 7095,
  "mediaId": 157,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Trump growing gun shy about endorsements as his losses pile up: report",
  "image": "https://www.rawstory.com/media-library/donald-trump.png?id=29829903&width=1200&coordinates=0%2C24%2C0%2C26&height=600",
  "link": "https://www.rawstory.com/donald-trump-endorsements-2657359611/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    2095
  ],
  "sentences": [
    "According to the report, things are about to get worse for Trump with Georgia's primary on Tuesday, with Orr reporting, \"...while Tuesday's primaries in Pennsylvania and North Carolina may have delivered mixed results for the former President, next week's much-anticipated gubernatorial primary in Georgia is looking increasingly likely to hand Trump a major setback.",
    "According to reports from both Politico and CNN, former President Donald Trump is unhappy that a substantial number of candidates he has endorsed have faltered at the polls and he will be more circumspect going forward over fears that he will be seen as weak when it comes to dictating the future of the Republican Party.",
    "Brian Kemp is widely favored to fend off a GOP primary challenge from former Sen. David Perdue, who was hand-picked and recruited by Trump last year amid the former President's frustration with Kemp's refusal to contest the 2020 election results in Georgia.\"",
    "As Orr reported, Trump is \"'agitated' by the uncertain outcome in the Keystone State primary, where his endorsement of celebrity doctor Mehmet Oz failed to translate into a decisive win against former hedge fund manager David McCormick.",
    "Writing Trumps record in competitive races now stands at \"seven wins and four losses  a 64% winning percentage\" Lizza suggested, \"Thats not bad, but its not nearly as good as the padded win-loss record Trump world promotes.\"",
    "As Politico Playbook notes, Trump has not been as successful at picking winners as his supporters would like people to believe, and his success rate has been inflated by endorsing candidates facing little or no competition.",
    "As Politico's Ryan Lizza wrote, \"Trumps endorsement losses are starting to pile up,\" adding, \"Most of his endorsementshave been in races where his anointed candidate faced little or no competition.",
    "Adding to his current woes and damage to his reputation is the floundering campaign of Dr. Mehmet Oz for the GOP nomination for an open U.S. Senate seat that could be headed to a recount.",
    "If Oz loses, it puts him in an awkward spot because he absolutely trashed David McCormick at his rally and pissed off quite a few allies who never thought he should have endorsed Oz.\"",
    "As of Thursday morning, the race remains tight and appears likely to head to an automatic recount as required by Pennsylvania law when the vote margin falls below 0.5%.\"",
    "That, in turn, led to CNN's Gabby Orr reporting that aspiring candidates seeking the former president's endorsement may not get their phone calls returned.",
    "With a flood of support from big-name Republicans such as former Vice President Mike Pence and former New Jersey Gov.",
    "Nobody would be impressed by a handicapper who won placing bets at a track featuring races with only one horse.\"",
    "My guess is that will have the biggest effect on the endorsement process.\"",
    "As one of his advisers put it: \"This is not how he expected this to go.",
    "As one Trump aide lamented, \"Georgia will be an absolute bloodbath.",
    "Chris Christie, incumbent Gov."
  ]
}