{
  "id": 7104,
  "mediaId": 157,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Trump wants a loyalist to oversee Georgia elections  but his preferred candidate is running odd campaign",
  "image": "https://www.rawstory.com/media-library/republican-demands-god-save-america-from-coronavirus-we-need-the-aid-of-the-almighty.jpg?id=24821407&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/jody-hice-georgia-2657360583/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    2095
  ],
  "sentences": [
    "The former president has endorsed GOP Rep. Jody Hice in his primary challenge to the state's top election official, but a recent poll shows the two Republicans deadlocked in the 20s with nearly 40 percent of voters undecided, and two other challengers combined for about 9 percent support, reported Politico.",
    "Im seeing a lot of ads on social media from Brad Raffensperger, little bit from the others, from David Belle Isle, and not a whole lot from Jody Hice, which is odd,? said former state representative Buzz Brockway, who finished fourth in the 2018 secretary of state primary.",
    "GOP voters strongly preferred Hice to Raffensperger by a 60-16 margin when told of Trump's endorsement, but that poll found that few voters actually knew about the former president's backing, and Republican pollsters say the incumbent secretary of state and Gov.",
    "I think a lot of the early projections about Raffenspergers demise were based on the idea that Trump was going to be very aggressive in that state campaigning against him,? said Republican pollster Sarah Longwell, who has worked with anti-Trump GOP groups.",
    "Donald Trump wants vengeance against Georgia secretary of state Brad Raffensperger, who refused to go along with his attempts to overturn his 2020 election loss, but the former president's preferred candidate to replace him isn't getting much traction.",
    "Trump has promoted Hice's campaign at rallies and in a robocall, but even politically aware Georgia voters say they haven't heard much from Hice himself, and many GOP voters mistakenly believe he's a woman.",
    "Voters like Kemp, so Trump -- its going to be embarrassing for him, so he just really kind of stayed out of the state, and thats allowed Raffensperger to kind of fly under the radar.?",
    "I think its competitive, and I dont know that many prognosticators saw that coming a year ago, that Raffensperger is in it,\" said Georgia GOP operative Brian Robinson.",
    "Brian Kemp remain popular despite Trump's vendettas against each of them."
  ]
}