{
  "id": 7105,
  "mediaId": 1576,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Georgia's senior congressman facing toughest race since 2010",
  "image": "https://www.wabe.org/app/uploads/2022/05/AP22137480312459-336x189.jpg",
  "link": "https://www.wabe.org/georgias-senior-congressman-facing-toughest-race-since-2010/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Campaigning in recent weeks, Bishop has been busy delivering oversized ceremonial checks  $11.4 million in pandemic recovery funds to a technical college, $1 million for two mobile hospital clinics, $1 million to upgrade a rural citys water and sewer system, and $500,000 for a local Urban League chapter to repair and improve its headquarters.",
    "After years of coasting to reelection, Georgias senior congressman is gearing up for his toughest campaign in more than a decade as hopeful Republican challengers crowd the May 24 primary ballot and raise impressive sums of cash to target the Democrat whos held the seat for 30 years.",
    "Other Republicans running are Paul Whitehead, who says he wants to be the first openly gay Republican in Congress; Vivian Childs, a minister and former chair of the Georgia Black Republican Council; and Rich Robertson, a retired Air Force lieutenant colonel.",
    "However, there are a significant number of people in the electorate Ive talked to who have indicated to me they just want somebody who makes sense and will listen to them and be not so partisan.?\nBishop has raised more than $1.1 million to defend his seat.",
    "Brian Kemp and Democratic Sen. Raphael Warnock are both waging closely watched statewide campaigns, Bishops is the only congressional seat out of 14 in Georgia that the opposing party sees as posing a real possibility of flipping.",
    "Sprawling across 30 counties, the district includes the Armys Fort Benning and Robins Air Force Base, as well as large cotton, poultry and peanut farms at the heart of Georgias $70 billion agriculture economy.",
    "Bishop largely seeks to downplay partisanship and highlight his influence as a member of the budget-writing House Appropriations Committee, where he chairs a subcommittee that oversees agriculture spending.",
    "Sanford Bishop is strong.?\nStill, Republicans think they have a shot at flipping Bishops seat if Bidens approval ratings remain low and inflation keeps prices high at grocery stores and gas pumps.",
    "The GOP is betting that low approval of President Joe Biden and Democratic leaders in Congress will make it hard for Bishop to maintain support from rural voters who previously supported him.",
    "Like Georgia as a whole, Bishops district is politically divided  between midsize cities that favor Democrats like Columbus and Macon and rural counties dominated by Republicans.",
    "People in our rural communities have been struggling over these decades,? said Jeremy Hunt, one of six candidates seeking the Republican nomination to challenge Bishop.",
    "Rep. Sanford Bishop, a Black Democrat first elected in 1992, has been rated among the most vulnerable House Democrats in the fall midterms by his own party.",
    "When Agriculture Secretary Tom Vilsack announced $420 million in flood mitigation projects last month, he broke the news in Georgia with Bishop at his side.",
    "He admits to sometimes walking a political tightrope on divisive issues, such as his 2010 vote in favor of President Barack Obamas Affordable Care Act.",
    "The Republicans see it as an opportunity, but I dont think its going to happen right now,? said Wane Hails, president of the NAACP chapter in Columbus.",
    "On the other side of the spectrum, Bishop touts himself as a supporter of gun rights and once earned high ratings from the National Rifle Association.",
    "He played a key role in passing $19.1 billion in disaster aid in 2019, nearly a year after Hurricane Michael devastated crops in Bishops district.",
    "The Republican-controlled state legislature last year redrew his 2nd District seat in southwest Georgia to dilute the influence of Black voters.",
    "Pocketbook woes could particularly undermine Bishops support among conservative-leaning farmers, said Republican strategist Brandon Phillips.",
    "Hunt raised more than $438,000 since launching his campaign in January, nearly matching Bishops $441,000 in contributions for first quarter.",
    "Biden, who got 56% of the vote in Bishops district in 2020, still would have carried the reconfigured district by a slightly lower margin.",
    "The Democratic Congressional Campaign Committee placed Bishop on a list of House Democrats it considers most at risk in the midterms.",
    "A lot of the people in our district, regardless of how they might have voted in the past, are saying, We are ready for something new.",
    "Wayne Johnson, who headed the federal student loan program under President Donald Trump, is campaigning mostly with his own money.",
    "In an interview, Bishop insisted he can still connect with voters across his district even as they become more intensely partisan.",
    "Bishop also has a Democratic primary challenger, Joe OHara, whose only campaign cash reported so far is a $5,220 personal loan.",
    "These guys are out here buying fuel, fertilizer and food and all three are drastically different than they were a year ago.",
    "Chris West, a real estate developer and Air National Guard officer, reported raising $257,000 as of the end of March.",
    "Most notably, the changes reduced the districts population of voting-age Black residents from 49.4% to 47.6%.",
    "Last year, Republican state lawmakers retooled Bishops district to chip away some of his Democratic support.",
    "Bishop saw his last serious reelection fight in 2010, when he barely held his seat with 51.4% of the vote.",
    "Half of the Republicans running in the primary to challenge him have reported respectable six-figure sums.",
    "Bishop, 75, became the senior congressman in Georgia following the 2020 death of Rep. John Lewis.",
    "He left Yale Law School to run for Congress and is one of two Black Republicans in the primary.",
    "Republicans need to gain just five U.S. House seats to win control of the chamber in November.",
    "OHaras website calls for closing all overseas U.S. military bases and making all drugs legal.",
    "More than three-fourths of his $410,500 in reported funding consists of personal loans.",
    "Hes also the states only Democratic and Black member of Congress outside metro Atlanta.",
    "Thats difficult,? said Phillips, who serves as the Georgia GOPs 2nd District chairman.",
    "A 28-year-old former Army officer, Hunt wasnt even born when Bishop first took office.",
    "The following year, his district was redrawn to be more favorable to Democrats.",
    "Bishop decisively won each race that followed and got 59% of the vote in 2020.",
    "In recent years, hes supported enhanced background checks for gun purchases.",
    "Thats not enough to wipe out the advantage to Bishop and other Democrats.",
    "Things are much more partisan than they have ever been,? Bishop said.",
    "The package included five projects in the congressmans district.",
    "'?\nIn a battleground state where Republican Gov.",
    "Bishops own party acknowledges hes not safe."
  ]
}