{
  "id": 7212,
  "mediaId": 195,
  "date": "d2022-05-23T10:30",
  "headline": "The Hills Morning Report  Biden: US economy has problems; vows Taiwan defense",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR-biden.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3497790-the-hills-morning-report-biden-us-economy-has-problems-vows-taiwan-defense/",
  "sentiment": "0.217",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    1147,
    2087,
    2095,
    2136,
    3102,
    5532,
    140,
    517,
    2672,
    2863,
    2925
  ],
  "sentences": [
    "Scientists are studying who is susceptible to lingering cases of infection and the debilitating symptoms that go with the mysterious condition  and potential treatments, according to The New York Timess The Daily podcast, A Better Understanding of Long Covid.? Heres a sobering U.S. statistic: between 7.7 million and 23 million people in the U.S. may have developed long COVID, according to a recent government report.",
    "IN FOCUS/SHARP TAKES\n? CONGRESS\nSenate Majority Leader Charles Schumer (D-N.Y.)  eager to showcase GOP opposition  says he will bring a House-passed domestic terrorism bill to the floor for a procedural vote this week in response to the recent mass killings of 10 people in Buffalo by a lone, white gunman who allegedly targeted Black people (The Hill).",
    "said during an interview that when individuals articulate a particular position and then plan or advocate and perpetrate acts of violence in furtherance of that ideology, whether its a hate ideology, a bigoted ideology, a replacement ideology, if that leads to action and proposal for action and plans for action, then that crosses the line legally.",
    "And there are probably going to be a lot of people getting many, many reinfections throughout their lives.?\nWhite House coronavirus coordinator Ashish Jha said Sunday that the Food and Drug Administration is expected in a few weeks? to determine whether it will approve vaccine booster doses for children younger than age 5 (The Hill).",
    "The GOP compares the measure, which would establish offices in the Department of Homeland Security (DHS), the Department of Justice and the FBI to track and analyze domestic terrorist activity, to a disinformation security group created at DHS but since put on hold by the Biden administration following conservative criticism.",
    "The map kept in place key portions of a proposal made by a GOP judge in a small upstate county and means that a number of Democratic lawmakers will have to vie with one another for political survival, headlined by the Manhattan brouhaha between two committee chairs, Reps. Jerry Nadler (D-N.Y.) and Carolyn Maloney (D-N.Y.).",
    "CNN: On Sunday in response to Bidens presidential order last week, the Department of Health and Human Services formally invoked the Defense Production Act in order to ensure manufacturers obtain raw materials and consumables needed to further accelerate production of infant formula,? Secretary Xavier Becerra announced.",
    "The comments come as Duda told Ukrainian lawmakers that the former Soviet nation does not need to submit to conditions as laid out by Russian President Vladimir Putin, a remark that led to a standing ovation from parliament, and that all Russian troops should be removed from the country (The Wall Street Journal).",
    "? UKRAINE CRISIS\nUkrainian President Volodymyr Zelensky declared over the weekend that the war with Russia can only end with a diplomatic resolution as Polish President Andrzej Duda became the first foreign leader to address the Ukrainian parliament since the conflict started nearly three months ago.",
    "On the House side, New York Democrats aired complaints throughout the weekend over the new congressional map that was put into place effective on Saturday that wreaks havoc on the House Democratic Caucus and the partys chances to limit their losses ahead of what could be a brutal November (Politico).",
    "About 18 percent of the U.S. population is currently in high? risk areas where the Centers for Disease Control and Prevention urges everyone to wear masks indoors, and another 27 percent live in medium? areas where higher-risk people should consider wearing masks, according to public health experts.",
    "Pete Ricketts (R), co-chairman of the Republican Governors Association, joined Kemp on the trail over the weekend, becoming the latest example of the effort on the part of high-profile GOP governors to beat back Trump-led challenges against a number of incumbents and top candidates.",
    "By the end of the weekend, more than half of the population had experienced temperatures of 90 degrees or higher from a blast of hot air that started in the Southwest, swept across the eastern third of the country, and moved through New England into Canada.",
    "And finally  g It was abnormally hot during the weekend in many parts of the U.S. No one in the nations capital, New York City, Austin, Texas, or Worcester, Mass., among many locations, missed the early blast of sizzling summer temps (The New York Times).",
    "Im grateful for the generous outpouring of support from everyone and the dedicated care I received from the team at [George Washington University Hospital],? the senator wrote alongside a picture of him standing in his backyard with his dog (The Hill).",
    "The president appeared to suggest a change in U.S. policy over Taiwan with a vow to defend the self-governing island militarily should China attack, but a White House official quickly walked back Bidens comments, saying U.S. policy has not changed.",
    "ELSEWHERE\n? INTERNATIONAL\nIn New Zealand, Prime Minister Jacinda Ardern departed today for the U.S. with a trade delegation but had not as of this morning confirmed a White House meeting with Biden this week due to her recent COVID-19 infection.",
    "The Federal Reserve, which is raising interest rates to try to rein in a too-hot economy, are finding early signs that many U.S. consumers, encouraged by rising wages and ample job opportunities, are gung-ho spenders, albeit persistent worriers.",
    "During a joint news conference with Japans Prime Minister Fumio Kishida, Biden saidthat a U.S. recession is not inevitable, in his view, and that economic problems? are less consequential than the rest of the world has? (The Associated Press).",
    " The Associated Press: Agriculture Secretary Tom Vilsack on Sunday in Indianapolis met a U.S. military plane carrying enough specialty infant formula from Europe for more than half a million baby bottles, the first of several such flights.",
    "Biden has stepped back from sustained warnings other than encouragement to get vaccinated and boosted, and local and national leaders say they want economic recovery, open schools, and fewer restrictions, mandates or pandemic requirements.",
    "Zelensky said in an interview with a Ukrainian television network amid continued fighting in eastern Ukraine that the wars end will be in diplomacy,? adding that his belief on the subject has evolved as the three months have moved along.",
    "As of today, 77 percent of the U.S. population has received at least one dose of a COVID-19 vaccine and 65.1 percent is fully vaccinated,? according to the Bloomberg News global vaccine tracker and the governments definition.",
    "At the same time, U.S. families are still wringing their hands about how theyll feed hungry infants during a baby formula shortage that will continue this week, despite government and private sector responses now underway.",
    "But Americans are not routinely checking lists of CDC risk areas and are determined to make their own risk evaluations, often hesitant to exercise precautions, such as masks, according to public health experts (The Hill).",
    "After almost a decade of conservative leadership, voters turned their back on the ruling coalition, instead backing those who campaigned for more action on climate change, greater gender equality and political integrity.",
    "One member versus member primary was avoided, though, when Rep. Mondaire Jones (D-N.Y.) declined to run in the 17th District against Rep. Sean Patrick Maloney (D-N.Y.), the chairman of the House Democratic campaign arm.",
    "In Tokyo while launching a new trade deal with a dozen Indo-Pacific nations on Monday, the president warned Americans who are worried about rising inflation that it is going to be a haul? before consumers see relief.",
    "Our economy is in a transition from what has been the strongest recovery in modern American history to what can be a period of more stable and resilient growth that works better for families,? he told CNN (The Hill).",
    "? ENTERTAINMENT\nThere are going to be big changes at Saturday Night Live? next year as Pete Davidson and Kate McKinnon, two of their longest tenured and most famous cast members, are leaving the sketch comedy show.",
    "The House by a large bipartisan vote last week also approved a rule change for infant formula obtained through the governments women, infants and children supplemental nutrition program to help low-income families.",
    "I am very convinced of this.?\nZelensky added that the push and pull between the two nations  that Ukraine want[s] everything returned, and Russia doesnt want to return anything?  means a final deal is required.",
    "More importantly for the sitting governor, he clears the 50 percent barrier in every public survey, meaning he would avoid a runoff next month, and hes getting a little help from some friends in the final days.",
    "The Senate this week will work on legislation Democrats doubt will go anywhere, and Republicans are holding their breath about Tuesdays primaries in Georgia, Arkansas and Alabama, plus Texas runoffs.",
    "In Australia on Saturday, Anthony Albanese and his opposition Labor Party ended nine years of conservative government as Prime Minister Scott Morrison conceded defeat of the coalition he led.",
    "Shortly before nabbing the states Senate Democratic nomination on Tuesday, Fetterman underwent surgery to implant a pacemaker with a defibrillator to aid his recovery (The Associated Press).",
    "The public is complaining about record gas prices, inflated food costs, rising rents and sticker shock in the real estate market, but Americans keep spending, The Hills Sylvan Lane reports.",
    "The Hills Nathaniel Weixel profiles Gayle Smith, CEO of the nonprofit, nonpartisan global advocacy group ONE Campaign, who says her mission is to help vaccinate the world against COVID-19.",
    "The president told reporters that Beijing was already flirting with danger? with its recent decision to hold military drills near Taiwan, which China views as its own territory (NBC News).",
    "Republican leaders say theyre concerned about whether $28 billion proposed to help the Food and Drug Administration avoid future formula shortages would provide help in the near-term.",
    "Meanwhile, a Louisiana federal judge blocked todays plans in the administration to rescind a Trump-era immigration policy, leaving the political and policy debate in continued limbo.",
    "Related Articles\n The New York Times: Biden to begin a new Asia-Pacific economic bloc with a dozen allies meant to counter Chinas dominance and reassert U.S. influence in the region.",
    "Only two weeks ago, Ricketts led the charge to boost state Sen. Jim Pillen (R) in Nebraska over Charles Herbster, a Trump-backed candidate who faced sexual misconduct allegations.",
    "Brian Kemp (R) is set to deliver a significant shot across the bow of former President Trump in the form of a resounding win over former Sen. David Perdue (R-Ga.) on Tuesday.",
    "More than three million Ukrainian refugees in their neighbor to the south have been given the right to live and work in Poland, and claim social security payments (Reuters).",
    "This was the lineup of events: Meeting with Japanese Emperor Naruhito at the Imperial Palace in Tokyo; a bilateral meeting with the prime minister and a press conference.",
    "They are eating in restaurants, traveling by air, booking summer trips and shifting to more budget-friendly options and services rather than snapping their wallets shut.",
    "As part of Dudas visit, Zelensky added that Polish citizens in Ukraine will receive reciprocal rights to those that Ukrainian refugees have been granted in Poland.",
    "tweeted on Sunday that it was great to be back home after a long week.? Last weekend, he suffered a minor stroke related to a venous tear at the back of his head.",
    "It is a concern in the sense that if it were to spread, its consequential.? Cases of monkeypox have been confirmed in Massachusetts, Europe, Canada and Australia.",
    "I really thought we could end it only through dialogue  in that dialogue could be found answers to many questions, and many decisions from the Russian side.",
    "The states primary is set for Aug. 23.\n Amie Parnes and Morgan Chalfant, The Hill: Fizzling legislative agenda leaves Democrats wondering about midterms.",
    "Separately, two House-passed measures approved last week intended by Democrats to tackle the infant formula shortage remain question marks in the Senate.",
    "First lady Jill Biden is in Costa Rica where she will visit a community center this morning, which is partially supported by the U.S. State Department.",
    " The Hill: Pennsylvania Attorney General Josh Shapiro (D), who is running for governor, says he would welcome a visit by the president to his state.",
    "The House approved its bill 222-203 on a mostly party-line vote on Wednesday, with Rep. Adam Kinzinger (Ill.) casting the only GOP vote in favor.",
    "Australias new leaders are yet to be sworn in but the nation is already dissecting what seems to be a seismic shift in its politics, reports CNN.",
    "Omicron adapted, leaving everyone  even those who have been vaccinated multiple times  vulnerable to multiple infections (The New York Times).",
    "The victory will be difficult, it will be bloody and in battle,? Zelensky said, making his point that a diplomatic result will end everything.",
    "The department said Abbott Laboratories and another manufacturer will be on a fast track for materials required to speed up formula supplies.",
    "Blinken will moderate an event to launch the Indo-Pacific Economic Framework and later meet with Japanese Foreign Minister Hayashi Yoshimasa.",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University (trackers all vary slightly): 1,002,173.",
    "Davidson has become a bona fide star in recent years, punctuated by his starring role in movies and his relationship with Kim Kardashian.",
    "What threats do antibiotic-resistant superbugs pose for the future, and how has COVID-19 informed our approach to pandemic preparedness?",
    "The White House is powerless to control monetary policy and reluctant to rule in or out darker days over the horizon (Bloomberg News).",
    "And in this case, we just happen to be on opposite sides of who were picking in these races.?\n Associated Press / Jeff Amy | GOP Gov.",
    "Im going to look at it another time, but the bill may or may not serve to solve some long-term problems at FDA,? Sen. Roy Blunt (Mo.",
    "The virus is going to keep evolving,? Juliet Pulliam, an epidemiologist at Stellenbosch University in South Africa, told the Times.",
    "The vice president will visit the Childrens National Hospital in Washington to discuss the administrations work on mental health.",
    "Biden launched the Indo-Pacific Economic Framework for Prosperity, and a dinner hosted by the prime minister completes the day.",
    "g Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "Morning Report\nPresident Biden while in Japan today conceded U.S. inflation presents real challenges of uncertain duration.",
    "With rising interest rates come concerns that an aggressive Fed might choke off economic growth to the point of recession.",
    "Even people who have asymptomatic or mild cases of COVID-19 infection have turned up weeks later with cases of long COVID.",
    " Reuters: The U.S. is weighing cutting tariffs on Chinese goods; asking OPEC to pump more oil, Biden says while in Tokyo.",
    "Instead, Jones will seek the seat in the 10th District that encompasses lower Manhattan and parts of Brooklyn (HuffPost).",
    "The Georgia contests headline a four-pack of states that will head to the polls on Tuesday, including Alabama, Arkansas.",
    "The percentage of Americans who have received third or booster doses is 30.6.\n? ECONOMY\nAmerican consumption is roaring.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "McKinnon played the likes of Hillary Clinton, the late Justice Ruth Bader Ginsburg and Sen. Elizabeth Warren (D-Mass.)",
    "Biden economic adviser Brian Deese on Sunday sidestepped the recession debate, noting there are risks and strengths.",
    " Politico: Dem-allied groups drop an A-bomb on state Sen. Doug Mastriano (R) to start Pennsylvania governors race.",
    "Heres what were doing to fix it, by Abbott Laboratories CEO Robert Ford, opinion contributor, The Washington Post.",
    "Finally, a pair of high-profile politicians returned home from the hospital this weekend after suffering strokes.",
    "Current average U.S. COVID-19 daily deaths are 284, according to the Centers for Disease Control and Prevention.",
    " NBC News: Russian soldier sentenced to life in prison in Ukraines first war crimes trial since the invasion.",
    "I support many of President Trumps policies, and I know Brian Kemp does,? Ricketts told The Associated Press.",
    "A bad process has now led to a bad result,? Rep. Hakeem Jeffries (D-N.Y.) told Face the Nation? (The Hill).",
    " The Associated Press: Russian offensive turns to Sievierodonetsk, a key Donbas city, amid heavy shelling.",
    " The Wall Street Journal: Biden says the United States would intervene militarily if China invaded Taiwan.",
    "And from a security standpoint, we need to have agencies that can deal with that? before lives are lost.",
    "ET\nAntibiotic-resistant pathogens result in millions of infections and thousands of deaths every year.",
    "Dawn OConnell and more join The Hill to discuss tackling the growing threat of antibiotic resistance.",
    "https://wapo.st/3LHhH2a\nWHERE AND WHEN\nThe House meets on Tuesday at 10 a.m. for a pro forma session.",
    "Biden and Kishida met with families of Japanese citizens abducted by North Korea several decades ago.",
    "Virtual Event Invite\nAntibiotic Resistance: A Looming Public Health Crisis Tuesday, May 24 at 1 p.m.",
    "Fortune: Jamie Dimon, Carl Icahn and other market experts are sounding the alarm about a recession.",
    "LEADING THE DAY\n? POLITICS\nThe political world has its focus dead set on Georgia this week as Gov.",
    "According to the latest RealClearPolitics average of polls, Kemp leads Perdue by nearly 25 points.",
    " The Hill: Biden on Sunday told reporters that everybody? should be concerned about monkeypox.",
    "He added that, Only Ukraine has the right to decide about its future? (The Associated Press).",
    "OPINION\n My lunch with President Biden, by Thomas L. Friedman, columnist, The New York Times.",
    "THE CLOSER\n Associated Press / Wong Maye-E | Beating the heat in Brooklyn, N.Y. on Saturday.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "The Wall Street Journal: Biden keeps his eye on U.S. politics as he travels through Asia.",
    " The New York Times: Scorned by Trump, Rep. Mo Brooks (R) rises in Alabama Senate race.",
    "The pair made their final appearance as part of the cast in Saturdays Season 47 finale.",
    " Associated Press / Efrem Lukatsky | Ukrainian President Volodymyr Zelensky on Sunday.",
    "predicted the domestic terrorism bill would not get 10 votes from Senate Republicans.",
    " The Washington Post: From Sandy Hook to Buffalo: 10 years of failure on gun control.",
    "John Fetterman (D) was released from the hospital on Sunday, his campaign announced.",
    "? CORONAVIRUS\nConfirmed COVID-19 infections have risen to more than 100,000 per day.",
    " The Associated Press: Belarusians join war seeking to free Ukraine and themselves.",
    " Politico: House Democrats shun primary fight against Rep. Henry Cuellar (D-Texas).",
    " The Washington Post: Inside the GOP push to stop Trump vendetta tour? in Georgia.",
    " Reuters: Pounded by Russian offensive in the east, Ukraine rules out concessions.",
    "Is there a limit to the number of times you can be infected with the coronavirus?",
    "g? Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    " Max Greenwood, The Hill: Democrats look to defy political headwinds in Georgia.",
    " The Washington Post: Biden takes aggressive posture toward China on Asia trip.",
    "But now its like an automobile, not gas-powered, or electric, but a hybrid.",
    "The president returns to Washington from Japan on Tuesday (Bloomberg News).",
    "At least 45 states are reporting increases in COVID-19 hospitalizations.",
    "Its the debate every market analyst and economist is having this month.",
    "The president has just about completed his schedule Monday in Tokyo.",
    " The Wall Street Journal: Georgia governor race is a test for Trump.",
    "Sen. Michael Bennet (D-Colo.), Rep. Drew Ferguson (R-Ga.), HHS Asst.",
    "Secretary of State Antony Blinken is in Tokyo with the president.",
    "https://nyti.ms/3PuiTJk\n Were sorry about the formula shortage.",
    "The process unfortunately was hijacked by the Court of Appeals.",
    " The Hill: U.S. frustrated over problematic? NATO ally Turkey.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Ardern is set to meet with lawmakers this week (The Hill).",
    "The Senate convenes at 1:45 p.m. for a pro forma session.",
    "There are not 60 votes in the Senate to take up the bill.",
    "), a retiring member of GOP leadership, told The Hill.",
    "Click here to subscribe to our latest newsletter.",
    "And that is how war is  complicated.? he added.",
    "NPR: House Majority Leader Steny Hoyer (Md.)",
    "Live with the virus,? is the policy du jour.",
    " Associated Press / Tony Dejak | $20 bill.",
    "The House is out of Washington until June.",
    "Brian Kemp of Georgia campaigning May 21.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Stay Engaged\nWe want to hear from you!",
    "over the years (The Associated Press).",
    "She fly back to the U.S. this evening.",
    "Additionally, Pennsylvania Lt. Gov.",
    "Texas will hold its runoff races.",
    "Sen. Chris Van Hollen (D-Md.)",
    "It sounds terrible,? he said.",
    "Heres what theyve all said.",
    "Sen. Josh Hawley (R-Mo.)",
    "I really thought that.",
    "It isnt going well.",
    "In a word, no.",
    "See all Video",
    "Nebraska Gov.",
    "RSVP now.",
    "Sec.",
    "ET."
  ]
}