{
  "id": 7224,
  "mediaId": 129,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "What Donald Trump Didnt Count On in Georgia",
  "image": "https://static01.nyt.com/images/2022/05/20/us/00georgia-trump-1/merlin_207163095_0eeb4499-8ea8-475c-9261-6d379cfc81f6-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/22/us/what-donald-trump-didnt-count-on-in-georgia.html",
  "sentiment": "0.919",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    1801,
    2095,
    3102,
    3103,
    4325,
    2672,
    2845,
    2900,
    5538
  ],
  "sentences": [
    "And it is his gift for both reflecting and rewarding his conservative Georgia constituency that has given him a surprisingly cushy lead in the polls in advance of Tuesdays Republican primary, even as Mr. Trump, who remains tremendously popular in Georgia, continues to disparage him as a Republican in name only? and demands that voters punish Mr. Kemp for declining to help him overturn the states presidential election results of November 2020.",
    "But to many Georgia Republicans, he is one of us.\nTHOMASTON, Ga. Brian Kemp, Georgias incumbent governor and a prominent fixture on former President Donald J. Trumps enemies list, was clip-clopping around in a pair of cowboy boots in this small city on a recent morning, glad-handing his way through an adoring Republican throng at a place called Greatest Generation Memorial Park.",
    "President Biden described the sweeping law that Mr. Kemp signed in the wake of the 2020 election to restrict voting access Jim Crow in the 21st century.? And Mr. Kemp was heavily criticized for his decision, in April 2020, to allow many businesses in the state to reopen in the early stages of the coronavirus pandemic.",
    "While Mr. Kemp has kept socially conservative Republicans appeased with legislation, he has also strengthened his hand with important economic-development wins, including a planned Rivian electric truck plant east of Atlanta and a new Hyundai electric vehicle plant to be built outside of Savannah.",
    "I was talking to barbers and the cosmetologists and the waitresses and the restaurant owners.?\nThe governor made no mention of David Perdue, or of Mr. Trump, but rather looked ahead, with multiple mentions of Ms. Abrams, whom he will face off against in the general election if he gets there.",
    "A recent Atlanta Journal-Constitution poll of likely Republican voters shows the U.S. Senate candidate and former University of Georgia running back Herschel Walker with a big lead in his primary race, likely aided by both Mr. Trumps endorsement and Mr. Walkers status as a football legend.",
    "That appeared to be the case earlier this year, when the state board that oversees Georgias public college system, which is stocked with Kemp loyalists, chose as system chancellor Sonny Perdue, a former Georgia governor and Trump cabinet official who happens to be David Perdues cousin.",
    "But everything that comes out of someones mouth is not necessarily true.? Mr. Kemp, she said, had proven his bona fides, most recently by signing a law limiting the discussion of race in public-school classrooms, and another allowing Georgians to carry firearms without a permit.",
    "Mr. Perdue, whose appearances this week included a Bikers for Trump event in Plainville, Ga., is hoping that heavy early-voting turnout is a sign that Trump voters are quietly moving the needle in his direction and will at least allow him to force Mr. Kemp into a runoff.",
    "Before his stump speech in Thomaston, Mr. Kemp mingled with the crowd, with the sleeves of his red-gingham shirt rolled up, shaking hands with old acquaintances, talking about tailgate parties from football seasons past and praising the moxie of his octogenarian mother.",
    "Mr. Trump has endorsed an extensive slate of Republican candidates in Georgia, where he and some of his allies are under investigation in Fulton County for potentially violating state criminal law in their attempts to interfere with the presidential election results.",
    "On Wednesday, Norman Allen, the Upson County Commission chairman, praised Mr. Kemp for personally taking his calls in 2020 and promising extra help from state government as the county suffered in the first months of the coronavirus pandemic.",
    "Former Vice President Mike Pence is planning to come to Georgia on Monday to campaign on Mr. Kemps behalf; in a statement, he called Mr. Kemp one of the most successful conservative governors in America.?\nMr. Trump has endorsed former U.S.",
    "With his boots, his football fixation and a distinctively folksy Southern voice  one that rarely, in campaign mode, nails the g? at the end of a gerund  Mr. Kemp presents himself as the most Georgian of Georgians.",
    "Linda Reeves, a retired government worker, said that she and her husband, Clarence, voted for Mr. Trump and even believed his assertion that the Georgia election was stolen, an argument that proved baseless.",
    "And though Mr. Perdue has benefited from outside groups TV ads featuring Mr. Trump, the Perdue campaign has not been on the air with its own ads since late April, according to Adimpact, an ad-tracking firm.",
    "Mr. Trump pushed back Friday with a social media post calling the reporting FALSE.?\nI am with David all the way because Brian Kemp was the WORST Governor in the Country on Election Integrity!? he wrote.",
    "The Kemp campaign has vastly out-raised and outspent the Perdue campaign, a sign that much of the Georgia donor class, which tends to be wary of political turbulence, prefers the status quo.",
    "Vance, the Hillbilly Elegy? author and U.S. Senate candidate from Ohio, and Doug Mastriano, a candidate for Pennsylvania governor who echoes Mr. Trumps untrue claims of election fraud.",
    "Mr. Kemp is aware that this kind of warm welcome, from a rural, mostly white crowd, coexists with a strong distaste for him on the left and from influential voices outside of Georgia.",
    "Mr. Kemp has also strategically dispensed executive spoils, including coveted government appointments, keeping fellow Georgia Republicans in his camp, or at least on the sidelines.",
    "What the former president wasnt counting on, apparently, was the willingness of many Georgia Republicans to remain simultaneously loyal to both Mr. Trump and Mr. Kemp.",
    "The same poll shows the Trump-backed candidate for secretary of state, U.S. Representative Jody Hice, in a tight primary race against incumbent Brad Raffensperger.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "This week, NBC News reported that the former president has been privately complaining about Mr. Perdues performance and had essentially written him off.",
    "Senator David Perdue, the former chief executive of the Dollar General discount chain, who has repeated Mr. Trumps falsehoods about the 2020 election.",
    "The April AJC poll shows Mr. Kemp with a 23-point lead over Mr. Perdue; a more recent Fox News poll showed the governor ahead by more than 30 points.",
    "I knew how bad they were hurting, because I was hearing from them,? he said of Georgia business owners and workers affected by the pandemic.",
    "Some of them used variations of the word steal? to describe Mr. Kemps defeat of the Democrat Stacey Abrams that year in the governors race.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "But Mr. Perdue, who lives in the exclusive community of Sea Island, has struggled to gain traction in his primary against the governor.",
    "Were getting up every single morning to make sure that Stacey Abrams is not going to be our governor or our next president,? he said.",
    "Soon he was confronted by a smiling man wearing a baseball cap adorned with a cursive letter A.?\nIt was a University of Alabama hat.",
    "Mr. Kemp, a sports nut, is a famous partisan of the University of Georgia, his alma mater and one of Alabamas gridiron rivals.",
    "In 2018, a number of high-profile Democrats described some moves he made as secretary of state as voter suppression tactics.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "Just after the campaign event in Thomaston, Sheriff Dan Kilgore of Upson County identified himself as a Trump voter.",
    "But other Trump candidates have lost high-profile Republican primary contests in North Carolina, Nebraska and Idaho.",
    "In his speech in Thomaston, Mr. Kemp said he knew those criticisms were wrong, because he had listened to voters.",
    "Mr. Kemp, meanwhile, has countermanded Mr. Trumps wrath with a relentless focus on affairs in his own backyard.",
    "Ms. Abrams, who also alleged that Mr. Kemp engaged in voter suppression, never conceded in that contest.",
    "The state budget he signed this month includes pay raises for teachers and state government employees.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "He has even adopted the Bulldog football teams motivational catchphrase, Keep choppin,? as his own.",
    "Mr. Trumps record in influencing Republican primary outcomes this season has been mixed.",
    "Brian Kemp, the incumbent governor, is at the top of the former presidents enemies list.",
    "But the outcomes of Georgias Trump squad members this primary season may vary.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "But he said that Mr. Kemp seemed like a natural fit for the state.",
    "Then Mr. Kemp turned to his left and addressed a man with a badge.",
    "Hes one of us.?\nHow Donald J. Trump Still Looms\nGrip on G.O.P.",
    "He added: Keep choppin, God bless you, and thanks for coming.?",
    "There was a brief moment of good-natured sports-guy ribbing.",
    "Were in a fight for the soul of our state, yall,? he said.",
    "His four years in office have brought more controversy.",
    "Brian Kemp is a very conservative governor,? she said.",
    "We need to lock this guy up, sheriff,? he deadpanned.",
    "However, there are signs his control is loosening.",
    "Successful Trump-backed candidates include J.D.",
    "Hes of the people,? Mr. Kilgore said.",
    "We are Trump supporters,? she said.",
    "I was talking to them.",
    "The crowd chuckled."
  ]
}