{
  "id": 7233,
  "mediaId": 233,
  "date": "d2022-05-23T08:03",
  "headline": "Biden in Tokyo, Pence rallies for Georgia Gov. Brian Kemp, Russia-Ukraine war: 5 things to know Monday",
  "image": "https://www.gannett-cdn.com/presto/2022/05/23/USAT/5c6ec4e8-89db-448e-af05-4dd202d1f883-AP_Biden_Asia_5.jpg?crop=5687,3199,x0,y289&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/2022/05/23/bill-cosby-brian-kemp-rally-and-donbas-region-5-things-know-monday/9834582002/",
  "sentiment": "-0.594",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Editors",
  "authorUrl": "",
  "termIds": [
    1147,
    1434,
    2087,
    2095,
    2672,
    2863,
    2888,
    2925,
    2942,
    5145
  ],
  "sentences": [
    "In primaries, a spotlight on the unhealed wounds of 2020 - and the ongoing divisions in America\nRussia looks to expand domain north of Mariupol\nHaving captured the strategic southern city of Mariupol, its first major victory of the war in Ukraine, the Russian military is focusing its efforts on the Donbas region to its north with the aim of expanding the territory Moscow-backed separatists have held since 2014.",
    "Jury selection begins for the trial of Judy Huth's civil lawsuit against Bill Cosby\nNearly 50 years after an alleged encounter at the Playboy Mansion in Los Angeles, Judy Huth's civil lawsuit against Bill Cosby  accusing him of groping her when she was a teen  is going forward to trial this week.",
    "Biden, who is on a five-day trip to Asia, announced Monday the dozen founding partners for his Indo-Pacific Economic Framework, an attempt to deepen economic engagement and cooperation in the region and help counter Chinas growing economic and military influence.",
    "USA TODAY\nBiden, in Tokyo, says US would send military if China were to invade Taiwan\nPresident Joe Biden on Monday said the United States would come to Taiwans defense militarily if China invades and tries to take over the self-ruled island by force.",
    "In a general staff morning report over the weekend, Russia said it was preparing to resume its offensive toward Slovyansk, a city in Donetsk province that is critical to Russias objective of capturing all of eastern Ukraine.",
    "The last two hiring cycles have seen improvement when it comes to general managers as the number of lead talent evaluators increased to seven following the hiring of Kwesi Adofo-Mensah in Minnesota and Ryan Poles in Chicago.",
    "Leadership and development sessions will be offered, as well as windows of opportunity for the aspiring head coaches and general managers to have face-to-face meetings with the team officials with hiring power.",
    "First NFL Coach and Front Office Accelerator Program to begin\nThe inaugural NFL Coach and Front Office Accelerator Program will take place Monday and Tuesday during the spring league meetings in Atlanta.",
    "Kemp infuriated the former president when he refused to overturn Georgia's 2020 presidential election result in favor of Trump.Trump endorsed Kemp's opponent, Republican Sen. David Perdue, in February.",
    "Russia has made incremental gains in the area and is trying to conquer Sievierodonetsk, the main city under Ukrainian control in Luhansk province, part of the Donbas along with Donetsk province.",
    "Check out the 5 Things podcast:\nFormer VP Pence to headline rally for Georgia governor, putting him at odds with Trump\nFormer Vice President Mike Pence will headline a rally for Georgia Gov.",
    "Huth filed the lawsuit soon after Cosby became the target of five dozen allegations from women who accused him of drugging and raping them in encounters dating back to the mid-1960s.",
    "She filed the suit in 2014 alleging she was groped by the comedian/TV star in 1974 when she was 15 and visiting the Playboy Mansion, where Cosby was a frequent visitor.",
    "The Ukrainian military said Sunday that Russian forces had mounted an unsuccessful attack on Oleksandrivka, a village outside of Sievierodonetsk.",
    "Jury selection will begin Monday at the Santa Monica courthouse for Huth v. Cosby, with the trial starting as soon as a jury is picked.",
    "Pence's appearance puts him at odds with former President Donald Trump, who is fighting to defeat the GOP incumbent governor.",
    "In April, Trump's Save America PAC gave $500,000 to a super PAC devoted to preventing Kemp's reelection, Politico reported.",
    "\"That's the commitment we made,\" Biden said during a news conference in Tokyo with Japanese Prime Minister Fumio Kishida.",
    "Each team nominated rising prospects from their coaching staffs and front offices and will send them to the program.",
    "The U.S. has long tried to navigate a fraught middle ground that aims to support Taiwan without infuriating China.",
    "Both leaders said they still support the \"One China\" policy that recognizes there is only one Chinese government.",
    "However, the number of minority head coaches remains at five in a league whose player body is roughly 75% Black.",
    "China views Taiwan as part of its territory while Taiwan sees itself as an independent, sovereign nation.",
    "The program arrives as the league continues to struggle with its diversity hiring practices.",
    "Brian Kemp on Monday, the eve of the state's contested Republican primary.",
    "Were writing the new rules for the 21st century economy,\" Biden said.",
    "Huth, 64, is suing Cosby for sexual battery.",
    "Cosby has denied her allegations.",
    "Prefer to listen?"
  ]
}