{
  "id": 7237,
  "mediaId": 129,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Biden to Begin New Asia-Pacific Economic Bloc With a Dozen Allies",
  "image": "https://static01.nyt.com/images/2022/05/23/world/23prexy2/merlin_207347559_e791ed80-0de4-41ee-b0df-4da6e08bea25-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/23/world/asia/biden-asian-pacific-bloc.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "The new alliance represents the centerpiece not only of Mr. Bidens first trip as president to Asia but also of his broader strategy in the region at a time when China has increasingly filled the void left when President Donald J. Trump pulled the United States out of the Trans-Pacific Partnership in 2017.\nIt is by any account the most significant international economic engagement that the United States has ever had in this region,? Commerce Secretary Gina M. Raimondo, who will lead some of the negotiations triggered by the agreement, told reporters on Sunday.",
    "And the launch of it tomorrow here in Tokyo marks an important turning point in restoring U.S. economic leadership in the region and presenting Indo-Pacific countries an alternative to Chinas approach to these critical issues.?\nIn addition to the United States, India, Japan and South Korea, the 13 members of the framework will include Australia, Brunei, Indonesia, Malaysia, New Zealand, the Philippines, Singapore, Thailand and Vietnam.",
    "Before flying to Tokyo on Sunday, Mr. Biden joined Euisun Chung, executive chairman of Hyundai Motor Group, to celebrate the companys plan to build a new $5.5 billion electric vehicle and battery manufacturing plant in Savannah, Ga. Mr. Biden said the factory would result in 8,000 jobs, continuing the administrations strategy of pointing to job growth as Republican lawmakers escalate attacks over high inflation.",
    "The kickoff came during a busy two days for Mr. Biden, who will meet separately with each of those three leaders in addition to a summit gathering of all four of them representing the Quad, a security-oriented bloc formed years ago out of growing anxiety about Chinas military footprint in Asia and parts of the Indian Ocean.",
    "TOKYO  President Biden has enlisted a dozen Asia-Pacific nations to join a new loosely defined economic bloc meant to counter Chinas dominance and reassert American influence in the region five years after his predecessor withdrew the United States from a sweeping trade accord that it had negotiated itself.",
    "It is going to be difficult to convince Asian governments to change rules in ways that may be disruptive to their political economies without the promise of increased access to the American market,? said Aaron Connelly, a research fellow at the International Institute for Strategic Studies in Singapore.",
    "Were going to help all of our countrys economies grow faster and fairer.?\nThe president sat alongside Prime Minister Narendra Modi of India and Prime Fumio Kishida of Japan for the rollout of the initiative, while other leaders joined the event by videoconference.",
    "Amid uncertainty and skepticism in the region about what the new framework would actually mean, American officials scrambled in recent weeks to line up enough major countries to commit in hopes of making a big impression with a splashy kickoff.",
    "The alliance will bring the United States together with such regional powerhouses as Japan, South Korea and India to establish new rules of commerce in the fastest-growing part of the world and offer an alternative to Beijings leadership.",
    "There was a very, very strong lesson there, that T.P.P., as it was envisioned, ultimately was something that was quite fragile and that the United States was not able to deliver on, and that informs very much our thinking,? she said.",
    "Privately, they said all of the nations they had been seriously targeting agreed to join, but some analysts wondered whether any assurances or trade-offs proffered to entice participation would diminish the scope of the new bloc.",
    "With prices rising, stock markets falling and fears of recession spreading at home, the president is eager to demonstrate that he is focused on stabilizing the economy, especially with midterm elections five months away.",
    "But other administration officials, speaking on the condition of anonymity to discuss internal deliberations, said separately that without tariffs on the table, it most likely would not be necessary to go to Congress.",
    "Together, the participating nations represent about 40 percent of the world economy, and any specific agreements that emerge from the grouping could go a long way toward setting standards even beyond its membership.",
    "The new Biden initiative comes less than five months after the China-led Regional Comprehensive Economic Partnership officially went into force, linking 15 Asia-Pacific economies in the worlds largest trade bloc.",
    "President Barack Obama, with Mr. Biden as his vice president, negotiated the T.P.P., only to have Mr. Trump abandon it on his first full weekday in office, leaving the bloc to proceed without its largest member.",
    "Labor groups in the United States are already skeptical of any broad new commitments, including digital provisions that could lead to more outsourcing in fields like medicine and other service industries.",
    "Parameters for the negotiations should be set by late June or early July, and the administration hopes to wrap up any agreements within 12 to 18 months to then submit to each government for ratification.",
    "She said that labor and environmental groups would have premier seats at the table? in the new framework but demurred on whether agreements emerging from it would be submitted to Congress for approval.",
    "But rather than simply rejoin the partnership, as Japan, Singapore and other countries wanted him to do, Mr. Biden essentially abandoned it too, in deference to opposition within his own party.",
    "For two of them, Canada and Mexico, it could be less imperative since they already have their own North American Free Trade Agreement with the United States, recently updated by Mr. Trump.",
    "But wary of liberal opposition at home, Mr. Bidens new partnership will avoid the market access provisions of traditional trade deals, raising questions about how meaningful it will be.",
    "For the United States, the new framework effectively replaces the more expansive Trans-Pacific Partnership as the main vehicle to shape the flow of goods and services in the region.",
    "The framework will focus on four main goals: harmonizing efforts to secure supply chains, expanding clean energy, fighting corruption and paving the way for greater digital trade.",
    "Business executives say the China-led bloc has now done more to define trade in the region, even though it asks little of its members and focuses mainly on limiting red tape.",
    "Were writing the new rules for the 21st-century economy,? Mr. Biden said on Monday in Tokyo during the launch for what he has termed the Indo-Pacific Economic Framework.",
    "Nonetheless, one of the officials added that the administration would consult with Congress as if approval were needed in hopes of rebuilding trust following the T.P.P.",
    "Ms. Raimondo said the new framework goes above and beyond a same-old, same-old? free-trade agreement, but partners in Asia still want a same-old trade agreement.",
    "These investments are part of a trend by my administration,? Mr. Biden said, adding that it would help the White House make good on its clean-energy commitments.",
    "Countries like Singapore have tried to convince the United States to use the framework as a steppingstone to rejoin the T.P.P., a nonstarter for the Biden team.",
    "With Mondays kickoff, negotiations in each of these areas will soon ensue, led by Ms. Raimondo or Katherine Tai, the United States trade representative.",
    "Each of the 13 participating countries will be allowed to choose in which of the four areas to pursue deals without having to commit to all of them.",
    "Mr. Biden framed the investment as a result of work by his administration and the Democratic senators from Georgia, Raphael Warnock and Jon Ossoff.",
    "The goal is a resurgence in U.S. influence in the region, especially vis--vis China, after Trumps withdrawal from the Trans-Pacific Partnership.",
    "But without offering more access to its market, analysts say, the United States does not have a lot of carrots to encourage those changes.",
    "The kinds of agreements currently envisioned, some binding and some not, could be accomplished through executive agreements, they said.",
    "Economic issues, however, have clearly been front and center on Mr. Bidens mind throughout his trip to South Korea and Japan.",
    "The American vision for the region, in contrast, is ambitious, aiming to raise labor and environmental standards.",
    "was that even before Mr. Trump was elected, we did not have the support at home to get it through? Congress.",
    "Just two days earlier, Mr. Chung had been in Georgia celebrating the investment while standing next to Gov.",
    "Manufacturing jobs are coming back to America.?\nSuch announcements often have a political component.",
    "Most of the countries Mr. Biden signed up for his framework already belong to the bloc with China.",
    "Even the more limited Biden framework will require deft management of Democratic constituencies.",
    "As officials prepared for the new venture, it was clear that the scars of T.P.P.",
    "experience and establishing durable bipartisan support for any eventual deals.",
    "Brian Kemp, a Republican facing a primary contest from a pro-Trump challenger.",
    "Ms. Tai acknowledged bluntly on Sunday that the biggest problem? with T.P.P.",
    "Peter Baker reported from Seoul, and Zolan Kanno-Youngs from Tokyo.",
    "Seven countries will belong to both, but several members of T.P.P.",
    "and other traditional free trade pacts, will not reduce tariffs.",
    "To assuage his liberal base, the new framework, unlike T.P.P.",
    "The membership in the new framework overlaps the T.P.P.",
    "Lets see where these negotiations take us,? she said.",
    "But he was not the only one eager to claim credit.",
    "Ana Swanson contributed reporting from Washington.",
    "run deep in the Biden administration.",
    "did not sign onto the framework.",
    "membership but not precisely."
  ]
}