{
  "id": 7245,
  "mediaId": 21,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Early voting turnout in Georgia soars in wake of restrictive election law",
  "image": "https://i.insider.com/624a46e082200b001943dcee?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/georgia-early-voting-record-turnout-trump-kemp-abrams-election-law-2022-5",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    815,
    1136,
    1951,
    2087,
    2095,
    2203,
    4325,
    2672
  ],
  "sentences": [
    "Brian Kemp and Trump-backed former Sen. David Perdue; the GOP Senate primary where former NFL player Herschel Walker is set to glide to the nomination and face first-term Democratic Sen. Raphael Warnock; the Georgia secretary of state race which features Raffensperger and Trump-endorsed Rep. Jody Hice; and the Democratic gubernatorial primary, where former state House minority leader Stacey Abrams is running unopposed in her second bid for the Governor's Mansion.",
    "Despite Trump's heavy push to oust Kemp from office  even claiming that Walker would be hurt by the incumbent Republican's presence on the GOP ticket  the governor has polled well ahead of Perdue in recent weeks, and could possibly avoid a runoff if he exceeds the 50 percent-threshold among the GOP primary electorate.",
    "The law, known as the Election Integrity Act of 2021 or SB 202, tightened election rules in the state by limiting drop boxes, strengthening voter identification requirements, and banning water and food from being distributed by volunteers to voters waiting in line, among other measures.",
    "On Friday, Georgia Secretary of State Brad Raffensperger announced that more than 700,000 people had voted early, which his office said represented a 180-percent increase in early votes from the 2018 primaries and a 149-percent increase in early votes from the 2020 primary contests.",
    "Former President Donald Trump, who continues to baselessly allege voter fraud as the source of his 2020 loss to now-President Joe Biden in Georgia, has sought to use his political endorsements to mold the GOP to his liking.",
    "Biden, Abrams, and other leading Democrats have sharply criticized the restrictive election law that the GOP-controlled Georgia legislature passed last year, contending that it would hurt the state's Black voters.",
    "Of the roughly 710,000 people who voted early through last Thursday, over 655,000 individuals cast ballots in-person, while nearly 55,000 people submitted absentee ballots.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"The record early voting turnout is a testament to the security of the voting system and the hard work of our county election officials,\" he said in a statement.",
    "A record number of Georgia citizens have cast ballots during early voting for a set of hotly-contested primary elections that will take place on Tuesday.",
    "The state features a slate of deeply consequential races, notably the Republican gubernatorial primary between incumbent Gov.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Secretary of State Brad Raffensperger said the numbers are \"a testament to the security of the voting system.\"",
    "About 406,000 voters cast Republican ballots, while nearly 300,000 citizens cast early ballots for Democrats.",
    "Getty Images\nGeorgia boasted record early voting turnout in the lead-up to its May 24 primary date.",
    "Roughly 710,000 people voted early through last Thursday, a 180% increase from the 2018 primaries.",
    "The fallout over the bill led to the MLB moving the 2021 All-Star Game from Georgia to Colorado.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Early voting for the May 24 primary elections ended on Friday.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "The seal of the state of Georgia.",
    "Loading Something is loading."
  ]
}