{
  "id": 7248,
  "mediaId": 195,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Amateur hour at the White House briefing room",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/jean-pierrekarine_051622_AP_Andrew_Harnik.jpeg?strip=1&w=640",
  "link": "https://thehill.com/opinion/white-house/3496791-amateur-hour-at-the-white-house-briefing-room/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Concha",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    " especially those who care about climate change, to support a fairer tax  tax code that doesnt change  that doesnt charge manufacturers workers, cops, builders a higher percentage of their earnings; that the most fortunate people in our nation  and not let the  that stand in the way of reducing energy costs and fighting this existential problem, if you think about that as an example, and to support basic collective bargaining rights as well.",
    "But look, it is  you know, by not  if  without having a fairer tax code, which is what Im talking about, then all  every  like manufacturing workers, cops  you know, its not fair for them to have to pay higher taxes than the folks that  who are  who are  who are not paying taxes at all or barely have.?\nThe original question about how raising taxes on corporations lowers inflation did not get answered.",
    "For all Psakis flaws  among the most notable were pushing hilariously false narratives such as blaming former President Trump for the current border crisis and arguing that spending additional trillions will lower inflation and the deficit and that Republicans want to defund the police  there was confidence behind her answers regardless of whether they were convincing or not.",
    "On another occasion on Wednesday, a reporter asked if there is a new level of alarm within the White House about the stock market?? The question came after stocks plunged for a sixth straight day, with the Dow Jones Industrial Average losing more than 1,100 points, the biggest drop in two years.",
    "Doocy: How does raising taxes on corporations lower the cost of gas, the cost of a used car, the cost of food, for everyday Americans??\nWhat followed was akin to a high school student putting together a series of sentences in order to achieve a mandatory word count on a term paper.",
    "Karine Jean-Pierre leads history-making first briefing as White House press secretary?  USA Today\nNew press secretary hails barrier breakers who paved the way for her?  NBC News\nMeanwhile, on Friday, it was announced that Pentagon spokesman John Kirby is heading to the White House.",
    "Elon Musk is correct: The platform does have a very far-left bias.? Jean-Pierre should apologize while taking these tweets down, but that aint happening and likely never will because a mostly-compliant media isnt broaching them or calling her a conspiracy theorist.",
    "Not only is he petulant dotard but also a deplorable illegitimate president,? was her sentiment in 2017.\nReminder: Brian Kemp stole the gubernatorial election from Georgians and Stacey Abrams,? she said of Abramss gubernatorial loss to Republican Brian Kemp.",
    "And when 79 percent of voters believe the country is headed in the wrong direction, and when the publics approval of the presidents handling of the economy and the border is languishing in the 20s, thats not a job most would sign up for.",
    "And so, I dont  Im not going to comment about that from here.?\nSo while more than 144 million Americans own stock, and many more are invested in 401Ks for their retirement, the White House isnt keeping an eye on it.",
    "Consider this exchange between the new press secretary and Peter Doocy on Monday after the Fox News White House correspondent read the following tweet from Biden on May 16.\nYou want to bring down inflation?",
    "Then theres the question of Jean-Pierres credibility based on her past statements which, if uttered by a conservative or anyone named Trump, would be characterized as a chilling attack on democracy.",
    "And of course, Twitter did not suspend Jean-Pierres account or take those tweets down despite breaking its number one rule regarding false or misleading claims.",
    "Its a good bet all of these former press secretaries would be happy to help, because learning by doing during an election year simply isnt going to cut it.",
    "Here was the answer verbatim, per the official White House transcript:\nJean-Pierre: So, look, I think we encourage those who have done very well  right?",
    "Its a good thing the new Government Disinformation Board has been put on hold, because these reckless claims should be placed at the top of the list.",
    "This early conclusion comes after watching this press secretary read answers to questions, oftentimes for extended periods of time, verbatim.",
    "Kirby, who is steady, likable and credible in this role at the Pentagon, should have been the presidents first choice to replace Psaki.",
    "Multiple reports say Kirby will appear in place of Jean-Pierre on occasion but will not be officially sharing duties with her.",
    "Mike McCurry was excellent under President Clinton, as were Robert Gibbs, Jay Carney and Josh Earnest under President Obama.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The coverage of Jean-Pierre thus far has focused not on her performance but on her gender, race and sexual orientation.",
    "And after watching her first four performances as the presidents spokesperson, only one word sums it all up: amateur.",
    "Oftentimes, as we witnessed with Jean-Pierres predecessor, Jen Psaki, the job calls for defending the indefensible.",
    "And if she is wise, she will reach out to past successful press secretaries who served under Democratic presidents.",
    "Hes also relatively fearless in appearing on all the cable news networks, including Fox News on multiple occasions.",
    "And you know that would not be the case if a press secretary for a Republican president made such chilling claims.",
    "To be sure, White House press secretary is one of the hardest white-collar jobs in the world, if not the hardest.",
    "The decision about Psakis replacement should have been one of the easier ones for the president to make.",
    "Stolen election  welcome to the world of #unpresidented Trump,? she tweeted after the 2016 election.",
    "But Jean-Pierre isnt just a victim of bad luck regarding the president for whom she works.",
    "Lets make sure the wealthiest corporations pay their fair share,? the president tweeted.",
    "Karine Jean-Pierre made her historic debut as White House press secretary this week.",
    "Jean-Pierre: We do not  thats not something that we keep an eye on every day.",
    "Psaki left the White House for MSNBC, which led to Jean-Pierres promotion.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Trump always finds a way to take it to the lowest of lows.",
    "The confidence simply is not there, nor is the conviction.",
    "Joe Concha is a media and politics columnist.",
    "Alas, it went to Jean-Pierre.",
    "Thats also important.",
    "Sleep tight, America.",
    "Right?"
  ]
}