{
  "id": 7249,
  "mediaId": 129,
  "date": "d2022-05-22T11:39",
  "headline": "Frances Ransom",
  "image": "",
  "link": "https://www.nytimes.com/2022/05/22/briefing/haiti-france-slavery-investigation.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    5512,
    517,
    5504,
    2666,
    2688,
    2936,
    2945,
    5534,
    5537
  ],
  "sentences": [
    "BOOKS\nBy the Book: The novelist Ann Leary is not picky about true-crime books, as long as theres a psychopath.?\nTimes best sellers: Jennifer Weiners That Summer Place? is a hardcover fiction best seller.",
    "The Haiti series\nThe Times this weekend published several articles on Haitis history, including:\nThe reparations to enslavers are the root of Haitis misery, as the first piece in the series explains.",
    "My hope is that we can get the Creole version in the hands of some people to read parts of it over the radio, so people in Haiti can hear it and debate it and form their opinions.",
    "Hundreds of Republican legislators in battleground states have embraced Donald Trumps election lies, taking steps to discredit or overturn the 2020 results.",
    "Even countries that are impoverished compared to the United States or Canada, or many Western countries  they still have some level of social services.",
    "Heres a clue from the Sunday crossword:\n90-Across: There was Noah-counting for it\nTake the news quiz to see how well you followed this weeks headlines.",
    "The Biden administration plans to begin blocking Russia from paying American bondholders this week, increasing the likelihood of a Russian default.",
    "After Haitis independence in 1804, France came back and demanded reparations for lost property  which turned out to include the enslaved humans.",
    "We havent even gotten into the U.S. occupation from 1915 to 1934 and Haitis dictator family, both of which further looted the country.",
    "But very quickly, his aides corrected him, saying that he meant he was going to pay the moral debt back; he wasnt talking about money.",
    "The actress Natasha Lyonne hosted the season finale of Saturday Night Live,? which saw four cast members say their last good night.",
    "That debt hamstrung Haitis economy for decades  and kept it from building even basic social services, like sewage and electricity.",
    "NEWS\nThe Latest\nRussia said it had taken control of Mariupol, which would be its most significant symbolic gain of the invasion.",
    "A House-passed bill could focus law enforcements attention on violent extremists like the Buffalo gunman, says Carrie Cordero.",
    "As if that wasnt enough, after Haitis president asked for reparations in 2003, France removed him from office, with U.S. help.",
    "When Haiti was spending up to 40 percent of its revenue on paying back this debt, Costa Rica was building electricity systems.",
    "So I felt that if were going to do a story about Haitian history, surely it should be accessed by the people of that country.",
    "But a new law could become a pretext for the federal government to violate Americans civil liberties, Lucy Steigerwald fears.",
    "Hollywood seems unwilling to judge smaller infractions less harshly than appalling #MeToo transgressions, Pamela Paul argues.",
    "The series is based on more than a year of reporting, troves of centuries-old documents and an analysis of financial records.",
    "In 2010, she went to Port-au-Prince for The Toronto Star to report on the earthquake  an assignment that changed her life.",
    "In 2015, its president, Franois Hollande, said that France had imposed a ransom? on Haiti, and that he would pay it back.",
    "What to Watch For\nAlabama, Arkansas and Georgia hold primary elections on Tuesday, and Texas will hold runoff elections.",
    "THE SUNDAY TIMES MAGAZINE\nOn the cover: Ukrainians in Kharkiv, 25 miles from Russia, have forged a new wartime culture.",
    "It became known as a double debt: Haiti was in debt to former property owners  the colonists  and also to the bankers.",
    " German\nClaire Moses, Ian Prasad Philbrick, Tom Wright-Piersanti, Ashley Wu and Sanam Yar contributed to The Morning.",
    "We need to accept that a Russian nuclear strike is possible and start preparing options, Senator Mitt Romney writes.",
    "More on Catherine Porter: She grew up in Toronto and got her first full-time journalism job at The Vancouver Sun.",
    "An education professor who influenced generations of reading teachers is conceding that her methods fell short.",
    "Female veterans are seeking out psychedelic therapies in Mexico to treat the traumas of war and sexual assault.",
    "I spoke to my colleague Catherine Porter, one of the four reporters who led the project, about what they found.",
    "Theres little public education  its mostly privatized  so poor people dont get much, if any, formal schooling.",
    "FROM OPINION\nThomas Friedman left lunch with President Biden realizing that hes worried he cant unite America.",
    "Any journalist that spends time in Haiti continually confronts the same question: Why are things so bad here?",
    "The most popular form of media in Haiti is the radio, especially in rural areas where illiteracy is high.",
    "Haiti is one of the poorest countries in the world, and a new Times investigative series explores why.",
    "The Russian Orthodox leader Patriarch Kirill I has provided spiritual cover for the Ukraine invasion.",
    "I should have pressed my father more on his views on abortion, Patti Davis writes of Ronald Reagan.",
    "French officials encouraged the Haitian government to take out a loan from the French banks to pay.",
    "Even if youre rich, you have to bring in your own water, and you need a generator for electricity.",
    "The defamation trial between Johnny Depp and Amber Heard is expected to conclude on Friday.",
    "The Book Review podcast: The novelist Brian Morton discusses his new book about his mother.",
    "One by Laurent DuBois mentioned this independence debt,? but he didnt go into much detail.",
    "The Americans most certainly did not want to recognize it; they still hadnt ended slavery.",
    "The British didnt want to recognize it because they had Jamaica and Barbados as colonies.",
    "This other answer lodged into the side of my mouth as I read more history books on Haiti.",
    "That was the first time that I read about it and was like, What is this??\nSo what was it?",
    "Before that, the Haitian government had finally cleared most of its international debts.",
    "Tiger Woods, still struggling with injuries from a car crash, withdrew from the P.G.A.",
    "Embrace mamahuhu.?\nE-pimps: Some men figured out how to optimize intimacy on OnlyFans.",
    "On Saturday, Liverpool and Real Madrid will play in the Champions League soccer final.",
    "The Sunday question: Would a domestic terrorism law help reduce violence in the U.S.?",
    "She has returned more than 30 times and written a memoir about her experiences there.",
    "Ive been covering Haiti since the earthquake in 2010, and returned dozens of times.",
    "Sunday routine: The cosmetics executive Sandra Velasquez takes walks in a cemetery.",
    "If Im talking to anyone on the street in Haiti, theyll speak only Haitian Creole.",
    "One stunning detail: France demanded reparations from Haitians it once enslaved.",
    "Midsummer-like heat is scorching states from Texas to New England this weekend.",
    "Instead, Duvalier and then his son put the country into increased misery.",
    "It was the only Black free country in the Americas, and it was a pariah.",
    "Georgia Republicans are unexpectedly loyal to both Donald Trump and Gov.",
    "The World Economic Forum in Davos, Switzerland, returns after two years.",
    "In conversation: Baz Luhrmann wants to restore Elvis Presleys humanity.",
    "Covid victims final messages make their deaths more vivid, Alicia P.Q.",
    "Theres no real sewage system, so people use outhouses or the outdoors.",
    "Conservatives had controlled the government for the past nine years.",
    "Wall Street called for an invasion of Haiti  and the U.S. obliged.",
    "It is wild: The colonists asked the former slaves for reparations.",
    "You have to remember that, at the time, no one came to help Haiti.",
    "Hybrid work: Are employees ever really coming back in full force?",
    "Waist trainers: Be skeptical of the promise of long-term results.",
    "Theres no real transportation system; its basically privatized.",
    "The center-left Labor Party won Australias national elections.",
    "It also had a strong coffee export industry, like Haiti does.",
    "If youre in the mood to play more, find all our games here.",
    "A Times classic: The telltale signs of sore throat danger.",
    "What might Haiti look like today without this double debt?",
    "The Times is translating these stories to Haitian Creole.",
    "She joined The Times in 2017, leading our Toronto bureau.",
    "It should be made as accessible as possible to Haitians.",
    "The usual explanation for Haitis problems is corruption.",
    "But the series suggests something else is also to blame.",
    "Thanks for spending part of your weekend with The Times.",
    "A dictator, Franois Duvalier, came into power in 1957.",
    "It was one crisis after another inflicted on Haitians.",
    "Right from the get-go, Haiti was in an economic hole.",
    "People were putting in sewage treatment and schools.",
    "That would be closer to what Haiti could have been.",
    "The World Bank had said that Haiti should rebuild.",
    "Advice from Wirecutter: Cool off with a great fan.",
    "Making a choice: Doctors gave her antipsychotics.",
    "You can reach the team at themorning@nytimes.com.",
    "Then the U.S. and France removed him from office.",
    "Theres no real garbage pickup, so trash piles up.",
    "Have France and the U.S. owned up to the damage?",
    "Daily aspirin: It might hurt more than it helps.",
    "Eat: Salmon and rice, perfect culinary harmony.",
    "The French Open tennis tournament begins today.",
    "(Scientists expect a hotter summer than usual.)",
    "The poverty is beyond compare to anywhere else.",
    "In reality, a French bank controlled it.",
    "Recommendation: Forget about perfection.",
    "Haitis president asked for reparations.",
    "Haiti tried to set up a national bank.",
    "Brian Kemp, whom Trump has denounced.",
    "She decided to live with her voices.",
    "Ukraine has not verified the claim.",
    "France has had a slow softening.",
    "The health care is abysmal.",
    "Why tell Haitis story now?",
    "One example is Costa Rica.",
    "This is a Haitian history.",
    "Heres todays Spelling Bee.",
    "See all our lists here.",
    "Heres whats at stake.",
    "Heres todays Wordle.",
    "Haiti just doesnt.",
    "Wittmeyer writes.",
    "Whats the goal?",
    "Championship.",
    "Thats true.",
    "Yeah."
  ]
}