{
  "id": 7252,
  "mediaId": 323,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Biden Keeps Eye on Domestic Politics as He Travels Through Asia",
  "image": "https://images.wsj.net/im-549299/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/biden-keeps-eye-on-domestic-politics-as-he-travels-through-asia-11653210485",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Restuccia",
  "authorUrl": "https://www.wsj.com/news/author/andrew-restuccia",
  "termIds": [
    815,
    1147,
    2087,
    2095,
    571,
    2725,
    2904,
    5073,
    5145
  ],
  "sentences": [
    "On Sunday in Seoul, Mr. Biden appeared alongside the chairman of Hyundai Motor Group, Chung Eui-sun, to tout the South Korean car makers plans to invest more than $10 billion in advanced automotive technology and in an electric-vehicle plant outside Savannah, Ga.\nIt means economic opportunity for an awful lot of Americans,? Mr. Biden said, adding that the plant would hire 8,000 workers.",
    "On Friday, shortly after landing in South Korea, Mr. Biden toured a Samsung Electronics Co. semiconductor plant and joined the countrys new president, Yoon Suk-yeol, to tout the companys plan to spend billions of dollars on a plant in Texas.",
    "Mr. Warnock, who won a special election two years ago, is seeking a full Senate term in November and is expected to face Republican Herschel Walker, a former football star and ally of Mr. Trump, in one of the nations marquee Senate races.",
    "Anthony Albanese, who leads Australias Labor Party, is positioned to become prime minister after Prime Minister Scott Morrison, who leads the countrys Liberal Party, conceded defeat in national elections Saturday.",
    "On Sunday the president arrived in Tokyo, where he will unveil the Indo-Pacific Economic Framework, through which the U.S. intends to work with Asian nations on issues such as supply chains and clean energy.",
    "TOKYOPresident Biden is roughly 7,000 miles from the White House, but domestic affairs have taken a prominent role as he travels through South Korea and Japan in his first trip to Asia as commander in chief.",
    "His overseas travel, which includes the rollout Monday of a new economic framework with Asian countries, has coincided with polls showing a majority of Americans disapprove of his handling of the economy.",
    "Facing steep challenges ahead of Novembers midterm elections, Mr. Biden has used the trip to make the case that he is leveraging global alliances to boost the American economy and promote union jobs.",
    "While keeping an eye on domestic politics, Mr. Biden is grappling with the possibility that North Korea could conduct a test of nuclear weapons or missiles while he tours the region.",
    "In addition to Japan and India, the U.S. hopes to sign up Southeast Asian nations for the agreement, which is intended in part to counter the influence of China in the region.",
    "I am not concerned, if thats what youre suggesting.?\nMr. Biden later met U.S. and South Korean soldiers at Osan Air Base who are watching North Korea and its nuclear program.",
    "Every joint venture that manufactures electric-vehicle batteries would be made stronger by collective-bargaining relationships with American unions,? Mr. Biden said.",
    "Later in the trip, the president will meet with the leaders of Japan, India and Australia, which with the U.S. make up the Quadrilateral Security Dialogue, or Quad.",
    "Mr. Biden called for companies that build U.S. manufacturing facilities to commit to hire union workers, part of his longstanding promotion of organized labor.",
    "Messrs. Biden and Yoon said the two nations would begin discussions to expand joint military exercises in response to North Koreas ramped-up missile testing.",
    "Left unmentioned in Mr. Bidens speech: Brian Kemp, the states Republican governor, who touted Hyundais investment at a separate event two days ago.",
    "Mr. Albanese, who is expected to attend the event in Tokyo, will be the second new world leader Mr. Biden has met during the trip.",
    "In his remarks, Mr. Biden called out by name those senators, Raphael Warnock and Jon Ossoff, for their work in landing the plant.",
    "The Senate is currently balanced 50-50, with Democrats in control thanks to the tiebreaking vote of Vice President Kamala Harris.",
    "Georgia voted narrowly for Mr. Biden in his 2020 defeat of then-President Donald Trump and elected two Democratic senators.",
    "Jake Sullivan, Mr. Bidens national security adviser, told reporters on Sunday that Taiwan wont be a part of the framework.",
    "U.S. officials said they have made little progress in efforts to open a dialogue with North Korea about denuclearization.",
    "Weve thought through how we would respond to whatever they do,? Mr. Biden told reporters in Seoul.",
    "The U.S. president spent parts of three days with Mr. Yoon, who took office earlier in the month.",
    "Write to Andrew Restuccia at andrew.restuccia@wsj.com and Ken Thomas at ken.thomas@wsj.com",
    "North Korea also faces a Covid-19 crisis after declining to vaccinate its citizens.",
    "Mr. Biden said Saturday that Pyongyang hasnt responded to a U.S. offer of vaccines.",
    "You are the front line, right here in this room,? Mr. Biden told the soldiers.",
    "On Sunday, Mr. Biden said he is ready if North Korea acts provocatively.",
    "U.S. inflation is at its highest level in 40 years.",
    "We are prepared for anything North Korea does."
  ]
}