{
  "id": 7260,
  "mediaId": 1576,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Georgia voters showed us these 3 things about the fall election",
  "image": "https://www.wabe.org/app/uploads/news/npr-stories/image00037_custom-d859f2a9fdaf0efebd4910514a11f5dce4996efb-336x189.jpeg",
  "link": "https://www.wabe.org/georgia-voters-showed-us-these-3-things-about-the-fall-election/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Talking at a farmers market in the prosperous town of Norcross, she expressed concern about the Big Lie and what just came out from the Supreme Court,? referring to false claims of a stolen presidential election in 2020, and a leaked draft opinion suggesting the court is close to overturning a constitutional right to abortion.",
    "The election cycle is going to be won by the Latino vote,? she said, and not enough has been done to ensure that we continue to reach out  including here in my county, and thats the work that we still have to do.?\nThe audio for this story was produced by Nina Kravinsky and Chad Campbell, and edited by Kelley Dickens.",
    " Thats super important for us because, you know, we have values and in Gwinnett, you dont get those.?\nAsked which values she meant, she listed opposition to illegal immigration, opposition to abortion and her concern about what the kids are being taught in school.?\nHer main concern is the governors race.",
    "Her next-door neighbor told us she moved from Los Angeles to Forsyth County partly because LA was so Democratic,? allowing too much freedom? and sexuality.?\nThe diverse electorate is contested\nBoth the red and blue counties reflect Americas demographic changes.",
    "Forsyth resident Vicky Lou Kerner follows politics  she has decorated her restaurant with a sign reading, Warning: Does Not Play Well With Liberals?  but when asked about local issues mentioned only traffic and construction, problems associated with growth.",
    "I dont have the knowledge to vote correctly,? said Bradley Coughlin of Gwinnett, who voted in 2020 to get Trump out of office, but says he doesnt know congressional, state or local candidates as well as presidential contenders.",
    "So far she feels strongly about one issue: She worries that schools are encouraging children to pick and choose who they want to become? regarding gender and sexuality, which is a Republican talking point.",
    "Brenda Lopez Romero, Gwinnett Countys Democratic chair and herself an immigrant from Mexico, told us Republicans have done better than Democrats for years in targeting messages to the Latino community.",
    "Gwinnett and Forsyth are next to each other, affected by many of the same cultural and economic trends, yet in 2020 Gwinnett voted 58% for President Biden and Forsyth voted 65% for Trump.",
    "We interviewed 36 people in Democratic-leaning Gwinnett County and Republican-leaning Forsyth County, ranging from local officials and activists to people we found by knocking on doors.",
    "We found several immigrants, from Latin America and beyond, who were socially conservative; who oppose illegal immigration (saying they came legally); or who voted for Trump in 2020.",
    "People like the direction of their communities, yet worry about the country\nThe blue and red counties are both growing: Metro Atlanta is a corporate, technology and cultural center.",
    "The governors race and legislative contests may decide who writes, signs or vetoes abortion legislation after an expected Supreme Court ruling that could overturn Roe v. Wade.",
    "She said many Latinos worry about more than immigration issues, and Democrats must ensure that prosperity is available for everyone,? especially working-class families.",
    "The overall results may show the level of former President Donald Trumps influence in a state at the center of his efforts to overturn his election defeat in 2020.",
    "Yet residents told us they like where they live, and when asked to name concerns in their community, most in both counties found little to be concerned about.",
    "Fox News host Tucker Carlson is a leading advocate of replacement theory,? an unfounded claim that Democrats are replacing? current voters with new ones.",
    "Gwinnetts affordable housing market has fueled phenomenal growth for 30 years: The population has nearly tripled in that time, approaching 1 million.",
    "This segregation is visible on county-by-county election maps, where big metropolitan areas tend to be colored deep blue, and rural areas deep red.",
    "In Atlantas distant suburbs, voters across the political spectrum report that local life is good in 2022  but the direction of the country is not.",
    "National political analysts took note in 2020 when Trump fared better than expected among some groups of Latinos in South Florida and South Texas.",
    "In Gwinnett County, Republican-led redistricting created a red-leaning state legislative district that includes a large Korean American community.",
    "Gwinnett is especially diverse: Its population is nearly one-quarter Latino, largely of Mexican descent but with many other nations represented.",
    "Its not clear from studies how often people move specifically for political reasons, but our random interviews found people who said they did.",
    "Both counties have attracted migrants from across the nation and around the world; nearly everyone we met was originally from somewhere else.",
    "A changing electorate brought Democrats to the fore, not only voting for Biden but controlling the entire five-member county commission.",
    "Shes preparing to vote in the U.S. for the first time and has been following events by way of a local TV station, CNN and Fox News.",
    "The national demographic change colors debates over immigration, policing, history, education and almost every other issue.",
    "People in both the blue county and the red county look out their windows at growing, livable, diverse American communities.",
    "We also met a Gwinnett County shop owner, Iris Magayon, whos an immigrant from Mexico and recently became a U.S. citizen.",
    "The number of local newspapersin many communities has declined in recent years, while national media are more polarized.",
    "We asked people open-ended questions about what was on their minds rather than specifically prompting them as polls do.",
    "Americans are politically segregated\nStudies find Americans increasingly geographically divided by political party.",
    "Some wrote off the 2020 results to local factors, while others worry about a serious erosion of their coalition.",
    "Our interviews with voters in Gwinnett and Forsyth counties suggest Democrats have some reason to worry.",
    "The Republican candidate, running unopposed in the primary, is Soo Hong, a Korean immigrant and lawyer.",
    "In this falls elections, Georgias U.S. Senate race could plausibly decide control of the entire Senate.",
    "As recently as 10 years ago, Gwinnett was a Republican county that voted for Mitt Romney for president.",
    "Meeting people face to face in their neighborhoods offers insights that public opinion polling may not.",
    "[Im] just praying that Stacey Abrams wont take over,? she said, referring to the Democratic candidate.",
    "We came away with three insights that seem likely to apply to elections in many parts of the country.",
    "Republicans have opened community centers in Black and immigrant neighborhoods around metro Atlanta.",
    "We visited two metro Atlanta counties  one blue and one red, both prosperous, populous and diverse.",
    "After seeing the county change, she moved a year and a half ago to a new neighborhood in Forsyth.",
    "The onetime football star is endorsed both by Trump and Senate Republican leader Mitch McConnell.",
    "Forsyths population has more than quintupled in the same period, from 44,000 to about 250,000.",
    "Hong told us she is definitely? part of an effort for her party to win over voters of color.",
    "It draws on racist ideas that foreign voters will be more obedient,? to use Carlsons word.",
    "Its useful to see where people live  the geography, the economy and who lives next door.",
    "Some parents worry about whats being taught in schools  but not necessarily their own.",
    "Thats one of three major insights we gained while interviewing voters in a key state.",
    "Esther Harding lived in Gwinnett years ago, when its populace was more Republican.",
    "Brian Kemp, even though shes unhappy with Kemp for affirming Trumps 2020 defeat.",
    "We visited immigrant neighborhoods where many people crowd into a single house.",
    "Yet Republicans have been fighting for a share of the more diverse electorate.",
    "Similar changes across the nation fuel some conservative conspiracy theories.",
    "Harding is concerned enough about this to support incumbent Republican Gov.",
    "Then they read stories of a nation in grave peril from the other party.",
    "Their likely U.S. Senate candidate is Herschel Walker, whos Black.",
    "National Democrats differ on how seriously to take this threat.",
    "Both reflect the national economic recovery from the pandemic.",
    "Both have growing numbers of people of color and immigrants.",
    "All this is consistent with the information environment.",
    "Joan Van Lake of Gwinnett didnt name any local concerns.",
    "Those who do vote are likely to act on national issues.",
    "There are substantial Black and Asian populations.",
    "New housing developments fill valley after valley.",
    "Inflation is climbing in Georgia, like everywhere.",
    "I dont think diversity means Democrats,? she said.",
    "Up to now, diversity has been good for Democrats.",
    "Forsyth is a great county to live in,? she said.",
    "Republicans in 2022 hope to widen that opening.",
    "Its not as Democratic ruled as Gwinnett is.",
    "Some people dont plan to vote this year.",
    "Rachel Treisman produced it for the web.",
    "My issues are more national,? she said.",
    "May 21, 2022\nMay 20, 2022\nTrending",
    "This reflects a national trend.",
    "She supports abortion rights.",
    "Prosperity is not universal."
  ]
}