{
  "id": 7290,
  "mediaId": 238,
  "date": "d2022-05-23T11:20",
  "headline": "On our radar: Pence appearing in Ga. as part of pushback against Trump-backed candidates for governor",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/23/pence-trump-kemp-biden-taiwan/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mariana Alfaro",
  "authorUrl": "https://www.washingtonpost.com/people/mariana-alfaro/",
  "termIds": [
    1147,
    1248,
    1434,
    2087,
    2095,
    3094,
    5513,
    5540,
    5548,
    2537
  ],
  "sentences": [
    "Over the course of his long career in politics, Biden has delivered four commencement addresses at the University of Delaware, his alma mater, but this  his fifth  will be his first as president.Biden plans to hold a Quad meeting on Tuesday with Japanese Prime Minister Fumio Kishida, Indian Prime Minister Narendra Modi and newly elected Australian Prime Minister Anthony Albanese.",
    "A few days after George Floyd was murdered, presidential hopeful Joe Biden addressed the nation, speaking passionately about police reforms that he stressed could not wait another month, let alone another election cycle: banning police chokeholds; rules for use of force; a review of every police department's hiring, training and de-escalation practices.",
    "The Post's Seung Min Kim, Michelle Ye Hee Lee and Cleve R. Wootson Jr. report that a White House official walked back Biden's remarks almost immediately, saying Biden simply had reemphasized a pledge made through a 1979 law that calls on the United States to provide Taiwan with the military means for self-defense.",
    "The party is attempting to weave together a message that both addresses the challenging economic environment while also blaming Republicans  whom Democrats are now referring to as MAGA Republicans'  for Roe v. Wade's likely reversal stripping away a woman's ability to get an abortion in many states.",
    "A U.S. military plane filled with more than 70,000 pounds of baby formula arrived in Indianapolis on Sunday from Germany, part of Operation Fly Formula, a Biden administration initiative that aims to quickly increase supplies of the food source amid a national shortage.",
    "They write:\nTo protect incumbents up for reelection this year, the Republican Governors Association decided to spend millions of dollars in primaries, an unusual step for an organization that typically reserves its cash for general election matchups against Democrats.",
    "Analysis: Women are once again becoming the focus of the midterms\nReturn to menu\nAmong the issues emerging as key to the midterms: the baby formula shortage, high gas prices, rising food costs and the coming Supreme Court decision on whether to overturn Roe v. Wade.",
    "Return to menu\nOver the weekend, in his latest update on the leading 2024 Republican presidential contenders, our colleague Aaron Blake noted that former vice president Mike Pence has been carving out some calculated distance from former president Donald Trump.",
    "Cheney's comment came after she accepted a Profile In Courage Award from the John F. Kennedy Library Foundation for seeking to hold Trump accountable in the wake of the Jan. 6, 2021, insurrection, despite retaliatory actions from members of her own party.",
    "Writing in The Early 202, The Post's Leigh Ann Caldwell and Theodoric Meyer note that these issues directly impact women, and they are putting into focus once again the central role played by female voters, especially in the majority-making suburbs.",
    "Return to menu\nPresident Biden's assertion Monday that the United States would respond militarily to defend Taiwan if China tries to take it by force is winning praise from some Republicans often more inclined to criticize the president's policy.",
    "Over the weekend, The Post's Annie Linskey, Josh Dawsey, Michael Scherer and Matthew Brown took a look at a broader effort by Republican governors to push back against Trump-backed challenges to several of their incumbents, including Kemp.",
    "Following Biden's remarks at a news conference in Japan, a White House official said Biden simply had reemphasized a pledge made through a 1979 law that calls on the United States to provide Taiwan with the military means for self-defense.",
    "During her remarks, Cheney, who serves as vice chair of the House select committee investigating the insurrection, said we face a threat we have never faced before  a former president attempting to unravel our constitutional republic.",
    "Return to menu\nThe shortage of baby formula was a hot topic on the Sunday shows, with National Economic Council Director Brian Deese and other officials pressed about how it happened and how the military is being used to address it.",
    "issued a plea Sunday for Americans to stand up in a bipartisan fashion to the actions of Donald Trump, who she said is the only U.S. president who did not live up to a sacred obligation to defend the peaceful transfer of power.",
    "The administration has been mulling for months whether Biden should issue an executive order on police reform, leaving civil rights leaders frustrated at the delay and whether it will result in any enduring improvement.",
    "Return to menu\nTwo years after George Floyd's killing sparked demonstrations for police reform and a national movement to confront systemic racism, the push to rehabilitate police departments has stagnated.",
    "The latest example is Pence's decision to campaign Monday night in Georgia with the state's incumbent GOP governor, Brian Kemp, who faces a primary challenge Tuesday from former U.S. senator David Perdue.",
    "Return to menu\nIn a news conference Monday in Tokyo, President Biden said the United States would defend Taiwan militarily if it came under attack by China, despite the U.S. policy of strategic ambiguity.",
    "Trump recruited Perdue and made him his marquee candidate in a larger crusade against GOP officeholders who opposed his fight to overturn the 2020 election, which was rooted in false claims about fraud.",
    "Democrats control Washington, so they are trying to explain how Republicans are blocking their agenda and how it would be much worse if the GOP controlled either or both chambers of Congress next year.",
    "Brian Kemp (R) at a get-out-the-vote rally Monday night, bucking former president Donald Trump, who is supporting Kemp's challenger in the GOP gubernatorial primary, former U.S. senator David Perdue.",
    "The influx of RGA money in Georgia, according to strategists on both sides of the governor's race, has dealt a devastating blow to Perdue, who has struggled to raise funds to compete.",
    "A bill bearing Floyd's name aimed at overhauling police practices died in the Senate, even after President Biden urged legislators to get it done in his first address to Congress.",
    "The United States retains a policy of strategic ambiguity toward the island, meaning it is deliberately unclear on what it would do when it comes to the issue of defending Taiwan.",
    "Biden made the remark as he began the second leg of his Asia tour Monday, signaling a more confrontational approach to China in matters of both the economy and national security.",
    "Later Monday, Biden's administration announced the outlines of a new trade agreement that is meant to strengthen U.S. economic ties with other nations in the Indo-Pacific region.",
    "In a news conference Monday, Biden said the United States would defend Taiwan militarily if it came under attack by China, comments the White House immediately sought to clarify.",
    "The United States retains a policy of strategic ambiguity toward the island, meaning it is deliberately unclear on what Washington would do when it comes to defending Taiwan.",
    "Having said that, I personally kind of like it because it does provide a deterrent message that we will defend Taiwan, and coming from the president, it's very, very strong.",
    "Aaron writes:\nPence has criticized as un-American Trump's plot to have him unilaterally overturn the election  an issue on which, it turns out, Republicans side with Pence.",
    "Seung Min Kim: The week ahead at the White House  Following his return this week from his first presidential trip to Asia, Biden will participate in commencement season.",
    "You can read Aaron's analysis on how that affects Pence's standing among potential 2024 White House contenders and see what he has to say about the other hopefuls here.",
    "The Jan. 6 committee plans to start holding public hearings next month, and members have said they will have plenty of new evidence about what transpired that day.",
    "Biden also made news in Japan on Monday by saying that he did not believe a quarantine to prevent the spread of monkeypox in the United States would be necessary.",
    "Both the official  who spoke on the condition of anonymity in clarifying Biden's comments  and the president said that U.S. stance has not changed.",
    "Brian Kemp (R), who faces a primary challenge from David Perdue after the former senator was recruited to run by former president Donald Trump.",
    "Meanwhile, instead of traveling to Georgia to support Perdue, Trump plans to participate in a telerally with his candidate on Tuesday night.",
    "China needs to know that if it invades Taiwan, just like when [Russian President Vladimir] Putin invaded Ukraine, there will be a response.",
    "The Washington Post's Cleve R. Wootson Jr. takes a look at what's changed in the past two years, particularly in Biden's tone and emphasis.",
    "As citizens, every one of us has a duty to set aside partisan battles and stand together to perpetuate and preserve our great republic.",
    "House members are beginning a two-week stretch in their home districts and Democrats are tailoring their message to reach women voters.",
    "He also went after his party's apologists for Russian President Vladimir Putin after Trump praised Putin's supposed strategic genius.",
    "Today, on the eve of another round of key primaries, former vice president Mike Pence is slated to campaign with Georgia Gov.",
    "He also said he did not believe a quarantine to prevent the spread of monkeypox in the United States would be necessary.",
    "), the top Republican on the House Foreign Affairs Committee, said Biden's comments appeared premature and off the cuff.",
    "I don't think the intelligence community would appreciate this remark, McCaul said during an appearance on CNN.",
    "The RGA invested some $5 million in Georgia, according to a person familiar with the group's outlays.",
    "On Tuesday, there are also races on the ballot in Alabama and Arkansas, as well as runoffs in Texas.",
    "The race, in which Kemp is heavily favored, could be among Trump's biggest defeats of the cycle.",
    "Return to menu\nFormer vice president Mike Pence is scheduled to appear alongside Georgia Gov.",
    "He is scheduled to deliver remarks at the graduation and commissioning ceremony at the U.S.",
    "Or will we look away from danger, ignore the threat, embrace the lies, and enable the liar?",
    "Naval Academy in Annapolis on Friday and then at the University of Delaware on Saturday.",
    "Meanwhile, President Biden continues his first trip to Asia since becoming president.",
    "Perdue is also holding a separate news conference to encourage Republicans to vote.",
    "The question for every one of us is in this time of testing, will we do our duty?",
    "At this moment we must all summon the courage to stand against that, she said.",
    "And now he offers a high-profile endorsement in opposition to Trump.",
    "You can watch a video pulled together by The Post's Blair Guild.",
    "We're not going to sit back idly and watch them invade Taiwan.",
    "Trump plans to hold a tele-rally for Perdue on Monday night.",
    "I think deterrence is important here, McCaul said on CNN.",
    "Will we put duty to our oath above partisan politics?",
    "Biden is to return to Washington on Tuesday night.",
    "But that's a tough challenge at the moment.",
    "I think China needs to understand that.",
    "Return to menu\nRep. Liz Cheney (R-Wyo.)",
    "You can read more about that here.",
    "Supporters can call in to listen.",
    "Will we defend our Constitution?",
    "Rep. Michael McCaul (R-Tex.",
    "Trump is all-in for Perdue.",
    "Will we stand for truth?",
    "..."
  ]
}