{
  "id": 7291,
  "mediaId": 558,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Cheney and Pence take the fight to Trump, from Georgia to Wyoming",
  "image": "https://s.yimg.com/uu/api/res/1.2/5Lc3XMSrnBPwMqh2ZAF3EA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/5f11a600-d7b4-11ec-bf59-0e0e9aaff162",
  "link": "https://sg.news.yahoo.com/amphtml/cheney-and-pence-take-the-fight-to-trump-from-georgia-to-wyoming-173606913.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    3094
  ],
  "sentences": [
    "She was one of five people given the award, along with Ukrainian President Volodymyr Zelensky and three other American officials from both parties who came under intense attack by Trump and his supporters after the 2020 election.",
    "But the Georgia rally is the clearest sign so far that he is willing to do more than just poke at Trump ahead of the 2024 Republican primaries, which is increasingly likely to pit the two men against each other.",
    "At this moment we must all summon the courage to stand against that, Cheney, a Wyoming Republican and Donald Trump's chief antagonist in the GOP, said in a speech Sunday night.",
    "Pence has walked a careful line for months, at once seeking to rebut Trump's lies about the election while still celebrating their administration's policy accomplishments.",
    "Conversely, Republicans who hope to move the Republican Party past Trump have coalesced , fundraising for her as she attempts to stave off the former president's assault.",
    "Cheney spoke of looking at of George Washington resigning his commission as commander in chief of the Continental Army at the conclusion of the Revolutionary War in 1783.",
    "Cheney's direct shot at Trump  referring to him as a current and ongoing threat to the republic's survival  kicks off a week full of drama within the GOP.",
    "1 target for removal after the 2020 election, because Kemp, a conservative Republican, refused to go along with Trump's efforts to overturn the results.",
    "Polling has consistently shown Kemp above 50%, ahead of Perdue by enough to avoid a runoff election and win the GOP nomination outright on Tuesday.",
    "Cheney delivered the remarks at the John F. Kennedy Presidential Library after the institution presented her with a Profile in Courage award.",
    "But defeating Cheney, the most outspoken Trump critic inside the GOP, in Wyoming's Aug. 16 primary is now a top priority for him.",
    "The battle for the Republican Party is entering a new phase, and Rep. Liz Cheney sounded the first shot of it on Sunday evening.",
    "Close observers of Pence have noticed a pattern of steady and gradual escalation of his willingness to rebuke Trump.",
    "We face a threat we have never faced before: a former president attempting to unravel our constitutional republic.",
    "Trump has had in contested primaries where he has tried to oust Republicans he deems insufficiently loyal to him.",
    "Pence's appearance with Kemp is the former vice president's boldest move yet in his ongoing divorce from Trump.",
    "Kemp appears poised to defeat Trump's handpicked candidate for governor, former U.S. Sen. David Perdue.",
    "Brian Kemp on Monday evening, the night before Republican voters go to the polls in the Peach State.",
    "Having that Georgia is a lost cause, Trump is launching a new offensive out west against Cheney.",
    "On Saturday, he will travel to Wyoming to and for her primary opponent,.",
    "Trump's former vice president, Mike Pence, will rally with Georgia Gov.",
    "Trump made Kemp his No."
  ]
}