{
  "id": 7294,
  "mediaId": 129,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "The Depp-Heard Trial Isn't Even the Weirdest Thing About America Right Now",
  "image": "https://static01.nyt.com/images/2022/05/23/opinion/23conversation_1/23conversation_1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/23/opinion/heard-depp-trial.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2095,
    2303,
    3094
  ],
  "sentences": [
    "I think the case serves as a reminder that the current politicized vision of relationships  in which men always hold all the power, including physical power; women are generally presumed to be the victimized party, as well as the honest one; and romantic relationships are supposed to abide by the dictates of a legal brief, not the alchemy of desire  just doesn't conform to the way most people experience life.",
    "I also think the reason the trial has captured this kind of attention  aside from the pure entertainment value of watching two deeply troubled celebrity exes go at each other as if they were re-enacting a scene from Gladiator  is that for many people it represents a kind of corrective to the excesses of the #MeToo movement.",
    "On the other hand, homicide rates in major American cities were 44 percent higher in 2021 than they were in 2019, and there's a palpable sense of lawlessness and urban decay in one downtown after another, including a random killing Sunday morning on the subway in New York.",
    "Couldn't be a more important topic, but the stories we've heard since  like the controversy over whether she defecated on their bed or if it was the dog  don't really bring a desirable kind of attention to spousal abuse issues.",
    "Meanwhile, the war in Ukraine rages on, abortion rights are on the line at the Supreme Court, inflation is high and the markets are tanking, and yet the most divisive issue of our time seems to be  Amber Heard v. Johnny Depp.",
    "Gail: Not a fan of Biden acknowledging now that he won't run again, as I've mentioned before, but I do admit one plus would be bringing the race for 2024 up front right away and giving the new talent a chance to show itself.",
    "Can't actually say I'm feeling optimistic right now, but I do believe there's a huge difference between Democrats Can't Govern  the big issue this fall  and Who Wants Trump Back?, which will be the big issue in two years.",
    "Despite all this, the White House seems to think that Biden is a plausible candidate for re-election in 2024, which at this point looks about as likely as that vacation I was supposed to take in Vladivostok.",
    "If the endorsee is, say, Representative Madison Cawthorn, the newly rejected 26-year-old congressional juvenile delinquent, they've got plenty of information to make a choice on their own.",
    "Gail: I guess everyone who watches late-night talk shows now knows that Depp is suing his ex-wife for defamation over a 2018 op-ed she wrote in The Washington Post about domestic violence.",
    "Bret: Whatever happens to Liz Cheney  and things don't look great for her right now  she's earned her own chapter in some future sequel to John F. Kennedy's Profiles in Courage.",
    "Gail: You know, when people visit our apartment, their favorite home decoration is almost always the letter Donald Trump wrote calling me a dog with the face of a pig.",
    "Bret: Well, he's done a much better job standing up for Ukraine than I had expected he might, and I'll give him and his national-security team full marks for that.",
    "Gail: Maybe the rule on Republican primaries is that party voters will back the Trump candidate if they know virtually nothing about the people who are running.",
    "Gail: One primary that's going to tell us a lot about Trump's ability to impose his will on an election where the voters are well informed should be in Wyoming.",
    "Bret: I woke up on Saturday to the news that my name was on a list of 963 Americans barred for life by the Russian foreign ministry from visiting Mother Russia.",
    "And because we're trying to turn around a long human history in which violence against a sexual partner wasn't seen as serious as violence against anybody else.",
    "Which is about as upsetting as waking up to a call from your doctor who says, It isn't cancer or a message from an ex that reads, I was wrong about everything.",
    "Bret: Agree again, but while Heard has accused Depp of being violent, she also said on the stand that It's always been my own testimony that I hit Johnny.",
    "Last thing, Gail, our readers shouldn't miss Dwight Garner's obituary for Roger Angell, The New Yorker's great baseball writer, who died last week at 101.",
    "He's on the leftward side of a Democratic Party that is struggling to overcome the perception that it leaned too far left in Biden's first year.",
    "Gail: If our readers want to mull this matter further, I really recommend our colleague Michelle Goldberg's Heard-Depp column from last week.",
    "Gail: Embarrassing to look all around the country and see previously sane Republicans who now feel compelled to deny Biden won the election.",
    "Gail: But when it comes to issues of physical abuse, a woman deserves immediate attention, partly just out of concern for her safety.",
    "Gail: Fetterman is overly colorful for my taste, constantly showing up in shorts for public events and bragging about his tattoos.",
    "The older I get, the more I realize that winning in politics is mostly a game of being slightly less stupid than your opponent.",
    "Gail Collins: Bret, I'm a big fan of Hollywood gossip as an antidote for dwelling too long on deeply depressing current events.",
    "The big one in Pennsylvania for the Republican Senate nomination, featuring Dr. Oz versus Business Guy, is still unresolved.",
    "We may have been spared a migration crisis this summer, but only because a Trump-appointed judge blocked the C.D.C.",
    "That's all the more notable because Kemp stood by Biden's victory in the state's 2020 presidential election.",
    "But this one is pretty depressing itself and I kinda wish we could talk about some other celebrity story.",
    "Men who are subject to those kinds of accusations obviously deserve to have their defenses listened to.",
    "Bret: Inflation hasn't been this high in 40 years and it can cost more than $100 to fill a tank of gas.",
    "If only you could get Vladimir Putin to drop you a note saying, Looking forward to seeing you  Never!",
    "Gail: Well, the first panic-possible moment is this fall, when we see how the midterm elections go.",
    "There's a word for that kind of magnificent honesty, often associated with bowling, tennis or golf.",
    "Of course, Oz and David McCormick, his closest opponent, could still tear the Pennsylvania G.O.P.",
    "Bret: On a related note, it will be interesting to see if Marjorie Taylor Greene wins her G.O.P.",
    "Bret: I'm OK with the Russian sanction on me so long as it doesn't involve poisoned underpants.",
    "Is this because you canceled a summer vacation reservation for the Trans-Siberian Railway?",
    "Bret: The other primary race that fascinates me, Gail, is the one for governor in Georgia.",
    "Gail: Conservative refusal to control gun sales is my nominee for the Misgovernment Medal.",
    "In fact that's possibly the only question in which Biden definitely comes out the winner.",
    "It may be a good indication that Trump's power in the party is finally beginning to wane.",
    "to pieces fighting for the 1,000 or so votes that separated them in last week's primary.",
    "That'd certainly leave our former president gnawing on a Mar-a-Lago porch railing.",
    "That isn't Biden's fault, but it adds to a perception of Democratic misgovernance.",
    "We also seem to be teetering on the verge of a recession, which would be  bad.",
    "leadership has enabled white nationalism, white supremacy, and antisemitism.",
    "Bret: My guess is that Fetterman will have a tough time winning in November.",
    "Bret: Heard is a lot more convincing as an actress than she is as a witness.",
    "And nobody should automatically be seen as guilty until the evidence is in.",
    "Or perchance the Russian reaction to your very powerful anti-Putin column?",
    "But his policies are perfectly reasonable, and I think he has a real shot.",
    "Gail: Speaking of eloquent, what about the primaries that just occurred?",
    "Gail: Bret, this is one of the most interesting openings we've ever had.",
    "Hey, did you know Dick Van Dyke has signed up for a fitness class at 96?",
    "After the recent shooting in Buffalo, she tweeted that the House G.O.P.",
    "Which has got to be a plus for the Democratic nominee, John Fetterman.",
    "Totally confident right now that most Americans don't want Trump back.",
    "If she loses, maybe she can blame those Jewish space lasers again.",
    "Bret: Michelle eloquently expresses the exact opposite of my view.",
    "It looks like I won't be vacationing in Vladivostok anytime soon.",
    "Good to know we are both attentive readers of The New York Post.",
    "Always good to see one magnificent writer do justice to another.",
    "Brian Kemp's job, and it looks like Perdue will lose in a rout.",
    "Trump favorite David Perdue is making a run for incumbent Gov.",
    "Bret: Those Republicans aren't sane, but I take your point.",
    "Bret: A decent strategy unless Ron DeSantis is the nominee.",
    "My question for you is, when do Democrats start panicking?",
    "Bret: Glad to have possibly won you over on that point.",
    "Gail: Of course the Wyoming primary isn't until August.",
    "As well as watching the actual government in operation.",
    "Or Omsk, Tomsk, Yakutsk or Smolensk, for that matter.",
    "it'd be the ultimate example of high-end hate mail.",
    "Plenty of stuff to look forward to before then.",
    "Gail: OK, we're now at Disagreement Central.",
    "How do you think Biden's doing these days?",
    "Or is that just wishful thinking?",
    "Will Liz Cheney get renominated?",
    "Any thoughts on that race?",
    "'s effort to end Title 42.",
    "Bret Stephens: Hi, Gail.",
    "Are you taking a side?",
    "primary in Georgia.",
    "Bret: Yes and yes.",
    "Your thoughts?",
    "Bret: I did.",
    "Gail: Amen."
  ]
}