{
  "id": 7295,
  "mediaId": 195,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "The Hills Morning Report  Will GOP primaries offer clues about 2024?",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_georgiaelectionsticker_071616_ap.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3499151-the-hills-morning-report-will-gop-primaries-offer-clues-about-2024/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    2095,
    2303
  ],
  "sentences": [
    "Im here because Brian Kemp is the only candidate in tomorrows primary who has already defeated Stacey Abrams, whether she knows it or not, Pence told rally attendees, referring to Abramss refusal to accept the election results of their gubernatorial election four years ago (The Atlanta Journal-Constitution).",
    "Brooks, who is facing off against Katie Britt, the former chief of staff for retiring Sen. Richard Shelby (R-Ala.), and Army veteran and businessman Mike Durant, has found life in recent weeks as his two rivals have targeted each other to the tune of more than $4 million, allowing him to gain traction.",
    "LEADING THE DAY\n CONGRESS\nSenate Majority Leader Charles Schumer (D-N.Y.) is leading negotiations with West Virginia centrist Democrat Sen. Joe Manchin about the policy ingredients that could fit in a budget reconciliation measure of unknown size after Democrats failure to come together last year.",
    "IN FOCUS/SHARP TAKES\n UKRAINE CRISIS\nUkrainian President Volodymyr Zelensky on Monday warned the U.S. and, specifically, supporters of the America First agenda that defeating Russia now should be a priority, as a fallen Ukraine could lead to Moscow targeting the Baltic states and NATO regions.",
    "For example, Mehmet Oz is clinging to a lead of 987 votes in the Pennsylvania Senate GOP race, while the Republican governors machine pushed state Sen. Jim Pillen (R) to victory in the Nebraska gubernatorial contest two weeks ago over Trumps preferred candidate, Charles Herbster.",
    "Zelensky, speaking to Axios in a remote interview at the world economic forum in Davos, Switzerland, noted that an invasion of a Baltic nation  including Estonia, Lithuania and Latvia, which are all NATO members  would trigger the requirement for U.S. troops to enter the region.",
    "Harris at 7:20 p.m. will address the Asian Pacific American Institute for Congressional Studies awards dinner at the Renaissance Hotel in Washington, D.C.\nBlinken, who today was in Tokyo with the president before Bidens departure, met with Australian Foreign Minister Penny Wong.",
    "NBC News: Cases of suspected monkeypox in the U.S. (one each in Massachusetts, New York City and Florida and two in Utah) are being investigated by the Centers for Disease Control and Prevention, which said on Monday there is no evidence the disease has become more infectious.",
    "Iranian President Ebrahim Raisi on Monday said his country will avenge the death of Revolutionary Guards Col. Sayad Khodai a day after the elite corps officer was shot five times outside his home and killed by two people on a motorcycle in a rare assassination in Tehran.",
    "BIDEN, CHINA & INTERNATIONAL\nBiden in Tokyo on Tuesday met with fellow quad leaders from Japan, India and Australias new prime minister and encouraged the democratic world to continue to support Ukraine against Russias aggression (The Associated Press).",
    "As The Hills Hanna Trudo previews, Cuellar, the lone Democrat opposed to abortion rights remaining in the lower chamber, is among the preeminent targets of the left wing, which is under pressure to build on recent momentum gained in recent weeks.",
    "ELSEWHERE\n Associated Press / Zhang Xiaoyu, pool photo | President Biden on Tuesday in Tokyo with host Japanese Prime Minister Fumio Kishida, Prime Minister Narendra Modi of India, Australian Prime Minister Anthony Albanese (to Bidens right).",
    "The investigation focuses on whether he may have had an undisclosed financial interest, and engaged in an improper relationship with an individual employed on his congressional staff (Washington Examiner, The News & Observer and The Hill).",
    "To stave off a possible premium increase this fall for health coverage under the Affordable Care Act, vulnerable House Democrats are urging congressional action to extend enhanced ObamaCare assistance made available last year (The Hill).",
    "As The Hills Niall Stanage writes in his latest Memo, the former president still has enormous influence with his base, but the primary contests have shown that he cannot simply anoint his preferred candidate and assume they will win.",
    "PANDEMIC & POX\n' Pfizer and BioNTech announced on Monday they plan to submit data to the Food and Drug Administration for three doses of their COVID-19 vaccine for children at least 6 months old up to children under 5 years old.",
    "Bidens entreaties appeared aimed in part at Indias Prime Minister Narendra Modi, seated near him, who has adopted a neutral stance with the Kremlin while India continues to do business with Russia, including supplying weapons.",
    "The Hill: Legal and ethics experts say a decades-old law, the Hatch Act, that bars federal officials from most electioneering provides an opening to prosecution of Trump for his role in attempts to overturn the 2020 election.",
    "In the age category of 5- to 11-year-olds, fewer than 30 percent of children have been fully vaccinated in the U.S. and about 36 percent have received one dose, according to the Centers for Disease Control and Prevention.",
    "SUPREME COURT\nJustices on Monday declined to take up a case brought by several former national security officials arguing the governments prepublication review prerequisites for books violate their First Amendment rights.",
    "The Russian brutal and unprovoked war against Ukraine has triggered a humanitarian catastrophe and innocent civilians have been killed in the streets and millions of refugees are internally displaced as well as in exile.",
    "Spooked by President Bidens low approval ratings, moderates are arguing that nominating a progressive will only make the climb more arduous for the party to hold seats in what is expected to be a tough midterm cycle.",
    "The United States has praised Japan, Singapore and South Korea, among other Asian partners, for their willingness to sanction Russia and impose export bans while offering humanitarian and military assistance to Kyiv.",
    "We do not know where they will stop, Zelensky said of the Russians, adding that the atrocities committed in Bucha and Mariupol are making it more and more difficult to meet with Russian President Vladimir Putin.",
    "Students and teachers on Monday were required to wear masks in schools after the citys school district returned to an indoor mask mandate amid a rise in newly reported COVID-19 cases (The Wall Street Journal).",
    "The court upheld a 4th Circuit Court of Appeals decision, which sided with the government to maintain its right to review the manuscripts by former officials once they departed the intelligence community.",
    "THE CLOSER\n Associated Press / Katie Vasquez | Planned auction today of a dress worn by Judy Garland in The Wizard of Oz, to benefit Catholic University, is on hold in court as ownership gets sorted out.",
    "Trumps night could get exponentially worse in Alabama, where Rep. Mo Brooks (R) may rise from the ashes of the 45th presidents decision to withdraw his endorsement and make it into a runoff next month.",
    "However, opponents of the requirement on Saturday filed a petition asking that the decision be vacated and that the full 17-member appeals court hear new arguments in the case (The Associated Press).",
    "Putting a cherry on the sundae for the sitting governor, former Vice President Mike Pence made an election eve stop on his behalf in suburban Atlanta, saying that he backed Kemp before it was cool.",
    "The case was brought on behalf of five former national security officials, who said they waited months for their books to be reviewed, only to be told they had to redact major portions (The Hill).",
    "Health officials say most of the known cases in Europe have been among men who have sex with men, but anyone can be infected through close contact with a sick person, their clothing or bedsheets.",
    "Across the aisle, Texas is the site of a proxy war between centrists and progressives as Rep. Henry Cuellar (D) seeks to stave off a challenge from Jessica Cisneros for the second cycle in a row.",
    "The president later clarified that nothing had changed about U.S. policy toward Taiwan despite shock waves in Washington and China as the White House worked to clarify what the president meant.",
    "Morning Report\nFormer President Trumps power within the Republican Party will get its latest examination tonight as voters head to the polls in four states, including Georgia, where Gov.",
    "Reid Wilson, The Hill: Abortion providers in blue states are preparing for a massive influx of patients if and when the Supreme Court finalizes its decision overturning Roe v. Wade.",
    "Rebecca Beitsch, The Hill: House Republicans threaten to release Jan. 5 footage taken by Capitol Policy the day before the attack on the Capitol  but obtaining it will cost them.",
    "At this hour, he has completed his second in-person Quad summit at the Kantei Palace, greeted U.S. Embassy staff, and departed for Washington (with a fueling stopover in Alaska).",
    "A Kemp win shows candidates theres more to winning than relying solely on Trumps endorsement or microphone, one GOP strategist involved in the midterms told the Morning Report.",
    "Members of the Ethics panel are also looking closely at Reps. Ronny Jackson (R-Texas) for alleged campaign finance violations and Alex Mooney (R-W.Va.) (The New York Times).",
    "Who owns Judy Garlands The Wizard of Oz dress, which was to be auctioned today to benefit Catholic University but is instead the subject of litigation in a New York court?",
    "Two polls released in the closing days show Kemp leading by 30 and 14 points, respectively, with each putting him above the 50 percent bar to avoid a runoff next month.",
    "CNN: During the Quad summit in Tokyo, Bidens comments to reporters on Monday about a U.S. commitment to defend Taiwan militarily became an explicit warning to Beijing.",
    "On Monday, a U.S. district judge halted the universitys much-publicized plans today to auction a dress worn by Garland in her role as Dorothy in the 1939 movie.",
    "Mooney allegedly enlisted staff to plan a trip to Aruba on official time, using federal resources and dollars, according to the Office of Congressional Ethics.",
    "Sen. Jeff Merkley (D-Ore.), who said he is vaccinated and boosted, announced on Twitter on Monday that he has a confirmed case of COVID-19 with mild symptoms.",
    "Related Articles\n Reuters: Newly elected Australian Prime Minister Anthony Albanese met in Tokyo with Biden and recalled a colorful first trip to the U.S.",
    "The temporary injunction will provide time to figure out whether the university or a niece of the universitys former drama department director, the Rev.",
    "A top supporter of Trumps claims of election fraud in the 2020 election, Brooks has also received air support from the Club for Growth, with Sens.",
    "Last year, Biden ordered that all federal employees be vaccinated against COVID-19 and a federal appeals court eventually supported that mandate.",
    "How did monkeypox, a treatable infection, spread to at least 12 countries with at least 131 confirmed cases outside of Africa as of this morning?",
    "They report at least 80 percent effectiveness of the vaccine for the youngest children, who have to date not been eligible for doses (Politico).",
    "She will do the same at 3:15 p.m. with Deborah Lipstadt to be U.S. special envoy to monitor and combat antisemitism with the rank of ambassador.",
    "Through her attorney, Hartkes niece argues her uncle, not the university, was the original owner and that she, as his heir, owns the costume.",
    "The Senate convenes at 10 a.m. and will resume consideration of Stephanie Davis to be a circuit judge for the 6th Circuit Court of Appeals.",
    "Scientists say it will be difficult to determine whether the spread is being driven by sex or merely close contact (The Associated Press).",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University (trackers all vary slightly): 1,002,377.",
    "The judges order prevents the gingham frock, estimated to fetch more than $1 million, from being sold until the case is resolved (WTOP).",
    "What threats do antibiotic-resistant superbugs pose for the future, and how has COVID-19 informed our approach to pandemic preparedness?",
    "According to the latest poll, Britt and Brooks are slight favorites to emerge to next months runoff, with Durant trailing close behind.",
    "Vice President Harris will ceremonially swear in Alina Romanowski to be U.S. ambassador to Iraq at 2:50 p.m. in her ceremonial office.",
    "A resounding Kemp win would serve as a 100 mph brushback pitch in the direction of Trumps ability to swing elections single-handedly.",
    "The Associated Press: Seven years later, still no trial for Texas Attorney General Ken Paxton (R), who faces George P. Bush tonight.",
    "Primary voters are more sophisticated than pundits give them credit for; the substance a candidate offers matters to them most.",
    "Members are looking into the promotion of cryptocurrency by Rep. Madison Cawthorn (N.C.), who recently lost his GOP primary.",
    "Hill.TVs Rising program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "A focus on fighting todays war on inflation, illegal immigration, and crime goes much further than fighting the last war.",
    "He encouraged Americans ahead of the Memorial Day weekend to take steps to make sure the virus is not an uninvited guest.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "https://bit.ly/3LH12Md\n Putin rules Russia like an asylum, by Farida Rustamova, opinion contributor, The New York Times.",
    "Likely because of sexual activity at recent raves in Spain and Belgium, according to the World Health Organization.",
    "Current average U.S. COVID-19 daily deaths are 281, according to the Centers for Disease Control and Prevention.",
    "Emily Brooks, The Hill: Rep. Marjorie Taylor Greenes (R-Ga.) popularity faces test in first reelection primary.",
    "Treasury Secretary Janet Yellen today will swear in Joshua Frost as assistant secretary for financial markets.",
    "Trump recruited David Perdue (R-Ga.), a former senator and once a supporter of the governor, to primary Kemp.",
    "The Wall Street Journal: The smallpox vaccine has entered wider production amid the outbreak of monkeypox.",
    "Hartke received the dress as a gift from actress and Garland friend Mercedes McCambridge in the 1970s.",
    "ET\nAntibiotic-resistant pathogens result in millions of infections and thousands of deaths every year.",
    "Dawn OConnell and more join The Hill to discuss tackling the growing threat of antibiotic resistance.",
    "This is really the moment when it is decided whether brute force will rule the world, Zelensky said.",
    "Related Articles\n The Associated Press: Trumps bid to reshape GOP faces biggest hurdles in Georgia.",
    "The Hill: David McCormicks campaign files lawsuit to count mail-in ballots with undated envelopes.",
    "The Washington Post: European oil embargo breakthrough may come within days, German minister says.",
    "The Wall Street Journal: Russian oligarch Roman Abramovichs offshore wealth is focus of new probe.",
    "The Wall Street Journal: Ukraines forces sink Russian river crossings, inflicting heavy damage.",
    "The Atlanta Journal-Constitution: Georgia governors race sharpens rivalry between Trump, Pence.",
    "The New York Times: Perdue makes racist remarks about Abrams as he ends a lackluster campaign.",
    "There was no immediate claim of responsibility for the daylight attack (Reuters and Politico).",
    "Politico: Secretary of State Antony Blinken on Thursday to unveil U.S. strategy toward China.",
    "The New York Times: Internal debate about tariffs reveals Bidens difficulties on China trade.",
    "To date, 90 percent of children hospitalized with COVID-19 in this country were unvaccinated.",
    "Not this time, by Mark J. Rozell and Mitchel A. Sollenberger, opinion contributors, The Hill.",
    "Virtual Event Invite\nAntibiotic Resistance: A Looming Public Health Crisis  Today at 1 p.m.",
    "Brian Kemp (R) is on the verge of handing the ex-president his biggest loss of 2022 so far.",
    "The cases of suspected transmission are in men and related to travel, according to the CDC.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "The Washington Post: Forsaken by Trump, Brooks finds a second wind in Alabama senate race.",
    "https://nyti.ms/38DiR1r\nWHERE AND WHEN\nThe House meets at 10 a.m. for a pro forma session.",
    "Kay Ivey (R) looks to fend off primary challengers as she defends her COVID-19 policies.",
    "Masks are back in schools in Philadelphia because COVID-19 infections are on the rise.",
    "For centrists, anxiety is on the rise over the possibility of losing swing districts.",
    "There had been a loose deadline of Memorial Day, reports The Hills Alexander Bolton.",
    "Ted Cruz (R-Texas) and Rand Paul (R-Ky.) appearing on his behalf in the final days.",
    "The New York Times: Pence, tiptoeing away from Trump, lays groundwork for 2024 run.",
    "The Associated Press: Australias new prime minister makes a whirlwind world debut.",
    "Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    "Since the 2020 election, few on the right have drawn Trumps ire like Kemp.",
    "Reuters: Russia launches assault to encircle Ukraine troops in east.",
    "Sen. Michael Bennet (D-Colo.), Rep. Drew Ferguson (R-Ga.), HHS Asst.",
    "And finally  We have a follow-up to some news we flagged last month.",
    "Foreign Policy analysis: Is Biden missing a chance to engage China?",
    "The Hill: Five things to watch in the Georgia, Alabama primaries.",
    "If so, there is no need for further meetings in Davos (CNBC).",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The world has to deal with it and we are, Biden admonished.",
    "The president on Tuesday wrapped up his itinerary in Tokyo.",
    "Were navigating a dark hour in our shared history, he said.",
    "The Hill: Here are the signs and symptoms of monkeypox.",
    "The incumbent, however, is projected to win handily.",
    "Risk of additional transmission is considered high.",
    "The Economist: Foreign investors are fleeing China.",
    "I stated that when I made my statement, Biden said.",
    "Five things to watch during Texas primary runoffs.",
    "Click here to subscribe to our latest newsletter.",
    "The Associated Press: Sen. John Boozman (R-Ark.)",
    "OPINION\n Executive privilege for ex-presidents?",
    "That holiday target will come and go in limbo.",
    "The House Ethics Committee is rarely idle.",
    "Also, check out the Rising podcast here.",
    "Gilbert Hartke, owns the cinematic garb.",
    "Email: Alexis Simendinger and Al Weaver.",
    "The Texas Tribune: End of the Bush era?",
    "Stay Engaged\nWe want to hear from you!",
    "The Wall Street Journal: Alabama Gov.",
    "fending off rivals in GOP primary.",
    "He returns to Washington tonight.",
    "Modi made no mention of Ukraine.",
    "Democratic men in trouble?",
    "RSVP now.",
    "Sec.",
    "ET."
  ]
}