{
  "id": 7299,
  "mediaId": 238,
  "date": "d2022-05-24T00:04",
  "headline": "Trump and Pence take separate sides in Georgias gubernatorial primary",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/23/trump-pence-kemp-purdue-georgia-primary/",
  "sentiment": "-0.89",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mariana Alfaro",
  "authorUrl": "https://www.washingtonpost.com/people/mariana-alfaro/",
  "termIds": [
    815,
    1147,
    1434,
    1951,
    2095,
    2303,
    4325,
    5543,
    428,
    2672
  ],
  "sentences": [
    "In Georgia, the Republican Governors Association, which launched a remarkable bid to protect incumbents from Trump-backed challengers this primary season, poured about $5 million into the Kemp-Perdue race, according to a person familiar with the funding who spoke on the condition of anonymity to share private budget details.",
    "The countrys 45th president, Donald Trump, and his onetime governing partner, Mike Pence, held dueling events on Monday night for their favored candidates ahead of Georgias highly anticipated Republican gubernatorial primary, in what could presage a potential fight over the future of the Republican Party.",
    "Trumps political clout will also be tested in two other races: the Senate contest where ex-NFL star Herschel Walker is expected to win the GOP nod to face Sen. Raphael G. Warnock (D); and the secretary of state race between Brad Raffensperger and Trumps pick, Rep. Jody Hice (R).",
    "Perdues campaign has revolved around unsubstantiated allegations of 2020 electoral fraud, and he continued that on Monday during his final appearance, declining to promise that he would accept the results of Tuesdays election and attacking the news media.",
    "The former vice president appeared with the governor in an airport hangar in Kennesaw, where a black bus with Kemps logo rolled in through a large side door and country lyrics such as its harvest time blared as the men posed for photos with supporters.",
    "Surprisingly, Raffensperger has tried to court the former presidents base by raising some questions about the 2020 election that he refused to overturn without completely jettisoning his image as an official willing to stand up to Trump.",
    "Voters will also go to the polls to pick nominees in a Senate contest to replace retiring Sen. Richard C. Shelby (R-Ala.); and choose candidates in Texas runoffs for attorney general and in Democratic Rep. Henry Cuellars 28th District.",
    "While Trump infused more than $2.5 million into the campaign, Perdues team has struggled to raise money against an incumbent and popular governor  and observers say he has also struggled to land any political punches against Kemp.",
    "Meanwhile, Trump appeared at a tele-town hall with the man he recruited to oust Kemp, whom he blames for not working feverishly enough to overturn the 2020 presidential election results there: former senator David Perdue (R).",
    "In interviews with about a dozen voters at Monday nights Kemp rally, they all rejected Trumps criticisms of Kemp and said they had grown increasingly sour on the former president because of his moves in the state.",
    "The Georgia gubernatorial primary has become the latest test over the potency of 2020 election conspiracy theories in the GOP electorate, and may be a template for how Republicans can move past that election.",
    "Kemp instead boasted of his reopening of Georgia ahead of others during the coronavirus pandemic  against the guidance of federal officials  and some of his other moves, such as suspending the states gas tax.",
    "Neither man mentioned Perdue by name and instead focused their ire on likely Democratic gubernatorial nominee Stacey Abrams, in a sign the primary election was all but over, according to observers and polls.",
    "Fueled by anger at Kemp for not helping him overturn the election, Trump has insulted the governor for months, organized political opposition to him and held an earlier rally in Georgia on Perdues behalf.",
    "But Schrenks friends also appear to be supporting Kemp, who he described as an outstanding governor who opened up the state soon after covid hit, which he said turned out to be the right decision.",
    "That no one criticized Trump explicitly reflects that he still remains the most influential Republican in the country and holds significant sway over his partys base, political strategists said.",
    "If Perdue loses, his defeat will be the third one in a governors race for Trump so far in the primary season, including Charles Herbster in Nebraska and Janice McGeachin in Idaho.",
    "All of them voted for Trump and said he was a good president but he shouldnt be sticking his nose into this, Schrenk said, referring to the Georgia gubernatorial contest.",
    "If Kemp wins on Tuesday as expected, it would be a significant setback for Trump, who goaded a reluctant Perdue into competing against him, political observers say.",
    "When you say yes to Brian Kemp tomorrow youll send a deafening message across America that the Republican Party is the party of the future, Pence said to the crowd.",
    "Georgia political observers say Perdues campaign has largely gone dark, with few ads and few major appearances in the final days of the primary campaign.",
    "Barry Schrenk, a 79-year-old Atlanta resident, said hed recently had breakfast with six friends  all of whom were Republicans and voted for Trump.",
    "Like Kemp, he attracted a Trump-backed primary challenger because of his refusal to go along with Trumps wishes to overturn the election.",
    "Kemp canceled a fly-around of the state on Monday because of the weather, and his team expected about 500 people at Monday nights rally.",
    "Pence, meanwhile, has sometimes criticized Trumps comments about 2020, signaling privately that he may run in 2024, even against Trump.",
    "The two men have not spoken in almost a year, and Trump has criticized Pence for not doing more to overturn the 2020 election results.",
    "A recent Fox News Poll showed that hes garnering 60 percent of the vote, well over the 50 percent margin required to avoid a runoff.",
    "Daise said he had turned away from Trump because of the Jan. 6, 2021, U.S. Capitol riot and his efforts to overturn the election.",
    "And he covered it up ever since, he said, using his final moments of the campaign to continue repeating Trumps false claims.",
    "President Biden narrowly won Georgia in the 2020 election and Kemp refused to question those results and certified them.",
    "Kemp was his guy, he said, because of how hed handled the coronavirus and made the state open for business, he said.",
    "Brett Daise, a 22-year-old recent college graduate, said hed voted for Trump twice but felt differently now.",
    "The other major contest in the state is whether Raffensperger, the secretary of state, can keep his job.",
    "A coterie of GOP figures have descended on Georgia in recent days to back Kemp, including Arizona Gov.",
    "I had a great relationship with President Trump, Kemp said during a virtual news conference Monday.",
    "David is the only candidate who can beat Stacey Abrams, because I dont believe Kemp can do it.",
    "Dramatically breaking with his former boss, Pence held an ebullient rally with Georgia Gov.",
    "Trump also backed Rep. Madison Cawthorn (R), who lost his North Carolina primary last week.",
    "He is being challenged by Hice, who embraced Trumps false claims about the 2020 election.",
    "The split-screen symbolism was stark between a once-obsequious vice president and Trump.",
    "Perdue, for his part, said Abrams was demeaning her own race and should leave Georgia.",
    "Hes got too many people in the Republican Party that will refuse to vote, Trump said.",
    "Pence praised much of the Trump administrations agenda, and even Kemp praised Trump.",
    "Everyone at the table said they were voting for anybody now who Trump didnt support.",
    "But if Trump was that much of a driving force, Perdue wouldnt be down by 30 points.",
    "Pence briefly mentioned the 2020 election but largely concentrated on other topics.",
    "Hes divided this state, Perdue said of Kemp during a brief news conference Monday.",
    "And the governor doesnt have the authority to overturn the election, she said.",
    "Schrenk described Trump as an excellent president, sans his Twitter account.",
    "Brian Kemp (R) on the eve of an election the governor is expected to win.",
    "Kemp has repeatedly declined to say anything negative about Trump.",
    "But his criticism of Kemp had been horribly unfair, Schrenk said.",
    "She said that Georgia is the worst place in the country to live.",
    "Pete Ricketts and former New Jersey governor Chris Christie.",
    "When he started criticizing Kemp, I was not down with that.",
    "Trump is a driving force behind some things, Daise said.",
    "None of his friends, he said, were voting for Perdue.",
    "Trump  cant blame himself for losing the election.",
    "He did everything he could, Schrenk said of Kemp.",
    "He again attacked Kemp over the 2020 election.",
    "It would be enough to lose anyone, he said.",
    "He allowed fraud to happen in our election.",
    "And thats something that I cant control.",
    "Let her go back to where she came from.",
    "Ive never said anything bad about him.",
    "And then he was criticizing my state.",
    "She doesnt like it here, Perdue said.",
    "He had to follow the Constitution.",
    "I have lost a lot of love for him.",
    "Hes looking for someone to blame.",
    "I think hes just mad at me.",
    "I dont plan on doing that.",
    "But he lost the election.",
    "Doug Ducey, Nebraska Gov.",
    "Hey, she aint from here.",
    "He denied it happened.",
    "I didnt like that.",
    "Im not mad at him."
  ]
}