{
  "id": 7310,
  "mediaId": 136,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Donald Trump and Joe Biden Will Both Be Big Losers from Georgia Primary",
  "image": "",
  "link": "https://www.newsweek.com/donald-trump-joe-biden-will-both-big-losers-georgia-primary-brian-kemp-1709407",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    2095
  ],
  "sentences": [
    "Recent polling about hypothetical match ups between Abrams and the Republican candidates has been relatively limited, but a WXIA-TV survey conducted from April 22 to 27 showed Perdue defeating Abrams by 49 percent to 46 percent, while Kemp had a lead of 50 percent to 45 percent over Abrams.",
    "However, Kemp's defense of Georgia's elections and former President Trump's attempts to replace him could work to the governor's advantage, especially among more moderate voters who are dissatisfied with the Biden administration's handling of issues like inflation.",
    "Abrams is standing unopposed in the Democratic gubernatorial primary and will face either Kemp or Perdue, but Democrats might have been hoping that Trump's endorsement was enough to get the former senator over the line.",
    "Kemp has also been endorsed by former Vice President Mike Pence, who has clashed with Trump over attempts to overturn the 2020 election and may be laying the groundwork for his own presidential run in 2024.",
    "President Joe Biden and former President Donald Trump could both emerge as losers following the Republican gubernatorial primary in Georgia on Tuesday, with the incumbent poised to win.",
    "That would represent a defeat for Trump, who endorsed Perdue and has been publicly critical of Kemp for not doing enough to overturn the results of the 2020 presidential election.",
    "Perdue's close association with Trump and his unfounded claims that the 2020 presidential election was \"stolen\" would have been obvious avenues of attack for the Abrams' campaign.",
    "Perdue has made false claims about election fraud and other irregularities a major part of his campaignechoing unfounded claims Trump has been making for more than a year.",
    "In an ad released in April, Perdue accused Kemp of allowing the election to be stolen and appeared to blame him for the condition of the country since Biden took office.",
    "She defended that position in December 2021, telling CNN that Kemp \"won under the rules of the game at the time, but the game was rigged against the voters of Georgia.\"",
    "A Kemp victory could also be seen as a blow to President Biden and the Democrats, who will be hoping that Democratic candidate Stacey Abrams can triumph in November.",
    "Not only did Georgians narrowly vote for Biden, but two Democrats were elected to the Senate in January 2021, ousting two Republican incumbentsincluding Perdue.",
    "An InsiderAdvantage/FOX 5 Atlanta poll published on Sunday showed Kemp with 52 percent support among Republican primary voters compared to Perdue's 38 percent.",
    "It's not clear if Kemp will win outright in Tuesday's primary but the governor appears on track to ultimately take the Republican nomination.",
    "A traditionally red state, Georgia voted narrowly for Biden in 2020 and Kemp has strongly defended the integrity of the state's election.",
    "Abrams was defeated by Kemp in the 2018 gubernatorial election when the Republican won 50.2 percent of the vote to Abrams' 48.8 percent.",
    "\"Folks, that all started right here when Brian Kemp sold us out and allowed radicals to steal the election,\" the former president said.",
    "If Kemp wins the Republican nomination, he will be set for a rematch of the 2018 race against Abrams.",
    "That poll surveyed 1,278 likely general election voters and had a margin of error of +/- 3.4 percent.",
    "The Fox 5 poll surveyed 750 likely Republican voters and has a margin of error of +/- 3.6 percent.",
    "Republican Governor Brian Kemp has maintained a strong lead over his GOP challenger, former U.S.",
    "She refused to concede the race, citing allegations of voter suppression in the state.",
    "The governor will need to win 50 percent of the vote on Tuesday to avoid a runoff.",
    "Newsweek has asked Donald Trump's office and the White House for comment.",
    "Senator David Perdue, who has been endorsed by former President Trump.",
    "Democrats recorded upset wins in Georgia in 2020 and 2021."
  ]
}