{
  "id": 7312,
  "mediaId": 65,
  "date": "d2022-05-24T06:00",
  "headline": "Georgia voters condemn Stacey Abrams worst state comments, share top priorities ahead of primary election",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/199243e3-c18e-4ed4-b95c-b08d1d55cea8/6c4a0202-b51d-453b-b0a0-d855a9fcbd96/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-voters-condemn-stacey-abrams-worst-state-share-top-primary-election-priorities",
  "sentiment": "-0.166",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Leach",
  "authorUrl": "https://www.foxnews.com/person/l/matt-leach",
  "termIds": [
    1951,
    2095,
    2213,
    5539,
    2555,
    2672,
    2752,
    5551
  ],
  "sentences": [
    "KEMP JUMPS ON STACEY ABRAMS' COMMENTS THAT GEORGIA IS WORST STATE IN THE COUNTRY\nAbrams acknowledged such a statement would be \"politicized\" and further explained that mental health and incarceration rates in her state could be improved significantly.",
    "During a speech at the Gwinnett County Democrats Bluetopia Gala, Abrams said, \"Im running for governor because I know that we have to have a conversation about who we are in this state and what we want for each other and from each other.\"",
    "\"I am tired of hearing about how were the best state in the country to do business when we are the worst state in the country to live,\" she said, according to tape published by the Gwinnett Daily Post.",
    "LAWRENCEVILLE, Ga.  Stacey Abrams comments that Georgia is the \"worst state in the country to live\" did not sit well with voters who spoke with Fox News ahead of Tuesday's primary election.",
    "\"At the end of the day, were looking for candidates that support our pro-life values, our values of having a good economy that everybodythat young people can thrive under,\" Chandra said.",
    "GEORGE SOROS THROWS $1M BEHIND STACEY ABRAMS' SECOND GUBERNATORIAL RUN\nNancy, from Lawrenceville, said the economy is her top priority heading into the polls Tuesday.",
    "Abrams, who is running unopposed for the Democratic nomination for governor of the Peach State, lost a close race to Republican Brian Kemp in 2018.",
    "Kemp holds a 22-point lead against Perdue, who was endorsed by former President Trump, according to the latest Real Clear Politics average.",
    "\"Im a Trump guy, but Im not going to vote for [former Sen. David] Perdue because I dont think hes as competent as Kemp,\" Bob said.",
    "(Sean Rayford/Getty Images)\n\"I like that its a lot of Black people supporting Black people,\" Brittany said.",
    "\"I think Kemp has proven that hes more competent as far as business goes, especially here in Georgia.\"",
    "\"Do you care about safety and your kids or do you care about stuff thats not none of your business?\"",
    "Brittany, who recently moved to Atlanta from Chicago, also disagreed with Abrams' assessment.",
    "You get more jobs, you get better schools, you get a better tax base,\" Bob continued.",
    "(Slaven Vlasic/Getty Images)\nChandra said Abram's comments were \"absolute nonsense.\"",
    "Because she didnt win the last election, I guess,\" Larry, from Lawrenceville, said.",
    "She said Chicago \"is a lot more expensive and a lot more dangerous to live in.\"",
    "\"I think the guy's doing a great job, and I'm going to vote for him for sure.\"",
    "Bob from Gainesville, Georgia, said \"competence\" is important to him.",
    "Larry told Fox News: \"Immigrations one of the big ones.",
    "\"I wouldnt say its the worst place to live in.\"",
    "Isabelle McDonnell contributed to this report.",
    "\"Everything stems from having good business.",
    "Price of gas is a really big one.\"",
    "\"Why does she think its the worst?",
    "Brittany added."
  ]
}