{
  "id": 7314,
  "mediaId": 65,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Trump and Pence hold dueling rallies for Perdue and Kemp on eve of Georgias bitter GOP gubernatorial primary",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/999aad8f-0cb8-489c-9376-3bb1c96d1e81/c4127c33-8984-4dd6-b283-9d5667e55eda/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-pence-dueling-rallies-perdue-kemp-georgias-bitter-gop-primary",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "Pence, a loyal wing man for Trump during their four years in the White House, broke with his boss over the deadly Jan. 6, 2021, attack on the U.S. Capitol perpetrated by right wing extremists aiming to disrupt congressional certification of Bidens Electoral College victory, which the then-vice president oversaw.",
    "KEMP, PERDUE, MAKE FINAL PITCHES IN GEORGIA'S HEATED GOP GUBERNATORIAL SHOWDOWN\nAlthough he didnt mention his former boss, Pences comment on Monday evening was an unmistakable jab at Trump, who for nearly a year and a half has repeatedly re-litigated his 2020 election loss to now-President Biden.",
    "KEMP JUMPS ALL OVER ABRAMS' EYE CATCHING COMMENTS ABOUT GEORGIA\nBut Trumps support doesnt appear to have boosted Perdue, with the final polls in the race indicating Kemp with large double-digit leads over his challenger and likely to clear the 50% threshold needed to avoid a runoff next month.",
    "Pence, who was the Republican governor of Indiana before Trump named him as his running mate in the 2016 presidential election, pushed back against the former presidents continuous claims that Trump supporters wont back Kemp in November if he wins the GOP nomination.",
    "The former president repeated his unproven claims that 2020 election was \"rigged and stolen\" and once again blamed Kemp and Georgia Republican Secretary of State Brad Raffensperger for failing to overturn Bidens razor-thin victory over Trump in the state.",
    "Sixteen months removed from the White House, Trump remains the most popular and influential politician in the GOP as he continues to play a kingmakers role in party, endorsing scores of candidates up and down the ballot in the 2022 midterms.",
    "COBB COUNTY, GA  Neither former President Donald Trump nor former Vice President Mike Pence are on the ballot in Georgia, but both were front-and-center in a combustible Republican Party feud on the eve of the Peach States primary.",
    "Trump returned to Georgia in late March to rally with Perdue, held a previous tele-rally for Perdue at the beginning of this month and starred in Perdues campaign commercials that ran on Georgia airwaves for much of this year.",
    "WHAT THE LATEST FOX NEWS POLL IN GEORGIA SHOWS\nMinutes earlier in Cobb County, Pence predicted an \"historic Republican victory six months from now when we will win back the House, win back the Senate, and re-elect Gov.",
    "Earlier on Monday, however, Trump spokesman Taylor Budowich tore into Pence, claiming that \"Mike Pence was set to lose a governors race in 2016 before he was plucked up and his political career was salvaged.\"",
    "As Pence and Kemp were shaking hands and taking selfies with supporters, Trump was the main attraction at a tele-rally for former Sen. David Perdue, who with Trumps backing is challenging Kemp in the primary.",
    "(Fox News )\n\"Tomorrows primary election comes down to this  who is best positioned to defeat Stacey Abrams and the national Democrats that will descend on Georgia in this falls election,\" Kemp emphasized.",
    "Brian Kemp, urged the governors supporters at an airport hangar in the northwest suburbs of Atlanta to \"send a deafening message all across America that the Republican Party is the part of the future.\"",
    "Perdue jumped into the race days after Abrams, a rising star in the Democratic Party and a nationally known champion of voter rights, launched her second straight gubernatorial bid.",
    "New financial disclosure forms show that the former president's main political action committee in April contributed over $2.5 million to an outside group backing Perdue.",
    "WHY TRUMP'S FULL-COURT PRESS HASN'T HELPED BOOST PERDUE AGAINST KEMP\nFour years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams.",
    "Trump on primary eve lit into Kemp, charging that \"we have a governor that's done the worst job of any governor in probably decades on election integrity.\"",
    "In the ensuing months, Pence  while defending the achievements of the Trump-Pence administration  has increasingly distanced himself from his former boss.",
    "He also repeatedly urged Perdue to primary challenge the governor and endorsed Perdue the day after the former senator announced his bid in December.",
    "Budowich further argued that \"now, desperate to chase his lost relevance, Pence is parachuting into races, hoping someone is paying attention.\"",
    "He also argued that \"Kemp is truly a embarrassment to the Republican Party because of what's taken place in your great state, Georgia.",
    "In a line that seemed to be directed at Trump, Pence stressed that \"there are those who want to make this election about the past.\"",
    "But Kemp earned Trumps ire after certifying the 2020 presidential election results in Georgia, following two recounts of the vote.",
    "Brian Kemp tomorrow, you will send a deafening message all across America that the Republican Party is the party of the future.\"",
    "Pence didnt mention Trump and the former president didnt utter his former vice presidents name at their dueling rallies.",
    "\"Brian Kemp beat Stacey Abrams four years ago and with your help, Brian Kemp will do it all again in November.\"",
    "Trump also repeatedly flirts with making another presidential run in 2024.",
    "Trump traveled to Georgia last autumn to campaign against Kemp.",
    "And David will make a massive upgrade as your governor.\"",
    "Fox News' Jake Karalexis contributed to this report",
    "He added that \"when you say yes to Gov.",
    "\"I am here to support Brian Kemp.\"",
    "Pence, headlining a rally for Gov.",
    "Brian Kemp for four more years."
  ]
}