{
  "id": 7329,
  "mediaId": 33,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220522145713-01-kemp-campaign.jpg?c=16x9&q=h_144,w_256,c_fill",
  "link": "https://www.cnn.com/2022/05/23/politics/trump-republican-party-georgia-election/index.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Bradner",
  "authorUrl": "https://www.cnn.com/profiles/eric-bradner",
  "termIds": [
    815,
    2095,
    2303,
    3102,
    3103
  ],
  "sentences": [
    "We wouldn't be in this mess, in my opinion, as far as our senators and representatives, had he done one thing: If he had stayed off his Twitter for three days out of the seven  just stayed off  then he wouldn't have alienated his own supporters because of the things that he was saying, and we wouldn't be looking for 11,000 votes, said Eddie Drinkard, a land real estate broker in Oconee County, referencing President Joe Biden's 2020 margin of victory.",
    "And his falsehoods about election fraud have paved the way for restrictive new voting laws in states such as Georgia, Florida, Texas and Iowa, and have led to the party nominating candidates such as state Sen. Doug Mastriano, an election denier, for Pennsylvania governor, positioning them to potentially take over the election machinery of key swing states if they win in November.",
    "An election about more than 2020\nIn some ways, Kemp's actions more closely mirror the opinions of today's GOP electorate: In April 2020, he was quick to reopen the state during the Covid-19 pandemic  a position widely assailed at the time by public health experts and even by Trump, who said, I think it's too soon.",
    "Georgia could offer the clearest indication yet of the limits of Trump's influence during a stretch of primaries that has underscored the extent to which he remains the center of the Republican Party as most GOP candidates, even those who don't receive his backing, profess their loyalty to him.",
    "He is also backing Rep. Jody Hice in his bid to oust Republican Secretary of State Brad Raffensperger, who became a national figure after Trump's phone call in early January 2021 urging him to find enough votes to reverse Georgia's results and deliver its 16 electoral college votes to Trump.",
    "Though he rejected Trump's lies about election fraud, he also signed into law a restrictive new voting measure passed by Georgia's legislature last year that imposes new restrictions on mail-in ballots, bans offering food and water to people waiting in line to vote and more.",
    "Brian Kemp, the Republican whom Trump has targeted over his refusal to embrace the lie that widespread fraud cost the former President the 2020 election, is expected to easily fend off a challenge from Trump-backed former Sen. David Perdue.",
    "The problem for Trump  and for the candidates he is backing here  is that in the lead-up to Tuesday's primary, Georgia Republicans have largely not seemed interested in fighting the former President's backward-looking battles.",
    "Flawed candidates, such as the scandal-plagued North Carolina Rep. Madison Cawthorn and Nebraska gubernatorial candidate Charles Herbster, who faced allegations of sexual misconduct, have lost despite Trump's support.",
    "Some Republican voters say they would rather stick with the governor who won that close 2018 election than follow a former President who they view as at least partly responsible for the party's 2020 losses in Georgia.",
    "In Pennsylvania's Senate primary, the Trump-backed celebrity heart surgeon Mehmet Oz is in a razor-tight race with former hedge fund executive David McCormick, with ballots still being counted and a recount possible.",
    "At his campaign stops, Kemp has leaned into an argument that he's the strongest alternative to Abrams, and one whom Republican voters will rally around once the race is narrowed to a head-to-head choice.",
    "Democratic Sen. Raphael Warnock is facing election for a full six-year term and likely to face the Trump-backed former football star Herschel Walker, who is favored to win Tuesday's Republican primary.",
    "And in West Virginia, his support lifted Rep. Alex Mooney in a race against Rep. David McKinley as the two faced off for a single congressional seat after the state lost one following the 2020 Census.",
    "You're going to have a lot of very strong Trump supporters who are going to vote for Brian Kemp, said Martha Zoller, a talk radio host in Georgia who previously worked for both Perdue and Kemp.",
    "Kemp has positioned himself for a win Tuesday by carefully avoiding any criticism of Trump on policy matters, and making sure not to say anything that would enrage Trump loyalists.",
    "Zoller said when Perdue was considering running for governor, she advised him to find meaningful ways to differentiate himself as a candidate, beyond airing Trump's grievances.",
    "Kemp supporters argue that Trump's criticism of Kemp ignores the reality that the governor has implemented conservative policies despite the state's shift leftward.",
    "His endorsement has proven decisive in some GOP primaries, such as Ohio's Senate race, where a late Trump endorsement catapulted venture capitalist and author J.D.",
    "Sarah Palin, the former Alaska governor and 2008 Republican vice presidential nominee who is now running for Congress, joined Perdue on the campaign trail Friday.",
    "Meanwhile, Kemp used the power of his office to punish opponents through the redistricting process, and his allies' push for Perdue's cousin, former Georgia Gov.",
    "Atlanta CNN \nRepublican voters in Georgia's primary on Tuesday could move the party  at least temporarily  out from under former President Donald Trump's shadow.",
    "In the governor's race, Democrats will nominate Stacey Abrams, who's running unopposed, for a second consecutive time after her narrow loss to Kemp in 2018.",
    "A Kemp victory would showcase the limits of Trump's influence in a state that will be home to some of the 2022 midterm election's most important contests.",
    "And the steady stream of governors hitting the trail with Kemp  plus former Vice President Mike Pence  suggests some in the national GOP aren't either.",
    "Some pointed to Trump's constant criticism of mail-in ballots, arguing that he hurt his own chances and depressed Republican turnout in Senate runoffs.",
    "I wish he'd stay out of our elections, Chuck Horton, a retired police officer and Oconee County commissioner, said after a Kemp rally Saturday.",
    "He's been joined on the campaign trail by a raft of Republican governors, including Arizona's Doug Ducey, Ricketts and former New Jersey Gov.",
    "Sonny Perdue, to lead the state's higher education system has fractured and sidelined parts of the Perdue family's political infrastructure.",
    "Kemp and his supporters have spent more than $12 million on television ads headed into Tuesday's primaries, nearly doubling Perdue's side.",
    "I think that Senator Perdue, at his core, ran more because he was angry about losing in 2020 than about what he could do as governor.",
    "Peach State power struggle\nGeorgia has emerged in recent years as one of the nation's most important political battlegrounds.",
    "Those comments are about himself, actually, not about the governor, said Carol Williams, who works in real estate in Athens.",
    "Perdue, meanwhile, has built his entire campaign around the lie that Republicans' 2020 losses were a result of fraud.",
    "I don't know why he was so hesitant, why, you know, he kind of just went along to go along, and that's unfortunate.",
    "Trump helped recruit and clear the field for Perdue, the former senator who lost in one of those runoffs last year.",
    "It's also ground zero in Trump's vendetta against Republicans who did not support his lies about election fraud.",
    "I think every Republican in Georgia will be unified after Tuesday, Kemp told reporters Saturday afternoon.",
    "Pete Ricketts proved more consequential than Trump's, with Ricketts' candidate winning earlier this month.",
    "Democrats' two victories in Senate runoffs here in January 2021 gave the party full control of Congress.",
    "Kemp had the opportunity to do something about the shenanigans that had gone on in this last election.",
    "That never happened, and Perdue enters Tuesday's primary outspent and trailing badly in the polls.",
    "And we can count on David Perdue to do the opposite of that, Palin said at a rally in Savannah.",
    "Demographic changes have turned what had long been a reliably red state into a competitive one.",
    "I'm not sure his heart was completely in it, said Zoller, the talk radio host.",
    "I don't think the election was stolen, and he's not supporting the right man.",
    "She said she told Perdue that it couldn't just be about the 2020 election.",
    "I think that the former President has no skin in the game in Georgia.",
    "But not all voters are interested in relitigating that election.",
    "Georgia is set for a series of competitive races in November.",
    "Pence will appear with Kemp at an election eve rally Monday.",
    "That law will be tested for the first time this year.",
    "He does not understand what's best for our state.",
    "His endorsements need to stay more so in Florida.",
    "But Trump has also racked up a series of losses.",
    "We've done the right thing here in this Covid.",
    "In Nebraska, the endorsement of outgoing Gov.",
    "But he didn't have sense enough to do that.",
    "I think Stacey Abrams is a great unifier.",
    "There's no option on the other side.",
    "I did vote for him in 2020.",
    "But I think he's wrong.",
    "We have stayed open.",
    "Vance to victory.",
    "Chris Christie.",
    "Gov."
  ]
}