{
  "id": 7331,
  "mediaId": 238,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Kemp, Raffensperger win in blow to Trump and his false election claims",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/24/trump-georgia-kemp-perdue/",
  "sentiment": "-0.458",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Weigel",
  "authorUrl": "https://www.washingtonpost.com/people/david-weigel/",
  "termIds": [
    727,
    815,
    1147,
    1459,
    2087,
    2095,
    2203,
    2376,
    3085,
    3094,
    3103,
    4325,
    2672
  ],
  "sentences": [
    "And while many Democrats have long railed against Trump's baseless rhetoric, some powerful Republicans saw the Georgia primary as a potential inflection point that could shift the party away from re-litigating the last election and blunt Trump's efforts to turn many primaries into score-settling affairs over 2020 and attempts to install loyalists pledging fealty in future elections.",
    "He has celebrated the retirements of House Republicans who voted to impeach him after the Jan. 6, 2021, insurrection at the U.S. Capitol by a pro-Trump mob, and will campaign this weekend in Wyoming for Harriet Hageman, a GOP activist who's challenging Rep. Liz Cheney, a vocal Trump critic.",
    "The primaries in Georgia on Tuesday were part of a larger array of intraparty contests in states including Alabama, Texas, Arkansas and Minnesota that strategists were watching for indicators of the direction Democrats and Republicans are headed in the run-up to the November midterms.",
    "Perdue said Abrams should go back where she came from if she doesn't like it here  a comment that echoes of when Trump said four Democratic congresswomen of color should go back and help fix the totally broken and crime-infested places from which they came.",
    "He had been one of Trump's most ardent supporters, who donned body armor and spoke at the Stop the Steal rally in Washington on Jan. 6, 2021, urging the crowd to fight before many of them did just that, overtaking the U.S. Capitol in a violent insurrection.",
    "The race between Kemp and Perdue, a former senator, unfolded over the past five months as the highest-profile test of Trump's pull in this year's primaries on behalf of candidates running heavily on his false claims that the election was stolen from him.",
    "As somebody who cares about the state of Alabama a lot, I know that Richard C. Shelby was very good at working the system in Washington and for me, Katie Britt was the candidate who would probably do the best job at kind of continuing that, he said.",
    "With most ballots counted, state Rep. Jeremy Munson was locked in a tight race with Brad Finstad, a former Trump administration appointee, for the GOP nod, while former Hormel CEO Jeff Ettinger easily won the Democratic nomination.",
    "Nicki, a 46-year-old business administrator with the Newton County Board of Education who declined to share her last name, said Trump's endorsements didn't sway her, a sentiment reflected in polling data in the state.",
    "In Alabama, a Republican primary for an open Senate seat pitted Rep. Mo Brooks, who had Trump's endorsement and then lost it, against Katie Britt, a former top aide to retiring Republican Sen. Richard C. Shelby.",
    "In Texas, state Attorney General Ken Paxton, an incumbent backed by Trump, beat state land commissioner George P. Bush, the grandson and nephew of two former presidents, in a closely watched Republican runoff.",
    "In Minnesota's southern tier, 10 Republicans and eight Democrats were competing for nominations to replace the late congressman Jim Hagedorn, a Republican who died in February after a battle with cancer.",
    "Outside a Baptist church in Atlanta on Tuesday, Abrams dismissed Perdue's racist comments, saying she has listened to Republicans attack me, but they've done nothing  to articulate a plan for Georgia.",
    "Georgia Republican primary voters on Tuesday rejected former president Donald Trump's attempt to unseat Republican officeholders who refused to join his fight to overturn the 2020 election, as Gov.",
    "McBath raised more money than Bourdeaux, who was one of the nine House Democrats who demanded that last year's bipartisan infrastructure bill be separated from the party's social spending package.",
    "In South Texas, a heated Democratic runoff pitting Rep. Henry Cuellar against immigration attorney Jessica Cisneros was the latest showdown between the centrist and liberal wings of the party.",
    "Down the ballot in Georgia, another statewide Republican contest was a measure of the intensity behind Trump's push to dislodge Republicans who bucked his calls to try to block Biden's win.",
    "Rep. Marjorie Taylor Greene, a far-right Republican from Georgia, prevailed over multiple primary opponents, with some Democrats in her conservative district crossing over to support them.",
    "Before that projection, Raffensperger sought to declare a come-from-behind victory, saying that he'd been standing for the truth and not buckling under pressure, and that voters saw that.",
    "But Mehmet Oz, his pick in Pennsylvania, is locked in an unresolved race against a more conventional candidate a week after the primary, which is probably headed to a recount.",
    "The governor didn't mention Trump by name but instead bragged about his record of reopening Georgia during the pandemic and attacked Democratic nominee Stacey Abrams.",
    "He has obsessively worked to defeat Republicans who did not work to overturn his 2020 election loss, endorsing and sometimes recruiting their primary challengers.",
    "Voters interviewed Tuesday morning at two polling places in Republican-leaning east Cobb County outside Atlanta expressed strong preference for Kemp over Perdue.",
    "Charles Stan Tommasello, 75, a retired Delta Air Lines pilot, said he initially supported Perdue when Trump first threw his support behind him but later wavered.",
    "Raffensperger, who rejected Trump's pressure to find enough votes to make him the winner, defeated Rep. Jody Hice, a candidate backed by the former president.",
    "Her remarks came just hours after a deadly mass shooting at a Texas elementary school that claimed the lives of at least 18 children and a teacher.",
    "Raffensperger was on pace to win more than 50 percent of the vote and avoid a runoff, the Associated Press projected early Wednesday morning.",
    "Ronda Harris, 48, attended McBath's election night watch party to show her support for a woman who, like her, is grieving the loss of a son.",
    "At first, I was concerned about the original count of the election and the way [Kemp] strongly supported Raffensperger, Tommasello said.",
    "In a competing tele-rally for Perdue on Monday, Trump sought to convince Georgia Republican voters that Kemp was unable to beat Abrams.",
    "The only way I think you can survive something so horrific is to find a way to champion for your loved one, and that's what I am doing.",
    "A new Republican-drawn congressional map turned McBath's seat safely Republican, so she ran in an adjacent district against Bourdeaux.",
    "In suburban Atlanta, Rep. Lucy McBath bested fellow Democratic Rep. Carolyn Bourdeaux in the year's second member vs. member contest.",
    "The former president also took to his Truth Social account Monday to bring up more disproved 2020 election conspiracy theories.",
    "Vance, an author and venture capitalist backed by the former president, won the Republican nomination for U.S. Senate in Ohio.",
    "Trump has faced stiffer head winds in gubernatorial races, where his endorsed candidates in Nebraska and Idaho recently lost.",
    "Georgia would be just one variant away from lockdowns, government mandates, schools shuttered and businesses closed, he said.",
    "Thomas LaPointe, 32, in Auburn, Ala., said he hoped that would be Britt, who previously worked as Shelby's chief of staff.",
    "Kemp will now turn his attention to Abrams, a former state House minority leader who was unopposed on the Democratic side.",
    "Trump notched an expected win in Georgia's Republican primary for U.S. Senate, where former NFL star Herschel Walker won.",
    "I'm here, so that's my responsibility to stand up and do what I can to prevent other people from having this experience.",
    "McBath first ran for Congress in 2018 as an activist against gun violence following the 2012 murder of her teenage son.",
    "Brian Kemp defeated challenger David Perdue in a landslide and Secretary of State Brad Raffensperger won re-nomination.",
    "Brooks fell out of favor with Trump after suggesting people not focus on re-litigating the 2020 presidential election.",
    "Cuellar, the only antiabortion Democrat in the House, clashed with Cisneros, who also ran to his left on immigration.",
    "On Monday, former vice president Mike Pence, in a direct rebuke of his former boss, campaigned for Kemp in Georgia.",
    "The winner of the GOP primary will be the likely successor of Shelby, in a state that leans heavily conservative.",
    "Doug Ducey hit the trail to vouch for Kemp in the final weeks of the race, urging the party to look beyond 2020.",
    "Late Tuesday night, Cisneros and Cuellar were in a tight race with an estimated 89 percent of the vote counted.",
    "I hope you made some dinner reservations, he joked to a small audience that had been expecting a longer night.",
    "She voted for Kemp and Raffensperger, commending Kemp for keeping businesses open during the pandemic.",
    "But much of the focus in both parties Tuesday was on the Republican gubernatorial primary in Georgia.",
    "Abrams, who lost to Kemp in 2018, is vying to become the first Black female governor in the country.",
    "I thought that Perdue ran a very lackluster [campaign] and didn't have the energy I expected of him.",
    "Even in the middle of a tough primary, conservatives across our state didn't listen to the noise.",
    "So far this year, Trump has had a mixed record in contested primaries where he made endorsements.",
    "Trump has railed against Kemp since the governor certified President Biden's win in the state.",
    "He was coming home from visiting his father, and we're really not quite sure what happened.",
    "Prominent GOP figures such as former New Jersey governor Chris Christie and Arizona Gov.",
    "Harris was wearing a red shirt that read, Moms Demand Action for Gun Sense in America.",
    "They didn't get distracted, Kemp said in remarks to supporters after Perdue conceded.",
    "He's got too many people in the Republican Party that will refuse to vote, he said.",
    "Trump unendorsed Brooks in March, but didn't throw his support behind anyone else.",
    "He personally recruited Perdue and actively promoted his candidacy against Kemp.",
    "All evidence has shown Biden's win in Georgia, and nationally, was legitimate.",
    "Perdue conceded to Kemp less than 90 minutes after polls closed in Georgia.",
    "The loss there by Perdue threatened Trump's reputation as GOP kingmaker.",
    "Tuesday's results in Georgia amounted to a significant blow to Trump.",
    "In neighboring Alabama, Trump and his allies were also a factor.",
    "The two candidates advanced to a runoff late Tuesday.",
    "Perdue also said Abrams was demeaning her own race.",
    "He will face Democratic Sen. Raphael G. Warnock.",
    "We're both survivors, Harris said of McBath.",
    "I lost my son in 2017 to gun violence.",
    "He's not here to fight for his rights.",
    "He's not here to fight for his life.",
    "It is still an unsolved case.",
    "He was murdered.",
    "J.D."
  ]
}