{
  "id": 7359,
  "mediaId": 151,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Raffensperger wins Georgia secretary of state primary over Trump-backed opponent",
  "image": "https://www.politico.com/dims4/default/0ded8d5/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Faf%2Fc1%2F057b948249098d3231c2899ee2b3%2Fap20322055500606.jpg",
  "link": "https://www.politico.com/news/2022/05/25/raffensperger-wins-georgia-secretary-of-state-primary-over-trump-backed-opponent-00035011",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "| Brynn Anderson, File/AP Photo\nBy Zach Montellaro\n 05/25/2022 01:05 AM EDT\nGeorgia Secretary of State Brad Raffensperger has defeated his GOP primary opponent, Rep. Jody Hice, in a major repudiation of former President Donald Trump by Georgia Republicans.",
    "Hice's campaign to leave a safe red seat in Congress to run for a down-ballot statewide office was an unusual one, but early last year many Republicans in the state thought that the race was a foregone conclusion and that Hice would win.",
    "Raffensperger is arguably the most famous election administrator in America following the 2020 election, where he rebuffed the then-president's call to find votes in his state to overturn Trump's narrow loss in the state.",
    "And in Arizona, Trump backed state Rep. Mark Finchem  who has called for the 2020 election to be decertified  for the open seat race there, although he faces other challengers for the nomination.",
    "The Georgia race is the first of a handful of battleground contests in which Trump endorsed a candidate for state election officer who has refused to accept the results of the 2020 election.",
    "Hice and other Trump-backed candidates have said that they wouldn't have certified the 2020 election, as Raffensperger did, and have spread conspiracy theories about Trump's loss.",
    "Back in Georgia, Hice led the objection to his own state's election results in Congress on Jan. 6, 2021, which came after a Trump-supporting mob had already stormed the Capitol.",
    "Trump-backed Kristina Karamo, who claimed to have witnessed fraud in 2020 in the state, is running in Michigan to challenge Democratic Secretary of State Jocelyn Benson.",
    "Former state Rep. Dee Dawkins-Haigler and former Cobb County Democratic Party Chair Michael Owens are battling it for the second spot in the likely runoff.",
    "Raffensperger led Hice 52 percent to 34 percent when the Associated Press called the primary, claiming the majority needed to avoid a runoff.",
    "The race in Georgia had been central to Trump and his supporters' bid to take over key positions that oversee elections across the country.",
    "In this Wednesday, Nov. 11, 2020, file photo, Georgia Secretary of State Brad Raffensperger speaks during a news conference in Atlanta.",
    "Hice launched his campaign to challenge Raffensperger in a primary in mid-March 2021, immediately getting Trump's support.",
    "But Raffensperger, who otherwise fits in with Republican Party orthodoxy on election administration, stuck with the race.",
    "State Rep. Bee Nguyen has a wide lead over the field, but is about seven points below the threshold to avoid a runoff.",
    "He took his case to conservative media, while continuing to assert that the 2020 election was secure in the state.",
    "The Democratic race has not yet been called, but it seems likely to be headed to a runoff.",
    "That earned Raffensperger a stream of attacks from Trump, who also went after Georgia Gov.",
    "The race in Georgia is expected to be competitive in the general election.",
    "But Georgia GOP voters renominated both men this week anyway.",
    "Democrats have named the state among their top targets.",
    "Brian Kemp for acting to certify the election results."
  ]
}