{
  "id": 7363,
  "mediaId": 195,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Raffensperger fends off Trump-backed primary challenge in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/11/ap_campaign_raffensperger_brad.jpg?w=980&h=653&crop=1",
  "link": "https://thehill.com/news/campaign/3499573-raffensperger-fends-off-trump-backed-primary-challenge-in-georgia/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    2095
  ],
  "sentences": [
    "On the Democratic side, five candidates are seeking the nomination to take on Raffensperger in November: state Rep. Bee Nguyen, state Sen. Floyd Griffin, former Fulton County Commission Chair John Eaves, former Cobb County Democratic Party Chair Michael Owens and former state Rep. Dee Dawkins-Haigler.",
    "Georgia Secretary of State Brad Raffensperger (R) is projected to survive an aggressive primary challenge on Tuesday, beating Rep. Jody Hice (R-Ga.), who had the endorsement of former President Trump, in his bid to keep his job as the state's top elections official.",
    "Hice, a staunch Trump ally, centered his campaign on the former president's false claim that the 2020 election was stolen and that officials like Raffensperger allowed mass voter fraud to go unchecked.",
    "At the same time he has drawn ire from across the aisle by going on offense over a new Georgia election law that Democrats have cast as a GOP effort to suppress voter turnout among people of color.",
    "Raffensperger emerged as a vocal critic of Trump's efforts to overturn his 2020 electoral loss in Georgia, drawing the former president's ire as well as a field of primary challengers.",
    "Raffensperger refused to do so, instantly becoming a symbol of Republican resistance to the former president's efforts to undermine the democratic process.",
    "In a January 2021 phone call, Trump suggested to Raffensperger that he could find enough votes to reverse President Biden's victory in Georgia.",
    "Raffensperger never gave into pressure from his primary rivals or Trump, forcefully defending his record as secretary of state.",
    "Raffensperger's victory on Tuesday is another blow for Trump and his reputation as a kingmaker among Republican candidates.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Brian Kemp (R) after he rebuffed his pleas to overturn the results of the 2020 presidential election in Georgia.",
    "Trump also endorsed former Sen. David Perdue's (R-Ga.) primary challenge to Kemp.",
    "In reality, there is no evidence that the election was tainted by fraud.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "ABC News and CNN both called the race around 12:20 a.m.",
    "Trump also targeted Gov.",
    "ET."
  ]
}