{
  "id": 7364,
  "mediaId": 136,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Trump Ignored Warnings That Dwelling on 2020 Fraud Could Cost Him Elections",
  "image": "https://d.newsweek.com/en/full/2044860/donald-trump-2020-election.webp?w=790&f=2ca8921c9ea0a118fecb37b7d35b5150",
  "link": "https://www.newsweek.com/trump-ignored-warnings-that-dwelling-2020-fraud-could-cost-him-elections-1709842",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Fung",
  "authorUrl": "https://www.newsweek.com/authors/katherine-fung",
  "termIds": [
    2095
  ],
  "sentences": [
    "A number of Republicans have urged former President Donald Trump to move past the 2020 presidential election to avoid isolating some voters and further dividing a base that has sought to figure out its party's futurebut Trump remained defiant in avenging himself and that determination has cost him one of the biggest losses in this midterm cycle yet.",
    "When pressed by Varney on Tuesday that the host was \"getting the sense that the voters just don't want to go back to a chaotic situation or a toxic situation\" but rather \"look forward to the future and be positive,\" Trump said it was important to continue harping on the 2020 election so that it wouldn't happen again.",
    "Speaking about the war in Ukraine, conservative lawyer George Conway told CNN: \"We're in the middle of this war where Putin, who can't be trusted for a moment, who murders political opponents, who slaughters women and childrenand Donald Trump is focused on, what?",
    "Just hours before Trump's endorsed candidate in Georgia's primary candidate was defeated by incumbent Governor Brian Kemp, Fox Business host Stuart Varney questioned the former president himself why he wouldn't take the advice of his GOP colleagues.",
    "Those sentiments have been echoed in polls, like a February Quinnipiac University survey that found 52 percent of GOP voters agreed with Pence on not overturning the results of the election, while only 36 percent sided with Trump.",
    "As Trump narrowed in on Kemp for not doing more to protect the state's election integrity, Kemp's backers argued that the only way forward for the Republican Party was to acknowledge Trump's loss and find a new path to winning.",
    "\"You take a look at the results, I mean, every one of these states, every one of these swing states and beyond, but everyone in these swing states is proven, the evidence is so massive.",
    "Trump insisted that while some GOP leaders have claimed he should move past the 2020 election, \"there's a vast portion of the Republican Party the disagrees with that.\"",
    "Although Trump has claimed that Republicans are not ready to let go of their loss to President Joe Biden, Kemp's victory has suggested that the opposite rings true.",
    "\"When you say yes to Governor Brian Kemp tomorrow, you will send a deafening message all across America that the Republican Party is the party of the future.\"",
    "There are those who want to make this election about the past,\" former Vice President Mike Pence told Kemp's supporters at a Monday rally.",
    "Trump's Republican critics have also warned the former president of fixating on the past, especially amid other key political issues.",
    "They want to look forward to what we're going to do with this economy and this society going forward,\" Varney told Trump on Tuesday.",
    "\"What I hear from a lot of Republicans is that they don't want you to look back to the 2020 election and rehash it.",
    "Kemp became a key target for the president after he refused to overturn the results of Georgia's election.",
    "\"Somebody robs the jewelry store of all the jewelry, you should just let them be alone, right?",
    "\"But if you don't study what happened and if you don't find outwe know what happened.\"",
    "They're very angry with what happened in the election,\" the former president said.",
    "The problem is the press, including Fox, doesn't want to talk about it.\"",
    "\"This is Donald Trump leading the Republican Party off the cliff.",
    "Because he wants to get revenge for losing the 2020 election?\"",
    "\"And a lot of people in the party disagree with that, Stuart.\"",
    "This is a man for who there is no bottom,\" he said.",
    "\"And Republicans are just afraid to call him out.\"",
    "You know, I justI disagree with that,\" Trump said.",
    "Just say, OK, he got away with it.",
    "\"Elections are about the future.",
    "\"They are very upset about it.",
    "\"I do that,\" Trump responded.",
    "\"What do you say to that?\"",
    "Himself?"
  ]
}