{
  "id": 7365,
  "mediaId": 65,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Kemp's landslide victory in Georgia's GOP gubernatorial primary a stinging setback for Trump",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f6430b5a-753f-4bc4-9720-7fc224014798/e535dcbb-487d-4e8d-a362-843f7972a172/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/kemps-landslide-victory-in-georgias-gop-gubernatorial-primary-a-setback-for-trump",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2095
  ],
  "sentences": [
    "And Short emphasized that it's \"indisputable\" that Trump's endorsement of JD Vance boosted the former hedge fund executive and best-selling author to victory in Ohio's crowded and combustible GOP Senate primary three weeks ago, and that the former president's backing of Mehmet Oz was crucial to the heart surgeon and celebrity doctor's surge in Pennsylvania's Republican Senate primary, where Oz and rival David McCormick are headed towards a recount one week after the election.",
    "WHAT THE LATEST FOX NEWS POWER RANKINGS SHOW IN THE MIDTERMS\n\"Georgia Republicans went to the ballot box and overwhelmingly endorsed four more years of our vision for this great state,\" Kemp touted in his primary night victory speech to large crowd of supporters at the College Football Hall of Fame in downtown Atlanta.",
    "Kemp  who sits atop Trump's Republican Party revenge list and who was targeted by the former president for nearly a year and a half for failing to overturn Trump's 2020 razor-thin election loss to now-President Biden in the key battleground state  crushed Perdue in Tuesday's GOP primary to win renomination.",
    "CLICK HERE TO GET THE FOX NEWS APP\nErick Erickson, a Georgia-based conservative radio host and nationally known blogger who was supporting Kemp, noted that the Georgia GOP gubernatorial primary was a race where Trump \"staked his name\" and \"he couldn't get him [Perdue] over the finish line.",
    "TRUMP AND PENCE HOLD DUELING RALLIES FOR PERDUE AND KEMP ON PRIMARY EVE IN GEORGIA\nTrump traveled to Georgia in late March to headline a rally for Perdue, starred in his campaign commercials, and called into two tele-rallies this month, including one on the eve of the primary.",
    "While Kemp celebrated, the results in Georgia represented a setback for Trump, who 16 months removed from the White House continues to play a kingmaker's role in Republican Party politics as he's endorsed scores of candidates up and down the ballot in the 2022 elections.",
    "Veteran Republican strategist Marc Short, a top longtime adviser to former Vice President Mike Pence who came on board a month ago as a senior Kemp campaign adviser, stressed that \"the president still has an enormous impact on our primary voters.\"",
    "And a week earlier, Charles Herbster  the candidate the former president endorsed and held a rally on his behalf in Nebraska's GOP gubernatorial primary  was edged out by Jim Pillen, who was backed by term-limited and outgoing Gov.",
    "Republican Secretary of State Brad Raffensperger  who was also repeatedly targeted by Trump for resisting the then-president's requests to overturn the 2020 election results  was leading Trump-backed challenger Rep. Jody Hice.",
    "But Trump's attacks were far from enough to topple an incumbent governor who thanks to his record remains popular with Georgia conservatives, regardless of the repeated attacks from the former president.",
    "But the former president's immense popularity and influence with Republican voters and full-court press for Perdue did little to boost the former senator's unsuccessful primary challenge against GOP Gov.",
    "Last year Trump pilloried Kemp at a rally in Georgia, and he repeatedly urged Perdue to primary challenge the governor and endorsed him the day after the former senator announced his bid in December.",
    "The governor's landslide victory over Perdue sets up a high-profile and high-stakes rematch in November's general election with Democrat Stacey Abrams, who narrowly lost to Kemp four years ago.",
    "Americans are clearly united around restoring the leadership and policies of President Trump in 2022 and beyond,\" Trump spokesman Taylor Budowich argued in a statement to Fox News.",
    "Texas Attorney General Ken Paxton, who was endorsed by the former president, crushed challenger George P. Bush, the state's land commissioner, in a GOP primary runoff.",
    "And in neighboring Alabama, Rep. Mo Brooks made it into a runoff for the GOP Senate nomination even after Trump took back his endorsement of the congressman in March.",
    "But Short said that in competitive GOP primaries, \"you have to have your own story, your own record, and a Trump endorsement's not going to be sufficient.\"",
    "And Sen. John Boozman of Arkansas, who was backed by Trump, bested two primary challengers from the right to win renomination in the heavily red state.",
    "\"For Georgia Republicans, it turns out they're more interested in beating Stacey Abrams than nursing Trump's grievances,\" Erickson argued.",
    "With the vote still being counted, Raffensperger was over 50%, which would allow him to avoid a primary runoff next month with Hice.",
    "But Kemp earned Trump's ire after certifying the 2020 presidential election results in Georgia following two recounts of the vote.",
    "Abrams, a rising Democratic Party star and a nationally known voting rights champion, faced no opposition in her party's primary.",
    "\"President Trump is continuing to win everywhere after having another huge night of victories for his endorsed candidates.",
    "\"We have a governor that's done the worst job of any governor in probably decades on election integrity,\" Trump charged.",
    "\"Kemp is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia.\"",
    "Janice McGeachin, who was best-known of seven primary challengers running against incumbent Republican Gov.",
    "Perdue may not be the only Trump-backed candidate to go down to defeat in Georgia's GOP primaries.",
    "Perdue becomes the third Trump-endorsed gubernatorial candidate to lose in this year's primaries.",
    "But Trump enjoyed some victories in other high-profile and competitive primaries on Tuesday.",
    "ATLANTA  Former President Donald Trump went all out for former Sen. David Perdue of Georgia.",
    "\"We created record jobs, kept woke politics out of the classroom and off the ball fields.",
    "Four years ago, with the support of the then-president, Kemp narrowly defeated Abrams.",
    "The governor easily crushed the field in the primary, winning renomination.",
    "Put more money in our schools and secured our elections,\" Kemp emphasized.",
    "Last week in Idaho, Trump backed far-right Lt. Gov.",
    "So yes, this one's going to sting the most.\"",
    "We brought violent criminals to justice.",
    "Pete Ricketts.",
    "Brad Little.",
    "Brian Kemp."
  ]
}