{
  "id": 7378,
  "mediaId": 195,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Kemp defeats Perdue in Georgia, a major blow to Trump",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/article_images-kempbrian_120419_ap_elijah_nouvelage.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3499808-kemp-defeats-perdue-in-georgia-delivering-loss-for-trump/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    1147,
    1951,
    2087,
    2095,
    2230,
    4325,
    428,
    571,
    2672
  ],
  "sentences": [
    "Throughout his four years as governor, Kemp has aggressively pursued a deeply conservative agenda, signing into law a six-week abortion ban, imposing new limits on early voting and approving a constitutional carry law that allows Georgians to carry firearms without a permit.",
    "Kemp's victory on Tuesday dealt only the latest blow to Trump's endorsing power, undermining the former president's argument that he has the ability to pick winners and losers in GOP primaries, even in his post-presidency.",
    "Despite Trump's opposition to him, he won the support of a broad coalition of Republicans, who largely see his first term in the governor's mansion as a success for conservative policy priorities.",
    "Brian Kemp (R) was projected to win his renomination for a second term on Tuesday, overcoming a primary challenge from former Sen. David Perdue (R-Ga.) and, by extension, former President Trump.",
    "Kemp, a onetime ally of the former president, stirred Trump's ire following the 2020 presidential election after he rebuffed his pleas to overturn President Biden's electoral victory in Georgia.",
    "Perdue, meanwhile, centered his campaign on his alliance with Trump and the former president's baseless claim that widespread voter fraud robbed him of a second term in the White House in 2020.",
    "With his renomination secured, Kemp will go on to face Democrat Stacey Abrams in November in a rematch from 2018, when he narrowly defeated her to win his first term in the governor's mansion.",
    "Also working against Perdue was his loss to Sen. Jon Ossoff (D-Ga.) in a hotly contested runoff election in early 2021 that helped hand Democrats their current majority in the Senate.",
    "Biden's approval rating remains well underwater, and Democrats are facing tough attacks from Republicans over rising inflation, gas prices, border security and crime.",
    "While early polling shows Kemp going into the general election with a lead over his Democratic rival, Abrams remains a political force to be reckoned with.",
    "Trump vowed to campaign against Kemp, eventually persuading Perdue to enter the race for governor in hopes of ousting him.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "She is beloved among Democrats, not only in Georgia but nationally, and she has proved to be an adept fundraiser.",
    "But despite carrying Trump's endorsement, Perdue struggled to gain traction among Georgia Republican voters.",
    "He wasn't a good candidate in 2020, and he didn't have a lot going for him outside of Trump's endorsement.",
    "Polling in the run-up to the primary showed Kemp leading Perdue by double-digit margins.",
    "He's not a good candidate, Jay Williams, a Georgia-based Republican strategist, said.",
    "To be sure, there were other factors at play that benefited Kemp.",
    "ABC and NBC News both called the race for Kemp around 8:30 p.m.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Still, she faces tough historical and political headwinds.",
    "Georgia Gov.",
    "ET."
  ]
}