{
  "id": 7381,
  "mediaId": 1576,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Georgia Secretary of State Raffensperger faces Trump ally",
  "image": "https://www.wabe.org/app/uploads/2022/05/Untitled-1440-×-810-px-336x189.jpg",
  "link": "https://www.wabe.org/georgia-secretary-of-state-raffensperger-faces-trump-ally/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1776,
    2087,
    2095,
    2203,
    2279,
    146,
    428,
    2672
  ],
  "sentences": [
    "All of them have championed voting rights and criticized a sweeping election law passed by Republicans in the General Assembly in 2021 that shortened the period to request an absentee ballot, added an ID requirement, restricted drop boxes, and stripped the secretary of state of his seat on the State Election Board, among other things.",
    "The other candidates are: Floyd Griffin, a state senator and former mayor of the city of Milledgeville; Michael Owens, former Cobb County Democratic Party chairman; John Eaves, former Fulton County Commission chairman; and Dee Dawkins-Haigler, a former state representative from DeKalb County.",
    "All three challengers in the GOP primary  Hice, former Alpharetta Mayor David Belle Isle and former probate and magistrate judge T.J. Hudson  have criticized Raffensperger's handling of the 2020 election, saying he caused Georgians to lose confidence in the system.",
    "Georgia Republican Secretary of State Brad Raffensperger is facing a tough primary challenge Tuesday, nearly two years after he drew the wrath of former President Donald Trump for refusing to try to overturn Trump's loss to Democrat Joe Biden in the state.",
    "State Rep. Bee Nguyen, who occupies the seat formerly held by Democratic gubernatorial candidate and voting rights activist Stacey Abrams, leads the group in fundraising and has snagged some significant endorsements.",
    "The secretary of state was a primary target among numerous top state officials Trump blamed for his loss in Georgia, which has long voted reliably for Republican presidential candidates.",
    "He also made prohibiting noncitizens from voting  a platform popular with conservative Republicans that is already enshrined in Georgia law  a centerpiece of his reelection campaign.",
    "Trump's obsession with his election loss and his unproven claims of widespread fraud have put a spotlight on down-ballot secretary of state races around the country.",
    "In a notorious phone call on Jan. 2, 2021, Trump suggested that Raffensperger could find enough votes to swing the state's presidential election result in his favor.",
    "Hice has fully embraced Trump's false claims that the 2020 election was stolen and objected to Georgia's electoral votes being counted for Biden.",
    "Raffensperger has punched back, staunchly defending his record and insisting that Georgia's elections are fair and secure.",
    "State and federal officials, including Trump's own attorney general, have said there was no evidence of widespread fraud.",
    "The votes in Georgia's presidential election were counted three times, and each tally confirmed Biden's victory.",
    "Trump was quick to endorse U.S. Rep. Jody Hice last year when he announced he would challenge Raffensperger.",
    "Raffensperger's unwillingness to bend to pressure from Trump raised his profile nationwide.",
    "Brian Kemp, who is battling a Trump-endorsed candidate in Tuesday's gubernatorial primary.",
    "On the Democratic side, five candidates are fighting for their party's nomination.",
    "Trump also lambasted GOP Gov."
  ]
}