{
  "id": 7412,
  "mediaId": 233,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Stacey Abrams wins gov primary; GA polls close; primaries also in Alabama, Ark., Texas: live updates",
  "image": "https://www.gannett-cdn.com/presto/2021/12/10/USAT/d8f1268b-1b97-4ed7-acf6-2e49b8225653-AP_Election_2022_Georgia_Governor.jpg?crop=3363,1892,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/24/primaries-georgia-texas-alabama-arkansas-live-updates/9570676002/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    815,
    2095,
    3103
  ],
  "sentences": [
    "Catherine Buchaniec, Medill News Service\nAlabama votes for federal, state offices\nAlabama voters go to the polls Tuesday to select nominees for a host of state and local offices, including governor, U.S. Senate, attorney general, secretary of state, state auditor, the Alabama Supreme Court, and the Public Service Commission.",
    "Merdie Nzanga, Mabinty Quarshie, David Jackson\nPaper ballots briefly used after isolated malfunction in Dekalb County precinct\nAVONDALE ESTATES, GA  Election workers briefly switched over to using paper ballots early in the day after a machine malfunction at one precinct in DeKalb County.",
    "Again in America, more families will now be forced to live forever with the pain of losing their precious children to unspeakable, senseless gun violence in a place where they should have been safe, happy, and free, said McBath, whose son, Jordan Davis, was shot and killed in 2012.",
    "Mabinty Quarshie, David Jackson\nFlood of early voting in Georgia could mean short lines on election day\nLOCUST GROVE, GA  After witnessing record turnout during early voting, some Georgia voters said they anticipated short wait times at the polls on Election Day.",
    "- Ella Lee\nTexas candidates react to elementary school shooting that killed 15\nPolitical candidates in runoff races across Texas shared condolences online Tuesday evening after a gunman killed 14 children and one teacher at an elementary school in south Texas.",
    "Catherine Buchaniec, Medill News Service\nGeorgia Rep. Lucy McBath, who lost son to gun violence, calls Texas shooting 'sickening'\nRep. Lucy McBath, D-Ga., called the deadly shooting at an elementary school in Uvalde, Texas a sickening, preventable tragedy.",
    "- Mabinty Quarshie\nDon't 'sleep on midterm elections'\nSTOCKBRIDGE, GA  As voters trickled into Stockbridge First United Methodist Church on Tuesday for the primary elections, 37-year-old Farrah Clark said she hopes people dont sleep on midterm elections.",
    "Catherine Buchaniec, Medill News Service\nDonald Trump's take on David Perdue's potential loss: Not much comment\nDonald Trump dealt with the prospect of an endorsed candidate's loss the best way he knows how: By refusing to talk in detail about it.",
    "Trump declined to discuss the probability that David Perdue will lose the Georgia gubernatorial primary to incumbent Republican Brian Kemp, preferring to discuss his more successful candidates during an interview Tuesday with Fox Business Network.",
    "- David Jackson\nGeorgias Senate Race Draws Support for Warnock\nSTOCKBRIDGE, GA  As voters head to the polls Tuesday, the race for one of Georgias Senate seats remains at the forefront of the states highly anticipated primary election.",
    "Candidates across several races  including Attorney General Ken Paxton, Rep. Henry Cueller and George P. Bush  asked for prayers for peace and strength for Uvalde, where the shooting took place, and the families of the victims.",
    "Phillip M. Bailey\nGeorgia polls close, Abrams wins, other results still pending\nPolls across the state of Georgia, where a number of closely watched primary races are underway, closed Tuesday at 7 p.m. Eastern time.",
    "Plus, Rep. Marjorie Taylor Greene, R-Ga., will face five opponents in her first reelection bid after a 14th Amendment challenge to her eligibility as a candidate could have prevented her from running again at all.",
    "Rep. Mo Brooks, R-Ala., seeks to climb out from behind Trump's shadow, after the former president revoked his endorsement for Brooks' senatorial campaign following comments Brooks made about moving on from 2020.",
    "But former Vice President Mike Pence has aligned his interests with Kemp, describing him in a statement announcing they'd throw a rally together as one of the most successful conservative governors in America.",
    "Meanwhile, in a statewide office, George P. Bush, a Texas Land Commissioner as well as nephew and grand-nephew of former presidents Bush, is an underdog running against Attorney General Ken Paxton.",
    "Paxton faces charges of securities fraud and a separate FBI investigation, and is also under investigation by the state over his failed attempts to overturn the 2020 presidential election.",
    "She was also heavily recruited to run for U.S. Senate but bypassed after citing her renewed passion to oppose election law changes being pushed in Republican-controlled state legislatures.",
    "Some leaders in the Democratic Party, including House Majority Whip James Clyburn and House Speaker Nancy Pelosi, are supporting Cuellar, to the ire of abortion supporters in the party.",
    "Its very important for us to show up, just as we would do in the presidential race because this is how we get those laws that would benefit us, Clark, a teacher from Henry County, said.",
    "Abrams wins Democratic nomination for Georgia governor\nStacey Abrams will once again be the Democratic nominee for Georgia governor after sailing through the primary contest unopposed.",
    "Clark  whose father has diabetes and other health issues where the cost of medication is particularly high  said she liked the two Democratic candidates plans to expand Medicaid.",
    "Cisneros has campaigned against Cuellar for his anti-abortion stance amid the Supreme Court draft opinion leak earlier this month indicating the court will overturn Roe v. Wade.",
    "Sean Kennedy said he tried to vote at a polling station at Avondale Estates City Hall, but after seeing the line created by the outage, he opted to return later in the day.",
    "lark said she turned out to vote for Democratic Sen. Raphael Warnock and Democratic gubernatorial candidate Stacey Abrams in part because of their healthcare policies.",
    "Rep. Marjorie Taylor Greenes primary race is also underway, along with the Senate contest between incumbent Rep. Raphael Warnock and football star Herschel Walker.",
    "In Arkansas, Sarah Huckabee Sanders  once Trump's White House press secretary  is running to helm the state of Arkansas as governor, a role her father once held.",
    "Brian Kemp is gunning for a second term against Trump-backed former Sen. David Perdue, a race that spotlights the deepening cracks within the Republican Party.",
    "Abrams lost the 2018 contest for governor against Republican Brian Kemp by less than 2% and refused to concede in the ensuing months, citing voter suppression.",
    ":Mike Pence says he could run for president in 2024 even if Trump also runs\nErik Burton, a county elections spokesperson, said that the incident was isolated.",
    "At a time when this nation is still reeling from the pain of recent shootings, we are faced with another sickening, preventable tragedy in Texas, she added.",
    "More than 850,000 voters cast a ballot in person or returned an absentee ballot before Election Day, according to the Georgia Secretary of States office.",
    "Primary elections in four Southern states Tuesday reflect the nation's greatest fault lines and again test former President Donald Trump's GOP power.",
    "Georgia's gubernatorial primaries will also highlight Democratic candidate Stacey Abrams' efforts to mobilize voters and turn the Peach state blue.",
    "And several runoff races in Texas will showcase voters' resolve on abortion rights and whether the influence of the Bush family still holds strong.",
    "But Warnock's seat is on the ballot again this year because he was elected to fill the remaining two years of former GOP Sen. Johnny Isakson' term.",
    "Former President Donald Trump is fighting to defeat Kemp, who refused to overturn Georgia's 2020 presidential election result in favor of Trump.",
    "Because of redistricting, McBath is running for Georgias 7th congressional seat against another incumbent: Democratic Rep. Carolyn Bourdeaux.",
    "Lord, our refuge and strength, we pray for the souls of those lost, those who were wounded, their families, and our brave first responders.",
    "- Ella Lee\nRunoff primary races in Texas\nDemocratic Rep. Henry Cuellar is up against Jessica Cisneros in the primary runoff in South Texas.",
    "In Henry County, Tinecia Cullen said she turned out to vote to cast a ballot for Warnock and help Democrats maintain control of the Senate.",
    "Trump described her as a \"warrior who will always fight for the people of Arkansas and do what is right, not what is politically correct.\"",
    "I figured with the way things were going with so many people voting early that it will probably be less crowded today, said Phil Gilbert.",
    "Primary roundup:The primary races to watch on Tuesday (and why)\nBut politicos have Georgia on their mind, where incumbent Republican Gov.",
    "Mike Huckabee, is expected to win the GOP primary, making her the odds-on favorite to win the red state in November and replace Gov.",
    "I ask you all of you to join me in praying for our fellow Texans impacted by the horrific shooting in Uvalde today, Paxton tweeted.",
    "In turn, the former president endorsed Perdue and ponied up $500,000 to a super PAC aimed at preventing Kemp's reelection.",
    "\"And, as you know, Brian Kemp did a very poor job on election integrity ... And we'll see what that means to the voters.\"",
    "The U.S. Senate race, to fill the seat of retiring Republican Sen. Richard Shelby, is among the highest-profile races.",
    "Four years later, Abrams has become a rising star in the Democratic Party nationally as a voice for voting rights.",
    "Primaries will also be held for U.S. House seats, the State Board of Education, and the Alabama Legislature.",
    "If no single candidate in a race gets a majority, the top two vote-getters will advance to a June 21 runoff.",
    "Polls will open until 7 p.m. A voter who is in line to vote when polls close will be able to cast a ballot.",
    "She has led massive registration drives that many have credited with making Georgia a battleground state.",
    "Jon Ossoff and Raphael Warnock helped Democrats gain control of the U.S. Senate after winning runoffs.",
    "Alabama polls also close at 7, and Arkansas ends voting at 7:30 pm, with both states in Central Time.",
    "In 2020, Abrams was rumored to be on the short list of President Joe Biden's potential running mates.",
    "Her opponent in the state's Republican primary is former radio talk show host Francis \"Doc\" Washburn.",
    "Jessica Cisneros, who is running for Congress in Texas 28th Congressional District, wrote on Twitter.",
    "U.S. Rep. Mo Brooks got  and then lost  former President Donald Trump's endorsement for that spot.",
    "We must do something to keep guns out of the hands of those who should not have them,\" she said.",
    "Everytown for Gun Safety, a gun control advocacy group, has endorsed McBath in the primary race.",
    "Texas polls close at 7 p.m. local time, with the state covering both Central and Mountain Time.",
    "\"We've won just about every race,\" Trump said, citing endorsed Republican Senate nominees J.D.",
    "State Attorney General Leslie Rutledge was also in the race, but dropped out, as did Lt. Gov.",
    "I worry about the laws that are going to be passed if we dont have representation, she said.",
    "First polls will close in Georgia at 7 p.m. the only state voting Tuesday in Eastern Time.",
    "The former Trump press secretary is running against Francis \"Doc\" Washburn in the contest.",
    "He also cited Herschel Walker, who will likely win a Senate primary in Georgia on Tuesday.",
    "So far, only Democrat Stacey Abrams primary bid for governor has been called in her favor.",
    "Brian Kemp or former Sen. David Perdue, who is backed by former President Donald Trump.",
    "She was born and raised in Atlanta and has been to the church where Warnock preaches.",
    "Election workers followed protocols before returning to regular voting, Burton said.",
    "How many more mass shootings do children have to experience before we say enough?",
    "If elected in November, Abrams would be the Peach States first Black governor.",
    "Yet he is still doing well despite these challenges, according to the polls.",
    "Voters leaving the location place wait times in the 15 to 25 minutes range.",
    "The polling location had a line of about 24 people at about 6:30 p.m. EDT.",
    "Georgia saw historic turnout during the states early voting voting period.",
    "Sanders was the first formal endorsement from Trump after he left office.",
    "But the votes arent all counted yet, and most races havent been called.",
    "Cuellar is the only Democrat in the House who opposes abortion rights.",
    "They were doing paper ballots, but I had to go to work, Kennedy said.",
    "My wife already voted, so I feel bad if I chicken out and dont do it.",
    "Julia Shapero, Medill News Service\nWho is Sarah Huckabee Sanders?",
    "A candidate will needs 50% or more of the vote to avoid a runoff.",
    "Vance in Ohio and Ted Budd in North Carolina in particularly.",
    "Sarah Huckabee Sanders, the daughter of former Arkansas Gov.",
    "Brian Lyman, Montgomery Advertiser\nWhen do the polls close?",
    "I feel like he really cares about what I really care about.",
    "Cullen said she identifies with Warnocks background.",
    "Its choosing those right senators to represent us.",
    "There will also be local races around the state.",
    "She will face either Republican incumbent Gov.",
    "\"David Perdue's a very good man,\" Trump said.",
    "It's the states deadliest school shooting.",
    "We can do something to help fix this.",
    "I walked right in  only person there.",
    "We have to do something to fix this.",
    "I think hes helping, Cullen said.",
    "In January 2021, Georgia Sens.",
    "This is a devastating tragedy.",
    "Kemp is favored to win.",
    "Pence versus Trump?",
    "Asa Hutchinson.",
    "Merdie Nzanga",
    "Tim Griffin.",
    "Perdue?"
  ]
}