{
  "id": 7425,
  "mediaId": 558,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia Gov. Kemp defeats Trump-backed challenger, former Senator Perdue in GOP primary",
  "image": "https://s.yimg.com/uu/api/res/1.2/5Lc3XMSrnBPwMqh2ZAF3EA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/5f11a600-d7b4-11ec-bf59-0e0e9aaff162",
  "link": "https://sg.news.yahoo.com/georgia-gov-kemp-defeats-trump-backed-challenger-former-sen-perdue-in-gop-primary-004712220.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Isikoff",
  "authorUrl": "https://www.yahoo.com/author/michael-isikoff",
  "termIds": [
    815,
    1147,
    1951,
    2095,
    2203,
    4837,
    428,
    2555,
    2672
  ],
  "sentences": [
    "Kemps strong showing, leading by nearly 50 points with 33% of the expected vote reported, when the Associated Press called the race only 34 minutes after polls closed, means that he avoids a runoff with Perdue and can now focus exclusively on his rematch with Democratic gubernatorial nominee Stacey Abrams, who he defeated in 2018.",
    "For gun rights advocates, Kemp pushed a constitutional carry law through the Legislature; for opponents of abortion, he helped pass a bill banning abortions after a fetal heartbeat can be detected; he secured two massive economic development projects for the state, a Rivian electric truck plant and a Hyundai auto factory.",
    "When asked about estimates that 18 percent of past Democratic voters had voted in the GOP primary, Raffensperger said that total represents a substantial number of traditional Republican voters who switched to vote against Trump in 2020.",
    "Trump was fully invested in the race; he aggressively recruited a lukewarm Perdue to run in the first place, traveled to Georgia to stump for him, held fundraisers and from his own political committee to fuel Perdues campaign.",
    "The double-digit blowout came despite the fact that Trump had endorsed Perdue and cleared the field of other challengers, while making Kemp his single biggest target for defeat during the primary season.",
    "Georgia has been the object of Trumps obsession since losing the state in the 2020 presidential race and waging a conspiracy-laden and ultimately unsuccessful pressure campaign to overturn the results.",
    "Governor Kemp has proven that a conservative with a strong record who is not afraid to square off against Trump can not only fend off the Donald, but can actually beat the former president quite badly.",
    "Kemps win will reverberate in the Republican political world, including among 2024 presidential hopefuls as they continue to assess how much electoral muscle Trump will have going forward.",
    "I want to be crystal clear with all of you here tonight: Our battle is far from over tonight, Kemp said to supporters at his Atlanta-area victory party late Tuesday evening.",
    "Raffensperger, however, disputed that he was benefiting from Democratic voters, pushing back on a view that that could hurt his chances if the race does go to a run-off.",
    "This was the biggest political fight of the midterms for Donald Trump and he lost it by double digits, GOP operative and Trump critic Mike Murphy told Yahoo News.",
    "If David Perdue loses, it wont be because of Trump, said one Trump aide, recounting how Trump worked harder for Perdue than any other candidate this cycle.",
    "Meanwhile, Trump obsessively trained his fire on Kemp, whom he reviled for refusing to help him overturn the 2020 presidential election in Georgia.",
    "At the same time, Kemp touted his hardline conservative credentials and achievements while also using the powers of incumbency to his advantage.",
    "Tonight, the fight for the soul of our state begins to make sure that Stacey Abrams is not going to be our governor or the next president.",
    "But no race was more closely watched than Kemp-Perdue, because it was regarded as a test of Trumps continuing hold on GOP voters.",
    "Backing Perdue was the primary focus of his revenge campaign, a strategy that has now been soundly repudiated by Georgia voters.",
    "(The issue of gun control returned to the fore again on Tuesday when at least in a mass shooting at a Texas elementary school.)",
    "And he managed to secure a $500 tax rebate for married couples that landed in bank accounts just as early voting was starting.",
    "At a rally in Georgia in March, Brian Kemp is a turncoat, is a coward and is a complete and total disaster.",
    "He will take on Democratic Sen. Raphael Warnock, who won the seat in a special election in Jan. 2021.",
    "Also in Georgia, former football star Herschel Walker for the Republican nomination for U.S. Senate.",
    "ATLANTA  In a major blow to Donald Trumps reputation as the Republican kingmaker, Georgia Gov.",
    "According to Robinson, he checked all the boxes for every portion of the Republican coalition.",
    "Brian Kemp trounced former Sen. David Perdue in the GOP primary for governor.",
    "Abrams, running unopposed, won todays Democratic primary.",
    "These are Republican voters coming back home, he said."
  ]
}