{
  "id": 7434,
  "mediaId": 409,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Trumps Hold Over GOP Electorate to Be Tested in Closely Watched Primaries",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/DTRUMP.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/trumps-hold-over-gop-electorate-to-be-tested-in-closely-watched-primaries/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arjun Singh",
  "authorUrl": "",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "In Texas, meanwhile, run-off races for state-wide and Congressional offices are being conducted following the states Attorney General, Ken Paxton, is running in a high-profile primary contest against George P. Bush, the states land commissioner  a member of the Bush Family and son of former Florida Governor and 2016 presidential candidate Jeb Bush.",
    "Throughout her ongoing first term in Congress, Greene has become among the bodys most controversial members for publicly supporting various online conspiracy theories  e.g., QAnon, and Pizzagate  and expressing support for Vladimir Putin during Russias war in Ukraine.",
    "An infamous phone call between Trump and Raffensperger on January 2, 2021, where Trump asked him to find 11,780 votes (one more than the margin of his loss to Biden) attracted huge controversy, with Raffensperger being both criticized and praised for resisting Trump.",
    "Another critical race is the primary for Georgias Secretary of State, the states top elections authority, where incumbent Brad Raffensperger faces U.S. Representative Jody Hice, who is relinquishing his seat in Congress at Trumps behest to run for the post.",
    "Eighteen months after Trump made the state ground zero in his effort to reverse the results of the 2020 presidential election, Republican politics in the state have been polarized between supporters and opponents of Trumps claims about the election.",
    "Less controversial yet, perhaps, more important to Republicans is the U.S. Senate primary, where former professional football player Herschel Walker has dominated the field with an average of 65 percent support across all major polls.",
    "His opponent, Perdue  who lost re-election to the Senate in a 2021 run-off race to Democratic candidate Jon Ossoff  has been endorsed by Trump in an effort to remove Kemp from office for defending the integrity of the 2020 election.",
    "Kemp currently leads Perdue by a large margin (22 percent), per RealClearPolitics average of major opinion polls, and  should he win  may avoid a run-off race provided that no candidate receives more than 50 percent of the vote.",
    "High-profile GOP candidates across the South will face voters in closely watched Tuesday night primary contests, which are being seen as another test of former president Donald Trumps hold over the Republican electorate.",
    "Her candidacy received a boost after Trump rescinded his endorsement of Congressman Mo Brooks, who represents the states 5th District, for refusing to join efforts to overturn the results of the 2020 election.",
    "Kemp, once a top Trump ally, has been heavily criticized by Trump for refusing to call a special session of the state legislature to appoint new slate Trump-allied electors to the 2020 Electoral College.",
    "Alongside state-level primaries are federal contests, with Georgias 14th Congressional District featuring incumbent Republican Representative Marjorie Taylor Greene garnering the most media attention.",
    "However, owing to her national profile, Greene has raised $9.2 million and spent $6.6 million for her reelection campaign  an unprecedented sum for a House member  compared to $400,000 for Strahan.",
    "Paxton has been one of Trumps most avowed supporters and a perpetual legal challenger of the Biden Administration, with CNN terming the state a legal graveyard for Bidens agenda due to his efforts.",
    "He has claimed that Trump asked him to work to remove President Joe Biden from office and hold a special election for president, which is not possible under the U.S. Constitution.",
    "Ranked by ESPN as among the top three greatest college footballers of all time, he has gained the endorsements of both Trump and Senate Minority Leader Mitch McConnell (R., K.y.).",
    "Walker will run against the Democratic incumbent, Senator Raphael Warnock  who himself won a special election to the seat in 2021  in Novembers election to a full six-year term.",
    "A recent poll by SurveyUSA places Raffensperger in the lead with 31 percent of the vote, and Hice at 20 percent, meaning that the race will likely head to a runoff on June 21st.",
    "As Georgias top elections authority in 2020, Raffensperger was the central figure opposing Trumps efforts to reverse the states presidential electoral results that year.",
    "Ambassador to Slovenia Lynda Blanchard and businessman Tim James  though has not polled above the 50 percent needed to avoid a run-off, scheduled for June 21.",
    "Katie Britt, a 40-year-old first-time candidate who served as Shelbys chief of staff, leads the field with 32 percent support per an Emerson College poll.",
    "The call was cited as primary evidence in the article of impeachment against Trump passed by the House of Representatives after events of January 6, 2021.",
    "The winner will face presumptive Democrat nominee Stacey Abrams, who is running for the Democratic nomination unopposed after losing to Kemp in 2018.",
    "Adjacent to Georgia, Alabama is conducting a primary election to the U.S. Senate seat being vacated by retiring seven-term Senator Richard Shelby.",
    "Georgia is undoubtedly the most important venue, where party nominees for state-wide offices and Congressional seats will be chosen.",
    "Official information on how and where to vote is available at the websites of the Alabama, Georgia, and Texas secretaries of state.",
    "A primary election for Alabamas gubernatorial race is also being held, where incumbent Governor Kay Ivey is seeking a second term.",
    "A January poll showed Greene in the lead with 60 percent support, in a district whose Cook Partisan Voting Index score is R+27.",
    "She currently leads the field with a 30-point margin over her two main rivals  former Trump-appointed U.S.",
    "She is facing five GOP challengers, with businesswoman Jennifer Strahan the leading contestant.",
    "Hice, meanwhile, has embraced Trumps claims that Georgias 2020 electors were stolen from him.",
    "Bush has also been a strong supporter of Trump, breaking from his familys opposition to him.",
    "Atop the states ballot is the gubernatorial primary, which reflects this divide markedly.",
    "Greene was stripped of her committee assignments by the Democratic-led House last year.",
    "Polls in all states will close at 7:00 p.m. in their respective time zones.",
    "Republican incumbent Brian Kemp is running against former U.S.",
    "Senator David Perdue."
  ]
}