{
  "id": 7436,
  "mediaId": 441,
  "date": "d2022-05-24T11:00",
  "headline": "Here Are the Key Races to Watch in Georgias Tuesday Primaries",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iMX_ykCjqhiQ/v0/-1x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-05-24/here-are-the-key-races-to-watch-in-georgia-s-tuesday-primaries",
  "sentiment": "0.633",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margaret Newkirk",
  "authorUrl": "https://www.bloomberg.com/authors/AQd9ZjOezns/margaret-newkirk",
  "termIds": [
    815,
    1147,
    1776,
    1951,
    2095,
    2203,
    2493,
    428,
    2672,
    2900
  ],
  "sentences": [
    "Georgia voters are set to deliver the biggest test to Donald Trumps grip on the Republican party, in a primary season marked by the former presidents efforts to bolster his sway with party faithful and exact political retribution for those who refused to overturn his 2020 electoral loss.",
    "Here is a guide to the election in Georgia:\nGOP governors race: Kemp versus Perdue\nKemp, 58, is running for re-election as a conservative who delivered on issues important to the Republican base, including tough abortion limits and a ban on transgender athletes in high school sports.",
    "He is the senior pastor of Ebenezer Baptist Church in Atlanta, where Martin Luther King Jr. once preached, and must defend his seat because his 2021 win was in a special election to finish the term of Johnny Isakson, who was ill and has since died.",
    "David Perdue, 72, is a former Dollar General CEO who was recruited to challenge Kemp by Donald Trump and is running on Trumps stolen election claims and his allegation Kemp should have acted to overturn the results.",
    "Former University of Georgia football legend Herschel Walker, 60, is backed by Trump and is running far ahead of any other GOP primary contender despite participating in no debates and avoiding the news media.",
    "Secretary of State race: Raffensperger versus Hice\nRaffensperger, 67, was targeted by Trump for certifying the 2020 election and has repeatedly said Trumps stolen election claims are false.",
    "While Republican Governor Brian Kemp remains popular in Georgia and looks likely to survive a primary challenge, Secretary of State Brad Raffenspergers race is closer.",
    "He is also touting his economic development record, including the biggest project in state history, a Hyundai Motor Co. electric vehicle plant near Savannah.",
    "Two other candidates, attorney David Belle Isle and former probate judge T.J. Hudson, are running, but trailing far behind Raffensperger and Hice.",
    "He is running on a promise to push a constitutional amendment to ban voting by non-citizens, and on his defense of the 2020 elections integrity.",
    "In polling on the November race, the two are virtually tied according to the RCP average of polls.",
    "Senate race:\nSenator Raphael Warnock, 52, has no significant opposition in the Democratic primary.",
    "Polling hours:\nRegistered voters can cast ballots in person from 7 a.m. to 7 p.m.\nKey Stories:",
    "Congressman Jody Hice, 62, is a former pastor who is running on Trumps stolen election claim.",
    "The most recent poll in the race had Raffensperger and Hice tied, with 40% still undecided.",
    "Warnock was ahead by 79 percentage points in the one poll that measured his primary race.",
    "He was 23 percentage points ahead in the Real Clear Politics polling average.",
    "Two other candidates are in the race, but each has less than 10% support.",
    "Walker was up by a Real Clear Politics average of 55.9 points.",
    "Recent polls have shown Kemp leading Perdue by double digits.",
    "The winner will face Democrat Stacey Abrams in November.",
    "He also is promising to end the state income tax.",
    "He is endorsed by Trump."
  ]
}