{
  "id": 7461,
  "mediaId": 98,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia has its primary today. Heres what to watch",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/af114c5/2147483647/strip/true/crop/6000x4000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F69%2F14%2F34a9b7604e2a9cdca978a004f826%2Felection-2022-governor-georgia-77874.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-24/georgia-primary-texas-runoffs",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melanie MasonStaff Writer",
  "authorUrl": "https://www.latimes.com/people/melanie-mason",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Most political observers thought the unspoken reason for Trumps about-face was Brooks sluggish campaign, which was being outpaced by Katie Britt, a former chief of staff to retiring Sen. Richard Shelby, and Mike Durant, a businessman and former military helicopter pilot who was shot down nearly 30 years ago in the Black Hawk Down incident in Somalia.",
    "Hice voted last year against certifying the results of the 2020 presidential race and was involved in discussions designed to pressure Pence to throw out disputed electoral votes, according to testimony collected by the congressional investigation into the Jan. 6, 2021, attack on the Capitol.",
    "While Cisneros has campaigned with the lefts most prominent stars, including Rep. Alexandria Ocasio-Cortez of New York and Vermont Sen. Bernie Sanders, Cuellar has denounced her as too far left for this majority-Latino district.",
    "That kind of job approval explains how Kemp secured the backing of many in Georgias political establishment, as well as national Republicans increasingly willing to defy Trump, including former Vice President Mike Pence.",
    "For Trump, Tuesdays election marks the inaugural stop in his 2020 revenge tour  the first opportunities hes had to unseat Republicans whom he considers disloyal for refusing to acquiesce in his baseless fraud claims.",
    "Winning over Trump voters despite Trump\nFor most of last year, Trump confidently predicted that Kemps political future was finished, promising at one point the MAGA base  which is enormous  will never vote for him.",
    "Kemp signed a number of bills reflecting conservative priorities, including new voting restrictions, banning local governments from sharply reducing police budgets and limiting discussion about race in classrooms.",
    "But Warnock is unlikely to let Walker off the hook for various troubles in his past, including allegations of domestic violence and threatening behavior against women, as well as turbulent business dealings.",
    "An unusual un-endorsement\nIf a Trump endorsement can breathe new life into a campaign, a Trump un-endorsement was widely expected to be a death knell for Rep. Mo Brooks campaign to be Alabamas next senator.",
    "The fiercest so far has been playing out along the Texas-Mexico border, where progressive candidate Jessica Cisneros is trying for a second time to oust centrist incumbent Rep. Henry Cuellar.",
    "Those contests, along with the likely rise of football legend Herschel Walker and a pair of battles for the direction of the Democratic Party, make up a busy night of midterm primary action.",
    "Democratic showdown on the border\nSpats within the GOP have generated more headlines this year, but the Democratic primaries have had their own fights over the direction of the party.",
    "There were fewer opportunities for him to mend fences with conservatives, who remain angry over his refusal to overturn the presidential election, which Trump has cast as a betrayal.",
    "Bourdeauxs current seat more closely aligns with the new district lines, while McBath has a more national profile because of her gun safety activism after her son Jordan was killed.",
    "Trump may have more luck in ousting Republican Secretary of State Brad Raffensperger, who is locked in a tight race with Rep. Jody Hice, a vocal proponent of 2020 election lies.",
    "Walker, best known for his Heisman Trophy-winning days at University of Georgia and subsequent NFL career, got an early nod from Trump, his former Celebrity Apprentice mentor.",
    "But Trump rescinded his support in March, complaining the congressman had gone woke because he acknowledged there was no pathway to immediately reinstate Trump as president.",
    "The counties surrounding Atlanta have been diversifying and increasingly electing Democrats, including Rep. Lucy McBath in 2018 and Rep. Carolyn Bourdeaux two years later.",
    "But the headwinds are far stiffer for Democrats this year; early polls have shown Kemp with an advantage, although their head-to-head matchup has not yet begun in earnest.",
    "With Democrats openly fretting about how to appeal to moderates, as well as about their slipping numbers among Latinos, theyre closely watching the outcome in Texas.",
    "Their primaries have been relatively quiet, but Tuesdays election puts Georgia one step closer to a blockbuster general election featuring these national figures.",
    "The battle reflects the new redistricting reality: In starkly partisan districts, the real contest is between members of the same party, not the general election.",
    "Abrams profile has only grown since her narrow loss four years ago, especially as the fruits of her years of organizing helped turn Georgia blue in 2020.",
    "He also won over Senate GOP Leader Mitch McConnell, who was impressed enough by Walkers fundraising ability to put aside concerns about his electability.",
    "A poll last month by the Atlanta Journal-Constitution found Raffensperger and Hice nearly tied; a substantial portion of the voters remained undecided.",
    "Republicans, meanwhile, have raised scrutiny of Warnocks custody battle with his ex-wife, a sign that both sides are girding for a bruising election.",
    "An April Morning Consult poll found that half of all Georgia voters, including 76% of the states Republicans, thought Kemp was doing a good job.",
    "But Republicans controlled the redistricting process last year, and they redrew one suburban district to ensure it would tilt more solidly red.",
    "An election grudge down-ballot\nThe advantages of incumbency dont go as far for Raffensperger in his reelection bid for secretary of state.",
    "Perdue, meanwhile, has found little momentum in his main election issue: asserting falsely that Trump won the 2020 presidential race.",
    "Setting the stage for November\nHows this for an attention-getting trifecta: Stacey Abrams, Herschel Walker, Sen. Raphael Warnock.",
    "The first Black senator elected from Georgia, Warnock is the top fundraiser in Congress as he strives to win his first full term.",
    "Cuellar narrowly outpaced Cisneros in their March matchup, but neither candidate got enough votes to avoid Tuesdays runoff.",
    "But the contrasts sharpened even further after the leak of a draft Supreme Court decision that would overturn Roe vs. Wade.",
    "Abrams, the presumed Democratic nominee for governor, is preparing for a rematch of her 2018 campaign against Kemp.",
    "He spent the closing days not claiming he would win, but only that he was not losing as badly as polls suggest.",
    "But recent polls show that Brooks campaign may still have life in it  at least enough to make it into a runoff.",
    "Raffensperger, like Kemp and other statewide candidates, must win more than 50% of the vote to avoid a runoff.",
    "The race for U.S. Senate will probably pit a Georgia football legend against the states political trailblazer.",
    "Cuellar, one of the few antiabortion members left in the party, was soon blasted by Cisneros for his position.",
    "Brooks, an ardent 2020 election denier, won Trumps backing nearly a year before Alabamians went to the polls.",
    "Former President Trump has eagerly injected himself into nearly every major Republican primary battle so far.",
    "Battle in the burbs\nGeorgia would have not become a hotly contested swing state if not for the suburbs.",
    "Should he win, he would oversee the election administration in a pivotal 2024 battleground.",
    "Brian Kemps challenger, former Sen. David Perdue, and donated millions to prop up his pick.",
    "The race had long been seen as a face-off between the poles of the Democratic Party.",
    "Instead, Kemp has proved its possible to win over Trump loyalists without Trump.",
    "That left the two incumbent Democrats vying for the other, bluer seat.",
    "Whoever emerges as the winner will be the heavy favorite in November.",
    "But he has a special incentive for the effort hes exerted in Georgia.",
    "But polls indicate Perdue may be headed to an embarrassing defeat.",
    "A third Democrat, state Rep. Donna McLeod, is also in contention.",
    "The power of being an incumbent governor has been key.",
    "The former president personally recruited GOP Gov.",
    "Heres what you need to know."
  ]
}