{
  "id": 7474,
  "mediaId": 1164,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia governor, Senate races highlight primaries in 5 states",
  "image": "https://cdnph.upi.com/svc/sv/upi/5521653405406/2022/1/51cb69e155a9e8517e0cf607638a1152/Georgia-governor-Senate-races-highlight-primaries-in-5-states.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/05/24/Georgia-Brian-Kemp-David-Perdue-Trump-Herschel-Walker/5521653405406/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clyde Hughes",
  "authorUrl": "https://www.upi.com/author/Clyde-Hughes/",
  "termIds": [
    815,
    1078,
    1136,
    1147,
    1434,
    1951,
    2095,
    2150,
    571,
    2672
  ],
  "sentences": [
    "May 24 (UPI) -- High-profile primaries and runoffs dot the election map on Tuesday where candidates endorsed by former President Donald Trump and former Vice President Mike Pence go head-to-head in Georgia.",
    "In Alabama, Republican Rep. Mo Brooks is trying to win his party's nomination for Richard Shelby's Senate seat, but he is locked in a tight race with Army veteran and business executive Mike Durant.",
    "In the Georgia U.S. Senate race, former NFL star Herschel Walker, who is backed by Trump, is expected to handily win, setting up a showdown with current Democratic Sen. Raphael Warnock.",
    "In Arkansas, former White House press secretary Sarah Huckabee Sanders will take the first step in following in her father's footsteps in the Republican primary governor's race there.",
    "Minnesota will hold the Democratic and Republican special election primaries to fill the seat of the late Rep. Jim Hagedorn, who died earlier this year from cancer.",
    "A Real Clear Politics polling average released Sunday showed Kemp with a comfortable 22 percentage point lead (56% to 34%) going into Tuesday's election.",
    "On the Democratic side, moderate Rep. Henry Cuellar will be fighting to keep his South Texas seat against progressive attorney Jessica Cisneros.",
    "Controversial Texas Attorney General Ken Paxton will be trying to keep his seat against George P. Bush, the state's current land commissioner.",
    "Brian Kemp, who won the endorsement of Pence, is fending off a challenge from former U.S. Sen. David Perdue, who is backed by Trump.",
    "For the ex-president, the race amounts to political payback for Kemp not backing his claims of voter fraud in Georgia.",
    "If Kemp wins, it would be a rematch of a contentious 2018 Georgia gubernatorial race where Kemp edged out Abrams.",
    "Two contested primary runoffs -- one Republican and one Democrat -- will be closely watched in Texas.",
    "Her father Mike Huckabee served as Arkansas governor from 1996 to 2007 and ran for president.",
    "The campaign is a rematch from 2020, where Cisneros showed gains during the earlier primary.",
    "Purdue, who lost his Senate seat in 2000 to Democrat Jon Ossoff, has trailed in the polls.",
    "Bush is a member of the Bush political dynasty as the son of former Florida Gov.",
    "She is expected to beat the field, leading her to the November general election.",
    "The seat is also a target for Republicans to flip in the general election.",
    "The winner will take on Democrat Stacy Abrams, who is running unopposed.",
    "Jeb Bush and grandson of former President George H.W.",
    "In the Peach State, incumbent Gov.",
    "Bush."
  ]
}