{
  "id": 7476,
  "mediaId": 188,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia Gov. Brian Kemp defeats Trump-backed David Perdue in Peach State gubernatorial primary; Kemp will face off against Democrat Stacey Abrams during the general election",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTg0NzM2Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwODM4NDY4N30.Lix89C8sooyh_6009JHzzhdUf6FbczFpzFHFmXw_VAU/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C107&height=700",
  "link": "https://www.theblaze.com/news/kemp-wins-gop-gubernatorial-primary",
  "sentiment": "0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Brian Kemp defeated former U.S. Sen. David Perdue in the Peach State's GOP gubernatorial primary contest on Tuesday  the Associated Press has called the race for Kemp, which marks a blow to former President Donald Trump who had backed Perdue.",
    "Former NFL player Herschel Walker, another Trump-backed candidate, secured victory in the Republican primary for U.S. Senate in Georgia, according to an AP race call, and will now go up against Democratic Sen. Raphael Warnock.",
    "The poll also found that 56% think that high gas prices are more due to issues beyond Biden's control, while 44% think that the high prices are more due to the president's policies.",
    "Perdue, who lost a U.S. Senate runoff election to Democrat Jon Ossoff last year, said that he will back Kemp in order to ensure that Abrams does not become the state's governor.",
    "Americans have been getting walloped by roaring inflation and watching gas prices soar  as of Tuesday, the AAA national average price for a gallon of gas has reached $4.598.",
    "The Georgia governor will now go on to face Democrat Stacey Abrams in a political rematch after narrowly defeating her during Georgia's 2018 governor's race.",
    "And in Arkansas, former Trump press secretary Sarah Huckabee Sanders won the GOP gubernatorial primary  Sanders is the daughter of former Arkansas Gov.",
    "Democrats could face significant headwinds during the 2022 midterm election cycle  President Joe Biden continues to face poor job approval ratings.",
    "A recent AP-NORC poll of adults found that 67% disapprove of how the president is dealing with the economy, while just 33% approve.",
    "Warnock entered office in 2021 after winning a special runoff election and is now seeking a full six-year term.",
    "Republican Rep. Marjorie Taylor Greene of Georgia won in her primary on Tuesday, according to the AP.",
    "Former Vice President Mike Pence, who served alongside Trump, had supported Kemp.",
    "Mike Huckabee.",
    "Georgia Gov."
  ]
}