{
  "id": 7501,
  "mediaId": 25,
  "date": "d2022-05-23T00:00",
  "headline": "Georgia primary pits Pence-endorsed Brian Kemp against Trump-backed David Perdue",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/23/98d53f22-567f-4fe3-81e3-2a68dcc57bb8/thumbnail/620x390/44e17c381a2b1b37826b73b22e6392fe/perdue-kemp-georgia-primary.jpg",
  "link": "https://www.cbsnews.com/news/georgia-primary-governors-race-brian-kemp-david-perdue-donald-trump-mike-pence/",
  "sentiment": "-0.245",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster, Aaron Navarro",
  "authorUrl": "",
  "termIds": [
    815,
    1136,
    1147,
    1434,
    1874,
    2095,
    2203,
    4325,
    2672
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Georgia primary pits Pence-endorsed Kemp against Trump-backed Perdue\n Only House Democrat who doesn't support abortion rights faces challenger\n Pennsylvania's John Fetterman released from hospital after stroke\n Rep. Hakeem Jeffries \"very confident\" Democrats will hold onto majority\n Pennsylvania, North Carolina, Kentucky, Idaho and Oregon primary results\n More\nIn:\nGeorgia\n Adam Brewster\nCBS News political reporter.",
    "\"Anybody who has put their hands on women like he has and has been unaccountable, has not taken responsibility for his actions  says he wrote a book, but then he won't come clean on the rest of it  he hasn't earned my vote,\" Black told the Atlanta Journal-Constitution.",
    "Joe Raedle/Getty Images, Joe Raedle/Getty Images\nPerdue passed on running for the Senate in February 2021 to face Warnock, but jumped into the governor's race in December, saying that Republicans were \"divided\" because of Kemp and Secretary of State Brad Raffensperger.",
    "U.S. House Races\nDemocrats Carolyn Bourdeaux and Lucy McBath were gerrymandered into the same Atlanta suburbs district during redistricting, and will be the first Democratic incumbent vs. incumbent matchup this cycle.",
    "Since the 2020 election, former President Donald Trump has been eager to oust Georgia Governor Brian Kemp and Secretary of State Brad Raffensperger for blocking efforts to overturn the 2020 election in the state.",
    "Raffensperger told CBS News he understands that there are voters who are looking to see what this race says about Trump's influence and whether Republicans who certified 2020 election results will be punished.",
    "Kemp has been highlighting other legislative victories, including laws that would ban abortions about six weeks into a pregancy and allow guns to be carried in public without a license or background check.",
    "On the Democratic side, state Representative Bee Nguyen, former state Rep. Dee Hawkins-Haigler and former Cobb County Democratic Party chair Michael Owens are among those seeking their party's nomination.",
    "In an interview with Axios, Waker denied allegations of threatening behavior by two other women in 2002 and 2012 and, regarding his ex-wife, said \"I'm always accountable to whatever I've ever done.\"",
    "There was record turnout during the early in-person voting, according to the Georgia Secretary of State's office, with more than 480,000 Republican ballots already cast ahead of Tuesday's election.",
    "\"I'm going to be in a year and a half and I'm going to be campaigning against your governor and your crazy secretary of state,\" Trump told a crowd in Dalton, Georgia, receiving thunderous applause.",
    "An Associated Press story from July 2021 detailed Walker's turbulent history, including his ex-wife securing a protective order against him in 2005, alleging a violent and controlling behavior.",
    "Amid the record turnout, it appears there have been crossover voters, and CBS News estimates that about 35,000 GOP ballots were cast by people who voted in the Democratic primary in 2020.",
    "Hice was among the dozens of Congressional Republicans who objected to the election results in Arizona and Pennsylvania on Jan. 6 when Congress was counting the Electoral College votes.",
    "Opponents have highlighted how Bourdeaux was part of a small group of House Democrats that looked to derail the joint passage of the infrastructure bill and the Build Back Better plan.",
    "Trump blamed Kemp for not doing enough to help the efforts to change the outcome in Georgia, and on the eve of two key Senate runoff elections in January 2021, pledged to seek revenge.",
    "Kemp has pitched to voters that he has a strong record on this issue because he helped lower the income tax and suspended the gas tax through May 31, amid the current high prices.",
    "National Republicans will be keeping an eye on the GOP primary in Georgia's 2nd District, where six candidates are looking to challenge Democrat Sanford Bishop in November.",
    "National Republicans will be keeping an eye on the GOP primary in Georgia's 2nd District, where six candidates are looking to challenge Democrat Sanford Bishop in November.",
    "Here are the major races to watch:\nGeorgia governor\nGeorgia Governor Brian Kemp has been one of Trump's top GOP targets since the former president lost the 2020 election.",
    "In northwest Georgia, Republican Marjorie Taylor Greene is facing five Republican primary challengers who want to oust the controversial first-term Congresswoman.",
    "Strahan has been backed by Senator Bill Cassidy of Louisiana, as well as the business PACs for Home Depot and UPS, which both have headquarters based in Atlanta.",
    "While Republicans in Washington and the former president have rallied behind Walker, his opponents have raised concerns that his past will haunt him in November.",
    "Georgia Agriculture Commissioner Gary Black, veteran Kelvin King and former Navy SEAL and Trump administration official Latham Saddler are also in the field.",
    "Georgia secretary of state\nOne of Trump's other top targets during this primary season is incumbent Republican Georgia Secretary of State Brad Raffensperger.",
    "Fast forward to May 2022, and Kemp is facing a Trump-backed challenger, former Senator David Perdue, who lost his Senate seat in the Jan. 5 runoff election.",
    "Both have run campaigns in competitive seats, Bourdeaux was the only Democrat to flip a Republican-held seat in 2020, and have a very similar voting record.",
    "Jennifer Strahan, who runs a healthcare consulting firm, is the lead candidate against Greene, with Strahan arguing Greene is ineffective for the district.",
    "\"We may not win Tuesday, but I guaran-damn-tee you that we are not down 30 points,\" Perdue told reporters on Thursday night, when asked about the Fox poll.",
    "I worked hard for both our United States senators and our whole Republican ticket up and down the ballot in the middle of a global pandemic, I might add.",
    "Her move to the district was criticized by Bourdeaux at a May 1 debate, as Bourdeaux has claimed McBath has given up fighting for her old district.",
    "Bishop's margins of victory have shrunk over the years and the redistricting has kept the southwest district vulnerable to Republican control.",
    "Bishop's margins of victory have shrunk over the years and the redistricting has kept the southwest district vulnerable to Republican control.",
    "Trump on Friday reaffirmed his support for Perdue in a post on Truth Social, after reporting from NBC suggested Trump had given up on Perdue.",
    "Voters in five states are heading to the polls for primaries on Tuesday, but the key races to watch are in the battleground state of Georgia.",
    "\"Desperate to chase his lost relevance, Pence is parachuting in to races, hoping someone is paying attention,\" Budowich said in a statement.",
    "\"Gary's upset and I know he's upset, so I told Gary 'whenever you want to sit down and talk, we can talk,'\" Walker told reporters last week.",
    "\"I certainly have no regrets, nor will I ever, for following the laws and constitution of this state,\" Kemp said at their second debate.",
    "During redistricting, the 6th District was turned into a heavily Republican seat, and a portion was included into the new 7th District.",
    "This week, the Georgia State Election Board voted unanimously to dismiss claims that some voters illegally returned absentee ballots.",
    "\"You see, David wants to go back and talk about the past because he doesn't have a record to win the future,\" Kemp said at a debate.",
    "He has repeated that false claim on the campaign trail, including a campaign stop with Rep. Marjorie Taylor Greene on Friday night.",
    "Former star Georgia running back Herschel Walker has led the Republican field since he entered the race with Trump's encouragement.",
    "She said in a debate that House Minority Leader Kevin McCarthy would put her back on committees if Republicans take back the House.",
    "McBath, a noted activist against gun violence after her son was killed in 2012, has represented Georgia's 6th District since 2018.",
    "Voters will also decide on incumbent Democratic Senator Raphael Warnock's Republican opponent in one of the key U.S. Senate races.",
    "Trump went to Georgia in March to rally for Perdue and other endorsed candidates, but hasn't returned to the state since then.",
    "Kemp has also received help from the Republican Governors' Association, which spent $5 million helping the incumbent governor.",
    "\"This past election was an absolute disaster under the leadership of Brad Raffensperger,\" Hice said at a debate in early May.",
    "Reporting from the Atlanta Journal-Constitution raised questions about some of Walker's claims about his success in business.",
    "His campaign blamed the media for running \"stories, stereotyping, attacking, and going so far as to question his diagnosis.\"",
    "In addition to Trump, Walker is backed by Republican leadership in Washington, including Minority Leader Mitch McConnell.",
    "Trump spokesperson Taylor Budowich claimed Trump \"salvaged\" Pence's political career and criticized Pence's involvement.",
    "Perdue's campaign believes that this turnout includes some non-traditional Republican primary voters and could help him.",
    "That law, which made sweeping changes to Georgia's election code, is one of Kemp's signature legislative achievements.",
    "Kemp, meanwhile, is going to be joined by Trump's former vice president, Mike Pence, on the campaign trail on Monday.",
    "Perdue declared at a debate that the \"worst mistake I ever made was getting Donald Trump's endorsement for this man.\"",
    "In his opening remarks at the first debate, he falsely asserted that \"the election in 2020 was rigged and stolen.\"",
    "There are two other candidates in the race, former judge T.J. Hudson and former Alpharetta mayor David Belle Isle.",
    "\"I am with David all the way because Brian Kemp was the WORST Governor in the Country on Election Integrity!\"",
    "In January 2021, Trump called Raffensperger and asked him to \"find\" enough votes to give the state to Trump.",
    "Raffensperger rebuffed Trump's efforts to try to get Raffensperger to overturn Georgia's election results.",
    "The winner of the gubernatorial race will face Democratic candidate Stacey Abrams in the general election.",
    "Another story from the Associated Press examined police records from a 2001 incident at his home in Texas.",
    "\"Everything we have worked for, you are undermining by coming over and fighting me here,\" Bourdeaux said.",
    "Senate\nRepublicans are looking at Georgia as one of their best opportunities to flip a U.S. Senate seat.",
    "A recent Fox News poll showed Walker leading the race with 66% of the vote, followed by Black with 8%.",
    "\"Congressman Jody Hice has been in Congress seven years now, and this is what he's done on elections?\"",
    "Greene was taken off her House Committees last year due to conspiracy theories shared on social media.",
    "Warnock has raised $47.6 million during the current election cycle and is sitting on $22.9 million.",
    "Walker has been open about his struggles with mental illness and dissociative identity disorder.",
    "Raffensperger accused Hice of spreading \"misinformation and disinformation\" at a debate in May.",
    "If neither candidate receives 50% of the vote, the race will go to a runoff election in June.",
    "President Biden's victory in Georgia was affirmed by three separate tallies of the votes.",
    "\"I've had a great relationship with Mike Pence,\" Kemp told reporters on Monday morning.",
    "It wasn't gonna happen,\" Raffensperger told 60 Minutes days after receiving that call.",
    "Whichever candidate prevails will face Democratic Senator Raphael Warnock in November.",
    "\"I guess maybe they were just trying to intimidate me and-- cajole me into something.",
    "There has been no credible evidence of widespread fraud that impacted the election.",
    "\"The big lie in all of this is that there were no problems in this past election.\"",
    "A key part of Perdue's campaign has been the false claim that the 2020 was stolen.",
    "\"There's nothing wrong with saying that, you know, um, that you've recalculated.\"",
    "A candidate needs to win a majority of votes in order to avoid a runoff election.",
    "On the campaign trail last week, he attacked Hice over his record in Congress.",
    "One of his opponents, Gary Black, said he won't support Walker in the general.",
    "Walker's candidacy, however, has come with significant scrutiny of his past.",
    "\"That's why from day one, I said truth matters, integrity counts,\" he said.",
    "Walker told Axios that he considers himself \"best friends\" with her today.",
    "\"I'm going to win the Republican side, he knows it, he's upset about it.\"",
    "One of Perdue's signature proposals is to eliminate the state income tax.",
    "But, you know, when we didn't win, I was as frustrated as anyone else.",
    "Because we won the state,\" Trump said on the call, which was recorded.",
    "A Fox News poll released last week showed Kemp leading Perdue 60%-28%.",
    "Trump endorsed Kemp in 2018, helping Kemp win the Republican primary.",
    "And we passed the strongest Election Integrity Act in the country.\"",
    "Trump endorsed Rep. Jody Hice in the primary against Raffensperger.",
    "I just want to find 11,780 votes, which is one more than we have.",
    "He is scheduled to hold a tele-rally for Perdue on Monday night.",
    "Kemp has fiercely defended his role after the election.",
    "Kemp has slammed Perdue's focus on the 2020 election.",
    "Kemp defeated Abrams in the 2018 governor's race.",
    "\"I had a great relationship with President Trump.",
    "Raffensperger asked, before taking a long pause.",
    "Walker's campaign defended his business record.",
    "And that's something that I can't control.\"",
    "I've never said anything bad about him.",
    "\"I worked hard for President Trump.",
    "The campaign has been bitter.",
    "I think he's just mad at me.",
    "David Perdue and Brian Kemp.",
    "I don't plan on doing that.",
    "\"All I want to do is this.",
    "\"That's right, nothing.\"",
    "I'm not mad at him.",
    "Trump wrote.",
    "Twitter"
  ]
}