{
  "id": 8105,
  "mediaId": 12,
  "date": "d2022-02-26T13:00",
  "headline": "Ukraine could refocus debates in Georgia midterm races",
  "image": "https://www.ajc.com/resizer/G7RpaaVHAygRSerhz562jpu7Dzg=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/C5W53HNPVCW6UXF7ZSGLPE5GRQ.jpg",
  "link": "https://www.ajc.com/politics/ukraine-could-reshape-debates-in-georgia-midterm-races/QAFQMJ66J5DIPDT3X2X3Z5YM5E/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    2040,
    2087,
    2095,
    4325,
    4576,
    428,
    2672,
    2942,
    2945
  ],
  "sentences": [
    "But they also serve as a reminder that though foreign policy is the province of federal politicians, the European war will also influence statewide races, as candidates grapple with domestic inflation, energy price shocks and an off-kilter economy.",
    "Days before the invasion, Democratic U.S. Sen. Raphael Warnock visited a Sandy Springs gas station to tout a proposal to temporarily suspend federal fuel taxes to help Georgians in an everyday struggle to return to a sense of normalcy.",
    "The United States must continue to stand with Ukraine, he said, adding that he supports severe sanctions on Russia to compel President Putin to cease this catastrophic effort and to hold him and his allies accountable.",
    "The Russian invasion of Ukraine has focused attention on foreign policy ahead of Georgias midterm elections, shifting the political debate toward global affairs that commanded little attention in recent state contests.",
    "None of the top GOP candidates for higher office in Georgia has taken a staunchly isolationist stance or expressed the pro-Putin views of some on the partys right flank who have parroted Russian talking points.",
    "Each of Georgias Trump-endorsed candidates  a quintet that includes Perdue and GOP U.S. Senate front-runner Herschel Walker  declined to comment on the former presidents glowing words about the Russian leader.",
    "In the days after the invasion, Georgia Republicans have criticized President Joe Biden for failing to stop the European war and, in some cases, claimed that Donald Trump could have averted the crisis.",
    "The differing reactions underscored how Republicans remain divided by Trump, who has praised Putin as savvy and genius for orchestrating Europes most significant foreign policy crisis in generations.",
    "The Democrat, seeking a full six-year term in November, joined many of his congressional colleagues this week in backing U.S. military aid to Ukraine and new efforts to punish Russias economy.",
    "Putins military aggression requires NATO urgently to revitalize its collective strength while we reaffirm our absolute commitment to mutual defense for every NATO member, the Democrat said.",
    "Instead, Georgia Republicans have generally blamed the Biden administration for not instituting harsher economic penalties before the invasion as they condemned Putin in unequivocal terms.",
    "The twin U.S. Senate races in 2020 hinged on domestic affairs, pivoting only to global events during political attacks involving perceived ties to China or level of support for Israel.",
    "Some Republicans, particularly those endorsed by Trump, have said the former president would have averted the war in spite of his friendly ties to Putin and his efforts to weaken NATO.",
    "But the Russian attack put global affairs front and center, at least temporarily pivoting attention away from domestic policies and toward complex diplomatic and military decisions.",
    "With the May 24 primaries looming, analysts say Russias belligerence is likely to deepen the political divide between rival candidates rather than create a fresh unifying moment.",
    "When you throw away peace through strength, this is what you get: unnecessary war, said Latham Saddler, a former Navy SEAL and Republican contender for the U.S. Senate.",
    "Action and strength\nDemocrats find themselves under new pressure from GOP opponents who have long blamed Biden for higher energy prices and scarcity of household items.",
    "The governor withheld criticism of Bidens approach as he denounced the invasion, instead calling for a quick end to the fighting and the defeat of democracys enemies.",
    "John Porter, an adviser to Republican Butch Millers bid for lieutenant governor, said voters could weigh each candidates maturity and competencies more than ever.",
    "This is nothing but a bully  Putin  taking advantage of a weak president, Republican gubernatorial hopeful David Perdue told a conservative talk radio station.",
    "But this is going to be a very emotional issue, and Georgians are going to get scared, said Leo Smith, a political strategist and former state GOP official.",
    "Vladimir Putin is an evil man desperately resurrecting an evil empire, said U.S. Rep. Jody Hice, who is running for secretary of state with Trumps blessing.",
    "At a campaign stop in Dahlonega earlier this week, Walker blasted Bidens weak response to Russia and later faulted the presidents disastrous foreign policy.",
    "We need to take a hard look in the mirror and see what mistakes were made and correct them immediately, the former football standout said.",
    "Some predict the burgeoning European conflict could mean less attention to the culture wars legislation designed to energize the GOP base.",
    "Many have embraced Bidens call for meting out stifling sanctions on Russia and his decision to deploy more U.S. troops to Eastern Europe.",
    "Were talking cyberattacks against critical infrastructure, fragile global markets and protracted warfare resulting in the loss of lives.",
    "Perdue didnt explain why he considered Biden weak or why it wouldnt have happened under Trump, who endorsed him in his race against Gov.",
    "But theyre also facing new pressure to stem economic aftershocks that have already disrupted global markets and sent oil prices rising.",
    "Warnocks Republican opponents are all over the map with their response  though they are united in assailing the White Houses strategy.",
    "U.S. Sen. Jon Ossoff, who called the trans-Atlantic alliance vital and inviolable, said now is the time to strengthen the coalition.",
    "State Democrats, meanwhile, have mixed their defense of the administrations approach with pledges to bolster U.S. ties with Europe.",
    "The only thing Putin understands is action and strength  neither of which President Biden has shown to us, our allies or Russia.",
    "Some campaigns also expect the global challenges to boost the prospects of candidates with more experience in public office.",
    "Were not talking about gender-neutral bathrooms or being canceled on TikTok, said Porter, the GOP adviser.",
    "When foreign relations came up in 2018, it mostly involved promises to crack down on illegal immigration.",
    "He also said he was preparing Georgias defenses against likely cyberattacks from Russia-aligned hackers.",
    "And some have praised the unified response from NATO, which Trump had long criticized as ineffective.",
    "A bully\nThe attention on overseas affairs marks a sharp contrast to past elections in Georgia.",
    "People hope at a time like this, candidates get into a kumbaya mode and rally around the flag.",
    "Kelvin King, a military veteran, said the U.S. must now flex its military and economic might.",
    "Agriculture Commissioner Gary Black warned of $5 gas and further diminished global stature.",
    "His lesser-known rivals are also trying to channel conservative angst.",
    "Still, several split with the president by clearly rebuking Putin.",
    "It will be hard for politicians to operate in a bipartisan spirit.",
    "This wouldnt have happened with Donald Trump as president.",
    "Rival Georgia politicians have found some common ground.",
    "But he also cast a wider net with his criticism.",
    "The time for words is gone, he said.",
    "He will not stop with Ukraine.",
    "Thats the reality, Smith said.",
    "Russia has got to be stopped.",
    "Make no mistake.",
    "Unnecessary war?",
    "Brian Kemp."
  ]
}