{
  "id": 8108,
  "mediaId": 12,
  "date": "d2022-02-25T12:00",
  "headline": "OPINION: The good, the bad, and the un-American in the response to the Ukraine crisis",
  "image": "https://www.ajc.com/resizer/7oaBRwYYlqIILYPeAngz-WHP2fg=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/GKCXN7QBIQSJHVAL7CREC7I7EI.jpg",
  "link": "https://www.ajc.com/politics/opinion-the-good-the-bad-and-the-un-american-in-the-response-to-the-crisis-in-ukraine/XBO5IDZDYVAHFH6LQEITYLH3DI/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia Murphy",
  "authorUrl": "https://www.ajc.com/staff/patricia-murphy/",
  "termIds": [
    815,
    1821,
    2030,
    2087,
    2095,
    5935,
    5622,
    2672,
    2888,
    2942
  ],
  "sentences": [
    "Georgias two U.S. senators, both Democrats just a year into their jobs, were each in Georgia for the congressional recess this week as the events unfolded and prepared Thursday for an all-senators briefing from the State Department on the state of play following Russias initial assault.",
    "Although a governor isnt the first person you think of when one country invades another, Kemp oversees the Georgia National Guard and the Air National Guard, which have been tasked repeatedly with overseas military deployments over the last two decades.",
    "But unlike the days after the attacks on 9-11, when Americans united against our outside dangers, the reactions to the news out of Ukraine this week have ranged from sober and responsible to worrisome and even reprehensible.",
    "At the very moment Russian troops were invading Ukraine Wednesday night, Donald Trump told cheering donors at his Magapallooza fundraiser, This would never have happened if the election werent rigged.",
    "Like a chorus, the politicians who feed off of Trumps supporters for their own survival echoed Trumps words, criticizing only the American president  never Putin  for the advancing Russian troops.",
    "As Putin and the Russian army violate Ukraines sovereignty through this callous, indefensible invasion, we stand with our allies and condemn this aggression of tyrants, Kemp wrote in a statement.",
    "Everything happening to the poor people of Ukraine is a direct result of a WEAK America under the WEAK leadership of Joe Biden, Rep. Majorie Taylor Greene wrote as part of a lengthy statement.",
    "For Kemp it was a moment of leadership where it wasnt necessarily required, and it set the tone, especially in Georgia, that Putin is the enemy in this scenario, not President Joe Biden.",
    "The governor said he was cognizant of Georgias servicemembers, who would go to heightened alert, and praying for the safety of Ukrainians and all who fight for liberty around the world.",
    "Warnock had voted earlier for a bill from Ted Cruz that would have imposed sanctions on Nord Stream 2, the company building a pipeline to deliver Russian natural gas to Germany.",
    "Government officials I spoke with warned that the weeks ahead could see a spike in global gas prices, food shortages, and supply chain and trade disruptions that only intensify.",
    "An unrestrained Vladimir Putin atop a nuclear-armed Russia, invading the second-largest country in Europe, is fulfilling the Wests worst nightmares of the post-Cold War era.",
    "While that sounds esoteric when youre watching from home, the role gives Scott unique visibility into the rather terrifying issues that could spin off of this crisis.",
    "Buddy Carter, a Republican from Pooler, also hammered Putin, calling him the enemy of freedom, and asked Biden to fulfill his duty as commander in chief.",
    "Likewise, former Sen. David Perdue called Biden weak and told a local radio station, This wouldnt have happened with Donald Trump as president.",
    "Its hard to overstate how dangerous this moment is to the entire world order, which has been more or less stable since the end of World War II.",
    "And on Wednesday night, with Russias invasion of Ukraine, the world saw a moment that felt like it could be the start of the worst of times.",
    "More to the point, the threat of further incursions into Europe, including NATO allies, is more real than any other time since World War II.",
    "Warnocks team was in touch with the Defense Department to learn which Georgia additional units might be activated to support NATO allies.",
    "His middle Georgia district includes Robins Air Force Base and hes a senior Republican member of the House Armed Services Committee.",
    "But some days remind you that the whole point of politics is to elect sound leaders capable of seeing us through the worst of times.",
    "When he returned from Belgium, he said in a statement he was disgusted by the unnecessary loss of life because of Putins actions.",
    "Scott will be a key figure to watch and another one whose approach to Russia has been as serious as the new reality were facing.",
    "And were seeing in real-time who is up to the jobs they have and, in this campaign season, who is ready for the jobs they want.",
    "U.S. Rep. Austin Scott is likely to be one of the Georgians most directly engaged in the crisis over the next weeks and months.",
    "Innocent people are dead in Ukraine due to power-hungry Vladimir Putins obsession with recreating the former Soviet Union.",
    "And he and Ossoff both spoke out to support sanctions against Russia and condemn Putin in the strongest possible terms.",
    "Ironically, the fastest way to strengthen Bidens hand internationally would be for Americans to be united as a country.",
    "The congressman had just attended the NATO Parliamentary Assembly in Brussels as the invasion began Wednesday night.",
    "Carters vote of support for the president, even when hes disagreed with Biden in the past, was important to note.",
    "But no challenge to the United States externally may be as serious as the ones inside our own borders.",
    "Politicians reactions in a crisis can sometimes tell you more than youll learn in an entire campaign.",
    "One of the first to respond to the invasion came before dawn Thursday morning from Gov.",
    "As Biden urges NATO to put on a united front, were failing to do the same at home.",
    "The fundraiser was for House and Senate candidates, including Herschel Walker.",
    "The whos-up-whos-down, family-feud of it all often borders on the ridiculous.",
    "Under President Trump, America was STRONG and the world was at PEACE.",
    "Are they focused on their country, their party, or themselves?",
    "Is this person up to the job they have or say they want?",
    "Trump again praised Putin for his incursion to the west.",
    "Congress stands at the ready to support, Carter wrote.",
    "Hes taking over a country for $2 worth of sanctions.",
    "Politics can seem like a game most of the time.",
    "Crises have a way of revealing leadership.",
    "Id say thats pretty smart, Trump said.",
    "It was a totally rigged election.",
    "Are they substantive?",
    "Are they serious?",
    "Brian Kemp.",
    "Crucially.",
    "U.S. Rep."
  ]
}