{
  "id": 8168,
  "mediaId": 43,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "On Jan. 6 Vernon Jones switched parties. Trump's endorsing him for a Congressional seat in Georgia",
  "image": "https://images.dailykos.com/images/1036393/story_image/GettyImages-1268366935.jpg?1644502618",
  "link": "https://www.dailykos.com/story/2022/2/10/2079594/-On-Jan-6-Vernon-Jones-switched-parties-Trump-s-endorsing-him-for-Congressional-seat-in-Georgia",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Hes been a Democrat for decades, but his hunger for power has obviously overtaken his hunger for reality, and with failed former President Donald Trumps blessing, he bolted from his gubernatorial race against Brian Kemp to try his hand at the 10th Congressional District race in Dekalba district he doesnt even live in.",
    "The Gateway Pundit reports that Michael Flynn, the disgraced former general who was forced to resign his position as national security adviser to Trump after being caught lying to the FBI about his (many) contacts with Russia, withdrew his support of Collins Wednesday in favor of Jones.",
    "His political career has been a hot mess of controversies and criticism, from campaign contribution violations to accusations of threats, bullying, and a rape accusation in 2005 when he served as the DeKalb County chief executive officer.",
    "Hice is challenging Secretary of State Brad Raffensperger, who also has Trumps support, as does another GOP-er with a long history of violence against women: Herschel Walker for Senate.",
    "Despite a recent poll by The Atlanta Journal-Constitution indicating that love for Trump among Georgia Republicans is starting to fade, Jones rivals arent taking him lightly.",
    "Collins campaign began running ads calling Jones scandal-plagued, saying hes been a Democrat since 1990, and: Hes a lot of things: Conman, charlatan, chameleon, criminal.",
    "But he officially switched parties on Jan. 6, just before the domestic terrorist insurrection on the U.S. Capitol and after the election of Democrats Rev.",
    "x\nIm proud to have President Trumps endorsement, confidence and support as I seek to represent the people of Georgias 10th Congressional District.",
    "Sen. Burt Jones was benighted by Trump for lieutenant governor and of course, David Perdue is Trumps pick for governor over his archenemy Kemp.",
    "pic.twitter.com/lNXeC6Uucr\n Vernon Jones For Congress (@RepVernonJones) February 9, 2022\nThe left has taken this country too far to the left.",
    "Most of the local GOP-ers have thrown their support behind Mike Collins, a MAGA bootlicker who lost to Rep. Jody Hice by a narrow margin.",
    "The twice-impeached president gave a glowing two (tiny) thumbs up to Jones Wednesday, calling Jones a special person, and true patriot.",
    "Raphael Warnock and Jon Ossoff, which was a victory that owed a great deal of debt to voters in DeKalb Countyparticularly Black voters.",
    "The 10th Congressional District is mostly white (64%) with a Black population of about 25%, and it went largely for Trump in 2020.",
    "Those people have values like mine, conservative values, faith-based, hardworking, entrepreneurial spirit, things of that nature.",
    "Id like to just leave it at that, but like so many in the Trump world, Jones is now a contender in an important race in Georgia.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "But like many midterms around the nation, the question is how much weight Trumps endorsement will hold.",
    "Moments ago, I announced that I am officially joining the Republican Party, Jones said on Twitter.",
    "Its a cast of characters as diverse and disgusting as any of Trumps picks have historically been.",
    "Now more than ever, the Republican Party is in desperate need of leaders that know how to fight.",
    "So what better party for the self-proclaimed Black MAGA man to join than the GOPs Trumpverse?",
    "Thats why I identify with the 10th Congressional District, Jones said on Fox this week.",
    "Dekalb County has a population of 772,470, with 54% being Black and 34% being white.",
    "He started attending MAGA rallies and spoke at the Republican National Convention.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Flip Johns, a retiree who backs Collins, told the Atlanta Journal-Constitution.",
    "Jones joins a crowded field of almost a dozen other Republican candidates.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Jones is an excellent speaker, but hell say anything to get elected.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "10th District Congressional candidate in Georgia, Vernon Jones.",
    "The county has voted overwhelmingly Democrat (83%) since 2000.",
    "What good company to be in for a turncoat like Jones.",
    "Vernon Jones calls himself the Black Donald Trump.",
    "Jones began his political transformation in 2020.",
    "Its an uphill climb for Vernon Jones here.",
    "America First movement is alive and well!",
    "This is a short blurb about Daily Kos.",
    "He was a Democrat up until last year.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "The squad better get ready!",
    "Want to keep it that way?",
    "But hes no conservative.",
    "Daily Kos is different.",
    "How do we trust him?",
    "I know how to fight.",
    "Hes from DeKalb.",
    "Please read it."
  ]
}