{
  "id": 8218,
  "mediaId": 12,
  "date": "d2022-01-28T12:00",
  "headline": "Bidens sagging approval could haunt Georgia Democrats",
  "image": "https://www.ajc.com/resizer/3NMtg7B9CevCPK958DpwThVQ0Go=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/7G25O3U2G6P23ZBZUNO3OECVUQ.jpg",
  "link": "https://www.ajc.com/politics/bidens-sagging-approval-could-haunt-georgia-democrats/BLP66P66ONGKXB5C4IBTHOMSTY/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1063,
    1136,
    1147,
    1951,
    2087,
    2095,
    147,
    2555,
    2672
  ],
  "sentences": [
    "Interviews with left-leaning Georgia voters showed a sense of frustration with Biden to fulfill far-reaching campaign promises beyond the two big-ticket items that passed last year: a $1.9 trillion coronavirus relief package and a $1.2 trillion bipartisan infrastructure measure.",
    "State Sen. Jen Jordan, the leading Democratic candidate for attorney general, pointed out results from the poll that found Georgia voters overwhelmingly oppose new limits on abortion and a rollback of gun restrictions  both priorities of Republican politicians.",
    "Couple that with backlash from liberals upset at the grinding pace of his legislative agenda  some voting rights groups were so upset they boycotted his visit to Atlanta this month  and the presidents waning popularity poses a threat to state candidates.",
    "That helps explain why Republican candidates and their allies are targeting their message to middle-of-the-road voters around all-things-Biden, whether it be his foreign policy decisions, his domestic agenda or fears of new coronavirus restrictions.",
    "The tenuous coalition of independent voters, former Republicans in the suburbs and Black Georgians who fueled Bidens flip of the state in 2020 is under duress as high inflation, legislative gridlock and frustration with his policies take a toll.",
    "President Joe Bidens honeymoon in Georgia is over, and that could have disastrous implications for Democrats scrambling to hang on to a U.S. Senate seat and win the governors race for the first time in almost a quarter century.",
    "Joe Biden is the 30,000-pound anchor in a bottomless pit of failure right now for Democrats in Georgia, said GOP operative Stephen Lawson, who advises a super PAC that has relentlessly tied U.S. Sen. Raphael Warnock to Biden.",
    "Garrett Snyder, an artist from Dunwoody who voted for Biden, said hes tired of the gridlock in Washington thats blocked the president, who campaigned as the ultimate congressional dealmaker, from achieving more of his agenda.",
    "The president has presided over the greatest economic recovery in a generation, hes about to appoint the first Black woman to the Supreme Court and hes worked with hardly any support from Republicans, Wilson said.",
    "Conservative voters are showing signs of unifying behind Walker, who has a commanding lead over GOP rivals in public polls and fundraising in a race to unseat Warnock that could decide control of the U.S. Senate.",
    "And looming in the background is a standing principle in American politics that the presidents party usually loses ground in midterm elections, though there are plenty of exceptions to the so-called curse.",
    "Unlike past election cycles, when leading party figures often found reasons to avoid a Democratic presidents visits to Georgia, statewide candidates are inextricably tying themselves to the White House.",
    "Brian Kemp is facing a tough GOP challenge from former U.S. Sen. David Perdue thats split the party and shifted the focus toward internal warfare and away from defeating Democrat Stacey Abrams.",
    "What alarms some top Democrats is the presidents declining popularity among independent voters, once a reliably Republican voting bloc in Georgia that moved to the left during Trumps term.",
    "And Georgia voters are increasingly fed up with former President Donald Trumps attempt to sway the states elections, even if many still believe his false narrative about a rigged vote.",
    "His support among Democrats and independents fell sharply, while his disapproval rating among Black voters  the backbone of the party in Georgia  has more than quadrupled since May.",
    "Nearly three of four Georgians feel the nation is headed down the wrong track, and almost 80% say inflation is having a significant or notable impact on their day-to-day lives.",
    "The AJC poll showed leading Republicans in a strong position against Abrams in her second run for governor and Warnock, who is standing for a full six-year term in November.",
    "Biden isnt on the ballot in November, Wilson added, but Im confident that voters will remember that Democrats are fighting for the pro-people policies of this president.",
    "Brian Michmerhuizen, a Spalding County retiree who describes himself as an independent, isnt pleased with Bidens tenure but has no love lost for Trump either.",
    "Abrams and Warnock are two of the nations most prominent Black political leaders, and both have built their careers on mobilizing marginalized Georgians.",
    "Herschel Walker, the former football star and GOP front-runner for the U.S. Senate, is an untested political candidate already dogged by his past.",
    "The gutter\nDemocratic officials arent particularly worried that Bidens sagging approval among Black voters will hurt the party in November.",
    "If we want a Republican in the White House in 24 and we want the Senate majority back in 22, we have to win the Senate in Georgia, he said.",
    "The programs that Biden put forth are the programs Georgians need badly, and Abrams and Warnock are no the forefront of fighting for them.",
    "To that point, just about every prominent Georgia Democratic official attended Bidens voting rights speech in Atlanta earlier this month.",
    "The glaring exception was Abrams, who cited an unspecified commitment she could not break but released a glowing statement about Biden.",
    "Its proven that hes a liar, and I cant imagine that the greatest country in the world really wants him to be at the head of it.",
    "Some 60% of independent voters disapprove of Biden, compared with 42% who had a dim view of the president in the AJCs May poll.",
    "Theres no way theyll distance themselves from him, said DuBose Porter, the former chair of the Democratic Party of Georgia.",
    "If Bidens numbers stay in the gutter, he said, you can bet the Republicans will make these races a referendum on him.",
    "Geoff Duncans top aide, offered a reminder of how Georgia Republicans overcame Trumps eroding approval in 2018.",
    "Kemp, for one, is as likely to slam Biden on the airwaves and the campaign trail as he would Abrams or Perdue.",
    "I thought there was going to be quick action on student loans, student debt and education policy, he said.",
    "In a speech this week to conservative evangelicals, he tied his reelection hopes directly to Bidens fate.",
    "Many of those Democrats sound like state Rep. Matthew Wilson, a candidate for insurance commissioner.",
    "Were still in the middle of a pandemic and people are hurting  and Bidens policies are helping.",
    "Bidens approval rating among registered voters plummeted from 51% in May to 34% this month.",
    "An Atlanta Journal-Constitution poll released this week punctuated that possibility.",
    "Promises made\nBut Democrats are determined to turn the president into an asset.",
    "Republicans, of course, have their own problems that Democrats can exploit.",
    "Some Republicans arent banking on Bidens popularity remaining in a ditch.",
    "Many voters also shared a more general disgust with national politicians.",
    "Democrats warn that doubling down on attacking Biden has its own risks.",
    "Staff writers Tia Mitchell and Mark Niesse contributed to this article.",
    "But theres also damage from the Trump era that needs to be repaired.",
    "Just as concerning for Democrats was the gloomy mood on the economy.",
    "Nearly two-thirds of Georgians now disapprove of his performance.",
    "There were a lot of promises made that still havent happened.",
    "That should get the attention of conservatives, Jordan said.",
    "Yet capitalizing on that Republican rift will be difficult.",
    "But, he added, the GOP is still in an enviable position.",
    "Im frustrated with how everything has become two-sided.",
    "Embedded in the poll are signs his alliance is fraying.",
    "John Porter, a GOP consultant who was Lt. Gov.",
    "But we also cannot lose this governors race.",
    "The man has some real moral issues, he said.",
    "Were moving in the right direction.",
    "Gov."
  ]
}