{
  "id": 8230,
  "mediaId": 19,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Poll: Herschel Walker Holds 3-Point lead over Warnock in Georgia Senate Race",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1235507269-640x480.jpg",
  "link": "https://www.breitbart.com/sports/2022/01/27/poll-herschel-walker-holds-3-point-lead-over-warnock-in-georgia-senate-race/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warner Todd Huston",
  "authorUrl": "https://www.breitbart.com/author/warner-todd-huston/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "The Jan. 24 University of Georgias School of Public and International Affairs poll finds that Walker, a 1982 Heisman Trophy winner, has overtaken Warnock, who was elected in a special election in 2020 for the seat temporarily held by Republican Kelly Loeffler, who was appointed to the seat to finish the term after Sen. Johnny Isakson resigned his seat.",
    "A large majority said that the country is headed in the wrong direction (71 percent to 17 percent), the economy concerned citizens far more than COVID (20 percent to 13 percent), and 42 percent said they are financially worse off now than they were when Biden was elected compared to 32 percent that said they are better off.",
    "In the poll, 872 registered Georgia voters were asked: If the election were held today and the candidates for U.S. Senate were Democrat Raphael Warnock and Republican Herschel Walker, who would you vote for?",
    "PERRY, GA  SEPTEMBER 25: Republican Senate candidate Herschel Walker greets the crowd during a rally with former President Donald Trump on September 25, 2021, in Perry, Georgia.",
    "WASHINGTON, DC  JANUARY 18: U.S. Sen. Raphael Warnock (D-GA)) speaks to members of the press after a Senate Democratic Caucus meeting on January 18, 2022, in Washington, DC.",
    "Voters also evinced strong disapproval with 50 percent disapproving of Joe Bidens job as president compared to the mere 14 percent who gave Biden a strong approval rating.",
    "Along with Democrat Jon Ossoff  who also won office in 2020  was one of the first Democrats elected to the U.S. Senate from Georgia since Zell Miller won office in 2000.",
    "The University of Georgias School of Public and International Affairs was taken between January 13 and 24 and had a margin of error of 3.3 percentage points.",
    "A poll finds that GOP challenger and former NFL player Herschel Walker has a three-point lead over sitting Democrat U.S.",
    "The numbers were also disastrous for Joe Biden with findings that put his approval underwater in several key areas.",
    "(Photo by Sean Rayford/Getty Images)\nRespondents found favor with Walker 47 percent to 44 percent for Warnock.",
    "Brian Kemp the edge over Democrat challenger Stacy Abrams 48 to 41 percent.",
    "(Photo by Alex Wong/Getty Images)\nThe same poll gave Georgia Gov.",
    "Senator Raphael Warnock in the Georgia U.S. Senate race.",
    "Warnock was elected to run out Isaksons term in 2020.",
    "Eight percent said they didnt know."
  ]
}