{
  "id": 8268,
  "mediaId": 33,
  "date": "1/19/2022 12:00:00 AM",
  "headline": "Plans to close all but one polling place in a rural Georgia county reverberate through a battleground state",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220118122838-georgia-voter-sticker-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/01/19/politics/poll-closures-rural-lincoln-county-georgia/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fredreka Schouten",
  "authorUrl": "https://www.cnn.com/profiles/fredreka-schouten",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "\"What's happening in Georgia with the dismantling of these county election boards is an extreme example of the national trend in Republican-controlled states to undermine local election officials,\" said Jonathan Diaz, senior legal counsel for voting rights at the nonpartisan Campaign Legal Center, which advocates for broad access to the ballot.",
    "\"If you have one party that controls who gets appointed to the boards of election, who gets to certify results and whose votes get counted, then if there is someone with an ideology that says 'We don't like the outcome' (of an election), they have a better opportunity to do something about it,\" she said.",
    "All the individual changes to election procedures in states like Georgia could add up to big obstacles to voting this year, said Sean Morales-Doyle, acting director of the voting rights and elections program at the liberal-leaning Brennan Center for Justice at New York University's law school.",
    "A Supreme Court ruling in 2013 struck down the heart of that law, however, freeing Georgia and eight other states -- along with a slew of counties and cities in other parts of the country with a history of racial discrimination -- from that federal scrutiny.",
    "(A recent analysis by The Atlanta Journal-Constitution found that their use has plummeted -- with about half as many absentee voters returning their ballots in drop boxes in the Atlanta area last year compared with the 2020 general election.)",
    "In Lincoln County -- a GOP stronghold where Donald Trump received more than 68% of the vote in 2020 and where 29% of its residents are Black -- the all-Republican county commission now appoints three out of five election board members.",
    "Lincoln County Commission Chairman Walker Norman, a Republican, defended both the changes to the election board and the poll closures, saying it will help move voters and election equipment to a central, modern facility.",
    "The county is one of six in this battleground state that have disbanded or reconfigured their local election boards in the last year, thanks to recently passed bills by the Republican-controlled Georgia General Assembly.",
    "Warnock, chosen by voters in a special election, is on the ballot again this year in a high-profile race that could pit him against Trump's choice for the Republican nomination, the former football star Herschel Walker.",
    "Moves in Georgia to close polling places -- or make other changes to electoral procedures -- once required advance federal approval under the 1965 Voting Rights Act to ensure they didn't hurt Black and minority voters.",
    "Freeman -- who has gone gone door to door encouraging voters to sign petitions to stop the closures -- said some voters would have to travel more than 20 miles to cast their ballots if the consolidation plans proceed.",
    "And if Fulton officials flunk the review, the GOP-controlled state board could move to replace the county's election leadership, under the provisions of a sweeping election bill Georgia Republicans enacted last year.",
    "And the continued reluctance of two Democrats, Arizona Sen. Kyrsten Sinema and West Virginia Sen. Joe Manchin, to change Senate rules to allow a straight party-line vote on the measure likely has doomed its chances.",
    "Voting rights activists say this is a pattern of Republicans expanding their influence over election administration in these politically competitive states in advance of this year's critical midterm elections.",
    "Record turnout in the Peach State in the 2020 election helped propel President Joe Biden into the White House and gave his party control of the US Senate after Georgians elected two Democrats, Sens.",
    "But in a community with little reliable public transportation, \"the poor and marginalized people won't be able to vote because, bottom line, they won't be able to get to the polls,\" said the Rev.",
    "For his part, Raffensperger is pushing a constitutional amendment to prevent noncitizens from voting in state elections -- although they already are barred from doing so under existing state law.",
    "Helen Butler, who oversees the Georgia Coalition for the People's Agenda, is a Democrat who was removed from the elections board in Morgan County in one of the county shakeups last year.",
    "And he scoffed at the idea that people would have problems casting their ballots, saying \"99.9 percent of the public today has automobiles\" and can get to the central polling location.",
    "Another proposal from Republicans this year could further sideline election officials by allowing the Georgia Bureau of Investigation to open probes into election-related complaints.",
    "(CNN)Election officials in a rural Georgia county are weighing plans to close all but one polling place ahead of this year's elections, alarming local voting and civil rights groups.",
    "Georgia state Sen. Lee Anderson, the Republican who authored the bills abolishing and reconstituting the Lincoln County elections board, did not respond to CNN requests for comment.",
    "Georgia GOP lawmakers last year limited the number and locations of ballot drop boxes, after they were widely used in the 2020 election to prevent the spread of the coronavirus.",
    "Another prominent Republican in the state, Senate President Pro Tempore Butch Miller, who is running for lieutenant governor, has proposed banning the use of ballot drop boxes.",
    "\"We have some little, old concrete block voting precincts that have been used for 40 years with no handicapped facilities at all,\" Norman told CNN in a recent phone interview.",
    "Republican-controlled legislators in Georgia, Texas, Arizona and Florida all have enacted new restrictions on voting in the year since President Joe Biden assumed office.",
    "The county's election director, Lilvender Bolton, told CNN this week that officials are prepared to arrange rides to the polling place for voters without transportation.",
    "While battles over poll closures often garner little attention, Diaz said, \"the procedures that happen behind the scenes can really affect whether your vote matters.\"",
    "New legislative proposals that target election operations have cropped up in Georgia, a state with high-stakes contests this year for governor and a US Senate seat.",
    "Miller has said the boxes are viewed as a \"weak link\" in protecting elections from fraud and eliminating their use will \"help rebuild the trust that has been lost.\"",
    "One reconstituted board eliminated Sunday voting during a recent municipal election -- an option popular among Black churchgoers, a key Democratic constituency.",
    "Fulton County, a Democratic stronghold that includes much of Atlanta, is the target of an investigation of its practices ordered by the state elections board.",
    "Georgia takes center stage\nThe actions to disband smaller county boards come as the election operations in the state's most populous county face scrutiny.",
    "But Wednesday's vote by the Lincoln County elections board has reverberated far beyond this Georgia community of roughly 7,700 northwest of Augusta.",
    "All voting would happen at a central location in Lincolnton, the county seat, under the consolidation plan the elections board is set to consider.",
    "Officials there say closing six of seven polling places will eliminate the need to send equipment and staff around the county.",
    "A sweeping elections bill enacted last year in Georgia removed Raffensperger as a voting member of the state elections board.",
    "It also will help mothball cramped and outdated polling sites that don't allow for social distancing, county leaders say.",
    "Christopher Johnson, the head of the Greater Augusta's Interfaith Coalition -- one of the groups fighting the change.",
    "\"In a lot of places where we are seeing restrictions, we are seeing restrictions on top of restrictions,\" he said.",
    "The moves are happening as Georgia has become one of the most important states on the political map this year.",
    "But Democratic efforts to pass an updated version of the Voting Rights Act have faltered in the US Senate.",
    "Raffensperger famously rebuffed Trump's entreaty to \"find\" the votes to overturn Biden's victory.",
    "Meanwhile, Democrat Stacey Abrams, who lost to Kemp in 2018, is making another run for governor.",
    "Two other Trump-endorsed candidates are competing in primaries to try to oust Republican Gov.",
    "As a result, election officials can offer one ballot drop box per 100,000 registered voters.",
    "\"When you keep putting burdens on top of burdens, you are going to make it harder to vote.\"",
    "Trump has blamed Kemp and Rafffensperger for his nearly 12,000-vote loss in the state.",
    "She worries the new Georgia laws could set the stage for election subversion.",
    "\"It looks like they only want a select group of people to be able to vote.\"",
    "\"This has nothing to do with suppressing anybody's vote,\" he said.",
    "Republicans have blocked consideration of any federal voting laws.",
    "Brian Kemp and Republican Secretary of State Brad Raffensperger.",
    "\"We should be making voting more accessible,\" said the Rev.",
    "Several Democrats have been tossed off the boards.",
    "CNN's Dianne Gallagher contributed to this story.",
    "\"No real heat at all, no air-conditioning.\"",
    "Denise Freeman, a Lincoln County activist.",
    "And it's not likely to stop there.",
    "Jon Ossoff and Raphael Warnock."
  ]
}