{
  "id": 8342,
  "mediaId": 12,
  "date": "1/3/2022 12:00:00 AM",
  "headline": "The Jolt: The Cobb homage to treason planned for Jan. 6",
  "image": "https://www.ajc.com/resizer/wsuB_xVsOdsmTz3G82sLAhTQNZE=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/OVFUA2XDR2MHJ3NWGRD4IVART4.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-the-cobb-homage-to-treason-planned-for-jan-6/XT4JPF4SYZEUZNUKQ6M62REGLE/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    815,
    1147,
    2095,
    2419,
    513,
    545,
    2617,
    2661,
    2672,
    2934
  ],
  "sentences": [
    "It will conclude with a candlelight vigil for the J6 Patriots  the shorthand that extremists have created for the rioters who sought to overthrow the government, including at least 30 who are being held in a D.C. jail without bond awaiting court dates for the most serious crimes that day.",
    "Finally, from the News You Can Use file, one of your intrepid Insiders reported over the weekend that the Georgia Bulldogs date with destiny at the NCAA national championship Jan. 10th will likely affect the opening session of the Georgia General Assembly.",
    "To those who have cast quick judgment concerning this event, under no uncertain terms are we condoning any form of violence nor the glorification of what happened at the United States Capitol on January 6, 2021, she said in an email to your Insiders.",
    "More:\nWe're told to expect House Speaker David Ralston  a die-hard Georgia football fan who plans to attend the game in Indianapolis  to gavel in the session around 8 a.m. Jan. 10 and quickly dispatch with some formalities before gaveling out.",
    "But at the Cobb County GOP headquarters, a group of far-right activists will hold a two-hour long program Thursday to lionize the insurrectionists who stampeded into the Capitol to prevent Congress from certifying Joe Bidens victory.",
    "Dickens press team noted that University System of Georgia rules prevent them from requiring proof of vaccination or a COVID test to attend, but testing will be available on sight for the COVID-cautious and curious among you.",
    "#gapol pic.twitter.com/Wq35ZVRFhB\n Greg Bluestein (@bluestein) January 2, 2022\nThe 5 p.m. program will begin with a livestream of Trumps press conference from Florida, and continue with a call to action for Cobb Republicans.",
    "Greene reached the final level of Twitter discipline after various infractions over the past year, and the company announced Sunday that she would no longer have access to the account with nearly a half-million followers.",
    "But if she uses it to post any questionable content, its likely that Twitter will expedite a suspension there, too, under its rules prohibiting people from using secondary accounts to get around its disciplinary actions.",
    "In a clip highlighted by MSNBC host Rachel Maddow, Walker claimed that the late John Lewis wouldnt be in favor of voting rights legislation named in Lewis honor, which is sponsored by Georgias U.S. Sen. Raphael Warnock.",
    "That transformation will be on full display Thursday, as the late U.S. Sen. Johnny Isakson, who came up in the Cobb GOP and built his career on working with political opponents, is laid to rest.",
    "For a deeper look at the details and timeline of how the pro-Trump forces tried to overturn Georgias 2020 election results, check out the AJC project that published just before the New Year.",
    "President Joe Biden and Vice President Kamala Harris will also deliver remarks that day while former President Donald Trump has scheduled the above-mentioned counter-programming in Florida.",
    "And keep in mind that if Congress doesnt act, millions of families will not receive the advanced child tax credit payments that have been landing in their accounts for the past six months.",
    "Among the 16 awardees were Ambassador-designate and state Rep. Calvin Smyre, Chris Ludacris Bridges, Dr. Sanjay Gupta, former city council member Myrtle Davis, and the late Jovita Moore.",
    "As Cobb has turned into a Democratic stronghold in the Trump era, the local GOP that once embodied the mainstream conservative movement has become a hotbed for conspiracy theorists.",
    "Senate Leader Chuck Schumer has outlined a wide 2022 agenda that includes another attempt to pass federal voting laws and continued work on the sweeping Build Back Better bill.",
    "U.S. Senate candidate Herschel Walker has spent the opening months on the campaign trail speaking mostly to conservative media outlets that offered him friendly questions.",
    "The deadly events of Jan. 6 will mostly be marked around the country by solemn ceremonies to remember the day that the pro-Donald Trump mob attacked the U.S. Capitol.",
    "However, members of both chambers are expected to gather in Washington on Thursday to commemorate the one-year anniversary of the Jan. 6 riot at the U.S. Capitol.",
    "Several state Senate leaders told us the chamber plans a get out quick\" day, as well, for the state legislators who are planning to attend the game.",
    "But running for the post will risk his redrawn seat, which will combine parts of his district with that of Republican state Rep. Gerald Greene.",
    "Walker also trended on Twitter over the weekend for a confusing statement taped from his home in Texas about Joe Bidens Build Back Better plan.",
    "A Cobb County GOP committee is holding a Jan. 6 program and candlelight vigil for the J6 patriots in the violent mob that overran the Capitol.",
    "In one of outgoing Atlanta Mayor Keisha Lance Bottoms final acts in office, she announced the recipients of the citys Phoenix Awards Sunday.",
    "As for the nuts & bolts of the day:\n- Dickens will be sworn in at a 1:00 ceremony to be held outdoors at Georgia Techs Bobby Dodd Stadium.",
    "She said she wants to acknowledge the Americans who lost their lives during the riot and to pray for those who have been denied justice.",
    "That also means lawmakers are likely to skip Tuesday, though the schedule won't be formalized until both chambers agree on the timing.",
    "Twitter permanently suspended the personal account of U.S. Rep. Marjorie Taylor Greene after she posted more COVID-19 misinformation.",
    "The former tech executive has announced programs will digital-only, in an effort to advance sustainability and technological efforts.",
    "The Albany Democrat filed paperwork for the statewide post over the weekend, but he told us he wants to float the idea for now.",
    "The Cobb GOP was once the heart of the mainstream GOP in Georgia, but Trumps rise has pulled the local party to the far right.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "Senator Lewis was one of the greatest senators thats ever been and for African Americans that was absolutely incredible.",
    "Over the holiday break, Walker sat down with Brian Pritchard, the uber-conservative commentator from north Georgia.",
    "Look for the regular schedule to resume Wednesday morning with the Georgia Chambers annual Eggs & Issues breakfast.",
    "Our City Hall team is up with the five questions theyll be looking for answers to as the mayor-elect takes office.",
    "And on her last full day as mayor, Bottoms also posted a video to social media with the note, Thank you Atlanta.",
    "Hes served on the House Agriculture Committee for 15 years and comes from the states agricultural heartland.",
    "Dukes would make a formidable candidate to succeed Republican Gary Black, who is running for U.S. Senate.",
    "Greene can still post from her official account, which she uses for congressional business, @repMTG.",
    "The U.S. Senate is back in action this week while the House takes another week of holiday vacation.",
    "State Rep. Teri Anulewicz, who represents a slice of Cobb County, said it was an homage to treason.",
    "Bottoms said the awardees have made an indelible impression upon our city and our administration.",
    "There's also a chance legislators convene on Tuesday, though little work is expected to get done.",
    "But Salleigh Grubbs, the chair of the Cobb GOP and organizer of the event, sees it differently.",
    "Brian Kemp will deliver his annual State of the State speech to the General Assembly.",
    "- The event is free and open to the public, but registration is required to attend.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "But if Dukes runs for statewide office, Greene would likely be the favorite.",
    "State Rep. Winfred Dukes isnt 100% running for agriculture commissioner yet.",
    "Hours later, the Cobb GOP will start its program to honor the J6 Patriots.",
    "I just wanted to see what the interest out there was like, he said.",
    "To throw his name on a bill for voting rights I think is a shame.",
    "And he called Lewis, a legendary U.S. House member, a senator.",
    "Its Inauguration Day for Atlanta mayor-elect Andre Dickens.",
    "As always, Jolt readers are some of our favorite tipsters.",
    "But if youre looking for a souvenir program, dont bother.",
    "This miscarriage of justice should concern ALL AMERICANS.",
    "Democrats have their own name for the Jan. 6 program.",
    "The new territory narrowly tilts toward Democrats.",
    "Ive been at the Legislature for about 25 years.",
    "But even that strategy has its dangers.",
    "- The event will also be live streamed.",
    "Five strikes, and shes out.",
    "I want to weigh my options.",
    "And on Thursday, Gov.",
    "I love you."
  ]
}