{
  "id": 8360,
  "mediaId": 305,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "Stacey Abrams Wins Georgia's Democratic Gubernatorial Primary",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/64c7352a41edff977cdc613b8be67a55.jpg",
  "link": "https://www.theroot.com/stacey-abrams-wins-georgias-democratic-gubernatorial-pr-1848976721",
  "sentiment": "-0.783",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    1147,
    1951,
    2087,
    2095,
    2230,
    106,
    146,
    179,
    584,
    2672
  ],
  "sentences": [
    "A political science professor at the University of Georgia, Charles Bullock, stated the gubernatorial election would have different circumstances than the ones Abrams used in conjunction with local voting groups and her organization, Fair Fight Action, to turn Georgia blue in the 2020 Presidential election.",
    "Some of the educated whites who voted for Biden, who voted for Ossoff and Warnock, because they didn't like Trump might not feel the need to vote for Democrats if it's not a situation whereby the Republican nominee that they're supporting is someone who Trump has endorsed, Bullock said.",
    "As we head into the election in November, Georgia has passed laws such as an election police force, a voter suppression law outlawing mobile voting units, and the distribution of food and drink to voters waiting in line at a precinct purged Black citizens off voter rolls.",
    "My mission in 22 is to go back to those voters and tell them how working together, we can make certain they thrive, and that will lead us to victory in November.",
    "An Associated Press investigation found Kemp's office had more than 50,000 voter registration applicants still pending, most of which were from black voters.",
    "[Abrams] is going to have to not only mobilize a strong turnout of the minority community, but she has to get that share of the white voters, he said.",
    "Also, for a Democrat to win in Georgia, he or she must get roughly 40 percent of the college-educated vote in the state, he pointed out.",
    "In the 2018 Georgia gubernatorial election, Abrams lost to Kemp by 54,723 votes, the closest governor's race in Georgia since 1966.",
    "Not that there was any doubt, but Stacey Abrams won the Democratic nomination for governor in Georgia, NBC News reports.",
    "We had record turnout and we saw a composition of voters the state had never seen before, Abrams told CNN.",
    "However, there should be efforts to increase access to vote, not have people overcome barriers.",
    "At the time, Abrams accused Kemp of engaging in the systemic disenfranchisement of voters.",
    "Abrams is said to have an uphill battle against Kemp coming in November.",
    "Abrams ran unopposed and will head into a rematch with Republican Gov.",
    "Despite this, Georgia's voting in the 2022 primary has gone up.",
    "We have to reach every single voter, in every way we can.",
    "Still, Abrams is undeterred by any potential setbacks.",
    "Brian Kemp."
  ]
}