{
  "id": 8362,
  "mediaId": 65,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "Stacey Abrams serves as board member, governor of foundation that supports #AbolishThePolice",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/02/1862/1048/Georgia-Governor-Race-Stacey-Abrams.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/stacey-abrams-governor-foundation-abolish-police",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "\"And what we can do at our best, those of us who believe in dreaming, those of us who believe in justice, those of us who are committed to Black liberation  not as an endeavor to keep in our brain, but something that we want to realize in our lifetime  can use resources to do that.\"",
    "\"We have to have a transformation of how we view the role of law enforcement, how we view the construct of public safety, and how we invest, not only in the work that we need them to do to protect us, but the work that we need to do to protect and build our communities.",
    "STACEY ABRAMS GROUP PAID OVER $1.2 MILLION TO PRIVATE SECURITY FIRM LAST YEAR\nOn March 10, the Marguerite Casey Foundation tweeted \"#DefundthePolice\" while sharing a Washington Post story about \"the hidden billion-dollar cost of repeated police misconduct.\"",
    "On March 3, the foundation tweeted, \"Grant recipient @DreamDefenders + partners launched the Doctors Within Borders Urgent Care Clinic as part of a larger movement to create direct services and sites of intervention in police violence and prison systems.",
    "State filings show, however, that she's still listed as a board member and governing person at the Seattle-based Marguerite Casey Foundation, which tweeted #DefundThePolice as recently as March of this year and #AbolishThePolice as recently as February.",
    "\"[What] ideological foundations like ours can do is create a more even terrain for that fight  that the opposition is fully funding ethno-nationalism, fully funding patriarchy and White supremacy, like, whole hog, every day funding it,\" Rojas said.",
    "During the George Floyd unrest of 2020, Abrams tried to rebrand the \"defund\" aspect of the defund the police movement as being one in favor of the \"reformation and transformation\" of law enforcement, instead of the outright abolishment of policing.",
    "Terry Norris, executive director of the Georgia Sheriffs' Association, said the Defund the Police movement has \"absolutely\" made people more hesitant to enter law enforcement and that it's currently a \"very, very tough environment to work in.\"",
    "The foundation hosted an event in early February, titled, \"Becoming AbolitionistsA History of Failed Police Reforms & Vision for True Public Safety,\" which was moderated by the foundation's president and CEO, Carmen Rojas.",
    "\"And I do think that there are many, many more people in our state and throughout the United States that support law enforcement and what it is doing than those that would say abolish it or defund it.\"",
    "In October 2021, the foundation held a book giveaway event promoting Colin Kaepernick's book of essays, \"Abolition For The People: The Movement For A Future Without Policing & Prisons.\"",
    "The foundation tweeted at the time that the book, \"features the brilliance of many amazing thought leaders, building on decades of organizing and opening radical possibilities.\"",
    "Abrams, who is taking another shot at running for Georgia governor, has tried to distance herself from the hardline rhetoric of the #DefundThePolice movement in the past.",
    "It describes itself as a \"private, independent grant-making foundation dedicated to helping low-income families strengthen their voice and mobilize their communities.\"",
    "During the Feb. 3 discussion, featuring pro-abolitionist author Derecka Purnell, Rojas accused Republicans of \"fully funding ethno-nationalism\" and \"White supremacy.\"",
    "Stacey Abrams serves as a board member and governor of a UPS family foundation that has repeatedly voiced support for defunding and abolishing the police.",
    "And that's the conversation we're having: We'll use different language to describe it, but fundamentally we must have reformation and transformation.\"",
    "Abrams, the Georgia gubernatorial Democratic nominee, has been tight-lipped about her views on defunding the police ahead of the election.",
    "They don't want to hurt anybody, but they don't want to get prosecuted for, you know, trying to sustain a crisis situation.\"",
    "The Marguerite Casey Foundation was founded in 2001 and named after Marguerite Casey, the sister of UPS founder Jim Casey.",
    "\"There is a concern by people about [whether] officers [are] going to be prosecuted for doing what they're trained to do.",
    "On Feb. 11, the group shared a story about the \"Prison Industrial Complex in Atlanta\" and tweeted \"#AbolishthePolice.\"",
    "Norris said, however, that he's noticing a shift in how law enforcement is being viewed in the country.",
    "A lot of our sheriffs' offices are really down in staffing,\" he told Fox News Digital in an interview.",
    "Abrams' campaign told Fox News Digital that Abrams does not hold the same views as the foundation.",
    "The foundation has also tweeted support for abolishing law enforcement and prison systems.",
    "\"We're having a very difficult time attracting and hiring deputy sheriffs and jailers.",
    "She did not face a challenger in the Democratic primary and will face Republican Gov.",
    "\"I think we're being drawn into this false choice idea,\" Abrams said in June 2020.",
    "\"I think the pendulum is swinging back toward our profession,\" he said.",
    "Brian Kemp for a second time in November.",
    "#DefundthePolice.\""
  ]
}