{
  "id": 8363,
  "mediaId": 65,
  "date": "d2022-05-26T00:39",
  "headline": "Georgia Gov. Kemp responds to Trump critiques, says Stacey Abrams is main focus",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b3beed64-1985-48d6-a8d7-ab0bc7b083e8/071d8c89-4371-409e-ad5e-c3f4ec9b650c/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/georgia-gov-kemp-responds-trump-critiques-stacey-abrams-main-focus",
  "sentiment": "-0.194",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    1434,
    1951,
    2013,
    2095,
    2279,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Trump's endorsements in a handful of Georgia races presented a mixed bag for the former president, as Perdue fell to Kemp, and Rep. Jody Hice, R-Ga., was unable to defeat incumbent Secretary of State Bradford Raffensperger  the latter of whom Trump has claimed failed to properly ensure security of the state's 2020 elections.",
    "\"I praised him and his administration and Vice President Pence for the work that they did to help our state during the pandemic and a lot of the things that we worked on -- But this race and what I'm running for is to be governor of Georgia.\"",
    "Brian Kemp will continue to campaign without criticizing former President Donald Trump, despite his fellow Republican continuing to lambaste him for the state's handling of the 2020 election aftermath, the governor told Fox News.",
    "Walker will face incumbent Sen. Raphael Warnock, D-Ga., who is running for the second time in three years because he is currently fulfilling the remainder of the late Sen. Johnny Isakson's, R-Ga., term.",
    "Heisman Trophy winner and former Dallas Cowboys running back Herschel Walker, however, handily defeated his opponents, earning a Trump-endorsed win in the U.S. Senate primary.",
    "The unifying aspect of his midterm race, Kemp said, is that former State Rep. Stacey Abrams, D-Fulton, the Democratic nominee must be defeated for the second time in a row.",
    "Kemp replied that his campaign is centered on \"hard-working Georgians\" and that he continues to be appreciative for how Trump's time in the White House benefited Georgia.",
    "On \"Special Report,\" anchor Bret Baier asked if Kemp planned to mend fences with Trump, noting it got \"pretty ugly\" between the former president and the governor.",
    "Trump had endorsed former Sen. David Perdue, who lost by about a 50-point margin, while ex-Vice President Mike Pence endorsed Kemp.",
    "\"Unlike her, I believe Georgia is the greatest state in the country to live, work and raise our families.",
    "\"This is about Georgia, and so I've never said anything bad about President Trump.",
    "And I'm proud we're the number one state in the country for business.",
    "And that's what I'm working to keep,\" he said.",
    "I don't plan on doing that,\" he said.",
    "Georgia Gov."
  ]
}