{
  "id": 8394,
  "mediaId": 157,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "'Party of me': Chris Christie rips Trump's selfishness",
  "image": "https://www.rawstory.com/media-library/chris-christie.jpg?id=29870086&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/ch-2657407067/",
  "sentiment": "-0.768",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    761,
    1147,
    1850,
    2087,
    2095,
    3085,
    3094,
    6225,
    428,
    2672,
    2945
  ],
  "sentences": [
    "You cannot stand behind the seal of the president of the United States, in the East Room of the White House, and tell the American people that the election is stolen and not present them with any evidence that its been stolen, Christie said.",
    "\\u201cMike Lindell has arrived at the Trump rally, saying that the Deep State \\u201cdialed up the algorithms\\u201d to steal the GOP primaries of Kemp and Raffensperger to embarrass Trump.",
    "Donald Trump's grip on the Republican Party is being increasing challenged by GOP rivals who have less fear of the former president's rage following Georgia's primary election results.",
    "At a rally in Wyoming for Harriet Hageman, who is challenging Rep. Liz Cheney (R-WY), Mike Lindell claimed that Donald Trump did not lose in Georgia because he claims Gov.",
    "But what it shows you is if he continues to look backwards, guy, he is not going to be a political force in this party for much longer,\" he predicted.",
    "Chris Christie has emerged as a leading critic of Trump's fixation on his delusions about the 2020 presidential election, which was won by Joe Biden.",
    "Because people believe the president, a lot of people do, and they think to themselves, Well, he wouldnt say that unless he knew something.",
    "They stole that election!\\u201d\\u201d\n Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1653757049",
    "What Donald Trump has advocated is for us to be the party of me, that everything has to be about him and about his grievances.",
    "\"The mainstream media will overinterpret this as being the end of Donald Trump in the Republican Party, and it is far from it.",
    "During an appearance on Guy Benson's Fox Radio show, Christie again offered his analysis of the former president.",
    "But more important than that, what we have to decide is: do we want to be the party of me or the party of us?",
    "Lindell went on to claim that there was also fraud in Wyoming and that Trump did not win by 120,000 votes.",
    "Christie also had harsh words for Trump when speaking to students at Harvard University.",
    "We have to be the party of tomorrow, not the party of yesterday, Christie told Politico.",
    "But others in the party are still standing by Trump.",
    "\"He really won by 142,00,\" Lindell falsely claimed.",
    "Brian Kemp was not the real winner of the primary.",
    "\\u201cYou think Brian Kemp got 73%?",
    "He knows nothing!",
    "Impossible!",
    "Former Gov."
  ]
}