{
  "id": 8399,
  "mediaId": 151,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "As Cheney files for reelection, poll from rival group shows her trailing badly",
  "image": "https://www.politico.com/dims4/default/5a8671a/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F31%2Fd0%2F23b38d324bc39342be28bc33b7e3%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1227725986",
  "link": "https://www.politico.com/news/2022/05/27/cheney-reelection-poll-00035597",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    3085,
    3094
  ],
  "sentences": [
    "More than 100 House Republicans signed on to host a fundraiser for the challenger in March, including Minority Leader Kevin McCarthy and Rep. Elise Stefanik, who became chair of the House GOP conference last May after Cheney was pushed out.",
    "The poll, which provides perhaps the starkest illustration yet of the political peril Cheney faces this year, shows Wyoming attorney Harriet Hageman garnering 56 percent of the vote to the incumbents 26 percent in the GOP primary.",
    "If our generation does not stand for truth, the rule of law and our Constitution, if we set aside our founding principles for the politics of the moment, the miracle of our constitutional republic will slip away, she said.",
    "| Samuel Corum/Getty Images\nBy Ally Mutnick\n 05/27/2022 04:31 AM EDT\nEmbattled GOP Rep. Liz Cheney is down 30 points in a new survey of her August primary conducted by the Club for Growth, which is backing her opponent.",
    "In a video released Thursday, timed to coincide with her filing for reelection, Cheney touted her Wyoming roots, said she refused to surrender to pressure or intimidation and cast her upcoming election in grave terms.",
    "The polling reinforces another piece of data the Club for Growth released a year ago, which showed that 52 percent of Wyoming GOP primary voters were planning to vote against Cheney regardless of who challenges her.",
    "After her impeachment vote, she became one of just two Republicans, along with Rep. Adam Kinzinger (R-Ill.), to sit on the commission investigating the Jan. 6 Capitol riots that Speaker Nancy Pelosi created.",
    "Meanwhile, Wyoming Values PAC  a group led by Trump allies and that has Donald Trump Jr. as an honorary chair  has booked over $300,000 in TV ads already, according to the media-tracking firm AdImpact.",
    "A spokesperson for the group said that sample size includes not only frequent GOP voters, but also new voters and those who identify as Democrats or independents but intend to vote in the GOP primary.",
    "He has also garnered some unfavorable headlines during his campaign and was stripped of his committee assignments in the legislature for a continued pattern of intimidating and disorderly conduct.",
    "The Trump-backed bill to limit so-called crossover voting bill died in March, when the legislature failed to consider it before the deadline  meaning Cheney is still free to marshal those voters.",
    "In fact, the former president was so worried about the possibility of Cheney mobilizing Democrats and independents that he and allies privately lobbied to change the states election laws.",
    "Cheneys clearest path to victory is to expand the electorate beyond the traditional Republican voters, in a state that gave Trump about 70 percent of the vote in 2016 and 2020.",
    "Nearly all the other top contenders dropped out, lessening the likelihood that they would splinter the anti-Cheney vote and give the incumbent a path to a plurality victory.",
    "Currently, Wyoming law allows voters to switch their party registration up until the day of a primary election, letting them vote in whichever primary they choose.",
    "Hageman was recruited and endorsed by former President Donald Trump in response to Cheneys vote to impeach him last year alongside nine other House Republicans.",
    "The race for Wyomings lone congressional district is one where the Club for Growth and Trump, who have quickly turned from allies to foils, are aligned.",
    "Trump has taken intense interest in the race because Cheney has been such a prominent critic of his attempts to subvert the 2020 election results.",
    "The poll, shared first with POLITICO, was conducted this week by WPA Intelligence, a Republican firm, ahead of Fridays candidate filing deadline.",
    "Yet this week provided evidence that GOP primary voters were willing to come back to some Republicans Trump branded as enemies, as Georgias Gov.",
    "The Club for Growth survey was conducted among 400 likely voters in the Aug. 16 primary and has a margin of error of 4.9 percentage points.",
    "Brian Kemp, Secretary of State Brad Raffensperger and Attorney General Chris Carr all won primaries against Trump-backed challengers.",
    "Only one notable Republican remained  state Sen. Anthony Bouchard, who took 12 percent in the Club for Growth poll.",
    "But Cheneys fundraising has remained impressive throughout and she will be able to defend herself on the air.",
    "on Saturday to rally for Hageman, a trial lawyer who placed third in the GOP primary for governor in 2018.",
    "Kinzinger chose to retire rather than remain a stop on Trumps 2022 midterm revenge campaign.",
    "Hageman, a one-time Cheney supporter, entered the race the fall of 2021 with Trumps backing.",
    "She had nearly $6.8 million banked at the end of March, compared to Hagemans $1 million.",
    "Cheney, however, has said she plans to seek reelection  even if her odds look tough.",
    "The Club for Growth is one of several major GOP groups looking to boost Hageman.",
    "A third Republican got 12 percent support, and just 6 percent are undecided.",
    "And Cheney has remained undaunted by the forces assembling against her.",
    "has remained undaunted by the forces assembling against her.",
    "And Trump will travel to Casper, Wyo.",
    "We must not let that happen.",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}