{
  "id": 8403,
  "mediaId": 136,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "Trump Still Likely to Get Revenge on Liz Cheney, Despite Brian Kemp Setback",
  "image": "https://d.newsweek.com/en/full/2046104/donald-trump-liz-cheney.webp?w=790&f=6c8cad9abe14c8898151c5352dddb575",
  "link": "https://www.newsweek.com/trump-liz-cheney-primary-wyoming-brian-kemp-1710425",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    2095,
    3085,
    3094
  ],
  "sentences": [
    "Kemp's thorough defeat of Perdue would have particularly irritated Trump, seeing as he singled out the Georgia governor as one of the three GOP incumbents he was determined to see voted out of office for not supporting his attempts to overthrow the last election, along with Cheney and Alaska Senator Lisa Murkowski.",
    "Following the crushing defeats of his endorsed candidates in the Georgia primaries, former President Donald Trump will now have to turn his attention to Wyoming Representative Liz Cheney as he attempts to use his influence to oust those who do not support his baseless voter fraud claims from the Republican Party.",
    "Haynes said that becoming the \"face of the opposition to Trump\" and working with Democrats while doing so has damaged Cheney's chances of winning the race against Trump-endorsed attorney Harriet Hageman, state Senator Anthony Bouchard, and three others in the open Republican primary.",
    "The same day, Georgia Secretary of State Brad Raffensperger, who refused to help the former president \"find\" 11,800 ballots to overturn the state's 2020 election results, also beat the Trump-endorsed candidate, Representative Jody Hice, in the primary for the role.",
    "\"Cheney will have a more difficult task because, unlike the other GOP survivors, her participation on the bipartisan January 6 committee goes much deeper than just resisting Mr. Trump's irrational rants about the stolen election,\" Tillery told Newsweek.",
    "Alvin Bernard Tillery, an associate professor of political science at Northwestern University, said that being such a prominent Trump critic in a state where he won nearly 70 percent of the votes in 2020 could also backfire against the congresswoman.",
    "The former president's Save American PAC announced the event as a continuation of Trump's \"unprecedented effort to advance the MAGA agenda by energizing voters and highlighting America First candidates and causes.\"",
    "Dr. Audrey Haynes, a political science professor at the University of Georgia, told Newsweek that Cheney is in a tougher position than Kemp in terms of her primary because of the number of challenges she faces.",
    "In February, the Republican National Committee voted to censure Cheney and Illinois Representative Adam Kinzinger the other Republican on the January 6 panel, for their role in investigating the insurrection.",
    "Haynes also noted that while Cheney has been raising record amounts of donations ahead of the August 16 primary, a majority of the money is coming from out of state and from those who cannot vote for her.",
    "However, unlike the incumbent Kemp who is still well-liked by Republicans in Georgia, Congresswoman Cheney may have a more difficult time fighting off Trump's revenge campaign, experts have suggested.",
    "Now that Kemp has secured his candidacy in November's midterms, Cheney is the most high-profile Republican official who Trump has publicly and continuously sought to end their time in office.",
    "Cheney was one of 10 House Republicans who voted to impeach Trump over the Capitol attack and is one of only two Republicans on the House Select Committee investigating the January 6 attack.",
    "\"And she is someone who has been front and center at the heart of condemning Trump for his efforts to topple a free and fair election in the world's oldest democratic republic.\"",
    "Trump is set to appear at a political rally for Hageman in Casper, Wyoming, on Saturday, May 28, to show support for his chosen candidate and her attempts to defeat Cheney.",
    "On Tuesday, Georgia Governor Brian Kemp comprehensively beat the Trump-backed David Perdue in the gubernatorial primary by more than 50 percentage points.",
    "If the Trump voters split their votes among the pro-Trump candidates, Cheney might pull it off, with a little help from her anti-Trump friends.\"",
    "In November, the Wyoming Republican Party voted to no longer recognize Cheney as being part of the GOP in a purely symbolic move.",
    "\"Moreover, Wyoming Republicans have worked hard to censure her and literally cancel her in their state,\" Haynes added.",
    "This is not the first time Cheney has had to face battles from within her own party.",
    "\"She does not have the advantages of a sitting governor,\" Haynes said.",
    "\"If Bouchard were her only opponent, she might have pulled it off.",
    "But Hageman changed the dynamics of the race with her entry.",
    "\"It is hard to always calculate what voters will do.",
    "\"But I would not count Cheney out,\" she added."
  ]
}