{
  "id": 8418,
  "mediaId": 136,
  "date": "d2022-05-28T19:27",
  "headline": "Lindell Claims Georgia Primaries 'Stolen' to Ding Trump Endorsement Cred",
  "image": "https://d.newsweek.com/en/full/2047669/lindell-claims-gop-primaries-stolen.webp?w=790&f=bcb4b6a7ee734575f45e94830e07f010",
  "link": "https://www.newsweek.com/lindell-claims-georgia-primaries-stolen-ding-trump-endorsement-cred-1711157",
  "sentiment": "-0.72",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    815,
    821,
    1147,
    1850,
    2095,
    2203,
    2279,
    2303,
    4325,
    329,
    428,
    2672
  ],
  "sentences": [
    "Lindell, who is the CEO of MyPillow and a staunch Trump ally, enthusiastically backed up claims that widespread election fraud were to blame for Trump's 2020 defeat, offered a new election conspiracy surrounding the Georgia primaries.",
    "Still, several of his endorsed candidates have easily won their primaries including Herschel Walker, who faced little opposition in the primary for Georgia's Senate race, and other candidates running in heavily-conservative districts.",
    "In addition to two major losses last Tuesday, Dr. Mehmet Oz, his preferred candidate in Pennsylvania's Senate race, is being forced into a recount due to his very narrow lead against former hedge fund CEO David McCormick.",
    "Notably, he endorsed former Senator David Perdue, who ran against GOP Governor Brian Kemp for governor, and Representative Jody Hice, who ran for secretary of state against GOP incumbentBrad Raffensperger.",
    "\"Flooding our offices with bizarre chain letters will not change the outcome of 2020but it will change the outcome for Republicans by staying home in 2022 due to these off-base antics.\"",
    "However, the two went on to easily win their primaries, crossing the 50 percent threshold to avoid a runoff election, delivering a blow to Trump's influence within the GOP.",
    "Mike Lindell claimed on Saturday that primary elections in Georgia were \"stolen\" to discredit former President Donald Trump's record of successfully endorsing candidates.",
    "He argued in remarks ahead of Trump's Wyoming rally on Saturday that the elections in Georgia were stolen in an attempt to minimize the impact of Trump's endorsements.",
    "He knows he's lyingbut he's fallen so deep into the grift that he may actually believe his own lies,\" a Raffensperger spokesperson told Newsweek in February.",
    "Raffensperger's office previously criticized Lindell after he said the secretary of state should be arrested over the 2020 presidential results.",
    "Trump's endorsement has been sought after by candidates running for various offices across the country who hope to win his loyal base of voters.",
    "Representative Madison Cawthorn, who Trump endorsed, also lost his primary in North Carolina to state Senator Chuck Edwards earlier this month.",
    "However, the results of some of the most important GOP primaries have suggested Trump's endorsement does not automatically secure a victory.",
    "Kemp and Raffensperger evoked the former president's ire after refusing to support his unfounded 2020 presidential election fraud claims.",
    "\"They wanted to push it in our real president's face and go 'your endorsements don't mean anything.'",
    "The former president has mostly endorsed candidates who have supported his voter fraud claims.",
    "Meanwhile, Raffensperger had a tighter race, winning 52.3 percent to Hice's 33.4 percent.",
    "\"Mike Lindell's nonsensical parade only harms public confidence in elections.",
    "Newsweek reached out to Georgia's secretary of state office for comment.",
    "Kemp won 73.7 percent of the vote, while Perdue won only 21.8 percent.",
    "Trump endorsed several candidates ahead of Georgia's primaries.",
    "However, no evidence has been presented to back up his claim.",
    "\"Everything in Georgia was stolen,\" the MyPillow CEO said.",
    "However, Oz has declared himself the presumptive nominee.",
    "You think crooked Brian Kemp got 73 percent or whatever?",
    "This isn't just a problem in Georgia but nationwide.",
    "You know what, you made it so obvious.",
    "Impossible!\""
  ]
}