{
  "id": 8468,
  "mediaId": 151,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "Why Trump's Fantasies Couldn't Doom Kemp and Raffensperger",
  "image": "https://www.politico.com/dims4/default/7269dd6/2147483647/legacy_thumbnail/1200x804%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F50%2Fed%2F6bf2fc294f4bbd06c0572aaa08c0%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1399107166",
  "link": "https://www.politico.com/news/magazine/2022/05/26/kemp-pence-gop-heroes-2020-falsehoods-00035440",
  "sentiment": "-0.651",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1434,
    2087,
    2095,
    2203,
    2355,
    3102,
    4325,
    6153,
    2672
  ],
  "sentences": [
    "The orthodoxy about the stolen election, in contrast, forces Republican politicians to say something that is untrue and most know to be untrue; it institutionalizes a politics of cynicism and fear  fear both of Trump and his voters; it detracts from a focus on the ongoing failures of Biden; and it isn't helpful in winning over swing voters who care more about the cost of living than what cellphone geolocation data supposedly tells us about the movements of ballot harvesters in 2020.",
    "He lost it first to President Joe Biden in November 2020; then to the Democrats in the Senate special elections in January 2021 when his fulminations about how he'd been robbed in the presidential election depressed Republican turnout; and, finally, in this week's GOP primaries when his hand-picked candidates crashed and burned and his planned revenge ended up only embarrassing him and his epigones.",
    "Kemp, the incumbent Georgia governor, and Secretary of State Brad Raffensperger had provoked Trump's ire by refusing to indulge his delusions about the 2020 election or engage in any legally dubious maneuvers to change the result in Georgia, and they had felt the full fury of the White House and Mar-a-Lago.",
    "Together with former Vice President Mike Pence, whose separation from Trump is more and more obvious, they form a cadre that resisted intense pressure to turn their backs on their duty in 2020  showing backbone and a moral and institutional integrity that will redound to their credit in the history books.",
    "As a 32-year-old former Trump adviser who worked on the president's legal team that attempted to overturn the result in Georgia, Witt was running against John King, a former police chief and major general of the Georgia National Guard who is the first Latino to serve in state-wide office in Georgia.",
    "Many others endorse the Stop the Steal view out of sheer opportunism, or try to create the impression that they buy into it by focusing on the bias against Trump in the press and on social media and the ramshackle changes to election rules during the pandemic (both of which were real phenomenon.)",
    "Some Republican candidates are true believers, like Pennsylvania gubernatorial nominee Doug Mastriano and the out-of-nowhere serious contender for the Senate nomination in Pennsylvania, Kathy Barnette, both of whom were outside the U.S. Capitol on Jan. 6.",
    "So he coaxed Jones into the primary for the 10th congressional district, and then got one of his former advisers, Patrick Witt, out of the congressional primary and into a primary against the Kemp-selected incumbent insurance commissioner.",
    "It's possible to read too much into Kemp and Raffensperger's victories, which would have been difficult to pull off without the advantages of incumbency and of flawed opponents, while Pence will have much to overcome if he runs in 2024.",
    "If Trump had been rationally calculating his interests, he would have thought twice about making his signature project in the 2022 primary season a challenge to an entrenched, politically shrewd governor.",
    "It is not often that politicians do the right thing and infuriate the most influential figure in their party and the most committed element of their political base and live to tell the tale.",
    "Only someone drunk on the alleged power of Stop the Steal would think this was a good idea, and given the circumstances, getting nearly 17 percent of the vote was probably over-performing.",
    "Yet Republican primary voters in Georgia clearly favored moving beyond an all-consuming focus on 2020 and opposed Trump continuing to make the state his political plaything.",
    "Of course, challenging incumbents isn't a completely fair test of political strength, especially when the incumbent at the top of ticket is as adept and determined as Kemp.",
    "If you are an opponent of abortion, this hypocrisy has been a good thing, serving, over time, to cement the party's status as a party dedicated to protecting unborn life.",
    "Being an ambitious Republican doesn't have to mean promoting or accepting falsehoods about 2020 for fear of a lawman whose firepower and writ aren't quite as advertised.",
    "| Joe Raedle/Getty Images\nOpinion by Rich Lowry\n 05/26/2022 02:05 PM EDT\nRich Lowry is editor of National Review and a contributing editor with Politico Magazine.",
    "Pence, Kemp and Raffensperger are notable for having run through the Trump gauntlet in 2020 without buckling and still pursuing active political careers.",
    "Unlike Earp and the boys, though, Trump didn't get his man or any of his confederates, and Brian Kemp and Co. didn't even have to leave the territory.",
    "Trump wanted to get state Rep. Vernon Jones out of the gubernatorial primary to make way for his preferred candidate, former Sen. David Perdue.",
    "The coalition has shifted even further in a working-class direction, opening up the vista of winning over more working-class minority voters.",
    "For decades, some Republicans have pretended to believe they are anti-abortion or pretended to care about the issue more than they really do.",
    "(The nearly 22 percent that Jones garnered, by the way, was enough for second in a crowded field and he made it into a run-off.)",
    "But in refusing to play by the rules as set by Trump, they have shown courage that should be encouraging to others in the party.",
    "The debate over its substantive direction is a welcome departure from the staleness of approach that had set in before 2016.",
    "Trump has lost Georgia three times within two years, which makes Gen. John Bell Hood's record look impressive by comparison.",
    "Kemp, the incumbent Georgia governor, had provoked Trump's ire by refusing to indulge his delusions about the 2020 election.",
    "The tale of the tape is that Perdue got 21.8 percent of the vote, Jones got 21.6 percent and Witt got 16.7 percent.",
    "Instead, he pulled the strings to create a state-wide vengeance slate challenging everyone from Kemp on down.",
    "Appropriately given the stakes, the party is more focused on cultural issues, and more combative than before.",
    "They also point to a future when the GOP has escaped the box canyon of Trump's Stop the Steal obsessions.",
    "The blight is the fixation with 2020 that Trump has encouraged and, to the extent he can, insisted on.",
    "Forthrightness about Trump and 2020 is usually associated with politicians on their way to retirement.",
    "Corral, former President Donald Trump and his allies mounted up for a vendetta ride in Georgia.",
    "That day is not here, but Tuesday's results show it might not be impossibly far away, either.",
    "In fairness to Witt, he was sent on a particularly witless suicide mission.",
    "Like Wyatt Earp and his federal posse after the gunfight at the O.K.",
    "Trump has catalyzed healthy and useful changes in the GOP.",
    "Every party has its orthodoxies.",
    "Kemp and Raffensperger have."
  ]
}