{
  "id": 847,
  "mediaId": 43,
  "date": "1/3/2022 12:00:00 AM",
  "headline": "Abbreviated Pundit Roundup: January 6 anniversary edges closer",
  "image": "https://images.dailykos.com/images/996473/story_image/GettyImages-1234243415.jpg?1633970593",
  "link": "https://www.dailykos.com/story/2022/1/3/2072254/-Abbreviated-Pundit-Roundup-January-6-anniversary-edges-closer",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1326,
    2095,
    2240,
    2425,
    3094,
    227,
    2672,
    2934
  ],
  "sentences": [
    "x\nThe implications of January 6th are reverberating through the polity: two-thirds see the events as a harbinger of increasing political violence, not an isolated incident...our new @CBSNewsPoll pic.twitter.com/HEMAmoaz7w\n Anthony Salvanto (@SalvantoCBS) January 2, 2022\nWaPo:\nRepublicans and Democrats divided over Jan. 6 insurrection and Trump's culpability, Post-UMD poll finds\nThe percentage of Americans who say violent action against the government is justified at times stands at 34 percent, which is considerably higher than in past polls by The Post or other major news organizations dating back more than two decades.",
    "Again, the view is partisan: The new survey finds 40 percent of Republicans, 41 percent of independents and 23 percent of Democrats saying violence is sometimes justified\nOverall, 60 percent of Americans say Trump bears either a great deal? or a good amount? of responsibility for the insurrection, but 72 percent of Republicans and 83 percent of Trump voters say he bears just some? responsibility or none at all.?\nx\nGeorgia Rep. Marjorie Taylor Greene's 465K-follower personal Twitter account, the one she used to say lots of false things, has been permanently banned from Twitter.",
    "Even as Omicron has torn through the country in the final weeks of the year, upending everything, setting case records, canceling flights, causing long lines at testing sites, threatening a smooth reopening of school in January, returning us to the devotional of the propane heat lamp, it is hard not to feel for New York an appreciation that is snobbish, imperious, unambivalent.",
    "x\nThe need for testing combined with the lack of tests has put the administration in a tough spot.? @larry_levitt\nthis is fair minded and deserved criticismhttps://t.co/Kfl7IlSN3z\n Greg Dworkin (@DemFromCT) January 2, 2022\nNY Times with NYC dealing with Omicron its own way:\nWill Omicron Meet Its Match in the Perseverance of New Yorkers?",
    "Mask wearing on the subway and even on the street where you don't have to cover your face  unless you are avoiding cloud bursts of weed smoke or the cold  is robust to the point that we must imagine it leaves public health officials in other places dumbfounded and envious.",
    "Doing the work over the holidays and beyond\nAJC:\nAs 2022 dawns, Georgia Republicans focus on 2020 election\nTrump's claims that the 2020 election was rigged? against him triggered a civil war within the Georgia GOP that's raging still at the dawn of a new election year.",
    "Rivaling nearly any place on earth, the city's vaccination rate among adults who have so far received one shot stands at 92 percent, a figure achieved before a mandate requiring private-sector employers to have their workers immunized went into effect this week.",
    "Splain, who advocates for Harrisburg to do more for schools in rural areas experiencing economic hardship, testified about his belief that lack of resources is linked to lower student test scores in subjects such as biology and math in recent years.",
    "they have firsthand evidence Ivanka Trump asked Donald Trump twice to stop the violence, Liz Cheney says\n Nicholas Wu (@nicholaswu12) January 2, 2022\nAJC:\nInside the campaign to undermine Georgia's election Part II\nBy late December, state Sens.",
    "In stating so plainly the modern conservative philosophy that public schools exist solely to develop a workforce  one in which not everyone need be a rocket scientist or a philosopher  the Harvard Law-educated Krill didn't stop there.",
    "Those lies are reshaping races for public office across Georgia, from premier elections for governor and the U.S. Senate to lower-profile Republican primary contests that are poised to hinge on loyalty to the former president.",
    "The repetition of false claims convinced many Georgians they were true: By January, three-quarters of Republicans surveyed by The Atlanta Journal-Constitution believed there was substantial fraud in the presidential election.",
    "x\nThompson and Cheney now going on ABC's This Week - asked what their most significant finding is, Thompson cites attempts to undermine democracy\ncalls Jan. 6 clearly \"a coordinated activity on the part of a lot of people.\"",
    "On the witness stand was Matthew Splain, superintendent of the underfunded Otto-Eldred School District in sparsely populated McKean County and board president of the Pennsylvania Association of Rural and Small Schools.",
    "His inquisitor was John Krill, a lawyer representing the state's top Republican lawmaker, defending a political regime that's made Pennsylvania 45th in the nation in state support for its public schools.",
    "What use would a carpenter have for biology?? asked Krill, questioning the need for learning for learning's sake in a locale where many of the available jobs don't require a college degree.",
    "There's a matter-of-factness and a lack of whimpering, which gets everyone through,? as the playwright Paul Rudnick put it on Twitter the other day, making note of these commitments.",
    "New fake and harmful messaging: it's just a sore throat (by the way, hospitals are straining right now with all these sore throat admissions on top of all the deaths from a cold).",
    "Note: a) 3 Bay Area counties (SF, Contra Costa, Alameda) at R; b) FL as outlier (could be OK vax but low masks [or >65s]); c) as vax goes 75%50%, deaths4x.",
    " Nicholas Wu (@nicholaswu12) January 2, 2022\nAJC:\nInside the campaign to undermine Georgia's election Part I\nJudge James F. Bass Jr. dismissed the lawsuit.",
    "A viral moment from Pennsylvania's court battle over school funding about kids on the McDonald's track' holds a buried truth on the anniversary of Jan. 6.",
    "They had staged a televised hearing where Trump's lawyers shared conspiracy theories about late-night ballot stuffing and rigged voting machines.",
    "William Ligon and Brandon Beach had done more than most elected officials in Georgia to aid Trump's effort to overturn the presidential election.",
    "In the months ahead, Trump and his supporters continued to repeat such allegations long after they had been investigated and refuted.",
    "But the lawsuit established a pattern: Trump and his supporters made alarming accusations that created an impression of lawlessness.",
    "This lightbulb moment occurred in the middle of weeks of arduous testimony over unequal K-12 funding during the Harrisburg trial.",
    "A new variant is surging, but vaccination rates are high, face masks are ubiquitous and residents are finding ways to soldier on.",
    " Daniel Dale (@ddale8) January 2, 2022\nWill Bunch/Philadelphia Inquirer:\nAmerica gave up on truly educating all its kids.",
    "x\nGraph (by credible source; prefers anonymity) vividly shows value of vaccines for both individuals & states, since 7/1.",
    "Brian Kemp and legislative leaders rejected the request, they circulated a petition among lawmakers to convene a session.",
    "On Dec. 22, Beach and Ligon showed they were willing to take on the leaders of their own political party to serve Trump.",
    "She still has a 386K-follower official account, which she has so far used for comparatively benign purposes.",
    "That didn't stop Republicans from repeating the Chatham County allegations at the Buckhead rally that night.",
    "Krill then basically said the quiet part of Republican education policy out loud in the packed courtroom.",
    "I hope people appreciate how much work it takes to stay current to be able to lie like they do.",
    "He found there was no evidence that election workers counted illegal votes or broke the law.",
    "They had called for a special session of the General Assembly to investigate voting fraud.",
    "And they had sided with Texas in its lawsuit against Georgia and other states.",
    "pic.twitter.com/ruy37kZp11\n Bob Wachter (@Bob_Wachter) January 2, 2022",
    "It's not easy and takes a professional touch to do it right.",
    "Old fake and harmful messaging on COVID: it's just a cold.",
    "On closer inspection, the allegations amounted to nothing.",
    "Opposite of fear mongering.",
    "Then Jan. 6 happened.",
    "Coincidence?",
    "When Gov.",
    "x\n!"
  ]
}