{
  "id": 8485,
  "mediaId": 21,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Chris Christie says Trump wants the GOP to be the 'party of me,' where 'everything has to be about him'",
  "image": "https://i.insider.com/62927e35ff955c0019c5e662?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/christie-trump-gop-party-of-me-2020-election-grievances-2022-5",
  "sentiment": "-0.722",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    761,
    800,
    1147,
    2087,
    2095,
    4325,
    403,
    428,
    2672,
    2820
  ],
  "sentences": [
    "After Trump was defeated by Biden in the general election and baselessly blamed his loss on widespread voter fraud, Christie over time morphed into a critic of the Trump campaign's legal strategy, especially when the Supreme Court in December 2020 declined to take up a GOP-backed lawsuit brought by Texas Attorney General Ken Paxton over the validity of the results in several swing states.",
    "Kemp, who was elected in 2018 on a conservative platform and with the then-blessing of Trump, fought vigorously to win renomination as his party's nominee as he sought reelection to a second term  brushing aside complaints from Trump that the governor didn't help him enough during the 2020 election.",
    "Trump successfully ran as a political outsider during his first presidential bid, while Christie hoped that his blunt-talking style would earn him votes among the party's conservative base, especially since he had a record of winning in a state that is solidly blue on the presidential level.",
    "At one time, the thought of a Trump-backed candidate performing so poorly would have been unthinkable, but according to Christie  a former two-term Republican governor, ex-US attorney, and onetime close ally of the former president  the party's focus on the future is long overdue.",
    "The governor, who has spent nearly four years signing conservative pieces of legislation into law, won the Tuesday GOP primary in a landslide, capturing nearly 74 percent of the vote, compared to roughly 22 percent for Perdue.",
    "Christie and Trump have a long history; the former president's sister connected her brother with the then-federal prosecutor in 2002 and the two men ran against each other during the 2016 Republican presidential primaries.",
    "While most Republicans are still keenly aware that Trump still wields enormous influence within the party, they also have surmised that the former president is seeking to enact political revenge on onetime allies.",
    "\"We have to be the party of tomorrow, not the party of yesterday,\" Christie told Politico earlier this week as he and other Kemp allies basked in their candidate's overwhelming victory against Perdue.",
    "When Trump captured the White House in 2016, Christie reportedly turned down multiple Cabinet positions, but still maintained close ties with the then-president throughout his tenure in office.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "While former President Donald Trump went all-in for ex-Sen. David Perdue in the recent Georgia Republican gubernatorial primary, former New Jersey Gov.",
    "Some view that strategy as unwise and disadvantageous to the GOP as it looks to the 2022 midterms and the 2024 presidential election.",
    "\"What Donald Trump has advocated is for us to be the 'party of me,' that everything has to be about him and about his grievances.\"",
    "He even helped Trump prepare for the 2020 presidential debates against then-Democratic presidential nominee Joe Biden.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"The reason the Supreme Court is not taking this is not because of a lack of courage,\" Christie said at the time.",
    "He came to Georgia to campaign for Trump foe Brian Kemp, who easily won his GOP gubernatorial primary this week.",
    "\"But more important than that, what we have to decide is: do we want to be the party of me or the party of us?\"",
    "Christie rejects such a development, arguing that the party must look to the future in order to win.",
    "Chris Christie says that former President Trump wants the GOP to be the \"party of me.\"",
    "It's a lack of evidence and a lack of any type of legal theory that makes any sense.\"",
    "Brian Kemp talk to the media at a campaign event in Canton, Ga., on May 17, 2022.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"It's for the same reason that every court has thrown this out.",
    "Stay up to date with what you want to know.",
    "Elijah Nouvelage/Getty Images\nFormer Gov.",
    "Sign up for notifications from Insider!",
    "Chris Christie, left, and Georgia Gov.",
    "Chris Christie backed incumbent Gov.",
    "Christie told the publication.",
    "Loading Something is loading.",
    "Former New Jersey Gov.",
    "Brian Kemp."
  ]
}