{
  "id": 8490,
  "mediaId": 195,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Republicans grow more aggressive in openly defying Trump",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/kempbrian_pencemike_052722ap-john-bazemore_charles-krupa_gop-aggressive.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3504347-republicans-grow-more-aggressive-in-openly-defying-trump/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    2095
  ],
  "sentences": [
    "The consultant said that Trumps singular focus on his 2020 electoral loss to President Biden may be creating an opening for other prospective White House hopefuls, who see an opportunity to sell themselves to voters as adherents of Trumps so-called America first political movement, but without the baggage of the former president.",
    "Former House Speaker Paul Ryan (R-Wis.) is also wading into the GOP primary in South Carolinas 7th District, where hes set to campaign for Rep. Tom Rice (R-S.C.), one of 10 House Republicans who voted last year to impeach Trump for his role in the Jan. 6, 2021, riot at the U.S. Capitol.",
    "Other Republican power players, like Trumps former Vice President Mike Pence, have started to take bolder steps toward potential White House bids of their own, suggesting that theyre no longer willing to put their own plans on hold if Trump decides to mount a comeback campaign in 2024.",
    "Without the White House, social media or a campaign, Trump doesnt have as much power, and thats reflected in his mediocre endorsement record, the fact that other Republican leaders dont defer to him and the decreasing amounts of media coverage, Conant said.",
    "In the run-up to Pennsylvanias GOP Senate primary earlier this month, former Secretary of State Mike Pompeo traveled to the Keystone State for a press briefing in which he raised concerns about Trumps endorsed candidate in the race, Mehmet Oz.",
    "Despite the questions about Trumps continued influence in the party, however, strategists have little doubt about his legacy, noting that he has fundamentally reshaped the GOP and its platform under his Make America Great Again banner.",
    "His picks in the primaries for Georgia secretary of state and attorney general also lost by wide margins, while his preferred candidates in the gubernatorial nominating contests in Idaho and Nebraska also fell in recent weeks.",
    "In an interview with The New York Times last month, Pence declined to rule out a bid for the White House, even if Trump himself mounts a campaign for the 2024 presidential nod, saying that well go where were called.",
    "Trump was such an omnipresent force for five years and I think were finally seeing other Republicans start to get more attention, because it turns out the partys a lot broader than just Trump and his loyalists.",
    "Trump has shown a propensity to endorse candidates based on their loyalty to him and willingness to echo his false claim that widespread voter fraud and systemic malfeasance robbed him of reelection in 2020.",
    "The strategist pointed to Trumps recent string of losses in Georgia, where several of his endorsed candidates failed to emerge from primaries against incumbents whom the former president had vowed to oust.",
    "Doug Heye, a Republican strategist, said theres little doubt that Trump remains deeply influential within the GOP, but that the power of his endorsements has been greatly exaggerated.",
    "Party strategists and operatives said there is growing concern among many in the GOP about the former presidents judgment, especially when it comes to wading into primary contests.",
    "In perhaps the most embarrassing upset to Trump so far this year, Perdue lost to Kemp in the states closely watched GOP gubernatorial primary by a more than 50-point margin.",
    "Republicans are more aggressively asserting themselves within the GOP amid signs that former President Trumps once vise-like grip on the party is starting to weaken.",
    "Pompeo, who is seen as a potential 2024 presidential contender, had already endorsed Ozs chief primary rival, former hedge fund CEO David McCormick, in the race.",
    "Alex Conant, a Republican strategist, said that those losses have empowered other Republicans to more directly challenge Trump after years of deference to him.",
    "MAGA is the Republican Party and its going to evolve over time but its never going to lose that America first mindset and that is a complete tribute to Trump.",
    "He pointed to the Republican Senate primaries in Ohio and Pennsylvania, where Trumps endorsed candidates notched just about one-third of the total vote.",
    "Trumps former vice president has maintained an aggressive travel schedule for months, raising speculation about a potential 2024 presidential bid.",
    "There are already a handful of Republicans positioning themselves as possible alternatives to Trump, though perhaps none as openly as Pence.",
    "In recent weeks, some of the GOPs biggest names have begun to brazenly take on the former president and the candidates whom he has endorsed.",
    "Trump really wants to relitigate 2020 and theres decreasing interest in doing that with Republican voters, one GOP consultant said.",
    "In the run-up to the Georgia primaries, for instance, a handful of Republican governors flocked to the state to campaign for Gov.",
    "Kemp was helped in the final days of his campaign by a triumvirate of influential Republican governors, including Arizona Gov.",
    "Most Republican primary voters still really like Donald Trump, but theyre also interested in whats next, the consultant said.",
    "Hes still the most powerful person in the party, but hes definitely seeing the limits of what he can do post-White House.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Republican voters are focused on stopping Bidens agenda, winning the midterms and ultimately retaking the White House.",
    "Naturally, people are going to notice that and take the opportunity to put themselves out there a little bit more.",
    "Pence also helped Kemp in the race, traveling to Georgia to campaign with him on the eve of the May 24 primary.",
    "I dont think [Trump] has ever looked as vulnerable as he does now, one Republican strategist said.",
    "Brian Kemp, who faced a Trump-backed primary challenge from former Sen. David Perdue (R-Ga.).",
    "That version of the Republican Party appears likely to stay, one Republican lobbyist said.",
    "Perdues loss was only the latest in a series of defeats for Trumps endorsed candidates.",
    "Trump has endorsed one of Rices challengers, South Carolina state Rep. Russell Fry.",
    "But we now see where that number is and its around a third or a little bit lower.",
    "The interventions by top Republicans havent been limited to Georgia.",
    "In fact, Pence himself hasnt done much to quell such speculation.",
    "You cant deny that he doesnt have an influence here, Heye said.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Is it becoming its own thing where it is more than Trump?",
    "MAGA is still mostly driven by Trump, the lobbyist said.",
    "Theyre not focused on 2020, but Trump is.",
    "Pete Ricketts and former New Jersey Gov.",
    "Chris Christie, a one-time Trump ally.",
    "Doug Ducey, Nebraska Gov.",
    "Yes."
  ]
}