{
  "id": 8514,
  "mediaId": 223,
  "date": "d2022-05-27T00:01",
  "headline": "Primary Results: Trump Repudiated, Republicans Enthused, Democrats Focused On Theoretical Issues",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/129/0492ae83-d128-4d3b-85b2-518278fbe61b.png",
  "link": "https://townhall.com/columnists/michaelbarone/2022/05/27/primary-results-trump-repudiated-republicans-enthused-democrats-focused-on-theoretical-issues-n2607877",
  "sentiment": "-0.726",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Barone",
  "authorUrl": "https://townhall.com/columnists/michaelbarone/",
  "termIds": [
    661,
    805,
    1147,
    1951,
    2095,
    2279,
    4325,
    146,
    428
  ],
  "sentences": [
    "The Georgia results do not bode well for Democratic governor candidate Stacey Abrams, who claimed baselessly that she won the 2018 election, and for the charges -- accepted and recounted as gospel by national Democrats and by Delta Air Lines, Coca-Cola and Major League Baseball corporate executives -- that state Republicans' changes in voting laws amounted to voter suppression.",
    "Less so in states with party registration, but even there Republicans ran well, winning 53% of the two-party primary vote last week in Pennsylvania and 55% in North Carolina, though Democrats have a 7-point edge in registration in Pennsylvania and a 4-point edge in North Carolina.",
    "View Cartoon\nIn states where voters are free to vote in either party's primary, Republican majorities of two-party turnout were far greater -- 67% in Texas on March 17, 65% in Ohio last week, 62% in Georgia and 79% in Alabama and Arkansas this week.",
    "A Supreme Court reversal of Roe v. Wade, along the lines of Justice Samuel Alito's draft opinion, would mean that Republicans in some states could ban abortions or, more likely, impose restrictions like those in much of Europe.",
    "My estimate is that most abortions would continue to be allowed in states where, according to the pro-abortion rights Guttmacher Institute, 75% to 80% of current abortions are performed.",
    "Michael Barone is a senior political analyst for the Washington Examiner, resident fellow at the American Enterprise Institute and longtime co-author of The Almanac of American Politics.",
    "But the numbers in the ranks of that theory class seem to be dwindling, as voters focus on issues -- inflation, immigration, crime -- on which policy could make a difference.",
    "So, you have the Democratic candidate for governor of Georgia campaigning against \"voter suppression,\" which hasn't been a significant factor in more than 50 years.",
    "It's a party that loves leaders who take on the predominantly liberal media, but it wants them to be effective policymakers too, like Florida Gov.",
    "The man he persuaded to get into the race, on the single issue of relitigating the 2020 election, former Sen. David Perdue, won only 22%.",
    "The Republican Party, in the state where the issue was raised most vociferously, is a party ready to move on, beyond the 2020 election.",
    "On top of that, the man Trump blamed even more than Kemp, Secretary of State Ben Raffensperger, was re-nominated with 52% of the vote.",
    "And you have Democrats like Pennsylvania governor nominee Attorney General Josh Shapiro campaigning heavily on the abortion issue.",
    "That's what a record number of Republican primary voters in Georgia administered to former President Donald Trump this Tuesday.",
    "As for Republicans, the theory pushed by Trump and some followers is that somehow the 2020 election result could be reversed.",
    "Kemp didn't just win far more than the 50% needed to avoid a runoff, he won more than 50% in 158 of Georgia's 159 counties.",
    "His Trump-endorsed opponent, Rep. Jody Hice, carried only a few small counties outside his old congressional district.",
    "Republican primary voters are not Trump's chess pawns, and Trump for that matter is nothing like a chess grandmaster.",
    "Only in Oregon did Democrats outvote Republicans but by a narrower margin (55-45) than in the 2020 election (56-40).",
    "A white-majority congressional district in Georgia elected the black minister Andrew Young to Congress in 1972.",
    "Last week, based on the results from earlier primaries, I wrote that it's \"not exactly Trump's party\" anymore.",
    "It's what I call, turning Thorstein Veblen upside down, politics as the leisure of the theory class.",
    "It's an example, rather, of an affliction common among high-education partisans of both parties.",
    "It's the cultivation of obsolete ancient grievances and the proclamation of unachievable goals.",
    "It's a party that is also faring better than usual for an opposition party in the off year.",
    "Republican turnout nearly doubled, up 92%, from 2018, and Democratic turnout was up 28%.",
    "This ain't what Jim Crow looked like in the pre-1965 Voting Rights Act Deep South.",
    "Ron DeSantis or Arkansas Sen. Tom Cotton or former Vice President Mike Pence.",
    "The man he blamed for not contesting his narrow 2020 loss in the state, Gov.",
    "Turnout in primaries is a good indicator of partisan enthusiasm.",
    "\"Jim Crow on steroids,\" in President Joe Biden's words.",
    "Brian Kemp, won renomination with 74% of the vote.",
    "But the practical effect would be limited.",
    "That's not entirely a theoretical matter.",
    "This week's results underline that.",
    "Complete and utter repudiation.",
    "But voter turnout was robust."
  ]
}