{
  "id": 8515,
  "mediaId": 1576,
  "date": "d2022-05-27T00:00",
  "headline": "'I'll still teach the same way,' Atlanta teacher says despite new 'divisive concepts' law",
  "image": "https://www.wabe.org/app/uploads/2022/05/Divisive_Concepts_6-416x234.jpg",
  "link": "https://www.wabe.org/?p=288561",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    6215,
    6109,
    2555,
    2590,
    2672,
    6242
  ],
  "sentences": [
    "Were planning [for them to] go to the state Capitol so they can become more engaged and understand who the people represent them, and how they can see, hear and have their voices heard through their representatives.",
    "Making It Relevant\nBecause this is an American Government class, Howard Knight has been teaching her students about several of the bills the legislature passed this year, including divisive concepts.",
    "Ill still teach the same way because as a teacherI dont give my personal opinion, I just give the facts and make sure that they have an accurate depiction of what history is all about, she says.",
    "Howard Knight goes through several more examples: a teacher who made Black students pick cotton as part of a lesson on slavery; a racist promposal; and white celebrities in blackface.",
    "Corinthia Howard Knight, teacher at Atlantas Frederick Douglass High School\nHoward Knight then moves through a series of slides of racist incidents that have caught media attention.",
    "Theres a general consensus that the questions are silly  ranging from things like, Cross out the shortest word in this sentence, to Draw a line through the last word in this line.",
    "How can you not teach intersectionality when you have to teach about the lived experiences of people throughout history, with different identities and different experiences?",
    "Some critics of the new law have said it could have a chill effect, meaning teachers will shy away from ANY conversations about race because they dont want to be penalized.",
    "Howard Knight explains that even though the questions on the test may seem ridiculous now, they were a real impediment used to keep African Americans from voting.",
    "Thats basically what this law is all about: how can I as a school teacher sit here and actually talk about race in the classroom without offending others?",
    "The only Black student on a white basketball team in Laguna Hills, California endured racial slurs shouted at him by the opposing team during a game.",
    "Now remember, if you get one question wrong, that means that you cannot vote, Howard Knight reminds her class of the rules that existed at the time.",
    "They cant guide themselves in the world and when they see an adult calling a black person a monkey, theyll do the same thing once they get older.",
    "Yeah, you learn some things from your parents but you learn more things on the internet because nowadays they putting everything on the internet.",
    "Historical Accuracy\nLawmakers who drafted the divisive concepts bill say it shouldnt interfere with teaching history, as Howard Knight is doing.",
    "If we dont talk about race in the classroom, were going to continue to get this, she says, pointing to the slides of celebrities in blackface.",
    "Remember, these are current, this is nothing that took place two years ago, five years ago, this took place maybe like a month or two ago.",
    "You had people during this time period who actually wanted to vote, but they couldnt because this was one barrier that gave us, she says.",
    "But Corinthia Howard Knight, a teacher at Atlantas Frederick Douglass High School, isnt shying away from conversations about race.",
    "How are you going to teach three-fifths compromise if you cannot teach white supremacy and that the United States is racist?",
    "Students were a persistent voice at the Capitol this year, testifying about education bills and in some cases shaping them.",
    "So as you can see, the people who are surrounding him dont look like us or anything along that line, she says.",
    "But some teachers have wondered how they can accurately teach history without teaching about systemic racism.",
    "Howard Knight tells her students they need to talk about race so incidents like this dont keep happening.",
    "Its a literacy test like Black people used to have to take in the South during the Jim Crow era to vote.",
    "That includes teaching that the U.S. is systemically racist or that individuals are inherently racist.",
    "I just give the facts and make sure that they have an accurate depiction of what history is all about.",
    "The students mumble about the questions, one of which asks them to spell the word backwards forwards.",
    "Critics say the law is an attempt to stop teachers from mentioning race at all in the classroom.",
    "Pop Quiz\nOn a Wednesday in May, students in Knights American Government class are taking a test.",
    "Children are constantly watching adults because they have no one else to guide them, he says.",
    "They will have to participate in PTAs, theyll have to go to a city council meeting, she says.",
    "Howard Knight wants them to connect whats happening at the state Capitol to their own lives.",
    "On this particular day, she shows her class a bunch of slides, starting with one where Gov.",
    "Thats something Howard Knight wants for her students: to find their voices and use them.",
    "She lets them talk and work together during the test but sticks to the ten-minute limit.",
    "Think about some of the things that are dividing us in America at this time, she says.",
    "Its now illegal in Georgia to teach certain divisive concepts in K-12 public schools.",
    "Downer said during a recent press conference after Kemp signed the education bills.",
    "So this goes back to this is why its important to talk about race in the classroom.",
    "A note of disclosure: The Atlanta Board of Education holds WABEs broadcast license.",
    "They didnt know ahead of time and its not the kind of test theyre used to taking.",
    "So, in the coming years, she plans to show them how government works up close.",
    "How are you supposed to do this when it dont make sense in the first place?",
    "Fellow Douglass social studies teacher Anthony Downer says its impossible.",
    "Howard Knights students discuss why the white students acted this way.",
    "Can anybody think about some things at this point thats dividing us?",
    "Most of the people surrounding Kemp in the photo are white.",
    "A student named Keyon says they learned from their parents.",
    "All of Howard Knights ninth-graders are students of color.",
    "When times up, Howard Knight goes over the answers.",
    "Brian Kemp is signing a stack of education bills.",
    "Theyre likely to run into fellow students there.",
    "All right, very good, race, Howard Knight says.",
    "They have ten minutes to answer 30 questions.",
    "But another classmate has a different take.",
    "These are probably his constituents.",
    "I dont give my personal opinion.",
    "I agree and disagree, he says.",
    "Well, race, one student says.",
    "Ill still teach the same way.",
    "All right, everybody got it?",
    "Howard Knight isnt worried.",
    "Trending\nTop Stories",
    "one student asks."
  ]
}