{
  "id": 8517,
  "mediaId": 34,
  "date": "d2022-05-27T00:00",
  "headline": "Corporate Media Obsess About Trump, But Ignore Broad GOP Attack on Democracy",
  "image": "https://www.commondreams.org/sites/default/files/styles/author_image_large/public/2021-10/Julie-Hollar%281%29.png?h=a7e6d17b&itok=Ivk8AoJB",
  "link": "https://www.commondreams.org/views/2022/05/27/corporate-media-obsess-about-trump-ignore-broad-gop-attack-democracy",
  "sentiment": "-0.309",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julie Hollar",
  "authorUrl": "https://www.commondreams.org/author/julie-hollar",
  "termIds": [
    1147,
    1951,
    2095,
    2203,
    6160,
    428,
    501,
    525,
    6100,
    2672
  ],
  "sentences": [
    "For instance, just weeks before an uncritical editorial (1/4/21) praising him, the local Journal-Constitution published a front-page investigation (12/17/20) that found Raffensperger was touting inflated figures about the number of investigations his office was conducting related to the election, giving those seeking to sow doubt in the outcome a new storyline.",
    "Kemp oversaw the rejection of tens of thousands of voter registrations on technicalities like missing accents or typos (Atlantic, 11/7/18) and improperly purged hundreds of thousands of voters from the rolls prior to the 2018 election (Rolling Stone, 10/27/18), disproportionately impacting voters of color (Atlanta Journal-Constitution, 3/12/20).",
    "In the wake of an attempt to overturn the 2020 presidential election and continued efforts by the Republican Party to undermine democratic processes, corporate media remain fixated on Trumps role in the party, seeing the 2022 primaries as a series of referenda on Trump and his role as kingmaker.",
    "After this weeks state primaries, most corporate media made their lead story the losses of Trump-backed candidates, in particular to Kemp and Secretary of State Brad Raffensperger, who both played very public roles in refusing to bow to Trumps demands to find votes for him in Georgia in 2020.",
    "He aggressively investigated groups that helped register voters of color; in 2014, he launched a criminal investigation into Stacey Abrams New Georgia Projectwhich was helping to register tens of thousands of Black Georgians who previously hadnt votedcalling their activities voter fraud.",
    "During his re-election campaign, Raffensperger had gone on national television (CBS, 1/9/22) to push for a constitutional amendment prohibiting noncitizens from voting in any elections, as well as to praise photo ID requirements for voting and oppose same-day voter registration.",
    "He has also taken a hard-right stance on many other rights issues, signing into law a bill to prohibit divisive concepts from being taught in schools, a bill to ban abortions as early as six weeks and a bill discriminating against transgender kids in sports.",
    "In their obsession with Trumps win/loss record and their desperate search for moderate Republicans, journalists whitewash GOP candidates who paved the way for Trumpism and, ultimately, seek the same endminority ruleby only slightly different means.",
    "The Globes Jess Bidgood reported:\nKemps easy win over Perdue on Tuesday may seem to suggest that the former president and his baseless insistence that fraud and irregularities cost him the election have lost their iron grip on the Republican Party.",
    "In their obsession with Trumps win/loss record and their desperate search for moderate Republicans, journalists whitewash GOP candidates who paved the way for Trumpism and, ultimately, seek the same endminority ruleby only slightly different means.",
    "Like Kemp, he launched vote fraud investigations into progressive voter registration groups (AJC, 11/30/20), and oversaw the purge of nearly 200,000 voters, mostly people of color, from the rolls before the 2020 election (Democracy Now!, 1/5/21).",
    "The problem is, candidates like Kemp and Raffensperger are not moderate, except in comparison to Trumpand painting the story as one centrally about Trump obscures the anti-democratic nature of those who defeated his hand-picked candidates.",
    "He refused to recuse himself from overseeing his own race for governor against Abrams, drawing rebukes from former president, Georgia native and fair elections advocate Jimmy Carter (The Nation, 10/29/18), among others.",
    "But the focus on Trump obscures the even more important story that Trump represents: the GOP assault on democracy, which is being carried out only marginally less aggressively by many of those defeating him.",
    "As FAIR (3/5/21) pointed out at the time, centrist media fawned over Raffensperger for standing up to Trump in the 2020 election, ignoring his support of the little lies that made the Big Lie possible.",
    "The Boston Globe demonstrated that this contradiction could be addressed, with an article (5/24/22) headlined, Kemp Cruises to Victory in Georgia, Dealing Blow to Trump but Not His Voter Fraud Lies.",
    "Journalists tell this story over and over in coverage of Democratic primaries, with move to the center stories encouraging the party to reject its progressive candidates.",
    "As governor, Kemp has further eroded voting rights in Georgia, as mentioned by the Globe (a story that the media managed to both-sides at the timeFAIR.org, 4/8/21).",
    "These are stories centrist media like to tell: The voters are sensibly rejecting extremists from their party, so the moderate candidates are taking the right path.",
    "Even though he stood up to Trumps attempts to overturn the 2020 election, Kemp found other ways to assuage the GOP bases unfounded doubts about the issue.",
    "He signed a voting bill that added new hurdles to absentee voting and handed some election oversight power over to the Republican-controlled legislature.",
    "As Georgias secretary of state, Kemp for years vigorously promoted false election fraud stories and made Georgia a hotspot for undermining voting rights.",
    "None of Kemps history as antivoting rights secretary of state was mentioned in any of the next-day election coverage FAIR surveyed.",
    "Brian Kemp and Brad Raffensperger, the secretary of state, handed the former president his biggest primary season setback so far.",
    "Like Kemp, Raffensperger was an early supporter of Trump who pushed election fraud stories and voter suppression tactics.",
    "They are doing everything they can to defend the status quo, squash dissent and protect the wealthy and the powerful.",
    "But even this didnt go nearly far enough in describing Kemp and Raffenspergers histories of attacking voting rights.",
    "The Washington Post (5/24/22) declared, Kemp, Raffensperger Win in Blow to Trump and His False Election Claims.",
    "The countrys centrist corporate media have decided what this years primaries are mainly about: Donald Trump.",
    "(There was an opinion piece on CNN.com on May 26 that detailed Kemps appalling anti-democracy conduct.)",
    "He spoke of election integrity everywhere he went, while Raffensperger leaned into the issue as well.",
    "Thousands of small donations fund our newsroom and allow us to continue publishing.",
    "He has also called for an expansion of law enforcement presence at polling sites.",
    "His investigation ultimately uncovered no wrongdoing (New Republic, 5/5/15).",
    "Those claims helped propel the states 2020 bill restricting voting rights.",
    "A New York Times (5/24/22) subhead read, The victories in Georgia by Gov.",
    "At Reuters (5/24/22), the top takeaway subhead read: Trump Takes Lumps.",
    "Kemp ran that governors race as a Trump conservative.",
    "The Common Dreams media model is different.",
    "The 1% own and operate the corporate media.",
    "We cover the news that matters to the 99%.",
    "Brian Kemp is the perfect example of this.",
    "To ignite change for the common good.",
    "We can't do it without you.",
    "No selling of your data.",
    "With no advertising.",
    "Free to republish.",
    "Reader-supported.",
    "We've had enough.",
    "Can you chip in?",
    "Free to share.",
    "Free to read.",
    "No paywalls.",
    "Our mission?",
    "Independent.",
    "Georgia Gov.",
    "To inspire.",
    "Nonprofit.",
    "To inform.",
    "Thank you.",
    "How?"
  ]
}