{
  "id": 8621,
  "mediaId": 21,
  "date": "5/30/2022 12:00:00 AM",
  "headline": "Trump angrily attacked Perdue as 'lazy' for losing his primary, report says  a criticism more often used of Trump himself",
  "image": "https://i.insider.com/6294ab2fff955c0019c5f6fb?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-says-perdue-lazy-georgiaa-governor-primary-defeat-wapo-2022-5",
  "sentiment": "-0.858",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Porter",
  "authorUrl": "https://www.businessinsider.com/author/tom-porter",
  "termIds": [
    1147,
    2087,
    2095,
    2203,
    2279,
    2429,
    3094,
    4325,
    428,
    525,
    2672
  ],
  "sentences": [
    "Trump staked a large amount of political capital on the races in Georgia, where he wanted revenge on Kemp and Raffensperger for their refusal to endorse his bogus claim that he lost the state to Joe Biden in 2020 because of fraud.",
    "Trump over the weekend continued his attempts to reshape the GOP, holding a rally in Wyoming as part of his campaign to unseat Rep. Liz Cheney, a high-profile Republican critic who is sitting on the Jan 6 commission.",
    "Perdue is a former US senator, and lost his seat in a closely fought runoff early in 2021 where some Republicans critics blamed Trump's fixation with pushing election fraud claims for driving down GOP turnout.",
    "Former President Donald Trump was furious that his endorsed candidate David Perdue's lost the Republican gubernatorial primary in Georgia, and lashed out at him as \"lazy,\" The Washington Post reported.",
    "Trump's endorsement strategy has suffered setbacks in a series of primaries, most acutely in Georgia last week where two of his endorsed candidates slumped to defeat in their primaries.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Advisors to Trump told the Post that the former president now sees the candidates he endorsed in the races as \"embarrassments,\" adding that he considered Perdue lazy.",
    "Trump also spent plenty of time off the clock playing golf, far exceeding the number of rounds he had repeatedly criticized Barack Obama for playing while president.",
    "White House documents suggested he blocked out large sections of the day to watch coverage of himself on cable TV and would not bother reading briefings.",
    "Republican gubernatorial candidate David Perdue campaigning on May 20, 2022, in Plainville, Georgia, to be made the GOP nominee for governor.",
    "The former president campaigned for Perdue, who based his campaign around promoting Trump's election-fraud \"Big Lie.\"",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Joe Raedle/Getty Images\nDonald Trump lashed out at his defeated endorsees in Georgia, The Washington Post reported.",
    "In the secretary of state race, incumbent Brad Raffensberger defeated the Trump-backed challenger, Jody Hice.",
    "The losses deprived Trump of revenge on Georgia officials who disputed his election-fraud \"Big Lie.\"",
    "Perdue was thrashed by incumbent Brian Kemp, getting 21% of the vote compared to Kemp's 73%.",
    "He reportedly insulted David Perdue  who was seeking the governor nomination  as \"lazy.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Trump gave $2.64 million to Perdue's campaign from his own political warchest.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Trump himself faced accusations of laziness while in office.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "He came second."
  ]
}