{
  "id": 8710,
  "mediaId": 34,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "'Let Us Finally Do Something': Biden Pleads for Gun Control Amid Mass Shooting Surge",
  "image": "https://www.commondreams.org/sites/default/files/styles/social_share_image/public/2022-06/Biden-gun-speech-Getty.jpg?h=75a6bd63&itok=L_ckOB7O",
  "link": "https://www.commondreams.org/news/2022/06/02/let-us-finally-do-something-biden-pleads-gun-control-amid-mass-shooting-surge",
  "sentiment": "0",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brett Wilkins",
  "authorUrl": "https://www.commondreams.org/author/brett-wilkins",
  "termIds": [
    2095
  ],
  "sentences": [
    "The president's remarks came amid a nationwide wave of mass shootings including the May 14 white supremacist slaughter of 10 people at a Buffalo, New York supermarket, the May 24 massacre of 19 children and two teachers at an Uvalde, Texas elementary school, and Wednesday's murder of four staff and patients at a Tulsa, Oklahoma medical center.",
    "President Joe Biden on Thursday delivered an urgent appeal for what advocates say are common-sense firearm control measures in the wake of recent massacres and a national culture of violence in which guns have claimed more lives over the past half-century than all the wars in U.S. history combined.",
    "An Economist/YouGov survey of 1,500 U.S. adults conducted in the wake of the Uvalde massacre found that 51% of respondents believe that \"school shootings are a mental health problem, not a guns problem,\" while 41% said they disagree with that statement and 9% said they're unsure.",
    "While 80% or more Democrats favor creating a federal database to track all gun sales and banning both assault-style weapons and high-capacity ammunition magazines that hold more than 10 rounds, majorities of Republicans oppose these proposals.",
    "Most Republicans, on the other hand, support allowing people to carry concealed guns in more places (72%) and allowing teachers and school officials to carry guns in K-12 schools (66%).",
    "\"My fellow Americans, enough,\" Biden said after walking to a podium along a hallway lit by 56 candles representing every U.S. state and territory that has suffered acts of gun violence.",
    "\"The fact that the majority of the Senate Republicans don't want any of these proposals even to be debated or come up for a vote, I find unconscionable,\" Biden said during his speech.",
    "Joe Manchin of West Virginia and Arizona's Kyrsten Sinema oppose abolishing the filibuster, which GOP lawmakers have used to block gun control and other Democratic legislation.",
    "Meanwhile, the firearm industry lobbyled by the National Rifle Associationspends tens of millions of dollars lobbying GOP lawmakers to stymie even the most rudimentary reform.",
    "The archive lists 233 mass shootingsdefined as incidents in which at least four people are shotthis year, including 20 since the Robb Elementary School massacre in Texas.",
    "Biden called for reforms including a renewed ban on so-called assault rifles, stricter background check laws, and raising the legal age to purchase firearms to 21.",
    "\"Over the last two decades, more school-age children have died from guns than on-duty police officers and active-duty military combined,\" the president noted.",
    "\"Over the last two decades, more school-age children have died from guns than on-duty police officers and active-duty military combined.",
    "\"I'll never give up, and if Congress fails, I believe this time, a majority of the American people won't give up either,\" he vowed.",
    "Brian Kemp last month signed a bill allowing permitless concealed firearm carry for almost all adults, while Texas Gov.",
    "Overall, around 60% of Americans support a ban on assault-style rifles and high-capacity magazines, according to Pew.",
    "They are doing everything they can to defend the status quo, squash dissent and protect the wealthy and the powerful.",
    "A September 2021 Pew Research Center survey found that:\n[Gun control] proposals bring out stark partisan rifts.",
    "This, despite numerous studies showing higher rates of mass shootings in states with looser gun control laws.",
    "\"I believe the majority of you will act to turn your outrage into making this issue central to your vote.",
    "According to the Gun Violence Archive, there have been 18,228 U.S. firearm deaths so far in 2022.",
    "More people have also died from gunshot wounds since 1968 than in all U.S. wars combined.",
    "The shooters in all three incidents were armed with AR-15-style semi-automatic rifles.",
    "Thousands of small donations fund our newsroom and allow us to continue publishing.",
    "The Tulsa gunman bought his rifle just over two hours before killing his victims.",
    "These proposals are supported by just 20% and 24% of Democrats, respectively.",
    "Greg Abbott, also a Republican, signed similar legislation last year.",
    "Instead of tightening gun laws, numerous states have relaxed them.",
    "Our work is licensed under Creative Commons (CC BY-NC-ND 3.0).",
    "However, it's not just Republicans who are thwarting reform.",
    "\"The question now is, what will the Congress do?\"",
    "\"How much more carnage are we willing to accept?\"",
    "How much more carnage are we willing to accept?\"",
    "The 1% own and operate the corporate media.",
    "The Common Dreams media model is different.",
    "We cover the news that matters to the 99%.",
    "\"It's time for each of us to do our part.\"",
    "Feel free to republish and share widely.",
    "To ignite change for the common good.",
    "Right-wing Democrats including Sens.",
    "Let's hear the call and the cry.",
    "Let's hear the call and the cry.",
    "\"We need to act,\" he continued.",
    "\"For the children we've lost.",
    "For the children we can save.",
    "\"For the children we've lost.",
    "For the children we can save.",
    "Let us finally do something.\"",
    "For example, Republican Gov.",
    "We can't do it without you.",
    "No selling of your data.",
    "Enough, enough, enough.\"",
    "Let's meet the moment.\"",
    "For the nation we love.",
    "For the nation we love.",
    "Let's meet the moment.",
    "With no advertising.",
    "Free to republish.",
    "Reader-supported.",
    "We've had enough.",
    "Can you chip in?",
    "Free to share.",
    "Free to read.",
    "No paywalls.",
    "Independent.",
    "Our mission?",
    "Biden asked.",
    "To inspire.",
    "Nonprofit.",
    "To inform.",
    "Thank you.",
    "How?"
  ]
}