{
  "id": 8717,
  "mediaId": 195,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Two words explain why Trump won't run in 2024",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/trumpdonald_010920_ap-Evan-Vucci_trump.jpeg?strip=1&w=640",
  "link": "https://thehill.com/opinion/campaign/3508270-two-words-explain-why-trump-wont-run-in-2024/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Myra Adams",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1237,
    1434,
    2095,
    2203,
    4325,
    6334,
    6395,
    2661,
    2672
  ],
  "sentences": [
    "But they're not surprising since the former president's primary challengers  former Sen. David Perdue (R-Ga.) and Rep. Jody Hice (R-Ga.)  were Trump stand-ins specifically chosen to promote the Big Lie  his perpetual mantra about the stolen 2020 election.",
    "Trump's repudiation in Georgia has Republicans speculating about his declining kingmaking powers, openly defying him as he loses his vice-like grip on the party and potentially endangering his front-runner status.",
    "Moreover, during a second reelection campaign, the former president would be hard-pressed to use the same predictive excuse first heralded in a May 25, 2020, Politico headline: Trump sees a rigged election' ahead.",
    "But here is why I could be wrong:\nI asked Mark McKinnon, the co-host of Showtime's The Circus and the last presidential strategist to win the reelection of a Republican president  George W. Bush in 2004.",
    "Ron DeSantis's recent fundraising email was ostensibly for his reelection campaign but packed with poll-tested, red-meat phrases to gin up the national MAGA base without its baggage-laden founder.",
    "Of course, the Big Tease has been an effective fundraising platform, banking more than $100 million for Trump's PACs while solidifying his duel status as king of the GOP and MAGA world.",
    "We begin with fear, indirectly drilled into young Donald Trump's psyche by Fred, his authoritarian father, who demanded that his son always win and show strength but never weakness.",
    "The browser does not support the specified video codec\nWhenever two or more politically active people engage in conversation, invariably someone asks, Will Donald Trump run in 2024?",
    "And again, on Aug. 17, 2020, a Hill headline quoted the president's losing rationale: Trump: The only way we're going to lose this election is if the election is rigged.'",
    "I firmly believe that the Republican version of the future is Trumpism without Trump  anticipating the next generation of leadership, and DeSantis, age 43, fits the bill.",
    "The notion that he would simply exit stage left because of some political reality, self-reflection, or awareness flies in the face of everything we've learned about him.",
    "Those grueling family dynamics were chronicled in Mary Trump's book Too Much and Never Enough, subtitled How my family created the world's most dangerous man.",
    "Then, amazingly, on Tuesday, Trump activated his go-to playbook, writing his followers, ICYMI: Something Stinks In Georgia,' explaining why his nemesis, Gov.",
    "So, circling back to the most-asked question, my new answer is Trump won't run in 2024  based on personality traits rooted in the words fear and fight.",
    "Reportedly, Trump was stunned by the results and headlines such as The Washington Post's Trump rebuked with stinging losses in Georgia GOP contests.",
    "Then, during a television appearance on Dec. 3, 2020, Mary explained, It's impossible for Trump to believe that he lost the election.",
    "My standard answer is always I have no idea  until last week when Trump's much-ballyhooed vendetta campaigns to defeat Georgia Gov.",
    "Meanwhile, a fighting bench is forming with numerous former and current officeholders unlikely to bow to Trump's crowning demands.",
    "Usually, the 45th president loves fighting, but fighting for his party's nomination is now beneath his stature and shows weakness.",
    "Stone, a colorful political operative, is Trump's longtime consultant and confidant who received a presidential pardon in 2020.",
    "She is a RealClearPolitics contributor and served on the creative team of two GOP presidential campaigns in 2004 and 2008.",
    "Thus, King Trump wants and believes he deserves the 2024 crown delivered to his Mar-a-Lago palace on a blue satin pillow.",
    "McKinnon replied:\nTrump will never concede the stage or the spotlight to anyone else unless he's in prison or a hospital.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Then in his second reelection campaign, Cleveland won the Electoral College and the popular vote for the third time.",
    "By comparison, Trump has never won the popular vote  a fact that must haunt his ego and heighten his fear of 2024.",
    "In a text message, he wrote:\nI think he [Trump] wants to run, is inclined to run, has not made a decision to run.",
    "Furthermore, Trump's fear of running and losing reelection a second time is not assuaged by presidential history.",
    "And now, since I don't believe that Trump will run again, it's a good time to solicit Roger Stone's opinion.",
    "Most prominent is former Vice President Mike Pence, who is actively campaigning focusing on the future.",
    "Yes, is the answer that brings us to fight  the second word explaining why Trump will not run in 2024.",
    "Cleveland, a Democrat, was first elected in 1884 after winning the popular vote and Electoral College.",
    "In 1892, Grover Cleveland was the first and only former president to win the office nonconsecutively.",
    "In his 1888 reelection defeat, Cleveland lost the Electoral College but still won the popular vote.",
    "That inability is why Trump can't let go of 2020 and will tease a 2024 run for as long as possible.",
    "Donald Trump's niece is a Ph.D. clinical psychologist whose best-seller was published in July 2020.",
    "But, ultimately, Trump's fear of losing is likely stronger than his willingness to take the risk.",
    "To recap: Trump won't run because he fears losing and does not want to fight for the nomination.",
    "If he chooses to, I don't think he could be stopped for the nomination, and I would be for him.",
    "Brian Kemp and Secretary of State Brad Raffensperger ended in embarrassing anti-Trump failures.",
    "But there is a striking political difference between Trump and Cleveland's win-loss record.",
    "Why else would Trump have excessively teased his run and still not made a decision?",
    "This is a precisely accurate reflection of my conversation with him on this topic.",
    "Consequently, Trump developed an unnatural fear of losing or being called a loser.",
    "It is fitting to conclude with a favorite Trump quote: We'll see what happens.",
    "Fred taught Donald that he could lie or twist the truth but never back down.",
    "Myra Adams writes about politics and religion for numerous publications.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "But between the lines in Stone's message, I read, fear.",
    "Democrats see a constitutional crisis in the making.",
    "He's not licking his wounds, he's licking his chops.",
    "Brian Kemp, won 73.7 percent of the primary vote.",
    "And is there any difference between the two?",
    "Every defeat is someone else's fault.",
    "Follow her on Twitter @MyraKAdams.",
    "Stay tuned for that explosion.",
    "Every victory is his alone.",
    "Meanwhile, in Florida, Gov."
  ]
}