{
  "id": 8718,
  "mediaId": 65,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Stacey Abrams on board of foundation awarding millions to woke professors pushing prison abolition, CRT",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/012cb5db-d77e-4991-b06f-829049b39ebb/a38cd4f8-476b-40bf-a71d-0469c3c53c52/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/stacey-abrams-foundation-woke-professors-prison-abolition-crt",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Chasmar",
  "authorUrl": "https://www.foxnews.com/person/c/jessica-chasmar",
  "termIds": [
    2095
  ],
  "sentences": [
    "Other recipients of the 2021 Freedom Scholars Awards included Anglica Chzaro, a Critical Race Theory (CRT) professor at the University of Washington School of Law who advocates for prison abolition, and Amna Akbar, an Ohio State University professor and proponent of \"movement law,\" which she describes as the \"approach to legal scholarship grounded in solidarity, accountability, and engagement with grassroots organizing and left social movements.\"",
    "Garca Pea, who is now a professor in Tufts University's Department of Studies in Race, Colonialism, and Diaspora, argued in June 2020 that ethnic studies is an \"urgent\" area of study \"from elementary schools up to college,\" because it is \"charged with filling in the immense gap left by our Eurocentric education systems.\"",
    "In December, the Marguerite Casey Foundation and Group Health Foundation announced the recipients of the 2021 Freedom Scholars Awards, which gave $250,000 to each of six professors who are \"leading research in critical fields including abolitionist, Black, feminist, queer, radical, and anti-colonialist studies.\"",
    "( Elijah Nouvelage/Bloomberg via Getty Images)\nAnother professor awarded $250,000 by the Marguerite Casey Foundation was Lorgia Garca Pea, a former Latinx-studies professor at Harvard University whose tenure was rejected in 2019, sparking weeks of protests at the Ivy League school.",
    "The foundation also awarded $250,000 to Charlene Carruthers, founder of the Black Youth Project 100, which she described in 2019 as \"a political home for anti-capitalists, radical Black feminists, abolitionists, artists, educators and many more types of freedom fighters.\"",
    "Those recipients included Alisa Bierria, a gender studies professor at UCLA who recently argued that the possible overturning of Roe v. Wade signaled \"a broader attitude by this government that treats women's lives as disposable and trans people's lives as disposable.\"",
    "\"I was part of a program, Freedom Universitywhich created a parallel university system to support University of Georgia's undocumented students when the governor banned their enrollmentand because we had students and we had teachers we had a school,\" Garca Pea said.",
    "Abrams, who is taking another shot at running for Georgia governor, is currently listed as a board member at the Seattle-based Marguerite Casey Foundation, a private grant-making foundation named after Marguerite Casey, the sister of UPS founder Jim Casey.",
    "FIRST ON FOX: Stacey Abrams serves as a board member of a UPS family foundation that awards millions of dollars to professors and scholars who advocate anti-capitalist and prison abolitionist views, Fox News Digital has learned.",
    "\"What we teach at every school right nowwhat we consider to be the standard humanities and social science curriculumis actually grounded in white supremacy, but is masked as objectivity,\" she told Boston Review at the time.",
    "Abrams, who has tried to distance herself from the hardline rhetoric of the #DefundThePolice movement in the past, has received at least $52,500 in income from the foundation, according to her financial disclosures.",
    "During the same interview, Garca Pea said she \"was part of a program\" called \"Freedom University\" at the University of Georgia, which supported \"undocumented students when the governor banned their enrollment.\"",
    "One of the professors who received an award was Robin D. G. Kelley, who teaches African American history at the University of California, Los Angeles (UCLA) and has argued that capitalism is inherently racist.",
    "The $1.5 million annual award, established in 2020, \"counters the limited financial resources and research constraints frequently faced by scholars whose work supports social movements,\" the foundation said.",
    "(Elijah Nouvelage/Bloomberg via Getty Images)\nAbrams' campaign told Fox News Digital last week that Abrams, who joined the foundation's board in May 2021, does not hold the same views as the foundation.",
    "If elected, she will be in charge of appointing members to seven-year terms on the Board of Regents, which oversees the public colleges and universities that comprise the University System of Georgia.",
    "Abrams' campaign did not immediately respond to Fox News Digital's separate inquiry about whether she supports the Marguerite Casey Foundation's efforts to fund the aforementioned academics.",
    "The foundation also awarded $250,000 to Ananya Roy, an urban studies professor at UCLA who has argued in support of abolishing private property, which she says is rooted in whiteness.",
    "During another segment of the NPR interview titled, \"There are no utopias,\" Kelley argued that a truly communist country has never existed throughout history.",
    "\"I'm the last one to defend what actually becomes, in the case of Soviet Union, for example, not socialism at all, but state capitalism that's redistributive.",
    "\"I was involved in a study group organized by the All-African People's Revolutionary Party, AAPRP, and we'd study Walter Rodney, Frantz Fanon, C.L.R.",
    "And even if you could create a capitalism that's somehow non-racial, which of course, is impossible - but let's say in theory you can do that.",
    "According to the New Yorker, some members had complained that Garca Pea's work amounted to activism rather than scholarship.",
    "CLICK HERE TO GET THE FOX NEWS APP\nAbrams, the Georgia gubernatorial Democratic nominee, will face Republican Gov.",
    "\"And it's like, of course, you've got to be a historian to be a real good communist, not the other way around.\"",
    "\"I'm the first to say that what we think of as state socialism or communism has been a disaster,\" he said.",
    "She also supports the government using eminent domain to turn hotels into housing for the homeless.",
    "During the same NPR interview, Kelley said his \"goal\" growing up was to be a \"communist for life.\"",
    "The far-left foundation has repeatedly voiced support for defunding and abolishing the police.",
    "In a February NPR segment, Kelley said, \"The secret to capitalism's survival is racism.\"",
    "China did amazing things in terms of being able to raise the basic standard of living.",
    "In 2020, the Marguerite Casey Foundation awarded $3 million to its Freedom Scholars.",
    "Story tips can be sent to Jessica.Chasmar@fox.com and on Twitter: @JessicaChasmar.",
    "\"Literally, that is all you need, and then everything else is extra.",
    "So it's critical to support students and support their demands.\"",
    "We still have deep exploitation and inequality produced by it.\"",
    "\"So any true liberation has to be anti-capitalist,\" he said.",
    "We don't have a communist country anywhere in the world.",
    "This is where I got the real education,\" Kelley said.",
    "But China is a state capitalist neoliberal society.",
    "Jessica Chasmar is a reporter for Fox News Digital.",
    "I wanted to make revolution,\" he continued.",
    "James, Angela Davis, I mean, Kwame Nkrumah.",
    "Brian Kemp for a second time in November.",
    "\"There's no way capitalism can save us.",
    "\"I wanted to be a communist for life.",
    "That's what the Soviet Union became.",
    "So this was outside the classroom.",
    "We've never actually had one.",
    "And China's the same thing.",
    "It has never happened.\""
  ]
}