{
  "id": 8731,
  "mediaId": 18,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "AP Top News at 11:52 p.m. EDT",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/04/US-NEWS-CORONAVIRUS-NY-GET.jpg?w=1569",
  "link": "https://www.bostonherald.com/2020/04/20/ap-top-news-at-146-p-m-edt/?share=twitter",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Some US producers, states reopening amid political pressure\nSeoul says no suspicious activity in North amid Kim concerns\nTrump says he'll suspend immigration,' offers no details\nWhat you need to know today about the virus outbreak\nRampage leaves 18 dead in Canada's worst mass shooting\nOil price goes negative as demand collapses; stocks dip\n3 killed by suspected tornado, lightning as storms hit South\nMid-April in America is an unforgiving time, and now this\n2 types of testing look for COVID-19 infections new and old\n4/20 uncertainty: Marijuana industry tested in virus crisis",
    "Royal Canadian Mounted Police Chief Superintendent Chris Leather told a news conference Monday that police expect to find more victims once they are able to comb through all the crime scenes, some of which were houses set ablaze as victims were inside, adhering to government calls to stay at home because of the coronavirus pandemic.",
    "For a generation, mid-April has delivered some of American life's most cataclysmic moments  a week when young men have shot up schools, terrorists have blown up fellow humans, members of a religious sect have burned to death in their compound and environmental calamity has sullied the ocean.",
    "Boeing is among a small number of manufacturers around the U.S. that geared up Monday to resume production amid pressure from President Donald Trump to reopen the economy and resistance from governors who warn there is not enough testing yet to keep the new coronavirus from rebounding.",
    "TORONTO (AP)  Police fanned out across more than a dozen crime scenes Monday after a rampage by a gunman disguised as a police officer left at least 18 dead and homes in smoldering ruins in rural communities across Nova Scotia  the deadliest mass shooting in Canada's history.",
    "Trump has taken credit for his restrictions on travel to the U.S.\nBoeing said it will put about 27,000 people back to work this week building passenger jets at its Seattle-area plants, with virus-slowing precautions in place, including face masks and staggered shifts.",
    "Now, as those traumatic, unwelcome anniversaries of the past 27 years roll by in the space of a single spring week, overlay one of the most disruptive moments in all of American history, even as it is still unfolding: the coronavirus, and the efforts to contain it.",
    "Traders are still paying more than $20 for a barrel of U.S.\nHEADLAND, Ala. (AP)  Suspected tornadoes killed at least two people as severe weather blasted the Deep South, and a house fire believed started by lightning claimed a third person, officials said Monday.",
    "LOS ANGELES (AP)  The unofficial holiday celebrating all things cannabis arrives Monday as the nation's emerging legal marijuana market braces for an economic blow from the coronavirus crisis, with many consumers reducing spending or going underground for deals.",
    "SEATTLE (AP)  Boeing and at least one other U.S. heavy-equipment manufacturer resumed production and some states rolled out aggressive reopening plans Monday, despite nationwide concerns there is not enough testing yet to keep the coronavirus from rebounding.",
    "SEOUL, South Korea (AP)  South Korea's presidential office says no suspicious activities have been detected in North Korea, a statement made Tuesday after reports surfaced that Kim Jong Un was in fragile condition after recent heart surgery.",
    "In light of the attack from the Invisible Enemy, as well as the need to protect the jobs of our GREAT American Citizens, I will be signing an Executive Order to temporarily suspend immigration into the United States!",
    "Boeing said it was putting about 27,000 people back to work this week building passenger jets at its Seattle-area plants, with virus-slowing precautions in place, including face masks and staggered shifts.",
    "BANGKOK (AP)  Asian shares skidded on Tuesday after U.S. oil futures plunged below zero as storage for crude runs close to full amid a worldwide glut as demand collapses due to the pandemic.",
    "WASHINGTON (AP)  President Donald Trump said Monday that he will sign an executive order to temporarily suspend immigration into the United States because of the coronavirus.",
    "Currently, almost all testing in hospitals, clinics and drive-thru sites uses the first testing method, to help doctors detect and treat people with active COVID-19.",
    "Shares fell in Tokyo, Hong Kong and Shanghai but New York stock futures edged higher after the S&P 500 sank 1.8% overnight, giving up some big gains from last week.",
    "Jerry Oliver Williams, 61, died late Sunday night when winds flipped the home Williams shared with his wife and child in a rural Alabama county, authorities said.",
    "Kemp said gyms, hair salons, bowling alleys and tattoo parlors could reopen Friday, as long as owners followed strict social distancing and hygiene requirements.",
    "Earlier, Daily NK had cited anonymous sources saying Kim was recovering from heart surgery in the capital Pyongyang and that his condition was improving.",
    "WASHINGTON (AP)  Testing is critical to controlling the coronavirus and eventually easing restrictions that have halted daily life for most Americans.",
    "There are still just two main types in the U.S. One tells you if you have an active infection with the coronavirus, whether you have symptoms or not.",
    "Virtual parties and video chats are replacing vast outdoor smoking sessions to mark the rise of legalization and celebrate cannabis culture.",
    "Later, another US official told the same network that the concerns about Kim's health are credible but the severity is hard to assess.",
    "It was supposed to be a long weekend of festivals and music culminating on April 20, or 4/20, the code for marijuana's high holiday.",
    "Maryland secured 500,000 tests from South Korea after the governor's Korean American wife negotiated the shipment.",
    "In a stunning development, the cost to have a barrel of U.S. crude delivered in May plummeted to negative $37.63.",
    "His wife and child were with him, and they were OK, said Coroner Derek Wright of Alabama's Henry County.",
    "The modest reopenings come amid protests in some states by people who say it's time to get back to work.",
    "Officials said the suspect, identified as 51-year-old Gabriel Wortman, also died in the weekend attack.",
    "CNN had cited an anonymous U.S. official who said Kim was in grave danger after an unspecified surgery.",
    "Instead, it has been reduced to an online replica because of stay-at-home orders to curb the pandemic.",
    "But there's been confusion about what kinds of tests are available and what they actually measure.",
    "The other checks to see if you were previously infected at some point and fought it off.",
    "He offered no details as to what immigration programs might be affected by the order.",
    "Brian Kemp announced plans to restart the state's economy before the end of the week.",
    "The White House did not immediately elaborate on Trump's tweeted announcement.",
    "The presidential Blue House said it couldn't confirm Kim's current health.",
    "He was in a mobile home, and the mobile home was destroyed by a tornado.",
    "What is it about this one particular week in April, anyway?",
    "Authorities did not provide a motive for the killings.",
    "In one of the most forceful moves yet, Georgia Gov.",
    "The area was under a tornado warning at the time.",
    "It was at roughly $60 at the start of the year.",
    "He was in the wreckage of the mobile home.",
    "Trump tweeted."
  ]
}