{
  "id": 8735,
  "mediaId": 157,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Pro-Stacey Abrams group comes out swinging against Brian Kemp in first campaign ad",
  "image": "https://www.rawstory.com/media-library/could-ve-had-stacey-abrams-outrage-erupts-as-pro-virus-georgia-governor-kills-mask-mandates.jpg?id=24711187&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/stacey-abrams-kemp-ads-georgia/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2095
  ],
  "sentences": [
    "See the ad from One Georgia below:\n\\u201c\\ud83d\\udcfaWATCH\\ud83d\\udcfa \\n\\nBrian Kemp keeps taking us back\\u2026 on guns, on abortion, and even a massive tax giveaway\\u2026 for himself.\\n\\nGeorgians deserve a governor who will move us forward \\u2013 not a guy stuck\\ud83d\\udd79in\\ud83e\\udd95the\\ud83d\\udcfcpast.",
    "The Atlanta Journal-Constitution reported Wednesday that the \"One Georgia\" campaign committee is airing its first ad against Kemp, attacking him on his support for \"criminal carry\" gun laws and his anti-abortion stance.",
    "While some states are staying away from targeting pregnant women directly, Kemp at one point indicated support for laws that could throw women in prison if they seek to terminate a pregnancy.",
    "Brian Kemp made it through a Republican primary, despite efforts by former President Donald Trump to replace him with a more loyal, GOP candidate.",
    "The so-called fetal heartbeat isn't actually detected until about eight weeks into a pregnancy, according to the Cleveland Clinic.",
    "In the week since the primary election, Democratic challenger Stacey Abrams has gone full force into the general election.",
    "The reference is to the 2019 \"trigger\" law that would ban abortion in Georgia if the Supreme Court overturned Roe v. Wade.",
    "He rolled back women's rights, vowing to make abortion a crime with 10 years in prison, the ad's narrator says.",
    "After public outrage, Kemp decided he'd endorse laws that would only ban abortions once a \"heartbeat\" is heard.",
    "Any flutter seen on ultrasounds is actually a small group of cells that will become the heartbeat.",
    "Lawmakers have decided that these cells are a \"heart\" and falsely believe \"life\" is detected.",
    "#gapol\\n\\nCheck out our debut TV ad:\\u201d\n One Georgia (@One Georgia) 1654082834",
    "\"Just when we need to move forward, Brian Kemp keeps taking us back.\"",
    "It isn't even an actual fetus at that stage, it's an embryo.",
    "Gov."
  ]
}