{
  "id": 8746,
  "mediaId": 18,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Georgia businesses reopen cautiously amid coronavirus worry",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/04/Virus_Outbreak_Georgia_49593-1.jpg?w=1569",
  "link": "https://www.bostonherald.com/2020/04/24/georgia-businesses-reopen-cautiously-amid-coronavirus-worry/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    2095
  ],
  "sentences": [
    "With deaths and infections still rising in Georgia, many business owners planned to remain closed despite Kemp's assurance that hospital visits and new cases have leveled off enough for barbers, tattoo artists, massage therapists and personal trainers to return to work with restrictions.",
    "Two administration officials told The Associated Press that Trump and Vice President Mike Pence repeatedly told Kemp they approved of his aggressive plan before the president bashed it publicly earlier this week, but Trump tweeted a denial as businesses reopened.",
    "Georgia has ranked in the bottom nationally in per capita testing, a key component in preventing a resurgence of the coronavirus which causes COVID-19, and critics say Kemp's order to restart some businesses was premature despite a bump in screenings this week.",
    "Advertising project manager Nikki Thomas is overdue for a visit to her hair stylist, but she's barely ventured outside since her Atlanta employer mandated working from home on March 12, and she had no plans to change that now just because of Kemp's decision.",
    "The president of the Warner Robins chamber of commerce in middle Georgia said more cars were in parking lots, but Waycross City Manager Tonya Miller said she hadn't seen many businesses open in her southeast Georgia town.",
    "Just across the state line in Anderson, South Carolina, a mall reopened Friday after the governor allowed businesses that don't involve close contact like jewelry stores, clothing boutiques and bookstores to restart.",
    "At the reopened Bodyplex Fitness Adventure in Grayson, a dozen people in masks required by the gym worked out on two floors, spraying down machines and weights with a sanitizer bottle staff handed each person.",
    "Associated Press journalists Kate Brumback and Jeff Amy in Atlanta; Sudhin Thanawala in Grayson; Mike Stewart and Ron Harris in Marietta; and Jay Reeves in Birmingham, Alabama, contributed to this report.",
    "By RUSS BYNUM\nSAVANNAH, Ga. (AP)  Four customers clutching masks were waiting outside David Huynh's nail salon as he opened his Georgia business for the first time in four weeks Friday.",
    "If I open up fine dining in midtown Atlanta and  25 people show up to dinner because I'm brazen enough to do this, that's not enough to make money and stay in business, Acheson said.",
    "In many places, restaurants remain shuttered or only allowing takeaway and delivery, and in France authorities announced that restaurants, bars and cafes won't reopen before June.",
    "The reopening will pick up steam Monday, when Georgia will allow movie theaters to reopen and restaurants to resume dine-in service  as long as customers are kept at a distance.",
    "Back in Savannah, Ebony Housey of Savannah has mostly been staying home for five weeks, and she booked an appointment with hair stylist Shannon Stafford as soon as she could.",
    "Spas, beauty salons, tattoo parlors, & barber shops should take a little slower path, but I told the Governor to do what is right for the great people of Georgia (& USA)!",
    "The gym had a fraction of its usual number of customers and provided ample space for people to work out apart, yet some talked and stood close to one another anyway.",
    "Nearby, the lights were still off in clothing and jewelry stores closed because of the coronavirus pandemic, and many residents stayed locked inside their homes.",
    "Although many businesses never closed, the governor has said it was imperative to begin easing his state's economic suffering by allowing others to resume work.",
    "I guess when people feel like they have masks, they're somewhat protected, but we're still encouraging people to try to stay 6 feet apart whenever possible.",
    "The Georgia Department of Labor said 1.1 million workers  about one-fifth of the state's workforce  filed for unemployment since the crisis started.",
    "A young couple bowled at midday in an otherwise empty Bowlero, a 34-lane alley in Kennesaw, kissing between rolls, but the arcade area was empty.",
    "It's obviously extremely stupid, and I'm simultaneously exhausted and so angry I can barely see straight, Thomas, 40, said in a phone interview.",
    "Brian Kemp relaxed a monthlong shutdown amid experts' warnings of a potential surge in infections and objections from President Donald Trump.",
    "But in metro Atlanta, the Three-13 Salon, Spa & Boutique opened to a line of masked customers whose temperature was checked before entering.",
    "Chef Hugh Acheson, who owns three fine-dining restaurants in Athens and Atlanta, said Georgia is conducting too little testing to reopen.",
    "Waiting customers were carefully distanced, their spacing marked by blue tape, and chairs were placed at staggered intervals outside.",
    "Follow AP coverage of the pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.",
    "In Savannah, though a number of salons and shops remained closed, there was plenty of traffic around shopping centers.",
    "In several European countries, the focus has been on reopening manufacturing, small shops and some schools.",
    "Workers wiped down games and other surfaces, and signs about social distancing were plastered everywhere.",
    "Georgia has more than 22,000 confirmed cases of the virus and 894 deaths, according to state statistics.",
    "Georgia's approach to reopening falls into a global patchwork of measured steps to reviving economies.",
    "Public health experts have warned that reopening too quickly could trigger a coronavirus resurgence.",
    "I (or @VP) never gave Governor Brian Kemp an OK on those few businesses outside of the Guidelines.",
    "Managing partner Lester Crowell said there was some nervousness and anxiety among salon employees.",
    "Preventing that will require increased testing and robust tracking of infected people's contacts.",
    "Huynh had 60 clients booked for appointments, and police officer Alina Davis was among them.",
    "The social distancing I think is probably the biggest challenge, co-owner Mike Martino said.",
    "Both women wore masks and chatted while Stafford shampooed and blow dried Housey's hair.",
    "Stafford replied: Well, when you get home, you're going to look fabulous.",
    "I'm getting my hair done, and I'm going straight home, Housey said.",
    "Georgia's economy began a cautious, high-stakes reopening as Gov.",
    "But you know, we all want to come back to work, he said.",
    "Yes, I am ready to get my nails fixed, Davis said.",
    "Traffic in Atlanta remained lighter than normal.",
    "Many people are staying put at home.",
    "The effect of the reopening varied.",
    "the president said in the tweet.",
    "FAKE NEWS!"
  ]
}