{
  "id": 8752,
  "mediaId": 675,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Here's why Stacey Abrams could lose to Kemp by MORE this year",
  "image": "https://www.wnd.com/wp-content/uploads/2021/03/stacey-abrams-yellow-jpg.jpg",
  "link": "https://www.wnd.com/2022/05/stacey-abrams-lose-kemp-year/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    2095
  ],
  "sentences": [
    "If you're Stacey Abrams and you see that Kemp, number one, does fine with the  rural white base vote, and number two, that he's pulling pretty good margins in the Atlanta suburbs, you start to worry because your path to victory is closed off.",
    "Politics\nCommentary\nMychal Massie\nScott Lively\nRachel Alexander\nRead all of today's COMMENTARY...\nEducation\nMoney\nU.S.\nWorld\nFaith\nDiversions\nHealth\nMORE COMMENTARY\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "Jain previously told TheDCNF that Democratic Georgia Sen. Raphael Warnock, who is up for reelection in November, has a better chance of winning than Abrams, in part because he is seen as less of a national figure and more moderate.",
    "Jain said he didn't see any evidence Trump supporters were willing to stay home on election day, despite their anger with Kemp over his refusal to overturn the results of the 2020 presidential election.",
    "By Sebastian Hughes\nDaily Caller News Foundation\nDemocratic candidate Stacey Abrams should be concerned about her odds of winning Georgia's gubernatorial election after incumbent Republican Gov.",
    "TRENDING: Principal fired after images of her manhandling special-education student surface\n[Kemp's] going to have something of a halo effect beating Trump's handpicked candidate, Coleman said.",
    "Lakshya Jain, an election analyst who writes for Split Ticket, told TheDCNF the governor's policies, such as his suspension of the gas tax, have made Kemp fairly popular in the state.",
    "Kemp's massive victory in the primary showed he has a good shot at winning over suburban voters, while high primary turnout undercuts Abrams' voter suppression rallying cry, J.",
    "Coleman said it would be smart for Abrams to move toward the center and focus on issues other than voter suppression as she enters the general election campaign.",
    "He acknowledged, however, that it's an open secret Abrams is determined to be the governor of Georgia and could be reluctant to set her sights on anything else.",
    "Brian Kemp won his primary by a huge margin, election analysts told The Daily Caller News Foundation, and will struggle to match her 2018 performance.",
    "And I think that's going to play well with maybe some of these voters in the Atlanta suburbs who maybe used to be Republicans but don't like Trump.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "He argued the increased turnout in the state's primary would make it difficult for Abrams to rally Georgians with a message about voting access.",
    "People who are the most ideological and upset with the nominee typically tend to have very high turnout scores anyways, Jain said.",
    "Kemp sailed to victory against former Republican Sen. David Perdue, who had the backing of former President Donald Trump.",
    "Coleman, however, said he doesn't believe such an outcome would necessarily prevent Abrams from a future in politics.",
    "I would say that she could potentially set her sights on maybe a congressional seat or something  down the line.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "He argued it is very difficult to ask voters to fire someone that, by and large, they're overall happy with.",
    "It's just one of those issues that's very close to the heart of the Democratic base, Coleman said.",
    "The governor had led in the polls but overperformed on election night, winning by over 50 points.",
    "Abrams is currently polling about 5 points behind Kemp, according to RealClearPolitics' average.",
    "Should Abrams lose the gubernatorial race, it will be her second defeat to Kemp in four years.",
    "Representatives for Abrams and Kemp did not respond to TheDCNF's request for comment.",
    "At this point, I would probably say she does worse this year than she did in 2018.",
    "I don't think two statewide losses is necessarily career-killing, he said.",
    "This story originally was published by the Daily Caller News Foundation.",
    "Miles Coleman, associate editor of Sabato's Crystal Ball, told TheDCNF.",
    "I can still see her mentioning it, but maybe in different terms.",
    "This is going to be a tough situation for Abrams, he said."
  ]
}