{
  "id": 8758,
  "mediaId": 223,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Ignoring the Noise and Running on Good Governing Are the Biggest Lessons of Georgia",
  "image": "https://media.townhall.com/townhall/reu/ha/2019/14/2bee452a-a5b3-4128-9427-6399ea61f301.png",
  "link": "https://townhall.com/columnists/salenazito/2022/05/31/ignoring-the-noise-and-running-on-good-governing-are-the-biggest-lessons-of-georgia-n2607931",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://townhall.com/columnists/salenazito/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Kemp said he knows his race will garner national attention: \"Stacey Abrams is going to race over a hundred million -- she said she will have much more with all her different groups that she has supporting her, so it's important for conservatives and people that are really worried about the principles and the freedoms and the liberties of our country to join us and to help fight back against the national money coming in from Hollywood and New York,\" he said.",
    "One day after a resounding defeat of fellow Republican David Perdue in the Georgia primary, Kemp said he is much more interested in sharpening the contrast between his accomplishments as governor and the activism and national ambition of the winner of the primary for the Democrats, Abrams, who openly promoted herself to be President Joe Biden's running mate in 2020.",
    "Brian Kemp said his decisive win on Tuesday had everything to do with focusing on the concerns of Georgia voters and not getting stuck on past grievances, no matter whether they came from former President Donald Trump, Stacey Abrams, or the corporations that sought to punish Georgia last year over the state's new voting laws.",
    "And it's been unreal to see people writing about the record turnout we're having,\" he said of the irony that the same news organizations that criticized the state's new ballot measure as restrictive or suppression found themselves reporting this past week that early voting came in at nearly triple Georgia's 2018 level.",
    "I mean, if you look at the team we have in our state, the members of the General Assembly, other constitutional officers that were on the ballot, they've been part of the good governing that we've been doing in Georgia for 20 years now, under Sonny Perdue and Nathan Deal, and now my administration,\" he pointed out.",
    "View Cartoon\nKemp explained he steadfastly focused on putting Georgians first even when Major League Baseball and corporate CEOs pulled their businesses out of the state after Democrats such as Biden and Abrams repeatedly called Georgia's new voting law Jim Crow 2.0 and an example of voter suppression.",
    "\"So, in a lot of ways, we're just trying to grind through with that same way in representing our great state, just like we knew Georgians were, and that's why I can relate to where they were, and that's why I took the actions that I did.",
    "The headwinds everyone predicted Kemp would face from Trump's fury at him for the governor's decision to certify the 2020 election in Georgia and not bend to his demands never materialized, in part because Kemp never jumped at the bait.",
    "\"My wife Marty and I remember the days of being home on Friday night as small business owners, barely paid the people working for us, couldn't pay our suppliers, and wondering how are we going to get through this?",
    "Secretary of State Brad Raffensperger, who defied the former president's demand he \"find more votes,\" similarly put his head down, ran on his record of conservatism and small business experiences, and won handily.",
    "\"I tell people, look, we've been, all Georgians have been through some tough times over the last three years with the pandemic and civil unrest, the election, and a lot of other things that have happened.",
    "\"That is what my family and I have been doing -- we got a record to prove it, whether it was standing up and pushing back against corporate America that was trying to cancel us for Major League Baseball.",
    "Kemp said that is what Georgians voted for Tuesday night: \"They voted for that guy that was in the trenches that didn't let outside noise bother him or his family or his team and the legislature.\"",
    "And the toughest things that we've been through in government, not many of them have been tougher than the things that we've been through as a family and as business owners,\" he explained.",
    "We've been through some serious times over the last two years, and I think people are now realizing, look, we need strong, serious leaders that are going to shoot straight with them.",
    "In short, these voters can still like Trump and yet are more interested in voting on what is going on in their daily lives, not replaying someone else's old grudges.",
    "Kemp said someone sent him a tweet on Election Day jokingly expressing outrage that it took five minutes to vote and they didn't have food and water when doing it.",
    "Despite Kemp's break from Trump, he shares no such break with the U.S. Senate primary winner Herschel Walker, whom Trump endorsed and won easily Tuesday evening.",
    "And not being able to provide for your family and potentially losing everything you've ever worked for -- that's a bad place to be in,\" he admitted.",
    "And not worried about outside noise -- and I think they spoke pretty loudly last night,\" Kemp said in an interview with the Washington Examiner.",
    "But also, we stood up and fought against Hollywood and people in high places in the national media when we reopened in our economy,\" he said.",
    "She reaches the Everyman and Everywoman through shoe-leather journalism, traveling from Main Street to the beltway and all places in between.",
    "And all of it has affected every family in our state, and probably most across America, and it certainly affected our family,\" he said.",
    "Instead, he displayed the tenacity and discipline he has used ever since he first ran for a state Senate seat nearly 20 years ago.",
    "If you paid attention to the day-to-day activity of this entire race for the past year, Kemp's message never mentioned Trump.",
    "To find out more about Salena and read her past columns, please visit the Creators Syndicate webpage at www.creators.com.",
    "Kemp lost a race for agriculture commissioner in 2006, then turned around and won the secretary of state seat in 2010.",
    "\"We just kept our head down and kept doing what was right for Georgians and representing their views and their values.",
    "Voters don't expect us to be perfect, they just want us to be chopping wood for them every single day,\" Kemp said.",
    "Spend any time with the fourth-generation University of Georgia graduate, and his work ethic is easily apparent.",
    "And we got to stop her from being our governor in Georgia; that'll also stop her from being our next president.\"",
    "The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.",
    "\"Look, the Georgia governor's race is just a steppingstone for Stacey Abrams to run for president in 2024.",
    "\"We passed a good elections bill with strong integrity measures, but also makes it still very accessible.",
    "Salena Zito is a CNN political analyst, and a staff reporter and columnist for the Washington Examiner.",
    "\"We've got to win in November, and I knew we couldn't beat Stacey Abrams if I wasn't the nominee.",
    "The Athens native will face author, activist and former state Rep. Stacey Abrams in the fall.",
    "Kemp adds that he and his wife have had to fight through many times before finding success.",
    "They're tired of people lying to them, they're tired of them playing these political games.",
    "He says his inspiration for governing comes from surviving the hardest time in his life.",
    "So, we focused on my record as governor and highlighting things that I've stood up for.",
    "Kemp wasn't the only Republican to push back against the winds of a Trump grievance.",
    "He wasn't supposed to win the primary for governor in 2018, but he did.",
    "We have a lot of mutual friends and supporters out there,\" Kemp said.",
    "He won that seat at a time when Democrats held power in Georgia.",
    "\"That is the insanity that I think really people are tired of.",
    "Kemp defeated Abrams four years ago in their first matchup.",
    "Abrams has yet to concede she lost that election.",
    "Putting hardworking Georgians first,\" he added.",
    "\"I've known Herschel Walker for 40 years.",
    "\"Tuesday night wasn't just about me.",
    "Trending\nGeorgia Gov."
  ]
}