{
  "id": 884,
  "mediaId": 43,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Morning Digest: Trump's man in Georgia keeps flogging election conspiracies as his campaign craters",
  "image": "https://images.dailykos.com/images/1063039/story_image/GettyImages-1239608302.jpeg?1651011710",
  "link": "https://www.dailykos.com/story/2022/4/27/2094254/-Morning-Digest-Trump-s-man-in-Georgia-keeps-flogging-election-conspiracies-as-his-campaign-craters",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    837,
    837,
    699,
    699,
    1007,
    1007,
    1147,
    1147,
    1299,
    1646,
    1646,
    1299,
    1454,
    1454,
    1480,
    1480,
    2277,
    2277,
    2095,
    2095,
    428,
    428,
    2672,
    2791,
    2791,
    2748,
    2748,
    2672
  ],
  "sentences": [
    "This new poll is the first we've seen conducted since the Nebraska Examiner published an April 14 story where Republican state Sen. Julie Slama and seven other women accused Herbster of groping and other forms of sexual assault; Herbster denied the allegations and soon went up with a commercial claiming \"the establishment\" was lying about him just like they supposedly did with Trump.",
    "? FL-Sen: Former Donald Trump operative Roger Stone, whom Trump pardoned in December 2020 after he was convicted on several felony charges of obstructing Congress' investigation into Russian interference in the 2016 election, said he isn't ruling out a primary bid against GOP Sen. Marco Rubio over the latter's vote against overturning the 2020 election outcome.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? GA-Gov, GA-Sen, GA-SoS: A new survey from the University of Georgia for the Atlanta Journal-Constitution is the latest poll to find Gov.",
    "The first commercial is a minute-long spot that devotes its first half to Shapiro's biography, referencing his Pennsylvania roots, family values, and the importance of his Jewish faith, while the second part highlights his record of keeping taxes low when serving in local office and how he has \"taken on powerful institutions\" as attorney general.",
    "? OR-06: In an effort to unravel why billionaire Sam Bankman-Fried's super PAC, Protect Our Future, has spent more than $7 million so far boosting first-time candidate Carrick Flynn's quest for the Democratic nomination in Oregon's brand-new 6th Congressional District, OPB's Dirk VanderHart dives deep into the possible ties between the two men.",
    "? NE-Gov: The Republican firm Data Targeting has conducted a survey of the May 10 GOP primary for Neilan Strategy Group, which says it's not working on behalf of any candidate or allied group, that shows state Sen. Brett Lindstrom taking a narrow lead for the first time in a very expensive and ugly race where he'd largely been overshadowed.",
    "VanderHart also points out that Bankman-Fried's younger brother, Gabe Bankman-Fried, runs yet another super PAC called Guarding Against Pandemics that has likewise endorsed Flynn; it so happens that the president of Protect Our Future, Michael Sadowsky, also works for Guarding Against Pandemics.",
    "This is the first survey from any outfit this cycle showing Dolan in first, but with all three other polls disclosed this month from reputable firms each finding three different leaders and many voters still undecided, it's another sign of just how uncertain the outcome of next week's vote is.",
    "? TX-30: The cryptocurrency-aligned group Web3 Forward has reported a $250,000 ad buy ahead of the May 24 Democratic primary runoff to support state Rep. Jasmine Crockett, who came just shy of winning the nomination outright last month with a 48-17 lead over party operative Jane Hamilton.",
    "Governors\n? MI-Gov: Republican Rep. Jack Bergman, whose 1st District covers the Upper Peninsula and northernmost portion of the Lower Peninsula, has switched his endorsement in the August GOP primary from former Detroit Police Chief James Craig to self-funding businessman Perry Johnson.",
    "A group called Restore the Good Life began running ads against the state senator weeks ago that portrayed him as wrong on taxes, while another outfit called Say No to RINOs launched its own spots in mid-April saying, \"Liberal Brett Lindstrom is no conservative, he just plays one on TV.\"",
    "In the Senate primary, UGA's poll does have unambiguously good news for the Trump-backed candidate: Former NFL star Herschel Walker has a 66-7 edge over his closest rival, state Agriculture Commissioner Gary Black, which is little different than his 64-8 lead in their previous poll.",
    "Former Georgia Sen. David Perdue (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Attorneys General\n? KS-AG: Former Secretary of State Kris Kobach has released a survey from WPA Intelligence arguing that he's well-positioned to win the August Republican primary for attorney general and revive his career following his disastrous bids for governor and Senate.",
    "Flynn has maintained he \"has never met or talked to Sam Bankman-Fried\"by law, super PACs are forbidden from coordinating with campaigns they're seeking to boostand in response to VanderHart's reporting, he said of his wife, \"If she's met him she hasn't said anything.",
    "The narrator declares that Cuellar sided with Texas Republicans when they \"passed the most extreme abortion ban in the country,\" characterizing the incumbent as \"the lone Democrat against a woman's right to make her own decisions, even opposing life-saving care.\"",
    "House\n? FL-04: Navy veteran Erick Aguilar this week became the first notable Republican to announce a bid for the new 4th District, a Jacksonville area constituency that would be open should incumbent John Rutherford run for the 5th as fellow Republicans expect.",
    "But while Aguilar's doomed first campaign brought in all of $16,000, his second try is a far better-funded affair: Aguilar raised $320,000 during the first quarter of 2022, and he ended March with a hefty $812,000 on hand thanks in part to earlier self-funding.",
    "Perdue and his allies have run ad after ad spreading the Big Lie that Trump was cheated in 2020 and chastising Kemp for failing to help Trump steal the contest, and Perdue's opening statement in Sunday's debate reiterated his bogus accusation of election theft.",
    "Mayors\n? Los Angeles, CA Mayor: City Attorney Mike Feuer is spending about $1 million on an opening TV and digital buy for the June nonpartisan primary, which his strategist acknowledges to the Los Angeles Times is \"pretty close\" to all they have available.",
    "Looking further downballot in the GOP primary for secretary of state, another of Trump's endorsees running a campaign focused on 2020 election denial has found more success than in the governor's race, but UGA's latest poll finds it is no sure thing.",
    "? TX-28: Attorney Jessica Cisneros is focusing on abortion rights in her first spot for the May 24 Democratic primary runoff against conservative Rep. Henry Cuellar, a topic the Texas Tribune says she didn't run many spots on during the first round.",
    "? IL-17: SEIU Illinois, which represents more than 170,000 public sector employees and workers in private service sectors statewide, has endorsed former state Rep. Litesa Wallace in the June Democratic primary, which has no clear frontrunner yet.",
    "While no other polls have found Lindstrom in first place, there were previously signs that his detractors were treating him as a serious threat even though he lacked the money and big-named endorsements that Pillen and Herbster have available.",
    "Kemp, meanwhile, has focused his campaign message on reminding voters that Perdue's re-election defeat makes him a proven loser and touting the governor's record on bread and butter conservative issues such as immigration, crime, and taxes.",
    "Billionaire developer Rick Caruso, who had the airwaves to himself until now, has run numerous ads focused on crime without mentioning any of his rivals, but one of his most prominent allies will soon be going after his main competitor.",
    "Cuellar's new ad, meanwhile, features people praising him for having \"kept our businesses open during the pandemic and reduced taxes\" and funding law enforcement and border security, language that's usually more at home in GOP ads.",
    "Gabe Bankman-Fried offered effusive praise for Flynn in remarks to VanderHart, though he insisted he \"could not comment\" on the interest shown in Flynn by his older sibling, who has not said anything about the candidate publicly.",
    "But perhaps most tellingly, Conservative Nebraska, a super PAC funded in part by Ricketts, recently began running its own spots using similar arguments against Lindstrom after it previously focused on attacking Herbster only.",
    "One of the leading Democratic contenders, state Rep. Bee Nguyen, has focused her initial ad on her support for protecting voting rights against Trump's attacks and previews what the general election message may look like.",
    "The firm shows Kobach taking 52% in the race to succeed Derek Schmidt, who is leaving to run for governor, with state Sen. Kellie Warren and former federal prosecutor Tony Mattivi far behind with 12% and 7%, respectively.",
    "Brian Kemp cruising to renomination in the May 24 GOP primary, with Kemp holding a 53-27 lead over Big Lie proponent David Perdue and earning the majority needed to avoid a June primary runoff against the former senator.",
    "Their survey shows incumbent Brad Raffensperger holding a 28-26 lead over Rep. Jody Hice, who has Trump's backing, which marks an improvement for the incumbent from Hice's 30-23 advantage in UGA's prior poll.",
    "The spot features the candidate, who took just 2% in a recent UC Berkeley poll, walking a dachshund (who at one point rides a skateboard while leashed) through the city as a song proclaims him the \"underdog.\"",
    "? WI-Gov: Wealthy businessman Tim Michels, who announced a sizable ad buy when he joined the GOP primary over the weekend, will spend $980,000 on his initial ads, though no copy of a spot is available yet.",
    "This latest survey is one of Kemp's best results so far from any pollster and marks a significant improvement for him from UGA's last poll taken in late March and early April, which found Kemp ahead 48-37.",
    "? FL-23: Republican state Rep. Chip LaMarca has announced that he won't run to succeed retiring Democratic Rep. Ted Deutch in the new 23rd District, which contains most of Deutch's existing 22nd District.",
    "Most notably, Flynn's wife, Kathryn Mecrow-Flynn, worked at an organization called the Center for Effective Altruism in 2017the same time that Bankman-Fried served as the group's director of development.",
    "? OH-11: Democratic Majority for Israel is airing its first negative spot of the year against former state Sen. Nina Turner ahead of her Democratic primary rematch next week against Rep. Shontel Brown.",
    "Perdue has failed to gain traction in the polls despite Donald Trump's endorsement, but that hasn't stopped his zealotry for spreading Trump's 2020 election conspiracy theories from shaping the race.",
    "? PA-Gov: State Attorney General Josh Shapiro, who is unopposed in the May 17 Democratic primary, has laid out $950,000 of the $16 million his campaign recently had on hand to air his first two ads.",
    "However, Hice has done significantly better in one of the few other credible polls here from GOP firm Landmark Communications, which had Raffensperger trailing by a wide 35-18 earlier this month.",
    "Web3 Forward may have more where that came from if the initial primary, where they and another crypto-oriented group had already spent over $2 million aiding Crockett, was any indication.",
    "The nomination contest still includes Gina Godbehere, who recently announced that she was stepping down as prosecutor for the City of Goodyear in order to concentrate on her campaign.",
    "The second spot expands on the latter theme, featuring a nurse praising Shapiro's work going after predatory student loan companies like the one that she says tried to rip her off.",
    "Senate\n? AL-Sen: Alabama Patriots PAC, which is backing Army veteran Mike Durant in the May 24 GOP primary, has reported spending more than $3 million on his behalf thus far.",
    "The Los Angeles Police Protective League, which is the city's well-funded police union, has so far given $500,000 to a new super PAC opposed to Democratic Rep. Karen Bass.",
    "CO-Sen: Joe O'Dea (R)\nGA-Sen: Gary Black (R) - anti-Herschel Walker (R), backed by $37,000\nGA-Sen: Latham Sadler (R) - anti-Walker (R)\nOH-Sen: Josh Mandel (R) - anti-J.D.",
    "? OH-Sen: Democratic firm Blueprint Polling has released a poll finding that the May 3 GOP primary is still up in the air with 33% undecided and no candidate topping 20%.",
    "The narrator faults Turner for not supporting Hillary Clinton over Donald Trump in 2016 before declaring that the challenger \"said voting for Biden was like eating ****.\"",
    "Doug Ducey's general counsel, has dropped out of the August special Republican primary and endorsed Rachel Mitchell, who was appointed interim county attorney last week.",
    "The termed-out governor himself joined in the pile-on, characterizing Lindstrom as \"a liberal (who) does not have a conservative voting record in the Legislature.\"",
    "Aguilar himself had been waging a second primary bid against Rutherford, who beat him in an 80-20 landslide two years before, before redistricting changed things.",
    "The firm shows Lindstrom edging out Trump-backed agribusinessman Charles Herbster 28-26, with University of Nebraska Regent Jim Pillen, who is termed-out Gov.",
    "(The screen flashes the words \"EATING S**T.\") The super PAC, which recently began running positive commercials for Brown, has spent close to $600,000 so far.",
    "Cuellar goes into the final weeks of the runoff with a cash-on-hand lead over Cisneros, but she's managed to close much of what had been a massive gap.",
    "Wallace faces a field that includes former TV meteorologist Eric Sorensen, Rockford Alderman Jonathan Logemann, and Rockford Alderwoman Linda McNeely.",
    "One elderly woman goes on to make the case that he's vital for the district, saying, \"Henry helps us with prescriptions and Social Security benefits.",
    "Vance, while businessman Mike Gibbons earns 13%, former state Treasurer Josh Mandel takes 12%, and former state party chair Jane Timken wins just 7%.",
    "The pollster, who did not disclose who, if anyone, was their client, shows state Sen. Matt Dolan with a slim 18-17 lead over venture capitalist J.D.",
    "Trump's election lies almost certainly aren't going anywhere as a campaign topic regardless of the outcome of the primaries for secretary of state.",
    "Stone, however, hardly looks like a serious candidate: even he conceded that he wasn't the ideal challenger and implored someone else to run.",
    "Vance (R)\nAL-Gov: Kay Ivey (R-inc)\nIL-Gov: Darren Bailey (R)\nCO-08: Jan Kulmann (R), backed by $50,000\nThis is a short blurb about Daily Kos.",
    "? IL-03: SEIU Local 1, which represents maintenance workers, has backed Chicago Alderman Gilbert Villegas in the June Democratic primary.",
    "Cuellar ended March with a $1.4 million to $1 million edge, while he enjoyed a $2.3 million to $494,000 advantage three months before.",
    "Ron DeSantis before acknowledging he was barred from doing so by state law preventing recent party switchers from running for office.",
    "Feuer tells the audience, \"Even with the most experience, being outspent 30 to 1 could make the odds of becoming mayor  well, long.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Pete Ricketts' endorsed candidate, just behind with 24%; former state Sen. Theresa Thibodeau lags far behind in fourth with 6%.",
    "The Democrats are fielding attorney Chris Mann, a former prosecutor who currently faces no serious intra-party opposition.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The state senator, for his part, said last week that he wouldn't be running negative ads against Pillen and Hebster.",
    "Unsurprisingly, Trump himself has stuck behind his man, and he's scheduled to hold a rally with him on Friday.",
    "Back in mid-February, the firm showed Herbster edging out Pillen 27-26, with Lindstrom taking third with 21%.",
    "The commercial then pivots to the left by commending him as a champion of healthcare and affordable college.",
    "In doing so, Bergman complained that Craig ignored \"campaigning in Northern Michigan and the U.P.",
    "Stone had also mulled running for governor as an independent to stymie Republican Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Ad Roundup\nDollar amounts reflect the reported size of ad buys and may be larger.",
    "(Lindstrom's most prominent supporter is arguably Omaha Mayor Jean Stothert.)",
    "Still, every other recent poll here has also found Kemp with a sizable lead.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Prosecutors\n? Maricopa County, AZ Attorney: Anni Foster, who is Gov.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "in favor of a self proclaimed Detroit-centric approach.\"",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Donate $5\nDonate $25\nDonate $15\n\nDonate $5 monthly",
    "If we lose him in Congress, we lose everything.\"",
    "The new 4th would have supported Trump 53-46.",
    "Subscribe to our podcast, The Downballot!",
    "I think she would have said something.\"",
    "But L.A.'s a city of underdogs.\"",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Please read it."
  ]
}