{
  "id": 8994,
  "mediaId": 65,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Gov. Brian Kemp previews rematch against Stacey Abrams, the 'fight for the soul of the country'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c7bac6ce-771e-4969-8d8e-09f432617668/ed105e9d-890c-4f27-9ed1-4fcd7024bf52/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/gov-brian-kemp-rematch-stacey-abrams-georgia",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lindsay Kornick",
  "authorUrl": "https://www.foxnews.com/person/k/lindsay-kornick",
  "termIds": [
    2095
  ],
  "sentences": [
    "Kemp acknowledged \"Theres a lot of things we worked on, and I always gave them credit for that,\"\nINFLATION PUSHES RETIREE BACK INTO WORKFORCE AFTER 20 YEARS: I NEED COMPENSATION\nIn looking forward to his rematch against Stacey Abrams for governor, he remarked on Abrams clear influence and connections with President Biden and his ongoing scandals.",
    "She hurt those business owners, and Im the one whos been fighting for them, with tax relief, sending a billion dollars back to taxpayers and suspending the gas tax, so people can fight through 40-year high Joe Biden inflation that Stacey Abrams helped put in the White House.\"",
    "The Republican governor first spoke on \"Sunday Night in America\" about his resounding victory in the Georgia primaries against former Sen. David Perdue despite the latters endorsement from former President Trump.",
    "She hurt small business owners, many of them minority-owned, by pressuring Major League Baseball to pull the All-Star Game, but we never wavered because we knew its easier to vote and harder to cheat in Georgia.",
    "\"I told people I was very appreciative of what former President Trump and Vice President Pence did to help our state many times whether it was during COVID or other things we worked on together.",
    "He also called out Abrams for being a \"darling of national media\" and pushing misleading information such as claiming that the states election integrity bill was a form of voter suppression.",
    "BIDEN ADVISER ADMITS NOT FEELING INFLATION AS PERSONALLY AS LOWER-INCOME PEOPLE BUT UNDERSTANDS FRUSTRATION\n\"But look, the national media, as you know, is not always right, we know that.",
    "Although Trump supported his opponent in the GOP primaries, Kemp maintained a respectful image of the former president with the key focus on Georgia.",
    "Brian Kemp discussed his strategy for his upcoming rematch against Stacey Abrams for the 2022 gubernatorial election in November.",
    "Kemp reiterated that his second election against Abrams since 2018 is a fight for nothing less than \"the soul of the country.\"",
    "Stacey Abrams is getting credited for Joe Biden winning Georgia and being president, and you see what has that has gotten us.",
    "40-year-high inflation, sky-rocketing gas prices, disaster at the border, more rules, more regulations, and more taxes.",
    "If we stop her from being governor, her road to the White House ends right here and right now this November.",
    "They were wrong on our voting bill, the largest election integrity act in the country.",
    "\"I stayed focus on Georgia there is a lot of outside noise in the race,\" Kemp said.",
    "\"This is a fight not only for the soul of the state but the soul of the country.",
    "Its going to take everyone in this fight to beat her again,\" Kemp said.",
    "Everybody has egg on their face, including Stacey Abrams on that.",
    "They want somebody thats going to be focused on them.",
    "And I dont think thats the way Georgians want to go.",
    "Well continue to fight against that,\" Kemp said.",
    "They do not want to go the way of Stacey Abrams.",
    "We had record turn out during the primary.",
    "Stacey Abrams wants to be your president.",
    "We still have our troops at the border.\"",
    "Thats what she would do to the state.",
    "\"That is what Georgians want.",
    "Georgia Gov."
  ]
}