{
  "id": 8995,
  "mediaId": 1576,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Some in Ga. GOP want closed primaries after Trump picks lose",
  "image": "https://www.wabe.org/app/uploads/2022/06/AP22149700834559-416x234.jpg",
  "link": "https://www.wabe.org/?p=292583",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "That call to close primaries comes after an Associated Press analysis of early voting records from data firm L2 found that more than 37,000 people who voted in Georgias Democratic primary two years ago crossed over to cast ballots in the May 24 Republican primary.",
    "Besides Georgia and 14 other states with totally open primaries, a number of other states allow unaffiliated voters to vote in the primary of their choice, or allow people to change parties on election day to vote in a different primary.",
    "Raffenspergers campaign has pushed back on the idea that he won the GOP primary because of Democrats, suggesting that a number of crossover voters were actually Republicans who voted Democratic in recent years to protest Trump.",
    "Some Republican activists are calling for abolishing Georgias open primary system, complaining that too many Democrats crossed over to vote in the states GOP primary against candidates endorsed by former President Donald Trump.",
    "Moore, who faces no Democratic opposition in November for a state Senate seat in the northwest Georgia suburbs of Chattanooga, Tennessee, said parties should not be forced to associate with people who dont share their views.",
    "The calls for change are coming from party activists after crossover voters may have provided the margin of victory for Raffensperger, who refused to heed Trumps calls to overturn his 2020 election defeat in the state.",
    "David Clark, a Republican state House member, and Colton Moore, a Republican state Senate candidate, said they would introduce bills in next years legislative session seeking to hold back crossover voting.",
    "They appeared at a news conference with Republican Vernon Jones, a Trump-backed congressional candidate facing a June 21 runoff against a challenger who Jones contends solicited Democrats to vote for him.",
    "Raffensperger cleared the 50% threshold required to avoid a runoff election against U.S. Rep. Jody Hice, his Trump-backed challenger, by just over 27,000 votes, according to the latest AP tallies.",
    "An AP examination of voting records from before the Trump era shows at least a portion of Georgias 37,000 party switchers in 2022 had been in the Republican camp before Trump took office.",
    "So all were asking is that the parties have the freedom to associate with their base, with their voters who are interested in their morals and their principles, Moore said.",
    "The proposal is likely to face heavy opposition, with top Republicans and Democrats signaling Monday that they see no reason to change Georgias open primary system.",
    "Voters can choose which primary to take part in as they walk up to the polls and switch back-and-forth in subsequent elections without changing their registration.",
    "Voters across the political spectrum this primary season have sought to thwart Trump-backed candidates who support his lies that the 2020 election was stolen.",
    "The congresswoman, who has embraced election lies and spoken at an event organized by a white nationalist, won by more than 50 percentage points.",
    "Trumps opponents encouraged Democrats to help defeat U.S. Rep. Marjorie Taylor Greene in her Republican primary last week in Georgia.",
    "The total number of crossovers including Election Day votes, set to be revealed in coming weeks, will be even higher.",
    "A spokesperson for House Speaker David Ralston, who controls the flow of legislation in the House, rejected the idea.",
    "She supports open primaries because they allow for more participation, said Seth Bringman, an Abrams spokesperson.",
    "Roughly between 9,000 to 13,000 voted Republican in the 2010, 2012 and 2014 primaries, according to the L2 data.",
    "While Trump railed against the practice last month, there is nothing inherently wrong with crossover voting.",
    "Moore and Jones said they werent sure whether crossover voters got Raffensperger or anyone else nominated.",
    "There is no need to change the current primary system, Ralston spokesperson Kaleb McMinchen said.",
    "Brian Kemp and Secretary of State Brad Raffensperger  ended up winning their primary elections.",
    "A spokesperson for Raffenspergers office said he was out of town and unavailable for comment.",
    "Based on early voting data alone, 37,144 former Democrats voted in the Republican primary.",
    "The five statewide GOP incumbents whom Trump had targeted for defeat  including Gov.",
    "Stacey Abrams, the Democratic nominee for governor, also signaled zero interest.",
    "Crossover voting, also known as strategic voting, is not exclusive to Georgia.",
    "Were trying to make the primary pure, and thats election integrity.",
    "Like 14 other states, Georgia does not register voters by party.",
    "Its not clear how often crossover voting is effective."
  ]
}