{
  "id": 9001,
  "mediaId": 157,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "'His dad is a Democrat!' Tensions flare during 10th Congressional District GOP runoff debate",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29941896&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/his-dad-is-a-democrat-tensions-flare-during-10th-congressional-district-gop-runoff-debate/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Fowler",
  "authorUrl": "https://www.rawstory.com/u/stephenfowlergpbnews",
  "termIds": [
    2095
  ],
  "sentences": [
    "In some ways, Trump would be a winner regardless of the outcome of the primary: both Collins and Jones are candidates molded in his image who want to advance the former president's policies, deride liberals and question so-called \"RINOs\"  Republicans In Name Only  within the party.",
    "In fact, bids to unseat Georgia's governor, secretary of state, attorney general and insurance commissioner failed in a spectacular fashion, with all losing by large margins  including a 50-point blowout win for Gov.",
    "The two Republicans in the primary runoff for Georgia's 10th Congressional District are both ultra-conservative Trump-supporting candidates, but only one has Trump's endorsement and only one can ultimately win.",
    "Trucking executive Mike Collins and Democratic former state lawmaker and DeKalb County CEO Vernon Jones squared off in the Atlanta Press Club-sponsored debate Monday, and sparks flew from the very beginning.",
    "Collins' father, Mac Collins, was elected as a Democratic county commissioner in Butts County several decades ago before switching to the Republican Party and serving as a Republican congressman.",
    "Jones was a Democratic state lawmaker and previously served as CEO of one of the most Democratic counties in the state before switching his allegiance to the GOP after the 2020 election.",
    "When asked about potential compromises over gun legislation after a deadly mass shooting at a Texas elementary school, Jones said \"America needs more God, not more gun control.\"",
    "\"You could even use prior veteran military personnel and train them much the way they did in Florida and and have them work at these schools and and protect these students.\"",
    "The two also sparred over Jones' vote against Georgia's abortion law in 2019, both men's use of federal paycheck protection loans and more during the heated debate.",
    "But Jones is one of eight non-incumbents whom Trump endorsed in a bid to reshape Georgia's GOP electorate this year, and only two managed to secure victory so far.",
    "But Jones and Jake Evans in the 6th District provide another opportunity for the potential new Republican majority next year to be Trumpier than ever before.",
    "\"You know, if we can send $40 billion to Ukraine, why can't we send money to our public schools to make them safe and protect our children,\" he asked.",
    "Much of the debate saw the pair level personal attacks on each others' records and hurl accusations of not being truly conservative enough.",
    "Law enforcement's failure to respond in a timely manner to the shooting is one of many aspects of the shooting under investigation.",
    "This story comes to Raw Story through a reporting partnership with GPB News, a non-profit newsroom covering the state of Georgia.\"",
    "The Uvalde, Texas, school system where 19 students and two teachers were killed, had enhanced security procedures in place.",
    "If you voted in the Republican primary or did not vote at all, you can participate in the Republican runoff elections.",
    "\"His dad is a Democrat, he was raised a Democrat; it's in his blood,\" Jones said of Collins.",
    "Collins also said that the answer to school shootings was doing more to secure schools.",
    "Don't try to get Democrat voters to vote in a Republican primary.\"",
    "\"I think you need to arm teachers in the classroom,\" he said.",
    "\"If you want to run as a Democrat, then run as a Democrat.",
    "Evans faces Rich McCormick in that runoff.",
    "Primary election day is June 21.",
    "Brian Kemp."
  ]
}