{
  "id": 9004,
  "mediaId": 19,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "GA Gov. Kemp: My Record Is the Record that Can Beat Stacey Abrams",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c7bac6ce-771e-4969-8d8e-09f432617668/ed105e9d-890c-4f27-9ed1-4fcd7024bf52/1280x720/match/image.jpg",
  "link": "https://www.breitbart.com/clips/2022/06/05/ga-gov-kemp-my-record-is-the-record-that-can-beat-stacey-abrams/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trent Baker",
  "authorUrl": "https://www.breitbart.com/author/trent-baker/",
  "termIds": [
    2095
  ],
  "sentences": [
    "And the second one is that I told them I would implement things that I campaigned on in 2018, and we have done that  from the largest teacher pay raise in state history, the largest state income tax cut in state history, weve been standing with our men and women in law enforcement going after street gangs, and as you know, weve got a robust economy in Georgia.",
    "Were the number one state in the country for business, so I just stayed focused on reminding people what my record was, but also that is the record that can beat Stacey Abrams in November, and that is what we all want, and that is what everybody is uniting around right now.",
    "You know, Stacey Abrams is getting credit for Joe Biden winning Georgia and being president, and you see what has that is getting us  40-year-high inflation, skyrocketing gas prices, disaster at the border, more rules, more regulations and more taxes.",
    "In addressing his big primary win over former Sen. David Perdue, Kemp said his record was one that can beat Stacey Abrams.",
    "He pointed to his efforts to cut taxes, increase pay for teachers, improve the states economy and combat street gangs.",
    "Brian Kemp (R) sounded off about his reelection bid against Democrat Stacey Abrams.",
    "I made two big promises; that was one of them  to put hardworking Georgians first.",
    "And weve been fighting against that, and were going to continue to do that.",
    "We were just focused on putting hardworking Georgians first, Kemp replied.",
    "In an interview on Fox News Channels Sunday Night in America, Georgia Gov.",
    "He added, [Georgians] do not want to go the way of Stacey Abrams.",
    "Thats what I told them I would do when I ran in 2018.",
    "How did you win, and how did you win so convincingly?",
    "And I dont think that is where Georgians want to go.",
    "And that is what she would do to our state.",
    "host Trey Gowdy asked."
  ]
}