{
  "id": 9006,
  "mediaId": 18,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Sunbelt states rush to line up hospital beds, not barstools",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/06/Virus_Outbreak_Spain_77266-1.jpg?w=1569",
  "link": "https://www.bostonherald.com/2020/06/30/europe-restricts-visitors-from-the-us-amid-virus-resurgence/?share=reddit",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Over the past few days, states such as Florida, Arizona, Texas and California have reversed course, closing or otherwise clamping down on bars, shutting beaches, rolling back restaurant capacity, putting limits on crowds at pools, or taking other steps to curb a scourge that may be thriving because of such factors as air conditioning and resistance to wearing masks.",
    "By TAMARA LUSH and JOHN SEEWER\nST. PETERSBURG, Fla. (AP)  Florida and other states across the Sunbelt are thinning out the deck chairs, turning over the barstools and rushing to line up more hospital beds as they head into the height of the summer season amid a startling surge in confirmed cases of the coronavirus.",
    "Nikki Forsberg said she is relying on government loans to keep the Old Ironhorse Saloon, the only bar in the Texas Hill Country town of Blanco, afloat after it was closed for two months beginning in mid-March and then shut down again Friday by the governors order.",
    "With newly reported infections running about 40,000 a day in the U.S., Dr. Anthony Fauci, the nations top infectious-disease expert, warned on Tuesday that the number could rocket to 100,000 if Americans dont start following public health recommendations.",
    "Air conditioning could be a factor in hot-weather states where new cases have been spiking, because it recirculates air instead of bringing it in fresh from outside, said Dr. Kristin Englund, an infectious-disease physician at Cleveland Clinic.",
    "The Fourth of July, the reopening of Walt Disney World on July 11, and the Republican National Convention in Jacksonville at the end of August promise to draw crowds and create the potential for person-to-person spread.",
    "Dignity Health, which operates several hospitals in the Phoenix area, is converting more areas to treat COVID-19 patients and preparing to put multiple patients in private rooms, spokeswoman Carmelle Malkovich said.",
    "The coronavirus has been blamed for over a half-million deaths worldwide, including about 130,000 in the U.S., where the number of new cases per day has soared over the past month, primarily in the South and West.",
    "Newly confirmed cases in Florida have spiked over the past week, especially in younger people, who may be more likely to survive the virus but can spread it to the Sunshine States many vulnerable older residents.",
    "She said money got so tight for some of her eight employees during the first shutdown that she told them to go the bar and take whatever they needed  petty cash, toilet paper, even one of the refrigerators.",
    "Ira Friedman, who along with wife, Ellen, is active in the local Democratic Party, said that at first, he would just make an exaggerated cough to get his point across if he saw someone without a mask.",
    "Hospitals in the new hot spots are already stretched nearly to the limit and are scrambling to add intensive care unit beds for an expected surge in COVID-19 cases in the coming weeks.",
    "Americans were 50% of my clientele, lamented Paola Pellizzari, who owns a mask and jewelry shop on the Saint-Louis island in the heart of Paris and heads its business association.",
    "State officials have authorized crisis standards of care telling hospitals which patients should get a ventilator or other scarce resources if there is a shortage.",
    "Van Johnson, mayor of the tourism-dependent city of Savannah, Georgia, announced he is requiring the wearing of masks, with violators subject to $500 fines.",
    "Britain reimposed a lockdown in Leicester, a city of 330,000 that officials said accounted for 10% of all new coronavirus cases in the nation last week.",
    "Its bringing nurses from underutilized hospitals in its system to Arizona, and hiring traveling nurses and respiratory therapists throughout July.",
    "The EU also kept its ban in place for visitors from China and from countries such as Russia, Brazil and India where infections are running high.",
    "I would not be surprised if we go up to to 100,000 a day if this does not turn around, and so I am very concerned, Fauci said on Capitol Hill.",
    "Under the modifications, bars that had been allowed to operate at 25% capacity will be closed for in-person service if they dont serve food.",
    "Last week, more than 8,000 new confirmed cases were reported in that age group, compared with about 2,000 among people 55 to 64 years old.",
    "Elsewhere, the European Union will reopen on Wednesday to visitors from 14 countries  but not the U.S., which has barred most Europeans.",
    "While cities like Miami, Fort Lauderdale, St. Petersburg and Sarasota have mandated masks, some people in Florida have been resistant.",
    "Hospital ICUs are starting to fill up in South Florida, with a steadily increasing number of patients requiring ventilators.",
    "In hard-hit Arizona, hospitals are looking for ways to cram more beds into their facilities and hiring out-of-state nurses.",
    "In The Villages retirement community near Orlando, tension has developed among residents who wear masks and those who dont.",
    "I definitely think the air conditioning and the oppressive heat in the South is going to play a role in this, she said.",
    "More than 15 million Americans travel to Europe each year, while some 10 million Europeans head across the Atlantic.",
    "Unfortunately, we dont find that the Republicans are following the same protocols as we are, his wife said.",
    "Any time you have these reopenings, youre depending on people to do the right things, to follow the rules.",
    "I think thats where the weak spots come in, said Dr. Cindy Prins, a University of Florida epidemiologist.",
    "Doug Ducey shut down bars, movie theaters and gyms and banned groups larger than 10 at swimming pools.",
    "Brian Kemp has largely prohibited local governments from imposing rules stricter than the states.",
    "Jared Polis said Tuesday that his state will rein in previously set rules for bars and nightlife.",
    "Savannah, population 145,000, becomes one of the first cities in Georgia to take such a step.",
    "By the time we had opened back up, we had stripped the bar of all the non-liquor inventory.",
    "The new round of shutdowns across the country is likely to cause another spike in layoffs.",
    "Americans make up a big share of Europes tourism industry, and summer is a key period.",
    "Miamis Baptist Hospital had only six of its 82 ICU beds available, officials said.",
    "Floridians ages 15 to 34 now make up 31% of all cases, up from 25% in early June.",
    "But he said he has become more vocal about it as the number of cases has grown.",
    "Associated Press reporters from around the world contributed to this report.",
    "Across the English Channel, things are also headed in reverse in places.",
    "Health officials say the next several weeks will be critical in Florida.",
    "Stores closed their doors, and schools prepared to send children home.",
    "She warned that things are likely to get worse before they get better.",
    "After talking with the governors of Arizona and Texas, Colorado Gov.",
    "More than 8,000 were recorded on each of three days late last week.",
    "The state reported more than 6,000 new confirmed cases Tuesday.",
    "We cant substitute that clientele with another.",
    "And the split has been along political lines.",
    "Thats how desperate it got, she said.",
    "Seewer reported from Toledo, Ohio.",
    "Deaths have climbed past 3,500.",
    "Republican Gov.",
    "Republican Gov."
  ]
}