{
  "id": 5549,
  "mediaId": 2831,
  "date": "2022-04-22",
  "headline": "Why Some Conservative Jurists Won’t Follow the Science",
  "image": "https://washingtonmonthly.com/wp-content/uploads/2022/04/AP22104658268179-scaled.jpg",
  "link": "https://washingtonmonthly.com/2022/04/22/why-some-conservative-jurists-wont-follow-the-science/",
  "mediaOutlet": "Washington Monthly",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Goodwin",
  "authorUrl": "https://washingtonmonthly.com/author/james-goodwin/",
  "termIds": [
    5802,
    4905,
    3408,
    1457,
    1126,
    1203
  ],
  "sentences": [
    "I can find no other instance in which a judge has drawn a line around a well-established body of scientific research and declared it off-limits for federal agencies to consider as they carry out their statutory mandates—even when those mandates often include the command to use the “best available science.” The ordinary practice for judges has been to demand agencies to consider more science, not less.",
    "Other targets might include research on the human toxicity of PFAS chemicals—a class of synthetic chemicals that have become pervasive in our soil and drinking water due to their widespread use—or social science research linking discrimination against the LGBTQ+ community with harm to mental health.",
    "Under the now-disgraced former administrator Scott Pruitt, the Trump EPA began work on a regulatory proposal for the euphemistically titled “Strengthening Transparency in Regulatory Science” rule, which sought to impose restrictions on the agency’s use of science as the Secret Science Reform Act.",
    "One high-priority target would be the so-called Harvard Six Cities study, conducted nearly 30 years ago, which helped establish the link between a common form of air pollutant, known as fine particulate matter, and various harmful human health effects, including premature death.",
    "The case involves several Republican state attorneys general challenging the Biden administration’s use of what is called the “social cost of carbon.” The SCC seeks to capture in monetary terms the harm that results from each ton of carbon dioxide released into the atmosphere.",
    "One of the most important of these is the Chevron deference doctrine, under which courts generally defer to an agency’s interpretation of its own statutory authority, so long as the relevant statutory language is ambiguous and the agency’s interpretation is reasonable.",
    "Relying on a blinkered reading of obscure government guidance called “Circular A-4,” Cain concluded that the SCC should be calculated using a high discount rate, which perhaps coincidentally would have resulted in a lower SCC.",
    "A high SCC—reflecting a belief that climate change will have significant harmful effects—implies that the government should take more drastic action to limit climate pollution, such as discouraging the use of fossil fuels.",
    "In 2014, Representative David Schweikert, a Republican, introduced the Secret Science Reform Act, which would have prohibited the EPA from using any scientific research unless all its underlying data was made public.",
    "It was finalized shortly before the end of the Trump administration—but a federal district court judge struck it down, determining that the agency lacked the legal authority to issue it in the first place.",
    "What discount rate should be used for measuring future climate benefits—or, indeed, whether it is appropriate to discount them at all—is controversial and involves complex matters of professional judgment.",
    "Elsewhere, state and local governments are systematically removing books from public library shelves simply because the ideas they contain challenge the narrow worldviews of social conservatives.",
    "The study provides a crucial scientific foundation for many of the EPA regulations, and it has been the subject of withering attacks from the fossil fuel industry and libertarian organizations.",
    "And while conservative legal commentators have for decades called for judges to take up the role of “gatekeeper” of regulatory science, these calls seem to have gone unheeded—until now.",
    "Based on this myopic reading of government guidance, Cain issued an order forbidding the Biden administration from “adopting, employing, treating as binding, or relying upon” the SCC.",
    "Among the unforeseen consequences: The Department of the Interior abruptly postponed several oil and gas lease sales, because their documentation had relied on the SCC.",
    "There, lawmakers have enacted legislation that scrubs entire topics from the states’ public school curriculum, such as racism, sexual orientation, and gender identity.",
    "The Trump appointee substituted his own views for how the SCC should be calculated over those of professional scientists and economists with subject-matter expertise.",
    "While some economists believe that a proper SCC should be as high as $200 per ton, the Obama administration adopted an SCC of $43 per ton, using conservative models.",
    "In theory, analysts could lowball the value of climate action by applying a discount rate so high that any future benefits look almost meaningless—at least on paper.",
    "Opponents of climate action, in contrast, have fought to keep the SCC as low as possible, which helps them justify little or no action to mitigate climate change.",
    "A recent decision by a district court judge in Louisiana substituted judicial activism for science and promoted the policy preferences of regulated industries.",
    "(Perhaps, not surprisingly, the Trump administration employed identical approaches to discounting and geographic scope to generate its preposterous SCC of $1.)",
    "Industry officials recognized that they could help conceal their campaign against government tobacco regulation by making the debate as complex as possible.",
    "The first relates to selecting the proper “discount rate.” Discounting is a technique that policy experts use to compare policy impacts at different times.",
    "That judicial tactic, if successfully replicated, could disrupt a wide range of public interest policies, including measures to tackle the climate crisis.",
    "In 2010, the Obama administration began incorporating the SCC into its decision-making—a practice that other countries and many corporations also follow.",
    "These decisions involved the narrow question of whether the SCC should be blocked while a full decision on the merits of the SCC is ultimately resolved.",
    "Fortunately, a three-judge panel of the Fifth Circuit has reversed Cain’s decision and has allowed the Biden administration to resume use of the SCC.",
    "This means public scrutiny, making the regulatory and policy process more deliberative, more inclusive, and more responsive to the public it serves.",
    "The Biden administration said it would undertake a new approach, which it has yet to announce, but would use a value of $51 per ton in the interim.",
    "Responding to Judicial Censorship of Science\nThe earlier conservative campaigns to censor regulatory science failed to make much progress.",
    "Ruling in the suit brought by Republican attorneys general, Judge James Cain Jr. of the Western District of Louisiana joined this debate.",
    "The recent wave of conservative judicial activism has led to jaw-dropping decisions on abortion rights, voting rights, and other issues.",
    "The second issue that should be considered when calculating the social cost of carbon is the geographic scope, which requires expertise.",
    "Formal instruction on scientific evidence in criminal cases and civil lawsuits is already available for federal and state trial judges.",
    "While science can’t tell agencies how to write rules, it can significantly impact policy outcomes, as the fight over the SCC suggests.",
    "Often, it can be all but impossible for the public to track these issues, given the highly technical nature of regulatory science.",
    "As Franklin D. Roosevelt learned, the solution to a reactionary judiciary is for progressives to start winning a lot of elections.",
    "But a House bill, the Stop Corporate Capture Act, could provide it with a more robust legal foundation to fend off these attacks.",
    "Our legislative process makes it difficult to pass new laws, and regulations are relatively easy to limit or even reverse.",
    "Instead, we can and should avail ourselves of the many options for promoting civic engagement in the rulemaking process.",
    "Science is one of the critical inputs, along with law and economics, that agencies consider when developing regulations.",
    "It became clear that Cain’s order covered more than the environmental regulations that seemed to be its intended target.",
    "Think of the tobacco industry’s strategy to “attack the science,” documenting the health harms of secondhand smoke.",
    "Given that the climate crisis is global, designers of the different SCC estimates often opt for an worldwide scope.",
    "The flaws in Cain’s reasoning are getting scrutiny, but the audacious remedy he offers also deserves condemnation.",
    "Here, too, Cain overruled government experts, and concluded that the SCC should have been only domestic in scope.",
    "For polluting industries, science denial from the bench could help defeat a wide range of regulatory safeguards.",
    "This developing threat to regulatory science is part of a broader radicalization of conservative federal judges.",
    "Short of that, a system of training federal judges on the mechanics and limits of regulatory science could help.",
    "It is derived from economic models that integrate scientific data about the predicted impacts of climate change.",
    "In particular, Cain found fault with two highly technical issues best addressed through professional judgment.",
    "That full decision merits questions, which are still pending, and could ultimately see the SCC blocked again.",
    "At the instigation of the fossil fuel industry, the Trump administration reduced the SCC to just $1 per ton.",
    "The Broader Conservative Censorship Campaign\nConservatives have long tried to censor regulatory science.",
    "It conveniently ignored that many studies cannot release supporting patient data due to privacy laws.",
    "Several versions of the bill have been introduced over the years, though none have become law.",
    "A more ambitious step would involve preserving existing guardrails against judicial activism.",
    "Cain’s SCC decision echoes the social censorship campaigns in states like Florida and Texas.",
    "But we have better institutional solutions for accomplishing this than activist judges.",
    "None of this means that we should abandon efforts to police agency misuse of science.",
    "In any event, such data is not necessary for independent third-party verification.",
    "For instance, climate policy involves investments now to avoid catastrophes later.",
    "The bill’s primary goal was to censor the Harvard Six Cities study, among others.",
    "As with discount rates, his approach to geographic scope yielded a lower SCC.",
    "Now, science itself seems to be in the cross hairs of conservative judges.",
    "The federal government was left reeling from this one judge’s decision.",
    "Conservative attacks have left Chevron deference on life support.",
    "A New Blueprint for Judicial Censorship of Government Science?",
    "Once federal judges rule, that’s often the final word.",
    "The federal judiciary is entirely different, though.",
    "The full Fifth Circuit rejected an en banc appeal.",
    "How high the SCC should be set is controversial."
  ]
}