{
  "id": 1159,
  "mediaId": 2919,
  "date": "2022-03-31",
  "headline": "Activists on both sides of debate shoot down DeWine's proposed $10.5 million to combat gun violence",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/c701402/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsharing.news5cleveland.com%2Fsharescnn%2Fphoto%2F2017%2F04%2F11%2FGettyImages-158477645_1491953120050_58117036_ver1.0_640_480.jpg",
  "link": "https://www.news5cleveland.com/news/politics/ohio-politics/activists-on-both-sides-of-debate-shoot-down-dewines-proposed-10-5-million-to-combat-gun-violence",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    0
  ],
  "sentences": [
    "As part of the new Ohio Ballistics Testing Initiative, the Ohio Department of Public Safety’s Office of Criminal Justice Services will award the money to the AG's Bureau of Criminal Investigation (BCI) and Ohio State Highway Patrol (OSHP) to increase the number of National Integrated Ballistic Information Network (NIBIN) units in Ohio from seven to 16, DeWine said.",
    "Thursday afternoon, the group shared the new $10.5 million initiative that will give local law enforcement officers increased access to valuable technology to help them identify criminals responsible for deadly shootings and other incidents of gun violence.",
    "The bill would significantly crackdown on gun violence, while at the same time he looks to improve and streamline the background check and gun application process, to ensure guns only get into the hands of those who can lawfully own them.",
    "Whether it is bail reform legislation or its people holding their elected officials, their judges, their prosecutors accountable for lax sentencing and enforcement, something needs to change, the lobbyist said.",
    "The joint initiative will provide more opportunities for law enforcement to submit firearm evidence for scientific analysis, while simultaneously decreasing turnaround time on testing results, Yost added.",
    "This isn’t a gun problem, it's a systemic rise in all violent crime, exacerbated by elected officials and law enforcement not cracking down hard enough on criminal offenders, according to Sexton.",
    "\"So too often, people walk on bail when they ought to be kept incarcerated, or they wind up with lesser sentences when a repeat offender could be put away for much longer.\"",
    "\"With the help of this initiative, we are confident that more gunmen will be brought to justice, future shootings will be prevented, and lives will be saved,\" he said.",
    "\"In April of last year, I gave my team direction to figure out how we could expand NIBIN so that we have an excellent, all-covered corner to corner database in Ohio.\"",
    "\"He's signing people's death sentences — [that's] what he's doing, and it is very dangerous,\" Erick Bellomy, Ohio lead of Brady: United Against Gun Violence, said.",
    "The state says they are going to work on implementing the technology as soon as possible, noting that more people will need to be hired to fill new analysis roles.",
    "DeWine, Attorney General Dave Yost and Ohio State Highway Patrol Superintendent Col. Richard Fambro announced a joint initiative to use technology to save lives.",
    "\"The laws are on the books, but you've got to get down to enforcing them,\" Rob Sexton, Legislative Affairs Director for Buckeye Firearms Association.",
    "\"He is worried that if he doesn't pass certain legislation that the legislators are putting forward, that he may go through an impeachment process.\"",
    "\"After the Oregon District shooting in Dayton, DeWine said he was going to do something and we have yet to see him do something,\" he said.",
    "When asked in a mid-March press conference about his previous critiques of ARPA, DeWine said that he is going to \"take that money.\"",
    "DeWine could stop gun violence, but he is choosing not to by ignoring his constituents, specifically law enforcement, Bellomy said.",
    "\"I think it sends a message to those who have no respect for the law, to begin with that there's an open field for them,\" he said.",
    "\"Police departments across the state of Ohio, they do not support permitless carry, they do not support stand your ground laws.",
    "\"When we saw the body count start piling up in 2020 and 2021 around the state, I started doing a deep dive,\" Yost said.",
    "Both advocates hope the initiative works, but they believe neither of their goals would be accomplished by this.",
    "This is a science that can link firearm evidence to other crimes, thus providing leads for police, DeWine said.",
    "Many officers testified against his latest gun bills, saying it would make their jobs much more difficult.",
    "For Sexton, law enforcement still needs to be tougher on crime, with or without these additional devices.",
    "On the other side, Sexton said none of the machines matter unless the root of the problem is addressed.",
    "But advocates on both sides actually agree on one thing about guns: the governor isn't doing enough.",
    "The governor then asked the GOP legislators to stop sending him gun bills until they deal with his.",
    "\"In 2020, Ohio's major cities saw an average of a 26% increase in reported gun crime,\" DeWine said.",
    "COLUMBUS, Ohio — Three months into 2022 and Ohio has had more gun deaths than in 2021 at this time.",
    "Bellomy has some issues with the way DeWine has handled the aftermath of the 2019 Dayton shooting.",
    "\"The only thing that he is doing is passing or allowing dangerous gun legislation to be passed.\"",
    "Or, it is possible he is worried about being supported in his race for governor, he said.",
    "A stunning 1,845 people were killed by firearms, with data still being collected.",
    "In fact, 2021 was the deadliest year on the Department of Health's record.",
    "\"I think we need to be harder on violent crime in general,\" he said.",
    "Nine people were killed and 27 were wounded during a mass shooting.",
    "\"I think that he is pandering to his base,\" the activist said.",
    "NIBIN machines analyze markings on bullets and shell casings.",
    "This funding came from the American Rescue Plan Act (ARPA).",
    "\"The majority of Ohioans support state gun laws,\" he added.",
    "Last year was already record-breaking for homicides.",
    "The thing is — they don't mean it in the same way.",
    "Governor Mike DeWine is trying to fix that.",
    "DeWine then created the STRONG Ohio bill.",
    "For Bellomy, gun laws are still in place.",
    "They don't listen to their constituents.\"",
    "But our legislators still pass it.",
    "That didn't happen."
  ]
}