{
  "id": 1436,
  "mediaId": 2919,
  "date": "2022-04-04",
  "headline": "Objectors: Changes to legislative maps ‘cosmetic’ at best",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/202b908/2147483647/strip/true/crop/2048x1075+0+67/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F56%2F31%2F142491e44abbbfd4971329a96c4b%2Fimg-2312-2048x1536.jpeg",
  "link": "https://www.news5cleveland.com/news/state/objectors-changes-to-legislative-maps-cosmetic-at-best",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Tebben",
  "authorUrl": "https://www.news5cleveland.com/susan-tebben",
  "termIds": [
    1330,
    3212,
    3823,
    4676,
    34,
    763,
    994,
    5212
  ],
  "sentences": [
    "State Auditor Keith Faber, also a Republican member of the commission, voted against adoption of the fourth map, later telling reporters he wasn’t confident the map would “meet the court’s test.”\nThe NRAF said it wasn’t surprising to see the commission push through “the handiwork of Republican caucus staffers less than an hour after it was first publicly proposed.” But it still isn’t compliant with what voters asked for when they approved an overhaul to redistricting regulations in the state, or with the Supreme Court’s order to draft an “entirely new” map, as opposed to working from the one rejected by the court, the group said.",
    "The groups say the state’s high court should either adopt a constitutional plan itself for the 2022 election after overseeing the redistricting commission’s actions – perhaps using a “special master,” that is, someone neutral and chosen by the court to lead the effort – or expedite the process of getting a fifth map drawn by April 20.",
    "In a hearing last week in U.S. District Court, a three-judge panel said they wouldn’t intervene in the process yet, but gave the April 20 deadline as a date for all parties in a federal lawsuit regarding the primary to have a map ready for consideration.",
    "The League of Women Voters of Ohio, the Ohio Organizing Collaborative and a group of Ohio voters represented by the National Redistricting Action Fund, have all submitted expected objections to the maps approved late on the day of the deadline, March 28.",
    "It is also considering a congressional map, but lawsuits for that map are focused on the 2024 election cycle, all but solidifying the maps most recently adopted as those that will be used in the 2022 election cycle, including the May 3 primary.",
    "“Even the fourth plan’s proponents, the Republican Legislative Commissioners, scarcely bothered to pretend the fourth plan was constitutional,” NRAF attorneys wrote, referring to Senate President Matt Huffman, House Speaker Bob Cupp, Gov.",
    "A spokesman for LaRose’s office said this means “an election is underway.”\nThe Ohio Supreme Court is also awaiting responses from redistricting commission members on why they shouldn’t be held in contempt in redistricting cases.",
    "The map challengers criticized the entire process through which the fourth plan was approved, and said Republican members of the commission showed “egregious disregard” for the supreme court’s orders and the Ohio Constitution.",
    "Not only was the map more than 97% the same as the previous version, as Huffman said during the Monday ORC hearing, but the toss-up districts remain a significant problem for the plan’s partisan breakdown.",
    "“Once toss-up districts are removed from consideration, Republicans are favored in 66% of the seats in each chamber… and Democrats favored in only 34%,” attorneys for the ACLU stated in their briefing.",
    "The three judges also asked officials from the Secretary of State’s office about a “drop-dead date” for providing a map, which led to the April 20 date for an August 2 primary for legislative races.",
    "On Friday afternoon, the Secretary of State’s Office sent yet another directive to the county boards of elections reiterating that statehouse races won’t be on the May primary ballot.",
    "Yet again asking the Ohio Supreme Court to reject the Ohio Redistricting Commission’s legislative maps, objectors said the fourth plan is merely the third plan in new window dressing.",
    "Those changes were “understated” by legislative leaders, according to the NRAF and the American Civil Liberties Union, who is representing the League of Women Voters in its challenge.",
    "The ACLU said 17 House and six Senate districts the plan calls “Democratic-leaning” are within a 2% partisan advantage, making them toss-up districts, rather than “leaning” blue.",
    "The directive also said boards were authorized to issue the ballots to military and overseas Ohioans, under the Uniformed Services and Overseas Citizens’ Absentee Voting Act.",
    "That date would give the state Secretary of State’s office the ability to implement the maps in time for an August 2 legislative primary, which seems likely at this point.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "“Republican caucus staffers made minor, cosmetic changes to an unconstitutional General Assembly plan,” the NRAF stated.",
    "The court had asked for a partisan breakdown that gave the GOP 54% of seats and the Dems 46%.",
    "Those ballots need to go out no later than April 5, which is also the state of early voting.",
    "Mike DeWine and Secretary of State Frank LaRose."
  ]
}