{
  "id": 1584,
  "mediaId": 2537,
  "date": "2022-04-01",
  "headline": "Opinion: Cranley is the best candidate to lead our state",
  "image": "https://www.gannett-cdn.com/presto/2022/03/30/PCIN/4fcd3631-ad1b-4c6e-b0e9-96b855290772-03292022_GovDemDebate_MV_0006.JPG?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/04/02/opinion-cranley-best-candidate-lead-our-state/7229034001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KZ Smith",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In response to the multi-million-dollar bribery scandal aided by DeWine and his inner circle, Cranley proposed wholesale reforms that will give consumers a strong voice in how much they pay for gas and electricity and end Ohio’s history of allowing utilities to boost their profits by padding customer bills.",
    "He will continue the criminal justice reforms he brought to Cincinnati, such as police-worn body cameras, and will boost Ohio investments in renewable energy much like he did when he brought America’s largest solar farm to Cincinnati, resulting in new jobs.",
    "As Cincinnati mayor, he invested three million city dollars in the Community Economic Advancement Initiative, a Black organization dedicated to building wealth and pride in the Black community through home ownership and business development.",
    "That opinion is shared by great civil rights leaders and religious leaders all over Ohio – such as Pastor Otis Moss, Jr., Pastor Damon Lynch, Jr., and Pastor Damon Lynch, III, co-founder of the Collaborative Agreement.",
    "Now Avondale has a new and attractive strip mall with 119 residential apartments, clothing store, the Urban League's social justice space, clinic, and a new grocery store and restaurant that will open later this year.",
    "When Mercy Health, formerly Catholic Health Partners, had made the decision to move its headquarters out of Cincinnati, Cranley took action that resulted in Cincinnati not losing Ohio's fourth-largest employer.",
    "Mayor Cranley not only supported the plan to renovate but also helped the project to receive state tax credits, and he invested much-needed city dollars to complete the funding.",
    "DeWine has done – Cranley has a plan to put money in our pockets with an energy dividend paid for with an excise tax on natural gas extraction.",
    "Cranley established the Economic Inclusion Department to address why Blacks, women and small businesses were not getting their fair share.",
    "The debate gave him an opportunity to tell all parts of Ohio what he’s done for Cincinnati and what he plans to do for the entire state.",
    "When I first became the chairman of the Economic Inclusion Board, African Americans received less than 2% of all the city contracts.",
    "And, what I like and respect about Cranley is he doesn't say one thing on one side of town and something different everywhere else.",
    "In 1997, four churches, which make up the Coalition of Churches, took on the responsibility of managing the Avon Town Center.",
    "Shortly afterwards, city contracts awarded to African Americans increased to 17% – the highest percent it has ever been.",
    "Opinion contributor\nRealistically, there isn't a perfect candidate running to become the next Governor of Ohio.",
    "Oddly enough, I supported Cranley‘s opponent when he first ran to become the mayor of Cincinnati.",
    "A few years ago, the coalition partnered with The Community Builders to renovate the Town Center.",
    "I have watched him throughout the years, and now I am 100% in support of the Cranley campaign.",
    "I suspect I speak for all of Ohio when I say we need cleaner government and a cleaner planet.",
    "Currently, the OIP is responsible for setting free 34 persons who were wrongly convicted.",
    "Cranley eagerly debated his primary opponent, former Dayton Mayor Nan Whaley, this week.",
    "John Cranley is the only candidate who can deliver both because he’s done it before.",
    "I am not alone in believing that he is the best candidate to lead our state.",
    "Instead of forcing Ohio to subsidize a coal plant in Indiana – as Gov.",
    "KZ Smith is senior pastor of Corinthian Baptist Church in Avondale.",
    "Mike DeWine wants us to believe that his reelection is inevitable.",
    "But, honestly, I believe John Cranley is the best candidate.",
    "And, we will continue to work to increase the percentage.",
    "He’s even refused to debate his primary opponents.",
    "This is why I support John Cranley for governor.",
    "He is co-founder of the Ohio Innocence Project.",
    "They all have endorsed him for governor.",
    "He stays true to his word.",
    "Gov."
  ]
}