{
  "id": 1669,
  "mediaId": 2728,
  "date": "2022-04-03",
  "headline": "EXPLAINER: Why disputed maps won’t stop Ohio’s May 3 primary",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/news/world/us/2022/04/03/explainer-why-disputed-maps-wont-stop-ohios-may-3-primary.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julie Carr Smyth",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "A group of Republican voters had asked a federal court to force the state to use one of three sets of legislative maps approved by the Ohio Redistricting Commission but rejected by the state Supreme Court, but last week a panel of federal judges said no.",
    "COLUMBUS, Ohio (AP) — Despite the uncertainty raised over the date of Ohio’s primary election, the state is ready to move forward with early voting Tuesday for a likely May 3 contest with statewide and congressional races, but not legislative ones.",
    "“Given all the chaos and confusion around redistricting this year, there have been limited voter registration drives and most voters don’t know that the deadline is Monday,” said Jen Miller, executive director of the League of Women Voters of Ohio.",
    "Beyond that, Republicans who control both the Legislature and the Ohio Redistricting Commission have repeatedly approved maps that the Ohio Supreme Court has found unconstitutionally drawn to unduly favor Republicans.",
    "The partial primary is scheduled to go ahead despite months of unresolved legal wrangling that has seen proposed redistricting maps repeatedly shot down by the Ohio Supreme Court as unconstitutional gerrymanders.",
    "Voting rights and Democratic groups — and even, at points, the state elections chief and some political candidates — have asked to delay the primary to allow time for acceptable maps to be crafted.",
    "Mike DeWine is facing three GOP challengers from the right, while two former mayors — Nan Whaley of Dayton and John Cranley of Cincinnati — are vying for the Democratic gubernatorial nomination.",
    "Secretary of State Frank LaRose, a Republican, wrote lawmakers that if they didn’t act by Friday to make changes — which they didn’t — those races would go forward on Aug. 2.",
    "Rob Portman’s seat is among the nastiest and most expensive in the nation this year, with an endorsement from former President Donald Trump still a long shot possibility.",
    "By the time federal judges made their decision last week on emergency requests to intervene in the primary, time had run out for those candidates to be added to ballots.",
    "Parties in a separate federal lawsuit over the congressional maps asked Friday for judges to keep U.S. House races under the challenged map from going forward, too.",
    "Ohioans must register to vote by Monday, unless the judiciary or Legislature intervenes, even as legal challenges continue to pour into state and federal courts.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "But the Ohio Supreme Court said it did not have the power to move the election, and Republican majorities at the Statehouse have opted against it so far.",
    "That has left contests for state senators and representatives, as well as races for party central committees and state school boards, in limbo.",
    "State legislative races are being delayed because no set of district boundaries has been settled on long enough to be used for making ballots.",
    "Voters will decide partisan primaries for U.S. Senate, U.S. House, governor, secretary of state and various local races and ballot questions.",
    "“Both voter registration and poll worker numbers are down significantly.”\n___\nWHY ARE SOME DISPUTED MAPS BEING USED MAY 3 AND NOT OTHERS?",
    "Their legislative maps have been invalidated three times and counting, and their congressional maps have been challenged in court twice.",
    "The Ohio Redistricting Commission’s second try at a constitutional congressional map has been challenged at the Ohio Supreme Court.",
    "But after the timetable for hearing that case extended well past the primary, LaRose deemed the map valid for use on May 3 ballots.",
    "U.S. House races have been allowed to continue because court proceedings have tied up the latest disputed map beyond Election Day.",
    "This is the state’s first go-round with new redistricting rules approved overwhelmingly by voters to stop gerrymandering.",
    "Three Democrats are also running for the seat, which the party sees as among their best chances nationally to flip.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Some things to know about the situation:\nWHICH RACES WILL APPEAR ON THE MAY 3 BALLOT?",
    "Candidates for Ohio House and Ohio Senate will not appear on May 3 ballots.",
    "By contrast, litigation over legislative maps has been much more volatile.",
    "___\nWHY HAS OHIO BEEN HAVING SO MUCH TROUBLE WITH ITS MAPS?",
    "The seven-way Republican primary for retiring GOP Sen.",
    "Disagreement abounds over how the system should work.",
    "The Star does not endorse these opinions.",
    "WHY WERE SOME PEOPLE ASKING FOR A DELAY?",
    "That has voter groups concerned.",
    "WHAT ABOUT LEGISLATIVE RACES?",
    "The quick answer is timing.",
    "Republican Gov."
  ]
}