{
  "id": 1686,
  "mediaId": 2658,
  "date": "2022-04-06",
  "headline": "May governor primaries pose big test for Trump’s control over the GOP",
  "image": "https://static.politico.com/19/68/5fd1e7e84e9d84ff1c7ac1a8c86b/https-delivery.gettyimages.com/downloads/1239141252",
  "link": "https://www.politico.com/news/2022/04/06/may-governor-primaries-trumps-control-gop-00023197",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "A recent press release from Renacci even bragged that Trump sent around video from a film that his running mate Joe Knopp produced, with Knopp saying in a statement, “I am very close to the Trump Family.”\nThe former congressman has also hired a top Trump loyalist, Brad Parscale, to try to tie himself closer to the former president — a tactic that is also increasingly common in the month’s most chaotic open gubernatorial primary in Pennsylvania.",
    "(She later told a reporter for KTVB, a Boise-based TV station, that conference attendees were “young conservatives” supporting “America First” policies, but that she didn’t know the organizer before the event and the reporter was trying to do “guilt by association.”)\nLittle and McGeachin have had particularly public, and at times farcical, battles over Covid policy in the state.",
    "Martha Zoller, a Georgia-based Republican operative who was once a senior aide to both Kemp and Perdue and now hosts a talk radio show in Northeast Georgia, said that disconnect shows how longtime state political dynamics — which are especially prevalent for Kemp’s reelection bid — can sometimes trump Trump weighing in, even as he remains incredibly popular.",
    "Her opening TV ad in the contest highlights her ambassadorship in its first 10 seconds and says she is “trusted by President Trump.” Trump at one point even floated an endorsement of Blanchard, the Wall Street Journal reported last year, with the former president reportedly angry at Ivey over a scrapped rally at a decommissioned battleship.",
    "He cited an unscientific survey that the party ran during a recent debate about pandemic policy in the state, where 70 percent said that they didn’t believe businesses should require vaccines as a condition for employment — but 68 percent said they also didn’t believe the legislature should pass a law prohibiting companies from doing so.",
    "Little has not publicly drawn Trump’s ire as Kemp has, but the former president nevertheless backed McGeachin, an early supporter of his with ties to the far right — including a virtual appearance at the America First Political Action Conference in February, which was hosted by a white nationalist.",
    "It’s just people now know that she had that endorsement, and she continues to use that to her benefit.”\nLuna, who is neutral in the primary, said that as primary day draws nearer, he expects to see a resurgence of the endorsement in the race, especially in McGeachin’s advertisements.",
    "A recent Fox News poll had no clear frontrunner, with former Rep. Lou Barletta, an early Trump 2016 supporter, in first place at 19 percent and state Sen. Doug Mastriano, a proponent of Trump’s election lies who once said Trump “asked me” to run for governor, in second at 18 percent.",
    "Sanders — who was being floated as a potential gubernatorial candidate while she was still working at the White House, including by Trump publicly — eventually cleared the field of prominent challengers in the state, including the sitting lieutenant governor and attorney general.",
    "“I think his endorsement would help the candidate overall, more than it would hurt the candidate in the Republican primary,” Christopher Nicholas, a veteran Pennsylvania-based Republican strategist advising gubernatorial candidate Charlie Gerow, said.",
    "On more than one occasion, McGachin would use her power as acting governor while Little was out of the state to issue an executive order related to the pandemic — like trying to ban various mandates — which Little would angrily rescind shortly after.",
    "Geoff Duncan, a vocal critic of Trump since the 2020 election who is not seeking reelection this year, “the quicker we’re going to move past Donald Trump and close that chapter.”\nBut many Republican candidates don’t agree.",
    "The group, which endorses its incumbent members as a manner of policy, has gone beyond that in Georgia by running nearly $1.3 million worth of TV ads boosting Kemp so far, according to the ad tracking firm AdImpact.",
    "But Ivey, too, has sought to tie herself to Trump, with a narrator in one ad declaring her “Trump tough” and saying she is “fighting Joe Biden every step of the way.”\nIvey appears to be in pole position in the race.",
    "Trump has been heavily involved in Perdue’s challenge to Kemp, publicly trying to draw the former senator into the race throughout 2021 before immediately endorsing once Perdue launched his campaign in December.",
    "Both allies and opponents of Trump see the May primaries as a test of his staying power, believing the outcome will offer signs of how powerful he remains two years out from the next presidential election.",
    "Trump threw his support behind Charles Herbster, a cattle-breeding executive and longtime ally who has feuded with the governor, despite Ricketts trying to dissuade Trump from doing so last year.",
    "“If President Trump endorses in this race, that person has the best chance of being the Republican nominee,” Kellyanne Conway, Trump’s former campaign manager, told reporters last week.",
    "May’s primaries contests will test the success of that strategy and could shed light on Trump’s crumbling influence within the GOP — or prove it is as ironclad as it has ever been.",
    "“Save America is committed to ensuring every voter is engaged and educated ahead of these important elections,” Budowich said in his statement, referring to Trump’s leadership PAC.",
    "A recent Perdue ad highlights Trump’s comments from a March rally, where he attacked Kemp as a “turncoat” and said there was “massive voter fraud” in Georgia in the 2020 election.",
    "A Fox News poll released last month had Kemp leading Perdue by 11 points among Republican primary voters, even with Trump being overwhelmingly popular among Georgia Republicans.",
    "“President Trump’s endorsement is the most powerful force in politics,” Taylor Budowich, a spokesperson for Trump, said in a statement in response to a series of questions.",
    "In Arkansas, the race showed the potential potency of his endorsement, when he backed his former press secretary Sarah Huckabee Sanders shortly after she launched her bid.",
    "Trump himself acknowledged the difficulty of beating Kemp in the primary in an interview with John Fredericks, a popular conservative radio host who is close to Trump.",
    "A recent Gray TV/Alabama Daily News survey conducted by Cygnal, a well-respected Republican polling outfit, has her well ahead of the rest of the field at 46 percent.",
    "But that’s okay, I’m always prepared for that.”\nKemp is one of two incumbent Republican governors facing a Trump-endorsed primary challenge in May, with Idaho Gov.",
    "A series of Republican gubernatorial primaries in more than half a dozen states, all scheduled for May, has turned into mini-referendums on the former president.",
    "There, several campaigns in a crowded field have hired on former Trump hands to boost their campaigns, and try to secure an endorsement of the former president.",
    "Tom Luna, the chair of the Idaho Republican Party, said that the response to Covid is one of the biggest issues in the gubernatorial and other state primaries.",
    "He’s directly backing candidates challenging two sitting GOP governors and a flock of other Republicans are running in his image — even without his blessing.",
    "They are still clamoring for Trump’s endorsement — or, failing that, trying to get some residual shine by associating with former Trump aides and confidants.",
    "Kemp has with the voters than Trump has with the voters.”\nOn the trail, Perdue has leaned in heavily to Trump’s mythology that the 2020 election was stolen.",
    "A major question hanging over the race is if Trump will spend some of his $110 million political war chest to boost Perdue and other endorsed candidates.",
    "But notably, Pillen is not trying to sell himself as anti-Trump, instead promising to defend Trump’s legacy in an introductory video in the crowded race.",
    "The two other Republican governors seeking their party’s nomination in May are also facing Trump-inspired — but not Trump-endorsed — primary challengers.",
    "When Trump first endorsed McGeachin, Luna said, “everybody was talking about it, everybody was writing about it.” But over time, the race moved on.",
    "Kay Ivey is staring down a primary field that includes a son of a former governor and Lynda Blanchard, Trump’s former ambassador to Slovenia.",
    "He has embraced that lie on the stage alongside Trump and in media interviews, and has emphasized it — and Trump’s support — in campaign ads.",
    "Georgia presents the most visible test of Trump’s sway over the party, not only in May but arguably during the entire election cycle.",
    "Mike DeWine is the other Republican incumbent facing down a non-endorsed challenger, with former Rep. Jim Renacci and Joe Blystone.",
    "“Not easy to beat a sitting governor, just remember that,” Trump told Fredericks on Tuesday, while floating another Georgia rally.",
    "Blanchard, who briefly ran for the state’s open Senate race, has leaned hard into her tenure in the Trump administration.",
    "Luna said that the issue puts politicians in a particularly tricky place among Republican primary voters in his state.",
    "Brian Kemp, whom Trump still blames for not helping overturn his narrow loss in the state during the 2020 election.",
    "There, a recent Fox News poll had DeWine at 50 percent, with Blystone at 21 percent and Renacci at 18 percent.",
    "There, Trump has thrown his full support behind former Sen. David Perdue’s primary challenge to Gov.",
    "But, should Trump weigh in before the primary, his endorsement could be both a blessing and a curse.",
    "Trump has rallied for Perdue in the state, and has cut direct-to-camera TV ads for him as well.",
    "The race has also put Trump on a collision course with the Republican Governors Association.",
    "But Perdue’s candidacy is struggling, with time rapidly dwindling for him to close the gap.",
    "(Budowich, Trump’s spokesperson, did not answer a question on the potential endorsement.)",
    "Brad Little also being primaried by the state’s lieutenant governor, Janice McGeachin.",
    "Conway now works for the gubernatorial campaign of state Senate President Jake Corman.",
    "The second open race comes in Nebraska and pits Trump against outgoing incumbent Gov.",
    "Renacci, in particular, has tried to lean into his Trump connections during the race.",
    "Donald Trump is about to learn how much clout he still has in the Republican Party.",
    "Earlier this year, Ricketts endorsed Jim Pillen, a University of Nebraska regent.",
    "“It’s probably the biggest argument and disagreement in this campaign,” he said.",
    "If David wins, we’ll get no credit, if he loses [the press will] blame me fully.",
    "Kemp has significantly outraised Perdue, and has led him in public polling.",
    "Trump weighing in became “not as new and shiny as it once was,” he said.",
    "Trump has also endorsed in two open seat May gubernatorial primaries.",
    "“The quicker we get through the May primaries,” said Georgia Lt. Gov.",
    "It isn’t clear if Trump will actually endorse in the race or not.",
    "But if he does, it could be decisive with such a crowded field.",
    "A candidate, however, needs majority support to avoid a runoff.",
    "“Brian Kemp has relationships with people going back 20 years.",
    "“We’ll see, at the end of the day, if it’s enough,” he added.",
    "“Trump is really a 2015 or later entity,” Zoller said.",
    "“It would not be a positive in the general election.”",
    "Pete Ricketts — who is also the co-chair of the RGA.",
    "“But it’s a close race, and we’ll see what happens.",
    "… It’s a different kind of relationship that Gov.",
    "He declined to provide any further specifics.",
    "The most explicit is in Alabama, where Gov.",
    "“I don’t say that as a negative.",
    "Ohio Gov."
  ]
}