{
  "id": 1927,
  "mediaId": 2919,
  "date": "2022-03-23",
  "headline": "In State of the State address, DeWine touts economic development; Dems lash back over redistricting debacle",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/4c8cf73/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F25%2Fb6%2F4f0fb7cb4bb2a3efda275a7c9082%2Fposter-image-2022-03-23t172055.525.jpg",
  "link": "https://www.news5cleveland.com/news/state/12pm-ohio-governor-to-give-statewide-address-after-pandemic-delay",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    1688,
    4208,
    878,
    5212
  ],
  "sentences": [
    "\"What unites us is stronger than what divides us, and I know that we are solidly united in our deep love for Ohio and in our belief that EVERY Ohioan deserves the chance to succeed -- no matter their zip code; no matter if they live in Appalachia, in our cities or in our suburbs; no matter who their parents are,\" Gov.",
    "The past two years have been filled with significant, career-defining moments for the governor:\nCORONAVIRUS PANDEMIC\nDeWine moved quickly in March 2020 even before Ohio had a confirmed COVID-19 case, limiting attendance at a sports festival in Columbus and becoming the first governor to close schools.",
    "\"This Republican culture of corruption stems from unchecked, one-party rule created by gerrymandered maps that unduly favor Republicans, leading the majority to believe they are above the law and can do anything to keep their power,\" House Minority Leader Allison Russo said.",
    "The veteran politician twice canceled the speech due to the coronavirus pandemic, but still became the most viewed governor in state history by giving dozens of televised daily news conferences documenting Ohio’s efforts to slow the spread of the virus.",
    "REDISTRICTING\nThe voter-created Ohio Redistricting Commission, of which DeWine is a member, has failed after three attempts to draw constitutionally sound legislative maps, according to the state Supreme Court which has rejected them each time.",
    "But the state was dealt a blow just weeks later when Peloton canceled its plan to open its first U.S. factory, which would have employed 2,000 workers in Ohio, because of a dramatic drop in demand for its interactive bikes and treadmills.",
    "And, we cut taxes by more than $3.6 billion, creating Ohio’s lowest taxes in more than 40 years, leaving more money for businesses to re-invest in our economy and more money in the pockets of our fellow Ohioans,\" he added.",
    "BRIBERY SCANDAL\nA federal probe into a $60 million bribery scheme involving FirstEnergy Corp. and the bailout of two nuclear power plants has swirled around the edge of DeWine’s administration since the summer of 2020.",
    "\"The future Ohio that I envision has the best, most robust behavioral health workforce in the country, a workforce that is hailed as heroic and valued as a vital part of our healthcare system,\" he added.",
    "In the face of that rejection, DeWine signed other measures loosening gun control such as eliminating the duty to retreat and ending the requirement for a concealed weapons permit earlier this month.",
    "Those include banning abortions after a detectable heartbeat, requiring fetal remains from surgical abortions to be cremated or buried, and banning the use of telemedicine for medication abortions.",
    "His subsequent response to address gun violence failed to find traction among GOP lawmakers, despite modest elements that included boosting penalties for felons committing new crimes with guns.",
    "The May 3 primary is now in doubt, as state elections chief Frank LaRose — also a member of the commission — is pausing certain primary preparations following the Supreme Court’s last ruling.",
    "Watch the governor's State of the State address in the video player below:\nThe governor may be up for reelection this November, but his address Wednesday shared his plans for the future.",
    "DeWine also has faced questions over appointing Samuel Randazzo as the state’s top utility regulator, despite warnings from environmentalists and a group of fellow Republicans.",
    "During a press conference following, Democrats outlined their plan to expand opportunity, invest in working people and families, and build an economy that works for everyone.",
    "FirstEnergy, in an agreement reached with the U.S. Department of Justice, said Randazzo helped write the 2019 energy bill — signed by DeWine — at the heart of the scandal.",
    "ABORTION\nSince that first State of the State, DeWine has followed through on his stance against abortion and signed a number of bills restricting the procedure into law.",
    "While none of those charged in the investigation worked for the governor, Dan McCarthy, DeWine’s top lobbyist, resigned last September after three years on the job.",
    "\"They deserve the chance to get a good-paying job, to raise a family comfortably, to be secure in their future, and to live their version of the American Dream.\"",
    "A year ago, GOP legislators overrode a DeWine veto for the first time, on legislation weakening the state’s ability to respond to public health emergencies.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "His speech comes at a political crossroads as he faces a four-way GOP primary May 3 amid conservative dissatisfaction with the pandemic steps he took.",
    "@WEWS pic.twitter.com/6WhIRE86bs\n— Morgan Trau (@MorganTrau) March 23, 2022\nBut Democrats said the future isn’t as bright as the governor says it is.",
    "His biggest concern, which he spent a good portion of his address talking about, is the access to mental health support, especially for young people.",
    "The governor scored a major win early this year when Intel announced it was investing $20 billion in two semiconductor factories near Columbus.",
    "But the state workforce also has shrunk by about 190,000 workers since the pandemic, and many companies are still struggling to find workers.",
    "\"The sun is coming up in Ohio, the wind is at our back, and together, we have the power to change the course of Ohio’s history,\" he cheered.",
    "He proposed to grow the behavioral health workforce by increasing research and innovation and building community capacity for care.",
    "\"But now, now we are bringing the highest tech manufacturing known to man into the State of Ohio, and the world is taking notice!\"",
    "McCarthy is a former FirstEnergy lobbyist who was president of one of the dark money groups implicated in the alleged scheme.",
    "McCarthy said his actions were legal and DeWine’s office said it has no indication McCarthy is a target of the ongoing probe.",
    "Conservative anger spread into the gubernatorial campaign, with DeWine now facing three far-right challenges in the primary.",
    "GUNS\n“Do something!” crowds chanted at DeWine at a vigil following the Aug. 4, 2019, Dayton mass shooting that killed nine.",
    "Law enforcement funding, improvements to the state parks and mentorship programs for children to avoid substance abuse.",
    "Ohio’s unemployment rate this past January was slightly lower than what it was when the pandemic struck in March 2020.",
    "He is proud of Ohio’s accomplishments over the past few years, especially with the economy and business developments.",
    "COLUMBUS, Ohio — The world has turned upside down since March 5, 2019, the only time Ohio first-term Republican Gov.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Fair districts mean better representation, which means better, more responsive government by and for the people.\"",
    "I am proud of the work we have started together and we have done a lot in the area of mental health,\" he said.",
    "Randazzo, who also has not been charged in the bribery scheme, resigned after FBI agents searched his home.",
    "On Wednesday, DeWine returned to the Statehouse for the last State of the State address of his first term.",
    "Specific proposals to help mental illness and untreated addiction will be proposed in the weeks ahead.",
    "Praised initially, the governor came under fire from fellow Republicans who felt he went too far.",
    "He faced fierce conservative criticism for the economic impact of his COVID-19 shut-down orders.",
    "This is the single, largest economic development investment by one company in Ohio's history.",
    "\"Dems have stood up for the vast majority of Ohioans who overwhelmingly voted for fair maps.",
    "The Intel Corporation is investing $20 billion in Ohio, creating a new microchip factory.",
    "Associated Press writer Julie Carr Smyth in Columbus also contributed to this report.",
    "Judges have placed all those laws on hold pending constitutional challenges.",
    "\"Working together, we’ve slashed state spending by a whopping $1.2 billion!",
    "DeWine didn't mention the redistricting debacle at all during his speech.",
    "DeWine has said he has no regrets about his handling of the pandemic.",
    "Download now on your Apple device here, and your Android device here.",
    "Today — the Chamber is full for the Ohio State of the State address.",
    "@GovMikeDeWine received a LONG standing ovation from the crowd.",
    "\"But, despite our best efforts so far, it still is not enough.\"",
    "JOB CREATION\nDeWine has had hits and misses on the jobs front.",
    "This is creating tens of thousands of jobs in Licking County.",
    "House and Senate Democrats issued a joint response to Gov.",
    "Associated Press writer John Seewer reported from Toledo.",
    "Mike DeWine has delivered a State of the State address.",
    "\"Ohio has always been a manufacturing state,\" he said.",
    "The governor focused on a few main areas to work on.",
    "The Associated Press contributed to this report.",
    "\"Let me begin by talking about mental health.",
    "But DeWine also brought up the shortcomings.",
    "Learn more about our streaming options here.",
    "DeWine said to open his hour-long speech.",
    "That wasn't all they had to say, though.",
    "This is the first #SOTS in three years.",
    "We're also on Amazon Alexa devices.",
    "DeWine’s speech."
  ]
}