{
  "id": 1950,
  "mediaId": 2537,
  "date": "2022-03-21",
  "headline": "Where's the beef? Between Gov. Mike DeWine and challenger Joe Blystone, it’s at the Expo",
  "image": "https://www.gannett-cdn.com/presto/2022/03/21/NCOD/9625accb-406d-49fb-a766-acee0b8910ae-DeWine_Blystone.jpg?crop=1512,851,x0,y42&width=1512&height=851&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/03/21/gov-dewine-and-gop-challenger-blystone-have-spat-ohio-beef-expo/9454980002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    1688,
    2812,
    3378,
    4084,
    205,
    4916,
    5212
  ],
  "sentences": [
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "DeWine recently declined the Ohio Debate Commission’s event at Central State University set for March 29, saying everyone already knew his positions on the key issues.",
    "\"But what I did say was a reference to me winning the race, and I expressed to him my confidence that I would defeat him in the race for governor.\"",
    "Video released by the Blystone campaign shows the two gubernatorial candidates talking for a bit before Blystone points at DeWine.",
    "Blystone, in a video explaining the incident, says he approached DeWine to ask about why the governor wouldn’t debate him.",
    "Mike DeWine and challenger Joe Blystone had an exchange at the Ohio Beef Expo at the state fairgrounds in Columbus.",
    "DeWine’s campaign, through a spokeswoman, declined to comment on the incident and would not confirm what was said.",
    "An Ohio Highway Patrol trooper standing nearby did not have a body camera, a spokesman said.",
    "Because of noise from an auction, it's not possible to hear the audio of what the two said.",
    "Shortly after, three men with DeWine direct him away from Blystone, separating the two.",
    "DeWine then touches Blystone’s shoulder, but Blystone pushes DeWine’s arm away.",
    "Angus wasn't the only beef going down at the Ohio Beef Expo this Saturday.",
    "The day after Ohio Senate candidates literally went toe-to-toe, Gov.",
    "\"I'm not going to go into what I said,\" DeWine said Tuesday.",
    "The governor travels with security."
  ]
}