{
  "id": 2104,
  "mediaId": 2537,
  "date": "2022-03-20",
  "headline": "From taxes to education: Has Gov. Mike DeWine delivered on promises since taking office?",
  "image": "https://www.gannett-cdn.com/-mm-/df25aafd89aff2a51747aaae6a2c8ca855547210/c=0-216-4753-2890/local/-/media/2020/08/31/ColumbusOH/ghows_gallery-OH-721009996-2c7369c1.jpg?width=3200&height=1801&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/state/2022/03/21/ohio-governor-dewine-promises-progress-gas-taxes-education/7050670001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    1688,
    351,
    752,
    4906,
    4916,
    5212,
    5356
  ],
  "sentences": [
    "\"Unfortunately, in the context of all this controversy related to race and equity, you seem to have some extremists on the State Board of Education calling into question the need to focus on social emotional learning.\"",
    "Most local law enforcement agencies don't have the technology or resources to analyze phones and other digital devices that connect buyers and sellers, according to the Ohio Department of Public Safety.",
    "Anna Staver is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Gun control advocates called those signatures a betrayal of his \"do something\" promises, but groups like the Buckeye Firearms Association said DeWine fulfilled the promises he made to them.",
    "Gun legislation\nAlthough the governor didn't mention gun control in the 2019 speech, he laid out an ambitious set of reforms—especially for a Republican?—in the first year of his term.",
    "The bill would have expanded civil commitment or “pink slip” laws, increased penalties for certain gun crimes and created a voluntary background check system for private firearm sales.",
    "Clean water\n\"From aging infrastructure to failing septic systems to threats of lead contamination,\" DeWine gave lawmakers a list of reasons for investing in water projects.",
    "When he took office in 2019, he pushed to raise the gas tax, created a new way to fund water projects and designated wraparound dollars to Ohio's most vulnerable children.",
    "It received $13 million in the last two-year budget and has offices in Columbus and Cleveland with additional offices scheduled to open in Toledo and Cincinnati.",
    "Republican state Sen. Steve Huffman wants to roll DeWine's gas taxes back–at least temporarily–but the governor says local governments still need those dollars.",
    "Lawmakers seeded this fund with a modest amount of state dollars before the pandemic, but H2Ohio got a $250 million boost from the federal COVID relief funds.",
    "Both bills were about criminal justice reform, but Derry said SB 3 had the potential to give DeWine \"complete success on this state of the state promise.\"",
    "They allocated money for it in the 2020-2021 budget, but those dollars were folded into the new school funding formula for fiscal years 2022 and 2023.",
    "Mike DeWine kicked off his first term with an ambitious speech, laying out plans to fix Ohio's bridges, waterways, schools and infant mortality rates.",
    "In December 2020, the Ohio Department of Health released a report showing racial disparities getting worse despite years of efforts to close the gap.",
    "Despite these challenges, DeWine spokesman Dan Tierney thought the governor accomplished or laid the foundation for \"a lot of the big ticket items.\"",
    "Republicans weren't convinced, but lawmakers eventually compromised on a 10.5-cent per gallon increase for gasoline and a 19 cents for diesel fuel.",
    "We reviewed DeWine's pre-pandemic plans to see which initiatives succeeded, which ones remain in progress and how COVID-19 impacted his agenda.",
    "One idea he put forth was the creation of a \"new highly specialized narcotics intelligence unit\" called the Ohio Narcotics Intelligence Center.",
    "STRONG Ohio was his plan to \"do something\" in the wake of the Dayton mass shooting that killed nine people and injured 27 more in August 2019.",
    "DeWine also promised to \"dramatically increase\" the number of specialty or drug courts that divert people into treatment instead of jail.",
    "“I think people would be very surprised if they found in six months that their roads are not being repaired,” DeWine told reporters.",
    "What he hopes to hear from the governor on Wednesday is a renewal of his 2019 dedication to \"meeting the needs of the whole child.\"",
    "Ohio Education Association President Scott DiMauro said the change provided schools with a more stable way to fund these services.",
    "Raising the gas tax\nDeWine started his 2019 speech by telling lawmakers Ohio's roads and bridges had been neglected for too long.",
    "Huffman's tax cut would cost about $4 billion over the next five years, according to the state Department of Transportation.",
    "\"If hunger is an issue in that community, the school can use wraparound services to make sure kids are fed,\" Tierney said.",
    "His success on that front has been a \"mixed bag,\" said Micah Derry, the bail reform campaign director for Arnold Ventures.",
    "He worked on two bills during the last General Assembly, House Bill 1 (which passed) and Senate Bill 3 (which did not).",
    "Tierney said the idea came to him after talking with teachers about the challenges students face outside the classroom.",
    "Opioids and addiction\nThe governor dedicated several minutes in his 2019 address to the impact of the opioid crisis.",
    "State lawmakers created the Ohio Commission on Infant Mortality in 2014, and they funded a pilot project in 2016.",
    "At the time, Black children were three times more likely to die before their first birthdays than white children.",
    "DeWine said that had to stop, but the work to lower infant mortality rates began years before he took office.",
    "Infant mortality\nDeWine received applause for his promise to cut the infant mortality rate for Black infants.",
    "It never got a vote, but state lawmakers did send him two pieces of legislation expanding gun rights instead.",
    "Gasoline averaged $2.60 per gallon in March 2019, according to the U.S. Energy Information Administration.",
    "ONIC has analyzed about 4,300 cell phones and assisted in 820 criminal investigations since its creation.",
    "\"Overall, we would probably look back on it as a pretty good batting average for that speech,\" he said.",
    "DeWine signed a stand your ground law in 2021, and a law eliminating concealed carry permits in 2022.",
    "\"He has been on the right side of this issue from early in his administration,\" DiMauro said.",
    "School funding\nDeWine asked for millions of wraparound service dollars for K-12 children.",
    "To do that, he asked state lawmakers to raise the state gas tax by 18 cents per gallon.",
    "That's something DeWine specifically mentioned in his first state of the state speech.",
    "\"We hope he stands up against these extremists and shows leadership on these issues.\"",
    "\"It is the smallest amount we can add that will keep our families safe,\" DeWine said.",
    "So, DeWine asked for a new way to fund these projects from surplus budget dollars.",
    "His plans for Dr. Amy Acton's role in his administration drastically changed too.",
    "But now Ohioans are paying around $4 per gallon because of the war in Ukraine.",
    "The fund has helped pay for 54 water projects across 60 Ohio counties so far.",
    "\"We now face a crisis today that must be addressed immediately,\" DeWine said.",
    "\"We cannot continue to lurch from water crisis to water crisis,\" he said.",
    "DeWine went two years without giving another state of the state address.",
    "\"The focus wasn't on where the funding comes from,\" Tierney said.",
    "He oversaw shutdowns, mask mandates and a vaccination effort.",
    "DeWine will deliver his state of the state address Wednesday.",
    "But lowering the rate has proven to be a tricky task.",
    "A move that would generate $1.2 billion annually.",
    "\"But on an agreement to tackle the issue.\"",
    "The pandemic pushed prices down to $1.44.",
    "But gas prices were much lower then.",
    "The new center connects those dots.",
    "After winning his dream job, Gov.",
    "Then, the COVID-19 pandemic hit.",
    "And we must re-build our roads.\"",
    "\"HB 1 was a good bill,\" he said.",
    "\"But it was a half measure.\"",
    "We must bolster our bridges.",
    "\"We must fill our potholes.",
    "Lawmakers liked the idea.",
    "It was called H2Ohio."
  ]
}