{
  "id": 2194,
  "mediaId": 3993,
  "date": "2022-03-22",
  "headline": "And then there were 24: Holcomb signs Indiana Constitutional Carry bill",
  "image": "https://media.townhall.com/townhall/reu/o/2016/338/af81058e-8ad0-4372-a31b-1549237980de-1110x740.jpg",
  "link": "https://bearingarms.com/camedwards/2022/03/22/and-then-there-were-24-holcomb-signs-indiana-constitutional-carry-bill-n56634",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    0
  ],
  "sentences": [
    "Eric Holcomb would sign the Constitutional Carry bill that passed the legislature earlier this month, allow it to become law without his signature, or veto the measure as the head of the Indiana State Police had urged, but Monday night the governor put the guesses to rest by putting pen to paper and making Indiana the 24th state to recognize the right of legal gun owners to bear arms without a government-issued permission slip.",
    "“I will work with law enforcement leaders across our state to make necessary changes to firearms enforcement as well as identifying the best way to identify individuals who are not allowed to carry a firearm as defined by Indiana statute.”\nThat shouldn’t be an issue, given that police in the 21 states that approved Constitutional Carry before this year’s legislative sessions kicked off have figured it out.",
    "And if it makes Carter feel any better, I suspect that a fair number of Hoosiers are going to continue to maintain their carry license if for no other reason than reciprocity agreements with other states (though the fact that Indiana’s license to carry is free from any government-imposed fees is also helpful).",
    "Mike DeWine, Holcomb isn’t up for re-election this year and he doesn’t have to worry about bolstering support ahead of a potentially bruising primary battle, and given the anti-Constitutional Carry slant of local media and many law enforcement I was worried that Holcomb would buckle under the pressure.",
    "And if a prohibited person has a firearm, he or she can be prosecuted.”\nI confess that as the days rolled by after the legislature approved Constitutional Carry and Holcomb said nothing about what he intended to do with the bill, I was concerned that the governor might end up vetoing the measure.",
    "When Kemp officially signs Constitutional Carry half of the states in the U.S. will recognize the right to bear arms without a government permission slip, and there’s still a good chance that Nebraska lawmakers will approve their own legislation before they adjourn for the year.",
    "I suppose if they’re looking to keep up their stunts the three can always drive down to Georgia, though I don’t think they’re going to have any more luck convincing Brian Kemp to veto the Constitutional Carry bill that’s awaiting his signature.",
    "Ron Galaviz, chief public information officer for Indiana State Police, confirmed the three were detained after refusing to leave the Statehouse at 5 p.m. and were released when they did agree to leave.",
    "Moms Demand Action activists Heather Hilbert and Becca McCracken were cuffed along with one other individual after refusing to leave the state capitol building after it closed to the public at 5 p.m.",
    "My guess is that once the law takes effect in July the vast majority of Indianans aren’t going to notice any changes whatsoever… unless they choose to exercise their right to bear arms.",
    "“It’s important to note that if a person is prohibited, under federal or state laws, from possessing a firearm before this law goes into effect, that person will still be prohibited.",
    "Indiana State Police Superintendent Douglas Carter, who bashed Republicans who supported the bill, also had a few things to say after Holcomb signed Constitutional Carry into law.",
    "The three had been parked outside of the governor’s office throughout the day, but around 5:30 p.m. Capitol Police told them to move on or face criminal trespassing charges.",
    "Carter released a statement after Holcomb signed the bill saying he will continue to encourage Hoosiers to apply for handgun permits, even if it’s not required.",
    "“HEA 1296, which I’ve signed today, entrusts Hoosiers who can lawfully carry a handgun to responsibly do so within our state,” Holcomb said in a statement.",
    "The right-to-carry revolution keeps rolling on, and that’s great news for those of us who are about our constitutional rights and our personal safety.",
    "A half hour to 45 minutes later, Hilbert said they were released and told they wouldn’t be charged as long as they picked up their signs and left.",
    "“I, like Governor Holcomb, feel enormous responsibility for frontline law enforcement officers,” Carter said in a statement.",
    "Ironically, the first people to end up in handcuffs as a result of Constitutional Carry were several gun control activists.",
    "Erin Murphy, a spokeswoman for Holcomb said his office did not tell Capitol Police to detain the activists.",
    "After the activists declined to leave, the cuffs came out.",
    "There was a lot of speculation about whether Indiana Gov.",
    "I’m glad to see that those concerns were unfounded.",
    "Brian Kemp and Ohio Gov.",
    "Unlike Georgia Gov.",
    "Capt."
  ]
}