{
  "id": 2224,
  "mediaId": 2745,
  "date": "2022-03-29",
  "headline": "Ohio’s high court suggests no ruling before primary on redistricting map",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ETH4TSVML4I6ZCUOTRXJ7R5A3Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/29/ohio-redistricting-court/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Instead we’ve become the laughingstock where members of the majority party care far more about their power than they do the Ohio constitution, the Ohio Supreme Court and the rights of voters to have fair districts.”\nDemocrats hoped the constitutional amendment banning partisan gerrymanders and a friendlier state Supreme Court bench would block Republicans from drawing a map heavily in their favor, like the one that has been in place for the last decade.",
    "The Ohio Supreme Court suggested on Tuesday that it will not rule on whether a Republican-drawn congressional map is legal until after the May 3 primary, devastating Democrats’ hopes that less partisan district lines in the state would help them hold on to their fragile majority in the U.S. House.",
    "The setbacks in Ohio and Florida come amid an otherwise better-than-expected redistricting for Democrats, who, through concerted efforts and their own heavy-handed mapmaking in states they control like New York and Illinois, have actually yielded more new seats than Republicans.",
    "“Because the same district boundaries must be used for both the primary and general elections, it is too late for this court to enter any order that would affect the 2022 election cycle,” state Supreme Court Justices DeWine, Sharon Kennedy and Pat Fischer wrote.",
    "Ohio was meant to be a success story for voting rights advocates, who twice found overwhelming support among voters for ballot initiatives intended to take the raw politics out of redistricting and produce maps that reflected the political makeup of the state.",
    "Florida lawmakers had been working on a bipartisan map that had broad support until DeSantis blew up the process, proposing his own map that would guarantee Republicans more seats, in part by eliminating one currently held by a Black Democrat.",
    "In one corner of the state, Republicans continued to split up Hamilton County, which contains the heavily Black city of Cincinnati, and divided the area’s minority voters into districts with more rural, majority-White and Republican voters.",
    "Unless advocates can convince the court to push back the election date, it’s likely that even if congressional district boundaries are ultimately ruled unconstitutional by the courts, they would be the lines in place for the next two years.",
    "If the congressional and other statewide primaries, like Senate and governor, remains in May, the state would have to hold two separate primary elections, hiking the multimillion dollar cost and potentially confusing Ohio voters.",
    "The new map drawn by Republicans would give their party 10 safe House seats to Democrats’ two, and another three competitive seats that Republicans would probably win if the November election is as favorable to them as expected.",
    "State Republicans late Monday night bypassed court-appointed independent mapmakers and passed their own version of its State House and senate lines, tweaked from previous iterations already ruled unconstitutional by the court.",
    "David Pepper, a former Democratic state party chairman who has been at the forefront of the redistricting battle, said he refuses to accept that the state will have to live under unconstitutional maps for the next two years.",
    "In January, the state’s highest court struck down Republicans’ first redrawing of its 15 congressional districts on grounds that it violated a constitutional amendment passed by voters in 2018 to ban partisan gerrymandering.",
    "“If it’s not constitutional it’s not legitimate … the people of Ohio deserve to have members of Congress elected in constitutional districts.”\nAdding to the chaos is a parallel fight in Ohio over the state legislative maps.",
    "The state’s congressional delegation went from 10 Democrats and eight Republicans when Barack Obama won the state in 2008 to — after a 2011 redistricting — 12 Republicans and four Democrats when Obama won it again in 2012.",
    "“Ohio was considered a poster child for reform when Democrats, Republicans and advocates came together to set forth new rules for mapping,” said Jen Miller, executive director of the League of Women Voters in Ohio.",
    "But a legal technicality restarted the clock on the congressional map case, and the court’s schedule indicated it would not have a decision until weeks after Ohioans have cast ballots in the state’s primary.",
    "Because the most recent legislative maps were ruled unconstitutional and early voting begins next week, the Ohio secretary of state chose not to include state House and Senate races on the May 3 ballot.",
    "Mike DeWine (R), wrote an opinion accompanying the decision not speed up the congressional map case before the May primary, arguing that the current map should stand for the entire 2022 election.",
    "Republicans only need to flip a handful of seats across the country this fall to take over the House and block the Biden White House’s legislative agenda for the last two years of his first term.",
    "The proportion is significantly different from how the state’s voters were divided in the 2020 presidential election, when Donald Trump won 53 percent of the vote to Joe Biden’s 45 percent.",
    "“Having 15 politicians go to Congress on a map everyone knows is unconstitutional is truly lawless and we should not casually accept that,” Pepper said.",
    "Democrats in the state have accused Republicans of intentionally running out the clock to leave no time for the courts to rule on new maps.",
    "Republicans submitted a new, minimally altered map in early March that Democrats and voting rights groups complained was no better.",
    "The National Democratic Redistricting Committee has filed a lawsuit in the state asking the courts to take over the process.",
    "For the past decade, the county, which voted for President Biden, was represented by two conservative Republicans.",
    "The Ohio Supreme Court considered holding Republicans in contempt for dragging out the state legislative maps.",
    "Ron DeSantis (R) on Tuesday vetoed congressional maps drawn by the state Republican-led legislature.",
    "Democrats are also waiting to see how they’ll fare in Florida, where Gov.",
    "Three Republican judges, including Patrick DeWine, the son of Ohio Gov.",
    "Advocates said they may call on the court to reopen those charges.",
    "Primaries for those races will occur on a to-be-determined date.",
    "Not a single seat has flipped since."
  ]
}