{
  "id": 2283,
  "mediaId": 2790,
  "date": "2022-03-25",
  "headline": "California's governor is proposing $11 billion of relief from record gas prices",
  "image": "https://media.npr.org/assets/img/2022/03/24/gettyimages-13549544721_wide-12ac434426f4fd7803130d733a9d2e0582aa0ced.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/25/1088711551/california-gas-prices-gas-taxes-holiday-record",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ayana Archie",
  "authorUrl": "https://www.npr.org/people/1086018718/ayana-archie",
  "termIds": [
    1688,
    2856,
    3709,
    4887,
    4984
  ],
  "sentences": [
    "Several other states want to cut gas prices\nElected officials in more than 20 states have proposed gas tax holidays of anywhere from one month to two years, which, depending on how high their state gas tax is, could save consumers 25 to 50 cents a gallon, or more.",
    "As of Wednesday, Newsom planned to meet with the state legislature \"in coming days,\" and if the bill is approved, California drivers could begin receiving payments, in the form of debit cards, as soon as July, the statement said.",
    "\"Florida cannot independently fix or outrun all of the problems leading to the cost increases that are wreaking havoc on families, especially our most vulnerable,\" said Senate President Wilton Simpson, a Republican.",
    "Also included in the proposed package is $750 million to give Californians free rides on public transit for three months, and $500 million to greenlight transportation projects that encourage walking and biking.",
    "\"We're taking immediate action to get money directly into the pockets of Californians who are facing higher gas prices as a direct result of Putin's invasion of Ukraine,\" Newsom's office said in a statement.",
    "Senators, led by Maggie Hassan of New Hampshire, Mark Kelly of Arizona, and Raphael Warnock of Georgia, are calling for a temporary suspension of the 18.4 cents per gallon federal gas tax, as well.",
    "\"Under the leadership of Governor Kemp and the General Assembly, the state of Georgia is proactively working to ease the burden Georgia taxpayers are feeling at the pump,\" the state's website says.",
    "Gavin Newsom revealed an $11 billion proposal Wednesday that would give residents a $400 rebate for each car, but no more than two, as well as suspend a fraction of the gas tax for one year.",
    "\"This body has the opportunity to save Georgians near $157 million each month at the pump,\" said Republican state rep. Jodi Lott, in urging her colleagues to support the measure.",
    "\"The Comptroller's office will issue refunds to these retail and wholesale sellers on the tax they have already paid for the 30-day tax holiday,\" the state's website says.",
    "There is no income cap on the proposal, and eligibility will be \"based on vehicle registration, not tax records,\" the governor's office said.",
    "The price of gas hit a record high earlier this month due to the Ukraine-Russia conflict, with the current national average at $4.24.",
    "Brian Kemp signed a bill last Friday to suspend the state's gas taxes, which are 28.7 cents a gallon, from March 18 to May 31.",
    "\"We need this money to keep our roads going, and repair our roads and make our roads safer,\" DeWine told reporters recently.",
    "According to AAA data, gas is currently $3.99 on average in Georgia, down from $4.24 a week ago, when the bill was signed.",
    "\"However, we are working to ease the pain with broad-based sales tax relief and a month-long gas tax holiday.\"",
    "In Maryland, the gasoline tax is 36.1 cents per gallon for gasoline and 36.9 cents per gallon for diesel fuel.",
    "A previous version of this story incorrectly said the Maryland gas tax holiday went from May 18 to April 16.",
    "Virginia is exploring the idea of a three-month holiday, though Democrats there are less warm to the idea.",
    "Larry Hogan signed a bill last Friday that effective immediately, will suspend gas taxes for 30 days.",
    "Now, California has joined several other states in looking for ways to cut their residents a break.",
    "Ohio's Republican governor Mike DeWine is opposing a partial repeal of his state's gas tax.",
    "Gasoline taxes are taxes paid by gas stations when they purchase fuel from wholesalers.",
    "The Florida Senate is also proposing a gas tax holiday from Oct. 1 to 31 of this year.",
    "The bill suspends the gas tax for car and plane fuel, natural gas and propane gas.",
    "The average Californian spends $300 on gasoline taxes a year, the state said.",
    "The state's price per gallon dropped 41 cents since the bill's signature.",
    "Here's what relief other states are offering:\nGeorgia\nGeorgia Gov.",
    "In Los Angeles, prices have climbed to $6, according to AAA.",
    "\"The sellers will be passing those savings along to you.\"",
    "A portion of them is typically passed onto consumers.",
    "Gas was $2.87 this time last year, according to AAA.",
    "The holiday will run from March 18 to April 16.",
    "It does not exclude local taxes on gasoline.",
    "Though, not all politicians are on board.",
    "\"So it would just be a mistake to that.\"",
    "It goes from March 18 to April 16.",
    "Several Democratic U.S.",
    "It passed unanimously.",
    "Maryland\nMaryland Gov.",
    "California Gov."
  ]
}