{
  "id": 2345,
  "mediaId": 3993,
  "date": "2022-03-19",
  "headline": "DeWine should put Dems on defense on Constitutional Carry",
  "image": "https://media.townhall.com/townhall/reu/o/2018/274/49b62666-9322-4857-9d20-d686ab370014-1110x740.jpg",
  "link": "https://bearingarms.com/camedwards/2022/03/19/dewine-should-put-dems-on-defense-on-constitutional-carry-n56585",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    1688,
    2070,
    2201,
    2681,
    3975,
    4588,
    305,
    5212
  ],
  "sentences": [
    "Longtime political analyst Howard Wilkinson, for instance, recently argued that Democratic candidates like Dayton Mayor Nan Whaley and former Cincinannti mayor John Cranley are already bashing DeWine over the issue, and they’ll likely continue to use it as a campaign cudgel for the foreseeable future.",
    "The 2020 election was actually closer in Texas than it was in Ohio, and voters this year get to choose between the incumbent governor who signed Constitutional Carry into law and the former congressman and failed presidential candidate who wants to ban so-called assault weapons.",
    "He should talk about it for what it is; a law that is both pro-Second Amendment and a legitimate criminal justice reform that will not get in the way of targeted and effective policing strategies and desperately needed repairs to our dysfunctional criminal justice system.",
    "Make his opponent explain why people should become criminals for bearing arms without first getting the blessing of their county sheriff, and help voters understand why Constitutional Carry, which applies only to legal gun owners, doesn’t aid violent criminals.",
    "Because to me, it looks a lot more like creating a crime out of a constitutional right (If I were on DeWine’s campaign team, I’d dispatch a couple of interns to gather the figures in Ohio cities like Dayton, Cleveland, Columbus, Toledo, and Cincinnati as well).",
    "We need to bolster witness protection services, hire more prosecutors and more public defenders, and start to fix a broken criminal justice system with more than a legislative band aid or another gun control law.",
    "And given that Ohio is already an open carry state, the question is really should it be a criminal offense to carry a legally owned gun that no one can see without first obtaining a government permission slip?",
    "We need to have meaningful efforts to keep kids out of gangs and away from dealing drugs; two paths that dramatically increase the likelihood of becoming the victim or perpetrator of violence.",
    "Mike DeWine made a colossal mistake by signing Constitutional Carry into law this week, given that Democrats are bound to pummel him for relaxing gun laws at a time of rising violence in Ohio.",
    "Wilkinson’s analysis is more wishcasting than forecasting, and he’s telling us what he wants to see happen rather than what will likely happen based on the mood of the electorate.",
    "While Ohio may have historically been seen as a swing state, in recent years its trended red, with Donald Trump winning the state by eight points over Joe Biden, 53-45.",
    "If they plan to carry the party’s banner in the fall campaign for governor, they are going to need to make themselves known to Ohio voters of all political stripes.",
    "A recent poll showed that two-thirds of Ohio’s Democratic primary voters don’t know enough about Whaley or Cranley to form an opinion or choose between them.",
    "That’s not particularly close, and this year is expected to be a much better political environment for Republicans, which should give DeWine an extra boost.",
    "There’s also not a lot of evidence that support for Constitutional Carry specifically would endanger DeWine’s political fortunes in any way.",
    "The only thing he gets right is that whoever ends up as the Democratic candidate, they’ll try to use Constitutional Carry to destroy DeWine.",
    "Should it really be a criminal offense to carry a gun without a permission slip from the government if you can legally own that firearm?",
    "Does Nan Whaley think that putting people in jail for carrying a gun without a permission slip is really a good way to fight crime?",
    "The only charge the defendants are facing is carrying without a license, and 70% of those charged are legal gun owners.",
    "We need to increase police resources, and put programs like Operation Cease Fire into place in our major cities.",
    "Some have argued that Mike DeWine was between a rock and a hard place when Senate Bill 215 landed on his desk.",
    "I don’t think it’ll work, but I also know that DeWine could easily go on offense on Constitutional Carry.",
    "We need to focus on violent offenders instead of creating paperwork criminals.",
    "Nearly one third of the DA’s cases in Wayne County are concealed carry cases.",
    "Mike DeWine shouldn’t run away from his signing of Constitutional Carry.",
    "And now we wait to see if there is a political price to be paid for it.",
    "Does John Cranley think that’s really an effective way to fight crime?",
    "The liberal political prognosticators in Ohio are convinced that Gov.",
    "How’s that working out for Robert Francis “Beto” O’Rourke so far?",
    "Nobody cares how uncomfortable this made the governor feel.",
    "Let’s talk about what’s going on in cities like Detroit.",
    "Here’s what this looks like in practice.",
    "But that’s his problem, not the voters’.",
    "97% of them, by the way, are black.",
    "Should people go to jail for that?",
    "This issue will help them do that.",
    "Will there be a political price?",
    "He did what he did.",
    "He owns it.",
    "Really?"
  ]
}