{
  "id": 2435,
  "mediaId": 2677,
  "date": "2022-03-20",
  "headline": "GOP governor debate in Ohio off after DeWine, rival drop out",
  "image": "https://www.mercurynews.com/wp-content/uploads/2020/08/sjm-utbreak-Ohio-Governor_75593112-1.jpg?w=1024&h=683",
  "link": "https://www.mercurynews.com/2022/03/20/gop-governor-debate-in-ohio-off-after-dewine-rival-drop-out-2/",
  "mediaOutlet": "San Jose Mercury News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.mercurynews.com/author/associated-press/",
  "termIds": [
    1556,
    1673,
    1688,
    878,
    1036,
    4916,
    5212,
    5383
  ],
  "sentences": [
    "He said the former congressman and Wadsworth mayor is “behind, bigly” and “can’t win, no matter how much $ he throws at it.”\nRenacci’s campaign accused Blystone of leveling “false and libelous” attacks against him.",
    "“Jim will show up on any stage that the governor is on to discuss any issue.”\nDeWine campaign manager Brenton Temple said at the time of DeWine’s decision last week that the governor is always publicly accessible.",
    "The Cincinnati Enquirer reported Thursday that former U.S. Rep. Jim Renacci opted out of nonpartisan Ohio Debate Commission event, which had been scheduled for March 29.",
    "The two Democratic candidates for governor, former Dayton Mayor Nan Whaley and ex-Cincinnati Mayor John Cranley, are still scheduled to debate March 29.",
    "“There is no such thing as a gubernatorial debate without the governor,” Renacci campaign spokesperson Tom Weyand said.",
    "A third candidate, Republican Ron Hood, never returned organizers’ phone calls, the newspaper reported.",
    "COLUMBUS, Ohio (AP) — A debate among Republicans running for Ohio governor is off, after GOP Ohio Gov.",
    "He said DeWine meets with constituents daily and regularly fields questions from the media.",
    "Mike DeWine declined to participate and another candidate decided to follow suit.",
    "That would have left central Ohio farmer Joe Blystone alone on the stage.",
    "On Twitter Thursday, Blystone called on Renacci to drop out."
  ]
}