{
  "id": 2534,
  "mediaId": 2728,
  "date": "2022-03-24",
  "headline": "Campaigns weigh strategy options if Ohio primary is delayed",
  "image": "https://images.thestar.com/x9pm0NPrAe-c2M_36mtrp4uHjps=/1280x1024/smart/filters:cb(1648228966020)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/03/24/campaigns-weigh-strategy-options-if-ohio-primary-is-delayed/20220324170340-623ce5d4a7430ba486a900e9jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/03/24/campaigns-weigh-strategy-options-if-ohio-primary-is-delayed.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julie Carr Smyth And Jill Colvin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "”I am usually opposed to moving primaries, but this involves taxpayer money, and the only people benefiting from two primaries are incumbents who want to get the election over with, and burden Ohio taxpayers with the cost.”\nIn the contentious GOP primary for U.S. Senate, some of the wealthier candidates funding their own campaigns would seem to have an advantage over the candidates who rely on traditional fundraising if the primary were to be moved back.",
    "“Everything from booking millions of dollars in television to dropping direct mail to booking event venues could be instantaneously impacted by a shifting primary date, and the campaigns that have the resources that beget versatility and flexibility naturally will have an advantage in the duration of the contest,” said Chris Maloney, a Dolan strategist.",
    "Morgan Harper, who is challenging U.S. Rep. Tim Ryan for the Democratic nomination for U.S. Senate, called the Legislature’s unwillingness to reschedule the primary “deeply irresponsible.” She said the state should not hold split primaries, which, by some estimates, would cost taxpayers an additional $20 million.",
    "COLUMBUS, Ohio (AP) — After months of buildup, Ohio’s primary in May was supposed to usher in a busier phase of the political season, when voters would begin lining up behind party winners in fall races for control of Congress, governor’s seats and key elections offices across the United States.",
    "“Having one primary in August will give the court time to sort through the redistricting mess, military ballots can go out on time, and taxpayers won’t have to pay the extra $20 million or $30 million for primaries in both May and August,“ Renacci said in a statement.",
    "“It would be confusing to the voters and wasteful for taxpayers otherwise.”\nHarper said “the lack of a firm date has confused voters and volunteers, and it has implications for every aspect of the campaign from field to fundraising.”\n___\nColvin reported from New York.",
    "If the primary does end up delayed, candidates competing for governor, U.S. Senate and other statewide offices may have to shift their strategies for fundraising, advertising and voter outreach just as they thought they were nearing the end of the primary campaign.",
    "For now, several aides said the campaigns are operating as though the primary will be held on May 3 — with those trailing hoping they have enough time to catch up to the front-runners whether the race happens in six weeks or five months or six months from now.",
    "That push-pull may have played a role in the Legislature’s defiant refusal to move the primary date, as only it — or a court — can do, leaving the state elections chief to order continual adjustments to primary preparations required under the law.",
    "We’re going to run 50 miles instead.’ It’s a pretty big adjustment.”\nThe political and legal squabbling is a result of the once-per-decade redistricting process that all states must undertake to reflect population changes recorded in the census.",
    "A delay would give Trump, who has remained on the sidelines of the race despite being desperately courted by a handful of candidates, additional time to make a decision that could fundamentally alter the race.",
    "So financially well-off donors often have given the maximum allowable contribution to their favored candidate by this point in the primary cycle, Stubenrauch said, with the idea of giving again on May 4.",
    "Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan, whose family owns baseball’s Cleveland Guardians, are using their considerable personal fortunes to finance their Senate campaigns.",
    "A change would let other states, including Pennsylvania and Georgia, take the lead in showing the types of candidates voters in both parties choose to advance to the general election in November.",
    "A three-judge panel of the U.S. District Court for the Southern District of Ohio heard arguments Friday on whether changes should be made to the primary schedule, but delayed a decision for now.",
    "There’s even a chance the election could be split onto two dates, with one focusing on statewide races and the other on the Statehouse and congressional contests tied up in the mapmaking fight.",
    "The state awaits another high court ruling on the fate of its congressional districts after the commission’s second attempt at a constitutional map was again challenged as partisan.",
    "But in ruling after ruling, the Ohio Supreme Court has found that maps by the GOP-dominated Ohio Redistricting Commission were unconstitutionally drawn to unduly favor Republicans.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "“It is a huge factor,” David McIntosh, president of the Club for Growth, which is backing Mandel with significant spending, said of Trump’s endorsement.",
    "The commission has enlisted two new unanimously chosen mapmakers to help break the logjam as it faces a Monday deadline to fix the legislative maps.",
    "A series of court rulings invalidating Republican-drawn redistricting maps has threatened to delay the state's May 3 primary by a month or more.",
    "Front-runners generally want the primary to happen while they’re in the lead; underdogs tend to want more time to make their case to voters.",
    "A series of court rulings invalidating Republican-drawn redistricting maps is threatening to delay the May 3 primary by a month or more.",
    "Ohio's scheduled primary election is just six weeks away, but candidates still don't know whether the voting contest will happen then.",
    "Most states have finalized their political maps, and Ohio’s redistricting process was intended to be completed last fall.",
    "Millionaire candidates, like some in the Senate race, can put as much of their own money into federal races as they want.",
    "State and federal campaign finance laws limit the amount an individual donor can contribute during each election cycle.",
    "Other people, including at least one Republican candidate, have suggested pushing the date as far out as August.",
    "Behind the scenes, campaigns and party leaders are juggling the sometimes-competing interests of the candidates.",
    "Rob Portman, a Republican, is seen as a test of former President Donald Trump’s clout in reshaping the party.",
    "On Thursday, the Ohio Supreme Court denied a request from state Democrats to delay the primary to June 28.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Ohio’s primary date gave the state one of the earliest voting contests in this year’s midterm elections.",
    "Instead, the campaign season in Ohio has drifted into something close to a state of suspended animation.",
    "Former state GOP chair Jane Timken, ex-Ohio Treasurer Josh Mandel and “Hillbilly Elegy” author J.D.",
    "“Running a campaign is like running a marathon,” said Ohio Republican consultant Ryan Stubenrauch.",
    "Former U.S. Rep. Jim Renacci, one of two primary challengers trailing Republican Gov.",
    "Mike DeWine in polls, has come out in favor of delaying the primary for months.",
    "“If one set of primaries moves, they should all move,” she said in a statement.",
    "A bowl of stickers is set out for voter March 15, 2020, in Steubenville, Ohio.",
    "It’s like halfway through they say, ‘We’re not going to run 26 miles.",
    "The primary is one such cycle, the general election another.",
    "Ohio’s contest to replace retiring U.S. Sen.",
    "The Star does not endorse these opinions.",
    "“They thought the finish line was May 3.",
    "Vance are relying on money from donors.",
    "A delay isn’t inevitable."
  ]
}