{
  "id": 2579,
  "mediaId": 6526,
  "date": "2022-03-26",
  "headline": "Pennsylvania Gov. Wolf ranks near bottom on ‘economic freedom’ scorecard; Republicans dominate top of list",
  "image": "https://www.mcall.com/resizer/6YsmWK4ucW5CnzeTNRlvu7-9jsw=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/3UKZSD255NIBY5E2QYPGTAGO64.jpg",
  "link": "https://www.mcall.com/news/pennsylvania/mc-nws-pa-wolf-bottom-20220326-xqbhoktmmna7dbquoxcbxi5tke-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anthony Hennen",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Laffer-ALEC Report on Economic Freedom, published by the American Legislative Exchange Council, grades every governor “on their current economic performance and their fiscal and executive policies over their term in office.”\nThe report focuses on economic performance, executive policies, and fiscal policy, considering measures such as education freedom, interstate migration, unemployment rate, and debt.",
    "“In most cases, state metrics are indexed to national averages to account for trends in U.S. performance, policies are recorded as those proposed by the governors themselves, and changes in performance and policy are only measured over the governors’ individual terms,” the report notes.",
    "With neighboring states, Wolf only beat out Phil Murphy of New Jersey and Andrew Cuomo of New York (45th and 46th, respectively), but placed behind John Carney of Delaware (38th), Larry Hogan of Maryland (35th), Jim Justice of West Virginia (33rd), and Mike DeWine of Ohio (32nd).",
    "While state governors don’t control all state policy and can do more or less depending on whether their political party controls the legislature as well, the report tries to adjust accordingly.",
    "Since Wolf’s inauguration in 2015, Pennsylvania’s spending as a percentage of gross state product has steadily increased, from about 10% to about 12%; previously, it had been declining.",
    "The top five governors in the report were Kristi Noem of South Dakota, Spencer Cox of Utah, Ron DeSantis of Florida, Jared Polis of Colorado, and Brad Little of Idaho.",
    "A new report on America’s governors and their commitment to economic freedom scored Pennsylvania Gov.",
    "Wolf’s strongest ranking was for executive policy, where the report placed him at 40th.",
    "Wolf, a second-term Democrat, was ranked in the “one-star governors” section at 43rd.",
    "Four are Republicans, while Polis is the highest-ranking Democrat in the report.",
    "Economic performance came in at 42nd, and fiscal policy came in at 43rd.",
    "The Senate and House in Pennsylvania are led by Republicans.",
    "Tom Wolf near the bottom of the pack."
  ]
}