{
  "id": 258,
  "mediaId": 2688,
  "date": "2022-04-14",
  "headline": "Ohio Supreme Court Strikes Down GOP Legislative Maps For A *Fourth* Time. Will It Matter?",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1058491828-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/ohio-supreme-court-strikes-down-gop-legislative-maps-for-a-fourth-time-will-it-matter?utm_source=rss&utm_medium=rss&utm_campaign=ohio-supreme-court-strikes-down-gop-legislative-maps-for-a-fourth-time-will-it-matter",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt_shuham",
  "termIds": [
    1330,
    1688,
    305,
    878,
    994,
    996,
    5212
  ],
  "sentences": [
    "But on Thursday, the state Supreme Court noted that other states have primaries after August 2, and called the April 20 date an apparently “artificial deadline.”\n“Any suggestion that the federal court could – much less that it should – set an August 2 primary election date as a remedy in the federal-court litigation strikes us as a dubious proposition at best,” the majority wrote.",
    "Ohio Republicans, after all, are playing a delay game: Their gerrymandered congressional maps, though still under a legal challenge, are nonetheless being used for the upcoming congressional primaries because the state Supreme Court set the schedule for that challenge after those primaries take place.",
    "“As before, the commission did not adopt a plan using a process that Article XI [of the Ohio Constitution] and this court’s prior decisions require,” the court’s majority opinion read, referring to the Ohio Redistricting Commission, which includes high-profile pols like Gov.",
    "“Principles of federalism and comity cut against a federal court ordering the date of a primary election for purely state offices due to a dispute over the validity of state legislative maps under the state constitution,” the opinion added.",
    "If they come up with a constitutional map in time, Ohioans may not have to deal with the prospect of a federal court swooping in and taking over the redistricting process, potentially resulting in a map slanted in Republicans’ favor.",
    "“These facts indicate beyond a reasonable doubt an intent to favor the Republican Party at the expense of the Democratic Party in the commission’s fourth try at drafting the General Assembly–district plan,” the court’s majority said.",
    "By now, you may know the story: The Ohio Supreme Court, with three Democrats and its Republican chief justice making up a majority, has rejected a proposed state legislative map drawn by the GOP-dominated redistricting commission.",
    "The fourth attempt at drawing state legislative maps was supposed to be different: Prompted by a suggestion from the court, the commission hired two independent mapmakers and let them draft a proposal on a live-streamed webcast.",
    "That federal court has punted a decision on getting involved until April 20, based on claims from LaRose’s office that this is the deadline to decide on maps in order to hold a primary election by August 2.",
    "But then, on the last day before the Supreme Court’s deadline, Republicans voted to support a “parachute” plan, rather than the bipartisan mapmakers’ proposal, purportedly because of deadline pressure.",
    "The maps, the court’s unamused majority said, were unconstitutionally slanted in Republicans’ favor, violating amendments supported by the vast majority of Ohioans against partisan gerrymandering.",
    "They even went so far as to suggest that the independent mapmakers’ proposal be the “starting point for the next plan,” given that it was superior to the Republican submission on several measures.",
    "Republican activists have asked a federal court to take over the state redistricting process, in an attempt to use one of the GOP-friendly maps already rejected by the state Supreme Court.",
    "Republican staffers drew up the proposal that was finally submitted — which, in actuality, was just a slightly modified version of the previously-rejected third proposal.",
    "Unlike the congressional race, Secretary of State LaRose has already instructed county clerks to remove the state legislative races from the upcoming primary ballots.",
    "What’s more, the court’s majority said, the latest map was “materially identical” to the previous rejected one, and fell short on the same measures.",
    "Importantly, the court rejected challengers’ request that members of the commission be held in contempt for failing to draw a constitutional map.",
    "The races will be voted on at a later date — and that date has become a key open question in the redistricting fight.",
    "The court gave the commission until the morning of May 6 to file their next proposal.",
    "But given the redistricting commission’s behavior so far, that’s no safe bet.",
    "Mike DeWine (R) and Secretary of State Frank LaRose (R), pictured above.",
    "As before, the court ordered the redistricting commission to try again.",
    "For now, at least, the ball is in the redistricting commission’s court.",
    "That’s what happened Thursday — for the fourth time.",
    "But What Can The Ohio Supreme Court Do About It?",
    "But… what if the same thing happens?"
  ]
}