{
  "id": 2593,
  "mediaId": 2745,
  "date": "2022-03-23",
  "headline": "Opinion: The Ohio Republican Party is in absolute chaos",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YCZ6P4FHFQI6ZBRIHWSPVD4HCQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/03/23/ohio-republican-primary-soap-opera/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "His most formidable opponent on paper, former congressman James B. Renacci, has touted himself as a pro-Trump conservative while painting DeWine as soft on illegal immigration, a supporter of higher gas taxes and someone who doesn’t stand with Trump.",
    "The delayed maps will almost assuredly force the primary — scheduled for May 3 — to be postponed, causing more headaches for election officials and upending campaigns that meticulously tailor spending and messaging around a specific end date.",
    "If not for all those distractions, what might be top of mind for Republicans are racketeering charges pending against former Ohio House speaker Larry Householder (R) related to an alleged $61 million bribery and money-laundering arrangement.",
    "Lately overtaking both Mandel and Vance is wealthy businessman Mike Gibbons, another “Can you Trump this?” candidate who — fittingly, in today’s professional wrestling atmosphere — went nose-to-nose with Mandel at a recent debate.",
    "A Republican-led redistricting process is repeatedly shot down by the Republican chief justice of the state supreme court — leading to impeachment threats from GOP lawmakers and the likely rescheduling of the primary.",
    "Three Republicans on the seven-member state supreme court have routinely approved the maps, but Chief Justice Maureen O’Connor — also a Republican — has consistently joined the court’s three Democrats to reject them.",
    "Instead, Vance — after regularly dissing Donald Trump — shockingly turned himself into a Trump sycophant, competing with Josh Mandel, a former state treasurer, to say the most ridiculously Trumpian things.",
    "He criticized President Biden’s vaccine mandate, and recently signed a bill no longer requiring a license to carry a concealed handgun, along with a “born alive” bill favored by his pro-life constituency.",
    "Looking on with other candidates was former state GOP chair Jane Timken, who has Portman’s support and probably the right measure of Trumpiness without the wide-eyed zealot factor to win in November.",
    "Vance’s book offered a nuanced look at the cultural and economic forces in Appalachia and the Rust Belt, so there were expectations that its author, as a candidate, might exhibit similar wisdom.",
    "Aside from Renacci, his opponents include former state representative Ron Hood and farmer Joe Blystone, whose aggressive grass-roots campaign has placed him second in the polls.",
    "Watching from the wings as the craziness unfolds is the likely Democratic nominee, Rep. Tim Ryan, who faces Morgan Harper, Traci Johnson and LaShondra Tinsley in the primary.",
    "The measures made DeWine a national media darling, but local pushback and protests led to the resignation of his health director and calls to challenge him in the primary.",
    "DeWine was recently endorsed by the state Republican party, but not without significant opposition, and at least two county parties have broken ranks to endorse Renacci.",
    "Also present was Matt Dolan, a Republican state senator with deep pockets, who has distanced himself from former president Trump and, by extension, from Trump voters.",
    "Voters previously approved new, supposedly less partisan state and congressional redistricting standards, but Republicans still control the map-drawing committees.",
    "And the pending trial of the former Republican state House speaker on racketeering charges is being called the biggest corruption scandal in state history.",
    "That has angered Republicans legislators, some of whom are reportedly considering impeachment proceedings against O’Connor.",
    "Republican candidates in a Senate primary are competing with World Wrestling Entertainment for most outrageous behavior.",
    "He seemed determined that no governor would outdo him in implementing lockdowns, mask mandates and other restrictions.",
    "For Ohio Republicans facing more immediate challenges, that’s a lifetime away — with many more soap operas in between.",
    "Meanwhile, the process of drawing new state legislative and congressional districts has provided even more drama.",
    "Whoever emerges will face a former Democratic mayor, either Nan Whaley of Dayton or John Cranley of Cincinnati.",
    "Timken’s ads feature Trump saying nice things about her at past rallies, but Trump has not yet endorsed anyone.",
    "DeWine earned the ire of many conservatives over his handling of the coronavirus when it first emerged in 2020.",
    "If anti-DeWine Republicans fail to coalesce around one candidate, DeWine can win with just a plurality.",
    "An incumbent Republican governor faces a rebellion and primary opposition from within his ranks.",
    "But DeWine still maintains a healthy polling and cash advantage over his GOP challengers.",
    "Gaining the most national scrutiny is the competition to replace retiring Sen.",
    "(Rounding out the crowded field are Neil Patel, Mark Pukita and Bill Graham.)",
    "Frequently lost in the noise of the Senate race is the reelection bid of Gov.",
    "To shore up his flank, DeWine has romanced the right more aggressively.",
    "That’s a quick summary of the current political landscape in Ohio.",
    "The presence in the field of “Hillbilly Elegy” author J.D.",
    "No, that’s not a news roundup from across the country.",
    "The fallout could embarrass a lot of Republicans.",
    "But that trial won’t start until January.",
    "Both Timken and Dolan trail in the polls.",
    "Vance drew early attention to the race.",
    "Householder has denied the charges.",
    "Rob Portman (R).",
    "Mike DeWine (R)."
  ]
}