{
  "id": 2771,
  "mediaId": 2526,
  "date": "2022-03-14",
  "headline": "Ohio Becomes 23rd Constitutional Carry State",
  "image": "https://media.breitbart.com/media/2022/03/GettyImages-1058491056-640x335.png",
  "link": "https://www.breitbart.com/politics/2022/03/14/ohio-becomes-23rd-constitutional-carry-state/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AWR Hawkins",
  "authorUrl": "https://www.breitbart.com/author/awr-hawkins/",
  "termIds": [
    1688,
    685,
    4814,
    5157,
    5159,
    5161,
    5212,
    5348,
    5379
  ],
  "sentences": [
    "@MikeDeWine for signing this important piece of legislation that protects the Second Amendment rights of all law-abiding Buckeyes.” –NRA-ILA Executive Director Jason Ouimet pic.twitter.com/Y7QGnQKozL\n— NRA-ILA (@NRAILA) March 14, 2022\nBreitbart News pointed out that Hamilton County, Ohio, Sheriff Charmaine McGuffey opposed changing Ohio’s law so as to allow law-abiding citizens to exercise their right to bear arms without government permission.",
    "The other 22 are: Alabama, Alaska, Arizona, Arkansas, Idaho, Iowa, Kansas, Kentucky, Maine, Mississippi, Missouri, Montana, New Hampshire, North Dakota, Oklahoma, South Dakota, Tennessee, Texas, Utah, Vermont, West Virginia, and Wyoming.",
    "AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News.",
    "Today, March 14, 2022, the NRA-ILA tweeted out news of DeWine’s signature just after he signed the constitutional carry legislation:\n“The @NRA commends Gov.",
    "At that time, constitutional carry legislation had passed the Ohio legislature but had not yet been signed by DeWine.",
    "On March 10, 2022, Breitbart News reported that Alabama became the 22nd constitutional carry state when Gov.",
    "Mike DeWine (R) signed legislation Monday making Ohio the 23rd constitutional carry state in the Union.",
    "He is the political analyst for Armed American Radio and a Turning Point USA Ambassador.",
    "Kay Ivey (R) signed legislation ending the concealed carry permit requirement.",
    "You can sign up to get Down Range at breitbart.com/downrange.",
    "Follow him on Instagram: @awr_hawkins.",
    "Reach him at awrhawkins@breitbart.com.",
    "Gov."
  ]
}