{
  "id": 2789,
  "mediaId": 2526,
  "date": "2022-03-10",
  "headline": "Alabama Becomes 22nd Constitutional Carry State",
  "image": "https://media.breitbart.com/media/2022/03/Glock-Handgun-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/10/alabama-becomes-22nd-constitutional-carry-state/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AWR Hawkins",
  "authorUrl": "https://www.breitbart.com/author/awr-hawkins/",
  "termIds": [
    1696,
    685,
    4814,
    4830,
    4831,
    5037,
    5157,
    5348,
    5351
  ],
  "sentences": [
    "I have always stood up for the rights of law abiding gunowners, and I am proud to do that again today.”\nThere are 21 other constitutional carry states in the Union: Alaska, Arizona, Arkansas, Idaho, Iowa, Kansas, Kentucky, Maine, Mississippi, Missouri, Montana, New Hampshire, North Dakota, Oklahoma, South Dakota, Tennessee, Texas, Utah, Vermont, West Virginia, and Wyoming.",
    "Ivey signed the legislation shortly after it passed the legislature, and issued a statement saying, “Unlike states who are doing everything in their power to make it harder for law abiding citizens, Alabama is reaffirming our commitment to defending our Second Amendment rights.",
    "AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News.",
    "Kay Ivey (R) signed House Bill 272 on Thursday, making Alabama the 22nd constitutional carry state in the Union.",
    "?BREAKING NEWS: Alabama House & Senate PASSED NRA-Backed Constitutional Carry, Headed to Gov.",
    "He is the political analyst for Armed American Radio and a Turning Point USA Ambassador.",
    "Constitutional carry legislation currently sits on the desks of Indiana Gov.",
    "The NRA tweeted that HB272 cleared Alabama’s legislature Thursday afternoon.",
    "You can sign up to get Down Range at breitbart.com/downrange.",
    "Follow him on Instagram: @awr_hawkins.",
    "Reach him at awrhawkins@breitbart.com.",
    "Ivey’s Desk\nOne more step until…\n?",
    "Eric Holcomb (R) and Ohio Gov.",
    "?NO GOVERNMENT PERMISSION!??",
    "Mike DeWine (R).",
    "Gov.",
    "Gov."
  ]
}