{
  "id": 2793,
  "mediaId": 2664,
  "date": "2022-03-18",
  "headline": "Ohio Republicans discussing impeachment of state's chief justice after redistricting map ruling",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29559588&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/ohio-republicans-discussing-impeachment-of-state-s-chief-justice-after-map-ruling/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.rawstory.com/u/jakezuckerman-ohiocapitoljournal",
  "termIds": [
    1330,
    2285,
    4445,
    4676,
    878,
    4906,
    5071,
    5212
  ],
  "sentences": [
    "“To accuse a judge of deciding the matter before him on partisan politics and further accuse the judge of ‘obstruction of his judicial responsibility’ is without merit and is meant to further the false narrative that judges have no conscience, no legal responsibilities, and no capacity to decide what the law is beyond the raw politics of the issue.”\nAn impeachment would be an extreme, though not unprecedented reaction.",
    "Through a spokesman, Seitz, a longtime Cincinnati lawmaker and influential caucus member, declined to comment on caucus discussions but said Friday “nothing has been decided, and that all options are on the table.”\nCross, a Kenton Republican, declined comment, noting “we (I) don’t comment about caucus meetings.”\nThe call, held Thursday afternoon, lasted about 20 minutes, the source on the call said.",
    "The Ohio Republican Party, with the 2020 presidential election looming, blasted a lower court’s ruling on election procedures and Franklin County Common Pleas Judge Richard Frye as a “partisan judge.” In an unusual move, O’Connor called the statement “disgraceful” and “deceitful” and emphasized the concept of judicial independence.",
    "O’Connor, also a Republican, has acted as a swing vote on two high-stakes redistricting cases and sided with Democrats on the bench finding the maps disproportionately favored Republicans in violation of the Ohio Constitution.",
    "Also Thursday, Rep. Scott Wiggam, R-Wooster, a committee chairman, said on social media “it’s time to impeach Maureen O’Connor now.”\nThe hubbub comes in response to the court’s redistricting ruling late Wednesday evening.",
    "A ranking House Republican left open the possibility of impeaching the chief justice of the Ohio Supreme Court, which this week rejected Republicans’ third proposed legislative redistricting map.",
    "During a private GOP caucus phone call Thursday, House Majority Leader Bill Seitz and Rep. Jon Cross voiced support for impeaching Justice Maureen O’Connor, according to a person on the call.",
    "NOW WATCH: Missouri Republican faces backlash after grilling 14-year-old trans girl about getting ‘the procedure’\nMissouri Republican faces backlash after grilling 14-year-old trans teen",
    "On Facebook Thursday, hours before the caucus call, Cross wrote “enough is enough,” and that O’Connor had violated Ohio law related to altering the time, place or manner of an election.",
    "A four-justice majority found “beyond a reasonable doubt” that the most recent maps violated the constitution, particularly the provisions prohibiting partisan favoritism.",
    "While uncertainty remains, the ruling could force lawmakers to either move the May primary election date or create a second primary election date for non-statewide races.",
    "“I think we don’t want to go down that pathway, because we disagree with a decision by a court, because we disagree with a decision by an individual judge or justice.",
    "The Supreme Court is currently reviewing a second, GOP-proposed congressional redistricting map after overturning the first effort on constitutional grounds.",
    "When Cross offered what was described as a more fiery argument for impeachment, House Speaker Bob Cupp, R-Lima, ended the call, according to the source.",
    "Ohio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "In it, Seitz presented an argument that included old precedent for the House moving to impeach a justice after an unfavorable court decision.",
    "For instance, in 1808, members of the Ohio House grew angry enough at a ruling by Justice George Tod that they sought his impeachment.",
    "Not a good idea.”\nThree House Republicans publicly floated the concept of impeaching DeWine himself in 2020 for his COVID-19 response.",
    "In a letter this week, Secretary of State Frank LaRose indicated the plan for now is to proceed with two separate primary elections.",
    "The Ohio Redistricting Commission, a bipartisan panel of statewide and legislative officials, is scheduled to meet Saturday.",
    "In fact, the Ohio Legislative Service Commission notes all eight impeachments in Ohio’s history were against judges.",
    "The claim about Seitz’ support marks the most senior legislator in favor of the possibility of impeaching O’Connor.",
    "Cupp’s office did not respond to requests for comment about the caucus call or his position on impeachment.",
    "Not long before the redistricting fiasco, O’Connor publicly broke from Republicans on judicial integrity.",
    "Cupp spent six years on the Ohio Supreme Court bench, serving alongside O’Connor for his entire tenure.",
    "“This is a blatant and unfounded attack on the independence of the Ohio judiciary,” she wrote.",
    "The Ohio Supreme Court gave state lawmakers until March 28 to submit a new proposal.",
    "Justice Calvin Pease was impeached and acquitted as well around the same time.",
    "The decision on whether to pursue impeachment won’t be up to him, but Gov.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "He survived via one vote in the state Senate, according to the court.",
    "Ohio Capital Journal maintains editorial independence.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "“This is an extraordinary measure to take,” he said.",
    "Mike DeWine advised against the move Friday.",
    "Morgan Trau contributed to this story.",
    "The idea went nowhere."
  ]
}