{
  "id": 2811,
  "mediaId": 2664,
  "date": "2022-03-14",
  "headline": "Who paid the bribes? Ohio judge demands answers in FirstEnergy shareholders’ suit",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29533220&width=1200&coordinates=0%2C8%2C0%2C8&height=600",
  "link": "https://www.rawstory.com/first-energy/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.rawstory.com/u/jakezuckerman-ohiocapitoljournal",
  "termIds": [
    2209,
    4386,
    388,
    761
  ],
  "sentences": [
    "Seven months and no answers\nOn July 21, 2020, FBI officials arrested former GOP House Speaker Larry Householder and four political allies, accusing them of secretly taking $60 million from FirstEnergy and using it for personal enrichment, political gain, and to pass an energy bill to net the company an estimated $1.3 billion.",
    "Any payments made to him as a consultant, he said, “were in accordance with the terms of that agreement, and following review and approval by senior executives at FirstEnergy.”\nOhio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "The company admitted that it, via its employees and officers, “conspired with public officials” and others to pay those officials millions “in exchange for specific official action for FirstEnergy Corp.’s benefit.”\nAfter his arrest, Householder was ousted as speaker but remained a member of the House.",
    "Jennifer Young, a FirstEnergy spokeswoman, said the settlement complements the “substantial enhancements and actions that the company and our Board have implemented to strengthen our governance and compliance programs.” She declined further comment.",
    "About seven months ago, FirstEnergy, as a company, admitted to federal law enforcement to paying out two, multimillion dollar sets of bribes: one to the former speaker of the Ohio House and one to the state’s top utility regulator.",
    "U.S. District Judge John A. Adams — in a hearing Wednesday and a related order Friday — is demanding answers to questions about the utility’s role in a public corruption scandal that has festered unresolved for nearly two years.",
    "Adams said in the order Friday that he adjourned Wednesday’s hearing given the lawyers’ “steadfast refusal to answer even the most basic questions.” He said that settlement discussions are generally protected from disclosure.",
    "By November 2020, the company publicly disclosed making a $4.3 million payment to a company owned by Sam Randazzo, the chairman of the Public Utilities Commission of Ohio, just before he was appointed by Gov.",
    "In a statement to the Cincinnati Enquirer the day FirstEnergy announced its cooperation with the DOJ, Randazzo said he neither asked nor agreed to perform any executive action on behalf of FirstEnergy.",
    "If they still won’t answer, he threatened sanctions, including “removal” off their role as counsel for “failure to comply with the Court’s lawful order to disclose information,” Adams wrote.",
    "The hearing centered on a proposed settlement for FirstEnergy’s shareholders calling on the company’s insurers to pay them $180 million for damages caused by the scandal.",
    "Kwawegen said he couldn’t divulge the information, given it was obtained during the pre-trial exchange of evidence, known as discovery, which is typically confidential.",
    "That same day, citing an internal investigation, the company announced the firings of CEO Charles Jones and top executives Michael Dowling and Dennis Chack.",
    "“Who is it that paid the bribes?” Adams asked Jeroen van Kwawegen, a lawyer for investors in a shareholders’ lawsuit related to the criminal case.",
    "However, he cited cases in which courts found that information obtained prior to those settlement talks that may have come up are not protected.",
    "Two men, Householder’s political strategist Jeff Longstreth and lobbyist Juan Cespedes, pleaded guilty to a racketeering charge Oct. 29, 2020.",
    "In July 2021, the company paid a $230 million penalty as part of a deferred prosecution agreement with the U.S. Department of Justice.",
    "You are here to duck and avoid,” Adams said before abruptly adjourning the hearing, according to the Cleveland Plain Dealer.",
    "If Adams determines there were no good grounds to claim secrecy, then they get another chance to answer his questions.",
    "FirstEnergy, to possibly dismiss a charge of wire fraud, agreed to cooperate with investigators.",
    "Thus, he ordered the parties to file arguments on this point, due March 16.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "Ohio Capital Journal maintains editorial independence.",
    "FBI agents raided Randazzo’s apartment that same day.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "He resigned shortly after the FBI raided his condo.",
    "He was expelled by the chamber in June of 2021.",
    "Randazzo has not been charged with a crime.",
    "His case is set for trial in January 2023.",
    "You are not here to answer my questions.",
    "“You are wasting my time.",
    "Mike DeWine."
  ]
}