{
  "id": 2850,
  "mediaId": 2537,
  "date": "2022-03-14",
  "headline": "Gov. Mike DeWine signs law eliminating requirement for conceal carry gun permits",
  "image": "https://www.gannett-cdn.com/presto/2021/06/28/NCOD/a4643535-b602-4cf0-ae67-fbb00f20f0c2-ceb_dewine_order_nil_JB_02.jpg?crop=3234,1820,x0,y128&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/14/ohio-gov-mike-dewine-signs-law-legalizing-permit-less-firearm-carry/9374867002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    1497,
    1688,
    3208,
    878
  ],
  "sentences": [
    "And Rep. Shane Wilkin, R-Hillsboro, said SB 215 would protect gun owners from “intrusive government overreach.”\nAt least 21 U.S. states already allow their residents to conceal guns without a permit, according to the U.S.",
    "DeWine's decision to sign the bill into law came over objections from law enforcement groups, county sheriffs and Democrats who worried that taking away training requirements would make communities less safe.",
    "Anna Staver is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "\"DeWine has sold out Ohioans and law enforcement officers to special interest groups and extremists in the legislature,\" Ohio Democratic Party Chair Elizabeth Walters said.",
    "Ohio law currently requires conceal carry permit holders to attend eight hours of training, which includes two hours spent at a gun range firing a weapon.",
    "Those permits will still be available for people who want to carry across certain state lines, but they will be optional for those carrying across Ohio.",
    "Republicans and the firearms lobby say this issue is less about meeting a training minimum and more about not constraining the right to bear arms.",
    "Senate Bill 215 will let Ohio residents 21 and older conceal firearms they are legally allowed to own without training or permits.",
    "\"This is a great moment for Ohio and for those who wish to more fully exercise their Constitutional right to keep and bear arms.\"",
    "Ohioans can carry a concealed weapon without a permit in about three months because of a bill signed into law by Republican Gov.",
    "\"This particular bill goes a large distance in getting the Second Amendment restored,\" Sen. Terry Johnson, R-Scioto, said.",
    "\"This is a day that will go down in history...,\" Buckeye Firearms Association Director Dean Rieck said in a statement.",
    "The Ohio Mayors Alliance and the Ohio Patrolmen’s Benevolent Association both called on the governor to veto.",
    "The shooting accuracy of trained deputies and police officers drops to about 40% in high stress situations.",
    "\"It’s a fantasy to think this is going to make us safer,\" Hamilton County Sheriff Charmaine McGuffey said.",
    "Law enforcement will have to ask, but lying about a concealed weapon will be a misdemeanor offense.",
    "It also removed the legal requirement for gun owners to tell police they are armed when stopped.",
    "Tennessee, Texas, West Virginia and Kentucky all allow permitless or constitutional carry.",
    "\"You are going to have people carrying that have no training.\"",
    "Ohio new gun law:When does Ohio's new gun law take effect?",
    "\"And that’s for an expert shooter...,\" McGuffey said.",
    "\"This bill will make all Ohioans less safe.\"",
    "Concealed Carry Association.",
    "Mike DeWine Monday."
  ]
}