{
  "id": 2857,
  "mediaId": 2679,
  "date": "2022-03-17",
  "headline": "Ohio’s high court nixes 3rd set of GOP-drawn Statehouse maps",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation/ohios-high-court-nixes-3rd-set-of-gop-drawn-statehouse-maps/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "https://www.seattletimes.com/author/julie-carr-smyth/",
  "termIds": [
    1330,
    2036,
    3212,
    3823,
    4208,
    305,
    761,
    878,
    4916,
    5212
  ],
  "sentences": [
    "“It issues an order all but guaranteed to disrupt an impending election and bring Ohio to the brink of a constitutional crisis.”\nThe ruling was a victory for national voting-rights and Democratic groups, including the National Democratic Redistricting Committee led by Obama-era Attorney General Eric Holder, the League of Women Voters of Ohio and others.",
    "COLUMBUS, Ohio (AP) — The Ohio Supreme Court has rejected a third set of Ohio Statehouse district maps that Republicans insisted reflect the state’s partisan breakdown — and sent them back for a fourth try even as final ballots were being prepared for the May 3 primary.",
    "“Staff members of (Republican) Senate President (Matt) Huffman and House Speaker (Bob) Cupp have drafted all three of the plans adopted by the commission.”\nTwo dissenting justices — Republicans Sharon Kennedy and Pat DeWine, son of commission member and defendant Gov.",
    "Ohioans overwhelmingly supported a 2015 constitutional amendment that mandated the redistricting commission at least attempt to avoid partisan favoritism and to proportionally distribute districts to reflect Ohio’s 54% Republican, 46% Democratic split.",
    "Ohio House Minority Leader Allison Russo, a Democratic member of the redistricting commission, said the court ruling shows “the majority party is not above the law.” She awaits Republican buy-in on a map that her party believes can pass legal muster.",
    "Besides joining Democrats in court rulings against the first two sets of legislative maps, O’Connor — who, at 70, is age-limited out of office at the end of this year — also sided against the state’s first attempted map of U.S. House districts.",
    "Advertising\n Skip Ad\nLeague Executive Director Jen Miller called on lawmakers to move the primary, as her organization has been urging for a year — beginning around the time U.S. Census results were delayed due to the coronavirus pandemic.",
    "“Substantial and compelling evidence shows beyond a reasonable doubt that the main goal of the individuals who drafted the second revised plan was to favor the Republican Party and disfavor the Democratic Party,” she wrote for the court.",
    "As circumstances became more urgent, Chief Justice Maureen O’Connor, a moderate Republican who has repeatedly joined court Democrats to invalidate the maps, chose to write the majority opinion herself.",
    "The string of defeats for Ohio’s ruling Republicans comes amid the once-per-decade redistricting process that all states must undertake to reflect population changes recorded in the census.",
    "Of particular concern was the fact that Republicans have all three times drafted the plan approved by the commission without input from Democratic members of the bipartisan commission.",
    "Mike DeWine — sharply rebuked the majority for imposing “shifting whims” with “no grounding in the text of the Constitution.”\n“The majority decrees electoral chaos,” they wrote.",
    "It ordered the panel to reconvene and to submit a set of legal maps to Secretary of State Frank LaRose, the state’s elections chief and a member of the commission, by March 28.",
    "“It’s high time the Ohio General Assembly put voters first, by first adopting maps that meet constitutional muster and then by setting one primary at a later date,” she said.",
    "In yet another 4-3 ruling late Wednesday, the court found the Republican-dominated Ohio Redistricting Commission’s latest maps again failed to pass constitutional muster.",
    "No Democrats have supported any of the three plans, and commission member Republican Auditor Keith Faber joined Democrats in opposing the third plan.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“The commission has adopted three plans so far, but it still has not drafted one,” the court said.",
    "A combination of Republican foot-dragging and legal wrangling has extended redistricting well into the 2022 primary season.",
    "Although primary election day nears, the GOP-led Legislature has resisted pushing back the date of the May 3 primary.",
    "The plan, outlining Ohio House and Ohio Senate districts, remains subject to objections and another court review.",
    "The state’s new redistricting process is essentially being written even as it’s carried out.",
    "The commission submitted a second attempt at congressional districts March 2.",
    "A decision on continued objections to that map is pending before the court.",
    "It remains unclear what would change the fourth time around.",
    "The plan must be filed with the court by March 29.",
    "It was intended to be completed last fall.",
    "JULIE CARR SMYTH"
  ]
}