{
  "id": 2906,
  "mediaId": 2537,
  "date": "2022-03-10",
  "headline": "Ohio governor's race: Mike DeWine won't debate Republicans hoping to unseat him",
  "image": "https://www.gannett-cdn.com/presto/2021/10/28/NATG/4f779699-78f6-4cff-8642-b75de2f316f5-Mansfield_GOP_Vote_Rally005.JPG?crop=1999,1125,x0,y12&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/03/10/ohio-governors-race-mike-dewine-wont-debate-republicans-challengers/9452521002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "DeWine officially refused an offer from the Ohio Debate Commission to go toe-to-toe with former U.S. Rep. Jim Renacci, Canal Winchester farmer Joe Blystone and state Rep. Ron Hood before the May 3rd primary.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "\"This is a DeWine versus Renacci race and the governor should be on stage and be asked the tough questions Ohioans want to know the answers to,\" Renacci spokesman Tom Weyand said.",
    "You can submit questions – either in writing or via a recorded video – to candidates for any of the debates at www.ohiodebatecommission.org.",
    "“We convene these debates to help voters and, frankly, to help campaigns and candidates connect with voters across the state,\" he said.",
    "Both Democrats running for governor, former Cincinnati Mayor John Cranley and former Dayton Mayor Nan Whaley, have agreed to debate.",
    "\"Mike DeWine is the most publicly accessible governor in Ohio history,\" DeWine campaign manager Brenton Temple said.",
    "The trio is hoping to capitalize on frustration over DeWine's COVID-19 closures to oust the incumbent governor.",
    "All debates will be at Central State University's Paul Robeson Cultural & Performing Arts Center.",
    "On Friday, reporters asked DeWine why he was skipping the debate with his Republican challengers.",
    "Ohio Debate Commission President Dan Moulthrop said he was \"disappointed\" in DeWine's decision.",
    "But a recent Fox News Poll shows DeWine with a comfortable lead over the pack of competitors.",
    "DeWine meets with constituents on a daily basis and regularly takes questions from the media.",
    "“It might be an entertaining hour but I’m not sure how productive it would be,” DeWine said.",
    "Ohioans know where he stands on the issues and that he is fighting and winning for them.\"",
    "The Ohio Debate Commission and Renacci's campaign are calling on DeWine to reconsider.",
    "The debate, which is from 11 a.m. to noon Tuesday, March 29, is expected to proceed.",
    "The debates will air on TV and radio stations across the state as well as online.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Mike DeWine won't debate fellow Republicans hoping to unseat him this spring.",
    "The Democratic candidates will debate from 7 to 8 p.m. Tuesday, March 29.",
    "Their only face-off was a Cleveland.com editorial board meeting.",
    "\"We would welcome the governor reconsidering and joining us.\"",
    "Blystone and Renacci are in discussions with the commission.",
    "DeWine has a history of not doing primary debates.",
    "The commission is still trying to reach Hood.",
    "He didn't debate then-Lt. Gov.",
    "Mary Taylor in 2018 either.",
    "\"Gov.",
    "Gov."
  ]
}