{
  "id": 2925,
  "mediaId": 2537,
  "date": "2022-03-18",
  "headline": "Ohio Republicans discussing impeachment of Chief Justice Maureen O'Connor after map ruling",
  "image": "https://www.gannett-cdn.com/presto/2021/12/08/NCOD/b5765ed8-a0db-4459-8c4d-543093d2f9ed-Oral_Arguments_Redistricting_KWR_09.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/18/ohio-republicans-want-impeach-maureen-oconnor-over-redistricting/7088996001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    2036,
    2285,
    2928,
    4676,
    878,
    994,
    5004,
    5212
  ],
  "sentences": [
    "\"The Republican Party’s statement should be seen for what it is: part of a continuing string of attacks against any decision that doesn’t favor a political end, regardless of party, even if that decision may be legally correct and indeed legally required,\" O'Connor said.",
    "Haley BeMiller, Jessie Balmert and Laura Bischoff are reporters for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "O'Connor, a Republican, is seen as an independent voice on the court and sided with Democratic justices to throw out multiple sets of maps, arguing they did not comply with constitutional rules for redistricting.",
    "\"I don’t think we want to go down that pathway because we disagree with a decision by a court, because we disagree with a decision by an individual judge or justice – not a good idea.”\nHow does impeachment work?",
    "House Republicans are discussing whether to impeach Chief Justice Maureen O'Connor after the Ohio Supreme Court rejected a third set of legislative maps and effectively ended all hope of a full May 3rd primary.",
    "An email from a Republican state central committee member, obtained by USA TODAY Network Ohio, said an unnamed lawmaker disclosed that they would be filing an impeachment charge against O'Connor.",
    "A statehouse insider, who requested anonymity to discuss the situation candidly, also confirmed Republican lawmakers are mulling impeachment and may move forward in the coming days.",
    "The court struck down the maps on Wednesday with O'Connor as the deciding vote, sending the Ohio Redistricting Commission back to the drawing board for the fourth time.",
    "In September 2020, O'Connor issued a strongly-worded statement condemning the Ohio Republican Party for attacking Franklin County Common Pleas Court Judge Richard Frye.",
    "A spokesman for Speaker Bob Cupp, who served as an Ohio Supreme Court justice with O'Connor, did not immediately respond to a request for comment.",
    "Under the Ohio Constitution, anyone can file a complaint to the House requesting an investigation of a state official's conduct in office.",
    "Multiple House Republicans said there have been discussions about the matter, but it's unclear if any decisions have been made.",
    "Their charges include \"judicial arrogance,\" judicial incompetence and holding statutes unconstitutional and unenforceable.",
    "Eight officials, all judges, have been impeached in Ohio, according to a memo from the Legislative Service Commission.",
    "“No matter what we think of that (redistricting) opinion, this is an extraordinary measure to take,\" DeWine said.",
    "A House Democrats spokeswoman said lawmakers need to be focused solely on passing \"fair and constitutional maps.\"",
    "That's increasingly made her a target of fellow party members who contend she's shirking her responsibilities.",
    "Impeachment requires the support of 50 lawmakers, and Republicans currently control 64 of the 99 seats.",
    "Justices Sharon Kennedy and Jennifer Brunner are running for chief justice in this year's election.",
    "If the House impeaches someone, the Senate can convict that official with two-thirds of the vote.",
    "\"It's time to impeach Maureen O'Connor now,\" Rep. Scott Wiggam, R-Wayne County, tweeted Thursday.",
    "The only judge to be convicted by the Senate was one impeached for being absent without leave.",
    "\"I don’t understand what the woman wants,\" said state Rep. Sara Carruthers, R-Hamilton.",
    "Mike DeWine said Friday he does not support any effort to impeach the chief justice.",
    "O'Connor, who cannot run again due to age limits, steps down from the court Dec. 31.",
    "She has served in statewide elected office longer than any woman in Ohio history.",
    "\"Judging by conversations I'm aware of, there is growing support for this move.",
    "Impeachment would add fuel to an already heated redistricting process.",
    "O'Connor did not immediately return a message seeking comment.",
    "A ruling on the latest congressional maps is expected any day.",
    "She said judges don't decide cases based on partisanship.",
    "\"I don't know if it moves or not,\" the source said.",
    "I don't know if there's enough.\"",
    "Gov."
  ]
}