{
  "id": 2942,
  "mediaId": 6571,
  "date": "2022-03-14",
  "headline": "Pittsburgh-Area Hospitals Report Decline In COVID-19 Hospital Admissions",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/05/06/bebfce3d-e6fa-4847-8034-b88fe775a2ba/thumbnail/1200x630/d31da01571aa459027180966656e31df/Coronavirus-1024x576-1.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/pittsburgh-decline-in-covid-19-hospital-admissions/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    26,
    1189,
    5249
  ],
  "sentences": [
    "Leaders from both UPMC and AHN said the case drop has helped improve staffing, which was a dire issue because of nationwide worker shortages, exacerbated by employees getting sick or exposed to the virus.",
    "PITTSBURGH (KDKA) -- The Omicron surge of COVID-19 pushed health care providers to the max, creating log jams in emergency departments and limiting the quality of care they were able to provide.",
    "According to leaders from both health systems, as of Monday morning, UPMC had 130 people hospitalized with COVID across 40 hospitals, and Allegheny Health Network had 28 across 13 hospitals.",
    "It dropped down to the 200 range for a little while and plateaued, dropped down to the 100 range for a little while and plateaued,\" Dr. Donald Whiting, chief medical officer at AHN, said.",
    "But in recent weeks, local hospitals have been reporting only a fraction of the hospital admissions that they had just a couple of months ago.",
    "Doctors said this decrease is a positive sign that things are headed in the right direction but reminded people the pandemic is not over.",
    "They encourage people to start returning to normal life, while also practicing vigilance, and to also regain focus on personal health.",
    "Doctors said that compliance with COVID-19 safety precautions was a huge help in slowing down the spread.",
    "All of these numbers are dramatically different from mid-January during the Omicron surge.",
    "So it's come down dramatically,\" Dr. Donald Yealy, UPMC's chief medical officer, said.",
    "Heritage Valley is averaging about two to three a day, CEO Norman Mitry told KDKA.",
    "\"Two months ago, that number would have been 1,100, 1,150 patients.",
    "\"We were in the 400-plus range at all of our hospitals.",
    "In:\nCOVID-19\nCoronavirus"
  ]
}