{
  "id": 295,
  "mediaId": 2534,
  "date": "2022-04-14",
  "headline": "As Ohio tilts right, governor’s moderate image becomes liability",
  "image": "https://images.csmonitor.com/csm/2022/04/1137552_2_0414-Ohio-Gov_standard.jpg?alias=standard_900x600",
  "link": "https://www.csmonitor.com/USA/Politics/2022/0414/As-Ohio-tilts-right-governor-s-moderate-image-becomes-liability?icid=rss",
  "mediaOutlet": "Christian Science Monitor",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Seewer",
  "authorUrl": "",
  "termIds": [
    1556,
    1688,
    2070,
    2201,
    3378,
    3975,
    878,
    5212
  ],
  "sentences": [
    "Former U.S. Rep. Jim Renacci, who served four terms in Congress, was thought to be Mr. DeWine’s biggest threat, especially if he could win an endorsement from Mr. Trump after getting his backing four years ago in a failed U.S. Senate bid.",
    "He’s facing challenges from three lesser-known conservatives who could essentially split the far-right faithful, with Mr. DeWine potentially emerging as a Republican who crossed Mr. Trump’s base and managed to survive.",
    "Mr. Renacci said Mr. DeWine prioritized “fear over freedom.”\nSome conservatives have vowed never to vote for Mr. DeWine again, according to a handful of county GOP chairs, even if that means sitting out in November.",
    "The higher-profile race for an open U.S. Senate seat is perhaps more reflective of Ohio’s rightward shift as candidates have spent months trying to out-Trump one another as they seek his coveted endorsement.",
    "So far, the former president has stayed quiet in the governor’s race, a credit to Mr. DeWine’s ability to walk a fine line of expressing support for Mr. Trump while also keeping him at a distance.",
    "It was one thing on top of another that made no sense.”\nStill, Mr. DeWine has a huge fundraising advantage and a network of supporters built from a political career spanning more than 40 years.",
    "They saw him putting in restrictions that ran counter to what they were hearing from Mr. Trump and conservative governors such as Ron DeSantis in Florida and South Dakota’s Kristi Noem.",
    "Those areas hold the fewest votes yet carry significant weight because Republicans often pile up big enough margins to negate the strong Democratic turnout in the state’s big cities.",
    "Down here they haven’t forgotten,” said Dennis Cooper, a member of the Clermont County Republican Party, which overwhelmingly endorsed Mr. Renacci over Mr. DeWine earlier this year.",
    "His dismissal of the former president’s stolen election lie and criticism that Mr. Trump “poured gas on the fire” before the U.S. Capitol riot put him at odds with many GOP voters.",
    "He’s an old-school conservative who just months into his first term as governor signed into law what at the time was one of the most stringent abortion restrictions in the nation.",
    "Despite some notable splits with Mr. Trump, he is entering the final stretch of the campaign in a strong position to win the GOP’s nomination for another four-year term.",
    "But the mood soured among Republicans who quickly tired of mask mandates and health orders that closed many small businesses but allowed large retailers to remain open.",
    "A hostile state Legislature dominated by Mr. DeWine’s own party overrode his veto of a bill weakening the governor’s ability to respond to public health emergencies.",
    "“Whatever happens in the election happens, but this was a crucial time in our history,” Mr. DeWine said in an interview, referring to his management of the pandemic.",
    "But some recent polls show Mr. Renacci splitting the anti-DeWine vote with Joe Blystone, a farmer who jumped in the race early and built a following in rural Ohio.",
    "Much of the frustration toward Mr. DeWine has bubbled up in Republican-dominated rural counties where mask mandates and school shutdowns were met with resistance.",
    "“They’re not going to vote again for someone who has disappointed them and not represented them well,” said Shelby County Republican Chairwoman Theresa Kerg.",
    "“I don’t know if the party has changed or all of our politics have shifted over the last two years.”\nOne thing that hasn’t changed, he said, is Mr. DeWine.",
    "Despite their different approach to the pandemic, which Mr. Trump sought to minimize, there was only one hint of a genuine rift between the two men.",
    "The dynamics harken back to an era when Ohio prized middle-of-the-road candidates, making it a bellwether for presidential elections for decades.",
    "The winner of the Republican primary will face the Democratic nominee, either former Cincinnati Mayor John Cranley or ex-Dayton Mayor Nan Whaley.",
    "That was when Mr. DeWine suggested in November 2020 that it was time for Mr. Trump to acknowledge that Joe Biden had won the White House.",
    "He was widely praised early in 2020 for not downplaying the pandemic when he became the first governor to shut down schools statewide.",
    "“I think people are frustrated and tired of just accepting whoever is given to them.”\nThis story was reported by The Associated Press.",
    "Ryan Stubenrauch, a former DeWine policy adviser who’s now a GOP consultant, thinks the anger is coming from a vocal minority.",
    "Both are why more prominent Republicans in the state decided against challenging him even as dissatisfaction grew.",
    "Mr. DeWine has leaned on his pro-life stance to explain why that also includes protecting people from COVID-19.",
    "But that reputation for moderation eroded under Mr. Trump, who won the state in the 2016 and 2020 campaigns.",
    "Mr. Trump’s response was a tweet wondering who would challenge Mr. DeWine in this year’s primary.",
    "Mike DeWine imposed early in the pandemic still infuriate Donald Trump’s most loyal supporters.",
    "Associated Press writer Julie Carr Smyth in Columbus, Ohio, contributed to this report.",
    "But that may not be enough to topple Mr. DeWine in the state’s upcoming May 3 primary.",
    "The school closures, stay-at-home mandates, and curfews that Ohio Republican Gov.",
    "“He values life just about over everything,” Mr. Stubenrauch said.",
    "The last two years have been really rough on people,” he said.",
    "“There’s a whole lot of people mad at a lot of things.",
    "“Will be hotly contested!” Mr. Trump predicted.",
    "“They say in politics people forget things.",
    "“It wasn’t just one thing."
  ]
}