{
  "id": 2975,
  "mediaId": 2641,
  "date": "2022-03-14",
  "headline": "'I Did That': Stickers at Gas Pumps Point Finger at Biden for Soaring Prices",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=b9283bdc-e7cd-4c96-a274-dc6727f7bdba&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/biden-stickers-gas-pump-i-did-that/2022/03/14/id/1061155/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Wells",
  "authorUrl": "",
  "termIds": [
    2201,
    3119,
    3975,
    710,
    4839,
    5130,
    5165,
    5212
  ],
  "sentences": [
    "\"By removing his bans on new oil and gas development on federal lands, building the Keystone XL pipeline, and reinstating regulatory reforms to streamline energy permitting, we can protect our national energy security and sell to our friends rather than buy from our enemies — specifically Russia.\"",
    "President Joe Biden is seemingly taking the blame for soaring gas prices, as stickers showing the commander-in-chief pointing his finger and saying “I did that” have been appearing on gas pumps across the country.",
    "\"As governors, we call on President Biden to reverse his policies and restore America's energy independence for our citizens as well as our allies abroad,\" the governors said in a statement to CBS.",
    "With the average price for a gallon of gasoline being $4.325 as of Monday, and prices continuing to rise, the Biden stickers are showing up at gas stations everywhere.",
    "The Post reports its journalists found the stickers on a pump at a Speedway in the Mott Haven neighborhood of New York and at a Shell station in Harlem.",
    "\"I take off five or six a day from our different pumps,\" Perry Cagle, assistant manager of an Exxon station near Athens, Alabama, told WAAY-TV.",
    "CBS reports that the statement was signed by 25 of the nation's 28 Republican governors, including moderates such as Maryland Gov.",
    "CBS News reports that nearly all the country's Republican governors are calling on Biden to increase domestic energy production.",
    "\"I just know everything he's been doing since he took office has been going downhill,\" Harold Frost, 29, told the New York Post.",
    "The Boston Herald reported on the stickers last November when gas was $3.50 a gallon on average.",
    "Already climbing before Russia invaded Ukraine, gas prices are breaking records daily.",
    "The stickers retail for as low as $3.01 for a pack of 100 on Amazon.",
    "My car has been parked the whole week because of this.",
    "I took the train, but it's dangerous now on the train.",
    "Larry Hogan and conservatives like Florida Gov.",
    "Phil Scott did not sign on to the statement.",
    "Don't vandalize private property.\"",
    "Mike DeWine and Vermont Gov.",
    "Ron DeSantis and Texas Gov.",
    "Charlie Baker, Ohio Gov.",
    "Only Massachusetts Gov.",
    "You gotta be careful.\"",
    "Put it on your house.",
    "\"Put it on your car.",
    "\"Bring Trump back.",
    "Greg Abbott."
  ]
}