{
  "id": 3006,
  "mediaId": 2919,
  "date": "2022-03-10",
  "headline": "Ohio Debate Commission: Gov. Mike DeWine won't participate in primary election debate",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/08915bf/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F0c%2F83%2Fc27f14d2499a8f041f8515ca638b%2Fdewine.jpg",
  "link": "https://www.news5cleveland.com/news/election-2022/ohio-debate-commission-gov-mike-dewine-wont-participate-in-primary-election-debate",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Drew Scofield",
  "authorUrl": "https://www.news5cleveland.com/drew-scofield",
  "termIds": [
    1688,
    205,
    749,
    4916,
    5212
  ],
  "sentences": [
    "\"As it works to inform Ohio voters and constituents in an unprecedented election cycle, the ODC hopes Governor DeWine will reconsider his decision not to participate in this primary election debate,\" the commission said.",
    "Despite DeWine's decision, the commission said the Ohio Gubernatorial Republican primary debate will continue as planned with the remaining candidates taking part.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "The commission was established in 2018 and has sought to \"foster fair and substantive debates that encourage participation in our democracy.\"",
    "He previously participated in one of the commission's debates in 2018 when he was running for governor.",
    "Mike DeWine has declined to participate in a debate for the upcoming primary election.",
    "According to the commission, DeWine didn't give a reason why he declined the offer.",
    "News 5 has reached out to DeWine's office and campaign representatives for comment.",
    "The debates are scheduled to happen March 28 and 29 at Central State University.",
    "Download now on your Apple device here, and your Android device here.",
    "COLUMBUS, Ohio — The Ohio Debate Commission said Thursday Gov."
  ]
}