{
  "id": 3126,
  "mediaId": 2537,
  "date": "2022-03-17",
  "headline": "Ohio governor's race: GOP debate cancelled after DeWine, Renacci won't participate",
  "image": "https://www.gannett-cdn.com/presto/2021/12/02/PCIN/ebe978c4-dfba-4431-b031-6f26402f40ae-ARO_1393.jpg?crop=2157,1214,x0,y109&width=2157&height=1214&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/03/17/election-2022-gop-governor-candidates-wont-debate-central-state/7075023001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    1556,
    1673,
    1688,
    2070,
    2681,
    4569,
    305,
    878,
    4937,
    5212
  ],
  "sentences": [
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Ultimately, former U.S. Rep. Jim Renacci decided he didn't want to only debate farmer Joe Blystone, and former state Rep. Ron Hood never returned organizers' calls.",
    "DeWine, who didn't debate fellow Republican Mary Taylor in 2018, said Ohioans already knew where he stood on the issues and a one-hour debate wouldn't change that.",
    "\"One hour with four people, I'm not sure really adds a whole lot to what the public knows about Mike DeWine or public policy debate,\" he told reporters last week.",
    "The Ohio Debate Commission will hold a debate for Democratic candidates for governor, former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley.",
    "That debate is set for 7 p.m. to 8 p.m. on March 29 at Central State University's Paul Robeson Cultural & Performing Arts Center.",
    "\"But when the incumbent chooses not to debate, it’s not surprising that others in the race have less incentive to do so as well.\"",
    "You can request tickets for the debate and submit questions for the candidates at ohiodebatecommission.org.",
    "\"There is no such thing as a gubernatorial debate without the governor,\" Renacci spokesman Tom Weyand said.",
    "Mike DeWine declined the Ohio Debate Commission's invitation, it wasn't clear if the event would continue.",
    "Ohio Debate Commission Board President Dan Moulthrop said the result was \"disappointing.\"",
    "\"Jim will show up on any stage that the governor is on to discuss any issue.\"",
    "Republicans vying to be Ohio's next governor won't debate later this month.",
    "You will also be able to watch the debate on this newspaper's website.",
    "\"It might be an entertaining hour, not sure how productive an hour.\"",
    "After Gov."
  ]
}