{
  "id": 3144,
  "mediaId": 2664,
  "date": "2022-03-10",
  "headline": "Ohio governor appoints former lawmaker to elections board who hyped up 2020 voter fraud claims",
  "image": "https://www.rawstory.com/media-library/last-minute-lawsuit-keeps-ohio-legislator-from-casting-electoral-college-vote-for-trump.png?id=24832626&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/christina-hagan-nemeth/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.rawstory.com/u/jakezuckerman-ohiocapitoljournal",
  "termIds": [
    1688,
    1978,
    2201,
    3975,
    4312,
    757,
    761
  ],
  "sentences": [
    "The article depicts some Jan. 6 rallygoers as “peaceful protesters who desperately wanted to be counted.” Others, it states, weren’t peaceful but “were just as concerned about the future of elections after what happened in November.”\nDiscussing the one-year anniversary of the riot on a conservative talk radio show, Hagan mocked a comment from Vice President Kamala Harris comparing Jan. 6 to other hallowed days in American history like 9/11 or the attack on Pearl Harbor.",
    "SCOTUS now adds\nELECTION FRAUD LAWSUITS\nto List Of Cases To Be Considered…\nNot loving the timing…\nBut better late than never.https://t.co/V3nGcMWJLn\n— Christina Hagan (@RepHagan) February 6, 2021\nShe made similar comments a few days later, saying it “could get interesting” that the Supreme Court is scheduled to consider voter fraud cases in three states Biden won.",
    "Hagan said this shows that Democrats are trying to “rig the next election.” She made similar comments on talk radio about two bills that would overhaul election administration via prohibiting voter identification requirements, reinstating parts of the Voter Rights Act that were struck down by the Supreme Court, and more.",
    "“And every single word that comes out of their mouth is orchestrated for that intentional destruction.”\nElections commission\nThe Ohio Elections Commission is a seven-member panel comprised of three Republicans, three Democrats, and one independent.",
    "But I have prayed that if it exists and especially to the degree to which its exposure can change the media’s projected outcome of the election…That it should be brought to light in a profound and irrefutable way,” she wrote.",
    "In 2018, she lost in a congressional primary to current Rep. Anthony Gonzalez — one of 10 Republicans who voted to impeach Trump in connection with Jan. 6 and has denounced the idea that the election was stolen.",
    "A review of her public social media posts and talk radio appearances show she amplified the unsupported and repeatedly discredited claim that President Joe Biden somehow stole the election from Donald Trump.",
    "“I think the most dramatic word that we can accurately use [to describe Jan. 6] would be a riot, but not even, because there were really — nothing was defamed, nothing was attacked to any degree,” she said.",
    "“The American people are entitled to an honest election,” Hagan wrote on social media Nov. 7, 2020, the day TV networks first projected Biden would win enough states to clinch the electoral college.",
    "DeWine has walked a tightrope since 2020 of denying the existence of widespread voting fraud but refraining from criticism of Trump — the leading proponent of the “stop the steal” movement.",
    "On Jan. 6, 2021, a crowd of hundreds of Trump supporters, swept up in his claims of a stolen election, violently stormed the U.S. Capitol seeking to halt certification of the 2020 election.",
    "Over the course of about seven hours, the attackers injured 114 police officers and caused about $1.5 million in damages, according to a U.S. Government Accountability Office report.",
    "If you think these are controversial statements you must not agree w/ safeguarding the sacred value of our individual votes as Americans.”\nTen days later, she made similar comments.",
    "He didn’t answer questions about Hagan’s statements, only noting through a spokesman that her appointment was recommended by Republican leaders in the state House and Senate.",
    "Christina Hagan-Nemeth, who served in the Ohio House before mounting two unsuccessful congressional bids, was appointed Tuesday to the Ohio Elections Commission.",
    "Speaking to CNN’s Jake Tapper on Jan. 3, 2021, DeWine refused to answer when asked why so many people believe that widespread election fraud occurred in 2020.",
    "Two weeks later, Hagan posted to her Facebook page an article written by Tony Perkins, leader of the Family Research Council, an anti-LGBTQ organization.",
    "In May 2020, the U.S. House passed legislation that would have prohibited states from requiring any form of identification to obtain an absentee ballot.",
    "Mike DeWine appointed a former lawmaker to a state board that oversees elections who has publicly amplified debunked notions of election fraud in 2020.",
    "Ohio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "“I’m on team #EveryLegalVoteShouldCount.”\nHagan, a Republican, did not respond to a phone call, text, or message to her personal Facebook account.",
    "Snopes, the fact checking website, later reported the ad used footage from an Italian TV network showing Moroccan immigrants crossing into Spain.",
    "“SCOTUS now adds ELECTION FRAUD LAWSUITS to List of Cases To Be Considered… Not Loving the timing… But better late than never,” she said.",
    "With the appointment, she now sits on a panel responsible for reviewing allegations of campaign finance violations and other offenses.",
    "In February 2021, Hagan shared an article from a conservative news outlet about the Supreme Court’s review of election fraud lawsuits.",
    "She first won office to the Ohio House in 2010 at the age of 21, where she served for eight years, the constitutional maximum.",
    "At the time, she used a campaign ad calling for a need to “secure our borders” and stop illegal immigration from Mexico.",
    "The commission can levy fines, make criminal referrals, and intervene in campaigns at politically sensitive junctures.",
    "As recently as last week, Hagan circulated petitions to run for congress, according to the Cleveland Plain Dealer.",
    "A Trump supporter was shot and killed after crawling through a transom window toward members of congress.",
    "On Tuesday, DeWine also appointed John Lyall, a Democrat, to serve on the commission.",
    "It’s February 2020\nBiden’s already done record setting damage via executive orders.",
    "Trump endorsed Hagan in her 2020 run for the same seat, according to WKYC.",
    "The Supreme Court denied request to consider the cases later that month.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "But on March 4, she publicly announced she wouldn’t run for the seat.",
    "Several officers died in the aftermath, including four by suicide.",
    "On a few occasions, she has accused Democrats of election fraud.",
    "“They are always, always aiming to undermine,” Hagan said.",
    "Ohio Capital Journal maintains editorial independence.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "Her term runs through the end of 2026.",
    "“All legal votes should be counted.",
    "“I’ve never prayed for fraud.",
    "Gov."
  ]
}