{
  "id": 3205,
  "mediaId": 2732,
  "date": "2022-03-13",
  "headline": "Editorial: Why not a state gas tax holiday, Gov. Wolf?",
  "image": "",
  "link": "https://triblive.com/opinion/editorial-why-not-a-state-gas-tax-holiday-gov-wolf/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3279,
    4915,
    5130,
    5145,
    5154,
    5182,
    5212,
    5402
  ],
  "sentences": [
    "“As Congress looks to relieve Americans of the financial stress caused by increased gas prices amid international crises and rising inflation, we support federal legislation to address rising gas prices by suspending the federal gas tax until the end of the year,” the governors wrote.",
    "But experts such as Ulrik Boesen, a senior policy analyst at the Tax Foundation in Washington, D.C., say it ultimately would be a bad idea, leaving less money for repairs it is meant to fund and possibly increasing inflation.",
    "While New Mexico charges just 18.88 cents a gallon on the low end and Michigan sits at 45.12 cents on the high side, Pennsylvania has the third-highest gas tax in the nation at 58.70 cents per gallon.",
    "If Pennsylvania even temporarily slashed its gas tax by a third, it still would collect more than 35 other states — and be equivalent to what the federal government is being asked to do.",
    "“… We know it is possible to invest in infrastructure and also provide meaningful relief to consumers at the pump.”\nCouldn’t this apply to the state tax as well?",
    "“Money saved at the pump translates into dollars back in consumers’ pockets for groceries, childcare, rent and more,” the governors wrote.",
    "Tom Wolf joined his counterparts in Colorado, Michigan, New Mexico and Wisconsin in appealing to congressional leaders.",
    "The National Federation for Independent Business is calling on Colorado to pull its 22-cents-per-gallon gas tax, too.",
    "The problem is the rising gas prices that are making it more expensive by the hour to fill up a tank.",
    "Why isn’t what’s good for the federal government something that would work in Harrisburg?",
    "Pennsylvania differs from the other states represented in that its gas tax dwarfs theirs.",
    "There is no consensus on how to handle the issue among Pennsylvania’s neighbors.",
    "Gretchen Whitmer is planning to veto a bill to suspend her state’s gas tax.",
    "Larry Hogan wants to lift his state’s tax, while, to the west, Ohio Gov.",
    "When they penned the letter, the national average was $4.17 per gallon.",
    "Mike DeWine says a suspension of his state’s tax would be a mistake.",
    "But Pennsylvania has the ability to do something other states don’t.",
    "OK. That would knock 18 cents a gallon off the price at the pump.",
    "Tony Evers is pushing back on calls to suspend his state’s tax.",
    "Instead, Wolf is asking Congress to do what Pennsylvania won’t.",
    "Gas pumps don’t charge less for one party or another.",
    "Minnesota’s governor hopped on the bandwagon later.",
    "The Detroit Free Press writes that Michigan Gov.",
    "Not a lot, but it could provide a little relief.",
    "This isn’t just a Democrat or Republican issue.",
    "That’s more than three times the federal tax.",
    "It could ease its tax rather than lift it.",
    "But here’s an idea: You first, Gov.",
    "Categories: Editorials | Opinion",
    "On Monday, Pennsylvania Gov.",
    "To the south, Maryland Gov.",
    "On Friday, it was $4.33.",
    "Wisconsin Gov.",
    "Wolf."
  ]
}