{
  "id": 3257,
  "mediaId": 6598,
  "date": "2022-03-07",
  "headline": "Stolichnaya Vodka rebrands as 'Stoli,' trying to distance itself from Putin",
  "image": "https://media.npr.org/assets/img/2022/03/07/ap28207960622_wide-3e158775067c43736ad583ba8ccb9e1a75843c3a.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/07/1085053999/stolichnaya-vodka-stoli-ukraine-russia",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vanessa Romo",
  "authorUrl": "",
  "termIds": [
    3709,
    4739,
    908,
    982,
    5088,
    5212,
    5287,
    5325,
    5366
  ],
  "sentences": [
    "\"The three driving factors behind the decision are the founder's vehement position on the Putin regime; the Stoli employees determination to take action; and the desire to accurately represent Stoli's roots in Latvia,\" the company said in a statement.",
    "Governors in Utah and New Hampshire ordered government-run liquor stores to pull Russian-made spirits from shelves, while Ohio's governor, Mike DeWine, moved to block the purchase and sale of Russian Standard vodka.",
    "\"We are monitoring the situation closely and are already moving swiftly and decisively to provide support where needed, both to our people on the ground as well as partners.\"",
    "The company that owns Stolichnaya vodka announced that it is officially adopting the drink's unofficial nickname and will now brand the vodka as Stoli.",
    "This is not the first time the Stoli Group or Shefler have sought to distance the brand from perceptions of continued ties to the Russian government.",
    "That company was founded by the exiled Russian-born billionaire Yuri Shefler, a vocal critic of President Vladimir Putin who fled Russia in 2002.",
    "A key difference between the two, according to the Stoli Group, is that the label on the state-sponsored alcohol clearly says it is Russian-made.",
    "After Putin enacted a number of draconian laws in 2013 cracking down on the country's gay community, the vodka makers publicly condemned Putin.",
    "Stolichnaya started out as a Russian brand in the former Soviet Union,though there is even some disagreement about when exactly it started.",
    "Meanwhile, the Russian government has continued making a state-owned version of the brand that is sold and marketed within the country.",
    "As people around the world move to boycott Russian products, one of the most iconic vodka brands will change its name.",
    "In a statement, Stoli Group Global CEO Damian McKinney noted that the company also has a presence in Ukraine.",
    "A growing number of Russian businesses are facing boycotts because of their country's invasion of Ukraine.",
    "The Stoli Group said the rebranding effort is in \"direct response to Russia's invasion of Ukraine.\"",
    "But in recent years, the vodka has been produced in Latvia by the Luxembourg-based Stoli Group.",
    "Last week, McKinney stressed that the renaming is not just about mitigating financial losses.",
    "This is one actionable, meaningful thing we can do to make it clear that we support Ukraine.\"",
    "Russian vodka specifically has become a target for U.S. state leaders in recent weeks.",
    "\"We have employees, partners and distributors in the region directly impacted.",
    "\"The safety and security of our Ukrainian team is our top priority,\" he said.",
    "\"As a former Royal Marine Commando, I know all too well the horrors of war.",
    "They are asking that we take a bold stand.",
    "\"This is very personal to us,\" he said."
  ]
}