{
  "id": 3278,
  "mediaId": 2560,
  "date": "2022-03-09",
  "headline": "Dueling portraits emerge as domestic terror trial begins in Whitmer kidnap case",
  "image": "https://www.gannett-cdn.com/presto/2022/03/10/PDTN/60aa76e4-05d6-4dca-b9f8-85dd63877061-blanchard_0309.jpg?crop=1845,1038,x0,y0&width=1845&height=1038&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/local/michigan/2022/03/09/michigan-governor-gretchen-whitmer-kidnap-plot-trial/9416003002/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Snell and Kayla Ruble",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The plot was hatched in April 2020, weeks into the pandemic and unfolded over the next six months across encrypted chat rooms, in militia meetings in Ohio, while building bombs in rural Wisconsin and at a secluded wooded training camp in northern Michigan where plotters practiced with an arsenal of weapons and launched surveillance of the governor's northern Michigan cottage, according to the government.",
    "The case is high stakes — defendants Adam Fox of Potterville, Barry Croft of Delaware, Daniel Harris of Lake Orion and Brandon Caserta of Canton Township face up to life in prison if convicted of kidnapping conspiracy — and a high-profile test of federal laws being used to punish extremist behavior that erupted nationally in 2020 and 2021 around the presidential election and COVID-19 pandemic.",
    "“They searched his house and found two long guns but no missiles and no rockets to shoot airships out of the sky.”\nCroft, meanwhile, projected a starkly different image in court after two years of prosecutors showing him in camouflaged clothes with wild, unkempt facial hair and labeling him a bombmaker who liked to wear a tricorn hat — until it was seized by the FBI.",
    "“And you expect when the FBI starts an investigation, they’ll use responsible tactics and expect they’ll follow the facts, not preconceived notions to their end goal.”\nFBI counterterrorism agents decided early on that the investigation would lead to a “really big case” and enlisted numerous ‘snitches,’” Blanchard said.",
    "“They believe a second Civil War is coming and they are looking forward to that Civil War.”\nThe government's opening statements launched what is expected to be a multimedia trial featuring secret audio and video recordings, online chats and testimony from FBI agents, at least one informant and two convicted plotters.",
    "His lawyer, Josh Blanchard, grimaced when the prosecutor noted the transformation, telling jurors not to be misled by the man sitting before them who resembled a “math teacher.”\nCroft had been on the FBI’s radar since 2017 after agents spotted his Facebook posts disparaging the bureau, Blanchard told jurors.",
    "“They agreed, planned, trained and were ready to break into a woman’s home while she slept with her family in the middle of the night, with violence, at gunpoint to tie her up, take her from that home, shoot, blow up and kill anybody who got in their way,” Roth told jurors.",
    "Meanwhile, Caserta, 33, a machinist from Canton Township, was described by his lawyer Wednesday as a minor figure who was not involved in many of the landmark events and chats that will be described to jurors, including a nighttime surveillance of Whitmer's vacation home.",
    "Prosecutors described violent extremism by men predisposed to kidnapping the governor while defense lawyers faulted what they characterized as an FBI team of rogue agents and snitches who orchestrated a conspiracy and entrapped the alleged plotters.",
    "Two convicted plotters originally charged in federal court — Ty Garbin of Hartland Township and Kaleb Franks of Waterford Township — are expected to testify for the government that the four defendants were not entrapped by the government.",
    "Fox looked up as his lawyer delivered opening statements, his eyes broke and his lips pulled back reflexively as the attorney referred to his client as someone without friends who was shown little care from loved ones throughout his life.",
    "At one point, prosecutors showed a photo of him on the lawn of the Michigan state Capitol in 2020 carrying a rifle, wearing a green flak jacket and floral Hawaiian shirt, a style commonly associated with the Boogaloo movement.",
    "Meanwhile, Harris, 24, a security guard and honorably discharged Marine, was drawn to the FBI informant “Dan” in May 2020 after joining the Wolverine Watchmen militia group online, Harris’ lawyer Julia Kelly told jurors.",
    "The group also mulled abandoning Whitmer — who prosecutors say was referred to as a \"tyrant b----\" by alleged ringleader Fox — in the middle of Lake Michigan as punishment for her leadership during the pandemic.",
    "Gibbons downplayed the significance of a June 2020 meeting in Dublin, Ohio, that prosecutors portrayed as an inciting moment when the kidnap plot crystallized around anger over COVID-19 restrictions.",
    "“He said the whole point is ‘we’re sending a message to them that if we can get her, we can get you.’”\nWhitmer, a Democrat, was the main target among a group that also discussed attacking Ohio Gov.",
    "Four men are standing trial on kidnapping conspiracy charges in a case that has focused national attention on violent extremism in Michigan and raised questions about overreaching by investigators.",
    "He attacked one informant, Robeson, accusing him of helping entrap the men by plying them with marijuana, arranging tactical training, participating in an attempt to surveil Whitmer’s cottage.",
    "Caserta found the Wolverine Watchmen in 2020 after becoming concerned about the “fabric of our country being stretched, if not torn, at that time,” his lawyer Michael Hills told jurors.",
    "The accused plotters are a mix of self-described patriots and militia members who prosecutors say were angered by restrictions imposed during the first months of the COVID-19 pandemic.",
    "“He doesn’t have a military background.”\nCaserta attended training and was present when Croft ranted about treason and using weapons to shoot airships out of the sky, Hills said.",
    "“The evidence will show the training was not to kidnap the governor.”\nGibbons started to suggest the training was organized by the FBI as part of a broader pattern of entrapment.",
    "Defense lawyers are intent on showing government officials induced members of the alleged plot to commit the crime and that members were not predisposed to kidnap the governor.",
    "Opening statements came 17 months after FBI agents said they thwarted a domestic terrorism plot that involved plans to hogtie Whitmer and use homemade bombs during the attack.",
    "Instead, Croft talks about \"crazy\" conspiracies and theories involving pyramids, electromagnetic pulses and flying chariots, about diverting rivers and redirecting light.",
    "Defense lawyers have said there was no plot and that their clients were merely using coarse language to voice complaints about the government's response to the pandemic.",
    "But there was no conspiracy.”\nGibbons blamed FBI informant Stephen Robeson for propping Fox up as the leader of the so-called Michigan Three Percent Patriot Militia.",
    "Prosecutors in October 2020 said FBI agents thwarted a plot to bomb a bridge near Whitmer's vacation home, kidnap the governor and have her stand trial for treason.",
    "\"They were going to break into the governor's home, kidnap her at gunpoint, hogtie her and take her away,\" Assistant U.S. Attorney Jonathan Roth told jurors.",
    "“The Boogaloo believes the country is broken, that politicians on both sides are at fault and should be targeted and attacked,” the prosecutor said.",
    "\"Wanna hang this mf'er too...\"\nSix men were charged in federal court while eight others were charged in state court, where their cases are pending.",
    "Gibbons also portrayed an FBI informant known as “Dan” as a predator who preyed on Fox, who was described as an impressionable misfit loner.",
    "Croft, 46, a trucker from Delaware helped launch the conspiracy in April 2020 in a recorded call to action, prosecutors said Wednesday.",
    "But before being dropped, Robeson wore a secret recording device while meeting with Croft and other members of the alleged conspiracy.",
    "Croft’s lawyer accused Robeson of selectively using the recording device, turning it on only after feeding drugs to Croft and others.",
    "\"These defendants were willing and eager, if not already preparing, to commit this crime long before law enforcement got involved.\"",
    "“And in their own words: create a war zone in Michigan.”\nRoth described the accused plotters as followers of the Boogaloo movement.",
    "Robeson has a long criminal record and was dropped as an informant last year and indicted after illegally buying a sniper rifle.",
    "“All it’s going to take is one state to burn out and hang its governor and then those dominos will start to fall,” Croft wrote.",
    "“My client was concerned about society and what was going on … and was looking to train,” Caserta’s lawyer Michael Hills said.",
    "The posts led to FBI agents targeting Croft three years later after learning about the Wolverine Watchmen, the lawyer said.",
    "Kidnapping Whitmer was one part of what plotters hoped would trigger a second Civil War, prosecutors told jurors Wednesday.",
    "Gretchen Whitmer offered contrasting narratives colliding in one of the nation's most important cases of violent extremism.",
    "Jonker initially decided not to let lawyers discuss entrapment during opening statements or during the government's case.",
    "The Detroit News\nGrand Rapids — Opening statements Wednesday in the trial of four men accused of plotting to kidnap Gov.",
    "On Wednesday, he wore a gray suit and large striped tie, the unruly beard replaced with a trimmed salt-and-pepper one.",
    "\"They knew it was crazy, stoned talk, and not a plan,\" Blanchard said, a mantra repeated throughout his statement.",
    "Six members of the alleged conspiracy were charged in federal court with kidnapping conspiracy in October 2020.",
    "Dan trained Fox and the other alleged plotters how to use firearms and conduct field exercises, Gibbons said.",
    "But Caserta did not agree to kidnap the governor, his lawyer said\n“None of that is my client,” Hills said.",
    "But he changed his mind Wednesday after all but Fox's lawyer had delivered an opening statement to jurors.",
    "Fox, dressed in a light gray button-down and stone-washed khakis, listened during the opening statements.",
    "“Adam Fox did not commit a crime in this case,” his lawyer, Christopher Gibbons, told jurors Wednesday.",
    "The judge decided to have defense lawyers and prosecutors return later Wednesday to address entrapment.",
    "She portrayed Harris as falling under the spell of “Dan,” the FBI informant, who posed as a war hero.",
    "Hosting meetings and training, and providing rides, is not entrapment, the prosecutor told jurors.",
    "“If the defendants were already willing to commit the crime, then it’s not entrapment,” Roth said.",
    "!,\" Croft wrote in one Facebook post, which also included an image of then-President Donald Trump.",
    "One rung above homeless, living in the basement of a Grand Rapids vacuum shop, Gibbons said.",
    "\"There was no plan, there was no agreement and there was no kidnapping,\" Blanchard said.",
    "“If he wanted to brush his teeth, he had to go to a Mexican restaurant,” Gibbons said.",
    "The recordings do not show Croft plotting to kidnap the governor, his lawyer said.",
    "Both of those actions warranted the FBI ending the investigation, Blanchard said.",
    "They’re not supposed to target people that they’re angry with,” Blanchard said.",
    "Mike DeWine, a Republican, along with a second Democrat, former Virginia Gov.",
    "“He has not done what the government has accused him of,” Kelly told jurors.",
    "“The FBI is supposed to protect us from dangerous criminals and terrorists.",
    "Eight others are facing charges in related cases pending in state courts.",
    "\"I say we hang everything currently governing us, they're all guilty!!",
    "Fox was not a leader of a militia or ringleader of a kidnapping plot.",
    "“They began plotting to kidnap the governor of Michigan,” Roth said.",
    "Testimony continues Thursday in federal court in Grand Rapids.",
    "“None of these guys knew how to do this stuff,” Gibbons said.",
    "Fox, 38, accepted that call to action, Roth told jurors.",
    "But Harris was not plotting to kidnap Whitmer, she said.",
    "But Chief U.S. District Judge Robert Jonker cut him off.",
    "Who wasn’t upset about COVID and COVID restrictions?",
    "“He trusted him, was drawn to him,” Kelly said.",
    "The trial is expected to last about six weeks.",
    "“There was no agreement,” Gibbons told jurors.",
    "“This is all parlor tricks,” Gibbons said.",
    "“There was a lot of anti-government talk.",
    "Ralph Northam, according to prosecutors.",
    "“There’s nobody in it,” Gibbons said.",
    "“It’s just Adam.”\nUntil July 2020.",
    "One member joined, Gibbons said.",
    "\"There was a lot of talk.\"",
    "“This was not just talk.\"",
    "There was no conspiracy.",
    "rsnell@detroitnews.com",
    "“There was no plan.",
    "An FBI informant.",
    "He was broke.",
    "Unemployed."
  ]
}