{
  "id": 3310,
  "mediaId": 2919,
  "date": "2022-03-17",
  "headline": "'Chaos': Here are several solutions to redistricting mess",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/8375769/2147483647/strip/true/crop/2048x1075+0+351/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbf%2Fa6%2F2909740f4e0d96a1c2e179699564%2Fvoting.jpeg",
  "link": "https://www.news5cleveland.com/news/politics/ohio-politics/chaos-here-are-several-solutions-to-redistricting-mess",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    0
  ],
  "sentences": [
    "“That's one problem, but the court also said even if the process had worked in a more effective way, even if the process had worked better, the actual map itself fails to comply with the partisan gerrymandering rules in the Ohio constitution.”\nThe Court said that the Republicans went too far to skew the maps in favor of their party, their 74-page document showed.",
    "“It's pretty clear that they, the legislative leadership, want to control as much of the redistricting process as it can and is prepared to give only as little as they think they can persuade a majority of the Supreme Court to accept,” Jonathan Entin, Case Western Reserve University law professor and expert in courts, constitutional law, said.",
    "I don't think that's the most sensible way to read the amendments, but the way they're written somebody could make a persuasive argument that the Redistricting Commission could do whatever it wants in a mid-decade.”\nThe congressional map is also an issue because there is a federal court case pending.",
    "“It's similar in that you've had the ball going back and forth, back and forth and eventually the Court said, ‘Okay, we're still not satisfied, but we got to get on with things now.’ It turns out that the court made that fourth ruling right before the composition of the court was about to change.",
    "So I don't think that that is a plausible option.”\nAnd what is likely to happen: The Republicans can persist\nThe GOP members can continue to try to convince the Court to approve their maps, by exhausting them enough to have the justices push the map debacle off their plate.",
    "Last month, the Supreme Court overturned a lower court ruling about the Alabama congressional map on the basis that we are now in the election year, the process is underway and it is not appropriate for federal courts to jump in and change the lines in the election year.",
    "It is possible that we could see some kind of parallel lawsuit about legislative districts.”\nSplit primary\nHaving a divided primary would raise a lot of questions and concerns, especially from LaRose, who previously told News 5 he would rather not have a split primary.",
    "“It should not come as a big surprise that the people in the Legislature, for example, are going to try to maximize their advantage when they draw the district maps.”\nJust because someone has the power to create a map only in their favor, doesn’t mean that they should.",
    "But I think at the end of the day, the court is likely to be reluctant to hold the commissioners in contempt, if only because the court is already badly split on the acceptability of the maps.”\nBeing held in contempt also doesn’t disqualify anyone from being in a race.",
    "Feds get involved\n“There is a real question about whether the federal court should even entertain that lawsuit.”\nThe U.S. Supreme Court refused to block GOP-backed maps that were adopted in Pennsylvania and North Carolina earlier in March.",
    "It is at least possible that we will have a four justice Republican majority, and it is likely that the fourth Republican justice will be more like the three who have been dissenting than like Chief Justice O'Connor.",
    "That's another reason why the court needs to find a way to get the commission to draw an acceptable map, whatever that winds up looking like.”\nAlso, the 2012 map can’t be used for this election.",
    "Four-year maps\nIf we can’t get bipartisan buy-in on the maps, then instead of having the maps good for 10 years, the Commission could decide on maps that would be good for only four years.",
    "“The majority of the court says that Senate President Huffman and Speaker Cupp have essentially hijacked the process and made the discussions something of a charade,” the professor said.",
    "That's a trade-off.”\nCourt could threaten Commission to behave\nThis didn’t seem to work last time, and it probably won’t again – even if the politicians end up behind bars or fined.",
    "“The goal here is to get a legally acceptable map, and the court may want to use the prospect of contempt as a way to encourage the commission to come up with an acceptable map.",
    "If we were to split the primary to have congressional and statewide positions on May 3 and state districts later, people may be confused about who they are voting for and when.",
    "In DeRolph v. State of Ohio, the Supreme Court ruled that the state system for financing elementary and secondary schools was unconstitutional under the Ohio Constitution.",
    "“It is quite possible that if the primary is delayed in whole or in part, that will get a lower turnout for whatever part of the primary is going to take place later on.",
    "of State Frank LaRose, Auditor Keith Faber, Senate President Matt Huffman, Co-Chair and House Speaker Bob Cupp, Co-Chair and Sen. Vernon Sykes and Rep.",
    "COLUMBUS, Ohio — Ohio still doesn't have the legislative maps that are essential to run an election, with 47 days until the scheduled May 3 primary.",
    "The Michigan Independent Citizens Redistricting Commission is made up of 13 registered voters randomly selected through an application process.",
    "The Court struck down the Republican-passed legislative maps, citing constitutional violations of favoritism to one party, or gerrymandering.",
    "At some point, you have the possibility that there might well be litigation down the road.”\nSo that brings us to our current standstill.",
    "Considering we already missed major 'Election Day checks' like creating ballots and testing machines, this would not be realistic.",
    "Of the 13 commissioners, four are Democratics, four are Republicans, and five do not affiliate with either major political party.",
    "“Even if it is easier than it used to be to vote by mail, people have a lot of other things, a lot of distractions,” he said.",
    "“The Legislative Redistricting Commission's provisions in the Ohio Constitution say explicitly, no court can draw the map.",
    "The distribution of people in Ohio has changed between the 2010 census, which was the basis for the 2012 map and today.",
    "“It can't happen because the federal constitution requires that the legislative branch be equal in population.",
    "And if that's the case now, the map has to be finalized way before the new court takes office on January ‘23.",
    "“Depending on how adamant the legislative leadership is, they might try to come up with some other mechanism.",
    "Solutions for the future\nOhio may need to look to our neighbors up North to actually pass legislative maps.",
    "The DeRolph decisions were all split decisions.”\nNow, let's think about where we are with redistricting.",
    "If one primary is in the spring and another is in the summer, there may be another problem, Entin said.",
    "The only one that would suffer is LaRose since he is supposed to be running an election, Entin said.",
    "There are no state or congressional districts, no ballots made and no clear direction of what to do.",
    "There's a little wiggle room, but basically, you've got to have equal population in each district.",
    "This game of back and forth between the ORC and the Court is having major consequences, he added.",
    "And the question is at what point do people decide ‘enough, we've got to get on it,’” Entin said.",
    "U.S. District Court Judge Algenon L. Marbley put a pause on that suit for the time being.",
    "A bipartisan majority on the Court has now rejected the district maps for the third time.",
    "“Redistricting is inherently political and the stakes are enormously high,” he said.",
    "“The Court gerrymandering rules that apply now may not apply to the mid-decade maps.",
    "The problems with that are that we would go through this process again mid-decade.",
    "The most recent versions of maps were rejected in a 4-3 decision Wednesday night.",
    "“We have this test of wills, and the question is ‘who will blink?’” Entin said.",
    "The third set of legislative maps has been rejected by the state Supreme Court.",
    "The Ohio Redistricting Commission (ORC) is made up of seven politicians: Gov.",
    "But after the fourth decision, the court said “we're finished,” Entin added.",
    "On Thursday, DeWine actually said this was the best option to move forward.",
    "The court said three more times that the system is still unconstitutional.",
    "While Ohio has seven politicians on the Commission, Michigan has zero.",
    "Republican voters have filed in federal court to choose maps for Ohio.",
    "However, the Ohio Supreme Court cites Huffman and Cupp as the leaders.",
    "pic.twitter.com/qWeO3dMKdf\n— Morgan Trau (@MorganTrau) March 17, 2022",
    "“We clearly have a political system that is not working very well.",
    "Getting into all of the scenarios, how about what might play out?",
    "Here is what could realistically happen for this election cycle.",
    "Work together\nThe Commission could create fair, bipartisan maps.",
    "Sen. Cecil Thomas (D-Avondale) is urging legislators to do this.",
    "The court has once again sent the maps back to the Commission.",
    "This has actually happened in Ohio in the mid-to-late 1990s.",
    "What can’t happen\nThe Court can’t legally make its own map.",
    "The issue went back to the Legislature three more times.",
    "Keep primary date and just work really quickly\n... Yeah.",
    "Here are the ways News 5 found to get us to primary day.",
    "It will cost taxpayers a significant amount of money.",
    "It has been... fun... here at the Ohio Statehouse.",
    "Also, things could get even more convoluted then.",
    "Just push it back until we get this figured out.",
    "Learn the possibilities at 6:15 p.m. on @WEWS.",
    "However, this doesn’t mean there are no cons.",
    "“We will have a new Chief Justice next year.",
    "So how do we have an election without maps?",
    "Delay the primary date\nSimple as that.",
    "It could also cause voter confusion.",
    "They passed their maps last year.",
    "Minority Leader C. Allison Russo.",
    "There are a number of options.",
    "They have until March 28.",
    "Well, we may be able to.",
    "THE ANSWER: We don’t.",
    "So what happens next?",
    "Mike DeWine, Sec.",
    "Now what?"
  ]
}