{
  "id": 3315,
  "mediaId": 2511,
  "date": "2022-03-17",
  "headline": "In US Midwest, communities gear up to help Ukrainians in need",
  "image": "https://www.aljazeera.com/wp-content/uploads/2022/03/Evgenia-Nemirovska-De-Santos-sifts-through-a-pile-of-donations-in-Cincinnati..jpg?resize=1200%2C630",
  "link": "https://www.aljazeera.com/news/2022/3/17/in-us-midwest-communities-gear-up-to-help-ukrainians-in-need",
  "mediaOutlet": "Al Jazeera",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Starr",
  "authorUrl": "https://www.aljazeera.com/author/stephen_starr_20133268537756230",
  "termIds": [
    0
  ],
  "sentences": [
    "“Any medical supplies.”\nLast Thursday, Nemirovska De Santos and a team of volunteers loaded more than 700kg of aid – socks, boots and radios for Ukrainian territorial defence members, as well as nappies and foodstuffs – into a truck that was then driven 1,025km (637 miles) east to New Jersey, where a Ukrainian shipping company’s headquarters is located.",
    "They can’t even take showers and keep themselves clean.”\nThousands of kilometres from the front lines of the war in Ukraine, Nemirovska De Santos is part of a growing legion of volunteers in Ohio, a Midwestern state home to about 43,000 people of Ukrainian heritage, that is stepping up to help with the fallout of the Russian invasion.",
    "“The first Ukrainian immigrants began moving to Ohio in the late 19th century and they ended up working in industry and manufacturing – in steel plants, for example,” said Marianna Klochko, president of the Ukrainian Cultural Association of Ohio, and a sociology professor at the Ohio State University in Columbus.",
    "With her own family members now strewn across Ukraine, and more than three million forced to flee to neighbouring countries, according to the United Nations, Nemirovska De Santos in Cincinnati is hoping the US will soon make it easier for displaced Ukrainians to escape the violence and seek refuge in the country.",
    "Americas Coverage Newsletter\n“We have such a vibrant Ukrainian community here in northeast Ohio that it would make sense to bring refugees here,” said Roman Fedkiw, committee chair of the Ukrainian Village district in Parma, who has family members in western Ukraine.",
    "Under the Trump administration, the admittance rate for refugees fell from nearly 85,000 people in 2016 to less than 12,000 in 2020, and the so-called “Muslim ban” saw residents from several Muslim-majority countries temporarily prohibited from entering the country.",
    "Charity organisations, refugee resettlement agencies, state agencies, local Ukrainian communities and other interested parties will convene at a local Ukrainian church hall to prepare for Ukrainian refugees that will be in need of resettlement in the United States.",
    "A native of Kyiv and now a volunteer with Cincy4Ukraine, a group assisting territorial defence volunteers fighting to hold off Russian forces across Ukraine, Nemirovska De Santos’s world has been turned upside down by the Russian invasion of her homeland.",
    "Cincinnati, Ohio, United States – Finding tourniquets, first aid kits, thermal underwear and socks is foremost in the mind of Cincinnati transplant Evgenia Nemirovska De Santos as she sits in an office space turned storage facility north of the US city.",
    "“Later, a second wave of people displaced during World War II relocated to the US, to Cleveland in particular.”\nIn 1989, the year the Berlin Wall fell, Cincinnati and Ukraine’s currently besieged city of Kharkiv were united as sister cities.",
    "“Within the United States, refugee resettlement had taken a pause and shrunk,” said Michael Murphy, programme manager for refugee resettlement at Catholic Social Services of the Miami Valley, in Dayton, Ohio.",
    "“While we do not yet know what role Ohio will play in helping these families, I want us to be prepared when the time does come,” DeWine said when he announced the summit last week.",
    "As a result, the US resettlement system, charged with processing thousands of refugee applications from at-risk people around the world every year, also slowed.",
    "On Thursday, a summit called by Governor Mike DeWine is taking place in Parma, a suburb of Cleveland that is home to about 4,000 Ukrainian immigrants.",
    "She said the deaths of Ukrainians has placed a significant psychological burden on her and others watching their country go up in flames from afar.",
    "“We need medical supplies,” she tells Al Jazeera, reading from a list of requested items sent to her from contacts in the Ukrainian capital.",
    "Today, the neighbouring state of Pennsylvania is home to the second-largest number of Ukrainian Americans at an estimated 122,000 people.",
    "“The dishes aren’t getting done, the laundry hasn’t been done for three weeks, my refrigerator is empty,” Nemirovska De Santos said.",
    "Resettlement challenges\nBut for those hoping to assist displaced Ukrainians seeking to reach safety in the US, challenges remain.",
    "“I know that I need to switch off, but it’s hard to do because they still need us as volunteers in foreign countries.”",
    "She says the day-to-day situation facing territorial defence volunteers she is in regular contact with is terrible.",
    "This would make them feel at home.”\nUkrainian immigrants have enjoyed a long and storied history in the Rust Belt.",
    "Nationwide, Americans of Ukrainian heritage number more than 1 million people, according to the US Census Bureau.",
    "“Now, it’s back in a space where it’s expanding back to its traditional numbers and services,” Murphy added.",
    "Still, those working in the resettlement sector believe the system is ready to get up and running again.",
    "While President Joe Biden has raised the refugee admissions cap, the system continues to face delays.",
    "For her, the past three weeks have been a nightmarish blur where everyday life has ceased to exist.",
    "Currently, residents of 32 European countries can travel to the US under a visa waiver.",
    "Refugee influx expected\nBut volunteers are not the only ones currently in crisis mode.",
    "“We are asking the White House to really speed up the immigration process,” she said.",
    "Ohio’s state government is gearing up to deal with an expected influx of refugees.",
    "“They are wearing sneakers in the cold; the conditions are freezing.",
    "It was then flown to Warsaw and taken over the border to Ukraine.",
    "“We have our churches, our banks, we have our Ukrainian schools.",
    "But Ukrainian nationals are not among them."
  ]
}