{
  "id": 3334,
  "mediaId": 3993,
  "date": "2022-03-15",
  "headline": "DeWine signs Ohio's constitutional carry bill",
  "image": "https://bearingarms.com/wp-content/uploads/2022/03/gun-belt-carry-holster-gun-holster-5538604-e1646333256206-1110x740.jpg",
  "link": "https://bearingarms.com/tomknighton/2022/03/15/constitutional-carry-21-n56393",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Knighton",
  "authorUrl": "https://bearingarms.com/author/tomknighton",
  "termIds": [
    0
  ],
  "sentences": [
    "No, what matters is that Ohioans will be able to carry a firearm without having to go to the state and ask, “Mother, may I?”\nIt’s a constitutionally protected right.",
    "After all, you can’t be turned down for such a permit for any reason, it’s just a way to make sure there’s sufficient infrastructure to support those protests.",
    "SB215 will also eliminate penalties for motorists who fail to proactively tell law enforcement about concealed handguns in their vehicles during traffic stops.",
    "DeWine for signing this critical bill that upholds the Second Amendment in Ohio, for the benefit of law-abiding citizens,” the lobbying arm of the NRA stated.",
    "Senate Bill 215 allows anyone aged 21 or older to carry a concealed firearm unless they are prohibited from possessing a gun under state or federal law.",
    "The decision by DeWine makes Ohio the 23rd constitutional carry state, according to the National Rifle Association’s Institute for Legislative Action.",
    "So while a lot of people in cities like Cleveland and Dayton may be displeased by this, they’ll ultimately reap the benefits of constitutional carry.",
    "It was weird because I sat down with Paul Lathrop of the Second Amendment Foundation Monday night for their daily video podcast, The Daily Bullet.",
    "Kemp in Georgia makes good on his promise to sign Georgia’s bill then fully half of the United States will be Constitutional Carry states.",
    "As we’ve seen over the last year, anti-gun cities like Chicago and Los Angeles have reported the highest homicide rates in years.",
    "However, drivers would still have to say whether they have a gun with them if an officer requests, according to cleveland.com.",
    "Mike DeWine on Monday signed a bill that allows people in the state to carry a concealed handgun without a permit.",
    "He’s been pushing his own gun control package for a while, though there have been no takers in the legislature.",
    "Despite that, though, it seems DeWine has moments, such as Monday when he signed constitutional carry into law.",
    "You just shouldn’t have to ask permission to enjoy it, yet that’s precisely what permitting requirements do.",
    "I guess it was fortunate we both said that he would, though I don’t think for a moment DeWine wanted to.",
    "Without the legislature voting to overturn it, it’s set to be the law for ages to come.",
    "Little did we know that just a short time before things kicked off, he already had.",
    "This is good news for people in Ohio, despite what the doomsayers like to claim.",
    "And those benefits are real, but even if they weren’t, it wouldn’t matter to me.",
    "Mike DeWine isn’t someone I would consider strong on Second Amendment issues.",
    "No other right has quite the same restrictions, nor would they be tolerated.",
    "Even requirements for permits to hold mass protests aren’t the same thing.",
    "Constitutional carry changes things so that’s not an issue any longer.",
    "They make people ask permission to exercise a constitutional right.",
    "Frankly, at this point, it doesn’t matter to the people of Ohio.",
    "Meanwhile, in constitutional carry Dallas, homicides went down.",
    "We talked about whether DeWine would sign this bill or not.",
    "But anyone can get one and get one pretty much that day.",
    "Now, if Indiana’s governor will sign their bill and Gov.",
    "Now, constitutional carry has been signed.",
    "Congratulations to the people of Ohio.",
    "Try that with a carry permit.",
    "“NRA thanks Gov.",
    "Ohio Gov.",
    "Ohio Gov."
  ]
}