{
  "id": 3426,
  "mediaId": 2702,
  "date": "2022-03-15",
  "headline": "Ohio governor signs permitless concealed carry bill",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/09/dewinemike_11062018_gettyimages.jpg?w=1280",
  "link": "https://thehill.com/homenews/state-watch/598243-ohio-governor-signs-permitless-carry-bill/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine (R) has signed legislation allowing residents to carry concealed firearms without a permit, the latest in a string of states to authorize what supporters of gun rights call “constitutional carry.”\nThe measure, approved by the state’s Republican-controlled legislature last month, will allow residents over the age of 21 to carry a weapon without undergoing training or a background check.",
    "“The brass ring has always been to eliminate the licensing mandate.”\nThe bill had been opposed by some members of law enforcement, who said it would contribute to the challenges of tackling rising violent crimes that involve firearms.",
    "I think that there will be people who carry weapons concealed for the purpose of being vigilantes.”\nThe new law still allows Ohio residents to obtain a concealed carry permit, but it no longer requires them to do so.",
    "“To vote for people to be able to concealed carry without a license, without any training, without any documentation, it makes it exponentially harder for law enforcement to prevent gun crimes,” McGuffey said.",
    "In an interview last week, a top law enforcement officer in Cincinnati, Hamilton County Sheriff Charmaine McGuffey, said the new law would contribute to the wave of violence.",
    "The previous law required anyone who wanted to carry a concealed weapon to undergo eight hours of training and a background check by law enforcement.",
    "“This is a day that will go down in history,” said Dean Rieck, executive director of the Buckeye Firearms Association, a pro-gun rights group.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Ohio is the 23rd state in the nation to allow people to carry concealed weapons without a permit.",
    "Nebraska’s state Senate is still considering a permitless carry measure of its own.",
    "Legislators in Indiana and Georgia are finalizing their own versions of the bill.",
    "Republican governors in both states are expected to sign those measures.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Kay Ivey (R) signed a similar law last week, and Texas Gov.",
    "DeWine announced he had signed the bill without comment.",
    "Greg Abbott (R) signed his state’s version last year.",
    "“It is going to promote lawlessness.",
    "Alabama Gov.",
    "Ohio Gov."
  ]
}