{
  "id": 3449,
  "mediaId": 2740,
  "date": "2022-03-18",
  "headline": "As Ohio redistricting remains in limbo, Republicans weigh impeachment of state supreme court chief",
  "image": "https://www.gannett-cdn.com/presto/2021/12/08/NCOD/b5765ed8-a0db-4459-8c4d-543093d2f9ed-Oral_Arguments_Redistricting_KWR_09.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/18/redistricting-ohio-republicans-impeach-chief-justice/7092411001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican Ohio lawmakers are considering impeaching the state supreme court's chief justice after she voted to reject legislative maps, the latest example of the ways state high courts have transformed into partisan battlegrounds during redistricting.",
    "Their decisions have been appealed all the way to the U.S. Supreme Court, where conservative justices have signaled their desire to weigh in later about the power of state courts to change state legislatures decisions on federal elections.",
    "Haley BeMiller, Jessie Balmert and Laura Bischoff are reporters for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Ohio Republicans weight impeachment\nAn email from a Republican state central committee member, obtained by USA TODAY Network Ohio, said an unnamed lawmaker disclosed that they would be filing an impeachment charge against O'Connor.",
    "But redistricting has shone a spotlight on the courts, underscoring the power they hold in influencing the national political landscape after the U.S. Supreme Court limited federal courts oversight of partisan gerrymandering.",
    "\"I don’t think we want to go down that pathway because we disagree with a decision by a court, because we disagree with a decision by an individual judge or justice – not a good idea.”\nHow does impeachment work?",
    "The latest decision – a rejection of statehouse maps – has left Ohio's May 3 primary in limbo, with the Ohio secretary of state directing local election boards to take district races off the ballot.",
    "O'Connor is seen as an independent voice on the court and sided with Democratic justices to throw out multiple sets of maps, arguing they did not comply with constitutional rules for redistricting.",
    "In Ohio, the court has been a target for those unhappy with its decisions to reject Republican mapmakers attempts to draw state legislative districts three times and congressional maps once.",
    "Even before their dockets began to fill with cases challenging new boundaries for congressional and statehouse districts, spending on races for state supreme court seats had exploded.",
    "A statehouse insider, who requested anonymity to discuss the situation candidly, also confirmed Republican lawmakers are mulling impeachment and may move forward in the coming days.",
    "Now, House Republicans are discussing whether to impeach Maureen O'Connor, the term-limited GOP chief justice who has joined Democrats in rejecting Republican-drawn maps.",
    "The court struck down the maps on Wednesday with O'Connor as the deciding vote, sending the Ohio Redistricting Commission back to the drawing board for the fourth time.",
    "A spokesperson for Speaker Bob Cupp, who served as an Ohio Supreme Court justice with O'Connor, did not immediately respond to a request for comment.",
    ":Voters get fewer choices as Democrats and Republicans dig partisan trenches in redistricting\n\"I don't know if it moves or not,\" the source said.",
    "Multiple House Republicans said there have been discussions about the matter, but it's unclear if any decisions have been made.",
    "Their charges include \"judicial arrogance,\" judicial incompetence and holding statutes unconstitutional and unenforceable.",
    "“No matter what we think of that (redistricting) opinion, this is an extraordinary measure to take,\" DeWine said Friday.",
    "Eight officials, all judges, have been impeached in Ohio, according to a memo from the Legislative Service Commission.",
    "A House Democrats spokesperson said lawmakers need to be focused solely on passing \"fair and constitutional maps.\"",
    "That's increasingly made her a target of fellow party members who contend she's shirking her responsibilities.",
    "It could come down to state supreme courts\nThe news comes to you:Sign up for the OnPolitics newsletter here.",
    "Justices Sharon Kennedy and Jennifer Brunner are running for chief justice in this year's election.",
    "\"It's time to impeach Maureen O'Connor now,\" Rep. Scott Wiggam, R-Wayne County, tweeted Thursday.",
    "The only judge to be convicted by the Senate was one impeached for being absent without leave.",
    "\"I don’t understand what the woman wants,\" said state Rep. Sara Carruthers, R-Hamilton.",
    "O'Connor, who cannot run again due to age limits, steps down from the court Dec. 31.",
    "Mike DeWine said Friday he does not support any effort to impeach the chief justice.",
    "She has served in statewide elected office longer than any woman in Ohio history.",
    "\"Judging by conversations I'm aware of, there is growing support for this move.",
    "Representation matters:Who will control Congress for the next 10 years?",
    "Impeachment would add fuel to an already heated redistricting process.",
    "O'Connor did not immediately return a message seeking comment.",
    "A ruling on the latest congressional maps is expected any day.",
    "I don't know if there's enough.\"",
    "Contributing: Rick Rouan.",
    "America divided?",
    "Gov."
  ]
}