{
  "id": 3528,
  "mediaId": 2752,
  "date": "2022-03-16",
  "headline": "Chinese Tall Teak Pedestal Table! Tabs, Wed., March 16, 2022",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU0MjUyOC9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTY2NzY3MDIyOX0.FmapI_Skf3e9lJ-EWSe8Fr2eSHmknvASoOYOeaZk2nM/img.gif?width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.wonkette.com/tabs-wed-march-16-2022",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Schoenkopf",
  "authorUrl": "https://www.wonkette.com/u/rebecca_schoenkopf",
  "termIds": [
    0
  ],
  "sentences": [
    "(Mother Jones)\nNo, Trump didn't break Democrats' superduperdupermajority of Black American voters; those were bad exit polls, even though there is at least one asshole Black guy who really digs Trump's style, and it is that poor little son of Herschel Walker who keeps making us feel so bad for him everytime he opens his mouth.",
    "When the chair of the Senate Energy and Natural Resources Committee (Joe Manchin) appears to think that electric-vehicle drivers have to wait in line for a new battery every time they use up their charge, the expectations of achieving anything useful on going green must be severely downgraded.",
    "Mike DeWine, whose staff used to call him up and beg him to be less publicly gay) mom Melodye once explained to me that she absolutely UNDERSTOOD that it was Republicans' fault Democrats couldn't get anything done, so she was voting Republican so they could get something done.",
    "Montana Health and Community guy says the state decided not to take $36 million from the feds to feed hungry families and kids just for this summer because it's \"burdensome to administer\" and, not kidding, kids can eat at school.",
    "— Free link at Washington Post\nHaha, Manchin and Sinema won't let us tax the rich for the Child Tax Credit, while they talk about taxing the rich, haha :) (Popular Info)\nWindfall profits tax: a high gas prices inflation rebate?",
    "There’s a certain grimness to writing about U.S. public policy these days, in that you have to couch any prescriptions within the realities of our multi-veto-point system and a status quo preserved in amber.",
    "(Washingtonian)\nThis lady at Scientific American says Daylight Saving Time fucks up our sleep actually, with not enough light to wake us and too much when our body is like FUCK YALL IM TIRED.",
    "(Start School Later)\nDok, what is the fallacy for \"every one of your logics directly contradicts your other logics oh it is a Joe Manchin okay.\"",
    "Unstated at this time, since there were Democrats present, was \"wouldn't want anything to get too good for people when a Democrat's president.\"",
    "— The American Prospect\nRobert Reich tells you a thing (but you knew it already, it's really for the youngs who are starting out).",
    "— Reuters\nWe went to permanent Daylight Saving Time under Nixon, and fickle American bitches loved it until they haaaaated it.",
    "(A one percent decrease in energy usage though meant \"20,000-30,000 tons of coal not being burned each day.\"",
    "Regardless of your current COMMENT FIGHTIN on permanent Daylight Saving Time, should we start school later?",
    "Joe Manchin doesn't think America should help electric vehicles for \"many reasons that are a Joe Manchin.\"",
    "(In Montana, it's light till 10 or 11 at night, good luck getting six-year-old heiresses to sleep ever.)",
    "You know what that means: Dance, drink, eat feasts, and give gifts to the poor, ALL MY FAVORITE THINGS!",
    "Editor-in-chief of Insider makes $600,000 a year, and four dozen top editors there make like $300,000.",
    "— Virginia Mercury\nHow fucking scary for these families of trans kids in Texas, how fucking terrible.",
    "Brennan Center's Theodore R. Johnson explains the numbers and the hell no at the Bulwark.",
    "Here's Melodye, don't believe that crazy still picture at the beginning, she's gorgeous.",
    "It didn't even last a full year until Bob Dole (\"BOB DOLE\") mercy-killed it.",
    "(Daily Montanan)\nVirginia almost passed a gun bill but then haha it didn't!",
    "What's so galling is that my friend Skeith's (gay nephew of Ohio Gov.",
    "\"US Senate Approves Bill to Make Daylight Saving Time Permanent.\"",
    "(Wik)\nCongress does something, anything (but okay, good yay).",
    "(Gawker)\nKeep Wonkette going forever please, if you are able!",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "Standard Time may not be sexy, but it might be correct.",
    "Regardless, Dayen's gonna make the case for it anyway.",
    "Gonna go have a liedown, please send money.",
    "It is like David Dayen is reading my brain!",
    "She knew they were holding hostages!",
    "How often would you like to donate?",
    "So she elected them, for hostages.",
    "Which does seem relevant.)",
    "Or a Joe Manchin cat toy?",
    "HEY It's Purim!",
    "In the summer.",
    "NO DISSENTS.",
    "Yes."
  ]
}