{
  "id": 3541,
  "mediaId": 2672,
  "date": "2022-03-18",
  "headline": "Ohio Republicans Would Rather Impeach a Judge than Stop Cheating at Elections",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/Chief-Justice-Maureen-OConnor.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/ohio-republicans-impeach-judge-gerrymander-1323657/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    1688,
    2285,
    2928,
    878,
    994
  ],
  "sentences": [
    "An impeachment of O’Connor would not only signal to Ohioans that Republicans will happily thumb their nose at fair elections, but it could also inspire members of the GOP to follow suit in other states such as North Carolina, where the state’s highest court also struck down GOP-friendly maps.",
    "Now, rather than take the court’s advice and “retain an independent map drawer…to draft a plan through a transparent process,” some Republican legislators are discussing invoking their power to impeach the judge, who will step down at the end of the year due to the court’s age limits.",
    "Shortly after the Ohio Supreme Court ruled — for the third time — that GOP-approved legislative maps unconstitutionally favored Republicans over Democrats, Republicans in the state house are considering impeaching the court’s chief justice, The Columbus Dispatch reported Friday.",
    "“I don’t think we want to go down that pathway because we disagree with a decision by a court, because we disagree with a decision by an individual judge or justice – not a good idea.”\nAn impeachment would require the support of at least 50 of the state’s 99 representatives.",
    "“The evidence shows that the individuals who controlled the map-drawing process exercised that control with the overriding intent to maintain as much of an advantage as possible for members of their political party,” the majority’s opinion read.",
    "O’Connor, a Republican, also sided with the court’s liberal wing earlier this year in tossing out Republican-backed congressional maps after deciding that districts were gerrymandered to the GOP’s advantage.",
    "According to an email from a Republican state central committee member that was obtained by the Dispatch, an unnamed lawmaker intends onto file an impeachment charge against the judge.",
    "Chief Justice Maureen O’Connor cast the deciding vote earlier this week in a 4-3 ruling that found that the maps violated redistricting rules voters approved in 2015.",
    "“No matter what we think of that (redistricting) opinion, this is an extraordinary measure to take,” DeWine said Friday, according to the Dispatch.",
    "Mike DeWine, a Republican who serves on the GOP-controlled Ohio Redistricting Commission, said he opposes such a move.",
    "I don’t know if there’s enough.”\nRep. Scott Wiggam on Thursday made clear where he stands.",
    "“Judging by conversations I’m aware of, there is growing support for this move.",
    "A statehouse insider told the outlet that this could come in the next few days.",
    "A vote to convict would require two-thirds of the vote in the Senate.",
    "“It’s time to impeach Maureen O’Connor now,” he wrote on Twitter.",
    "— Rep. Scott Wiggam (@Scott_Wiggam) March 17, 2022\nBut Gov.",
    "“I don’t know if it moves or not,” this person said.",
    "(Republicans in that body have 25 of 33 seats.)",
    "It's time to impeach Maureen O'Connor now.",
    "(64 of them are Republicans.)"
  ]
}