{
  "id": 3577,
  "mediaId": 2741,
  "date": "2022-03-15",
  "headline": "Ohio's Republican Governor Just Made It Even Easier to Carry a Concealed Gun",
  "image": "https://media.vanityfair.com/photos/6230b93b6df0fdac83f862c4/16:9/w_1280,c_limit/1058491032",
  "link": "https://www.vanityfair.com/news/2022/03/ohio-governor-makes-it-even-easier-to-carry-concealed-gun",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    1664,
    1688,
    2201,
    3975,
    4208,
    878,
    5212,
    5348
  ],
  "sentences": [
    "?Images of Russia’s Attack on Ukraine\n—Trump Calls Putin’s Ukraine Moves “Genius” Because He Hates Democracy\n— The Zucker-Cuomo Saga Just Got Even Messier\n— Why Biden Wanted Americans to Know Exactly What Putin Was Planning\n— It’s Been a Hell of a Week for Letitia James\n— “If Ukraine Matters, Tell Us Why”: Joe Biden Is Talking to Everyone Except the American People\n— Republicans on Russia Crisis: It’s Biden’s Fault\n— Thieves in the Night: A Vast Burglary Ring From Chile Has Been Targeting Wealthy U.S.",
    "“Today,” Texas Governor Greg Abbott said last year as he signed a law eliminating background checks and training requirements, “I signed documents that instilled freedom in the Lone Star State.”\n“This is a day that will go down in history,” Dean Rieck, executive director of the Buckeye Firearms Association, said in a statement, describing the end of the licensing mandate as a “brass ring” his group has worked toward.",
    "An American Journal of Public Health study, for instance, concluded that similarly relaxed gun regulations were “associated with significantly higher rates of total, firearm-related, and handgun-related homicide.” Under “shall issue” laws, the study found, the homicide rate was up 6.5%; firearm homicide rates were up 8.6%; and handgun homicide rates went up 10.6%.",
    "“Republicans have made it crystal clear that they value the approval of the gun lobby more than the lives of Ohioans and the police officers who protect our communities every day.”\nIt’s not just Democrats, routinely caricatured by their counterparts as wanting to leave law-abiding Americans vulnerable to violent criminals, who oppose these permitless carry laws.",
    "“Removing these responsible and reasonable precautions compromises the safety and security of our communities and law enforcement,” Democratic State Representative Allison Russo, the Ohio House minority leader, said in a statement after DeWine approved Senate Bill 215.",
    "Ohio's Mike DeWine became the latest GOP governor to dramatically roll back his state’s gun laws Monday when he signed a bill allowing all Ohioans 21 and older, who can legally purchase a gun, to carry a concealed firearm without a permit, training or background check.",
    "“This is a great moment for Ohio and for those who wish to more fully exercise their Constitutional right to keep and bear arms.”\nOhio's law comes just weeks after President Joe Biden cited gun control as a policy area ripe for bipartisanship.",
    "It was a gift to pro-gun groups, and may help shore up his support on the right with only weeks to go until he faces a gubernatorial primary challenge from a pair of Republican challengers who have aligned themselves with Donald Trump.",
    "DeWine for signing this important piece of legislation that protects the Second Amendment rights of all law-abiding Buckeyes,” Jason Ouimet, executive director of the NRA’s Institute for Legislative Action, said in a statement Monday.",
    "“Legislators don’t want to hear the concerns of the men and women who keep your family safe,” Fraternal Order of Police of Ohio President Gary Wolske wrote in a December op-ed, urging lawmakers and DeWine to reject SB215.",
    "Several of the states Ohio joins have enacted their permitless carry laws in the last year: Versions of the legislation took effect in Tennessee, Wyoming, and Iowa last July, and in Texas last September.",
    "“My administration stands with those working to end this epidemic of gun violence,” Biden said in February, marking the anniversary of the 2017 Sandy Hook school shooting with a call for gun reform.",
    "Indeed, from Texas to Ohio, police groups have expressed disappointment in the measures, arguing that such laws threaten the safety of everyday citizens and cops alike.",
    "DeWine’s signature makes Ohio the 23rd state to implement a law allowing permitless carry — or “constitutional carry,” as proponents of the rollbacks term them.",
    "It also underscores the emptiness of the right's “law and order” rhetoric — and just how far Republican-led states are from accepting any gun control measures.",
    "As the Ohio Capital Journal’s Jake Zuckerman reported Tuesday, studies have linked such laws to an increase in gun murders and violent crime.",
    "Gun deaths in Ohio have already increased recently, with deaths from firearms in 2021 higher in the state than almost any other on record.",
    "“They aren’t interested in the balance between public safety and individual freedom.” Republican state lawmakers and DeWine didn’t listen.",
    "But we can come together to fulfill the first responsibility of our government and our democracy: to keep each other safe.",
    "For Parkland, for all those we’ve lost, and for all those left behind, it is time to uphold that solemn obligation.\"",
    "Advocates for the loosened restrictions invoke individual liberties in their support for the rule changes.",
    "Households\n— Watergate’s Central Mystery: Why Did Nixon’s Team Order the Break-In in the First Place?",
    "It’s many in the law enforcement groups that Republicans have made a public show of backing.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "Under the upcoming rollback, advocates warn the trends could get worse.",
    "— From the Archive: Russia’s Dark Master\n— Not a subscriber?",
    "It looks like we're experiencing playback issues.",
    "“We can never bring back those we’ve lost.",
    "The new law goes into effect in June.",
    "“The NRA commends Gov.",
    "Our bad!",
    "— ?"
  ]
}