{
  "id": 3578,
  "mediaId": 2537,
  "date": "2022-03-10",
  "headline": "Ohio Politics Explained podcast: DeWine declines debates, Democrats try to delay primary",
  "image": "https://www.gannett-cdn.com/presto/2021/07/09/NCOD/adf2cc84-11e1-4542-a809-373cd3f39f17-Bob_Cupp.JPG?crop=3941,2217,x0,y200&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/10/ohio-politics-explained-podcast-dewine-declines-debates-democrats-block-ballots/9452691002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    1688,
    2177,
    4526,
    205,
    300,
    305,
    994,
    5212
  ],
  "sentences": [
    "House Democrats refused to support the bill, saying the redistricting process has been a joke and the primary needs to move because the Supreme Court could still reject legislative or Congressional district maps.",
    "3) Home sweet home rule\nOhio's local governments have long had a bone to pick with their counterparts in the state legislature over the ways lawmakers restrict what cities can and cannot do.",
    "Mike DeWine declined a primary debate, Democrats tried to push the May primary back and Jane Timken continued her attempts to unite all sides of the Republican Party.",
    "DeWine's campaign said in a statement that he's already \"the most publicly accessible Governor in Ohio history,\" and Ohioans \"know where he stands on the issues.\"",
    "The USA TODAY Network Ohio Bureau serves The Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "1) Overseas ballot chaos\nMoving the return date for May primary ballots coming from overseas Ohioans caused a little bit of chaos at the statehouse this week.",
    "If the Ohio Supreme Court rejects the Congressional or legislative maps, election officials won't have enough time to print ballots.",
    "The Ohio Municipal League has a tally of 17 laws passed since 2003, including a ban on plastic bags, gun laws and red light cameras.",
    "Republicans managed to get the deadline shifted through a procedural maneuver, but that doesn't mean the May 3 primary is for sure.",
    "It's a podcast from the USA TODAY Network Ohio Bureau where we catch you up on the state's political news in 15 minutes or less.",
    "A poll from Emerson College found 38% of GOP voters said the endorsement made them less likely to support Timken.",
    "Mike DeWine turned down the opportunity to debate his three opponents in the Republican primary for governor.",
    "The Ohio Debate Commission says the debate will go on as scheduled for March 29 at Central State University.",
    "4) Jane Timken's balancing act\nThe former Republican Party Chair is running to be Ohio's next U.S.",
    "Listen to \"Ohio Politics Explained\" on Spotify, Apple, Google Podcasts and TuneIn Radio.",
    "Former President Donald Trump has not endorsed any of the candidates yet in the race.",
    "We break down what it all means on this week's episode of Ohio Politics Explained.",
    "It was a win for the Timken campaign, but not as big of one as you might think.",
    "The episode is also available by clicking the link at the top of the article.",
    "Recently, she scored the endorsement of the seat's current occupant, Sen.",
    "He had a comfortable lead over his opponents in a recent Fox News poll.",
    "This week, host Anna Staver was joined by reporter Mary Jane Sanese.",
    "The governor is also the front runner.",
    "2) DeWine declines debate\nOhio Gov.",
    "Senator in a crowded primary field.",
    "Rob Portman.",
    "Ohio Gov."
  ]
}