{
  "id": 3599,
  "mediaId": 2537,
  "date": "2022-03-13",
  "headline": "Two years after COVID-19 pandemic began, Dr. Amy Acton reflects on her place in history",
  "image": "https://www.gannett-cdn.com/presto/2022/02/22/NCOD/ed08b743-81c8-49b9-9ce8-239506356831-01_Amy_Acton_CLH019.jpg?crop=1999,1125,x0,y205?width=1200",
  "link": "https://www.dispatch.com/in-depth/opinion/2022/03/13/amy-acton-ohio-usa-today-women-of-the-year/6844804001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I'm still fighting the same battle, which is creating the conditions in which we can all flourish and lead flourishing lives so I'm trying to figure out what is the best way to keep fighting that fight.",
    "It's when you hit the wall that you're forced to think about possibilities outside the box, wake up to some blind sides in yourself, maybe, and inevitably right in it is the next great wonder.",
    "I'm trying desperately to be mindful and learn some mindfulness but if you're like me and you're a little squirmy as I've proven to be (then) walking and moving helps.",
    "In the 20 months since leaving her government post, Acton briefly returned to work at a Columbus nonprofit organization and considered running for U.S. Senate.",
    "I've said before, you know, I had a rough childhood and one of the ways I got through it was reading a book and taking a book home from the library every day.",
    "It was a moment that passed quickly but helped catapult Acton from a relatively obscure cabinet position into something of a folk hero throughout the state.",
    "The annual program is a continuation of Women of the Century, a 2020 project that commemorated the 100th anniversary of women gaining the right to vote.",
    "It was time she set aside for herself to reflect and prepare for the day ahead of a 6 a.m. call with hospital leaders and a 7 a.m. meeting with Gov.",
    "Former director of the Ohio Department of Health, and USA TODAY's Women of Year honoree from Ohio, reflects on the early days of the COVID pandemic.",
    "Dr. Amy Acton is one of USA TODAY’s Women of the Year, a recognition of women across the country who have made a significant impact.",
    "Acton, the then-director of the Ohio Department of Health, would often set her alarm for 4 a.m. in the early days of the pandemic.",
    "That was a fraction of Acton's morning as the coronavirus turned everyone's lives, including Acton's, upside down.",
    "There's a lot that's been disrupted and I don't want to make light of any of the ugly parts that I also witnessed.",
    "Hours before most Ohioans would wake up and start their day two years ago, Dr. Amy Acton's had already begun.",
    "It seems like a lot of the people that I've very much admired, have faced a lot of adversity but keep going.",
    "My favorite book I always say is \"Charlotte's Web\" and so you know, do you say Fern paved the way for you?",
    "He's like the least judgmental person I know and day in and day out makes good things happen for kids.",
    "I kept saying, it's shutting us down but it's also opening us up right in the middle of this crisis.",
    "I can't just go back into being like the same old person that I thought I was before this happened.",
    "Inevitably, what I found is the people that I admire have these highs and lows that we talk about.",
    "I definitely want to look (problems) in the eye and I think we could do a lot more to solve them.",
    "During a March 22 news conference, Acton paused, looked at the camera and said \"I am not afraid.",
    "Like many people trying to move on from the pandemic, she's still not sure what's next for her.",
    "It's been very hard to know myself because this obviously was a lot to go through personally.",
    "…\nThere's not one person who paved the way for me … there have been authors that inspired me.",
    "In the afternoon, Acton would appear alongside DeWine on live TV from the Ohio Statehouse.",
    "In the meantime, she's been named the USA TODAY’s Women of the Year honoree from Ohio.",
    "\"Determination was exactly what I felt,\" Acton said recently, reflecting on that day.",
    "He's a school teacher, he taught first grade for 16 years and many grades as a coach.",
    "She'd often try to reassure Ohioans about the danger and uncertainty of COVID-19.",
    "They took my last name, Acton, and she turned it into \"Acton love, not hate.\"",
    "I'm right now trying to figure out how have I changed from this experience?",
    "So, getting out in nature was life saving for me (during the pandemic).",
    "The happiest moments I've had were moments when all ships were rising.",
    "The following conversation has been edited and condensed for clarity.",
    "So certainly, during the pandemic, I felt a great pride in Ohioans.",
    "I am a doctor, and I am a mom and I can't help but want to unite.",
    "The good and the bad are kind of all parts of the same lessons.",
    "\"But a moment later, I might feel fear or lost or unsure.\"",
    "Meet this year’s honorees at womenoftheyear.usatoday.com.",
    "We're going to have a lot to learn when this is over.",
    "I hope to be part of the healing as we go forward.",
    "I don't know yet exactly what form that will take.",
    "What was your proudest moment as health director?",
    "We can't fix all the things we see in the world.",
    "There was a sign that a mom did with her sons.",
    "What people saw was not a politician clearly.",
    "But the love was far greater than the hate.",
    "I think we can raise the bar a lot higher.",
    "So I think that's a lot of what drives me.",
    "There's no one person that I look up to.",
    "I'm still a bit smitten by my husband.",
    "I do things when I really do get low.",
    "A great thing for me has been nature.",
    "That became sort of a mantra for us.",
    "There's not (just) one proud moment.",
    "I saw this with the pandemic too.",
    "mfilby@dispatch.com\n@MaxFilby",
    "I am determined.\"",
    "Mike DeWine."
  ]
}