{
  "id": 3780,
  "mediaId": 2679,
  "date": "2022-02-28",
  "headline": "Putin’s critics call for boycotts of Russian vodka",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/putins-critics-call-for-boycotts-of-russian-vodka/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Azi Paybarah",
  "authorUrl": "https://www.seattletimes.com/author/azi-paybarah/",
  "termIds": [
    0
  ],
  "sentences": [
    "And Sen. Tom Cotton, R-Ark., wrote on Twitter, “Dump all the Russian vodka and, alongside ammo and missiles, send the empty bottles to Ukraine to use for Molotov cocktails.”\nThe Liquor Control Board of Ontario, Canada’s most populated province, announced Friday that it would remove “all products produced in Russia” from its more than 600 stores.",
    "More about Russia’s war on Ukraine\nLive updates for Saturday, April 23\nUkraine: Russians shift elite units to the new battleground\nRussia’s military paid a high price for ‘victory’ in Mariupol\nOne Ukrainian war casualty: The world’s largest airplane\nHackers claim to target Russian institutions in barrage of cyberattacks and leaks\nU.S.",
    "But while 76.9 million 9-liter cases of vodka were sold in the United States in 2020 — generating nearly $7 billion in revenue for distillers, according to the Distilled Spirits Council of the United States, an industry trade group — Russia’s share of the market isn’t as large as popular imagination may suggest.",
    "Vodka has a long history in Russian culture, with The New York Times once describing it as “an inseparable part of Russian social life.” Colorless and odorless, it can be combined with countless types of mixers to make a wide array of concoctions.",
    "In 2003, for example, France’s opposition to the U.S.-led military action in Iraq led some American politicians to boycott French wine and try to rename french fries as “freedom fries” (even though the dish probably originated in Belgium).",
    "Chris Sununu, a Republican, announced Saturday the removal of “Russian-made and Russian-branded spirits from our liquor and wine outlets until further notice.” In Ohio, where the state contracts with private businesses to sell liquor, Gov.",
    "L. Louise Lucas, a top Democrat in the Virginia state Senate, is calling for “the removal of all Russian vodka and any other Russian products” from Virginia’s nearly 400 state-run Alcoholic Beverage Control Authority stores.",
    "Lawmakers want to set up field hospitals for Ukraine\nHow you can help the people of Ukraine\nAdvertising\n Skip AdSkip AdSkip Ad\nBoycotts of highly visible imports during times of conflict are nothing new.",
    "Vodka, a drink that was popularized in the West by James Bond and that has long been one of Russia’s most visible exports, is the target of international anger over the Russian invasion of Ukraine.",
    "Russia accounted for a little more than 1% of the dollar amount of vodka imported into the U.S. in 2017, Thrillist reported, citing data from the Distilled Spirits Council of the United States.",
    "France — whose vodkas include Grey Goose, Cîroc, Gallant and MontBlanc — accounted for about 39% of total vodka import value, the most of any country, Thrillist reported.",
    "In Pennsylvania, The Philadelphia Inquirer reported Saturday, “true Russian brands are hard to find.”\nThis story was originally published at nytimes.com.",
    "That versatility helped it take hold in the United States market, leading to a fierce competition among vodka makers from various countries.",
    "Mike DeWine, also a Republican, announced a halt to state purchases and sales of Russian Standard Vodka.",
    "Similar removals were underway in the provinces of Manitoba and Newfoundland, Reuters reported.",
    "The other top importers were the Netherlands (17%), Latvia (10%), Britain (5%) and Poland (5%).",
    "And just as in earlier efforts, boycotting Russian vodka may be more symbolic than strategic.",
    "In New Hampshire, where liquor and wine are sold through state-run stores, Gov.",
    "Sweden, with vodkas like Absolut and DQ, accounted for about 18%.",
    "Read it here."
  ]
}