{
  "id": 3806,
  "mediaId": 2537,
  "date": "2022-02-25",
  "headline": "Ohio Supreme Court postpones contempt hearing with Gov. DeWine, secretary of state, others",
  "image": "https://www.gannett-cdn.com/presto/2020/12/14/NCOD/68d479cd-97b4-42d0-85fa-1be6b83d9865-ceb_electoral_college_JB_16.JPG?crop=3088,1737,x0,y890&width=3088&height=1737&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/02/25/ohio-supreme-court-postpones-contempt-hearing-against-governor-mike-dewine/6945245001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    1688,
    2928,
    3212,
    994,
    5212
  ],
  "sentences": [
    "The seven members of the Ohio Redistricting Commission had been scheduled to appear before the state's highest court Tuesday morning as part of a hearing to determine whether to hold them in contempt.",
    "Anna Staver is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Mike DeWine and the other six officials drawing the state's legislative maps won't have to explain why they violated the Supreme Court's order.",
    "The commission failed to meet the court's Feb. 17 deadline for drawing its third set of maps for the state House and Senate districts.",
    "In addition to the postponement, the court issued a schedule for those who want to object to the third set of maps.",
    "But on Friday afternoon, Chief Justice Maureen O'Connor postponed the hearing without setting a new date.",
    "State Auditor Keith Faber was the only Republican to vote against this iteration.",
    "The plaintiffs must file their objections by 9 a.m. Monday.",
    "But the panel passed a new set Thursday on a 4-3 vote.",
    "The commission has until Thursday to respond.",
    "At least not yet.",
    "Ohio Gov."
  ]
}