{
  "id": 3831,
  "mediaId": 2679,
  "date": "2022-02-25",
  "headline": "As maps fall, GOP tries to neutralize state supreme courts",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/republicans-eye-state-courts-as-next-political-battlegrounds/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NICHOLAS RICCARDI",
  "authorUrl": "https://www.seattletimes.com/author/nicholas-riccardi/",
  "termIds": [
    1627,
    305,
    725,
    878,
    995,
    996,
    4942
  ],
  "sentences": [
    "Advertising\n Skip AdSkip AdSkip Ad\nThe GOP’s frustration with state courts escalated this week after the Democratic-majority Pennsylvania Supreme Court on Wednesday rejected the recommendations of a lower court to adopt a GOP-drawn map that reduced the number of Democratic-leaning House seats, despite the fact that Democrats largely represent the areas where the state’s population is growing.",
    "Most Read Nation & World Stories\nMichael Li, a redistricting expert with the Brennan Center for Justice in New York, warned that state courts are becoming increasingly pivotal political and electoral battlegrounds as the conservative majority on the U.S. Supreme Court rolls back rights guaranteed by prior court majorities.",
    "They point to the organization’s spending in North Carolina’s 2018 supreme court race, where the campaign of Democrat Anita Earls, now the decisive vote on the bench, received $5,200 from NDRC and the group donated another $250,000 to the state Democratic Party, which then gave $199,000 to Earls’ campaign.",
    "“But if you want your House districts to be determined in fair districts, you need to pay attention to your elected Supreme Courts.”\nChristie argued that Democratic groups like the NDRC that focus on electing Democratic judges in the 22 states with high court elections are part of the problem.",
    "Republicans were particularly incensed in North Carolina, where the Democratic majority on the state court blocked a map drawn by the GOP-controlled state legislature as being illegally tilted toward one party, and on Wednesday approved one with three fewer Republican-dominated House seats.",
    "DENVER (AP) — Repeatedly stymied by local courts in their efforts to draw maps that make it easier for their party to win elections, Republicans are trying to neutralize the ability of state supreme courts to interfere in the politically-charged redistricting process.",
    "On Friday afternoon, Republican lawmakers in North Carolina asked the U.S. Supreme Court to restore their old map, which would have effectively given them 10 of the state’s 14 House seats, and stop state courts from redrawing legislative maps.",
    "The GOP said it may sue to overturn the new North Carolina maps in federal court, arguing the state courts are infringing on federal control of elections or are giving Black voters inappropriate weight in their line-drawing decisions.",
    "The Republican chief justice of the Ohio Supreme Court, for instance, joined three Democrats to repeatedly throw out maps drawn by the GOP-controlled state legislature and redistricting commission as illegal partisan gerrymanders.",
    "“The top of the ticket where you have a governor’s race, Senate race, are important,” Chris Christie, the former New Jersey governor who leads the National Republican Redistricting Trust, told reporters this week.",
    "Pennsylvania lawmakers have proposed impeachment or otherwise limiting the court’s power, and one state senator this week introduced a bill forbidding it from drawing new maps that last more than two years.",
    "“If a redistricting process more violative of the U.S. Constitution exists, it is hard to imagine it,” the GOP lawmakers wrote in their appeal to the Supreme Court, where conservatives have a 6-3 majority.",
    "He cited a series of recent rulings that weakened the Voting Rights Act as well as the court’s upcoming abortion case that could overturn the landmark Roe v. Wade that legalized the procedure nationally.",
    "“It could be a huge case, but then again it may not be the case the justices want to use to resolve this.”\nThe GOP also wants to use old-fashioned political tools to deal with its state court problem.",
    "Legislatures typically control the process and can contort the lines to scoop up as many of their party’s voters as possible in as many districts as they can draw, a process known as gerrymandering.",
    "That is similar to a legal argument that the GOP made in the days after the 2020 presidential election, when their lawyers tried to limit the counting of late-arriving mail ballots in Pennsylvania.",
    "But this cycle has fueled intensity in the state courts because the conservative majority on the U.S. Supreme Court ruled in 2019 that federal courts can’t rule on partisan gerrymandering cases.",
    "The appeal and greater focus on state supreme court races come as state courts are playing an increasingly high-profile role in the hyper-partisan, once-a-decade redrawing of legislative lines.",
    "Advertising\n Skip AdSkip AdSkip Ad\nBut it also intends to compete in the supreme court election this fall, when two of the Democratic justices who comprise a 4-3 majority are up for reelection.",
    "With most large states besides GOP-controlled Florida done with their maps, the party has kept about even with Republicans even though the GOP controls the line-drawing process in more states.",
    "Advertising\n Skip Ad\n“We are winning not because of the political natures of the supreme courts,” said Kelly Ward Burton, executive director of the National Democratic Redistricting Coalition.",
    "But the Republican state legislature has been trying to constrain the court’s power since it ruled in 2018 that the Legislature illegally gerrymandered last decade’s map to benefit the GOP.",
    "“People are recognizing that we’re in a different world now.”\n___\nMarc Levy in Harrisburg, Pennsylvania, and Gary Robertson in Raleigh, North Carolina, contributed to this report.",
    "Hours later, the North Carolina Supreme Court approved maps redrawn by a lower court to comply with its earlier ruling that struck down the state legislature’s congressional map.",
    "Ron DeSantis to bless his preferred map’s most controversial aspect, dissolving a north Florida district drawn to give Black voters a chance to pick their own representatives.",
    "Legal experts say that, if the court upheld the argument, it would revolutionize the way elections are conducted in the country by sidelining almost all judicial oversight.",
    "After setbacks in North Carolina and Pennsylvania’s supreme courts this week, GOP officials said the party needs to invest more in winning races for seats on those bodies.",
    "Instead, the high court picked a map drawn by Democratic plaintiffs that combined two Republican-held seats where population growth was particularly stagnant.",
    "Earlier this month, the Florida Supreme Court, which has largely been appointed by Republican governors, unanimously rejected a request from Republican Gov.",
    "If the GOP wins either of the state races, the Legislature can redraw that state’s maps for 2024 and count on a friendlier high court, Republicans say.",
    "“We are winning because Republicans have violated the law.”\nThe filing of the North Carolina appeal shows the depths of Republican frustration.",
    "Race-based line-drawing is governed by a thicket of federal law and constitutional principles and federal courts can intervene in those cases.",
    "Of course, Republicans and their allies have themselves spent millions of dollars on North Carolina Supreme Court races over the past decade.",
    "Mike DeWine — to attend a hearing next week on why they should not be held in contempt for drawing maps that don’t comply with its orders.",
    "“It’s a huge question that hung over the 2020 election,” said Rick Hasen, a law professor at the University of California-Irvine.",
    "Their attorneys cite a provision in the U.S. Constitution that rules for congressional elections are set by state legislatures.",
    "The Ohio court, which has a GOP majority, ordered members of the state’s map-drawing commission — including Republican Gov.",
    "In Ohio, the chief justice who defied her party, Maureen O’Connor, is retiring and her seat is up for grabs in November.",
    "“We may be in an age where it’s very state by state, not just in redistricting but in a wide number of rights,” Li said.",
    "“These elections for supreme court in North Carolina and Ohio are extremely important this fall,” Christie said.",
    "In Pennsylvania, Democrats have a three-justice majority and no justices are up for election this year.",
    "The rulings are one reason this redistricting cycle has gone better for Democrats than many expected.",
    "Despite the Republican criticism, state courts do not always rule on partisan lines.",
    "Even in the best of circumstances, that process triggers an avalanche of litigation.",
    "But for most redistricting legal battles, state courts are the last resort.",
    "NICHOLAS RICCARDI"
  ]
}