{
  "id": 3883,
  "mediaId": 2526,
  "date": "2022-02-26",
  "headline": "Politicians Take Action to Remove Russian Vodka, Spirits from Stores in U.S., Canada",
  "image": "https://media.breitbart.com/media/2022/02/Russian-Vodka-640x335.png",
  "link": "https://www.breitbart.com/politics/2022/02/26/politicians-take-action-to-remove-russian-vodka-spirits-from-stores-in-u-s-canada/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Gilbertson",
  "authorUrl": "https://www.breitbart.com/author/ngilbertson/",
  "termIds": [
    4119,
    4397,
    558,
    908,
    4890,
    5287
  ],
  "sentences": [
    "— Governor Mike DeWine (@GovMikeDeWine) February 26, 2022\nIn a tweet, Saturday, Texas Governor Greg Abbot (R) “asked the members of the Texas Restaurant Association, Texas Package Stores Association & all Texas retailers to voluntarily remove all Russian products from their shelves.”\nI’ve asked the members of the Texas Restaurant Association, Texas Package Stores Association & all Texas retailers to voluntarily remove all Russian products from their shelves.",
    "Chris Sununu (R) took to Twitter Saturday to announce that he has signed an executive order instructing the state’s wine and liquor outlets “to begin removing Russian-made and Russian-branded spirits from our liquor and wine outlets until further notice.”\nThis morning I signed an Executive Order instructing @nhliquorwine outlets to begin removing Russian-made and Russian-branded spirits from our liquor and wine outlets until further notice.",
    "The outlet reports:\nPremier Doug Ford said the discussion about removing Russian-made products began on Thursday, after the government noticed calls for boycotts on social media, and the LCBO received concerned comments from customers about products on store shelves.",
    "Texas stands with Ukraine.#StandWithUkraine\n— Greg Abbott (@GregAbbott_TX) February 26, 2022\nIn Canada, the Ontario provincial government has instructed the Liquor Control Board of Ontario (LCBO) to remove all Russian-produced goods from stores, CTV reports.",
    "Politicians in the United States and Canada are taking steps to remove Russian products, including vodka, from store shelves as Russia continues its military offensive against Ukraine.",
    "Liberal Leader Steven Del Duca also wrote a letter to LCBO President George Soleas asking him to pull several brands of Russian vodka from store shelves to show support for Ukraine.",
    "Jamie Stratton, a partner at Jacob Liquor Exchange in Witchita, Kansas, said that on Friday, the business removed over 100 bottles from shelves, the Kansas City Star reports.",
    "@OhioLiquor estimates that there are approximately 6,400 bottles of vodka made by Russian Standard currently for sale in Ohio's 487 liquor agencies across the state.",
    "“The people of Ukraine have done nothing to deserve what’s happening to them.”\nHe even poured out a bottle of Russian vodka in a display of symbolism.",
    "“As a business owner, that’s not an easy decision to make, but at the end of the day it really is an easy decision,” Stratton told the outlet.",
    "Mike DeWine (R) also tweeted he has directed the Ohio Department “to cease both the purchase & sale of all vodka made by Russian Standard.”\n.",
    "“It made me feel really good to pour it out.”\nHe is recommending customers looking for vodka buy Khor – a Ukrainian brand.",
    "The LCBO is one of the biggest alcohol buyers in the world, and the move will affect its 679 stores in the province.",
    "Retailers have been asked to immediately pull Green Mark Vodka and Russian Standard Vodka from their shelves.",
    "At least one American liquor store is pulling Russian vodka from its shelves without government direction.",
    "“I’m a little bit emotional about it this morning,” he told the Kansas City Star.",
    "New Hampshire stands with the people of Ukraine in their fight for freedom.",
    "“Any and all means of cutting off Russia’s economy should be considered.",
    "— Chris Sununu (@GovChrisSununu) February 26, 2022\nOhio Gov.",
    "Both provincially and federally,” Del Duca said.",
    "New Hampshire Gov.",
    "??"
  ]
}