{
  "id": 3935,
  "mediaId": 2594,
  "date": "2022-02-25",
  "headline": "Arnold Sports Festival returning to Ohio's capital city",
  "image": "https://static.independent.co.uk/2022/02/25/20/Virus_Outbreak-Sports_Festival-Ohio_75206.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/ohio-columbus-arnold-schwarzenegger-mike-dewine-gop-b2023678.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Via AP news wire",
  "authorUrl": "https://www.independent.co.uk/author/via-ap-news-wire",
  "termIds": [
    1688,
    2843,
    4894,
    4916,
    5212
  ],
  "sentences": [
    "The seven-day rolling average of daily new cases in Ohio did not increase over the past two weeks, going from 3,472.86 new cases per day on Feb. 9 to 1,355.86 new cases per day on Feb. 23, according to data collected by the Johns Hopkins University Center for Systems Science and Engineering.",
    "Founded in 1989 as a bodybuilding competition by Arnold Schwarzenegger, the annual festival has since grown into a giant affair that includes weightlifting, running races, martial arts, table tennis and jump roping, among many other sports.",
    "The Arnold Sports Festival, one of the country's biggest such festivals, is returning to Ohio's capital city next week, two years after becoming one of the nation's earliest and most prominent economic victims of the pandemic.",
    "Ohio had no confirmed COVID-19 cases and was monitoring one person who showed signs of illness when, on March 5, 2020, then state Health Department Director Dr. Amy Acton announced strict limitations on Arnold attendance.",
    "“COVID-19 is still a real presence in Ohio, and as much as we look forward to declaring that we're in the all clear, the data still point toward caution, and tell us we're not quite there yet,” Vanderhoff said Thursday.",
    "That order limited spectators to parents or guardians of minors participating in the festival, and also allowed attendance at some weekend events including the men's and women's physique finals.",
    "Nevertheless, current Health Director Dr. Bruce Vanderhoff continues to urge people to follow mask mandates as they apply and to consider receiving a vaccine.",
    "Since March 2020, the state has experienced more than 2.6 million COVID-19 cases, including more than 112,000 hospitalizations and more than 36,200 deaths.",
    "At the time, DeWine said the Arnold was different from other events because most competitions were general admission, not single-ticket entry.",
    "No Ohio county is yet under the 50 cases per 100,000 population rate, considered the threshold below widespread transmission, Vanderhoff said.",
    "Each year, it draws tens of thousands of participants and spectators to Columbus with an economic impact of more than $50 million.",
    "The full Arnold Sports Festival was canceled last year, though a small body-building competition was held in September.",
    "Mike DeWine, who soon thereafter became the first governor of either party to close schools.",
    "Cases skyrocketed in December and January as the omicron variant spread across the state.",
    "It returns as a full event next week; a Columbus-wide mask mandate will still apply.",
    "About 57% of Ohio's population, or about 6.7 million people, are fully vaccinated.",
    "It was one of the early and aggressive actions taken by GOP Gov.",
    "But case numbers have plummeted in recent weeks."
  ]
}