{
  "id": 403,
  "mediaId": 2851,
  "date": "2022-04-16",
  "headline": "The First Post-Trump Republican Race",
  "image": "https://media.newyorker.com/photos/6259f5139efca9f6bdc62e5e/16:9/w_1280,c_limit/BWW-Ohio-Senate.jpg",
  "link": "https://www.newyorker.com/news/the-political-scene/the-first-post-trump-republican-race",
  "mediaOutlet": "New Yorker",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1328,
    1804,
    2201,
    3466,
    4391,
    233,
    878,
    5212,
    5238,
    5371
  ],
  "sentences": [
    "Over my right shoulder, J. R. Majewski, a young congressional candidate with a thick, post-combat beard, talked earnestly with an older couple about his military service; the slogan on his posters read “Let’s Save America Together.” A preacher gave a benediction, affirming within the span of a few minutes that life begins at conception and that, according to God’s word, “man was created male and female, with no other options.” The first candidate to speak, John Adams, who is running for secretary of state, mentioned his wife of thirty-eight years and their seven children, then denounced the nefarious influence of “Zuckerbucks”—money donated by the Facebook billionaire to shore up election systems.",
    "In Troy, his emphasis turned out to be, as he put it, “the corruption in the F.B.I., the corruption in our federal government, the corruption of the Party.” Praising Trump, Vance said, “He revealed a corruption in our country that at least to my eyes was completely hidden.”\nAs examples, he mentioned excesses that he had identified in the F.B.I.’s pursuit of intelligence during the Trump impeachment investigations, and in the prosecution of four right-wingers who allegedly plotted to kidnap the Democratic governor of Michigan.",
    "Around the same time, Josh Mandel, the forty-four-year-old former Ohio state treasurer, who overtook Gibbons in one recent poll, released an ad that begins with an Ohio woman saying critical race theory is “crap.” It then cuts to Mandel on the Edmund Pettus Bridge, in Selma, saying, “Martin Luther King, Jr., marched right here so skin color wouldn’t matter.”\nMuch of the race has been consumed by the money chase—an effort to match Gibbons’s spending or find some alternative to it, often through national media.",
    "On the stump, Mandel makes clear that, once in Washington, he means to challenge not just the Democratic leadership but his own party’s “squishy RINOs.”\nIn retrospect, all this served as a prelude to an incident at a campaign event in Gahanna on March 18th, when Mandel baited Gibbons by charging that the millionaire had outsourced jobs to China, whereupon Gibbons walked toward Mandel and said that the younger man had never worked in the private sector.",
    "In 2016, when the political analyst Kyle Kondik published a study of the state’s voting history, he titled it “The Bellwether: Why Ohio Picks the President.” Kondik’s day job is as an election forecaster at the University of Virginia Center for Politics; he recently estimated that after the coming midterm elections Republicans could outnumber Democrats in Ohio’s U.S. House delegation thirteen to two.",
    "When a Times journalist attended a January event at a church in the town of Troy, the paper reported, Mandel “singled him out,” calling the newspaper “the enemy of the people.” The Twitter account of Mandel’s campaign was suspended after he published a poll asking his followers to vote for which group of “illegals”—“Muslim terrorists” or “Mexican gangbangers”—would commit more crimes.",
    "“At the end of the day, you got five candidates who are going to stand up there and say Joe Biden is driving the economy into the ground.”\nAs recently as the late Obama years, the natural way to see Ohio’s role in national politics was as a keystone, a place balanced delicately between Democrats and Republicans, organized labor and small-business people, cities and rural areas.",
    "He emphasized private actors, too: “Why did the media conspire with the technology companies, with some of our own intelligence agencies, to censor the Hunter Biden laptop story?”\nNear the end of the town hall, a pattern developed in which a member of the audience raised a topic and asked whether there was something there that deserved investigating.",
    "And those are the things that organize politics.”\nVideo From The New Yorker\nSha’Carri Richardson on the Meaning of Time in Running and in Life\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nTellingly, the operatives and patrons behind the Ohio campaigns bring national brands with them.",
    "“The full quote is, well, I’m sure some of the people who vote for Trump are racist, but that’s not what’s going on with the majority of this movement.”\nThere was something instructive about this turn: Vance’s campaign ads insisted that liberals were too quick to call Trump supporters racist, but not long ago he’d had an itchy trigger finger, too.",
    "In Ohio, Gibbons represents the idea of Trump as a businessman, a political outsider with libertarian inflections; Mandel the image of Trump as an unceasing conservative culture warrior; and Vance the theory of Trumpism, an anti-élite nationalism—the Rand Paul wing, the Ted Cruz wing, and the Josh Hawley wing of the Party, respectively.",
    "(An adviser to a rival campaign described him to me as a “sloppy plutocrat.”) Neil Patel, an Indian immigrant businessman and agreeable fringe Senate candidate who promises that, if elected, he will return all calls and e-mails from constituents within forty-eight hours, told me that it wasn’t just Gibbons who was spending big.",
    "He and Ted Cruz employ the same political consultancy (Axiom Strategies, whose founder and C.E.O., Jeff Roe, is arguably the Party’s most prominent media consultant), and they have a similar approach to politics: every culture-war skirmish, no matter how outwardly trivial, becomes a foxhole at the end of the world.",
    "“It is insane,” one senior strategist for a leading campaign told me, “how much money is being spent in this race to suppress opponents’ poll numbers for an audience of one.”\nMandel, a boyish Marine reservist who saw duty in Iraq, has been an elected Republican officeholder since before his thirtieth birthday.",
    "A Democratic operative in Ohio griped, “There just really aren’t any public events to go to.” Across both parties, the small-dollar boom has emphasized partisan media, but in this race—where a Trump endorsement had been seen from the beginning as the ultimate prize—the Fox News sphere is especially valuable.",
    "You may not like everybody who’s working for him”—this sounded to me like an allusion to the state’s masking mandates, which had been strict—“but he has done all of those things.” This was the move that establishment Republicans have leaned on for decades: social conservatism to mollify the populist right.",
    "An Ohio political operative texted me, “Why does everyone brag about being third in this race?”\nOn Monday afternoon, I met up with the Vance campaign at a town hall inside a stylish little pop-up space in Troy—an exposed-brick wall, some understated Vance signs out front, a dozen and a half people inside.",
    "Subscribe today »]\nPeople who know conservative politics say that the Republicans running for the U.S. Senate in Ohio may be the most high-profile, well-resourced, and audacious group in the country—a good place to see the future of the Party a year after Donald Trump departed the White House.",
    "Very against, but he also saw a troubling precedent: “We’re going to have breathalyzers on our phone, where if you’ve had three or four drinks a week you’re not allowed to go and work a normal job in this country.” Why was it that Anthony Fauci had pushed the vaccines so hard?",
    "For all the talk of Rust Belt decline and the opioid crisis, Ohio hasn’t exactly fallen apart economically: its unemployment rate is 4.2 per cent, lower than that in Massachusetts and New Jersey, and its median household income ranks about thirty-fifth nationally.",
    "The national interest in Vance only partly stems from how much of his rise took place within the media’s own world: a best-selling book made after his Yale Law School professor introduced him to a literary agent, a film adaptation directed by Ron Howard.",
    "A few days earlier, the Associated Press had reported that Gibbons had given an interview to Crain’s Cleveland Business last year, in which he’d complained that the wealthy paid too much in taxes and the middle class needed to shoulder a bigger burden.",
    "After some reminiscences about high-school football, and plugs for the high-tech jobs that the administration had brought to the state, Husted said, “Mike DeWine has been the most conservative governor in Ohio history.” The crowd erupted.",
    "Initially, he was the most recognizable Republican in the race: the Party’s nominee for the Senate in 2012, when he lost to the Democrat Sherrod Brown, and its presumptive nominee in 2018, until he abandoned the race before it started.",
    "During the campaign, it also came out that, in 2013, Gibbons had cited “The Bell Curve,” an infamous social-science tract that claims race is a determining factor in intelligence, during a discussion on how to do business in China.",
    "Earlier this month, Vance cut an ad in which he asks his audience, “Do you hate Mexicans?” Ostensibly, it was a way to mock knee-jerk liberals, but he also seemed to blame border-crossing cartels for his mother’s opioid overdose.",
    "The only laugh line I heard him try was to cite Trump calling the Biden press secretary Jen Psaki “the woman with the really beautiful red hair.” Otherwise, he worked to offset the slightly academic mien with blunt speech.",
    "Instead, he pledged to never support tax raises “on anyone, period,” and, after saying that he believed in the sanctity of life and the right to bear arms, moved quickly on to a more straightforward economic message.",
    "Vance shares the backing of the Silicon Valley billionaire Peter Thiel, who has donated ten million dollars to an outside group funding his campaign, with Josh Hawley, of Missouri, the lone senator to support him.",
    "“I hate to use that term, and sometimes it’s important to be direct about what’s going on.”\nIf Trump’s effect on the Republican Party was simply to coarsen it, then progressives might have grimaced and taken it.",
    "The other competitive Senate candidate in Paulding was the “Hillbilly Elegy” author and frequent Tucker Carlson guest J. D. Vance, who watched Gibbons speak from a folding chair, wearing a blazer and jeans.",
    "Mike Gibbons, a seventy-year-old investment banker who had taken the lead via the time-honored political trick of paying millions of dollars to air biographical ads during football games, spoke first.",
    "Jane Timken, who served as the state Party chair during Trump’s Presidency, often working to heal divisions between pro- and anti-Trump factions, took the game one step further in her own campaign.",
    "Portman endorsed Timken, though that hasn’t had much effect on the race; three weeks before Election Day, Timken was instead campaigning with Bernie Kerik, a Trump ally and former N.Y.P.D.",
    "Not only did Trump obliterate many of the coalitions that preceded him; the battle that briefly seemed to loom after January 6th, between pro- and anti-Trump Republicans, evaporated, too.",
    "The trouble is with the more basic elements of campaigning: he often fails to draw clear distinctions between himself and his opponents, or to find ways to pivot when he is criticized.",
    "In the fall, the Club for Growth, which has endorsed Mandel, spent more than a million dollars on an ad campaign emphasizing Vance’s opposition to Trump’s 2016 Presidential candidacy.",
    "Faces were expectant and friendly; brightly colored literature lay on folding tables around the periphery; someone had taken the trouble to set out enough baked goods for everyone.",
    "A hundred or so people had gathered in the village of Paulding, in a barnlike building with high ceilings and walls of wide wooden planks, for a forum of Republican candidates.",
    "Last week, the Timken campaign released an internal poll showing her trailing Gibbons by five points and Mandel by one, figures that other pollsters regarded as optimistic.",
    "He has said that he believes the 2020 election was stolen and has denounced trans women playing intercollegiate sports, but he did not bring up those issues in Paulding.",
    "Trump allowed for people to be a little more aggressive.” The best thing to come out of the Trump campaigns for the Party, he said, was a model of blue-collar outreach.",
    "(The ad did not mention that the Club for Growth, an anti-tax lobbying group that had been prominent in the Obama era, had itself opposed Trump’s candidacy in 2016.)",
    "In Paulding, Mike DeWine, the Republican governor, had sent his lieutenant governor and running mate, Jon Husted, a northwestern-Ohio local, to represent the ticket.",
    "Vance, who was sitting to Mandel’s left in Gahanna, has since said on the stump that before the clash he saw his rival looking at papers with written instructions.",
    "Once, Vance had voiced a familiar opposition to the economic actors that had shipped Ohio’s jobs overseas, stressing families and the devastation of communities.",
    "Compared with national averages, Kondik pointed out to me, Ohio is “a little whiter, a little older, a little lower proportion of people with college degrees.",
    "There’s no Mitch McConnell wing at all—that was represented by Senator Rob Portman, the establishment conservative whose coming retirement opened the seat.",
    "I asked a close adviser to Mandel where he saw Trump’s influence on the race—how the former President had changed the way these Ohio Republicans operated.",
    "Vance brought up the tax returns that elected officials have to submit, and said, “You know whose financial information I’d like to look at is Fauci’s.",
    "The recent shift in Ohio may be less an example of Rust Belt suffering than of the relentless demographic efficiency of modern culture-war politics.",
    "(“You’ve probably seen some of our TV ads,” he said from the podium, with the proprietary ease of a man who has recently footed an enormous bill.)",
    "Stout and thick-necked, the son of a wrestling coach, Gibbons had his comments on a stapled sheaf of white papers, which he turned as he spoke.",
    "On Monday evening, it was raining in rural northwestern Ohio, the skies grayish-green over an open landscape divided by rectilinear highways.",
    "But the internal view of the Mandel campaign seemed to be that the incident, though perhaps not ideally executed, had been good for business.",
    "Now it sounded as if that message had metastasized, so that the allegation of “corruption” could be applied to almost any institution at all.",
    "“Biden’s runaway spending and crippling inflation are crushing working families—people are struggling,” Gibbons, in brown slacks, read out.",
    "“Listen up!” Husted said, and stuck his arm out, as if bracing against the crowd; I had the sense he’d been through similar scenes before.",
    "Another candidate tried to pull Gibbons away by the elbow; it was at this point that Mandel said, or appeared to say, “Don’t test me.",
    "More damaging is that, a year into his campaign, he still cannot give a convincing answer to the main line of attack against him.",
    "To my ear, it sounded like he had, and not just in the more incendiary, culture-war tone that he uses on Twitter and in his ads.",
    "At another stop, in Lima, a young man asked about a quote he’d seen, in which Vance said that some Trump supporters were racist.",
    "“Let me just address the elephant in the room,” Vance said, in Troy, before apologizing for not supporting Trump’s candidacy.",
    "“That is the one attack that really pisses me off,” Vance replied, explaining that the quote had been taken out of context.",
    "These days, Vance has a brown beard, a full belly, and a tendency to squint thoughtfully when he is considering a question.",
    "The Mandel campaign, somewhat unexpectedly, claimed that “pussy” had come out of Gibbons’s mouth, rather than Mandel’s.",
    "Instead, political operators have picked up different strands of Trumpism and are trying to embody and weaponize them.",
    "Kellyanne Conway and Corey Lewandowski became not only paid strategists but also appeared on the stump on her behalf.",
    "If this was an effort to persuade Trump to endorse her, or his supporters to flock to her banner, it hasn’t worked.",
    "“Two tours in Iraq—don’t tell me I haven’t worked,” Mandel said, standing up and pressing his chest into Gibbons.",
    "E-mail address\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement.",
    "Currently, the most watched race in Ohio is the May 3rd primary to select a Republican candidate for Senate.",
    "Vance’s struggles in the polling thus far have had little to do with his prospects as a conservative oracle.",
    "After the Senate candidates had finished speaking, Husted took the stage, wearing a down-home flannel shirt.",
    "(In October, 2016, Vance had tweeted that he would vote for Evan McMullin; he has since deleted the tweet.)",
    "Has he ever been paid for a consulting gig?”\nMuch ink has been spilled worrying whether Vance has changed.",
    "It is also that Vance’s quarrel is not just with the Democratic Party but with liberalism writ large.",
    "Gibbons hired Doug Stafford, a longtime Rand Paul strategist who runs RANDPAC; Paul endorsed Gibbons.",
    "Gibbons responded, “You don’t know squat.” Neither abandoned his microphone; neither stopped talking.",
    "On Friday, Trump officially endorsed Vance—which has the potential to radically transform the race.",
    "Instead of hiring operatives close to major Party figures, she hired the figures themselves.",
    "What has emerged this year isn’t unity, or a clean ideological fight, or the establishment.",
    "You watch what happens, pussy.”\nThe video has been dissected across the political world.",
    "But neither Vance nor two long-shot candidates who spoke mentioned these scandals.",
    "All right, you wonder, does this guy have any stake in some of these companies?",
    "“Our idiot leaders decided to do this to us,” he told the small crowd in Troy.",
    "(Jurors acquitted two of the defendants and deadlocked on the other two.)",
    "Be the first to know when Benjamin Wallace-Wells publishes a new piece.",
    "“I wrote somebody in, third-party—it was a wasted vote,” Vance said.",
    "But in Trump’s wake the Party has been embracing new thinkers, too.",
    "As a result, the ground game in Ohio can seem like an afterthought.",
    "Beyond that, though, he saw continuities with the pre-Trump Party.",
    "“He signed the heartbeat bill, which protected life,” Husted said.",
    "“Except me.”\n[Support The New Yorker’s award-winning journalism.",
    "“He signed Stand Your Ground and advanced constitutional carry.",
    "Columbus, where the suburbs are growing bluer, is thriving.",
    "Only two of the three frontrunners had made it to Paulding.",
    "“Cheating has been going on for decades,” Adams insisted.",
    "Mandel hired Axiom, and notched an endorsement from Cruz.",
    "Gibbons’s opponents have largely focussed on his wealth.",
    "Certainly they’ve been pushing a boundary of some kind.",
    "It also didn’t seem like it would work for much longer.",
    "commissioner who has been convicted of tax fraud.",
    "“It’s a great question, man,” the operative said.",
    "Audience members, though courteous, wanted more.",
    "How did Vance feel about mandatory vaccination?",
    "“The whole thing was staged!” Vance later said.",
    "“Who was your vote for in 2016?” a man probed.",
    "was involved in that kidnapping,” Vance said.",
    "Commentary on American politics and society.",
    "After it aired, Vance’s ratings plummeted.",
    "“Bullshit!” someone screamed, to my left.",
    "The changes in the Party have come fast.",
    "“Everyone is,” he said, and laughed.",
    "It got Husted out of the room.",
    "The candidates milled about.",
    "“I think the style, right?",
    "“Turns out the F.B.I.",
    "Certainly."
  ]
}