{
  "id": 4122,
  "mediaId": 2537,
  "date": "2022-02-25",
  "headline": "Abortion rights groups sue to block Ohio law that adds hurdles to keeping SW clinics open",
  "image": "https://www.gannett-cdn.com/-mm-/197ba79d2ca7b345a34d53988388fb544692a5f5/c=0-299-5536-3421/local/-/media/Cincinnati/Cincinnati/2014/08/15/1408126561000-Abortion3.jpg?width=3200&height=1805&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/25/ohio-abortion-law-challenged-aclu-planned-parenthood/6945045001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    1688,
    4674,
    752,
    826,
    5212
  ],
  "sentences": [
    "Laura Bischoff is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Abortion-rights groups filed a lawsuit Friday in Hamilton County Common Pleas Court to block a new law that they say would threaten abortion clinics in southwest Ohio.",
    "The ACLU of Ohio and Planned Parenthood Federation of America is seeking a restraining order and then a preliminary injunction on behalf of Women's Med of Dayton.",
    "Absent that, the clinics can get a variance approved by the Ohio Department of Health if they have a consulting physician to provide back-up coverage.",
    "Mike DeWine signed Senate Bill 157 into law in December and takes effect in March but the plaintiffs argue that it's already being enforced.",
    "The new law blocks doctors who work for public hospitals or universities from signing on as consulting physicians for abortion clinics.",
    "Ohio already bans abortions after 20 weeks gestation and the most premature infant to survive did so after 21 weeks and one day.",
    "Under the new law, doctors would need to care for the health and life of an infant born alive after a botched abortion.",
    "\"Barring abortion providers from contracting with highly qualified physicians is the opposite of good patient care.",
    "Women's Med Dayton and Planned Parenthood of Southwest Ohio in Mount Auburn both operate under variances.",
    "Physicians would also have to fill out a \"child survival form\" or face a third-degree felony.",
    "Ohioans deserve better,\" said Kersha Deibel of Planned Parenthood Southwest Ohio Region.",
    "Under current law, clinics must have a written transfer agreement with a local hospital.",
    "The lawsuit says the new restrictions limit the pool of potential back up physicians.",
    "Still, proponents of the change say it could save lives.",
    "Gov."
  ]
}