{
  "id": 4145,
  "mediaId": 2522,
  "date": "2022-02-28",
  "headline": "Putin cornered as Russian people step up protests, world leaders, businesses turn on him: ‘Is he losing it?’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-SG-Vladimir-Putin-Russian-Protester-split.jpg",
  "link": "https://www.bizpacreview.com/2022/02/28/putin-cornered-as-russian-people-step-up-protests-world-leaders-businesses-turn-against-him-is-he-losing-it-1206736/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    0
  ],
  "sentences": [
    "SIGN UP HERE\n(Video Credit: Fox News)\nRussian President Vladimir Putin fumed over Ukraine not capitulating to his demands while world leaders, businesses, and even his own people turn on him as experts wonder what’s happened to the brutal dictator and ponder whether he’s still all there or if he’s ill in some way.",
    "“This will apply to any plane owned, chartered, or otherwise controlled by a Russian legal or natural person.”\nThe Gorbachev Foundation issued a statement slamming Putin’s moves as well: “We declare the need for an early cessation of hostilities and the immediate start of peace negotiations.",
    "Protest in St Petersburg right now\n\"Peace for Ukraine\nFreedom for us\"\nsays that small placard put on a tree https://t.co/mpXnjKzFXc\n— Nataliya Vasilyeva (@Nat_Vasilyeva) February 25, 2022\nIt’s not just the thousands of protesters in Russia grabbing headlines.",
    "“Our immediate priority is caring for our great people in the region and we will do our utmost to support them.”\n“Russia’s attack on Ukraine is an act of aggression which is having tragic consequences across the region,” BP Chairman Helge Lund stated.",
    "— Pyro (@DavosSantos) February 26, 2022\nIt is also widely believed that Putin has made his country basically sanction-proof by putting measures into place that will negate the effects of financial punishment by other countries.",
    "“As Russian forces unleash their assault on Kyiv and other Ukrainian cities, we are resolved to continue imposing costs on Russia that will further isolate Russia from the international financial system and our economies.",
    "Countries, businesses, and just about everyone else is cutting ties with Russia as fast as they can as Putin’s war expands and becomes ever more lethal with the threat of nuclear weapons hanging over the incursion.",
    "As of Sunday, 3,000 had reportedly been arrested as Putin cracks down on his own people who seem to have no appetite for conquest and war, according to the human rights group OVD-Info and reported by Fox News.",
    "And in all likelihood most banks around the world will simply stop transacting altogether with Russian banks that are removed from SWIFT,” a senior Biden administration official said, according to Fox News.",
    "“I am convinced that the decisions we have taken as a board are not only the right thing to do but are also in the long-term interests of bp,” chief executive, Bernard Looney, said in a statement.",
    "“If one of these de-SWIFTED and Russian banks wants to make or receive a payment with a bank outside of Russia, such as a bank in Asia, it will now need to use the telephone or a fax machine.",
    "1-ranked singles tennis player, Anastasia Pavlyuchenkova, also called on her nation to “stop the violence, stop the war” as tanks and troops rolled into Ukraine, according to the Independent.",
    "Only negotiations and dialogue based on mutual respect and consideration of interests are the only possible way to resolve the most acute contradictions and problems.”\nRussia’s no.",
    "Putin cornered, under pressure as Russian citizens, world leaders, and businesses turn against him: ‘Is he losing it?’\nGet the latest BPR news delivered free to your inbox daily.",
    "Saturday, under pressure from citizens, the United States, Canada, and other European allies announced the removal of “selected” Russian banks from the SWIFT financial system.",
    "“Today I directed @OhioCommerce to cease both the purchase & sale of all vodka made by Russian Standard, the only overseas, Russian-owned distillery with vodka sold in Ohio.",
    "Protests have broken out in the United States, Switzerland, England, Germany, Greece, Italy, Taiwan, Spain, and France with protesters decrying Putin’s unwarranted actions.",
    "Today I directed @OhioCommerce to cease both the purchase & sale of all vodka made by Russian Standard, the only overseas, Russian-owned distillery with vodka sold in Ohio.",
    "This will ensure that these banks are disconnected from the international financial system and harm their ability to operate globally,” the White House message continued.",
    "What is the assessment of the Russian leader?” He then turned to retired CIA Senior Clandestine Services Officer Dan Hoffman to discuss what is going on with Putin.",
    "“Our airspace will be closed to every Russian plane – and that includes the private jets of oligarchs,” European Union President Ursula von der Leyen said.",
    "— Governor Mike DeWine (@GovMikeDeWine) February 26, 2022\nEven a Las Vegas bar is getting in on it by publically pouring Russian vodka down the drain.",
    "Several U.S. states, including Ohio, Virginia, and New Hampshire, have stopped selling and purchasing Russian-made vodka as well.",
    "“Even if you’re a business that doesn’t care about anything except making money, the last thing you want to be doing is go there.",
    "At least 23 Russian banks are currently connected to China’s International Payments System (CIPS) according to Asian Markets.",
    "Hoffman asserted Russia has a cloud of “crap” surrounding them, making the communist country and its leader very unpopular.",
    "However, China has its own version of the SWIFT system and they may make it available to the Russians to bypass sanctions.",
    "Russian Standard’s vodka is sold under the brand names of Green Mark Vodka & Russian Standard Vodka,” Ohio Gov.",
    "Many countries have now banned Russian flights and Americans are being urged to leave Russia because of it.",
    "Fox News host Bret Baier noted, “Meantime there’s a lot of analysis about Russian President Vladimir Putin.",
    "You go to lots of other places to do your business, you don’t need to go there,” he told Fox News Digital.",
    "“First, we commit to ensuring that selected Russian banks are removed from the SWIFT messaging system.",
    "Russian Standard's vodka is sold under the brand names of Green Mark Vodka & Russian Standard Vodka.",
    "However, this military action represents a fundamental change.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "People in the know say that he has radically shifted tacts and is now displaying instability.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Russia and China have developed their swift alternative for years, and it is ready to go.",
    "“BP has operated in Russia for over 30 years, working with brilliant Russian colleagues.",
    "BP announced on Sunday that it is dropping its stake in Russian energy company Rosneft.",
    "Russia is now being forced out of the global market and its own economy is imploding.",
    "Thousands of Russian citizens took to the streets as their country invaded Ukraine.",
    "Russia being terminated from SWIFT will accelerate the demise of the US Dollar.",
    "We will implement these measures within the coming days,” the statement read.",
    "There is and cannot be anything more valuable in the world than human lives.",
    "(Video Credit: ABC News)\nThis is not the Putin of 2008 or even of 2020.",
    "Taking Russia out of swift isn't the silver bullet people think it is.",
    "The public will not see it and we do not share it.",
    "Mike DeWine announced on Saturday.",
    "Russia also reportedly has one.",
    "Is he losing it?",
    "Is he well?"
  ]
}