{
  "id": 4153,
  "mediaId": 2537,
  "date": "2022-03-03",
  "headline": "Doc's TML: Paralympics, F1, World Cup show sports are political. Always have been.",
  "image": "https://www.gannett-cdn.com/presto/2022/02/28/USAT/e68d06c9-407f-49bc-91b8-b20a9cc52e0b-russia_hockey.JPG?crop=8121,4568,x0,y0&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/sports/blogs/daugherty-blog/2022/03/03/russian-athletes-paralympics-f-1-world-cup-show-politics-sports-mix/9359480002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Daugherty",
  "authorUrl": "https://www.cincinnati.com/staff/2646663001/paul-daugherty/",
  "termIds": [
    1459,
    1667,
    1688,
    3180,
    3287,
    3709,
    4853,
    5212,
    5287
  ],
  "sentences": [
    "Other highlights at Bockfest include:\nBock Beer Sampling Experience: Saturday 3/5, noon\nSausage Queen Coronation: Saturday 3/5, 9:30p\nLittle Links Pageant: Sunday 3/6, 11:30a\nBockfest Pig Roast: Sunday 3/6, 12p-4p (must purchase in advance)\nFor more information and the full schedule, visit bockfest.com.",
    "Join in some fun before the game at Washington Park for “Pre-Match at the Park” Saturday, March 5th - 3:00-6:00 celebrate the home opener with live music from The Naked Karate Girls, face painting, goats, ice carving and other fun soccer activities.",
    "For example:\nRussian imports to Ohio on a variety of products jumped 112% overall from 2020 to 2021, according to data from the Ohio Department of Development, fueled primarily by a big jump in Ohio imports of Russian iron and steel.",
    "Bockfest is celebrating 30 years of barrel rolling and a weekend of fun, starting with the parade Friday at 6 at Arnold’s Bar & Grill, 210 E. Eighth St., and winding through OTR to Bockfest Hall (Findlay Playground) 1811 Vine.",
    "Since the Russian invasion of Ukraine, its men’s soccer team is banned from World Cup playoff games, Formula 1 won’t be racing as scheduled in St. Petersburg and Putin has been stripped of his honorary taekwondo black belt.",
    "Unity shows itself any number of ways, whether it’s in something as esoteric as sports, as symbolic as a United Nations resolution or as crucial as a unified NATO response to an autocrat launching an invasion.",
    "If somehow that's not enough, consider the other, more prominent leverage point left for the players: rebates paid out to the regional sports networks that carry local broadcasts for games not played.",
    "“I am going to Saturday's game so I can wave goodbye to Travis Steele.’’ That was a fan response to the Enquirer’s Xavier beat guy Adam Baum, in the wake of Adam’s story on XU’s loss at St. John’s.",
    "There is a ton of parking in the lot behind on Branch St. or you can also enter through the Knox Joseph retail and bottle shop (I say it’s like the “speakeasy” to the bar) on 1820 Central Pkwy.",
    "And the prospect of losing hundreds of millions in additional postseason revenue over the course of an agreement should provide enough motivation to listen to players when they say something.",
    "It provides the basis for a widely shared view among players: that because of the rebate threshold and low April attendance, teams are perfectly fine missing the first month of the season.",
    "Get your tickets at cincinnatiarts.org\nThere’s an awesome new bar/distillery to check out: Knox Joseph Distillery/ OTR StillHouse located near the TQL Soccer stadium at 2017 Branch St..",
    "Fear not, this was easily fixed by a quick exit stage left and walk around the corner to Corkopolis for a delicious bottle of Bishop’s Creek Pinot, thanks to my clever bride.",
    "MORE NEWS ABOUT the BS BASEBALL situation, this from ESPN’s Jeff Passan, a very informed guy:\nThe longer the league waits to give in certain areas, the more games it loses.",
    "When we went to La Cantina last week, we were optimistic that this new concept on Eighth Street was going to be a solid replacement for the ever reliable Cheapside.",
    "Now, this may be resolved by the time of this writing, but on the night of our visit La Cantina was still awaiting their new liquor license to be officially issued.",
    "On the west side, Zip Dip Soft Serve is back in action beginning Friday, while on the east side, The Root Beer Stand begins its season on Saturday.",
    "But facts are facts and what the facts suggest this time is the owners seem as interested in breaking the union as they do in playing baseball.",
    "Iron and steel imports from Russia to Ohio rose to $751.2 million in 2021, up 118% from $344.5 million the year before, state data showed.",
    "Sunday Funday has a little links pageant, games for the kids, petting zoo, a walking tour of Cincinnati brewing history and so much more.",
    "Then he bum-rushed the players with a last best proposal barely a day before his self-proclaimed deadline for avoiding a work stoppage.",
    "Finally, the news you were all waiting for: Girl Scouts will be all over the area this weekend and next selling their famous cookies.",
    "This year's festivities begin at 4:00pm Friday at Moerlein Lager House with the Bockfest Happy Hour followed by the parade at 6:00pm.",
    "The show has a little of everything from comedy, music, and “highly unusual cooking demos and promises to be totally entertaining.",
    "This weekend is a perfect time to check this place out because the garage doors will probably be open and the sun will be shining.",
    "It’s possible to despise Putin without despising the people he rules with an iron fist, including those who happen to be athletes.",
    "I guess I thought the vodka gesture was a little too small town-ish, like Hillsboro temporarily changing its name to Hillsburrow.",
    "Bock, a strong German beer originating in the Rhineland, has a rich history in Cincinnati, with the festival dating back to 1993.",
    "Probably, a Russian sprinter on prosthetic legs has about as much in common with Vladimir Putin as a fish has with an elephant.",
    "Elsewhere, it's a great weekend for tasty treats as a couple of the city's landmark seasonal eateries will be opening back up.",
    "Check out my page https://heymichelle-help.com\nAnd what would any of it mean if we couldn’t eat, and imbibe responsibly?",
    "One today was, “How do you feel about sports and politics mixing?’’\nI answered the same way I just did in This Space.",
    "He made it a point to introduce himself to me and my son last summer, when Kelly and I were in town and at the game.",
    "Ohio exports to Russia reached nearly $220 million in 2021, a more-than 25% jump from 2020's almost $175 million.",
    "Then, sip away at the Bock Beer Experience, hit up the Pig Roast, and watch the “Sausage Queen” be crowned.",
    "That’s a great night, but if you’ve come this far, maybe you’re willing to follow me just a bit further.",
    "Comfort Station is a short drive up the street in East Walnut Hills, and the ideal spot for a night cap.",
    "We were bummed that Harvest Pizza closed, but after trying Kanji’s sushi we were pleasantly surprised.",
    "The guacamole with roasted veggies was a great start along with a perfectly grilled oyster appetizer.",
    "Every time I do that sort of thing at a school, I leave feeling good about the future of our country.",
    "Manfred locked out players, then waited 43 days before submitting any proposal for a new agreement.",
    "We melted a bit as we enjoyed a high proof bourbon old fashioned and lightly smoky mezcal cocktail.",
    "(News services)\nI’m not smart enough to know how much of that DeWine controls on a state level.",
    "Meanwhile, the value of Ohio exports to Russia also grew last year, albeit at a slower pace.",
    "The guv’s son runs the Class A Asheville Tourists baseball team, owned by the DeWine family.",
    "Better question: Under the current circumstances, should we be concerned about what is fair?",
    "On Thursday, organizers of the Winter Paralympics expelled athletes from Russia and Belarus.",
    "The 30th Annual Bockfest is this weekend at Findlay Playground and the OTR brewery district.",
    "It’s also a woman-owned distillery and everything is made in-house…beer, wine & the booze.",
    "Depending on the team, avoiding rebates necessitates between 138 and 150 games broadcast.",
    "The players suffer from the same lack of self awareness that infects owners and Manfred.",
    "Check out all the scoop at Bockfest.com\nFC Cincinnati is hoping for a win this weekend!",
    "To reiterate: Baseball revenues are crushing it, excluding the farcical 2020 season.",
    "But banning them from taking part on the world’s stage is reasonable and necessary.",
    "Alton Brown: Live Beyond the Eats is at the Aronoff Center Friday night at 7:30 pm.",
    "If you have an event you'd like to submit, please email me at dwertheim0@gmail.com.",
    "I've heard there may even be a new flavor so make sure you stop by and support.",
    "Their work gets no better than Sweet Virginia, Tumbling Dice and Soul Survivor.",
    "The tacos were fantastic, our favorites were the Baja Fish and Lamb Barbacoa.",
    "Maybe Let It Bleed and a darkhorse candidate, Tattoo You, vastly underrated.",
    "So many places downtown have reopened, and it’s our duty to check them out.",
    "It has become increasingly obvious that Paul Scruggs is not a point guard.",
    "I spoke to a Social Studies class at Loveland High School this morning.",
    "But if you want to hurt Russia economically, do more than ban spirits.",
    "Russian athletes are being locked out of just about every competition.",
    "Bockfest is HERE and March 4-6 and the weather is going to be amazing!",
    "Do you want to know where to eat, drink and have fun in Cincinnati?",
    "Paralympians and soccer players are pawns in the geopolitical game.",
    "They reflect real life, deadly to trivial, war to Colin Kaepernick.",
    "In retrospect, I was a little too flip here Tuesday about Ohio Gov.",
    "Why should his work/dreams/ambitions suffer the same consequences?",
    "The more games it loses, the less likely it is to pay a full 162.",
    "Perhaps Dwon Odom should have played more earlier in the season.",
    "TML’s trio of talented bon vivants will improve your weekend.",
    "Exile on Main Street is generally considered their best work.",
    "These kids were bright, attentive and asked great questions.",
    "We’d like to think sports should be distinct from real life.",
    "I might have been wr… wr… wr… not totally right about that.",
    "It’s unusual for a double album not to contain much filler.",
    "Mike DeWine’s decision to ban all sales of Russian vodka.",
    "Players’ wages are down 4 percent over the last 3 years.",
    "The party continues Saturday at 11 and Sunday at noon.",
    "I’m pushing it here, so just one more Best Album day.",
    "I admired early on how he handled COVID in the state.",
    "But the criticism from the X fan base is astounding.",
    "His assist-to-turnover ratio – 117-87 – is not good.",
    "I am happy to say this new crew did not disappoint.",
    "Neither side seems interested in getting much done.",
    "He has 35 more turnovers than any other Musketeer.",
    "Saturday things kick off with a Bockfest 5K Run.",
    "He’s a slasher and a scorer, not a facilitator.",
    "Getting closer to spring time in the big city.",
    "cincybeerguydave@gmail.com\nTUNE O’ THE DAY .",
    "Everything from fertilizer to guns and ammo.",
    "They’re all stitches in a common fabric.",
    "This place is so flipping cool and huge!",
    "It might sound as if I’m taking a side.",
    "That’s not an indictment of Scruggs.",
    "This one’s lean all the way through.",
    "ABOUT THE GOVERNOR AND THE VODKA.",
    "Always have been, always will be.",
    "FunMaster David says Bockin’ A’.",
    "Revenues set a record in 2019.",
    "I mean, you’re the governor.",
    "I actually like Mike DeWine.",
    "I think he’s a sensible guy.",
    "They simply don’t do that.",
    "What say youse, Mobsters?",
    "Elaborates on the theme .",
    "Here’s a cut from Exile.",
    "Sorry to repeat myself.",
    "Sports are political.",
    "Is there a close 2nd?",
    "Calling all foodies.",
    "But they never are.",
    "See opinions above.",
    "Think bigger, yeah?",
    "He’s just miscast.",
    "Sound fair to you?",
    "Today, the Stones.",
    "Bon vivants, Doc?",
    "They all matter.",
    "Is this fair?",
    "Hey Michelle!",
    "Now, then .",
    "Maybe none.",
    "I’d agree.",
    "AND NOW.",
    "I’m not.",
    "Cheers!",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    ".",
    "."
  ]
}