{
  "id": 4169,
  "mediaId": 2518,
  "date": "2022-02-28",
  "headline": "Bars, liquor stores pull Russian-brand vodka",
  "image": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/200764902_200762802-2c76680ca54144389339a66939b02e9c_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/feb/28/bars-liquor-stores-pull-russian-brand-vodka/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.arkansasonline.com/staff/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "L. Louise Lucas, a Democrat in the Virginia state Senate, is calling for \"the removal of all Russian vodka and any other Russian products\" from Virginia's nearly 400 state-run Alcoholic Beverage Control Authority stores.",
    "The Magic Mountain ski resort in Londonderry, Vermont, posted a video on Twitter showing an employee pouring Stolichnaya down the drain and saying: \"Sorry, we don't serve Russian products here.\"",
    "Some bars and liquor stores have taken an action to stand against Russia for invading Ukraine: They're pulling Russian vodka off their shelves and promoting Ukrainian brands instead.",
    "The Southern Spirits liquor store in Indian Land, South Carolina, is experience a boom in business for the Ukrainian vodka Kozak after pulling Russian brands off its shelves.",
    "And Sen. Tom Cotton, R-Ark., wrote on Twitter, \"Dump all the Russian vodka and, alongside ammo and missiles, send the empty bottles to Ukraine to use for Molotov cocktails.\"",
    "Mike DeWine directed the state's Commerce Department to cease the purchase and sale of Russian Standard, the only Russian vodka sold in Ohio.",
    "Chris Sununu signed an executive order requiring state liquor outlets to remove Russian-made and branded alcohol, as did Utah Gov.",
    "On its website, Stoli Group says it \"stands for peace in Europe and in solidarity with the Ukrainian people.\"",
    "So he rid his shelves of the old Soviet brand Stolichnaya and started promoting Ukraine's Vektor.",
    "You wonder what you can do,\" said Bob Quay, owner of Bob's Bar in Grand Rapids, Michigan.",
    "\"It's selling out a lot faster than we thought,\" said general manager Drew Podrebarac.",
    "Information for this article was contributed by Azi Paybarah of The New York Times.",
    "Stoli, owned by the Russian-born tycoon Yuri Shefler, is actually made in Latvia.",
    "\"I woke up yesterday morning, and I saw that Russia had invaded Ukraine.",
    "We've got people coming in who've never been in the bar before.\"",
    "\"We have a sign above it that says: Support Ukraine.\"",
    "Quay announced the move on Facebook, and \"it blew up.",
    "\"The U.S. obviously is putting on sanctions.",
    "I thought I would put on sanctions as well.\"",
    "Governors entered the fray, too.",
    "\"It's been awesome.\"",
    "New Hampshire Gov.",
    "Spencer Cox.",
    "Ohio Gov."
  ]
}