{
  "id": 4248,
  "mediaId": 2919,
  "date": "2022-03-03",
  "headline": "Ohio gets closer to abolishing death penalty",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/a465fb8/2147483647/strip/true/crop/750x394+0+53/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F60%2F81%2F7419944b40fa8cbf36ba8a05c2e8%2Fdownload.jpeg",
  "link": "https://www.news5cleveland.com/news/democracy-2020/ohio-politics/ohio-gets-closer-to-abolishing-death-penalty",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    0
  ],
  "sentences": [
    "“The way it's used today is mostly multiple murderers, child murderers, people who are murdering witnesses to try and avoid the justice system and the consequence of the justice system”\nTobin and other prosecutors believe ending capital punishment would be letting murderers of the hook.",
    "\"It gets drawn out for decades with lots of court hearings, lots of appearances that families need to make and it's trauma just recycled over and over again.”\nHe is now the vice-chair of Ohioans To Stop Executions (OTSE), a single-issue death penalty repeal organization.",
    "COLUMBUS, Ohio — Ohio hasn't executed a prisoner in about four years, but capital punishment continues to be a topic of debate at the Statehouse.The state moved one step closer to abolishing this centuries old form of punishment on Thursday.",
    "See more news about politics below:\nDownload the News 5 Cleveland app now for more stories about state politics from the Ohio Statehouse, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Mann and numerous other supporters, including Right to Life of Greater Cincinnati’s Laura Strietmann and Catholic Conference of Ohio’s Jerry Freewalt, all list the same main reasons for opposing the death penalty.",
    "Castro held Amanda Berry, Gina DeJesus and Michelle Knight captive for a decade until a neighbor, Charles Ramsey, heard Berry calling for help, pulled the door open enough for her to escape and called 911.",
    "But prosecutors say that lethal injections are only used in very specific circumstances, adding some families feel they would get more justice knowing the person who killed their loved one is dead.",
    "“This is like opening up a wound and re-cauterizing it every day.”\nThere are currently 131 people on death row in the state, according to the Ohio Departments of Rehabilitation and Correction.",
    "It disproportionately impacts people of color, as the ACLU of Ohio and OTSE found that although people of color make up 15% of Ohio’s population, they make up of 56% of the state’s death row.",
    "“This is a human issue.”\nMann used to support the death penalty, but after his dad's murderer got sentenced to death, he said he feels a weight on his shoulders.",
    "“We think it is reserved for the worst of the worst offenders in Ohio,” Ohio Prosecuting Attorney Association Executive Director Lou Tobin said.",
    "And perhaps most jarring, for every six people the state of Ohio has executed, one person has been found innocent, according to the ACLU study.",
    "Most everyone agrees that murderers should face consequences for their crimes, but not everyone agrees what those consequences look like.",
    "\"People need to understand, as co-victims, what we go through in the judicial system is like going through a meat grinder,” he added.",
    "Ohio is also home to 11 death row exonerees who collectively spent 216 years in prison for crimes they didn’t commit, ACLU reported.",
    "“I think there are ways that we can get rid of the unnecessary delay that causes some of the complaints of the proponents,” he said.",
    "People on both sides of the issue packed the fifth state House Criminal Justice Committee hearing for the bipartisan legislation.",
    "Mike DeWine put a hold on all capital punishment due to not having enough lethal injection drugs to carry out the execution.",
    "Due to redistricting taking center stage right now, the legislators believe this bill won't make it to the floor until May.",
    "It would be much cheaper to replace the death penalty with life in prison without the possibility of parole, it showed.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "People shouldn’t be taking an \"eye for an eye,\" according to the sponsor of the bill, Jean Schmidt (R-Loveland).",
    "The executions should be used sparingly, but lawmakers shouldn't take away the option entirely, Tobin said.",
    "The same study by ACLU found Death penalty trials cost taxpayers as much as $16 million per case.",
    "The death penalty in Ohio is ten times more expensive than a non-death case, according to OTSE.",
    "All murders are horrendous, he said, but for people like Ariel Castro, it would be necessary.",
    "Strietmann and Freewalt all list God as being the only entity allowed to take away life.",
    "Something both sides can agree on is the justice system needs to move more quickly.",
    "“This isn't, you know, a liberal or conservative issue,” Jonathan Mann said.",
    "“There's nothing more agonizing that I have to deal with,” Mann said.",
    "Download now on your Apple device here, and your Android device here.",
    "Seventy-five percent of Ohio executions involve a white victim.",
    "Like Mann originally mentioned, it draws out the legal process.",
    "Learn more about our streaming options here.",
    "House Bill 183 would end the death penalty.",
    "Ohio’s last execution was in July of 2018.",
    "It is incredibly expensive for the state.",
    "We're also on Amazon Alexa devices.",
    "At the end of 2020, Gov."
  ]
}