{
  "id": 4336,
  "mediaId": 6704,
  "date": "2022-02-28",
  "headline": "US states squeeze Russia financially, pull funding",
  "image": "https://media.king5.com/assets/CCT/images/e297fd0f-9c69-4fc7-bbdd-947193f11722/e297fd0f-9c69-4fc7-bbdd-947193f11722_1140x641.jpg",
  "link": "https://www.king5.com/article/news/nation-world/ukraine/states-reaction-russia-ukraine-invasion/507-cf4710c2-6276-4206-baca-cce81fc9f589",
  "mediaOutlet": "king5.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a memo to fellow senators, Democratic state Sen. Sharif Street said Pennsylvania “must wield our economic power to ensure that Russia faces grave consequences for their flagrant violations of international law and human cooperation.”\nPennsylvania House Majority Leader Kerry Benninghoff, a Republican also seeking co-sponsors for the legislation, said state lawmakers \"have a moral obligation to ensure that our public fund investments are not inadvertently supporting those who are engaging in an unprovoked invasion of their democratically elected neighbors.”\nArkansas lawmakers have filed proposals authorizing banks in the state to freeze the assets of Russian oligarchs and to require a boycott of Russian-made goods.",
    "Also contributing were AP writers Jeff Amy in Atlanta; Jim Anderson in Denver; Sarah Brumfeld in Silver Spring, Maryland; Michael Catalini in Trenton, New Jersey; Kim Chandler in Montgomery, Alabama; Bob Christie in Phoenix; Andrew DeMillo in Little Rock, Arkansas; Susan Haigh in Norwich, Connecticut; Kimberlee Kruesi in Nashville; Rachel La Corte in Olympia, Washington; David Pitt in Des Moines, Iowa; Sarah Rankin in Richmond, Virginia; Lisa Rathke in Montpelier, Vermont; Marc Levy and Mark Scolforo in Harrisburg, Pennsylvania; Casey Smith in Indianapolis; and Lindsay Whitehurst in Salt Lake City.",
    "Greg Abbott, a Republican, posted on Twitter over the weekend that he has asked restaurants and retailers “ to voluntarily remove all Russian products from their shelves.”\nOfficials in Alabama, Iowa, New Hampshire, Ohio, Pennsylvania, Utah, Vermont, Virginia and West Virginia — all states that control the sale of alcohol — have directed Russian-sourced alcohol to be removed from store shelves, joining a pro-Ukranian movement along with some bars and private businesses.",
    "“While our role in international affairs is limited, we make clear we stand with those who want to live in peace.”\nGeorgia Secretary of State Brad Raffensperger, who oversees state business registrations, on Monday also called upon Georgia-based businesses and investors to stop doing business with Russia or any companies that support Russia.",
    "The Democratic governor also said New York would welcome Ukrainian refugees, noting that New York already is home to the largest Ukrainian population in the U.S.\nPennsylvania lawmakers said Monday they will file legislation requiring state pension funds to pull investments connected to the Russian government and its critical supporters.",
    "The effect of sanctions by U.S. states often pales in comparison to national ones, but state officials said they wanted to show solidarity with Ukraine and do what they could to build upon the penalties imposed on Russia by the U.S. government and other Western nations.",
    "“Indiana will not be a safe haven for ill-gotten Russian funds, nor for its oligarchs trying to find financial shelter in the wake of Putin’s unconscionable invasion of Ukraine,” Democratic state Rep. Ryan Dvorak said while proposing the amendment last week.",
    "Seeking to tighten the financial squeeze on Russia over its war against Ukraine, governors and lawmakers in numerous U.S. states were taking actions Monday to pull state investments from Russian companies while encouraging private entities to do the same.",
    "Georgia House Speaker David Ralston, a Republican, got a bipartisan standing ovation Monday when he told representatives he would seek to have the state’s retirement funds quickly divested from any Russian assets.",
    "Governors in Connecticut, New Jersey, Virginia and Washington also have ordered a review of whether any state money is going to Russian companies or investments supporting the Russian government.",
    "The Washington state House and Senate each have added amendments to their budget proposals setting aside $19 million to provide services and temporary housing to refugees who come from Ukraine.",
    "Kim Reynolds, a Republican, called for an end to its sister state relationship with Stavrapol Krai, Russia, and a strengthening of its sister state relationship with Cherkasy Oblast, Ukraine.",
    "North Dakota’s State Investment Board was due to meet in special session later this week to discuss its investments in Russia, which include bonds issued by the country.",
    "Larry Hogan announced Monday that he's dissolving Maryland’s decades-old sister-state relationship with Russia’s Leningrad region after the invasion of Ukraine.",
    "Mike DeWine, a Republican, issued a joint statement condemning Russia’s invasion of Ukraine as co-chairs of the presidentially-appointed Council of Governors.",
    "On Monday, the Indiana House passed legislation that would block Russian-controlled businesses and nonprofits from acquiring property in Indiana for one year.",
    "Governors in several states, including Washington's Jay Inslee, have ordered a review of whether any state money is going to Russian companies or investments.",
    "“If our state can put one brick in the wall around Putin, it will be a good thing, and we intend to do all that we can in this regard,” said Washington Gov.",
    "A bipartisan group of California lawmakers said Monday that they also will introduce legislation to divest public money from Russian state entities.",
    "“Utah stands in solidarity with Ukraine and will not support Russian enterprises, no matter how small the exchange,” Republican Utah Gov.",
    "The governors of Arizona, Pennsylvania and Tennessee ordered their capitols lit with the blue and yellow colors of Ukraine’s flag.",
    "Glenn Youngkin, a Republican, asked the cities of Norfolk and Roanoke to end their sister city partnerships with Russian cities.",
    "Colorado’s $61 billion state pension fund is pulling $8 million from a Russian state-owned bank identified in federal sanctions.",
    "Jared Polis, a Democrat, has banned state agencies from doing business with Russian state-owned firms and their subcontractors.",
    "She ordered state agencies to divest money and assets from companies or institutions aiding Russia in its war against Ukraine.",
    "“I don’t know about y’all, but I don’t want one penny of Georgians’ money going to subsidize Vladimir Putin,” Ralston said.",
    "Some governors are seeking to sever good-will relationships between their home states and those in Russia.",
    "The state Treasury Department also has begun divesting its minimal holdings in Russian-based companies.",
    "Kathy Hochul signed an executive order Sunday forbidding her state from doing business with Russia.",
    "Several states have expressed a willingness to provide housing to Ukranian refugees.",
    "Associated Press writer David A. Lieb reported from Jefferson City, Missouri.",
    "Other state actions have potential teeth.",
    "Some actions have been largely symbolic.",
    "Tim Walz, a Democrat, and Ohio Gov.",
    "It now goes to the Senate.",
    "Jay Inslee, a Democrat.",
    "Spencer Cox said.",
    "Republican Gov.",
    "Minnesota Gov.",
    "New York Gov.",
    "Virginia Gov.",
    "Colorado Gov.",
    "Texas Gov.",
    "Iowa Gov."
  ]
}