{
  "id": 4368,
  "mediaId": 2540,
  "date": "2022-02-26",
  "headline": "A roadmap to the 2022 midterm elections",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/170125081427-voting-booth-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/26/politics/key-dates-2022-midterm-election/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "May 24: Alabama, Arkansas and Georgia primaries; Texas runoffs (if necessary)\nThere is perhaps no state on the 2022 map where Trump is seeking to exert his influence on the Republican Party more than Georgia, where he rolled out a \"Trump ticket\" of candidates, including two who are challenging GOP incumbents the former President attacked after they rejected his efforts to overturn the 2020 election.",
    "May 17: Idaho, Kentucky, North Carolina, Oregon and Pennsylvania primaries\nThe fight for the GOP Senate nomination in Pennsylvania could be one of the nastiest and most expensive primary contests of the entire 2022 cycle, with hedge fund executive David McCormick and celebrity doctor Mehmet Oz trading pointed attacks over their personal ties to foreign countries.",
    "In south Texas, there is a rematch of a 2020 Democratic primary in the 28th Congressional District between centrist Rep. Henry Cuellar and immigration attorney Jessica Cisneros, who has received the endorsement of progressive leaders, including Massachusetts Sen. Elizabeth Warren and New York Rep. Alexandria Ocasio-Cortez.",
    "June 21: DC and Virginia primaries; runoffs in Alabama, Arkansas and Georgia (if necessary)\nLast November's victory by Republican Glenn Youngkin in the race for Virginia governor boosted the GOP's hopes that 2022 would be a strong year for the party in the commonwealth and beyond.",
    "June 28: Colorado, Illinois, Maryland, New York, Oklahoma and Utah primaries; runoffs in Mississippi and South Carolina (if necessary)\nThe Land of Lincoln is the scene of not one but two dual incumbent House primaries after Illinois lost a seat based on the 2020 census.",
    "Assuming no candidate gets a majority of the vote in the all-party primary, the top two finishers will face off in June, when California holds its general election primaries, giving the eventual winner about six months to represent this Central Valley seat in Congress.",
    "Here are the key dates and contests to watch as the 2022 primary process plays out:\nMarch 1: Texas primaries\nThe Lone Star State is home to a few intriguing GOP statewide primaries and a House Democratic primary that highlights the ideological divide within the party.",
    "But the race in Alaska will be complicated by the state's new election system, with all the Senate candidates running on a single ballot and the top four finishers, regardless of party, advancing to the general election, which will be decided by ranked-choice voting.",
    "The Atlanta area will host the year's first Democratic member vs. member primary, with Reps. Lucy McBath and Carolyn Bourdeaux running in the newly redrawn 7th Congressional District after the GOP-controlled state legislature turned McBath's current seat safely red.",
    "There is also a unique dynamic to these midterms, with former President Donald Trump eyeing a potential return to the White House and looking to lay the groundwork by endorsing candidates in GOP primaries who have embraced his lies about the 2020 election results.",
    "Former state GOP chair Jane Timken and businessman Mike Gibbons are also making plays for the Trump base, while state Sen. Matt Dolan is testing the theory that there is still room in the party for a candidate who doesn't fully embrace the former President.",
    "There is arguably no Republican who has drawn Trump's ire more than Cheney, who voted in favor of impeachment last year and is the vice chair on the House select committee investigating the events surrounding the January 6, 2021, attack on the US Capitol.",
    "A handful Republicans have lined up to challenge Spanberger in the new 7th Congressional District, which was redrawn to include more of the Democratic-leaning exurbs in Northern Virginia but no longer includes the congresswoman's home near Richmond.",
    "GOP Rep. Peter Meijer is running for reelection in Michigan's 3rd Congressional District after voting for impeachment and faces a primary challenge in John Gibbs, a former Trump administration official who has the backing of the former President.",
    "There is also a contested Republican primary in the race for state attorney general, with incumbent Ken Paxton being challenged by state Land Commissioner George P. Bush, US Rep. Louie Gohmert and former state Supreme Court Justice Eva Guzman.",
    "There are currently 27 Republican governors and 23 Democratic governors -- with 36 seats up for grabs this November -- including several in battleground states that could play a significant role in deciding the outcome of the 2024 election.",
    "That shift has attracted a wide field of GOP challengers, including Matt Mowers, who lost to Pappas in 2020, former Trump aide Karoline Leavitt and Gail Huff Brown, a former TV anchor and the wife of former Massachusetts Sen. Scott Brown.",
    "GOP Sen. Josh Hawley has endorsed US Rep. Vicky Hartzler in the primary, with state Attorney General Eric Schmitt, US Rep. Billy Long, state Senate President Pro Tempore Dave Schatz and St. Louis attorney Mark McCloskey also in the mix.",
    "The two have engaged in a political tug-of-war, with McGeachin on multiple occasions using her powers as acting governor to issue executive orders while Little was out of state, only to have the governor rescind them upon his return.",
    "The matchup will be an early test of Trump's sway in GOP primaries, with the former President backing Mooney over McKinley, who did not object to counting the Electoral College vote and supported the bipartisan infrastructure bill.",
    "Trump is backing Morgan Ortagus, a former State Department spokesperson, while two top allies of the former President -- US Reps. Marjorie Taylor Greene and Madison Cawthorn -- are supporting social media influencer Robby Starbuck.",
    "April 5: Special election primary in California's 22nd Congressional District\nFormer GOP Rep. Devin Nunes set off this special primary contest with his resignation from Congress in January to join Trump's new social media venture.",
    "In the Silver State's race for governor, incumbent Democrat Steve Sisolak is seeking a second term, with several Republicans lining up to run against him, including former US Sen. Dean Heller and Clark County Sheriff Joe Lombardo.",
    "But the conservative firebrand is running against two well-funded opponents: Katie Britt, a former top aide to retiring Republican Sen. Richard Shelby, and Mike Durant, an aerospace executive and former Blackhawk helicopter pilot.",
    "That optimism has produced a crowded Democratic field, which includes former US Labor Secretary Tom Perez, state Comptroller Peter Franchot, author and former nonprofit chief Wes Moore and former US Education Secretary John King.",
    "Ron DeSantis, a Republican, who has made himself a national figure with a laissez-faire approach to the Covid-19 pandemic and willingness to embrace hot-button conservative causes, might be eyeing another office in a few years.",
    "Valadao is the only House Republican running for reelection who voted for to impeach Trump in 2021 for inciting the January 6 insurrection at the US Capitol and doesn't have a challenger endorsed by the former President (yet).",
    "Mace, who represents the 1st District, voted to certify the election results (but not for impeachment) and has tried to walk the Trump tightrope, criticizing his actions at times and embracing the former President at others.",
    "Paxton's rivals have taken aim at his legal problems, but Trump has thrown his support behind the incumbent, who led a failed effort to challenge the 2020 election results in four battleground states at the US Supreme Court.",
    "The outcome of these two races could dictate heading into 2024 how much attention and resources Democrats will deploy to Florida, which has been one of the premier battleground states in presidential races for many cycles.",
    "Beyond elections for governor, state races for secretary of state and attorney general will receive unprecedented attention, as the battle over how elections are handled intensifies in the aftermath of the 2020 campaign.",
    "Trump has thrown his support behind former state Rep. Katie Arrington, who defeated former Rep. Mark Sanford in the 2018 GOP primary for the 1st District, only to lose to Democrat Joe Cunningham in the general election.",
    "The former President has endorsed former TV anchor Kari Lake, who is running for governor, and state Rep. Mark Finchem, a candidate for secretary of state, both of whom have cast doubts about the 2020 election results.",
    "Trump has yet to endorse in the Arizona GOP Senate primary, but his impact on the field has been felt in how the leading candidates are positioning themselves to align with the former President's policies and politics.",
    "Yet economic anxiety punctuated by inflation concerns combined with exhaustion over the coronavirus pandemic has tilted the political environment in favor of Republicans, who also have electoral history on their side.",
    "That list of hopefuls includes state Attorney General Mark Brnovich, businessman Jim Lamon and venture capitalist Blake Masters, who has the backing of tech billionaire Peter Thiel and the anti-tax Club for Growth.",
    "Sparked by the former President's falsehoods, GOP lawmakers in Arizona launched a months-long partisan review of the results in Maricopa County, home to Phoenix, which ultimately confirmed Biden's victory there.",
    "The former football star has Trump's support as he seeks to defeat Democratic Sen. Raphael Warnock, who scored a 2-point victory in a Senate special election runoff against Republican Kelly Loeffler last year.",
    "The crowded field also includes former US ambassador to Denmark Carla Sands, who, like the top contenders, is relying on her personal wealth, and Jeff Bartos, the party's 2018 nominee for lieutenant governor.",
    "Among the candidates on the Republican side are Rep. Lee Zeldin, 2014 GOP gubernatorial nominee Rob Astorino, businessman Harry Wilson and Andrew Giuliani, the son of former New York City Mayor Rudy Giuliani.",
    "While Ohio has been trending red in recent years, Ryan is hoping to follow a similar blue-collar blueprint that has helped Sen. Sherrod Brown win statewide three times, most recently against Renacci in 2018.",
    "His management of the coronavirus pandemic has become the target of fierce criticism from opponent Jim Renacci, a former GOP congressman who has accused DeWine of governing Ohio \"like a blue-state liberal.\"",
    "June 7: California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota primaries; special election in California's 22nd Congressional District (if necessary)\nLast September, California Gov.",
    "The district also became much more Republican in redistricting, so while the seat shouldn't be competitive in November, it could be easier for a more right-wing candidate to defeat Taylor in the primary.",
    "At a forum last December, none of the five candidates who participated were willing to answer a plain \"yes\" when asked whether they thought Biden won a \"constitutional majority in the Electoral College.\"",
    "Rep. Van Taylor is a conservative Republican, but he voted to accept the 2020 presidential election results and supported an independent commission to investigate the January 6 attack on the US Capitol.",
    "In the GOP Senate primary, the crowded contest has at times veered toward political theater as several top contenders -- most notably former state Treasurer Josh Mandel and \"Hillbilly Elegy\" author J.D.",
    "This year, the battleground in the Old Dominion will center on two competitive House races featuring a pair of Democrats first elected in the 2018 blue wave -- Reps. Abigail Spanberger and Elaine Luria.",
    "Kay Ivey is running for a second full term but is being challenged by several candidates in the GOP primary, including Lindy Blanchard, who served as ambassador to Slovenia in the Trump administration.",
    "Now the question is whether the state's top election official can withstand a primary challenge from Trump-backed US Rep. Jody Hice, who embraced the former President's false claims about the election.",
    "In states with partisan control of the process, both parties have tried to draw new maps to their advantage: to pick up more seats, shore up incumbents or reduce the number of competitive districts.",
    "Tennessee Republicans cracked Democratic Rep. Jim Cooper's Nashville-based seat in redistricting, diluting the power of the vote in Davidson County, spreading it across three GOP-leaning districts.",
    "Meanwhile, in Nebraska's 1st Congressional District, embattled GOP Rep. Jeff Fortenberry is facing a primary challenge from state Sen. Mike Flood, who has been endorsed by Ricketts and former Gov.",
    "After a history of teasing potential statewide bids only to pass, Democratic Rep. Tim Ryan decided to take the plunge (with a helpful shove from redistricting) and launched a bid for US Senate.",
    "She also might benefit from the fact that she could win the primary without receiving a majority of the vote, as Hageman has not cleared the field of Cheney challengers despite Trump's support.",
    "In addition to Lake, the other Republican contenders include former US Rep. Matt Salmon, developer and former Arizona Board of Regents member Karrin Taylor Robson and businessman Steve Gaynor.",
    "A dozen Democrats have lined up to take on the two-term incumbent, who has evolved from a tea party insurgent during his first run in 2010 to a promoter of Covid-19 and January 6 conspiracies.",
    "Those contests will tee up Election Day on November 8, when control of the House and Senate will be up for grabs as well as several high-profile gubernatorial races in key battleground states.",
    "Phil Scott, a Republican who leads one of the most Democratic states in the nation, will also be up for reelection (Vermont governors serve two-year terms) but he's yet to announce his plans.",
    "Pete Ricketts urged Trump to stay out of the GOP primary to replace him, but the former President spurned the request and threw his support behind businessman Charles Herbster last October.",
    "Casten flipped a GOP-held seat in 2018 while Newman narrowly defeated conservative Democratic Rep. Dan Lipinski in a 2020 primary before winning her general election race by double digits.",
    "Democratic Sen. Maggie Hassan of New Hampshire is one of the GOP's top targets in 2022, but the party's hopes of flipping the seat took a hit last November when popular Granite State Gov.",
    "The FBI searched Cuellar's home and campaign office in January, but the nine-term congressman released a video a week later vowing to seek reelection despite the \"ongoing investigation.\"",
    "The GOP field includes state Senate President Pro Tempore Jake Corman, former US Rep. Lou Barletta, former US Attorney Bill McSwain, state Sen. Doug Mastriano and businessman Dave White.",
    "The former President rebuffed the advice of GOP leaders to remain neutral and threw his support behind Miller, a freshman member who has stirred controversy since arriving in Congress.",
    "But Upton has not yet officially announced if he's running for another term, which would mean having to face off against fellow GOP Rep. Bill Huizenga in the newly drawn 4th District.",
    "August 2: Arizona, Kansas, Michigan, Missouri and Washington primaries\nTwo states at the center of Trump's lies about the 2020 election will vote on this day -- Arizona and Michigan.",
    "In the 7th Congressional District, Trump has backed state Rep. Russell Fry against Rice, who was one of the 10 House Republicans to vote in favor of Trump's impeachment last January.",
    "The top contender in the GOP field is former state Attorney General Adam Laxalt, the party's 2018 nominee for governor, who has managed to unite the Trump and Mitch McConnell wings.",
    "The race to succeed retiring GOP Sen. Pat Toomey was upended last November when Trump-backed candidate Sean Parnell ended his campaign amid scrutiny of his turbulent personal life.",
    "In Michigan, Trump has endorsed two statewide candidates who've spread election falsehoods -- Kristina Karamo for secretary of state and Matthew DePerno for state attorney general.",
    "July 26: North Carolina runoffs (if necessary)\nThe calendar in July is rather bare, unless any of the North Carolina primary contests in May require a runoff to decide the winner.",
    "The lone Democratic candidate is state Attorney General Josh Shapiro, who was one of the leading officials rebutting false claims about the commonwealth's 2020 election results.",
    "Levin has deep political roots in the state, with his father, Sander, serving in the US House for more than 30 years and his uncle Carl Levin serving six terms as a US senator.",
    "August 9: Connecticut, Minnesota, Vermont and Wisconsin primaries\nWisconsin Sen. Ron Johnson is the only Republican senator seeking reelection in a state Biden carried in 2020.",
    "With Trump having carried the Natural State by more than 20 points in 2020, Sanders is poised to follow in her father's footsteps and become Arkansas' first female governor.",
    "Larry Hogan unable to run for a third term in Maryland, Democrats are hopeful about their prospects of retaking the governor's mansion after eight years of Republican rule.",
    "The fate of two Trump targets could be decided this day in South Carolina, where the former President has endorsed primary challengers to GOP Reps. Tom Rice and Nancy Mace.",
    "The packed field currently includes Secretary of State Nellie Gorbea, former Secretary of State Matt Brown and Helena Foulkes, a former executive at Rhode Island-based CVS.",
    "But first, he needs to win a second term, with the possibility of a decisive victory likely to only spark further speculation about his ambitions beyond the Sunshine State.",
    "Perdue lost his Senate runoff to Democrat Jon Ossoff in January 2021, which some Republicans blamed, in part, on Trump's efforts to undermine the state's election results.",
    "Ricketts later endorsed Nebraska University Regent Jim Pillen, setting up a proxy battle between the two GOP leaders who both carried the Cornhusker State by wide margins.",
    "John Fetterman, an outspoken progressive and strong fundraiser, and Rep. Conor Lamb, a Marine Corps veteran and former federal prosecutor, are seen as the top contenders.",
    "Zinke is now eyeing a return to Capitol Hill after Montana gained a House seat following the 2020 census, though he's facing scrutiny about his current ties to the state.",
    "Josh Green, a doctor who has been one of the main faces of the state's pandemic response, former Hawaii first lady Vicky Cayetano and former Honolulu Mayor Kirk Caldwell.",
    "They are seeking to challenge incumbent Democrats Jocelyn Benson and Dana Nessel, who have pushed back on Trump's efforts to undermine the state's 2020 election results.",
    "Kathy Hochul will face off against US Rep. Tom Suozzi and New York City Public Advocate Jumaane Williams in the Democratic primary as Hochul seeks a full term in office.",
    "The majority in the Senate, currently split 50-50 with Vice President Kamala Harris serving as a tiebreaker, is expected to come down to a handful of competitive races.",
    "The outcome of November's elections will serve as a referendum on President Joe Biden's first two years in office and set the table for the 2024 presidential campaign.",
    "Biden and congressional Democrats have scored some legislative victories and are poised to confirm a history-making pick to the Supreme Court in Ketanji Brown Jackson.",
    "Vance -- have sought to burnish their conservative pro-Trump credentials with incendiary rhetoric and inflammatory displays of opposition to public health precautions.",
    "Three Democrats are hoping to derail DeSantis' rise, with US Rep. Charlie Crist, a former Republican governor, trying to reclaim his seat as Florida's chief executive.",
    "He's now facing several primary challengers who question the results of the election, criticize Taylor's vote on the commission and downplay the Capitol insurrection.",
    "Nevada Sen. Catherine Cortez Masto is one of the most endangered Senate Democrats running this year, looking to carry a state Biden won by less than 3 points in 2020.",
    "With the potential for as many as 10 competitive House races this fall, the state's top-two primary system could be a major factor in shaping the battleground map.",
    "The Buckeye State has a pair of Republican primary battles that could offer early clues about the GOP electorate heading into the heart of the nominating calendar.",
    "Texas will kick things off on March 1, and the primary process will wrap up more than six months later on September 13 in Delaware, New Hampshire and Rhode Island.",
    "Now he's seeking a third term, with the onetime tea party darling turned Trump critic having fully embraced the former President amid Florida's shift to the right.",
    "Two House Republicans from Washington who voted for Trump's impeachment -- Jaime Herrera Beutler and Dan Newhouse -- will also face GOP primary voters on this day.",
    "Luria's 2nd District, meanwhile, became more favorable to Republicans under redistricting, with state Sen. Jen Kiggans seen as a top contender in the GOP primary.",
    "The Democratic candidates hoping to succeed Hobbs include Adrian Fontes, the former Maricopa County recorder, and Arizona House Minority Leader Reginald Bolding.",
    "Current Arizona Secretary of State Katie Hobbs, a Democrat, is running for governor, putting her defense of the state's elections at the center of her candidacy.",
    "The state GOP will endorse a candidate at its convention in May and most, if not all, of the other candidates could drop their bids if they don't earn that nod.",
    "Democrats have their own incumbent vs. incumbent primary in the 6th District, where Reps. Sean Casten and Marie Newman will compete for the party's nomination.",
    "Among the Democratic contenders are state Rep. Bee Nguyen, who succeeded Abrams in the state legislature, and former Fulton County Commission chair John Eaves.",
    "The new congressional map in Michigan has set up an all-incumbent primary battle in the 11th district featuring Democratic Reps. Haley Stevens and Andy Levin.",
    "Walker announced in January he would stay in the Senate race, defying Trump's effort to get the former congressman to drop his bid and run for a House seat.",
    "Finchem is joined in the GOP secretary of state primary by state Sen. Michelle Ugenti-Rita, who has advocated for so-called election integrity legislation.",
    "On the Democratic side, state Attorney General Maura Healey, who entered the race after Baker declined to run again, leads the entire field in fundraising.",
    "Redistricting is poised to make New Hampshire's 1st Congressional District, currently held by Democratic Rep. Chris Pappas, more favorable for Republicans.",
    "The senator has faced tough reelection campaigns before -- winning as a write-in candidate in 2010 after losing the GOP primary to a tea party challenger.",
    "West Virginia is poised to hold the country's first incumbent vs. incumbent primary of the 2022 cycle, featuring GOP Reps. David McKinley and Alex Mooney.",
    "Davis, now in his fifth term, is an ally of House Republican leadership and poised to become a committee chairman if the GOP wins control of the chamber.",
    "Republicans have incumbents seeking reelection in Wisconsin and Florida, and they're defending three open seats in Pennsylvania, North Carolina and Ohio.",
    "On the Democratic side, it's a battle between two former mayors, with Dayton's Nan Whaley and Cincinnati's John Cranley squaring off for the nomination.",
    "First, he must get through a GOP primary that includes challenges from former (Florida) Rep. Allen West and businessman and ex-state Sen. Don Huffines.",
    "GOP Rep. David Valadao is running in the newly drawn 22nd District in the Central Valley, which became more favorable to Democrats under redistricting.",
    "Georgia Secretary of State Brad Raffensperger stood up to Trump's demands that he \"find\" the votes to overturn the 2020 election results in the state.",
    "The Dallas-area 3rd Congressional District is the site of a battle over how the GOP should handle the 2020 election and the events of January 6, 2021.",
    "Fortenberry was indicted last fall for allegedly concealing information and lying to federal authorities investigating illegal campaign contributions.",
    "Retired Army Special Forces officer Joe Kent is challenging Beutler, while failed 2020 gubernatorial candidate Loren Culp is seeking to oust Newhouse.",
    "So far, the former President has held off on throwing his support behind another candidate, a move that could shake up the trajectory of the primary.",
    "The winner of the GOP primary will likely face Democrat Stacey Abrams, who lost the 2018 gubernatorial race to Kemp by less than 2 percentage points.",
    "The competition on the Democratic side features candidates with distinct backgrounds who represent divergent ideological factions within the party.",
    "The GOP contest in the 15th District will provide another test of Trump's endorsement strength, with Reps. Mary Miller and Rodney Davis facing off.",
    "Pat McCrory, former US Rep. Mark Walker and Army veteran Marjorie K. Eastman also in the running to succeed retiring Republican Sen. Richard Burr.",
    "Dan McKee was elevated to the top job when Gina Raimondo was appointed as Biden's commerce secretary last year, and he's now seeking a full term.",
    "Sen. Alex Padilla, appointed by Newsom to the seat vacated by Harris ahead of her becoming vice president, is running for a full six-year term.",
    "One leading candidate is Scott Jensen, a former state senator and family doctor, who has voiced vaccine skepticism and opposition to mandates.",
    "But Democratic Sen. Pat Leahy's decision to call it quits after almost 50 years in the Senate started a domino effect that could change that.",
    "The former astronaut is running for a full six-year term after defeating appointed Republican Sen. Martha McSally in a 2020 special election.",
    "Businessman Kevin Rinke and former Detroit police chief James Craig are among a packed field of GOP candidates looking to challenge Whitmer.",
    "Some of those decisions were driven by redistricting, the once-a-decade process of redrawing congressional and state legislative boundaries.",
    "Now the Democrat appears to be coasting toward a second term in office -- which could serve as a platform for a national run down the road.",
    "US Rep. Val Demings, a former Orlando police chief, is the prohibitive favorite in the Democratic primary and has been a strong fundraiser.",
    "While he doesn't have electoral experience like Diehl, Doughty was able to open his campaign with half a million dollars of his own money.",
    "Hawaii is one of the most Democratic states in the country, so the winner of the Democratic primary will be heavily favored in November.",
    "Trump has also endorsed state Rep. Steve Carra, who had launched a bid against Rep. Fred Upton, another GOP member who voted to impeach.",
    "Rebecca Kleefisch, state Rep. Timothy Ramthun and Kevin Nicholson, who lost in the 2018 Senate Republican primary, among the contenders.",
    "In North Carolina, Trump's early surprise endorsement of US Rep. Ted Budd failed to clear the GOP Senate primary field, with former Gov.",
    "Another race to keep an eye on is the new 27th District around Los Angeles, where GOP Rep. Mike Garcia is a top target of Democrats.",
    "Murkowski is the lone Republican running for reelection this year who voted to convict Trump at his impeachment trial in the Senate.",
    "Democratic Sen. Mark Kelly and his massive campaign war chest await whichever candidate emerges victorious on the Republican side.",
    "Brian Kemp, whose decision to certify Biden's narrow win in Georgia unleashed fierce and frequent attacks by the former President.",
    "The attacks culminated with Trump's endorsement of former US Sen. David Perdue after he launched a primary challenge against Kemp.",
    "There are four Democratic incumbents running in battleground states Biden won in 2020: Arizona, Georgia, Nevada and New Hampshire.",
    "In Missouri, there is a crowded GOP primary to succeed retiring Republican Sen. Roy Blunt in a state that should favor the party.",
    "The coincidence of both states holding primaries on the same day sets up an epic test of the former President's sway in the GOP.",
    "Given that, Murkowski is almost certain to advance to the November vote, where she could benefit from the reallocation process.",
    "The Republicans were drawn into the new 2nd Congressional District after the state lost a House seat following the 2020 census.",
    "Poliquin is eyeing a rematch in the 2nd Congressional District with Jared Golden, the Democrat who defeated him four years ago.",
    "She lost a special election and general election to him in 2020, with the latter race decided by a margin of just 333 votes.",
    "Among his Democratic challengers is Rudy Salas, a California assemblyman and former member of the Bakersfield City Council.",
    "On the Democratic side, the party has largely cleared the field for former state Supreme Court Chief Justice Cheri Beasley.",
    "His failed 2016 presidential bid upended that trajectory and led Rubio to reverse course and seek reelection to the Senate.",
    "Like in California, the top two finishers in the primary advance to the general election, regardless of party affiliation.",
    "While the GOP primary for governor is unsettled, Republican Herschel Walker has plenty of running room in the Senate race.",
    "Daniel Cox, who is running in the GOP primary against Hogan's preferred candidate, state Commerce Secretary Kelly Schulz.",
    "Former state Rep. Geoff Diehl originally launched his campaign as a challenge to Baker and picked up Trump's endorsement.",
    "Charlie Baker to not seek a third term in deep-blue Massachusetts sets up another test of Trump's power inside the GOP.",
    "In Alabama, US Rep. Mo Brooks is hoping the former President's support will help deliver him the GOP Senate nomination.",
    "The new congressional maps, drawn by an independent commission, have scrambled the Golden State's political landscape.",
    "Prior to serving as Trump's interior secretary, Ryan Zinke spent about two years representing Montana in the US House.",
    "The other contenders to take on DeSantis are state Agriculture Commissioner Nikki Fried and state Sen. Annette Taddeo.",
    "Ultimately, whether Republicans lean toward a candidate like Jensen or Shah or a more mainstream pick like state Sens.",
    "Despite favoring Democrats at the federal level, Massachusetts has a habit of electing moderate Republican governors.",
    "There will likely be another crowded primary on this day on the Democratic side in the Rhode Island governor's race.",
    "Still, he is facing a primary challenge from Army veteran Sam Brown, who has demonstrated some fundraising strength.",
    "California is losing a US House seat for the first time in the state's history because of slower population growth.",
    "In Arkansas, Sarah Huckabee Sanders -- a former White House press secretary under Trump and daughter of former Gov.",
    "Mooney objected to the Pennsylvania electoral count, but not Arizona, and voted against the infrastructure package.",
    "Democratic Rep. Peter Welch, the state's lone House member, is trying to move across the Capitol to succeed Leahy.",
    "Eric Greitens emerges as the nominee, it could put the seat in play for Democrats, given his scandal-plagued past.",
    "Blanchard initially launched a bid for the open Senate seat but switched gears to run for governor last December.",
    "Both Democrats flipped suburban districts previously held by Republicans -- McBath in 2018 and Bourdeaux in 2020.",
    "His challengers include former state assemblywoman Christy Smith, who is running for a third time against Garcia.",
    "Sununu's decision sets up what could be a long and crowded GOP primary, given New Hampshire's late primary date.",
    "But while Diehl won't have the popular incumbent as an opponent, he also doesn't have a clear lane to November.",
    "Democrats see the Keystone State as perhaps the party's best opportunity to flip a Republican-held Senate seat.",
    "At the same time, Padilla must run in a special election for the remaining weeks of the original Harris term.",
    "Trump has endorsed Harriet Hageman, a onetime critic, as the candidate to fulfill his goal of ousting Cheney.",
    "Molly Gray and state Sen. Becca Balint both declared for the seat shortly after Welch made his announcement.",
    "Rounding out the field is state Rep. Malcolm Kenyatta, who has won the backing of some progressive groups.",
    "Trump endorsed McGeachin last November, calling her a \"a true supporter of MAGA from the very beginning.\"",
    "The former President has backed Kelly Tshibaka, who formerly led Alaska's Department of Administration.",
    "Working in Cheney's favor are her family's deep roots in the state and her massive campaign war chest.",
    "Greg Abbott is seeking reelection to a third term, which could set the stage for a potential 2024 bid.",
    "Brooks has struggled to take command of the field, prompting frustration from the former President.",
    "The last time a Republican candidate won a statewide office in Minnesota was 2006, when former Gov.",
    "Gretchen Whitmer, who was on Biden's short list for vice president, is also seeking a second term.",
    "Two of Trump's top GOP targets in 2022 are Wyoming Rep. Liz Cheney and Alaska Sen. Lisa Murkowski.",
    "Now Perdue is making Trump's lies about the 2020 election a cornerstone of his bid to defeat Kemp.",
    "There is also a wide-open race for governor in Pennsylvania, with Democrat Tom Wolf term-limited.",
    "The district's new lines make it a safer seat for Democrats than the one Stevens flipped in 2018.",
    "And the Republican National Committee took the unprecedented step of censuring the congreswoman.",
    "Mike Huckabee -- has a clear path to the Republican nomination as she seeks to succeed GOP Gov.",
    "That fact has failed to dissuade Republican candidates from embracing Trump's baseless claims.",
    "Gen. Don Bolduc and state Senate President Chuck Morse, who's received praise from McConnell.",
    "Georgia won't be the only state testing the power of Trump's endorsement on this primary day.",
    "Hochul became the first female governor of the Empire State last August after Democratic Gov.",
    "Misinformation about Covid-19 and the 2020 election have been key issues in the GOP primary.",
    "Without Baker on the ballot, Democrats are hopeful they'll avoid such a fate this November.",
    "Trump, and his lies about the election, are expected to be a driving factor in the primary.",
    "Warnock has been a prolific fundraiser, beginning 2022 with nearly $23 million in the bank.",
    "(CNN)Voting ends in the first primaries for the 2022 midterm elections in a matter of days.",
    "LePage is looking to challenge Democrat Janet Mills, who won the 2018 race to succeed him.",
    "Chris Doughty, a businessman and self-described moderate, joined the race in late January.",
    "Another physician, Neil Shah, has suggested he took an unproven drug to treat coronavirus.",
    "Mandela Barnes, Milwaukee Bucks executive Alex Lasry and state Treasurer Sarah Godlewski.",
    "David Ige from seeking a third term, and several Democrats have lined up to succeed him.",
    "Senate Minority Leader Mitch McConnell and his allies are firmly behind Murkowski's bid.",
    "On the Democratic side, Marine veteran Lucas Kunce appears to be the leading contender.",
    "In Maine, a pair of Republicans are attempting political comebacks -- with former Gov.",
    "In the House, Republicans need a net gain of five seats to win control of the chamber.",
    "That's set up a Democratic primary in which two of the leading candidates are women.",
    "Paul Gazelka or Michelle Benson, the primary may well be decided long before August.",
    "Ned Lamont and Sen. Richard Blumenthal, both Democrats, also face voters this year.",
    "Candidates include former Londonderry Town Manager Kevin Smith, retired Army Brig.",
    "More than 40 members, mostly Democrats, have announced they are leaving Congress.",
    "Both contenders are pumping massive amounts of their personal wealth into TV ads.",
    "Former state House Speaker Beth Harwell is running for the redrawn seat as well.",
    "Before DeSantis, Sen. Marco Rubio was seen as the GOP's rising star in Florida.",
    "Paul LePage and former US Rep. Bruce Poliquin both running for their old jobs.",
    "Democrat Quaye Quartey, a retired Navy intelligence officer, is also running.",
    "He faces a primary challenge from consumer protection attorney Morgan Harper.",
    "Vermont is the only state in the union that's never sent a woman to Congress.",
    "It has also sparked a GOP showdown for the new 5th Congressional District.",
    "August 23: Florida primaries; Oklahoma runoffs (if necessary)\nFlorida Gov.",
    "There are already signs of a brewing feud between Newsom and Florida Gov.",
    "Gavin Newsom became the second governor in US history to defeat a recall.",
    "The district will have new boundaries for the election held in November.",
    "September 6: Massachusetts primaries\nThe decision by Republican Gov.",
    "US Rep. Kai Kahele has also been mentioned as a potential candidate.",
    "Candidates only need to top 30% of the vote to avoid that scenario.",
    "(He opposed the select committee that was eventually created.)",
    "Both have Trump-backed opponents in their all-party primaries.",
    "But Rhode Island Democrats aren't just letting McKee have it.",
    "Andrew Cuomo resigned amid allegations of sexual harassment.",
    "August 13: Hawaii primaries\nTerm limits prevent Hawaii Gov.",
    "Several Republicans are running to prevent Democratic Gov.",
    "Idaho is another state home to a GOP civil war, with Gov.",
    "The leading Democratic challengers appear to be Lt. Gov.",
    "In total, 34 Senate seats will be decided in November.",
    "Brad Little getting a primary challenge from Lt. Gov.",
    "The move prompted Cooper to announce his retirement.",
    "Some Republicans are concerned that if former Gov.",
    "Tony Evers is less crowded, with former Lt. Gov.",
    "Crist leads the Democratic field in fundraising.",
    "So has House Minority Leader Kevin McCarthy.",
    "State Sen. Sonia Chang-Díaz is also running.",
    "He has pleaded not guilty to the charges.",
    "The GOP field to take on Democratic Gov.",
    "Ron DeSantis, a top GOP 2024 prospect.",
    "Mike DeWine is seeking a second term.",
    "Tim Walz from winning a second term.",
    "Tim Pawlenty was narrowly reelected.",
    "Chris Sununu passed on a Senate bid.",
    "The primary field includes Lt. Gov.",
    "The top target for Trump is Gov.",
    "On the same day, New York Gov.",
    "Trump has endorsed state Del.",
    "With popular Republican Gov.",
    "In Nebraska, outgoing Gov.",
    "Janice McGeachin.",
    "Connecticut Gov.",
    "Democratic Gov.",
    "Republican Gov.",
    "Asa Hutchinson.",
    "Dave Heineman.",
    "Then-Lt. Gov.",
    "Vermont Gov.",
    "Alabama Gov.",
    "Texas Gov.",
    "Lt. Gov.",
    "Lt. Gov."
  ]
}