{
  "id": 4402,
  "mediaId": 2919,
  "date": "2022-02-27",
  "headline": "WATCH: Gov. Mike DeWine visits Ukrainian church in Parma",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/d77bcc3/2147483647/strip/true/crop/1280x672+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F0a%2Ff9%2F5e8cabcc456fb5abe1a27e5fe28a%2Fposter-image-3.jpg",
  "link": "https://www.news5cleveland.com/news/local-news/watch-live-gov-mike-dewine-visits-ukrainian-church-in-parma",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camryn Justice",
  "authorUrl": "https://www.news5cleveland.com/camryn-justice",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine declared a \"Day of Prayer\" for Ukraine, he and his wife Fran headed to Parma to attend a Ukrainian church service in the city in an effort to stand in solidarity with Ukraine as Russia's invasion of the country continues.",
    "You can watch his comments in the player below:\nDeWine has been vocal about his stance against Russia, ordering Ohio to cease the purchase and sale of Russian Standard vodka as a form of \"sanction\" on the country.",
    "The service began at 9:30 a.m. You can watch it in the player below:\nThe governor spoke following the church service, sharing his support for Ukraine and speaking out against Russian president Vladimir Putin.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "DeWine also said he hopes President Joe Biden continues providing as much aid to Ukraine as possible while also taking action against Putin.",
    "DeWine and his wife attended St. Andrew Ukrainian Catholic Church to show their support for Ukraine and for Ohio's Ukrainian population.",
    "\"I just urge the president to continue to give as much military assistance as we can can to the people Ukraine,\" DeWine said.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "\"What's going on in Ukraine affects all Ohioans, it affects all Americans,\" DeWine said.",
    "Download now on your Apple device here, and your Android device here.",
    "\"We must make sure that Putin pays a very heavy price for this.",
    "We should continue to tighten all things down against them.",
    "And so we should care very much about what happens there.\"",
    "You know, we should not be buying products from Russia.",
    "\"This was an unprovoked brutal attack on democracy.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "This is just absolutely horrible.\"",
    "PARMA, Ohio — On the day Gov."
  ]
}