{
  "id": 4516,
  "mediaId": 2532,
  "date": "2022-03-04",
  "headline": "Nearly all GOP governors call on White House to reverse energy decisions, boost energy production",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/03/04/37941f1e-ddd4-4f21-9bca-2418237c5b67/thumbnail/1200x630/6d208b719c390a43bb32a9f186e774bc/gettyimages-1235978730.jpg",
  "link": "https://www.cbsnews.com/news/republican-governors-domestic-energy-production/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As Russia's invasion of Ukraine threatens to upend global energy markets, nearly all of the country's Republican governors are calling on President Biden to boost domestic energy production, in some cases by reversing orders he signed in the opening days of his presidency to combat climate change, and to diversify U.S. sources of energy with measures like restarting work on the Keystone XL Pipeline.",
    "War in Ukraine\n More\n Antony Blinken and Lloyd Austin headed to Kyiv, Zelenskyy says\n Why Russia keeps losing armored vehicles: \"It's finders keepers\"\n Mariupol evacuation \"thwarted\" by Russian forces as death toll mounts\n Russia claims Mariupol win as Ukrainian forces hold on\n Koch Industries says it will stop doing business in Russia\n More\n Adam Brewster\nCBS News political reporter.",
    "\"By removing his bans on new oil and gas development on federal lands, building the Keystone XL pipeline, and reinstating regulatory reforms to streamline energy permitting, we can protect our national energy security and sell to our friends rather than buy from our enemies—specifically Russia.\"",
    "A new United Nations report released earlier this week found that further delays in cutting carbon pollution and preparing for climate change-related impacts could cause the world to \"miss a brief and rapidly closing window of opportunity to secure a liveable and sustainable future for all.\"",
    "Despite Mr. Biden's announcement halting new federal oil and gas leasing in January 2021, a report from the liberal advocacy group Public Citizen showed Mr. Biden outpaced former President Donald Trump in approving drilling permits during their first years in office.",
    "\"As governors, we call on President Biden to reverse his policies and restore America's energy independence for our citizens as well as our allies abroad,\" the governors said in a statement obtained exclusively by CBS News.",
    "In his State of the Union address, Mr. Biden also touted ideas like providing tax credits to Americans who weatherize their homes, doubling the production of clean energy sources and lowering the cost of electric vehicles.",
    "A White House spokesperson noted that Keystone was never operational, so \"any impact it would have on prices\" would be years down the line and the pipeline \"would have done nothing for the current supply imbalance.\"",
    "The statement was signed by 25 of the nation's 28 Republican governors, including moderates like Maryland Governor Larry Hogan and conservatives like Florida Governor Ron DeSantis and Texas Governor Greg Abbott.",
    "Last month, the Biden administration paused decisions on new oil and gas drilling on federal lands after a federal judge issued a ruling blocking the way officials were calculating costs of climate change.",
    "Because of high energy costs, President Biden announced during his State of the Union that the United States and 30 other countries would release 60 million barrels of oil from reserves around the world.",
    "The company in charge of the pipeline, which proponents say would have moved 830,000 barrels of crude oil from Alberta, Canada and Montana to the Gulf Coast, terminated the project in June.",
    "A CBS News poll released on Tuesday found 56% of Americans are concerned about their ability to pay for gas and 51% are concerned about paying for heat and electricity.",
    "Republicans have sharply criticized the administration's energy policies going back to his decision to revoke the permit for the Keystone XL pipeline in January 2021.",
    "\"Of the more than 37 million acres under lease offshore and onshore to the oil and gas industry, nearly 60 percent are non-producing,\" the spokesperson said.",
    "\"People in our states cannot afford another spike at the gas pump, and our allies cannot afford to be held hostage by Putin's tyranny and aggression.\"",
    "Democrats want to more quickly transition away from fossil fuels and encourage development of renewable energy sources such as wind and solar.",
    "The president said the goal is to combat the effects of climate change and cut energy costs for families by an average of $500 per year.",
    "Only Massachusetts Governor Charlie Baker, Ohio Governor Mike DeWine and Vermont Governor Phil Scott did not sign on to the statement.",
    "The Republican call for more domestic oil production comes as the Biden administration's climate agenda is stalled on Capitol Hill.",
    "The national average for a gallon of gas as of Thursday was $3.73, according to AAA, about a dollar higher than it was a year ago.",
    "\"Family budgets have already been stretched thin following record inflation,\" the Republican governors said in their statement.",
    "\"The Biden Administration has been clear: In the short-term, oil supply should keep up with demand, here and around the world.",
    "The White House also said that there is \"no shortage of drilling leases that can be used domestically to enhance production.\"",
    "That same CBS News poll found that 30% of Americans approve of the job the president is doing on inflation.",
    "Mr. Biden's first year in office has been plagued by high energy prices and inflation at a 40-year high.",
    "In November, the White House recommended that oil and gas companies pay more to drill on public lands.",
    "The U.S. will release 30 million barrels of oil from its Strategic Petroleum Reserve.",
    "It is decisions being made about supply and production by companies and producers.\"",
    "\"We stand ready to do more if necessary, unified with our allies,\" Mr. Biden said.",
    "Many environmental advocates hoped for stronger actions, such as an outright ban.",
    "It is not Government policies impacting prices right now.",
    "\"These steps will help blunt gas prices here at home.\"",
    "Fin Gomez and Ben Tracy contributed to this report.",
    "It likely would have taken years to complete.",
    "Twitter"
  ]
}