{
  "id": 4604,
  "mediaId": 2658,
  "date": "2022-02-19",
  "headline": "POLITICO Playbook: World braces for ‘decisive moment in history’",
  "image": "https://static.politico.com/5b/d6/ebb9f2a548df818185f9d2e846ff/gettyimages-1371487512.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/19/world-braces-for-decisive-moment-in-history-00010365",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1823,
    1984,
    3589,
    3673,
    3709,
    4042,
    656,
    831,
    5287
  ],
  "sentences": [
    "HAPPY BIRTHDAY: Reps. Carolyn Maloney (D-N.Y.) and Raúl Grijalva (D-Ariz.) … Andrew Ross Sorkin … Facebook’s Sean Conner … John Gentzel … Alexis Covey-Brandt of House Majority Leader Steny Hoyer’s office … Justin Rouse … Kevin Bishop of Sen. Lindsey Graham’s (R-S.C.) office … Gary Andres … Stewart McLaurin of the White House Historical Association … Tamara Hinton … Olga Ramirez Kornacki of the House-Radio TV Gallery … Sandeep Hulsandra … VOA’s Daria Dieguts … Judy Kurtz … Tucker Warren … POLITICO’s Jen Plesniak … Carbon180’s Noah Deich … Nick Solheim … The New Yorker’s Sarah Stillman … John J. Miller … Capital One’s Joe Vidulich … Chase Kroll … AEI’s Jason Bertsch … Kaitlyn Martin … Hunter Lovell of House Minority Whip Steve Scalise’s (R-La.)",
    "In her statement, Gollust said that her relationship with Zucker “changed during Covid.” That claim “rankled some employees at WarnerMedia and CNN, who believed it had turned romantic before the onset of the Covid-19 pandemic.” In including that statement in its reporting on the matter, some employees of the network felt that “Gollust’s statement misled CNN’s audience.”\nPart II: NYT’s Michael Grynbaum, John Koblin and Emily Steel report that Gollust “was forced to resign … after an internal investigation found a trove of written communications between her and [then-New York] Governor [ANDREW] CUOMO, including messages” about a March 2020 appearance he made on CNN.",
    "My Life Hasn’t Been the Same Since,” by NYT’s Frank Bruni: “The people around me came into sharper focus, by which I mean their fears, struggles and triumphs.”\n— “Democrats, Speak to Working-Class Discontent,” by Stanley Greenberg for The American Prospect: “It’s the one way to mobilize Blacks, Hispanics, and Asians, not just white workers.”\n— “Francis Ford Coppola’s $100 Million Bet,” by GQ’s Zach Baron: “Fifty years after he gave us ‘The Godfather,’ the iconic director is chasing his grandest project yet — and putting up over $100 million of his own money to prove his best work is still ahead of him.”\n— “Driving While Baked?",
    "(More from NonDoc's Matt Patterson and Tres Savage)\nNow, on to more serious news …\nBREAKING, via AP: “Top Ukrainian military officials come under shelling attack during tour of conflict front, flee to bomb shelter.”\nA CALL TO ARMS BY RUSSIAN-BACKED REBELS — Hours after President JOE BIDEN said he was “convinced” that Russian President VLADIMIR PUTIN has decided to invade Ukraine, a shift is happening on the ground: Russian-backed rebels today issued a call to arms, urging all men in the Russian-led breakaway regions in eastern Ukraine to fight, report WSJ’s Ann Simmons and Alan Cullison.",
    "POLITICO Playbook: World braces for ‘decisive moment in history’\nBy RACHAEL BADE and ZACK STANTON\n02/19/2022 10:24 AM EST\n Updated 02/21/2022 02:59 PM EST\n 2022-02-21T02:59-0500\nPresented by\nDRIVING THE DAY\nLEDE OF THE DAY — “ABBY BROYLES, an Oklahoma City Democrat running for Congress, said Friday that a combination of medication and alcohol led to a bizarre scene last weekend in which she allegedly insulted young girls at a slumber party and threw up at least twice,” writes Chris Casteel for The Oklahoman.",
    "Chelsea Clinton has a new picture book coming out in September, “Welcome to the Big Kids Club: What Every Older Sibling Needs to Know!”\nIN MEMORIAM — “Art Cooley, a Founder of the Environmental Defense Fund, Dies at 87,” by NYT’s Richard Sandomir: “He was part of a small group of scientists and citizens on Long Island that was instrumental in banning the toxic pesticide DDT, first locally and then nationally.”\nMEDIA MOVE — Hugh Hewitt has ended his role as an MSNBC contributor, per WaPo’s Jeremy Barr.",
    "“Capitol Police said in a statement that they were ‘aware of plans for a series of truck convoys arriving in Washington, DC around the time of the State of the Union.’ They added that they were ‘closely coordinating with local, state and federal law enforcement agencies.’”\nHeads up: “USCP confirms restoring the Capitol fence is on the table for the State of the Union,” Nicholas writes on Twitter — but no decisions have been made yet.",
    "All the rejections have cited Ohio’s new redistricting rules, approved by voters in 2015 and 2018 as an anti-gerrymandering reform.”\nWhere things stand now: “The redistricting commission’s failure to act Thursday left the state with no valid state legislative maps in the face of mounting election-related deadlines, sending the state into uncharted legal territory while jeopardizing a smooth and accurate May election.”\n8.",
    "… Mehta said Trump’s own words and conduct in falsely alleging a ‘stolen’ election were not immune on separation-of-powers grounds because they served only his personal aim of retaining office, falling beyond the ‘outer perimeter’ of a president’s official responsibilities.”\nFrom Mehta’s ruling: Trump’s statements leading up to and on Jan. 6 were plausibly “an implicit call for imminent violence or lawlessness.",
    "Where we’re at: More than 15 months after DONALD TRUMP lost Wisconsin, “an increasingly vocal segment of the Republican Party is getting behind a new scheme: decertifying the results of the 2020 presidential election in hopes of reinstalling Mr. Trump in the White House.” And the effort “is picking up steam rather than fading away — and spiraling further from reality as it goes.”\nWho’s behind the effort?",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "We want peace.”\n— More from Munich: “Western leaders implore Putin to step back from ‘real’ risk of war,” by Giorgio Leali and Cory Bennett\nFurther reading:\n— Defense Secretary LLOYD AUSTIN said in a press conference in Lithuania today that Russian forces are “uncoiling and are now posed to strike” Ukraine, per Reuters’ Phil Stewart and Andrius Sytas.",
    "Despite the Omicron-related spike, U.S. health officials haven’t decided whether to suggest hospitals revamp their infection control measures, three officials told POLITICO.”\nCLICKER — “The nation’s cartoonists on the week in politics,” edited by Matt Wuerker — 15 funnies\nGREAT WEEKEND READS, curated by Ryan Lizza:\n— “One Day, I Couldn’t See Right.",
    "The backstory to ALLISON GOLLUST’s resignation from CNN:\nPart I: WSJ’s Ben Mullin and Joe Flint report that Gollust, CNN’s chief marketing officer, resigned this week “after network parent WarnerMedia determined a statement she gave about her romantic relationship with former CNN President JEFF ZUCKER was misleading.”\nWhat was “misleading”?",
    "What happened: “In a searing, 112-page opinion that quoted repeatedly and at length from the former president’s own public statements, [Mehta] refused to dismiss three lawsuits against Trump by Democratic House members and police officers seeking damages for physical and emotional injuries they incurred in the assault.",
    "— More on Biden’s address to the nation Friday: “Biden says he believes Putin has decided to invade Ukraine,” by Nahal Toosi and Myah Ward\nTHE STEP BACK: ‘WHAT IF RUSSIA WINS?’ — Liana Fix and Michael Kimmage are up with a story in Foreign Affairs asking what happens next if Russia invades and triumphs.",
    "The gist: On Friday, the court agreed “to hear an appeal from President Biden and decide whether he may end the Trump administration’s policy of requiring migrants seeking asylum to wait on the Mexican side of the border until their cases can be heard,” writes L.A. Times’ David Savage.",
    "Putin also “presided over a test of the nation’s strategic nuclear readiness, delivering a powerful reminder to the West: Russia is a nuclear power, and Mr. Putin has the most powerful and destructive weapons ever devised at his disposal,” write NYT’s Marc Santora and David Sanger.",
    "At the outset of their one-on-one meeting, Harris said it was “a decisive moment in history,” and told Zelenskyy, “Any threat to your country we take seriously.” Per the AP, Zelenskyy suggested the gravity of the occasion had sunk in: “We clearly understand what is going on.",
    "But here’s the line raising eyebrows: “NARA has also learned that some White House staff conducted official business using non-official electronic messaging accounts that were not copied or forwarded into their official electronic messaging accounts,” as required by law.",
    "?who has turned his push to decertify the election into a nascent campaign for governor” and “become a folk hero to the party’s Trump wing.” At his campaign launch last weekend, he was introduced by MIKE LINDELL, the MyPillow CEO and election-fraud conspiracy theorist.",
    "How law enforcement is preparing: “The Metropolitan Police Department said in a statement it was aware of potential protests and had increased available resources, including Civil Disturbance Units, in preparation,” Nicholas Wu writes for Congress Minutes.",
    "So how did the Feds ensnare him in an arms-dealing sting?”\nPLAYBOOKERS\nTucker Carlson said that Alexandria Ocasio-Cortez is “not” a “woman of color” — “she’s a rich, entitled white lady.” AOC responded on Twitter by suggesting that Carlson is a pendejo.",
    "He called for thousands ‘to fight like hell’ immediately before directing an unpermitted march to the Capitol, where the targets of their ire were at work, knowing that militia groups and others among the crowd were prone to violence.”\n7.",
    "Considering how much you bragged about how ‘rich and successful’ you are to these children, surely you can afford to replace her shoes!”\n— Broyles is challenging Republican Rep. STEPHANIE BICE in a district that already leans Republican.",
    "The National Archives confirmed reports that it “identified items marked as classified national security” among the boxes of White House records it recovered from Trump’s Mar-a-Lago residence, it disclosed in a letter released Friday.",
    "The backstory: Republican Chief Justice MAUREEN O’CONNOR and three Democratic justices have formed a majority “that’s rejected two previous sets of state legislative maps and one congressional map Republicans previously have approved.",
    "‘Republicans now are arguing over whether we want democracy or not,’ Mr. Evers said in an interview on Friday.” The state also has a high-profile Senate race this year, as a number of Democrats seek to unseat GOP Sen. RON JOHNSON.",
    "Today, Harris met with Ukrainian President VOLODYMYR ZELENSKYY, who left his country to attend the conference but is planning to return to Kyiv shortly amid concerns that Russia could launch a military offensive while he is gone.",
    "If Russia invades Ukraine, she said, it will face “significant and unprecedented” economic sanctions, and the West will punish “those who are complicit and those who aid and direct this unprovoked invasion,” per France 24.",
    "U.S. District Judge AMIT MEHTA “sweepingly rejected former President Donald Trump’s claim of ‘absolute immunity’ from lawsuits accusing him of inciting the violent Jan. 6, 2021, Capitol riot,” writes WaPo’s Spencer Hsu.",
    "… The Leadership Conference on Civil and Human Rights and the Leadership Conference Education Fund have added Erica Southerland as managing director of comms and Kanya Bennett as managing director of government affairs.",
    "The timeline: “The justices fast-tracked the administration’s appeal, setting the case for oral argument in late April — with a decision expected before the court’s summer recess,” writes SCOTUSblog’s Amy Howe.",
    "‘Done,’ she wrote.” CNN leaders described it as a serious violation “of the network’s journalistic standards,” and suggested Gollust’s resignation was necessary to “defend the institution and the brand.”\n5.",
    "The political risk for Republicans: “After more than a decade of Republican leaders marching in lock-step with their base, the party is hobbled by infighting and it’s Democrats who are aligned behind Gov.",
    "In January, more hospital patients contracted the coronavirus than at any previous point of the pandemic, report Rachael Levy and Allan James Vestal, citing a POLITICO analysis of federal health data.",
    "THE SHOWS (Full Sunday show listings here):\nCBS “Face the Nation”: Secretary of State Antony Blinken … NATO Secretary-General Jens Stoltenberg … Chris Krebs … House Majority Whip Jim Clyburn (D-S.C.).",
    "MIKE DEWINE and the GOP-controlled state’s redistricting commission in contempt “for failing to follow a court order to produce a new state legislative map,” reports Cleveland.com’s Andrew Tobias.",
    "Ms. Gollust, CNN’s longtime chief of communications and marketing and a former top aide of the governor, passed along the topics to CNN producers and then reported back to the governor.",
    "But the sources also stressed that those feelings dissipated a bit on Wednesday, after Clyburn was quoted in the Washington Post saying he didn’t view his lobbying as an ultimatum.”\n3.",
    "MEANWHILE, IN MUNICH … VP KAMALA HARRIS, in perhaps the biggest foreign policy moment of her career, delivered a stern warning to the Kremlin at the Munich Security Conference today.",
    "These two responsibilities — robustly defending European peace and prudently avoiding military escalation with Russia — will not necessarily be compatible.”\nGood Saturday morning.",
    "NBC “Meet the Press”: Secretary of State Antony Blinken … William Taylor … San Francisco Mayor London Breed … Richard Engel reporting from Ukraine and Matthew Bodner from Russia.",
    "If he were to select Childs it would be interpreted as a political play — designed either to reward Clyburn for his backing or cash in on Graham’s pledge for bipartisan support.",
    "But Putin clearly sees an upside: “If Russia gains control of Ukraine or manages to destabilize it on a major scale, a new era for the United States and for Europe will begin.",
    "— A mother of one of the girls: “Not only did you scare and traumatize these beautiful girls with your words, you ruined a pair of their shoes with your vomit!",
    "One company is aiming to fix that.”\n— “It’s not ‘The’ Ukraine,” by Franklin Foer for The Atlantic: “The country is much more than a sphere of influence.”\n— “?",
    "officials “have grown exasperated” with House Majority Whip JIM CLYBURN’s (D-S.C.) public campaign to pressure Biden into nominating J. MICHELLE CHILDS.",
    "Before the interview, Cuomo told Gollust “about subjects that he’d like to be asked about on air, according to several people familiar with the matter.",
    "Inside the High-Tech Quest to Find Out,” by Amanda Chicago Lewis for Wired: “There is no scientific way to tell if you’re stoned behind the wheel.",
    "HARRIS’ SATURDAY — In Munich, the VP has already delivered remarks at the Munich Security Conference and held a bilateral meeting with Zelenskyy.",
    "But also: “The Centers for Disease Control and Prevention hasn’t recommended that all health care workers and visitors wear N-95s at all times.",
    "U.S. and European leaders would face the dual challenge of rethinking European security and of not being drawn into a larger war with Russia.",
    "In 2015, the Obama administration was surprised by — but downplayed — Russia’s entry into the Syria conflict, arguing that it would backfire.",
    "“What the Obama administration failed to anticipate was the possibility that Russia’s intervention would succeed,” Fix and Kimmage write.",
    "— Putin’s use of “false flags” — expected to trigger war any hour now — have actually defined his entire career, per WaPo’s Adam Taylor.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "But he’s doing it cautiously, wary of setting expectations that end in failure,” report Marianne LeVine and Christopher Cadelago.",
    "In the most recent direction, the court on Feb. 7 ordered the redistricting commission to approve a new map before [Feb. 17].",
    "“The main issue before the court is whether Biden moved too hastily and without adequate rationale” when ending the policy.",
    "He’s also met with Sen. CHUCK GRASSLEY (R-Iowa), who described the outreach as “so far, very good.”\nHarris has called Sens.",
    "Fast forward to now: The U.S. and Europe are once again warning of “dire consequences” for Russia if it goes all the way.",
    "…\n… Ashley O’Sullivan is now a director in the consumer products practice group of Invariant’s government relations team.",
    "?‘He Was the Black Version of Gordon Gekko,’” by N.Y. Mag’s Andrew Rice: “Kevin Ingram was a genius at calculating risk.",
    "A “fringe scheme” to somehow overturn the 2020 election is splitting the GOP in Wisconsin, reports NYT’s Reid Epstein.",
    "SUSAN COLLINS (R-Maine), LISA MURKOWSKI (R-Alaska) and MITT ROMNEY (R-Utah) and Minority Leader MITCH MCCONNELL.",
    "An Ottawa-style trucker protest may be headed for Washington, D.C., around the time of the State of the Union.",
    "CNN “State of the Union”: Secretary of State Antony Blinken … Finnish President Sauli Niinistö … Colorado Gov.",
    "Southerland previously was director of marketing and comms for the Congressional Black Caucus Foundation.",
    "Bennett most recently was senior policy counsel and legislative coalition manager at the Bail Project.",
    "Dinkes is president of Knowledge Alliance and previously was at the American Institutes for Research.",
    "All sides would have to consider the potential of nuclear-armed adversaries in direct confrontation.",
    "At 9:30 a.m. Eastern time, she was scheduled to begin a meeting with German Chancellor OLAF SCHOLZ.",
    "ABC “This Week,” with Martha Raddatz anchoring from Lviv, Ukraine: Defense Secretary Lloyd Austin.",
    "U.S. officials have been fearful that Ukraine could try to block his re-entrance into his country.",
    "Wasch previously was legislative director and deputy chief of staff for Sen. Jack Reed (D-R.I.).",
    "Panel: Karl Rove, Jennifer Griffin and Harold Ford Jr.\nMSNBC “The Sunday Show”: California Gov.",
    "Panel: Susan Glasser, Scott Jennings, Kristen Soltis Anderson and Rep. Colin Allred (D-Texas).",
    "FOX “Fox News Sunday,” guest-anchored by Bill Hemmer: John Kirby … Sen. Ted Cruz (R-Texas).",
    "CNN “Inside Politics”: Panel: Amy Walter, Hans Nichols, Vivian Salama and Melanie Zanona.",
    "… Penn Hill Group is adding Elyse Wasch as VP and Rachel Dinkes as a senior adviser.",
    "Biden “is actively looking for Republican support for his Supreme Court nominee.",
    "TRANSITIONS — Monna Kashfi is joining Welcome.US as VP of content and comms.",
    "She most recently was director of government affairs at AmerisourceBergen.",
    "The Supreme Court will decide the future of the “Remain in Mexico” policy.",
    "“Those officials believe the open push for Childs has put Biden in a box.",
    "Instead, the Kremlin used the moment to solidify its power in the region.",
    "Gavin Newsom … Jane Harman … Interior Secretary Deb Haaland … Janet Dees.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n9 THINGS WE READ THAT STUCK WITH US …\n1.",
    "Panel: Yamiche Alcindor, Courtney Kube, Peggy Noonan and Ashley Parker.",
    "office (25) … Jill Lawrence … Andy Abboud of the Las Vegas Sands Corp.",
    "BIDEN’S SATURDAY — The president has nothing on his public schedule.",
    "What that outreach looks like:\nBiden has personally called Sens.",
    "Panel: Rick Klein, Donna Brazile, Rachael Bade and Frank Luntz.",
    "), JONI ERNST (R-Iowa) and SHELLEY MOORE CAPITO (R-W.Va.).",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Gray TV “Full Court Press”: Austan Goolsbee … Ron Fong.",
    "Add on this incident, and, well … good luck with that.",
    "TONY EVERS, who is seeking a second term in November.",
    "White House counsel DANA REMUS has spoken with Sens.",
    "She previously was chief content officer at WAMU.",
    "LINDSEY GRAHAM (R-S.C.) and JOSH HAWLEY (R-Mo.).",
    "Ohio’s Supreme Court is threatening to hold Gov.",
    "Send Playbookers tips to playbook@politico.com.",
    "(Which she saved up to buy with her own money!)",
    "Why was that March 2020 appearance a problem?",
    "Did someone forward this email to you?",
    "That’s a problem for police — and you.",
    "Another storyline to watch:\nSome W.H.",
    ": GOP state Rep. TIMOTHY RAMTHUN, “?",
    "She’ll remain in Munich overnight.",
    "The Omicron variant, of course.",
    "Thanks for reading Playbook.",
    "DEB FISCHER (R-Neb.",
    "What’s behind it?",
    "This is our land.",
    "Sign up here.",
    "Jared Polis.",
    "9.",
    "6.",
    "4.",
    "2."
  ]
}