{
  "id": 4648,
  "mediaId": 2658,
  "date": "2022-02-22",
  "headline": "T-7 days until the Texas primaries",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/02/22/t-7-days-until-the-texas-primaries-00010489",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1439,
    1478,
    2201,
    2430,
    2936,
    2972,
    2985,
    4322,
    5351
  ],
  "sentences": [
    "But retirements of House Democrats have also created opportunities for the left by clearing away obstacles for younger upstart progressives, which could result in a smaller but more liberal House Democratic Caucus after the dust settles on the 2022 midterms.”\nTHE MAP LINES — “Redistricting: Ohio Supreme Court gives commission until Wednesday to explain why it can't draw maps,” by Anna Staver, The Columbus Dispatch: “Ohio's Supreme Court wants a written explanation by noon Wednesday for why the state's redistricting commission shouldn't be held in contempt for failing to draw new legislative maps.”\n— “Park Slope and Staten Island: An Unlikely Political Marriage,” by Katie Glueck, The New York Times: “The once-in-a-decade redistricting effort has created unusual congressional district lines all over the country, reflecting a partisan process embraced by Republicans and Democrats alike.",
    "The race to represent a swath of Southern California that sweeps from southeastern Los Angeles cities to Long Beach will be among the state’s most contested intraparty battles, with the winner earning a perch that could become a springboard to higher office.”\nMIDTERM MESSAGING — “'The clock is ticking': Democrats on defense as Republicans pursue Latino voters,” by Marc Caputo, NBC News: “Hispanic voters are more open to GOP attacks on Democrats and they're drifting more toward Republicans on major issues in this year’s midterm elections, according to data released this week by both parties’ House campaign arms.”\nSTAFFING UP — Ohio GOP Gov.",
    "Now Hice is using election denial as the basis of his campaign for secretary of state, a position that would put him in charge of certifying vote counts and overseeing elections statewide.”\nPresidential Big Board\nTRUMP CARD — “Trump's GOP critics to gather in Washington with an eye on 2024 presidential race,” by Robert Costa, CBS News: “A group of Republican critics of former President Donald Trump will gather in Washington, D.C., this week to cheer on the two GOP members of the House select committee investigating the January 6 assault on the U.S. Capitol, Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "And Trump’s Save America PAC, Save America JFC (joint fundraising committee) and MAGA PAC report ending January with a massive $123.8 million cash on hand.”\nENDORSEMENT ALERT — “SBA List backs Hartzler in Missouri Senate primary,” by Natalie Allison, POLITICO: “One of the nation’s leading anti-abortion groups is choosing a side in Missouri’s heated GOP Senate primary, becoming the latest to back Rep. Vicky Hartzler in a contest that top Republicans say could make or break their chances of holding a Senate seat this fall.\"",
    "Their two-day conference, called ‘Principles First: The Summit,’ will also champion state GOP officials who refused to support Trump's efforts to block President Joe Biden from taking office after the 2020 election.”\nWHERE ARE THEY NOW — “Tulsi Gabbard to speak at CPAC,” by Max Greenwood, The Hill: “Former Rep. Tulsi Gabbard (D-Hawaii) is set to speak at the Conservative Political Action Conference (CPAC) this week, the chair of the group that organizes the gathering announced on Monday.",
    "Ron DeSantis and the Florida Legislature came into sharper focus on Friday as the governor’s office paid for a conservative redistricting expert to appear before the House Congressional Redistricting Subcommittee and the committee rejected his arguments.”\nTHE GOLDEN STATE — “Prominent Latino Democrats fight over rare open California congressional seat,” by Seema Mehta, Los Angeles Times: “Two prominent Latino Democratic elected leaders are battling to become a new member of Congress.",
    "The contribution, detailed in a new campaign finance filing from Opportunity Matters Fund, is the latest — and largest — step in a budding political relationship between the senator and the Oracle chair.”\n— “Trump hauls in over $7 million in January, with nearly $124 million in his coffers,” by Paul Steinhauser, Fox Business: “Former President Donald Trump’s standing as the most prolific fundraiser in the Republican Party remains firmly intact.",
    "Now she’s trying to parlay her notoriety as a leading election denier into a seat in the state legislature.”\n— “GOP hopeful for Georgia election chief campaigns on 2020 denial,” by Mark Niesse, The Atlanta Journal-Constitution: “Republican Congressman Jody Hice says he still doesn’t believe the outcome of the 2020 presidential election was correct, more than a year after he objected to counting Georgia’s electoral votes for Democrat Joe Biden.",
    "Gabbard, who once sought the 2020 Democratic presidential nomination, will address the annual conference’s Ronald Reagan Dinner on Saturday night.”\nCODA — HEADLINE OF THE DAY — “US House candidate allegedly went on drunken tirade, vomited at pre-teen sleepover” — New York Post\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "And some say they steered clear of the former president intentionally as they raised money to take back the Senate.”\n— “The money race in two incumbent vs. incumbent primaries is heating up -- and Trump's endorsements haven't helped,” by Melissa Holzberg DePalo, CNN: “Republican candidates across the country are vying for former President Donald Trump's endorsement to help shore up campaign funds and excite the GOP base.",
    "HINDSIGHT IS 2020 — “Trump campaign’s star witness pursues a second act,” by Brittany Gibson, POLITICO: “Mellissa Carone’s contentious performance as a star witness at a December 2020 Michigan election fraud hearing catapulted her overnight from unknown IT contractor to Saturday Night Live parody character.",
    "(Countdown numbers have been updated for you already)\nDays until the Texas primary: 7\nDays until the CA-22 special election primary: 542\nDays until the Indiana and Ohio primaries: 71\nDays until the general election: 259\nDays until the 2024 election: 987\nWant to receive this newsletter every weekday?",
    "— “Larry Ellison pumps $15M into super PAC aligned with Tim Scott,” by Scott Bland, POLITICO: “Tech billionaire Larry Ellison gave a massive $15 million donation to a super PAC aligned with Sen. Tim Scott (R-S.C.) in January, one of the biggest political donations of the 2022 election cycle so far.",
    "?Democratic retirements imperil majority but make way for the left,” by Alex Seitz-Wald, NBC News: “The wave of congressional Democrats heading for the exits has set alarm bells ringing in the party as it tries to retain its narrow congressional majorities in this year's midterm elections.",
    "But perhaps no other district in New York City contains constituencies so clearly in opposition to each other as the reconstituted 11th.”\n— Florida GOP in conflict: DeSantis’ redistricting expert doesn’t convince House panel,” by Mary Ellen Klas, Miami Herald: “The conflict between Gov.",
    "PARTY PROBLEMS — “Defiant GOP impeachment voters gear up for Trump-backed primaries,” by Ally Mutnick, POLITICO: “The remaining seven House Republicans who voted to impeach Donald Trump are facing down a vengeful former president, his angry supporters and a summer of primaries.",
    "12,000: Texas election officials have rejected at least 12,000 absentee ballot applications in the state’s most populous counties as of Thursday, a day before the deadline, after Republicans implemented new voting restrictions, according to The New York Times’ Nick Corasaniti.",
    "Cisneros has racked up endorsements from top progressives like Sen. Bernie Sanders (I-Vt.) and Rep. Alexandria Ocasio-Cortez (D-N.Y.), and the primary rematch could provide some momentum for the left as the midterms get into full swing in the spring.",
    "The entire party has been erupting on a near-daily basis here.”\n— “GOP senators steer clear of Trump as rift deepens,” by Burgess Everett and Meridith McGraw, POLITICO: “The Breakers resort is about 3 miles from Mar-a-Lago in Palm Beach.",
    "Their message: We’re ready for the fight.”\nOne tidbit from Ally’s story: Rep. Peter Meijer (R-Mich.) could struggle in his Republican primary against Trump-endorsed John Gibbs, according to an EMILY’s List poll conducted in mid-January.",
    "Paxton, who would need to clear 50 percent of the vote to avoid a runoff, had support from 39 percent of Republican primary voters, compared to Bush’s 25 percent, the Dallas Morning News’ Robert Garrett reported.",
    "Just last month, a grand jury indicted Miller’s top political aide, Todd Smith, for allegedly soliciting up to $150,000 in a hemp license scheme using Miller’s office, according to the Texas Tribune’s Sneha Dey.",
    "39 percent: Embattled state Attorney General Ken Paxton could be headed toward a runoff against state Land Commissioner George P. Bush, according to a new Dallas Morning News-University of Texas at Tyler poll.",
    "But Trump's support hasn't been enough to clear all Republican fields -- something that is on display in two primary races pitting incumbent GOP House members against each other.”\nTO THE LEFT, TO THE LEFT — “?",
    "— “Republicans wince at Wisconsin GOP crack-up,” by David Siders, POLITICO: “Timothy Ramthun’s entry into Wisconsin’s gubernatorial primary last weekend was the car wreck no one could look away from.",
    "The pair align on most policy issues, but Collins has embraced the far-right, touting an endorsement from Rep. Marjorie Taylor Greene (R-Ga.) and demanding a nationwide audit of the 2020 election.",
    "(NRCC filing)\nFIRST IN SCORE: MONEY MOVES — Nevada Republican David Brog raised $100,000 in the first three days of his campaign against Rep. Dina Titus (D-Nevada), according to his campaign.",
    "The survey found Meijer had 26 percent of support compared to Gibbs’ 13 percent of support, but 62 percent of Republican voters said they would back another GOP candidate over Meijer.",
    "6: There are four House lawmakers leaving the Texas congressional delegation this cycle, and the state gained two congressional seats in redistricting, creating six open-seat races.",
    "$150,000: Texas state Agriculture Commissioner Sid Miller has courted so much controversy that he could lose the Republican primary next week, POLITICO’s Ximena Bustillo reported.",
    "Democratic Reps. Filemon Vela and Eddie Bernice Johnson are retiring, while Republican Rep. Kevin Brady is retiring and Rep. Louie Gohmert is running for state attorney general.",
    "His campaign is built around the preposterous idea the 2020 election could still be overturned — something even sympathetic Republicans here acknowledge is impossible.",
    "2,746: Rep. Henry Cuellar (D-Texas) fended off progressive primary challenger Jessica Cisneros in 2020, winning 2,746 more votes than she did in TX-28.",
    "— Former President Donald Trump looms large in races up and down the ballot this year, creating a major rift in the Republican Party ahead of November.",
    "The former president’s fundraising committees raked in $7.2 million in January, according to figures shared first with FOX Business on Sunday evening.",
    "Down the Ballot\nTHE CASH DASH — The major party committees raked in cash during the first month of 2022, according to the newest monthly FEC filings.",
    "There are congressional primaries making national news, a contentious fight for state attorney general and a new law changing the way people vote.",
    "Texas is one of several states that implemented stricter rules around voting, and the March 1 primary will be the first test of new voting rules.",
    "Miller was at one point a top Trump choice to lead the U.S. Department of Agriculture, and he has an endorsement from the former president.",
    "Republicans at the RNC and NRSC outraised their Democratic counterparts last month, but House Democrats raised slightly more than the GOP.",
    "T-7 days until the Texas primaries\nBy STEPHANIE MURRAY\n02/22/2022 10:00 AM EST\nQuick Fix\n— The Texas primaries are only a week away.",
    "11: Speaking of open-seat primaries, there are 11 Republicans running to replace Brady, but conservatives split into two camps.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Republicans Morgan Luttrell and Christian Collins are splitting the party, the Houston Chronicle’s Jasper Scherer wrote.",
    "When more than 20 Republican senators headed there last weekend, though, only three attended an event with Donald Trump.",
    "Cisneros is running against Cuellar again this cycle, in a district that became slightly more blue in redistricting.",
    "Titus’ NV-01 district became significantly less blue in redistricting, although it still voted for Biden in 2020.",
    "Top Line\nEVERYTHING’S BIGGER IN TEXAS — The first big election of the 2022 midterm cycle is only seven days away.",
    "(NRSC filing)\n— DCCC: The DCCC raised $11.7 million and spent $6.8 million with $87.4 million in cash on hand.",
    "(DSCC filing)\n— NRSC: The NRSC raised $18 million and spent $11.7 million with $39.1 million in cash on hand.",
    "(DCCC filing)\n— NRCC: The NRCC raised $11.5 million and spent $7.7 million with $82 million in cash on hand.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "House Democrats have an edge over Republicans, while the RNC and NRSC outraised their Democratic rivals.",
    "Adding to the drama, Cuellar’s Laredo home and campaign office were raided by the FBI several weeks ago.",
    "(RNC filing)\n— DSCC: The DSCC raised $10.7 million and spent $5.1 million with $29.3 million on hand.",
    "(DNC filing)\n— RNC: The RNC raised $13 million and spent $17.6 million with $51.7 million on hand.",
    "Paxton has been accused of bribery and abusing his office, but landed an endorsement from Trump.",
    "McLaughlin previously served as communications director for the Ohio state Republican Party.",
    "But Miller’s habit of making enemies and attracting scandals threaten his time in office.",
    "— DNC: The DNC raised $9.8 million and spent $11.9 million with $63.1 million on hand.",
    "Mike DeWine hired Tricia McLaughlin as communications director for his reelection bid.",
    "… The problem for the Wisconsin Republican Party is that it isn’t just Ramthun.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "Here are five numbers that explain the state of play in the Lone Star State.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Here are six numbers to know before polls close next Tuesday in Texas.",
    "— The first monthly fundraising reports of the midterm year are here.",
    "(The poll surveyed 1,188 registered voters from Feb. 8-15).",
    "These reports cover the month of January.",
    "The committee reported $478,000 in debt.",
    "Subscribe to POLITICO Pro.",
    "Good Tuesday morning!"
  ]
}