{
  "id": 4679,
  "mediaId": 2919,
  "date": "2022-02-15",
  "headline": "Dems: We’ll talk about primaries when fair maps are passed",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/1a62864/2147483647/strip/true/crop/1898x996+0+211/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F64%2F21%2F4142961241558268f92df14260b0%2Fscreen-shot-2022-02-11-at-5.35.42-PM.png",
  "link": "https://www.news5cleveland.com/news/state/dems-well-talk-about-primaries-when-fair-maps-are-passed",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Tebben",
  "authorUrl": "https://www.news5cleveland.com/susan-tebben",
  "termIds": [
    0
  ],
  "sentences": [
    "The Ohio Supreme Court did not move the primary, but reiterated in their rejection of the revised legislative maps that the General Assembly “has the authority to ease the pressure that the commission’s failure to adopt a constitutional redistricting plan has placed on the secretary of state and on county boards of elections by moving the primary election, should that action become necessary.”\nThe secretary of state’s office, which both Republicans and Democrats say they’ve met with, has expressed hesitancy to postpone the May 3 election, or to have two separate primaries.",
    "Russo still believe a primary can be held on May 3 as scheduled “if we take the necessary steps to promptly pass fair, constitutional maps.”\nRepublicans, including Huffman, brought up the idea of holding two primaries to take the pressure off the Ohio Secretary of State’s Office and local boards of election should the redistricting process take them past filing deadlines and administrative timelines for the election.",
    "“He is focused on explaining to the General Assembly the risks associated with trying to run a secure, accurate and accessible election on the current timeline without the finality of new districts.”\nA spokesperson for House Speaker and commission co-chair Bob Cupp did not respond to requests for comment on Monday.",
    "The press conference ended a week that started with multiple committee meetings in the House and Senate to discuss congressional redistricting, all of which were canceled as House Speaker Bob Cupp said the GA didn’t have the support needed to pass new maps, as ordered by the Ohio Supreme Court.",
    "The only specific criticism Fortney gave of the Dem plan was the 1st Senate district, saying the new plan “shoved it into districts that will not have another Senate election until 2024.”\nOne thing Dems said they’d be willing to wait on is deciding whether or not a May primary is possible.",
    "“I’m sure at this point, Democrats believe they could draw House and Senate maps in crayon and watercolor and the same four members of the court would approve their unconstitutional maps,” Senate majority director of communications John Fortney wrote in a statement.",
    "House Minority Leader Allison Russo, state Sen. Vernon Sykes, and Democratic redistricting mapmaker Chris Glassburn met at a press conference on Friday to bring up their versions of legislative maps, but also to give Republicans an ultimatum on the process.",
    "The two previous times the ORC met on legislative redistricting, Sykes and the Democrats expressed their frustration with a lack of transparency and a lack of concessions they say the Republicans were willing to provide as the map-making process went on.",
    "In court filings with the Ohio Supreme Court asking them to uphold the previous maps, GOP members of the ORC asked the court to allow them to use the unconstitutional maps for the primary or wait to file a decision until after the 2022 general election.",
    "Rob Nichols, spokesperson for Secretary of State Frank LaRose, said discussions on the election are “important, complex and ongoing.”\n“We continue to engage in negotiations over redistricting with those involved,” Nichols told the OCJ.",
    "“Right now, the reason we’re not meeting is because (the Republican commission members) can’t get organized on a date and time and place to do that, so we have not received any indications of what they plan on doing,” Sykes said.",
    "“It is not a lack of ability that is delaying the process, rather Republicans lack the will to do what is constitutionally required to deliver the fair maps that Ohioans overwhelmingly demanded not once, but twice,” Russo said.",
    "As of Monday evening, spokespeople for Senate President Matt Huffman, Secretary of State Frank LaRose, Auditor Keith Faber and Governor Mike DeWine said they had no information about when the commission would be meeting.",
    "Mostly the maps contained corrections to precinct lines or single census blocks, some of which were requested by Senate President Matt Huffman asked for in the most recent meetings of the Ohio Redistricting Commission.",
    "After making technical fixes brought up by GOP members of the Ohio Redistricting Commission, Ohio’s Democratic caucuses in the legislature are again pushing for their maps to be a model for redistricting in the state.",
    "The two legislative redistricting plans that came from the ORC were passed on purely Republican majorities, and each time, Sykes left the process feeling as though Democrats weren’t heard and the GOP was unmovable.",
    "Legislative leaders of the party also still believe a May primary is possible, but until maps are produced with bipartisan agreement, they say they can’t come to the table to talk about other election options.",
    "A spokesperson for fellow ORC member and Senate President Matt Huffman, R-Lima, wasted no time in releasing a statement on behalf of the majority party regarding the Dem maps and criticism of the process.",
    "He held a media availability in LA on Thursday, “to talk about Super Bowl LVI, all things Cincinnati Bengals, and all things Ohio ahead of the big game on Sunday,” according to his office.",
    "Mike DeWine, who convenes the Ohio Redistricting Commission and serves as a member, went to Los Angeles this past weekend to watch the Cincinnati Bengals compete in the Super Bowl.",
    "He said staff members have been “exchanging some information.”\nBut despite only days until the deadline, Sykes acknowledged getting the commission together is still an uncertainty.",
    "The nearest deadline for the election is March 19, when the Uniformed and Overseas Citizen Absentee Voting Act says absentee ballots for eligible Ohioans should be sent out.",
    "“Check with the co-chairs,” said Huffman’s spokesperson when asked if Huffman had heard about the commission or provided his own schedule to the commission.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "The maps presented on Friday were the same that were released on Tuesday, which Glassburn said didn’t hold major substantive changes.",
    "“Secretary LaRose is ready and willing to meet at the call of the co-chairs,” LaRose’s spokesman told the OCJ.",
    "Still, Sykes said he is “hopeful” about the newest process, now with a court-ordered deadline of February 17.",
    "With the deadline for legislative approval set for Feb. 13, Cupp said the process will now move to the ORC.",
    "Sykes, D-Akron, is the co-chair of the Ohio Redistricting Commission with House Speaker Bob Cupp, R-Lima.",
    "April 5 starts the early voting period for the state under the current election timeline.",
    "They will have another 30 days to come up with new maps.",
    "Gov."
  ]
}