{
  "id": 4717,
  "mediaId": 2679,
  "date": "2022-02-23",
  "headline": "Contempt threats, primary woes swirl amid Ohio map confusion",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation/contempt-threats-primary-woes-swirl-amid-ohio-map-confusion/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "https://www.seattletimes.com/author/julie-carr-smyth/",
  "termIds": [
    1330,
    1688,
    2588,
    3212,
    3823,
    4208,
    4676,
    994,
    4916,
    5212
  ],
  "sentences": [
    "He said it’s “undisputed” that he used “his leadership and office” throughout the redistricting process to secure maps that could pass constitutional scrutiny, but told justices that, ultimately, he “is but one of seven independent members of a separate constitutional body.”\n“He lacks the legal power or capacity to dictate or compel a specific action, let alone result,” his lawyers wrote.",
    "COLUMBUS, Ohio (AP) — A political stalemate over Ohio’s new legislative maps plunged the state into confusion Wednesday, even as members of a new map-drawing commission defended themselves against potential contempt charges they face for failing to meet the latest court order requiring them to stop gerrymandering.",
    "As the commission’s lawyer, Republican Attorney General Dave Yost asked justices to at least wait to see if new maps are drawn this week before making their decision on whether the panel should be held in contempt of court for blowing a court-set deadline of Feb. 17.",
    "Those included legislative and congressional candidates beholden to the as-yet-established maps, but also a host of those whose certifications are tied to the maps — including candidates for county offices, state school board seats, party positions and judgeships.",
    "Republican Secretary of State Frank LaRose, the state’s chief election officer, told Cupp and Senate President Matt Huffman in a separate letter that it is “impossible to see a scenario” in which conducting a complete primary on May 3 will be possible.",
    "In their joint filings, LaRose and Faber and, separately, Huffman and Cupp, made similar arguments to DeWine’s, contending they cannot be held personally liable for the inability of the redistricting body as a whole to pass constitutional maps.",
    "Advertising\n Skip Ad\nDeWine used his own public statements to explain why the high court should not charge him with contempt, arguing that he has urged the panel to pass constitutional maps — and had no other power available to him.",
    "The officials hold potentially powerful swing votes on the committee, created when Ohio voters overwhelmingly passed measures in 2015 and 2018 to protect the state’s legislative and congressional maps from undue political favor.",
    "House Democratic Leader Allison Russo, another commission member, said her caucus already introduced legislation last month to delay the primary from May 3 to June 7, anticipating the tight redistricting timeline.",
    "He told reporters after Wednesday’s commission meeting he supports a single primary, but would carry out a bifurcated election on two separate dates if lawmakers prefer that.",
    "Cupp said Wednesday he hasn’t polled House Republicans since Yost’s and LaRose’s warning letters, but that moving the date had previously faced pushback within his caucus.",
    "Both have been declared unconstitutional by 4-3 majorities of the Ohio Supreme Court, where Republican Chief Justice Maureen O’Connor has cast the swing vote.",
    "Mike DeWine — tried to deflect the threatened sanctions by telling the Ohio Supreme Court that they believe legal maps might be drawn by the end of the week.",
    "Any two of the three could side with the committee’s two minority Democrats to pass a map, even if the body’s three other Republicans objected.",
    "DeWine’s son, Ohio Supreme Court Justice Pat DeWine, says he will recuse himself if contempt proceedings are begun against his father.",
    "Advertising\n Skip AdSkip AdSkip Ad\nLaRose was compelled Tuesday to certify 2022 primary ballots with many candidate names omitted.",
    "DeWine and LaRose join a third Republican statewide official, Auditor Keith Faber, on the Ohio Redistricting Commission.",
    "He said in a letter that the panel’s inaction is raising “a thousand” never-before-faced legal questions for the state.",
    "So far, however, Republicans have stuck together, passing two maps of Ohio House and Ohio Senate districts.",
    "That was despite all but admitting defeat last week after two failed attempts and declaring an impasse.",
    "The commission is set to meet again Thursday, but no timeline was set for approving a new plan.",
    "Ohio’s congressional map, passed by the state Legislature, was similarly invalidated.",
    "Yost’s plea came a day after he urged state lawmakers to delay Ohio’s May 3 primary.",
    "Members of the bipartisan Ohio Redistricting Commission — including Republican Gov.",
    "Yet, when the panel met Wednesday, no progress was presented, nor any vote taken.",
    "Republican House Speaker Bob Cupp said work was continuing.",
    "Redrawing that map also now falls to the commission.",
    "JULIE CARR SMYTH"
  ]
}