{
  "id": 4791,
  "mediaId": 2537,
  "date": "2022-02-17",
  "headline": "Facing corruption charges, Larry Householder still contacts Ohio House GOP lawmakers",
  "image": "https://www.gannett-cdn.com/presto/2021/06/16/NCOD/122b9717-558a-4dc9-81d5-73a5020cace6-householder_vote_ac_24.jpg?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/17/larry-householder-contacts-ohio-house-lawmakers-despite-criminal-case/6830281001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    0
  ],
  "sentences": [
    "He is the central figure in what federal prosecutors allege was a $60 million bribery scheme to put Householder into power so he could pass a $1.3 billion nuclear power bailout bill for Akron-based FirstEnergy Corp.\nOver the past 18 months, the case saw some dramatic developments:\nLobbyist Juan Cespedes and Householder's political operative Jeff Longstreth pleaded guilty.",
    "But we never discussed any element of this data protection privacy bill at all.”\nRep. Tom Brinkman, R-Mount Lookout, said Householder hadn't contacted him about Carfagna's bill but had sent the occasional holiday greeting.",
    "Edwards, R-Athens, said he receives texts from Householder about legislation from time to time, including an inquiry on Wednesday about House Bill 376, which addresses data privacy, as well as a pharmacy bill.",
    "Rep. Bill Seitz, R-Green Township, supports Carfagna's bill, which he says would protect Ohio consumers from attorneys collecting millions in class-action lawsuits while consumers are left with pennies.",
    "Laura Bischoff is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Former Ohio House Speaker Larry Householder still communicates with Republican lawmakers, including texting his one-time mentee state Rep. Jay Edwards about a hotly contested bill this week.",
    "\"What can I say, people have a right to change their mind.”\nSeitz said Householder had not contacted him about this bill and hadn’t been lobbying on other proposed legislation.",
    "FirstEnergy Corp. fired top executives and disclosed it paid $4.3 million to Sam Randazzo just before he became chairman of the Public Utilities Commission of Ohio.",
    "Carfagna did not support Householder for speaker and he strongly opposed Householder's nuclear bailout bill that is now the center of a public corruption case.",
    "State Rep. Rick Carfagna, R-Genoa Twp., co-sponsor of the data privacy bill, said a couple of Republicans aggressively opposed the bill in caucus.",
    "Edwards opposed the data privacy bill during an internal Ohio House GOP meeting, prompting lawmakers to delay taking a floor vote on it.",
    "Brinkman said the bill was being rushed because it was Carfagna's last day of session before joining the Ohio Chamber of Commerce.",
    "After his arrest, Householder was released on conditions, including he not have any contact with potential witnesses in the case.",
    "I think I responded to his text after session but the bill is something I've raised concerns about for months,\" Edwards said.",
    "Householder, who has pleaded not guilty to federal racketeering charges, did not respond to messages seeking comment.",
    "FirstEnergy signed a deferred prosecution agreement and acknowledged it bribed Randazzo and Householder.",
    "Lobbyist Neil Clark died by suicide in Florida, while wearing a Mike DeWine for governor t-shirt.",
    "That's a principle Householder supported when he and Seitz worked on tort reform together.",
    "\"He texted and asked what was going on and I didn't even talk to him until after session.",
    "Federal agents searched Randazzo's condo and he resigned from the PUCO.",
    "\"I can tell you I don't think he even understood what the bill was.\"",
    "\"I still consider him a friend,\" Edwards said of Householder.",
    "Staff writer Jessie Balmert contributed to this report.",
    "“I will say he has not been lobbying me,” Seitz said.",
    "Clark's family published his memoir after his death.",
    "“I find that interesting,\" Seitz said.",
    "I call him as much as he calls me.",
    "I haven’t talked to him lately.",
    "“We do talk."
  ]
}