{
  "id": 4980,
  "mediaId": 6571,
  "date": "2022-02-23",
  "headline": "Pa. Supreme Court Picks New Map Of U.S. House Districts",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/02/23/eba49508-a40a-43dc-b52e-47839e75ef49/thumbnail/1200x630/704caae6a4c45b9c6392fb99687d6b15/new-pennsylvania-congressional-map.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/pennsylvania-supreme-court-congressional-district-map-new-boundries/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "While 90 percent of Pennsylvanians are in their same district, including most in this region, Westmoreland is split with communities like Murrysville, Penn Township and part of Hempfield joining with the city of Pittsburgh in the new 12th district, while most of the county is in the 14th district.",
    "That took the homes of Pennsylvania Rep. Summer Lee and Edgewood council member Bhavini Patel out of the city-based 12th district where they want to run for Congress, Both said they will run in the 12th even though they don't live in that district.",
    "While the 17th district remains competitive and hard-fought, the 14th district, now represented by Republican Guy Reschenthaler, didn't change much, and neither did the 16th district, represented by Republican Mike Kelly.",
    "The Supreme Court had 13 maps among which to choose, some very partisan Republican and Democratic maps, but in the end they chose a citizen's map that comes closest to maintaining the current congressional lines.",
    "As political editor Jon Delano explains, it maintains a highly competitive district in the suburbs of Pittsburgh, while stretching the city of Pittsburgh district into Westmoreland County.",
    "The city of Pittsburgh remains intact and unsplit in the new 12th district that stretches south into the Mon Valley and, for the first time, includes parts of Westmoreland County.",
    "\"It's a competitive district, which is what we've expected here, what voters deserve, where politicians and candidates have to compete to win their trust,\" says Deluzio.",
    "HARRISBURG (KDKA) - The Pennsylvania Supreme Court has signed off on a new congressional map that creates 17 districts in Pennsylvania, as required by the 2020 census.",
    "\"Our initial numbers show that this has moved from a Republican advantage of plus 2 to a Democratic advantage of plus 1, so very much still a swing seat,\" says Meloy.",
    "\"We believe that our reform-minded message of having term limits and balanced budgets is something that will resonate with Democrats, independents and Republicans.",
    "It's probably just minor logistics but we're going to continue to push forward and reach out to the new voters that are now part of this district,\" says Patel.",
    "She sent a statement saying, \"It is heartbreaking, but not surprising, that my house and my family were very specifically carved into a different district.\"",
    "The new map did add some eastern suburbs into the 17th, including Braddock Hills, Churchill, Edgewood, Forest Hills, Wilkinsburg and part of Swissvale.",
    "In fact, Democrats Chris Deluzio and Sean Meloy who are running in the suburban 17th both live in the city, although they say they too will move.",
    "The new map also maintains the 17th district now represented by Conor Lamb, as mostly a suburban Allegheny County and Beaver County district.",
    "\"Beaver County, most of the suburbs around Pittsburgh -- I think it's a good district, and a fair and competitive map for us,\" says Deluzio.",
    "There is no requirement that a member of Congress live in the district as long as they are a resident of the state.",
    "The two other Democrats in that race include Steve Irwin and Jerry Dickinson, both of whom live in the district.",
    "\"Very excited to get out there and just start talking to voters, small business owners, community leaders.",
    "Republican Jeremy Shaffer and Democrats Sean Meloy and Chris Deluzio think it's winnable for them.",
    "Democratic candidates Steve Irwin, Bhavini Patel and Jerry Dickinson have no problem with this.",
    "Look, a representative, the job is to represent everyone,\" says Pitt law professor Dickinson.",
    "Patel who grew up in Monroeville in the 12th says if she wins, she'll move into the district.",
    "It's the same exact thing that we've been doing,\" says Patel, a young entrepreneur.",
    "\"I've been everywhere: Washington County, Westmoreland County, I've been there.",
    "Quite frankly we weren't really too concerned about the lines,\" says Shaffer.",
    "In this region, the new congressional map is not much different from the old.",
    "Like Patel, Lee says she grew up in the 12th in North Braddock and Rankin.",
    "I feel like this is the perfect district for that message,\" says Shaffer.",
    "WATCH: KDKA's Jon Delano reports\n\"Very excited to run in this district.",
    "Each of these three candidates sees the suburban 17th as up for grabs.",
    "But Republicans think the 17th is very winnable for them this year.",
    "This is where my middle-class family has lived,\" says Meloy.",
    "I've been involved with businesses in Westmoreland County.",
    "I've campaigned for others in Westmoreland County.\"",
    "Irwin for Irwin,\" noted community activist Irwin.",
    "It's a quintessential swing district.",
    "KDKA reached out to Lee for comment.",
    "\"Not much has changed on our end.",
    "\"Irwin is part of this district.",
    "\"I'm very excited about that.",
    "\"I'm really excited about it.",
    "This is a map I grew up in.",
    "In:\nPennsylvania"
  ]
}