{
  "id": 4987,
  "mediaId": 2643,
  "date": "2022-02-18",
  "headline": "Ohio Court Could Hold Redistricting Panel in Contempt Over Maps Dispute",
  "image": "",
  "link": "https://www.newsweek.com/ohio-court-could-hold-redistricting-panel-contempt-over-maps-dispute-1680878",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    1330,
    1688,
    3823,
    759,
    994,
    996,
    5093,
    5212
  ],
  "sentences": [
    "The Brennan Center for Justice and co-counsel filed a motion Friday asking the Supreme Court to enforce its order of the commission \"to show cause why they should not be held in contempt of court, with appropriate remedies to follow.\"",
    "\"For the third time, the Ohio Redistricting Commission has shown its indifference to the Ohio Constitution and the Ohio Supreme Court,\" said Alicia Bannon, director of the Judiciary Program at the Brennan Center, in a statement.",
    "\"No General Assembly district plan has been presented to date that achieves a strictly proportional 54-46 result without committing significant other violations of the Ohio Constitution,\" Huffman said, according to the Dispatch.",
    "\"But what's even worse is having an election that leaves the door open to fraud or causes a scenario where not every voice can be heard or create a level of chaos at our Board of Elections.\"",
    "The commissioners have an obligation to the court and the people of Ohio to explain why they are abdicating their responsibility to ensure fair representation for all Ohioans.\"",
    "The Ohio Redistricting Commission failed to deliver new district maps to the Supreme Court and is now being asked to explain why it shouldn't be held in contempt.",
    "The Ohio Supreme Court ordered the commission to submit new maps by Friday, after two previous proposals were rejected as unconstitutional gerrymandering.",
    "\"We are dangerously close to possibly violating federal law,\" Ohio Secretary of State Frank LaRose said, according to The Columbus Dispatch.",
    "The members have until noon February 23 to explain why they should not be found in contempt for failure to comply with the court's order.",
    "If the commission doesn't come up with a map soon, the Ohio Board of Elections will have to push the state's May primary date back.",
    "The Brennan Center is a nonpartisan law and policy institute that focuses on democracy, criminal justice and the balance of power.",
    "Since September, the commission passed two sets of maps that were found unconstitutional by the Ohio Supreme Court.",
    "GOP members said the Democrats' map was racially gerrymandered and said they couldn't come up with a solution.",
    "\"We have an obligation to follow the court order, whether we like it or not, whether we agree with it or not.",
    "\"We have an obligation to follow the Ohio Constitution,\" Governor Mike DeWine (R-Ohio) told Statehouse News.",
    "It has been working with Ohio petitioners since September challenging the commission's legislative maps.",
    "Republican Senate President Matt Huffman (R-Lima) said the court's order was impossible.",
    "\"The court's orders have been clear: produce fair and proportional legislative maps.",
    "Newsweek reached out to the Ohio Redistricting Commission for comment.",
    "The maps were passed on a 5-2 vote with the Republican majority.",
    "\"We don't want to see the primary date move,\" LaRose told WEWS.",
    "And three, we have an obligation to produce a map.\""
  ]
}