{
  "id": 4994,
  "mediaId": 2537,
  "date": "2022-02-23",
  "headline": "Will Ohio politicians be held in contempt of court for failing to pass district maps?",
  "image": "https://www.gannett-cdn.com/presto/2021/12/08/NCOD/b5765ed8-a0db-4459-8c4d-543093d2f9ed-Oral_Arguments_Redistricting_KWR_09.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/23/ohio-redistricting-supreme-court-hold-leaders-contempt-court/6843083001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    3316,
    3806,
    3823,
    4208,
    4676,
    994,
    1171,
    5212
  ],
  "sentences": [
    "Mike DeWine argued that he was one of seven members, with \"no ability to unilaterally direct or dictate the Commission’s actions or decisions,\" according to a response filed by attorney Marion Little, who also defended the state against COVID-19 closure lawsuits and represented the now-defunct charter school Electronic Classroom of Tomorrow or ECOT.",
    "But Ohio Attorney General Dave Yost said that wasn't an option, writing in a letter to lawmakers: \"The federal court may not order the use of a map that was rejected by the Ohio Supreme Court, where the underlying provision of the state constitution has not been found to violate the federal constitution.\"",
    "\"Each individual member acted in a manner not worthy of a finding of contempt, and accordingly, no individual member nor the Commission itself should be held in contempt,\" wrote attorney Erik Clark, who is representing the commission.",
    "A person can be held in contempt of court for a variety of reasons, including disobeying or resisting a court order, misbehaving in court, not responding to a subpoena or failing to submit to genetic testing in custody cases.",
    "On Wednesday, commission members offered excuses to avoid being held in contempt of court, including that seven individuals couldn't be penalized for the commission's collective failure to craft maps by last Thursday.",
    "Separately, Republican legislative leaders Matt Huffman and Bob Cupp criticized the only maps proposed last Thursday, saying the Democratic proposal \"clearly targeted Republican incumbents with surgical precision.\"",
    "\"Quite simply, we proposed a constitutional plan that complied with the Ohio Supreme Court’s order, but alone we do not have enough votes to pass it,\" House Minority Leader Allison Russo wrote in an affidavit.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "\"The bottom line is that through his leadership and office, the Governor has sought throughout the entire redistricting process to secure a plan passing constitutional scrutiny,\" Little wrote.",
    "The task the Ohio Supreme Court set – to draw new maps within 10 days that comply with the state constitution and court rulings – was \"difficult if not impossible.\"",
    "In the meantime, a group of Republican voters and abortion opponents filed a federal lawsuit, asking a panel of judges to enact the commission's second set of maps.",
    "\"The Republican Commissioners were dead set on not approving it or any other plan that complies with (the Ohio Constitution)’s proportionality requirement.\"",
    "Members of the Ohio Redistricting Commission pleaded with the Ohio Supreme Court not to punish them for failing to pass state House and Senate maps on time.",
    "On Tuesday, Republicans on the Ohio Redistricting Commission revived conversations about passing new state House and Senate maps as soon as this week.",
    "Attorney Phillip Strach, who has defended GOP redistricting cases elsewhere, argued that Democrats engaged in \"racial gerrymandering.\"",
    "The commission violated an Ohio Supreme Court order to draw new maps for the 99 House and 33 Senate districts by midnight Thursday.",
    "Clark asked the Ohio Supreme Court to hold off on any penalties it might impose because mapmakers are still working on a solution.",
    "Democrats on the commission said that they couldn't pass a constitutional plan without the support of at least two Republicans.",
    "According to Ohio law, anyone accused of contempt of court will have an opportunity to be heard, by himself or counsel.",
    "Instead, several Republicans on the commission declared the task impossible after rejecting Democrats' proposed maps.",
    "The Ohio Supreme Court will now decide whether individual members of the commission are held in contempt of court.",
    "But the deadline has already passed and it's not clear how the Ohio Supreme Court will respond to that gesture.",
    "Those maps would have given Republicans a 57-42 advantage in the House and a 20-13 advantage in the Senate.",
    "DeWine did not attend several public hearings about redistricting and has said little in recent meetings.",
    "Mike DeWine, said he would recuse himself from any contempt hearings involving his father.",
    "For a first offense, the maximum penalty is a $250 fine and up to 30 days in jail.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "But DeWine said in past depositions that he had little role in crafting maps.",
    "It's not clear when that decision might come.",
    "Justice Pat DeWine, the son of Gov.",
    "What happens next?",
    "Gov."
  ]
}