{
  "id": 505,
  "mediaId": 3986,
  "date": "2022-04-22",
  "headline": "Ohio National Guard provides armored vehicles for Ukraine",
  "image": "https://americanmilitarynews.com/wp-content/uploads/M113-Armored-Personnel-Carrier.png",
  "link": "https://americanmilitarynews.com/2022/04/ohio-national-guard-provides-armored-vehicles-for-ukraine/",
  "mediaOutlet": "americanmilitarynews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jen Balduf - Springfield News-Sun",
  "authorUrl": "https://americanmilitarynews.com/author/jen-balduf-springfield-news-sun/",
  "termIds": [
    1688,
    747,
    751,
    754,
    768,
    5212,
    5287,
    5366
  ],
  "sentences": [
    "Last month, DeWine signed an executive order prohibiting state of Ohio investment or purchasing activity from aiding Russia, and ordered all state agencies, boards and commissions, state educational institutions and pension funds to the extent practicable to divest investment in and terminate contracts with Russian institutions or companies.",
    "“Ohio has a strong Ukrainian community, and we stand behind them and their families overseas.”\nAPCs provide protection from small arms fire and the effects of artillery as they move soldiers and equipment across the battlefield, according to the release.",
    "Mike DeWine announced Wednesday afternoon that the Ohio Army National Guard will give an undisclosed number of M-113 Armored Personnel Carriers to Ukraine following a request from the U.S. Department of Defense to support the war-torn country.",
    "In February, DeWine directed the Ohio Department of Commerce to halt the purchase and sale of all vodka made by Russia Standard, the only overseas Russian-owned distillery with vodka sold in Ohio.",
    "More than two dozen law enforcement agencies in Ohio agreed to donate unneeded equipment, including about 75 ballistic and riot helmets and 840 pieces of body armor, including vests and plates.",
    "Earlier this month, the Ohio Department of Public Safety began collecting surplus or expired personal protective gear to donate to the Ukraine civilian defense.",
    "“As we continue to learn about Russian war crimes in Ukraine, those of us in Ohio stand ready to help the Ukrainian people in any way possible,” DeWine stated.",
    "Law enforcement agencies that would like to offer unneeded personal protective gear to Ukraine should contact their nearest Ohio State Highway Patrol post.",
    "Also in February, the governor declared Feb. 27 a Day of Prayer in Ohio to show support for Ukrainians under attack by Russia.",
    "The Ohio Army National Guard will provide armored vehicles to Ukraine as it battles a Russian invasion.",
    "___\n(c) 2022 Springfield News-Sun\nDistributed by Tribune Content Agency, LLC",
    "Gov."
  ]
}