{
  "id": 5078,
  "mediaId": 2919,
  "date": "2022-02-22",
  "headline": "Wickliffe woman shoots boyfriend after being struck multiple times; boyfriend later arrested",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/ed6e75a/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fdc%2F2c%2F4dbb33a842009e873cc07e319ea4%2Fhandcuffs-jail-cell.jpeg",
  "link": "https://www.news5cleveland.com/news/local-news/wickliffe-woman-shoots-boyfriend-after-being-struck-multiple-times-boyfriend-later-arrested",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Drew Scofield",
  "authorUrl": "https://www.news5cleveland.com/drew-scofield",
  "termIds": [
    5401
  ],
  "sentences": [
    "Domestic violence in Ohio\nStatewide, 131 people died from domestic violence in Ohio between June 30, 2020 and June 2021, a 20% increase in fatalities over the same time the previous yearlong period, and a 62% increase over the same time two years ago, according to the Ohio Domestic Violence Network.",
    "WICKLIFFE, Ohio — A 47-year-old Wickliffe man was arrested on a felony domestic violence charge over the weekend after he allegedly struck his girlfriend during an argument and was later shot when he tried to prevent her from leaving their home.",
    "Mike DeWine signed the bill stating, \"I have always believed that it is vital that law-abiding citizens have the right to legally protect themselves when confronted with a life-threatening situation.\"",
    "Following his arrest, the man was transported to a Lake County Jail and held in lieu of a $100,000 bond\nPolice said the woman has not been charged with a crime in connection with the shooting.",
    "Stand Your Ground law\nLast year, Ohio passed its own \"Stand Your Ground\" law that eliminated the requirement for someone to retreat before firing a weapon in self-defense.",
    "In Wickliffe, 28 domestic violence charges were handed out in 2020, compared to 44 in 2019 and 34 in 2018, according to the office of Ohio Attorney General Dave Yost.",
    "According to police, the woman returned home earlier that morning and was met by her boyfriend who confronted her about an argument they had before she left.",
    "\"The female retreated to her bedroom and retrieved a pistol to protect herself, as she was going to attempt to leave through the front door,\" police said.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Police said the man is charged with domestic violence, a third-degree felony, for having a prior record of domestic violence charges.",
    "The law not only expands where the castle doctrine applies, it also changes the way Stand Your Ground cases are handled in court.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "During the argument, the man allegedly struck the woman \"numerous times in the head and face,\" police said.",
    "When officers arrived, they found the woman outside and the man bleeding in the front yard.",
    "The woman pulled the gun out of her coat pocket, pointed it at the man and fired.",
    "The man was taken to a nearby hospital for treatment and later arrested.",
    "Previously, the defense had to prove someone was acting in self-defense.",
    "Download now on your Apple device here, and your Android device here.",
    "When she tried to leave, the man attempted to stop her, police said.",
    "The man grabbed the gun and was shot in the hand and upper arm.",
    "It happened around 5 a.m. Saturday at a home on Enid Road.",
    "Police found the gun in the snow in the front yard.",
    "Now, it's up to the state to prove that it wasn't.",
    "The woman then ran outside and yelled for help.",
    "Nearby neighbors heard her and called police.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "Gov."
  ]
}