{
  "id": 5392,
  "mediaId": 6656,
  "date": "2022-02-18",
  "headline": "Ohio Gov. Mike DeWine delays three executions",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/7301645230525/2022/1/2a2f8d30859d917bc612eea8c6343b2e/v1.5/Ohio-Gov-Mike-DeWine-delays-three-executions.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/02/18/Ohio-executions-reprieves/7301645230525/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Danielle Haynes",
  "authorUrl": "https://www.upi.com/author/Danielle-Haynes/",
  "termIds": [
    1688,
    4415,
    5212
  ],
  "sentences": [
    "Ohio has had difficulty securing supplies of the three drugs it uses in its lethal injection protocol -- midazolam, potassium chloride, and either vecuronium bromide, pancuronium bromide or rocuronium bromide.",
    "Percy \"June\" Hutton's June 22 date was pushed back to June 18, 2025; Douglas Coley's July 20 date was pushed back to September 24, 2025; and Cedric Carter's Aug. 24 date was moved to Aug. 27, 2025.",
    "Ohio previously instituted a three-year moratorium on executions in 2014 after the family of Dennis McGuire sued over his lengthy execution during which he could be heard gasping for breath.",
    "Mike DeWine on Friday issued reprieves for three executions scheduled to take place later this year, citing struggles to obtain the drugs needed for the state's lethal injection protocol.",
    "Companies have refused to sell any drugs -- even those not used in executions -- to Ohio if they find out the state has used them in executions.",
    "Hutton was sentenced to death for the 1985 murder of Derek \"Ricky\" Mitchell during a fight over a sewing machine, which had money hidden in it.",
    "Carter received the death penalty for the 1992 murder of convenience store worker Frances Messinger during a robbery.",
    "The reprieves now mean Ohio doesn't have a scheduled execution until Jan. 12 -- that of Antonio Franklin.",
    "DeWine has delayed executions several times since he assumed office in January 2019.",
    "The state used an untested two-drug lethal injection protocol to kill McGuire.",
    "It's the third time he's delayed planned executions over the drug issue.",
    "And Coley was convicted for the 1997 murder of Samar El-Okdi.",
    "The state's last execution was held in 2018.",
    "Feb. 18 (UPI) -- Ohio Gov."
  ]
}