{
  "id": 5501,
  "mediaId": 2643,
  "date": "2022-02-07",
  "headline": "Republicans' Revised Legislative Maps Struck Down by Ohio Supreme Court",
  "image": "",
  "link": "https://www.newsweek.com/republicans-revised-legislative-maps-struck-down-ohio-supreme-court-1677017",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    2036,
    2928,
    3461,
    878,
    994,
    5212
  ],
  "sentences": [
    "\"Republicans have delayed this process too long already, it's past time for them to finally do their jobs and give Ohioans what they deserve: fair representation and a state government that reflects the wishes of Ohio voters, not the wishes of extreme Republicans and the special interests they're bought by,\" she added.",
    "A dissent written by Republican Justices Sharon Kennedy and Patrick DeWine—the son of GOP Governor Mike DeWine—complained that \"four members of this court have now commandeered the redistricting process and that they will continue to reject any General Assembly-district plan until they get the plan they want.\"",
    "In a 4-3 decision on Monday that sided with an objection brought by the League of Women Voters of Ohio, the court chose to \"invalidate the revised plan in its entirety\" for the same reasons and ordered the commission to draw additional maps that are in line with the constitution.",
    "Article XI, Section 6 of the state constitution, which was overwhelmingly approved by voters as an amendment in 2015, requires that district maps \"correspond closely\" to the partisan makeup of general election results over the past 10 years.",
    "The redistricting commission was given until February 17 to submit the third set of maps to Republican Ohio Secretary of State Frank LaRose, with additional copies of the maps sent to the court no later than 9 a.m. on February 18.",
    "The court found that the maps violated a provision of the Ohio constitution that aims to limit gerrymandering by requiring district maps to closely align with the partisan makeup of Ohio voters.",
    "\"Ohioans spoke loud and clear in 2015 when they overwhelmingly adopted reforms to end gerrymandering,\" Ohio Senate Minority Leader Kenny Yuko (D) said in a statement obtained by Newsweek.",
    "The Ohio Supreme Court has rejected a new set of Republican-drawn legislative district maps for a second time, ruling that the maps violate state laws against partisan gerrymandering.",
    "\"It would simplify matters if the commission would just provide the majority with the map-drawing software, Maptitude, so that they can draw the map themselves,\" the justices wrote.",
    "\"The Supreme Court has now said – not once, but twice – that ignoring those reforms and giving one party an unearned advantage in the legislature is not an option.\"",
    "\"The Ohio Supreme Court cannot be more clear: Republicans must produce fair maps that accurately reflect our state, not the Ohio GOP's political wishlist.\"",
    "\"It's time for our Republican colleagues to listen and work with us to give Ohioans the fair state legislative maps they deserve,\" Yuko continued.",
    "\"Throughout the process, the Republican map drawers refused to expressly work toward a 54 to 46 percent partisan share,\" Monday's decision states.",
    "\"At this point, one must wonder which seven-member body is the true redistricting commission—the constitutionally named officers or this court?\"",
    "The proposed maps would have given Republicans a 57 to 42 seat advantage in the state House and a 20 to 13 seat advantage in the state Senate.",
    "The new state House and Senate maps drawn by the GOP-dominated Ohio Redistricting Commission were previously rejected by the court last month.",
    "They just need to leave their party inclinations at the door and do the right thing by the people of Ohio and abide by the Ohio constitution.\"",
    "Republican Chief Justice Maureen O'Connor joined with three Democratic justices in deciding that the revised maps should be rejected.",
    "\"Once again this is a victory for Ohio voters,\" League of Women Voters of Ohio Executive Director Jen Miller told Spectrum News 1.",
    "\"The Ohio Supreme Court once again rejected GOP attempts to gerrymander our state and disenfranchise Ohio voters,\" Walters said.",
    "Ohio Democratic Party Chair Elizabeth Walters quipped that the \"third time's the charm\" in a statement reacting to the decision.",
    "Walters characterized the revised map as another Republican attempt to \"gerrymander our state and disenfranchise Ohio voters.\"",
    "The first rejected maps would have given the GOP an advantage of 62 to 37 seats in the House and 23 to 10 seats in the Senate.",
    "The most recent results show that Republicans were preferred to Democrats in the state by a margin of 56 to 44 percent.",
    "Newsweek reached out to the Ohio Republican Party and the Ohio Redistricting Commission for comment.",
    "\"The revised plan does not attempt to closely correspond to that constitutionally defined ratio.",
    "\"We are ready to work together in good faith to produce fair districts for all Ohioans.\"",
    "\"It's not hard to make maps that keep communities whole and serve everyday Ohioans.",
    "Our instruction to the Commission is—simply—to comply with the Constitution.\""
  ]
}