{
  "id": 5591,
  "mediaId": 2641,
  "date": "2022-02-11",
  "headline": "Ohio Aims to Become 'Silicon Heartland'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=3941bbb1-4a2f-45f2-ac71-a8b2cf473a63&SiteName=Newsmax",
  "link": "https://www.newsmax.com/finance/streettalk/ohio-intel-corp-silicon-valley/2022/02/11/id/1056501/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1688,
    2061,
    3466,
    504,
    526,
    4916,
    5092,
    5212
  ],
  "sentences": [
    "Gelsinger said that the new investment “marks another significant way Intel is leading the effort to restore U.S. semiconductor manufacturing leadership,” and that the coming factories “will create a new epicenter for advanced chipmaking in the U.S. that will bolster Intel’s domestic lab-to-fab pipeline and strengthen Ohio’s leadership in research and high tech.”\nIndirectly, the plants will also impact the state through new infrastructure in and around New Albany to support the project, and an even stronger emphasis on STEM educational opportunities for local schools.”\nThe project will add $2.8 billion to Ohio’s annual gross state product, according to Governor Mike DeWine.",
    "Geislinger added that the new plants “literally are going to take New Albany from a wonderful little town to becoming one of the high-tech mega-centers on the planet.”\nOverall, the project, which is expected to be operational by 2025, will be the largest investment in the history of the state of Ohio, according to Intel.",
    "Carol Grubaugh, Executive Director at the Knox County Chamber of Commerce, sees the plant will have a far reaching impact, saying to Newsmax Finance in an interview, “I feel [the new plant] will have a huge impact regionally…Not just in Licking County, but it will revolve through the whole state.",
    "More visitors, more suppliers, more commerce, more housing and more jobs will be coming to Central Ohio.”\nWith local officials, Intel CEO Pat Gelsinger, and area business groups lauding the decision, the potential emergence of a Silicon Heartland could really be on the horizon for Ohio.",
    "Additionally, the campus will become “the first semiconductor wafer facility in Ohio.”\n‘Silicon Heartland’\nPat Geislinger, CEO of Intel, sees the plants’ announcement as nothing less than monumental, to the point where he even coined a new term: Silicon Heartland.",
    "‘High Quality, American Made’\nIn an interview with Newsmax Finance, JD Vance says that the two new plants “are great for Central Ohio,” and the new plants can help offset the computer chip shortage in America.",
    "One month later, DeWine, a Republican, announced the exciting news publicly, telling those gathered at the Midland Theatre in Newark, Ohio, “It’s really a game changer—a game changer for our economic future.",
    "The state-of-the-art plants will have over 3,000 new high-tech jobs, over 7,000 construction jobs over the course of the project, and will create tens of thousands of indirect jobs for the region.",
    "DeWine is not alone, as an array of officials from local business groups to Senate candidate JD Vance, R, Ohio, agree the coming Intel plant will be a boon for the state.",
    "You know Intel could have put these plants anywhere in the country…We worked, and we fought, and we won, to bring these jobs to Ohio,” Ohio Capital Journal reports.",
    "It shows if leaders dedicate themselves, we can make it happen here, adding that the emergence of new manufacturing in Ohio can help re-industrialize the Midwest.",
    "The two new plants, being built at the cost of $20 billion, will be built on a 926-acre site in Licking County, Ohio, just east of the state capital, Columbus.",
    "Late last year, Ohio Governor Mike DeWine received a $20 billion Christmas gift: The news that Intel would build two new manufacturing plants in Ohio.",
    "Furthermore, Vance tells Newsmax that with megaprojects like this, “Usually, there’s red tape, but people cut through it.",
    "\"We're thrilled to be launching the Silicon Heartland in Ohio,” Geislinger said at the Midland Theatre.",
    "Huge Impact\nLocal officials agree that the project will have a massive impact.",
    "For Vance, the significance of the new plants affects the overall economy.",
    "JobsOhio underscores just how impactful the two new plants will be.",
    "I want an economy dominated by American jobs made by Americans.",
    "“I want our products to American made and high quality.",
    "Our economy must exist for our people,” Vance says.",
    "It took a lot of work to make this happen.",
    "© 2022 Newsmax Finance.",
    "All rights reserved.",
    "Special Links:"
  ]
}