{
  "id": 5641,
  "mediaId": 2679,
  "date": "2022-02-03",
  "headline": "Biden in NYC: Nation must come together to end gun violence",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/biden-grappling-with-perfect-storm-of-rising-gun-violence-2/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JOSH BOAK",
  "authorUrl": "",
  "termIds": [
    1934,
    2201,
    3975,
    4262,
    5189,
    5193
  ],
  "sentences": [
    "“We understand how serious this moment is,” Adams said, telling Biden, “Mayor Adams, reporting for duty, ready to serve.”\nBiden listened in on a gun violence strategic partnership meeting, a daily get-together for local, state and federal leaders who share intelligence and information on specific cases.",
    "NEW YORK (AP) — Running through a grim tally of recent gun deaths, President Joe Biden pledged to New Yorkers and the nation on Thursday that the federal government would step up its fight against gun violence by working more closely with police and communities to stop the surging bloodshed.",
    "“It is to give you the tools, the training, the funding to be partners, to be protectors and know the community.”\nAdvertising\n Skip AdSkip AdSkip Ad\nBiden ticked through how 316 people are shot every day and 106 killed, including 26 children who died in gun violence so far this year.",
    "The visit gave the president a chance to push back against Republicans who claim he’s soft on crime, and to distance himself from those in the left flank of his Democratic Party who want to shift funding away from police departments to social spending programs.",
    "Once an outspoken critic of his own department and someone who was beaten by police as a teenager, Adams portrayed himself during his campaign as someone who could bridge the divide between the New York Police Department and activists pushing for major change.",
    "Most Read Nation & World Stories\nBiden has also proposed a large increase in dollars for local community policing programs, and if his social spending agenda were to pass, even more funds would be made available — but that effort is stalled in Congress, too.",
    "Even before the spike, 75% of all homicides in the U.S. were due to firearm injuries and guns were responsible for 91% of youth homicides, according to a January report by the U.S. Centers for Disease Control on gun violence and suicides over 2018-19.",
    "And he encouraged cities to invest some of their COVID-19 relief money into policing and pushed alternative crime reduction steps such as increased community support and summer jobs for teenagers, and better resources for those coming out of prison.",
    "“When the amendment was passed, it didn’t say anybody can own a gun — any kind of gun — and any kind of weapon.”\nAdvertising\n Skip Ad\nThe president was joined by New York lawmakers, Attorney General Merrick Garland, Gov.",
    "“We can do something about this.”\nBut Biden’s crimefighting strategy relies heavily on buy-in from state and local officials as he suggests ways to spend federal dollars and expands on initiatives already under way.",
    "To combat this, the Biden administration is clamping down more on traders of “ghost guns,” homemade firearms that lack serial numbers used to trace them and that are often purchased without a background check.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe Justice Department is working to stop the movement of guns north along the “iron pipeline” on the Interstate 95 corridor from Southern states with lax gun laws.",
    "Efforts to take stronger legislative action in recent years have failed, even after 20 children and six adults were killed in the 2012 Sandy Hook school shooting in Newtown, Connecticut.",
    "Biden is navigating complex politics: He’s working to find ways to combat crime while also pushing for greater accountability after high-profile killings of Black people by police.",
    "Law enforcement officers recovered historically high numbers of firearms last year and are coming across more firearms stripped of serial numbers, making them impossible to trace.",
    "Federal prosecutors will prioritize cases of those who sell or transfer guns used in violent crime and, if Biden’s budget is enacted, get specific agents dedicated to the effort.",
    "Biden’s first nominee, a former ATF agent who had advocated for stricter gun control, was withdrawn in September amid opposition from Republicans and some moderate Democrats.",
    "But he also spoke of the powerful gun lobby that has been effective at curbing any effort to rein in guns and that points to the Second Amendment right to bear arms.",
    "In May, the Bureau of Alcohol, Tobacco, Firearms and Explosives will host police executives from across the country to collaborate on solutions to gun violence.",
    "And early data suggests that the period between when a gun was purchased and used in a crime and recovered by police has shortened, compared with earlier years.",
    "“They need to be able to train for and get a job, find stable housing, reenter society and have a second chance at life.”\n__\nLong reported from Washington.",
    "“The answer is to come together, policing communities, building trust and making us all safer.”\nMost of the talk Thursday was centered on better policing.",
    "Guns are at the center of the debate as the nation grapples with homicides that spiked nationally in 2020, the final year of the Trump administration.",
    "Biden came to New York a day after the funeral for the second of two New York City cops shot and killed during a domestic violence call on Jan. 21.",
    "He then headed to a school in Queens to hear firsthand from a frontline violence intervention community group about efforts to prevent violence.",
    "Officials wrapped up the event to get to the hospital, where another officer was being released after an injury in yet another shooting.",
    "The modest initiatives demonstrate the limits to what he can do when there is no appetite in Congress to pass gun legislation.",
    "In New York last month, an 11-month-old girl was wounded by a stray bullet and a teenage fast-food cashier was shot to death.",
    "Like Democratic presidents before him, Biden called on Congress to pass a ban on assault weapons and high-capacity magazines.",
    "Enough is enough,” Biden told police, law enforcement officials and lawmakers gathered at the city’s police headquarters.",
    "Marshals Service regularly conducts fugitive sweeps to arrest people with outstanding state or federal warrants.",
    "Federal strike forces are deployed to New York and other cities, aimed at cracking down on gun trafficking.",
    "Thirty-two officers have been shot in the line of duty so far this year nationwide, seven of them killed.",
    "“When someone finishes their time in prison … you can’t give them $25 bucks and a bus ticket,” he said.",
    "Federal agents are embedded in homicide units in police departments around the country, and the U.S.",
    "AP writers Michael Balsamo and Michael R. Sisak contributed to this report.",
    "This comes as Americans purchased a record number of firearms in 2020.",
    "But the agency has been without a permanent leader since 2013.",
    "Kathy Hochul and Mayor Eric Adams, a former police captain.",
    "“There’s no amendment that’s absolute,” Biden insisted.",
    "“The answer is not to abandon our streets,” Biden said.",
    "“The answer is not to defund the police,” Biden said.",
    "JOSH BOAK\nCOLLEEN LONG\nMICHELLE L. PRICE",
    "There’s no sign of a new nominee.",
    "“It’s enough."
  ]
}