{
  "id": 5763,
  "mediaId": 2537,
  "date": "2022-02-08",
  "headline": "Peloton abandons plans to build factory in northwest Ohio as company struggles financially",
  "image": "https://www.gannett-cdn.com/presto/2022/02/08/PFRE/62de1898-08e8-401a-8028-45ad27e3df6b-peloton_1.jpg?crop=1319,742,x0,y67&width=1319&height=742&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/money/business/2022/02/08/peloton-wont-build-ohio-factory-wood-county-amid-company-turmoil/6703766001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Carson",
  "authorUrl": "https://www.thenews-messenger.com/staff/4395782002/daniel-carson/",
  "termIds": [
    1413,
    1562,
    3178,
    800,
    801,
    5111,
    5212,
    5356,
    5403
  ],
  "sentences": [
    "William Lynch, Peloton's president, told the News-Messenger at the August 2021 ceremony the company was excited about partnering with Ohio, choosing the Buckeye State over other opportunities in Michigan and North Carolina to become the home of the company's first manufacturing site stateside\nPeloton president had lauded northwest Ohio's workforce\n\"(There's) a great employee base, there's a lot of talent here from the auto industry,\" Lynch said at the time.",
    "Wood County location still 'very marketable'\nWade Gottschalk, executive director of the Wood County Economic Development Commission, said county officials had heard the rumors about Peloton's financial difficulties but the first he heard about the company abandoning the Luckey plant was Tuesday morning, like everyone else.",
    "Gibney added that, with an inventory of sites and buildings, a ready workforce, comprehensive transportation network and business-first mindset, both Wood County and Northwest Ohio will continue a mission to attract new business, investment, and jobs to the region.",
    "Gottschalk said the EDC's understanding was that Peloton would continue and complete construction on the plant's building shell, with the company and county working together to fill the approximately 1 million square foot building and property in Wood County.",
    "Gottschalk said Wood County's economy is in good shape, regardless of the disappointment at Peloton's announcement, with 2.9% unemployment and a host of economic development projects that have been completed or are well underway.",
    "Peloton broke ground in August 2021 on the factory about 20 miles southeast of Toledo, touting it as its first large manufacturing plant in the United States and promising 2,200 good-paying jobs in northwest Ohio.",
    "$400 million plant in Wood County would have employed 2,200 workers\nLUCKEY — In a blow to the state's economy, Peloton announced Tuesday it is dropping its plan to build its first U.S. factory in northwest Ohio.",
    "Mike Jay, director of strategic networks at the Toledo-based Regional Growth Partnership, told the News-Messenger he had just heard the news about Peloton's decision Tuesday morning and could not yet comment.",
    "Peloton officials estimated that canceling its plans for the Wood County plant will result in $60 million in restructuring capital expenditures, which is included in the company's revised full year guidance.",
    "Beth Hannam, Sandusky County's economic development director, said she thought the news was unfortunate and might have a negative impact on some potential Peloton suppliers in the county and the region.",
    "Mike DeWine, using a sports analogy, said \"we won\" while addressing media and Peloton members during the groundbreaking event at the site of the planned facility, 22671 Pemberville Road in Luckey.",
    "Peloton Interactive announced it is \"winding down the development of its Peloton Output Park (POP) manufacturing plan,\" as part of a series of maneuvers designed to prop up the company's finances.",
    "The company said in Tuesday's statement that it will rely on third-party suppliers instead of building its own high-tech exercise bikes at the plant that had been scheduled to open in 2023.",
    "With low unemployment and workforce shortages plaguing some manufacturers, there were some concerns about how the Peloton plant would impact other area businesses seeking to fill openings.",
    "Concern over impact on Peloton suppliers\nThe facility would have been within easy driving distance for prospective workers living in the west end of Ottawa and Sandusky counties.",
    "Even with Tuesday's announcement, Hannam said Peloton selecting Wood County as the site for its first U.S. plant still represented a positive development for Northwest Ohio.",
    "And we were successful because Northwest Ohio offers the business assets companies desire when considering new locations, including a trained, motivated workforce.",
    "Nearly all of those gains were wiped out in 2021 as the distribution of vaccines sent many people out of there homes, and back into gyms, according to USA Today.",
    "The company had planned to invest $400 million over the next three years with a $138 million annual payroll and a workforce of 2,200 at the Troy Township plant.",
    "Lynch had said the Peloton facility would be the central nervous system in the country, connecting with warehouses around the U.S. and retail shops in Columbus.",
    "When Peloton’s $100 million dollar investment in the site and one-million square-foot building is completed, it will be even more attractive,\" Gibney said.",
    "John Foley, the cofounder of Peloton, is stepping down as chief executive and become executive chair at Peloton Interactive Inc., USA Today reported.",
    "\"Like all, we were disappointed to hear the news that Peloton will not move forward with a new manufacturing facility in Wood County.",
    "He noted First Solar broke ground in 2018 on a Lake Township facility expected to bring 500 new manufacturing jobs to Northwest Ohio.",
    "Peloton had been the subject in media reports this week of a potential takeover target by either Amazon or Nike, USA Today reported.",
    "Hannam said Sandusky County's unemployment rate as of December stood at 3.4%, with Seneca County at 3.3% and Hancock County at 2.6%.",
    "Our local, regional, and statewide economic development partners worked hard to bring a nationally recognized brand to the region.",
    "Hannam said she didn't know exactly how many Sandusky County residents were working on construction at the Luckey site.",
    "They surged more than 400% in 2020 as COVID-19 forced lockdowns and shifted the workout trend from the gym to the home.",
    "John Gibney, RGP's chief marketing officer, released a statement Tuesday afternoon regarding Peloton's decision.",
    "Barry McCarthy, who served as CFO at Spotify as well as at Netflix, will take over as CEO effective Wednesday.",
    "Major thoroughfares linking to U.S. 20 would have allowed the company to ship products around the nation.",
    "The stock fell further this year amid reports the company would cut back production as sales tumbled.",
    "In addition, the site in Luckey is recognized as one of the best available in the state.",
    "The company's shares have been on a roller-coaster ride since the pandemic began.",
    "\"It's still a great site and it's going to be very marketable,\" Gottschalk said.",
    "\"Our area is just ripe for development by virtue of our location,\" Hannam said.",
    "Peloton also revealed it plans to slash 2,800 jobs, or 20% of its workforce.",
    "But it has nothing to do with what's going on in Northwest Ohio.\"",
    "dacarson@gannett.com\n419-334-1046\nTwitter: @DanielCarson7",
    "\"This is our biggest manufacturing plant globally.\"",
    "\"There's a lot going on here,\" Gottschalk said.",
    "\"It's unfortunate what happened with Peloton.",
    "Gov."
  ]
}