{
  "id": 5774,
  "mediaId": 2537,
  "date": "2022-02-01",
  "headline": "'Cincinnatians helping Cincinnatians:' National Guard members on a mission against COVID-19",
  "image": "https://www.gannett-cdn.com/presto/2022/02/01/PCIN/3f5da988-09df-44c1-a17a-00739babb27a-i-45kQzwG-X4.jpg?crop=1277,719,x385,y0&width=1277&height=719&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/02/ohio-national-guard-members-aid-covid-19-battle/9296985002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooks Sutherland",
  "authorUrl": "https://www.cincinnati.com/staff/6341521001/brooks-sutherland/",
  "termIds": [
    0
  ],
  "sentences": [
    "Inside Cincinnati's hospitals: COVID-19 creates 'PTSD-like situation'\nMore:COVID-19 surge: Signs emerge that omicron's grip is easing as hospitals stay under stress\nMore:Ohio's top doctor says there is 'light at the end of the tunnel' for COVID-19 omicron wave\n\"At first I told them I kind of wanted to think about it because I wanted to talk to my wife, she had a pretty big say in it,\" the 48-year-old Harrison, Ohio native said.",
    "Calling the assistance from the guard an \"additional layer of support\" for the hospital, Deborah Hayes, president and chief executive officer of the Christ Hospital Health Network, said the guard has been crucial in maintaining normal hospital operations over the past few weeks in a video announcing they had arrived in the region.",
    "Seeing the mission as a call-of-duty to help his community amid the spread of the omicron variant, Wolterman, a staff sergeant with the air national guard, joined the mission of nearly 200 other guard members to assist with hospitals and testing sites in the Cincinnati region.",
    "Wolterman, who began assisting a hospital in northern Ohio before making his way to assist near his hometown, said he's been in many situations that are all-hands-on-deck over the years but has never seen anything like what hospitals are going through currently.",
    "He began assisting stressed health workers with patient and non-patient duties including stocking personal protective equipment to stations, transporting supplies, disinfecting surfaces and aiding nurses or staff members in providing care to patients.",
    "With COVID-19 surging through Cincinnati earlier this month, hospitals stressed to the max, and health workers facing a 'PTSD-like situation' with the emergence of another contagious wave of the disease, Brian Wolterman received a call.",
    "'This is the exact reason why I signed up'\nWhile they see it as their mission to respond to emergency situations and alleviate health workers battling capacity issues, many guard members are motivated by one other factor.",
    "Members arrived in Cleveland in late December, assisting hospitals during the virus's rapid spread in Cuyahoga County, but as the virus spread elsewhere across the state, so too did guardsmen.",
    "\"We see the standard ratio of medical personnel where they would have two or four patients under normal conditions,\" said Birmingham, who leads a team of guard members at the Christ Hospital.",
    "Lt. Corey Daria, a 30-year-old Cincinnati-native deployed to the drive-thru testing site near Riverbend Music Center, has witnessed a similar situation but said trends can be a rollercoaster.",
    "Highly contagious and severely spread around the community, the latest variant overflowed the area's health system once again beginning in late December of last year and into January.",
    "Responding to areas where they grew up after seeing people they know die from the virus that has killed close to 90,000 Americans is a call to action they weren't going to turn down.",
    "\"From the military side when we're doing what we're doing, right down to the civilians and the trauma clinics when they have one patient after another, after another.",
    "\"The patients that come through are happy we're there because some of them have told us they've tried to get tests before and it was really difficult,\" Baker said.",
    "Baker has been assisting the site hosted by Newport, Kentucky-based Ethos Laboratories with day-to-day tasks such as prepping materials and swabbing patients.",
    "The positivity rate, which was previously above 30% has fallen to 23.1% and the percentage of occupied adult ICU beds in the region's 40 hospitals was at 98%.",
    "Birmingham leads a team that has its footprint everywhere in the hospital, from supply movement to sanitary duties to dealing with COVID patients themselves.",
    "Fifty guard members are currently assisting with testing while 50 others are working at the Christ Hospital Health System and 90 more are assisting UCMC.",
    "1st Class McKinzie Baker sees anywhere from a few hundred to over a thousand individuals waiting in line to become tested at Crossroads Church in Mason.",
    "\"Often times we are pulled into situations where we don't get to help our fellow citizens, so it's nice to help the community that's local to us.\"",
    "He has sent out more than 2,300 members statewide to provide help to hospitals and test sites with ancillary tasks that help clear up the system.",
    "He's observed a hospital operating with an all-hands-on-deck approach but feels assistance from guard members is alleviating some of the stress.",
    "\"It's an honor and a privilege to be able to come here where we're making a direct impact to our neighbors, our Ohioans that we support.\"",
    "The guard's deployment has drive-thru sites expand into more lanes and with increased staff, speed up the process of distributing tests.",
    "But that's what they do all their training for, to be able to exceed expectations and provide the appropriate level of health care.\"",
    "1st Class Tim Birmingham, arrived at hospitals in the region, they were met with a system at its brink, in dire need of some relief.",
    "\"What I am observing is that a lot of them are really stepping up to the task,\" he added of both guard members and health workers.",
    "In early January, testing became harder and harder to come by and individuals in the region often waited a few hours to get one.",
    "\"When it's coming at you at such a rapid pace, it's certainly frustrating and taxing at any individual level,\" Birmingham said.",
    "Members first arrived in the Cincinnati area on Jan. 10 at three test sites to try to meet the skyrocketing demand for testing.",
    "Mike DeWine first deployed the guard to assist with the spread of the latest wave of COVID-19 throughout the state on Dec. 17.",
    "\"We've been very grateful to have the Ohio National Guard here at Christ Hospital Health Network,\" she said.",
    "\"...They have been extraordinarily helpful in both our clinical areas and in all of our support areas.\"",
    "As of Monday, hospitalizations – which had lingered above 1,000 for most of January – dropped to 773.",
    "\"When I'm doing this stuff that means other people are free to focus on the patient,\" Wolterman said.",
    "\"It's always nice to be called up for humanitarian efforts,\" the 43-year-old Cincinnati native said.",
    "Health workers and the community, in general, have met their response with praise, Birmingham said.",
    "\"I'm really seeing a lot of smiles a lot of hugs of gratitude that we're there to help,\" he said.",
    "Daria was briefed on the situation unfolding in Cincinnati and didn't hesitate to leap into duty.",
    "But it has assisted test sites with enough manpower to distribute tests in a timely fashion.",
    "He had just returned to the Ohio National Guard after a 20-year hiatus a few months prior.",
    "\"It's good to know they can come in and not have to wait for an hour-plus to get tested.\"",
    "The deployment of the guard has not only helped hospitals staffs maintain patient care.",
    "So that's really the importance of having the additional soldiers and airmen on board.\"",
    "\"And the timing of the influx with everyone coming in sometimes exceeds those numbers.",
    "Wolterman arrived at the University of Cincinnati Medical Center on Jan. 24.",
    "\"The national guard is a wave of fresh eyes and fresh energy,\" she added.",
    "And I called my supervisor back and said 'Sir, I'd like to volunteer.'\"",
    "And the numbers suggest the region is improving with COVID-19 as well.",
    "The task is daunting, but the assistance is working, Birmingham said.",
    "\"I really think that's vital to be able to come together like that.\"",
    "\"This is the exact reason why I signed up for the guard,\" he said.",
    "\"Ohioans helping Ohioans, Cincinnatians helping Cincinnatians.\"",
    "'Taxing at any individual level'\nWhen many members, like Sgt.",
    "\"But I spoke to her and she said 'Brian, you should do this.'",
    "\"I find it very inspirational,\" he said of their efforts.",
    "And many are in the front lines battling to eradicate it.",
    "On the other line was his new supervisor with the guard.",
    "\"It's really just been sporadic out here,\" Daria said.",
    "\"I think it's really priceless,\" Birmingham said.",
    "\"The hospitals are very busy places right now.\"",
    "Of course it's going to be taxing to them.",
    "Call to action\nOn any given day, Sgt.",
    "He wanted to protect his people.",
    "His assistance was needed.",
    "It hits home.",
    "Gov."
  ]
}