{
  "id": 5811,
  "mediaId": 2594,
  "date": "2022-02-02",
  "headline": "Biden grappling with 'perfect storm' of rising gun violence",
  "image": "https://static.independent.co.uk/2022/02/02/18/Police_Officers_Shot_80571.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/joe-biden-eric-adams-new-york-washington-jen-psaki-b2006315.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Via AP news wire",
  "authorUrl": "https://www.independent.co.uk/author/via-ap-news-wire",
  "termIds": [
    2277,
    3975,
    5189,
    5193,
    5371,
    5382
  ],
  "sentences": [
    "“Our conversations with the White House have been that we recognize the need for criminal justice reform, the role of policing and accountability but we also need to be similarly invested in bringing police the needed resources to address the increase in crime.”\nLos Angeles and New York are among the cities with federal strike forces aimed at cracking down on gun trafficking.",
    "Broadly speaking, it’s the pandemic, the social unrest and it’s guns.”\nPolice are conducting less proactive investigations, while communities are reporting fewer crimes and offering less information when police try to solve them, in part because a widening gulf of mistrust following a focus on killings of Black people by police and the unrest that followed.",
    "A recent call with police leaders grew contentious when a few police officials accused Attorney General Merrick Garland and his deputies of failing to put them first and not offering enough support for law enforcement, said the two people, who were not authorized to publicly discuss the private call and spoke on condition of anonymity.",
    "“Our view is that instead of turning this into a political football, we need to be focused from the beginning of the president’s time in office on reducing crime and keeping our communities safe.”\nGuns are at the center of the debate as the nation grapples with homicides that spiked nationally in 2020.",
    "Biden has proposed a large increase in dollars for local community policing programs and encouraged cities to invest some of their COVID-19 relief money into policing and pushed alternative crime reduction steps such as increased community support and summer jobs for teenagers.",
    "“He has the opportunity as president to use his bully pulpit to send a message to American police, and that could have more impact than any resource the federal government could give.”\nWhile in New York, Biden will meet with new Mayor Eric Adams a former police captain.",
    "“Into all of this walks the president of the United States, who has a 25-year history of work on these issues,” said Chuck Wexler, executive director of the Police Executive Research Forum, an organization dedicated to improving the professionalism of policing.",
    "Once an outspoken critic of his own department and someone who was beaten by police as a teenager, Adams portrayed himself during his campaign as someone who could bridge the divide between the New York Police Department and activists pushing for major change.",
    "Adams' tough-yet-middle-ground approach is one that Biden and other moderate Democrats have sought out, especially as they try to distance themselves from calls from progressives to shift money away from police departments and into social programs.",
    "A spokesman for Garland said the challenges faced by law enforcement have been exacerbated by the pandemic and that Justice Department leaders speak with police officials regularly, value their feedback and are trying to support them.",
    "All this unfolds against the backdrop of recent polls showing that Americans are increasingly concerned about crime, and that Republicans have an advantage over Democrats as the party that would do a better job dealing with it.",
    "In New York, at a middle-of-the-night news conference following the shooting late Tuesday of an off-duty officer, Adams said he hoped federal and state lawmakers would give police the help they deserved.",
    "Biden also is trying to navigate the complex politics of the moment: finding ways to combat crime while also pushing for greater accountability after killings of Black people by police.",
    "Law enforcement officers recovered historically high numbers of firearms last year and are coming across more firearms stripped of serial numbers, making them impossible to trace.",
    "Chief Michel Moore of the Los Angeles Police Department said more money is important, but fully staffed federal law enforcement agencies would also make a big difference.",
    "Some early data suggests that the period between when a gun was purchased and used in a crime and recovered by police has shortened, compared with earlier years.",
    "The strongest effort in recent years failed, even after 20 children and six adults were killed in the 2012 Sandy Hook school shooting in Newtown, Connecticut.",
    "He has acted to crack down on “ghost guns,” homemade firearms that lack serial numbers used to trace them and are often purchased without a background check.",
    "President Joe Biden visits one of them, New York on Thursday as he tries to dispel criticism from the right that he hasn’t been tough enough on crime.",
    "“It’s something of a perfect storm,” said Thomas Abt, senior fellow at the Council on Criminal Justice and chair of its Violent Crime Working Group.",
    "Mike DeWine proposed spending $250 million in federal funds to help first responders fight violent crime and recover from pandemic-related hardship.",
    "And he has worked to tighten regulations on pistol-stabilizing braces like the one used in a Boulder, Colorado, shooting that left 10 people dead.",
    "And tensions between some police leaders and the Justice Department have risen in recent months, according to two people familiar with the matter.",
    "“These officers, every day, put on their uniforms, pin that shield on their chest, put that bullet proof vest on and go back into the streets.",
    "“I think we all agree or should agree that violent crime is a serious problem,” White House press secretary Jen Psaki said this week.",
    "Gun violence already on the rise during the pandemic is spiking anew, and beleaguered cities are struggling with how to manage it.",
    "In Aurora, Colorado, where officers have left the force, those who remain will receive bonuses totaling $6 million.",
    "Marshals Service regularly conducts fugitive sweeps to arrest people with outstanding state or federal warrants.",
    "But there are limits to what the president can do when there is no appetite in Congress to pass gun legislation.",
    "But even so, police chiefs and prosecutors across the country have been desperate for more federal assistance.",
    "“The efforts of criminal justice reform need to include the factors feeding into violent crime,” he said.",
    "Biden will showcase federal, state and local efforts to get guns and repeat shooters off the streets.",
    "Federal agents are embedded in homicide units in police departments around the country and the U.S.",
    "Two died in New York in two weeks and two campus police were killed in Virginia on Tuesday.",
    "Now it’s time for lawmakers to do their job.”\nPrice and Balsamo reported from New York.",
    "At least seven 16-year-old kids were killed in shootings last year in New York alone.",
    "The two efforts do not have to be at odds, though they are often billed that way.",
    "Associated Press writer Michael R. Sisak in New York contributed to this report.",
    "The White House is pushing back against GOP efforts to paint Biden as soft.",
    "And 32 officers have been shot on the job so far in 2022, five fatally.",
    "So far, Biden has given two major speeches from Washington on crime.",
    "And alarming numbers of police officers have been shot dead.",
    "Americans purchased a record number of firearms in 2020.",
    "Illegal guns are flooding the streets.",
    "They still go back and do their jobs.",
    "“There is no one single culprit.",
    "Teenagers are being murdered.",
    "In Ohio, Republican Gov.",
    "Some have done so."
  ]
}