{
  "id": 5983,
  "mediaId": 6598,
  "date": "2022-02-09",
  "headline": "Super Bowl 2022: Cincinnati Bengals quarterback Joe Burrow surprises former high school coach with tickets",
  "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0124%2Fr965259_1296x729_16%2D9.jpg",
  "link": "https://www.espn.com/nfl/story/_/id/33253012/super-bowl-2022-cincinnati-bengals-quarterback-joe-burrow-surprises-former-high-school-coach-tickets",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michele Steele",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In an interview with ESPN, he paused to reflect on all his former quarterback has accomplished: the Heisman trophy, a national championship and now being on the cusp of leading the Bengals to what would be the team's first-ever Super Bowl victory.",
    "\"And you know, a lot of people around here really have ownership in the run ... the fact that he has brought up this area and that was his way of kind of telling us, 'Come on guys, let's go for the ride.'",
    "Sitting at home last Sunday, Athens High School head football coach Nathan White saw his phone light up with a familiar name on the other end -- Cincinnati Bengals quarterback Joe Burrow.",
    "He knows the odds of one of his players going to Ohio State and LSU, becoming the first overall pick in the NFL and leading his team to a Super Bowl in his second season.",
    "\"He called and said, 'Hey coach, if you're not busy this weekend, I have a couple extra tickets if you and Sarah want to go,'\" White said.",
    "\"Having a former player ask you if you want to go to the Super Bowl is something that I truly never dreamed up,\" White said.",
    "And the fact that Athens High School had Mr. Football in Ohio, I still almost can't wrap my head around that,\" White said.",
    "Burrow joined the Athens Bulldogs as a sophomore and led the team to Ohio's state championship game in 2014 as a senior.",
    "Burr Oak State Park in southeastern Ohio is renamed \"Burrow Oak State Park\" in honor of the team's quarterback.",
    "\"To think about sitting there and watching an Athens Bulldog in the Super Bowl is mind boggling to me.\"",
    "Mike DeWine temporarily renamed three state parks Monday in honor of the Super Bowl-bound Bengals.",
    "He's talked appreciatively about his connections to the area, roughly 2½ hours from Cincinnati.",
    "\"So I'm still kind of trying to come to grips with all that stuff that happened.",
    "When he's not coaching the football team, White teaches math at the high school.",
    "Burrow had a question for White: Would he like to go to the Super Bowl?",
    "\"I wouldn't be here without all the people that supported me in Athens.",
    "\"They helped make me who I am today,\" Burrow told reporters this week.",
    "White was then the quarterbacks coach on Burrow's high school teams.",
    "\"We're so lucky to get to experience this a little bit with Joe.\"",
    "\"I think it might hit me in 10 years and 20 years, who knows?\"",
    "\"He has really pulled us along on this journey,\" White said.",
    "He was always happy to hear from one of his former players.",
    "\"I always tell people Joe was named his senior year 'Mr.",
    "I'm just not there yet to even realize what it means.",
    "\"So I said yeah, 'I think we can make that happen.'\"",
    "And people in Athens have followed every step.",
    "The excitement around here is indescribable.\"",
    "Football' player of the year in Ohio.",
    "I feel like to win the Super Bowl ...",
    "I hope I'm making everybody proud.\"",
    "He smiled.",
    "Gov."
  ]
}