{
  "id": 5998,
  "mediaId": 2919,
  "date": "2022-02-07",
  "headline": "Ohio's state parks temporarily renamed to honor players of Super Bowl-bound Cincinnati Bengals",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/6a3bf71/2147483647/strip/true/crop/1532x804+0+1/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fd1%2Fa7%2F06e342244caab2c2901ca3f36623%2Fstate-parks.jpg",
  "link": "https://www.news5cleveland.com/news/state/ohios-state-parks-temporarily-renamed-to-honor-players-of-super-bowl-bound-cincinnati-bengals",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    1688,
    217,
    4883,
    4906,
    4916,
    4937,
    5212,
    5232
  ],
  "sentences": [
    "Paint Creek State Park in Bainbridge will be named Evan McPherson Extra Point Creek State Park after McPherson, whose game-winning kicks in the divisional playoff and AFC Championship games helped send the Bengals to the Super Bowl.",
    "Mike DeWine and the Ohio Department of Natural Resources have temporarily renamed three state parks to honor current and past players of the Super Bowl-bound Cincinnati Bengals.",
    "Burr Oak State Park in Glouster will be referred to as Burrow Oak State Park in honor of Athens native Joe Burrow, who is the current quarterback of the Cincinnati Bengals.",
    "If the Bengals beat the Rams on Sunday, Burrow will become the first quarterback in history to win the Heisman Trophy, a National Championship and the Super Bowl.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Lastly, Hueston Woods State Park in College Corner, located between Cincinnati and Dayton, will honor the legendary Bengals running back Ickey Woods.",
    "“The whole state will be rooting for Cincinnati on Sunday, and this is a fun way to show support for the orange and black.\"",
    "Ohioans are encouraged to take photos with the signs and tag @GovMikeDeWine, @ohiodnr, and @ohstateparks on social media.",
    "The three parks will each have updated signage put in place this week that will display the celebratory park names.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "“We are incredibly proud of the Bengals and everything they have accomplished this season,” said DeWine.",
    "When all signs are in place, ODNR will announce the specific locations of each sign.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Download now on your Apple device here, and your Android device here.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "The park will now be dubbed Ickey Woods State Park.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "COLUMBUS, Ohio — Ohio Gov."
  ]
}