{
  "id": 6097,
  "mediaId": 2919,
  "date": "2022-02-11",
  "headline": "RNC calls Capitol violence “legitimate.” Do Ohio statewides agree?",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/fabbb19/2147483647/strip/true/crop/1000x525+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fc3%2F6f%2F8e796d3e4e09936d0109d7da538a%2Fap21016612530114.jpg",
  "link": "https://www.news5cleveland.com/news/state/rnc-calls-capitol-violence-legitimate-do-ohio-statewides-agree",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marty Schladen",
  "authorUrl": "https://www.news5cleveland.com/marty-schladen",
  "termIds": [
    2201,
    2298,
    2588,
    3829,
    4087,
    877,
    5035,
    5212
  ],
  "sentences": [
    "On Tuesday, Senate Majority Leader Mitch McConnell, R-Ky., forcefully rejected the Republican National Committee’s censure last week of Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois, the two Republicans serving on a select House Committee investigating events surrounding the Capitol attack as Congress gathered to certify President Joe Biden’s win over former President Donald Trump.",
    "“Governor DeWine does not have new comment on this issue,” his press secretary, Dan Tierney, said in an email when asked if the governor agreed with the RNC’s declaration that the Capitol insurrectionists had engaged in “legitimate political discourse.”\nIn the wake of the riot, DeWine slammed Trump’s incitement and said everybody “must” denounce the mob he incited.",
    "In a statement announcing the censure of the congressional committee’s Republican members, the RNC called the investigation “persecution of ordinary citizens engaged in legitimate political discourse.”\nMcConnell, no squish when it comes to playing partisan hardball, on Tuesday made it clear that he’s not going to support this bit of revisionist history.",
    "“He did nothing to fight for his constituents and stop the most fraudulent election in American history.”\nIn fact, Trump’s own Department of Homeland Security called the 2020 election “the most secure in American history.”\nFor her part, Cheney tweeted a video mashup of the day’s harrowing violence and wrote, “This was Jan. 6.",
    "“Yesterday’s acts were shameful and all Americans must denounce them, even those Americans who feel — incorrectly — that Donald Trump won.”\nApparently, the governor doesn’t feel he must criticize his own party, whose official organization not only failed to denounce the mob’s conduct, but sought to justify it.",
    "He didn’t address the RNC statement, but in an email, he said, “Dissent and demonstration are protected under the first amendment — violence is not.”\nWhen Luke Sullivan, Attorney General Dave Yost’s spokesman, was asked whether Yost agreed with the RNC statement, he didn’t speak directly to that question.",
    "The top elected Republican tried this week to give his colleagues cover to disagree with a party claim that the violent attack on Congress on Jan. 6, 2021 was “legitimate political discourse.” But for their part, most of Ohio’s statewide elected officials have been less than definite.",
    "The congressional investigation is showing that for hours, the commander-in-chief then “gleefully” watched the attack on Capitol police and ignored aides and family members who begged him to tell the rioters to go home.",
    "The insurrection occurred after a morning rally during which Trump and his allies repeated false claims of massive election fraud and Trump told attendees to go to the Capitol and fight.",
    "“It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election, from one administration to the next.",
    "“The speech that (Trump) gave preceding the march, that he gave to the protesters served only to fan those flames, encouraging the mob behavior that ensued,” DeWine said.",
    "'”\nRegardless of the facts, Ohio’s statewide elected officials seem reluctant to take a position in the dispute, which could be seen as a battle for control of the party.",
    "The House committee now is interviewing witnesses, subpoenaing others and it appears to be focusing on the role Trump and his allies played before and during the riot.",
    "Seven died in connection with the riot, about 150 police officers were injured and 768 have been arrested on charges ranging in seriousness up to sedition.",
    "“Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,” Trump said in a statement.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "As it does, the Republican National Committee last week attempted to portray the investigation as — to use a favorite Trump term — a witch hunt.",
    "That’s what it was.”\nTrump, who has floated the idea of pardoning the rioters in a second term, wasted no time in attacking McConnell.",
    "“The AG tweeted on Jan. 6, 2021 regarding this topic, I’d use that as his comment,” Sullivan said in an email.",
    "My prayers are with the law enforcement officers trying to restore order.“",
    "Perhaps the most direct response came from Ohio Treasurer Robert Sprague.",
    "In the tweet, Yost said “I condemn the storming of the Capitol.",
    "On Wednesday, he repeated his lies about a fraudulent election.",
    "But unlike the others, he faces a stiff primary challenge.",
    "Jon Husted said he had no comment on the matter.",
    "This was not ‘legitimate political discourse.",
    "Mike DeWine is headed into primary season.",
    "“We saw it happen,” he told reporters.",
    "This is not protest, but lawlessness.",
    "A spokeswoman for Lt. Gov.",
    "As with the others, Gov."
  ]
}