{
  "id": 6120,
  "mediaId": 2919,
  "date": "2022-02-03",
  "headline": "Who funded Ohio Statehouse politics in 2021?",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/b598017/2147483647/strip/true/crop/1121x588+0+61/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fef%2F91%2F5901681b456584a1d260a3e6b8df%2Fohio-statehouse-columbus.jpg",
  "link": "https://www.news5cleveland.com/news/state/who-funded-ohio-statehouse-politics-in-2021",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.news5cleveland.com/jake-zuckerman",
  "termIds": [
    1617,
    2036,
    2101,
    3823,
    4554,
    878,
    5093,
    5212
  ],
  "sentences": [
    "Senate President Matt Huffman, R-Lima: $875,000\nRep. Jay Edwards, R-Nelsonville: $429,000\nSen. Stephanie Kunze, R-Hilliard: $370,000\nHouse Speaker Bob Cupp, R-Lima: $331,000\nRep. Tom Patton, R-Strongsville: $300,000\nSen. Kristina Roegner, R-Hudson: $233,000\nRep. Jason Stephens, R-Kitts Hill: $233,000\nSen. Jay Hottinger, R-Newark: $228,000\nRep. Phil Plummer, R-Dayton: $219,000\nSen. George Lang, R-West Chester Twp.",
    "Regina Mitchell, of Warren Fabrication, gave $43,000 to three Republicans\nAlbert Ratner, of RMS Investment Group, and his wife gave nearly $59,000, almost exclusively to Republicans\nAbigail and Leslie Wexner, who gave $54,000 to Republicans\nRepublicans clobber Democrats\nWhichever way you cut it, Republicans wield a powerful cash advantage over Democrats.",
    "Education and construction unions, natural gas utilities, the beer and wine industry, optometrists, car dealers, telecommunications firms, nursing home operators, doctors’ associations and others dumped money into lawmakers’ accounts in 2022.",
    "The namesake family of The George Group (real estate) gave $42,000 to Republicans — $40,000 of which went to Rep. Jay Edwards\nVirginia “Ginny” Ragan, one of the most prolific GOP donors in Ohio politics, gave $65,000, all to Republicans.",
    "The Ohio Credit Union Legislative Action Committee gave $203,718\nNiSource PAC, whose namesake is the parent company of Columbia Gas, gave $144,225\nThe Ohio Bank PAC gave $121,000\nThe Ohio Optometry PAC gave $109,000.",
    "The filing period captures the year leading up to redistricting but before the Ohio Supreme Court overturned a map proposal that would have likely expanded and cemented in a Republican supermajority.",
    "Other notable, large donors to legislative and statewide candidates include:\nMembers of the Haslam family, some of whom own the Cleveland Browns, contributed more than $58,000 to various Republicans.",
    "Mike DeWine raised about $7 million compared to his primary challengers: about $1.2 million from Renacci (roughly $1 million of which came from personal funds) and $624,000 from Joe Blystone.",
    "Political Education Patterns, an arm of the International Union of Operating Engineers, is typically one of the most prominent Ohio donors but has not yet filed a full 2021 report.",
    "In the race for chief justice of the Ohio Supreme Court, Justice Sharon Kennedy raised about $332,000 compared to about $164,000 for Justice Jennifer Brunner.",
    "On the Democratic side, former Dayton Mayor Nan Whaley raised $2.4 million,, compared to former Cincinnati Mayor John Cranley, who raised about $1.9 million.",
    "For instance, the Ronald Wilheim, CEO of the Communicare nursing home chain, and his wife contributed $92,000 to six Republicans through the year.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "Big individual donors\nAs has been true in the past, several nursing home operators have served as the General Assembly’s largest benefactors.",
    "The filings can give an indication of who may be jockeying for influence or a leadership position within their caucuses.",
    "(The Ohio Supreme Court overturned the GOP-passed maps last month, determining them to be an unlawful gerrymander.",
    "They are all Republican, part of a pattern of the party significantly outraising Democrats by almost any measure.",
    "Brian Colleran, CEO of Foundations Health Solutions chain of nursing homes, and his wife contributed $80,400.",
    "Largest PAC contributors\nThese are some of the largest, non-individual donors to Ohio lawmakers through 2021.",
    "As Cleveland.com reported, Republicans running for the Supreme Court outraised Democrats on a sixfold margin.",
    "Using data reported by candidates (instead of the PAC itself), the organization contributed about $564,000.",
    "These funds set the stage for the maiden elections on yet-to-be finalized maps setting the district lines.",
    "Affiliated Construction Trades, comprised of several different unions, contributed about $561,000.",
    "This list doesn’t include accounts affiliated with the state Democratic and Republican parties.",
    "(These donations come atop contributions from three separate PACS representing the industry.)",
    "And bank accounts controlled by the party itself tower over their Democratic counterparts.",
    "Biggest fundraisers\nThese are the largest fundraisers in the House and Senate in 2021.",
    "Republicans trounced Democrats in terms of fundraising by just about any measurement.",
    "James Johnson, another Browns owner, contributed another $13,000 as well.",
    "The Wholesale Beer & Wine Association, through its PAC, gave $280,000.",
    "The Ohio State Association of Plumbers and Pipefitters gave $338,625.",
    "Colleran’s business partner Daniel Parker contributed nearly $27,000.",
    "The largest fundraisers in the General Assembly are all Republicans.",
    "The largest donors contribute disproportionately to Republicans.",
    "The court is currently reviewing a revised proposal).",
    "In the Legislature, it’s a tenfold margin.",
    "In the gubernatorial race, incumbent Gov.",
    "Political campaigns cost money.",
    "Sometimes, a lot of money.",
    "Here’s who’s providing it.",
    ": $218,000."
  ]
}