{
  "id": 6200,
  "mediaId": 2915,
  "date": "2022-02-10",
  "headline": "Ohio Pastors Rebuke Governor During Super Bowl Week for Expansion of Sports Gambling",
  "image": "https://charismanews-secure-charismamedia.netdna-ssl.com/images/stories/2022/2/Pete-Rose.jpg",
  "link": "https://www.charismanews.com/us/88336-ohio-pastors-rebuke-governor-during-super-bowl-week-for-expansion-of-sports-gambling",
  "mediaOutlet": "charismanews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Front Lines Ohio",
  "authorUrl": "https://www.charismanews.com/component/search/?searchword=Front%20Lines%20Ohio&ordering=newest&searchphrase=exact&areas[0]=authors",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Whether it is Pete Rose regularly placing wagers on his team as Manager of the Cincinnati Reds, or University of Toledo football and basketball players accepting financial gifts to alter their game performances, with the state government sanctioning sports gambling, more such incidents will undoubtedly occur.",
    "The letter stated, \"As the state government under your (DeWine's) leadership continues to employ new methods of consumer fraud to exploit Ohio's poor, it bears worth repeating that gambling does not create new wealth, gambling only makes wealth change hands.",
    "\"With additional government promotion of gambling, Ohioans will be conned into thinking they can win money on games designed to get them fleeced,\" says Pastor Russell Stanford, one of the clergy letter co-signors.",
    "It was in Mansfield, Ohio, in 2009 where the Ohio Lottery director gave 100 promotional instant lottery tickets to an Ohio State trooper two days after he was issued a verbal warning for two traffic violations.",
    "The clergy also believe state-sanctioned sports gambling will also harm the integrity of sports institutions it wagers on and will exacerbate the problem of cheating through game-fixing and point-shaving.",
    "We are told by the Bible 'not to rob the poor because he is poor, nor oppress the afflicted at the gate; for the LORD will plead their cause and plunder the soul of those who plunder them.'\"",
    "Opponents believe DeWine lacks the constitutionality to expand another gambling venue like House Bill 29 and that he could be moving the goalposts to fund future pet projects in the budget.",
    "\"Regrettably, this immoral behavior will be normalized with House Bill 29 as law and the poor and afflicted will continue to be skillfully deceived by those holding positions of power.\"",
    "Clergy representing ninety-one congregations throughout the Buckeye Bible Belt wrote an open letter critical of DeWine after he signed House Bill 29 into law legalizing sports gambling.",
    "Ohio clergy at odds with DeWine believe state-sanctioned sports betting in the long run will be a bad bet for Ohio and will set up a banana republic at the expense of gambling addicts.",
    "It will also legalize sports betting at brick-and-mortar casinos, stadiums, bars and restaurants, and allow betting via internet, mobile devices and kiosks.",
    "Former Ohio Buckeye star quarterback Art Schlichter falls into this category, with debts, con schemes and fake checks connected to his gambling losses.",
    "According to a 2016-2017 survey, .9% of all adult Ohioans have a compulsive problem-gambling addiction, equating to 76,379 individuals statewide.",
    "As Ohioans are counting on the Cincinnati Bengals to win Super Bowl LVI, the Ohio governor and Legislature are counting on Ohioans to lose.",
    "Pastor John Bouquet commented, \"This really is the story of the way of our country: we have national leaders in power demanding bribes.",
    "The pastors say government will be robbing Peter to pay Paul with enticing state-run gambling interests taking money from families.",
    "\"The Bible clearly says, 'He who is greedy for gain troubles his own house, but he who hates bribes will live,'\" says Stanford.",
    "Mike DeWine signed a bill into law legalizing sports betting in order to replenish state coffers with additional tax revenue.",
    "The Bible clearly warns, 'A just king gives stability to his nation, but one who demands bribes destroys it.\"",
    "The clergy feel if state leaders have no problem making money off addiction, what else will they legalize?",
    "Many believe the governor has dropped the ball on the issue, with House Bill 29 likely facing litigation.",
    "The leading clergymen said the decision was \"irresponsible and showed a glaring lack of leadership.\"",
    "\"This was a form of bribery which perverts justice and blinds those who see,\" the open letter said.",
    "Players will be tempted to cheat and the faith in the integrity of the games will be diminished.",
    "The clergy said they do not forget the corruption associated with the Ohio Lottery Commission.",
    "Read articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.",
    "House Bill 29 will allow predatory sports betting on collegiate and professional sports.",
    "This past year Ohioans lost over $2.11 billion from casinos, racinos and bingo halls.",
    "His addiction has kept the divorced Schlichter in and out of prison since 1995.",
    "The Ohio Casino Control Commission will have regulatory oversight.",
    "Get Charisma's best content delivered right to your inbox!",
    "Click here to subscribe to the Charisma News newsletter.",
    "Everyone will lose,\" the clergy letter said.",
    "Never miss a big news story again.",
    "Recently, Republican Gov."
  ]
}