{
  "id": 6264,
  "mediaId": 2728,
  "date": "2022-02-03",
  "headline": "Biden in NYC to outline strategy to fight gun violence",
  "image": "https://images.thestar.com/kLncXvoeNeQPZ3G9W2XDG3Ze6U8=/1280x1024/smart/filters:cb(1643932443509)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/02/03/biden-in-nyc-to-outline-strategy-to-fight-gun-violence/20220203150236-61fc3d55e56d95c3649c3f86jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/02/03/biden-grappling-with-perfect-storm-of-rising-gun-violence.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Boak",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "NEW YORK (AP) — Visiting a city still reeling from recent shootings of police, President Joe Biden will outline his administration’s strategy for confronting the national surge in gun violence and bloodshed in an address Thursday at the headquarters of the nation’s largest police force.",
    "It’s a chance for the president to try to push back against criticism from Republicans that he is soft on crime, and to distance himself from those in the left flank of his Democratic Party who want to shift funding away from police departments to social spending programs.",
    "Once an outspoken critic of his own department and someone who was beaten by police as a teenager, Adams portrayed himself during his campaign as someone who could bridge the divide between the New York Police Department and activists pushing for major change.",
    "Even before the spike, 75% of all homicides in the U.S. were due to firearm injuries and guns were responsible for 91% of youth homicides, according to a January report by the U.S. Centers for Disease Control on gun violence and suicides over 2018-2019.",
    "“Effective, accountable community policing helps us fight crime and it also makes us safer.“ Biden is stressing his decades-long commitment to supporting law enforcement, but he’s also working to ensure communities have the support they need.",
    "Biden has proposed a large increase in dollars for local community policing programs, and if his social spending agenda were to pass, even more funds would be made available — but that effort is stalled in Congress, too.",
    "Biden’s visit to the New York Police Department and a violence interruption program at a school in Queens comes as illegal guns flood the streets and shootings claims scores of lives, including those of police officers.",
    "To combat this, the Biden administration is clamping down more on traders of “ghost guns,” homemade firearms that lack serial numbers used to trace them and that are often purchased without a background check.",
    "He’s also encouraged cities to invest some of their COVID-19 relief money into policing and pushed alternative crime reduction steps such as increased community support and summer jobs for teenagers.",
    "Recent polls show that Americans are increasingly concerned about crime and that Republicans have an advantage over Democrats as the party that would do a better job dealing with it.",
    "The president’s strategy on crime relies heavily on buy-in from state and local officials as he suggests ways to spend federal dollars, and expands on initiatives already under way.",
    "Biden is navigating complex politics: he’s working to find ways to combat crime while also pushing for greater accountability after high-profile killings of Black people by police.",
    "Law enforcement officers recovered historically high numbers of firearms last year and are coming across more firearms stripped of serial numbers, making them impossible to trace.",
    "Federal prosecutors will prioritize cases of those who sell or transfer guns used in violent crime and, if Biden’s budget is enacted, get specific agents dedicated to the effort.",
    "Biden’s first nominee, a former ATF agent who had advocated for stricter gun control, was withdrawn in September amid opposition from Republicans and some moderate Democrats.",
    "Some early data suggests that the period between when a gun was purchased and used in a crime and recovered by police has shortened, compared with earlier years.",
    "In May, the Bureau of Alcohol, Tobacco, Firearms and Explosives will host police executives from across the country to collaborate on solutions to gun violence.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "The strongest effort in recent years failed, even after 20 children and six adults were killed in the 2012 Sandy Hook school shooting in Newtown, Connecticut.",
    "Mike DeWine of Ohio proposed spending $250 million in federal funds to help first responders fight violent crime and recover from pandemic-related hardship.",
    "Guns are at the center of the debate as the nation grapples with homicides that spiked nationally in 2020, the final year of the Trump administration.",
    "The Justice Department is working to stop the movement of guns north along the Interstate 95 corridor from Southern states with lax gun laws.",
    "In Aurora, Colorado, where dozens of officers have left the force, those who remain will split $6 million budgeted for bonuses.",
    "In New York last month, an 11-month-old girl was wounded by a stray bullet and a teenage fast-food cashier shot to death.",
    "“Both need to come hand-in-hand,” said White House press secretary Jen Psaki said as the president arrived in New York.",
    "Marshals Service regularly conducts fugitive sweeps to arrest people with outstanding state or federal warrants.",
    "Federal strike forces are deployed to New York and other cities, aimed at cracking down on gun trafficking.",
    "It demonstrates the limits to what he can do when there is no appetite in Congress to pass gun legislation.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Federal agents are embedded in homicide units in police departments around the country, and the U.S.",
    "The two efforts do not have to be at odds, though they are often billed that way.",
    "Biden will be joined in New York by Attorney General Merrick Garland, Gov.",
    "Nationwide, 32 officers have been shot on the job, five fatally.",
    "But the agency has been without a permanent leader since 2013.",
    "Two died in New York in two weeks; one was buried Wednesday.",
    "Kathy Hochul and Mayor Eric Adams, a former police captain.",
    "He was expected to talk more about this effort on Thursday.",
    "Americans purchased a record number of firearms in 2020.",
    "AP writer Mike Balsamo contributed to this report.",
    "Some states and cities are already acting.",
    "The Star does not endorse these opinions.",
    "___\nLong reported from Washington.",
    "There’s no sign of a new nominee.",
    "That violence continues today.",
    "Republican Gov."
  ]
}