{
  "id": 6360,
  "mediaId": 2658,
  "date": "2022-01-25",
  "headline": "POLITICO Playbook: Schumer strategy leaves some Dems seething",
  "image": "https://static.politico.com/c6/7b/2c286bbe4e9c9de2d567338633cc/220125-schumer-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/25/schumer-strategy-leaves-some-dems-seething-00001704",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2144,
    2371,
    2599,
    3434,
    4466,
    4777,
    305,
    831,
    1171
  ],
  "sentences": [
    "and Sheila Cherfilus-McCormick (D-Fla.) … Joe Conason of The National Memo … Kate Conway … NAM’s Mark Isaacson … Eleni Towns … NYT’s Jeremy Peters … Zach Pleat … WaPo’s Michael Scherer … POLITICO’s Caroline Amenabar,Alessandro Sclapari and Chris Parisi … Dave Martinez … Adam Kovacevich of the Chamber of Progress … Dan Kaniewski … White House’s Ashley Jones … Navy Rear Adm. George Wikoff … Adam Falkoff of CapitalKeys … Danielle Inman … David Woodruff of CN Railway … Arya Hariharan of the House Judiciary Committee … RNC’s Will Sexauer (3-0) … Mallory Hunter … Luke Graeter of Rep. Brad Wenstrup’s (R-Ohio) office … Jim Axelrod … NBC’s Emily Passer … Evan Lukaske of Sen. Kirsten Gillibrand’s (D-N.Y.) office … Jason Jay Smart … Josh Randle … Connor Wolf … Meaghan Lynch … Brunswick Group’s Kevin Helliker … Joelle Terry … Erik Smulson … Amy Mitchell … Michelle Goodman … Dan Carol … Phil Beshara … FDA’s Angela Calman … Jack Oliver … Nancy Gibbs … Erika Reynoso of Amazon … Ed Payne … Tina Tchen … former Iowa Gov.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nTHE WHITE HOUSE\nKLAIN’S TURN IN THE BARREL — WaPo’s Sean Sullivan and Tyler Pager take a look at how White House chief of staff RON KLAIN’s “sterling credentials” for the position “have repeatedly bumped against the unusual challenges of governing in today’s Washington.” The wide-ranging account of his first year in the position includes reporting that Manchin’s complaints about the White House “largely center on Klain” and that the senator feels “Klain must repair the relationship with him if the chief of staff is to be involved in future negotiations.”\nCONGRESS\nBAD BEHAVIOR — The Office of Congressional Ethics claimed Monday that Rep. MARIE NEWMAN (D-Ill.) “may have promised a potential primary challenger, Palestinian-American professor IYMEN CHEHADE, a job as her ‘foreign policy advisor and either District Director or Legislative Director’ in a potential future congressional office after the two met in 2018.",
    "“The question is whether there is real potential for compromise in three distinct areas: Russia’s demand for ironclad assurances that Ukraine won’t enter NATO; that NATO won’t further expand; and that Russia can somehow restore some approximation of its sphere of influence in the region to before the strategic map of Europe was redrawn in the mid-1990s.”\n— WSJ’s James Marson sets the scene on the ground: “Ukraine has struggled to maintain a sense of stability since it fully established itself as a sovereign country in 1991, and has been at war since 2014.",
    "… Still, evidence that a single year of subsidies could alter something as profound as brain functioning highlights the role that money may play in child development and comes as Biden is pushing for a much larger program of subsidies for families with children.”\nTHE PANDEMIC\nTHE POLITICS OF COVID — Many elected Democrats are shifting their approach to the pandemic amid the Omicron wave, forgoing the most restrictive public health measures with an eye toward the public’s readiness to move on, NYT’s Trip Gabriel, Lisa Lerer and Jennifer Medina report.",
    "“The American forces put on standby include U.S.-based intelligence and transportation units, Pentagon spokesman JOHN KIRBY said, cautioning that no final decisions have been made.”\n— But while war looms, “there are still diplomatic options — ‘offramps’ in the lingo of the negotiators — and in the next several days the Biden administration and NATO are expected to respond, in writing, to VLADIMIR PUTIN’s far-reaching demands,” NYT’s David Sanger notes.",
    "“The report found that Lamborn’s staffers were often asked to help out his children, including preparing his son for interviews for a job in the federal government, and throwing a party for his daughter-in-law after she became a U.S. citizen.”\nECA REFORM PUSH GROWS — The bipartisan group of senators pushing to reform the election certification process has doubled since its creation, Burgess Everett and Marianne LeVine report for Congress Minutes.",
    "“Some legal observers believe that a special grand jury could benefit Willis given the complexity of the case.”\nPOLICY CORNER\nTHE CHILD TAX CREDIT AND BRAIN DEVELOPMENT — “A study that provided poor mothers with cash stipends for the first year of their children’s lives appears to have changed the babies’ brain activity in ways associated with stronger cognitive development,” NYT’s Jason DeParle reports.",
    "The group is still in the early stages of discussing reforms to clarify Congress’ and the vice president’s roles in certifying elections as senators seek to make it more difficult for small groups of lawmakers to force votes on objecting to the elections.”\nALL POLITICS\nTHE GOP DIVIDE — On the ground in Strongsville, Ohio, Zach Montellaro and Michael Kruse report that the faceoff between Republican Gov.",
    "THE LATEST ON UKRAINE — The U.S. on Monday ordered 8,500 troops be put on heightened alert for deployment to Europe, while NATO said “it was moving more military equipment into Eastern Europe and Russia [continued] to build up massed forces along the border with Ukraine, amid fears that it will invade its neighbor,” WaPo’s Robyn Dixon, David Stern, Missy Ryan and Karoun Demirjian report.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "“The former secretary of State hasn’t just been losing weight but working to hone his media skills amid speculation about a possible presidential run.”\nTRUMP ALUM EYES CONGRESSIONAL SEAT— Former Trump White House aide and campaign staffer STEVEN CHEUNG is eyeing a run for California’s 9th Congressional District after Rep. JERRY MCNERNEY (D) announced last week that he’s retiring.",
    "Renacci, meanwhile, has molded his campaign in Trump’s image — though he lacks Trump’s actual endorsement so far.”\nMEDIA MAKEOVER — Former Secretary of State MIKE POMPEO’s PAC “spent $30,000 on media training from last March to June — the most on any service beyond payroll during the first six months of 2021,” Axios’ Lachlan Markay reports.",
    "Now, some “say they feel abandoned, victims of a chaotic withdrawal in which the speed with which departing Afghans reached the United States was often determined by nothing more than what kind of plane they left on.”\nPLAYBOOKERS\nJoe Biden called Peter Doocy “a stupid son of a bitch” — then later called the Fox News reporter to apologize.",
    "Register here to watch live\nBIDEN’S TUESDAY — The president and VP KAMALA HARRIS will receive the President’s Daily Brief at 10:15 a.m.\nHARRIS’ TUESDAY — The VP will also deliver remarks to the President’s Interagency Task Force To Monitor and Combat Trafficking In Persons at 2 p.m.\nPress secretary JEN PSAKI will brief at 12:15 p.m.",
    "After that event, McCormick went on to a strategy dinner at the even more exclusive Links Club on the Upper East Side with his fellow Bush ’43 alumni, including former assistant secretary for the Treasury Emil Henry and former Undersecretary of Treasury Bob Steel along with former Bush and Romney adviser Dan Senor.",
    "Separately, Rob Collins, an NRSC alum, and Mark Harris, a former aide to retiring Sen. Pat Toomey (R-Pa.), recently launched a super PAC for McCormick dubbed “Honor Pennsylvania.”\nMEDIA MOVES — Laura Chang, a longtime editor at the NYT, is joining Stat in the newly created role of editorial director.",
    "“Newman told the body that she sought to hire Chehade because of his knowledge on foreign and Arab-American affairs, which she felt was a shortcoming of her 2018 campaign.” The two signed an employment contract in 2018, but the job never came to fruition, and Chehade has since sued her office.",
    "Cheung, who is from South Sacramento but is considering a seat that’s based primarily in Stockton and San Joaquin County, has been speaking with donors and local GOP officials in the area about whether he has a shot at flipping the Democratic-leaning seat, according to two people familiar.",
    "MCCORMICK IN MANHATTAN — GOP Pennsylvania Senate candidate David McCormick held a fundraiser at the Metropolitan Club in Manhattan on Monday night that was attended by former Trump officials such as Gary Cohn, Tony Sayegh, Hope Hicks, Justin Muzinich and McCormick’s wife Dina Powell.",
    "AMERICA AND THE WORLD\nPULLOUT FALLOUT — Hundreds of CIA-backed Afghan commandos and their families who helped the U.S. evacuate Kabul are stuck in the United Arab Emirates, waiting to be cleared to get to the U.S., report NYT’s Julian Barnes, Thomas Gibbons-Neff and Charlie Savage.",
    "“It’s seemed clear for a while that the strategy Schumer is running has to do more with his fear of getting primaried than it did with actually achieving anything with the caucus he has or with protecting or expanding the majority,” said one senior Senate Democratic aide.",
    "— In a separate report Monday, the office alleged Rep. DOUG LAMBORN (R-Colo.) “misused his congressional staff and resources by having aides run errands for his family and that he solicited or accepted improper gifts from his subordinates,” WaPo’s Mariana Alfaro writes.",
    "BBB is a once-in-a-10-year opportunity, and we fucked it up.”\nANOTHER SOURCE OF FRUSTRATION: Schumer’s willingness to hold floor votes that he knew would fail — exposing party divisions — as he did last week during the debate on voting rights and the filibuster.",
    "IN MEMORIAM — Sheldon Silver, the longtime New York statehouse leader “who ruled Albany with an iron fist until he was busted and later convicted on federal corruption charges in a stunning fall from grace, died Monday in prison” at 77, per the New York Post.",
    "Republicans, meanwhile, skirted any pressure over their opposition, another senior Democratic Senate staffer noted, as Democrats zeroed in on Sinema and Manchin instead: “The Republicans had a fine week last week … There was no contrast with Republicans.",
    "POLITICO Playbook: Schumer strategy leaves some Dems seething\nBy RACHAEL BADE and TARA PALMERI\n01/25/2022 06:40 AM EST\nPresented by\nDRIVING THE DAY\nFrustration with CHUCK SCHUMER’s leadership strategy is privately simmering among some Hill Democrats.",
    "Sarah Palin, whose trial for her defamation lawsuit against the NYT was postponed Monday because she tested positive for the coronavirus, dined out at a New York City hot spot two days earlier — despite the city’s vaccine requirement.",
    "JAN. 6 AND ITS AFTERMATH\nABOUT THOSE DOCUMENTS … The House select committee on Jan. 6 now has a large batch of documents from Trump’s presidency, despite the former president trying to block access, citing executive privilege.",
    "Sinema, meanwhile, was censured by her state party over the weekend, and there’s growing talk of her facing a primary in 2024 — in the type of state Democrats have to win to have any hope of controlling the Senate.",
    "THE SCHUMER DEFENSE: In interviews last week with POLITICO and other outlets, the Democratic leader said he had a moral obligation to hold a vote on voting rights because the issue is central to democracy.",
    "She’s also argued numerous times that the party should lay off Manchin and Sinema, defending the pair in a press conference last week just after Schumer refused to disavow primary challenges to the two.",
    "That’s the only thing Russians can do.’”\nJOIN US — President JOE BIDEN’s legislative agenda is stalled on Capitol Hill, and the Democratic Party faces a key moment of reckoning before election season.",
    "McCormick also talked campaign strategy with his inner circle, which includes Wall Street titans such as EMCOR Chair Tony Guzzi, Goldman Sachs’ John Rogers and Blue Ridge Capital’s John Griffin.",
    "Likewise, Senate Minority Leader MITCH MCCONNELL has not only tried to avoid allowing votes that would divide his conference, but also defended Republican moderates from attacks from the right.",
    "But Democrats we spoke with said there were other ways of handling the issue short of staging a losing vote that antagonized two senators he’s probably going to need to get anything else done.",
    "FANI WILLIS has been granted a special grand jury for her investigation into Trump’s efforts to overturn the 2020 election in Georgia, per the Atlanta Journal-Constitution’s Tamar Hallerman.",
    "Join Rachael for a POLITICO Live interview with House Majority Leader STENY HOYER today at 12:30 p.m. They’ll talk Hill latest and also dig into Democrats’ prospects for the midterms.",
    "We talked to a half-dozen senior Democratic staffers in both chambers Monday night and heard a variation of the same complaint from each of them: that Schumer’s ploy to isolate Sens.",
    "Sen. MARK KELLY (D-Ariz.), for example, will almost certainly be compared with Sinema and attacked by Republicans as a party pawn for backing an end run around the filibuster.",
    "When former President DONALD TRUMP came after Sen. LISA MURKOWSKI (R-Alaska) for voting present on Supreme Court Justice BRETT KAVANAUGH’s nomination, McConnell defended her.",
    "When Trump demanded revenge for Sen. MITT ROMNEY’s (R-Utah) impeachment vote, McConnell refused to oblige, saying he needed the senator for important votes down the line.",
    "DeWine has forged a long and decorated career in Ohio capped off by his governorship — but relations with his own changing party have been challenging at times.",
    "But with 100,000 Russian troops gathered nearby, threatening Europe’s biggest land war since the 1940s, people there say something feels different this time.",
    "A former longtime Senate staffer following Schumer’s strategy closely noted that last week’s vote also exposes vulnerable senators up for reelection in 2022.",
    "Sen. SUSAN COLLINS (R-Maine) led the now 16-person group in a Zoom on Monday, “which focused mostly on the Electoral Count Act and lasted just over an hour.",
    "McCormick heads to Pennsylvania today to hold his first campaign rally — an event in the Lehigh Valley where he’ll be joined by Sen. Ted Cruz (R-Texas).",
    "MIKE DEWINE and former Rep. JIM RENACCI may serve “as an early test case of intra-party rebellion against a number of Republican governors this year.",
    "And it was a result of the fact that our party leader chose not to be the leader of the entire caucus.”\nThe impact isn’t just on those two, however.",
    "JOE MANCHIN (D-W.Va.) and KYRSTEN SINEMA (D-Ariz.) on Build Back Better and then voting rights has only set the party back in achieving its goals.",
    "NYT’s Luke Broadwater, Alan Feuer, Nick Corasaniti and Michael Schmidt break down what the documents could mean for the panel’s investigation.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "The comment, they said, effectively gave progressives permission to start talking about mounting Democratic campaigns to defeat them.",
    "“Leadership 101 is even if you don’t get someone today, you’re going to need them tomorrow,” said a senior House Democratic aide.",
    "Schumer promised around Christmas to force an up-or-down vote on BBB “very early in the new year” to put everyone on record.",
    "The strategy resulted in a slew of negative headlines reminding the base that the party hasn’t delivered on a core promise.",
    "“There was overwhelming, strong and vocal support throughout our caucus to hold the vote,” a source close to Schumer said.",
    "County judges on Monday gave the green light Monday for a special grand jury to be impaneled May 2 and last up to a year.",
    "“If malaise over the pandemic further slackens turnout, it will add to Democrats’ headwinds” in the midterms, they write.",
    "“The differences were modest and it remains to be seen if changes in brain patterns will translate to higher skills.",
    "All were particularly stunned by Schumer’s refusal last week to say that Manchin and Sinema should not be primaried.",
    "In the meantime, Democrats are praying that Manchin cools down and re-engages on the party’s social spending plan.",
    "One aide pointed out that Schumer is majority leader only because both senators ran centrist campaigns and won.",
    "All of the aides spoke on condition of anonymity, given the sensitivities of criticizing the Senate leader.",
    "Some speculated that his leadership strategy has been driven more by his own personal political ambitions.",
    "TRANSITIONS — Tina Sfondeles is now VP of public and media relations for Mac Strategies Group in Chicago.",
    "Can Democrats reset and resurrect Build Back Better, the party’s $1.75 trillion social spending package?",
    "He predicted the intra-party damage of not doing so would have far outweighed the divisions he exposed.",
    "Manchin remains furious at how he’s been treated and has yet to return to the negotiating table on BBB.",
    "Speaker NANCY PELOSI is famous for saying she never brings a bill to the House floor that will fail.",
    "… Carrie Warick-Smith will be VP of public policy at the Association of Community College Trustees.",
    "She most recently was director of policy and advocacy at the National College Attainment Network.",
    "Another argued that it’s the job of any majority leader to protect every member of the caucus.",
    "She most recently was a White House reporter and co-author of West Wing Playbook at POLITICO.",
    "HOT JOB (in more ways than one): WaPo is advertising for a reporter to cover Amazon.",
    "Notably he hasn’t followed through so far, and all of these sources hope he doesn’t.",
    "‘It became kind of normal to say, ‘What, again?’ said DANYLO KOVZHUN, 46 years old.",
    "He previously was a senior policy analyst at the Center for Law and Social Policy.",
    "But Schumer, these people all agree, hasn’t made that process any easier.",
    "Other leaders from both parties have taken a starkly different approach.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "Former NYC Department of Education chancellor Joel Klein also joined.",
    "HAPPY BIRTHDAY: Reps. Bill Pascrell (D-N.J.), Andy Harris (R-Md.)",
    "… Ryan Cooper will be managing editor of The American Prospect.",
    "TRUMP CARDS\nTHE INVESTIGATIONS — Fulton County, Ga., D.A.",
    "Laura Ingraham mocked Kate McKinnon’s impression of her.",
    "… Duy Pham is now a consultant at Frontline Solutions.",
    "Good Tuesday morning, and thanks for reading Playbook.",
    "He currently is a national correspondent at The Week.",
    "Chet Culver\nDid someone forward this email to you?",
    "I think it’s going to be a nightmare, like Syria.",
    "Send Playbookers tips to playbook@politico.com.",
    "‘On the other hand, I tend to be panicky.",
    "WILL THE STRATEGY CHANGE GOING FORWARD?",
    "“The level of malpractice is stunning.",
    "More from Insider’s Bryan Metzger.",
    "THE SENATE and THE HOUSE are out.",
    "And what’s next on voting issues?",
    "Sign up here."
  ]
}