{
  "id": 6461,
  "mediaId": 2590,
  "date": "2022-01-12",
  "headline": "Ohio Justices Toss GOP Statehouse Maps, Order Fix In 10 Days",
  "image": "https://img.huffingtonpost.com/asset/61df40162100001d387038da.jpeg?cache=YMUhzRtUeO&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/ohio-redistricting-supreme-court-maps_n_61df3f13e4b0ae44b31af675",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2781,
    3479,
    305,
    761,
    767,
    878,
    4916,
    5212
  ],
  "sentences": [
    "Mike DeWine, a member of the commission and whose son was among Wednesday’s dissenting justices, pledged in a statement to “work with my fellow Redistricting Commission members on revised maps that are consistent with the court’s order.”\nAdvertisement\nWriting for the majority, Justice Melody Stewart, a Democrat, said the maps favored one party and didn’t meet the amendment’s standard that the districts must be proportionally distributed to reflect Ohio’s 54% Republican, 46% Democratic voter mix.",
    "The decision impacts three separate lawsuits against the maps brought on behalf of Ohio voters by a host of national groups, including the National Democratic Redistricting Committee, the ACLU, the League of Women Voters, CAIR-Ohio and the Ohio Organizing Collaborative.",
    "Moderate Republican Chief Justice Maureen O’Connor, who at 70 years old must leave the court Dec. 31 due to age limits, provided a pivotal swing vote, joining the court’s three Democrats in a victory for national voting-rights and Democratic groups.",
    "Advertisement\n“The text of the Ohio Constitution is clear, and given the allegations in the complaints, this court lacks the authority to act as requested by the petitioners bringing these cases,” Justice Patrick Fischer wrote.",
    "Republicans who controlled the map-drawing process had argued the commission met its constitutional mandates by complying with a host of other protocols, which made the partisan favoritism and proportionality provisions moot.",
    "“It not only orders the immediate drawing of a new, constitutional map, but it also validates that Ohio’s voter-enacted constitutional prohibition that partisan gerrymandering is not merely ‘aspirational’ — it has real teeth.",
    "In their dissents, the court’s three remaining Republicans argued that the majority was grasping at a “sweeping power of judicial review” not available to the court under the provisions of the 2015 constitutional amendment.",
    "Freda Levenson, legal director for the ACLU of Ohio, said the decision sent a clear message to lawmakers that they can’t “put politics over people.”\n“The Ohio Supreme Court’s decision is huge,” she said in a statement.",
    "The panel’s two Democrats, Sen. Vernon Sykes and Rep. Emilia Sykes, his daughter, said the ruling confirmed Democrats’ contention that the lines were “unfair, unrepresentative and unconstitutional.”\nRepublican Gov.",
    "Its members — five Republicans and two Democrats — failed to arrive at bipartisan consensus, so the map they approved Sept. 16 along party lines was set to last only four years, rather than 10 years.",
    "COLUMBUS, Ohio (AP) — The Ohio Supreme Court declared GOP-drawn legislative maps invalid on Wednesday, agreeing with voting rights advocates that the lines were unconstitutionally gerrymandered.",
    "Advertisement\nThe dispute comes amid the process of redrawing legislative and congressional district maps that states must undertake once per decade to reflect changes from the U.S. Census.",
    "In a 4-3 ruling, the court sent the maps back to the Ohio Redistricting Commission to take another crack at complying with provisions of a 2015 constitutional amendment.",
    "This was the powerful Redistricting Commission’s first time drawing new legislative maps of 99 Ohio House and 33 Ohio Senate districts.",
    "Justices gave the panel 10 days and retained jurisdiction to review their handiwork.",
    "That amendment requires there be an attempt at avoiding partisan favoritism.",
    "This bodes well for the 2022 election cycle — and beyond.”"
  ]
}