{
  "id": 6484,
  "mediaId": 2590,
  "date": "2022-01-14",
  "headline": "Ohio Supreme Court Rejects GOP-drawn Congressional Map",
  "image": "https://img.huffingtonpost.com/asset/61e1b980260000c9ee3d2c55.png?cache=EA6SA9WDI6&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/ohio-reject-gop-congressional-map_n_61e1b839e4b0a864b0724e07",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "",
  "termIds": [
    3806,
    305,
    759,
    878,
    994,
    4916,
    5212
  ],
  "sentences": [
    "Writing for the majority, Justice Michael Donnelly, one of the court’s three Democrats, wrote, ”(T)he evidence in these cases makes clear beyond all doubt that the General Assembly did not heed the clarion call sent by Ohio voters to stop political gerrymandering.”\nThree of seven justices — including Justice Pat DeWine, son of Republican Gov.",
    "“When the majority says that the plan unduly favors the Republican Party, what it means is that the plan unduly favors the Republican Party as compared to the results that would be obtained if we followed a system of proportional representation,” the dissent said.",
    "In the 4-3 decision, justices returned the map to the powerful Ohio Redistricting Commission, or its map-drawing counterparts in the Legislature, and said they must assure the next plan actually complies with the Ohio Constitution.",
    "Ohio\nCOLUMBUS, Ohio (AP) — The Ohio Supreme Court rejected a new map of state congressional districts Friday as gerrymandered, sending the blueprint back for another try.",
    "The Ohio Supreme Court rejected a new map of state congressional districts Friday as gerrymandered, sending the blueprint back for another try.",
    "Voting-rights and Democratic groups had challenged the map as “unduly” favoring one party, a constitutional violation.",
    "Advertisement\nThey said it was unclear how it should be determined that a map “unduly favors” one party over another.",
    "Ohio voters approved a constitutional amendment in 2018 that set up a new system to avoid gerrymandering.",
    "Advertisement\nThe commission was already reconstituting to redraw legislative maps rejected Wednesday.",
    "Republicans had defended the map as “highly competitive.”",
    "Mike DeWine, a named plaintiff in the cases — dissented."
  ]
}