{
  "id": 6604,
  "mediaId": 2537,
  "date": "2022-01-26",
  "headline": "DeWine administration stays quiet about what it offered Intel to lure company to Ohio",
  "image": "https://www.gannett-cdn.com/presto/2022/01/14/NCOD/7ad48499-70bc-471c-b66e-afdea99b39bc-IMG_Gov_Dewine_Visits_La_7_1_UAV7IP46_L1762608867.JPG?crop=6719,3780,x0,y341&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/01/26/intel-ohio-semiconductor-factory-mike-dewine-quiet-tax-breaks-incentives/9215614002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    1688,
    3829,
    3975,
    504,
    526,
    5212
  ],
  "sentences": [
    "Mike DeWine was quick to share how his wife's version of eggs benedict helped bring the world's largest semiconductor factory to Ohio, but the administration has remained tight lipped about how much money it promised Intel to secure the deal.",
    "“For every six cents of capital investment the state of Ohio will make, Intel will make $1.”\nSix percent of Intel's initial $20 billion works out to be $1.2 billion but any dollar amounts beyond those have been speculation.",
    "The United States Innovation and Competition Act, which passed the Senate in June, included $52 billion in incentives for companies that research, develop and manufacture these chips in America.",
    "But the governor declined to answer questions about the specific incentives Ohio offered to Intel to make the Buckeye State more attractive than 39 other states that competed for the project.",
    "“I want other cities and states to be able to make an announcement like the one being made here today,” President Joe Biden said during his own announcement about the Intel campus.",
    "The DeWine administration says the deal will generate more than 20,000 jobs (including 3,000 at Intel) and add about $2.8 billion to Ohio's annual gross state product.",
    "“We worked, and we fought, and we won, to bring these jobs to Ohio,” DeWine said when he announced the project from the stage of the Midland Theater in Newark.",
    "It's also likely that JobsOhio, a nonprofit that runs off liquor sales profits, contributed some of its cash as part of the state's incentive package.",
    "Companies – like Intel – that invest at least $1 billion in the state now get 30 years worth of job creation tax credits instead of 15.",
    "The DeWine Administration successfully lobbied Republican lawmakers for a \"megaprojects\" tax credit when the budget passed in June.",
    "It serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "At the federal level, Ohio's congressional delegation is working to pass a bill that could give Intel more money.",
    "Intel plans to spend $20 billion building a massive semiconductor chip manufacturing campus in central Ohio.",
    "Based on the number of employees Intel expects to hire, that could be a $660 million savings over 30 years.",
    "Qualifying megaproject suppliers could exclude certain sales from their Commercial Activity Tax.",
    "In the early stages of wooing Intel, Ohio changed state law to sweeten the potential tax breaks.",
    "But that's harder to estimate because we don't know what companies will meet this criteria.",
    "But when asked for specifics, a spokesperson said they aren't disclosing the details yet.",
    "“And that's why I want to see Congress pass this bill right away and get it to my desk.\"",
    "Ohio's incentives to Intel: What we know\nDuring the Intel announcement, Lt. Gov.",
    "Columbus Dispatch reporter Mark Williams contributed reporting to this article.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Ohio is expected to widen parts of State Route 161 into New Albany.",
    "Anna Staver is a reporter with the USA TODAY Network Ohio Bureau.",
    "“We will get a return on our investment,” Husted said.",
    "Jon Husted assured Ohioans it would be a good deal.",
    "One credit for operators and another for suppliers.",
    "It was divided into two parts.",
    "Gov."
  ]
}