{
  "id": 6628,
  "mediaId": 2919,
  "date": "2022-01-21",
  "headline": "Redefining the Rust Belt: Intel announces $20 billion mega-plant near Columbus; impact to be felt statewide",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/5f798c7/2147483647/strip/true/crop/480x252+0+30/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F2c%2Ff4%2F2194bef142a5b6a2f67e3988dae7%2Fintel-plant-1.jpeg",
  "link": "https://www.news5cleveland.com/news/state/redefining-the-rust-belt-intel-announces-20-billion-mega-plant-near-columbus-impact-to-be-felt-statewide",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Vandenberge",
  "authorUrl": "https://www.news5cleveland.com/jordan-vandenberge",
  "termIds": [
    1688,
    2594,
    185,
    504,
    4916,
    4917,
    5092,
    5212
  ],
  "sentences": [
    "“Clearly, those of us that have been waiting on new cars or new appliances that are held up in the supply chain because of chip shortages are hyper-aware of the needs for smart chips.”\nSemiconductors are commonly used in the automotive, advanced mobility, aerospace, aviation, defense, healthcare and technology industries.",
    "LICKING COUNTY, Ohio — In what has been called the largest economic development project in state history, Intel has announced plans for a $20 billion semiconductor manufacturing facility near Columbus that is scheduled to go online in 2025.",
    "Ever since the COVID-19 pandemic began, there has been a worldwide shortage of these chips, forcing manufacturers in a multitude of industries to suffer from decreased manufacturing capacity, plants being stalled and production ceasing.",
    "“I think there is reason for optimism that not only is the Intel plant going to create jobs and economic activity through the work that they do, but also through partners that are going to want to work with Intel,” Goldberg said.",
    "“It’s great news for Ohio,” said Michael Goldberg, an experienced venture capitalist and entrepreneur that is an associate professor at Case Western Reserve University’s Weatherhead School of Management.",
    "In addition to the direct employment of 3,000 people, as many as 7,000 construction jobs and tens of thousands of additional jobs for suppliers, partners and other support-related businesses.",
    "Any company, any place that’s thinking about opening a new plant will simply have to give Ohio a good look.”\nIntel’s investment marks the company’s first new manufacturing site in 40 years.",
    "It really is a game-changer, a game-changer for our economic future,” DeWine said on Friday afternoon, adding that Ohio beat out 40 other states in landing the Intel deal.",
    "The massive complex, which will include the construction of two chip factories in the near term, will be located in Licking County on a 1,000-acre site east of Columbus.",
    "The mega project, which could balloon to $100 billion within the next decade, is expected to employ 3000 people, earning an average salary of $135,000 a year.",
    "Although it is expected to drop further, officials said that trend will begin to be reversed once the Intel plant comes online.",
    "The semiconductor ‘fab’ site will significantly boost the production of the chips that have become ubiquitous in everyday life.",
    "While located in Central Ohio, Intel’s new facility is expected to have a far-reaching impact across the state.",
    "Mike DeWine, it's the largest single private sector company investment in the state's history.",
    "In total, the project will add nearly $3 billion to the state's annual gross state product.",
    "“Intel's announcement today just confirms that, once again, this is Ohio's time in history.",
    "Many of those businesses are expected to expand and invest once the chip plant is online.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "More than 30 years ago, the United States led the world in chip production.",
    "Semiconductors are found in phones, computers, cars and other electronics.",
    "This is our time.”\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "However, production capacity has fallen from around 40% to a paltry 12%.",
    "Intel already has 140 suppliers scattered across the state of Ohio.",
    "Simply put, they are the foundation for today’s electronics.",
    "“What makes this announcement truly transformative for Ohio.",
    "And we've always been doers,” DeWine said.",
    "“Ohioans have always been dreamers.",
    "“This is a major win for Ohio.",
    "According to Gov."
  ]
}