{
  "id": 6693,
  "mediaId": 6509,
  "date": "2022-01-21",
  "headline": "Intel Announces Plan to Build Ohio Chip-Making Facility Amid Global Shortage",
  "image": "https://media.nbcdfw.com/2022/01/106964487-1634916853119-gettyimages-1236001738-INTEL-EARNS-1.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcdfw.com/news/national-international/intel-announces-plan-to-build-ohio-chip-making-facility-amid-global-shortage/2863859/",
  "mediaOutlet": "kxas nbc 5",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2061,
    2974,
    3975,
    504,
    624,
    1089,
    4916,
    5092,
    5212
  ],
  "sentences": [
    "2 semiconductor manufacturer globally, with $73.1 billion in revenue last year, behind South Korean world leader Samsung Electronics with $76 billon, according to market analysis from Gartner Inc.\nCentral Ohio, long known for a largely white-collar workforce in banking and insurance, has added high-tech jobs in recent years, with Amazon, Facebook, and Google all building data centers in the region.",
    "“The scope and pace of Intel’s expansion in Ohio,” said a statement from Keyvan Esfarjani, Intel’s senior vice president of manufacturing, “will depend heavily on funding from the CHIPS Act.”\nThe Intel project is the largest single private-sector investment in Ohio’s history, on par with an agreement in 1977 that brought Honda to central Ohio, where it now employs more than 14,000 people.",
    "You can think about this as a magnet for the entire tech industry.”\nPresident Joe Biden used Intel's Ohio announcement to push a $52 billion bill awaiting House approval that would invest in the chip sector and help ensure more production occurs in the U.S.\n“We are going to invest in America,” Biden said at the White House.",
    "The two factories on a 1,000-acre site in Licking County, just east of Columbus, are expected to create 3,000 company jobs and 7,000 construction jobs, and to support tens of thousands of additional jobs for suppliers and partners, the company and local and state officials said Friday.",
    "It’s also pitching for European subsidies to build a big plant somewhere within the European Union and last month said it will invest $7.1 billion to expand its decades-old manufacturing operation in Malaysia, home to roughly 10% of the company’s global workforce.",
    "Intel will invest $20 billion in a new computer chip facility in Ohio amid a global shortage of microprocessors used in everything from phones and cars to video games, with plans to grow the massive development in the future, the company announced Friday.",
    "But making more computer chips in the U.S. won’t entirely protect the industry from supply chain disruptions and shortages because the chips still will be sent to Asia for assembling and packaging, said Nina Turner, a research analyst at IDC.",
    "After years of heavy reliance on Asia for the production of computer chips, vulnerability to shortages of the crucial components was exposed in the U.S. and Europe as they began to emerge economically from the pandemic.",
    "We’re going to stamp everything we can, ‘Made in America,’ especially these computer chips.”\nU.S. & World\nConstruction is expected to begin this year, with production coming online at the end of 2025.",
    "The U.S. share of the worldwide chip manufacturing market has declined from 37% in 1990 to 12% today, according to the Semiconductor Industry Association, and shortages have become a potential risk.",
    "Shortages of chips have crimped the ability of U.S. automakers to produce vehicles and last year, General Motors was unseated by Toyota as the nation’s top-selling automaker for the first time.",
    "Semiconductor businesses have also been trying to diversify their operations to avoid bottlenecks caused by problems — such as a natural disaster or pandemic lockdown — in a specific region.",
    "Not only has the chip shortage disrupted the U.S. economy, it is creating a vulnerability in the country’s defense system since eight of every 10 chips are produced in Asia, lawmakers say.",
    "Those will likely to be used in the high-end computers that are popular with video game enthusiasts and needed for the data centers run by tech giants like Amazon and Microsoft.",
    "Intel executives made clear Friday that the size of its Ohio complex will depend on passage of the federal subsidies sought by the Biden administration and Ohio lawmakers.",
    "Intel said two planned factories, or fabs, will support its own line of processors as well as its new “foundry” business, which will build chips tailored for other firms.",
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors,” Ohio Gov.",
    "Intel said one of the products it will make in Ohio is the Intel 18A, “among the most advanced chips ever made,” according to Forrester analyst Glenn O’Donnell.",
    "Several chipmakers last year signaled an interest in expanding their American operations if the U.S. government is able to make it easier to build chip plants.",
    "“Such chips are not likely to power automobiles or consumer electronics because most of those chips do not need such advanced manufacturing,” O'Donnell said.",
    "The U.S. and Europe are pushing to aggressively to build chip making capacity and reduce reliance on producers that are now mostly based in Asia.",
    "As Biden alluded to, lawmakers have been urging House and Senate leaders to fully fund a law meant to address the semiconductor chip shortage.",
    "The chips built there will not just reduce supply chain pressures, but be part of national security and bring more tech jobs into the region.",
    "The investment outside Columbus in central Ohio is unique and unlike other forms of economic development, said Intel CEO Patrick Gelsinger.",
    "The foundry approach to making chips is currently led by rivals such as the Taiwan Semiconductor Manufacturing Co., or TSMC, and Samsung.",
    "They want Congress to fully fund the $52 billion CHIPS for America Act, allowing for stateside investment in semiconductor factories.",
    "Associated Press writer Matt O'Brien in Providence, Rhode Island, and Joshua Boak in Washington, D.C., contributed to this report.",
    "The economy continues to bounce back from the pandemic, but if you're in the market for a car, you may find your choices limited.",
    "The company is also investing an additional $100 million for an education pipeline to help provide jobs for the facility.",
    "Intel, based in Santa Clara, Calif., announced plans last year to spend $20 billion for two new factories in Arizona.",
    "“It’s more like a small city supporting a vibrant community of services, suppliers and ancillary businesses.",
    "Total investment could top $100 billion over the decade, with six additional factories, Gelsinger said.",
    "Along with the U.S. and Malaysia, Intel also has existing plants in Ireland, Israel, Vietnam and China.",
    "That's because computer chips that help power todays more tech-savvy automobiles are in short supply.",
    "“A semiconductor factory is not like other factories,” Gelsinger said during a White House event.",
    "Samsung said in November it plans to build a $17 billion factory outside of Austin, Texas.",
    "Randy Mac reports for the NBC4 News on Monday, April 12, 2021.",
    "“We’re investing in American workers.",
    "Seewer reported from Toledo, Ohio.",
    "Mike DeWine said in a statement.",
    "Intel is the No."
  ]
}