{
  "id": 6853,
  "mediaId": 2919,
  "date": "2022-01-29",
  "headline": "Feds expect Householder trial to take six weeks; could occur this fall",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/b892c9a/2147483647/strip/true/crop/1024x538+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F3b%2Fd4%2F7b86d9fd44d891043fe6be10e9fa%2Fimg-1626-1024x788.jpeg",
  "link": "https://www.news5cleveland.com/news/state/feds-expect-householder-trial-to-take-six-weeks-could-occur-this-fall",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.news5cleveland.com/jake-zuckerman",
  "termIds": [
    1688,
    1693,
    2209,
    4767,
    388,
    878
  ],
  "sentences": [
    "The charge entails engaging in a scheme to “defraud the public of its right to the honest services of a public official through bribery or kickbacks.”\nIn the DPA, FirstEnergy admitted to making the payments and using the nonprofit, a 501(c)(4), to “conceal payments for the benefit of public officials and in return for official action.” It admitted to making the payments to ensure passage of HB 6, which provided electric customer-funded bailouts to two nuclear plants owned by the company’s then subsidiary.",
    "Prosecutors say those funds were used for Householder’s personal enrichment; to elect a slate of GOP representative who would anoint him Speaker; and to engineer a political machine that engineered passage of a sweeping bailout, House Bill 6, worth an estimated $1.3 billion to FirstEnergy.",
    "FirstEnergy signed a deferred prosecution agreement (DPA) last summer — agreeing to a lengthy set of facts, paying a $230 million fine, and cooperating with the U.S. Department of Justice in exchange for the potential dismissal of one count of honest services wire fraud.",
    "Meanwhile, pre-trial motions are due at the end of the month, which can shed light on what evidence will come up, who may be called to testify, and other nuggets in what prosecutors have described as the largest political corruption case in state history.",
    "Federal prosecutors indicated Wednesday they expect the public corruption trial of former House Speaker Larry Householder will take about six weeks and could occur sometime this coming fall.",
    "Attorneys representing Householder and an alleged co-conspirator generally agreed a trial would take six weeks to leave time for jury selection and the parties to make their cases.",
    "Text messages obtained by the Ohio Capital Journal show Randazzo also lobbied lawmakers to slip a provision into the state budget that proved lucrative for the company as well.",
    "FirstEnergy claimed it paid Randazzo $4.3 million shortly before he accepted the position in return for regulatory and legislative favors that saved the company millions.",
    "Householder, a Perry County Republican, is accused of secretly operating a purportedly independent nonprofit that channeled about $60 million from FirstEnergy Corp.",
    "Another piece of the bill, known as “decoupling,” effectively forced ratepayers to guarantee FirstEnergy revenues against the risk of turbulence in energy markets.",
    "Thanks to HB 6, electric customers have paid $211 million since 2020 to American Electric Power, Duke Energy and AES Ohio to cover their losses on the plants.",
    "Another piece of the bill, providing hundreds of millions in electric customer-funded bailouts to utility companies who own two coal plants survived as well.",
    "However, they left intact provisions of the bill that gutted the state’s renewable energy portfolio standards and its energy efficiency programs.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "Alongside Householder, lobbyist and former state Republican Party chairman Matt Borges have pleaded not guilty and await trial.",
    "U.S. District Judge Timothy Black ordered the attorneys to meet privately to find a six-week block to set aside for the trial.",
    "Lobbyist Juan Cespedes and GOP political operative Jeff Longstreth pleaded guilty in the Fall of 2020.",
    "The plants, one in Indiana and one in Ohio, are owned by the Ohio Valley Electric Corp.",
    "Lawmakers repealed the nuclear bailout and decoupling provisions of HB 6 last year.",
    "Randazzo has not been charged with a crime and has maintained his innocence.",
    "Mike DeWine appointed in 2019 to serve as the state’s top utility regulator.",
    "Lobbyist Neil Clark pleaded not guilty but died by suicide in early 2021.",
    "The company also implicated Sam Randazzo, who Gov."
  ]
}