{
  "id": 6894,
  "mediaId": 2695,
  "date": "2022-01-21",
  "headline": "Intel plans to spend more than $20 billion building two chip factories in Ohio",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODg3ODg5OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMTEyMTQxNn0.TciiIYaw3e9ph4-Tu70fcLrYUi-m4ol-0qjDIBy6k_U/img.jpg?width=1200&coordinates=0%2C171%2C0%2C0&height=600",
  "link": "https://www.theblaze.com/news/intel-plans-to-spend-more-than-20-billion-building-two-chip-factories-in-ohio",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    1688,
    2177,
    3975,
    504,
    4916,
    5092,
    5212
  ],
  "sentences": [
    "At full buildout, the total investment in the site could grow to as much as $100 billion over the next decade, making it one of the largest semiconductor manufacturing sites in the world,\" the company's press release said.",
    "\"Spanning nearly 1,000 acres in Licking County, just outside of Columbus, the 'mega-site' can accommodate a total of eight chip factories – also known as 'fabs' – as well as support operations and ecosystem partners.",
    "\"While bringing thousands of high-paying jobs to Ohio, this historic investment will also help reshore semiconductor chip manufacturing, which has faced an international shortage over the past few years.\"",
    "\"Intel's new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors, often called ‘chips,’\" Ohio GOP Gov.",
    "While $20 billion is already massive sum, the tech giant says that over the coming decade, it could drop as much as $100 billion into the site.",
    "Chip manufacturing giant Intel has announced plans to pour more than $20 billion into constructing two factories in the Buckeye State.",
    "While speaking about the news on Friday, President Joe Biden called it \"a truly historic investment in America, in American workers.\"",
    "It is anticipated that construction will commence later this year and that chip production will begin in 2025, according to Intel.",
    "\"Today, we are burying the term 'rust belt,'\" Sen. Sherrod Brown (D-Ohio) said, according to a press release.",
    "\"This historic investment is great news for Ohio and for our nation,\" Sen.",
    "Political figures from both sides of the aisle are hailing the news.",
    "Mike DeWine said, according to a press release.",
    "Rob Portman (R-Ohio) said in a statement."
  ]
}