{
  "id": 6918,
  "mediaId": 2532,
  "date": "2022-01-30",
  "headline": "Full transcript of \"Face the Nation\" on January 30, 2022",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/01/30/300843b9-b841-40e3-8de9-c186b56440e1/thumbnail/1200x630/9d05f9082ab5676853f501217868b020/0130-ftn-full-884126-640x360.jpg",
  "link": "https://www.cbsnews.com/news/full-transcript-face-the-nation-01-30-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On this \"Face the Nation\" broadcast moderated by Margaret Brennan:\nDr. Scott Gottlieb, former FDA commissioner\nSenator Lindsey Graham, Republican of South Carolina\nCongressman James Clyburn, Democrat of South Carolina\nUkrainian Ambassador to the U.S. Oksana Markarova\nVictoria Nuland, undersecretary of state for political affairs\nClick here to browse full transcripts of \"Face the Nation.\"",
    "(ANNOUNCEMENTS)\nTrending News\n Blinken: NATO members have \"green light\" to send fighter jets to Ukraine\n DEA chief says agency has seized 15,000 pounds of fentanyl in 2021\n This week on \"Face the Nation with Margaret Brennan,\" April 24, 2022\n 3/27: Martin, Morell, Kinzinger\n Full transcript of \"Face the Nation\" on April 17, 2022",
    "NULAND: Margaret, we don't believe he's yet made a decision, but as he has done in the past, he's given himself every option, including, as the chairman said, a massive potential invasion of all of Ukraine, including cyber attacks, including incursion from Belarus, where he is moving up to thirty thousand troops there as well.",
    "REP. CLYBURN: Well, it says to every little child up there growing up under moderate circumstances, needing the entire community help raise it, getting scholarships to go up to school because she couldn't afford to go otherwise, going to public schools because you didn't get an offer from one of the big private schools.",
    "That's the reason why they pushed it out and asked for that third dose, but now, if the goal of the vaccine is to get baseline immunity in the kids to prevent really bad outcomes, and you're really not using the vaccine as a tool to prevent infection in the first place, two doses could do that.",
    "What's likely to happen is as we were coming down, and coming down quite sharply in parts of the Northeast, Florida, the mid-Atlantic, you might see as this new strain starts to pick up, you might see that we start to slow down in that decline, but the decline will happen nonetheless.",
    "So we are merely discussing what we already agreed with the United States, and we are discussing how to implement it\nMARGARET BRENNAN: To be very clear, you are asking Congress and you were asking the White House to put sanctions on Russia right now not to wait for an invasion.",
    "SEN. GRAHAM: he's hurting the- Oh, an array of pre-invasion sanctions, the Nord Stream 2 pipeline, which is a cash cow for Putin, that'll probably be after the invasion, knocking them out of financial systems that they will need to conduct business normally, the Swift program.",
    "MARGARET BRENNAN: As you know, coming up on this program, Congressman Jim Clyburn, he has said repeatedly in interviews that South Carolina Federal District Judge Michelle Childs, not only as someone he likes, but that both South Carolina Republican senators will support her.",
    "With the United States, especially and with other partners and allies, we may have difference of opinions on when to introduce sanctions, we may have difference of opinions on some issues, but those are friendly, open and candid discussions–\nMARGARET BRENNAN: You do–\nAMB.",
    "MARGARET BRENNAN: Well, but to that point, and you know, because I ask you almost every week because my own kids can't get vaccinated, that that's just going to continue to be a risk right until the youngest children, four and under can get a vaccine.",
    "So what we've been doing is first, given Ukraine the kinds of defensive lethal equipment that they need in order to be able to make this if Russia makes that big mistake and moves in a very bloody fight and slow Moscow's role.",
    "MARGARET BRENNAN: But the White House says- they issued a statement: \"At the same time, President Zelensky is downplaying the risk of invasion, he's asking for hundreds of millions of dollars in weapons to defend against one.",
    "Russia still maintains it has no plans to invade its neighbor, but that doesn't explain the roughly 100,000 Russian troops amassed on Ukraine's border, while Russia military drills on land and at sea have set off alarm bells.",
    "It will have a crushing blow on them, and we are also preparing within NATO's territory because obviously we have a sacred and sovereign responsibility to protect our NATO allies and with the kind of forces that he's moving.",
    "But his guts told him as he told me, when you grow up with the kind of experience the two of us have had, then your guts telling you some things, and sometimes people did not have those experiences they would not feel.",
    "He's already said that he agrees with us closing the so-called coverage gap, so that those people who are eligible for Medicaid or in states that cannot- did not expand the Medicaid, that they will have health care.",
    "I would say that one of the strengths of U.S. policy vis-a-vis Ukraine going back some 30 years, but particularly in this instance, has been that we've had a really strong bipartisan approach to supporting Ukraine.",
    "MARGARET BRENNAN: Well, you have been glowing in your descriptions, but your colleague, Senator Roger Wicker of Mississippi, said picking a female black Supreme Court justice is affirmative racial discrimination.",
    "REP. CLYBURN: No, I'm not saying who it is, I am saying that all of us, I had the same problem every time I run for election, talking to my grandson just yesterday, telling me what he thought I ought to do now.",
    "MARKAROVA: Well, in addition to military attacks, we experience it since 2014 and especially now, Russia engages in cyber attacks or kind of hybrid war, cyber disinformation, all kinds of information campaigns.",
    "That was the old measure in the age of Omicron, with a much more contagious variant and with the fact that the population has a lot of immunity, so we're less susceptible overall, we may need to rethink that.",
    "MARK STRASSMANN: New COVID cases down sharply, hospitalizations down encouragingly, but Omicron's overall milder impact comes with a qualifier:\nDR. ROCHELLE WALENSKY (CDC Director): Milder does not mean mild.",
    "So, punish Putin now more, weapons to the Ukraine now so they can defend themselves, more economic aid to the Ukrainian economy so they can- they can deal with the threat of invasion and more troops to NATO.",
    "Data out of Denmark from the Serum Institute suggests it's about 1.5 times more contagious than the strain of Omicron that has made it around the US–\nMARGARET BRENNAN: which is already so transmissible.",
    "The chairman of your parliament wrote a letter to eight senators, including one of them on this program, asking for air defense, anti-ship, anti-armor capabilities, flexible loans, financing mechanisms.",
    "We have also worked with our European allies on a massive package of economic sanctions so that if he does move on Ukraine, he will feel it acutely, as will the Russian people in terms of their economy.",
    "They continue to do that, trying to clear them, not only for the utility crews that have to restore power, but also getting them ready for the Monday morning work and school commutes -- Margaret.",
    "We will have a report from Eastern Ukraine and check in with Ukraine's ambassador to the U.S., Oksana Markarova, and one of the Biden administration's top diplomats, Ambassador Victoria Nuland.",
    "MARGARET BRENNAN: The chairman of the Joint Chiefs of Staff, Mark Milley, says he hasn't seen a military buildup like this since the Cold War: Artillery, ballistic missiles, ground air forces.",
    "There's a lot to get to today, but we begin with that massive winter storm that walloped the Northeast, bringing with it at least two feet of snow, hurricane-force winds and coastal flooding.",
    "Senator Menendez, Democrat, on another program this morning, said they're nearing bipartisan agreement on a package of sanctions, some of which would put sanctions on Russia now, some later.",
    "NULAND: We are working intensively with the Congress on this piece of legislation that we expect will be very well aligned with what we are also building with our NATO allies and partners.",
    "(End VT)\nMARK STRASSMANN: Something to keep an eye on, a new subvariant nicknamed Stealth Omicron.Detected in roughly half the states, preliminary findings show it's even more contagious.",
    "And in fact, there's data out of the U.K. that suggests that a fully boosted person may be more protected against this new variant than they were against the original strain of Omicron.",
    "Right now, it represents probably about five percent of infections in the US, and we have so much Omicron immunity that's probably going to be a backstop against this really taking off.",
    "We've heard some signs that the Russians are interested in engaging on that proposal, including the fact that Secretary Blinken and Foreign Minister Lavrov will likely speak this week.",
    "MARGARET BRENNAN: But your president said Ukraine's grateful for support, but I can't be like other politicians who are grateful to the United States just for being the United States.",
    "You'll long for the good old days of the Cold War because every president in the future will pound you and every Congress in the future will pound you if you dismantle this democracy.",
    "I think we need to focus a little bit more attention on trying to prevent introduction into those settings, because once you get an infection in that setting it's hard to control.",
    "MARGARET BRENNAN: Senator, more than 730 people have been charged by the Justice Department for their role in the attack on the Capitol on January 6th to stop–\nSEN. GRAHAM: Right.",
    "MARKAROVA: It's the same we have been asking for eight years, but especially this year, you know, strong three levels of deterrence: political, economic and military defensive.",
    "We go now to former FDA commissioner and Pfizer board member Dr. Scott Gottlieb, who made it out of the snowstorm in Connecticut and down here to Washington, D.C. this morning.",
    "MARGARET BRENNAN: We heard from the chairman of the Joint Chiefs this week that Russia has given itself the capability if it wanted for a full invasion, not just an incursion.",
    "MARGARET BRENNAN: You had just shared that you'd spoken to President Biden months ago with Michelle Childs, a candidate we know for this potential spot on the Supreme Court.",
    "JEFF ZIENTS (White House COVID-19 Response Coordinator): We continue to move toward a time when COVID won't disrupt our daily lives, a time when COVID is no longer a crisis.",
    "When Kamala Harris and her associates and the people that work for her, her staffers, raised money to bail out the rioters who hit cops in the head and burned down stores.",
    "Russia illegally occupies together with their controlled people, parts of Donetsk and Luhansk territories, and they didn't change their behavior during the eight years.",
    "We turn now to the COVID-19 pandemic, where, despite a decline in hospitalizations and new cases, deaths are still rising, and the virus is still highly transmissible.",
    "With this new homegrown strain that's circulating, we may stall out around 20, and that may be the point where we have to consider withdrawing a lot of these measures.",
    "SEN. GRAHAM: Here's what I'll tell him and the nation, I- I can't think of a better person for President Biden to consider for the Supreme Court than Michelle Childs.",
    "So that's why it's in the interest of Europe and all democratic world to help us to defend ourselves, but also to show that the international rule of law still works.",
    "MARGARET BRENNAN: Well, talking about those midterms and the need for a win here, I want to ask you about Jamie Harrison, the head of the Democratic Party, right now.",
    "He's looking at sovereign debt sales, hitting oligarchs close to Vladimir Putin, the banks that handle critical industries and- on top of export import restrictions.",
    "Also, while the vaccines prevent infection, so a fully boosted adult has probably a 50 percent lower chance of getting infected in the first place with that vaccine.",
    "But with regard to this package of sanctions, you know, deterrence is best when there's a little bit of strategic ambiguity around exactly what we are going to do.",
    "NULAND: Well, first of all, Margaret, with regard to the diplomatic proposal, you know, Putin put forward and publicly all of the things that he's interested in.",
    "In fact, we had those conversations when he was serving as vice president that he came up under modest circumstances- Scranton, Pennsylvania, then in Delaware.",
    "MARKAROVA: Well, if you look at the statement by our presidents when they met in the White House, you will see a number of these issues in the joint statement.",
    "And so far, based on what we've seen out of Denmark and the U.K., which are collecting very good data on this, it doesn't appear to be a more virulent strain.",
    "MARKAROVA: In 2014, when Crimea has been attacked and when Crimea has been illegally occupied or annexed, as Russia says, that has been the start of the war.",
    "Do you feel that Democrats need this nomination and that it will make a difference going into the midterms, given these other promises were not delivered on?",
    "DR. GOTTLIEB: Well, look, if the- if federal health officials in the agency decide to authorize this on the basis of two doses, it could be out much sooner.",
    "Then: President Biden vows he will make good on his promise for an historic pick for the Supreme Court, as Justice Stephen Breyer announces his retirement.",
    "Let's talk about how we can de-escalate, with regard to exercises, with regard to military deployments, let's have that conversation on a reciprocal basis.",
    "So I don't want to do anything from raising bail to pardoning people who take the law into their own hands because it will make more violence more likely.",
    "Now, this morning, the snow has finally let up, but we're not yet in the clear, with much of the region now digging out and concerned about a deep freeze.",
    "Previously, we had data showing that the childhood vaccine for four- six months to four years wasn't as protective against infection as the adult vaccine.",
    "And I will end with this point: If you invade the Ukraine, if Russia invades the Ukraine, no future president, no future Congress–\nMARGARET BRENNAN: Yeah.",
    "She says she wants to talk to you about that phone call you made to Georgia's secretary of state ten days after the election, are you going to cooperate?",
    "And again, as I said, we know what Russians are capable of, But let's be very clear here, we know who aggressor is and everyone knows who aggressor is.",
    "Throughout Massachusetts, plows faced whiteout conditions, as the rate of the blinding snowfall made it a challenge for those cleanup crews to keep up.",
    "There is some indication if you listen to federal health officials that they may be rethinking the vaccine in zero- in six months to four years old.",
    "We actually see the situation the same way and we see the build up and we also know what Russia is capable of because they have attacked us already.",
    "MARGARET BRENNAN: Well, it appears that the Senate is also nearing a bipartisan agreement on a package of sanctions, some of which would hit Russia.",
    "HOLLY WILLIAMS: With tensions reaching a crescendo, Russia's president, Vladimir Putin, laid a wreath for the fallen during the Second World War.",
    "DR. GOTTLIEB: Look, I think they're doing all they can do, but the guidance really focuses on trying to prevent spread within the daycare center.",
    "They're not- They're not 90 percent protective and probably in the younger kids, they're going to be a little less protective against infection.",
    "And you recall the first time he ever said that was at the South Carolina debate the 25th of February-\nMARGARET BRENNAN: I remember I was there.",
    "The attack has been wider than that, and our security sources, together with our partners from the U.S., are looking at that particular attack.",
    "Here in eastern Ukraine, people do not seem to be panicking, and perhaps that's because they've been living with Russian aggression for years.",
    "The country's president, Volodymyr Zelensky, accused other world leaders of sowing panic late last week and putting Ukraine's economy at risk.",
    "MARGARET BRENNAN: So, you know, we've talked about it there every time that there is an infection, these child care centers have to shut down.",
    "Well, any- any attack on the sovereignty of a nation, any attack on their critical infrastructure, any attack on their ability to do business.",
    "After 911, we came together, we formed a bipartisan committee after the next election--\nMARGARET BRENNAN: I was talking about Georgia though.",
    "And I think that may be why federal health officials are rethinking this if in fact they decide to authorize this on the basis of two doses.",
    "The entire Eastern Seaboard was somehow, some way impacted by this storm system, as far south as Florida, which felt freezing temperatures.",
    "We may need to decide that once we get to 20 cases per 100,000 per day, that may be the point at which we start to withdraw these things.",
    "So right now you look at a lot of federal health guidance, and it says that these measures should be lifted when there's low prevalence.",
    "We mentioned there, our Mark Strassmann was reporting on San Francisco being the first major city to roll back its indoor mask mandate.",
    "In the history of our country, we've only had five women serve and two African-American men, so let's make the court more like America.",
    "And today on Face the Nation: a winter whiteout in parts of New England, as a blizzard with hurricane-force winds rocks the Northeast.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: President Biden has promised to name a black woman to replace Supreme Court Justice Stephen Breyer.",
    "As you probably know, I have made it the motto of my service; making America's greatness accessible and affordable for all Americans.",
    "You've been vocal in your endorsement of Federal District Judge Michelle Childs the White House acknowledged she's being looked at.",
    "NULAND: Panic is not a policy, as one of my bosses once said, what we need to do is prudent planning, and that's what we are doing.",
    "The District Attorney in Georgia has- in Fulton County has gotten clearance to set up a grand jury to investigate President Trump.",
    "Contenders include Ketanji Brown Jackson of Washington, D.C., Leondra Kruger of California, and Michelle Childs of South Carolina.",
    "Ultimately, the decision resides with FDA, but there is some indication that there may be an early reaction on that application.",
    "As Putin tries to dismantle NATO and divide NATO, I support President Biden's decision to send more troops in to reinforce NATO.",
    "Listen, I want to support President Biden to the- to the full extent possible, but the Congress is ready to sanction Putin now.",
    "Even if you keep them in social pods, they're going to play together, so it's hard to control transmission within that setting.",
    "The secretary of defense warned of unconventional tactics, like staged incidents that Russia could use as a pretext to move in.",
    "So, you know, given that Putin has made these moves before, even as we encourage diplomacy, we have to be ready for the worst.",
    "There'd be a bipartisan support for more- more lethal aid now to the Ukraine, more economic assistance for the government now.",
    "You know, we make a real effort as Republicans to recruit women and people of color to make the party look more like America.",
    "We have said, let's talk about the medium and short range missiles, the threat you feel from us, the threat we feel from you.",
    "The reason he attacked us is because we have chosen to be a democracy and we have the Euro-Atlantic and European aspirations.",
    "(BEGIN VT)\nHOLLY WILLIAMS (voice over): More Russian fighter jets arrived in Belarus this week on Ukraine's northern border.",
    "But I think I've made it pretty clear that I'm a big admirer of–\nMARGARET BRENNAN: Yes, you did–\nSEN. GRAHAM: Judge Charles.",
    "A couple hundred thousand homes and businesses lost power in the state, and tens of thousands are still without power today.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We go now to Victoria Nuland, the State Department undersecretary for political affairs.",
    "But as you know, Russia already has tactical tactical nuclear weapons in Kaliningrad and elsewhere that can range Europe.",
    "Getting two doses into a child can provide baseline immunity that protects them from severe disease from hospitalization.",
    "But if we put them on the table now, then Russia will be able to start mitigating and that doesn't make any sense to us.",
    "I believe there are plenty of qualified African-American women, conservative and liberal, that could go onto the court.",
    "So this portion of the puzzle, and if a vaccine is greenlit for the youngest Americans, does it unlock everything else?",
    "Whether you like it or not, Joe Biden said, I'm going to pick an African-American woman to serve on the Supreme Court.",
    "He's reportedly considering leaving that job ahead of the midterm races because of disagreements with the White House.",
    "It says to them, you've got just as much of a chance to benefit from the greatness of this country as everybody else.",
    "We're very grateful for the United States, for very strong relations, strong relations and strong response this time.",
    "MARK STRASSMANN: After two months of runaway infections, Omicron is generally relaxing its headlock on American life.",
    "Only nine states, Washington, D.C., and Puerto Rico, still require indoor masking, regardless of vaccination status.",
    "Overseas, Ukraine's president insists the showdown with Russia just isn't as dire as the U.S. and Europeans warned.",
    "MARGARET BRENNAN: So if Vladimir Putin does launch a further attack on Ukraine, do you believe he will stop there?",
    "They are coming also closer to the borders of our Baltic allies Poland, Romania, Hungary, so we have to be ready.",
    "And we're trying everything possible and doing everything possible to strengthen our capabilities there as well.",
    "A majority of flights, thousands of them, were canceled at major airports in the Mid-Atlantic and the Northeast.",
    "Community spread is in the high range across the country, and a new variant of Omicron has raised new concerns.",
    "So if you had Omicron infection, you should have protection against subsequent infection from this new variant.",
    "If you invade the Ukraine, you will destroy the ability of future presidents to treat you and Russia as normal.",
    "MARGARET BRENNAN: How significant is the risk that Russia may deploy tactical nuclear weapons to to the border?",
    "There are other groups with causes that may want to go down to the violent path that these people get pardoned.",
    "But I have to hit this quick commercial break and we'll have an extended conversation on the other side of it.",
    "The only potential nominee that the White House has publicly acknowledged being under consideration is Childs.",
    "That's the portion of the spike protein that we develop our best antibodies against that neutralize the virus.",
    "SEN. GRAHAM: if she's nominated, she will not be treated like Judge Kavanaugh, I promise you, by Republicans.",
    "Ukraine's President Zelensky said Friday that his country is aware of these risks, but they don't want panic.",
    "You know, the failure to get voting rights legislation passed, the failure to agree on a police reform bill.",
    "Our relations, especially during the last year, has been at the highest level ever, I would say in 30 years.",
    "MARGARET BRENNAN: Dr. Fauci said this week the best- that it would be a three dose regimen for the youngest.",
    "SEN. GRAHAM: A cyber attack against the United States would be an act of war, and we shall respond in kind.",
    "REP. CLYBURN: I'm not going to name those people, I think it's not-\nMARGARET BRENNAN:Is it the White House?",
    "The diplomatic back and forth continues, and NATO allies are considering sending more troops to the region.",
    "MARGARET BRENNAN: Well, we know the president has said he will make his pick public by the end of February.",
    "Joe Manchin has made it very clear that if we were to meet- make it means tested that he could agree to it.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We go now to Democratic Whip Congressman James Clyburn of South Carolina.",
    "As Whip, what else are you going to be able to deliver to the president to- to sort of announce that date?",
    "And if Ukraine will be further attacked by Russia, of course they will not stop in Ukraine- after Ukraine.",
    "And plane loads of military equipment have been arriving in in Kyiv, including Javelin anti-tank missiles.",
    "(END VT)\nHOLLY WILLIAMS: Ukraine's government is not ruling out an escalation, but continues to urge calm.",
    "Images from space show the bomb cyclone bearing down on the Northeast, dumping more than two feet of snow.",
    "Number one, a lot of- we're seeing a lot of parents with young kids aren't getting their kids vaccinated.",
    "What do you think putting this kind of diversity on the court the first black woman does for the country?",
    "So we've said financial measures, we've said export controls, we've said new sanctions on Russian elites.",
    "More broadly, you were the man who really exacted this promise during the campaign from President Biden.",
    "That said, Margaret, as you know, we did send our diplomatic proposal to Russia, as did NATO this week.",
    "Our response and NATO's response agrees to engage him on many of these things that you've talked about.",
    "That's the kind of conversation I had with candidate Biden way back when he was running for president.",
    "I believed that two years ago, it is why I advised then Candidate Biden to put that into his campaign.",
    "Nikki Haley of South Carolina also tweeted the president should not have a race or gender litmus test.",
    "South Carolina Republican Senator Lindsey Graham joins us from Clemson, South Carolina, this morning.",
    "I have not spoken to him recently about her, sent him or sent the White House a letter 13 months ago.",
    "And those who did it, I hope they go to jail and get the book thrown at them because they deserve it.",
    "MARGARET BRENNAN: You and I are going to talk about her and the whole process more in just a moment.",
    "And you've talked about this Supreme Court nomination as the kind of things that Democrats may need.",
    "He's talking about moving potentially a small number of troops into allied countries in the region.",
    "MARKAROVA: Well, the reason why Putin attacked us is not because he wants Ukraine, or only Ukraine.",
    "PRESIDENT DONALD TRUMP: If I run and if I win, we will treat those people from January 6th fairly.",
    "And if it requires pardons, we will give them pardons because they are being treated so unfairly.",
    "And President Reagan said running for office that he wanted to put the first female on the court.",
    "And I'm hopeful that you could see some movement on trying to entertain that application earlier.",
    "So the mutations in this new version are not in the receptor binding domain on the spike protein.",
    "Plus, we will talk with former FDA Commissioner Dr. Scott Gottlieb about the new Omicron variant.",
    "All of us, not only our military, our very capable military and veterans, but also all civilians.",
    "So he did it, and it made all the difference in the world and it's still making a big difference.",
    "NULAND: On the contrary, he's moved more forces since we've been encouraging him to de-escalate.",
    "And I think the decision matrix has changed around the vaccine for six months to four year olds.",
    "Most of the mutations are in a separate part of the spike protein called the N-terminal domain.",
    "MARGARET BRENNAN: You told me before you think a cyber attack will proceed any military action?",
    "We continue our conversation with Democratic Whip, Congressman James Clyburn of South Carolina.",
    "It's possible the opponents of the big package have talked about things that they can support.",
    "Yeah, I talked- I asked about how the system worked when it came to mail in voting- balloting.",
    "Recently, couple of weeks ago, a number of Ukrainian ministers have been attacked and defaced.",
    "We do not want to be part of the Soviet Union or the Russian Empire or the Russian Federation.",
    "Putin's given himself that option, but he's also given himself the option of a major invasion.",
    "But United States is our strategic partner, and I would even say strategic friend, number one.",
    "But President Zelensky stood up and said Russia may simply be applying psychological pressure.",
    "Ultimately, the decision does come back down to the individual, what choice they want to make.",
    "That creates practical problems for parents who want to go out and participate in the economy.",
    "SEN. GRAHAM: Well, what I don't know if she's going to be nominated–\nMARGARET BRENNAN: Yeah.",
    "All of this is on the table, but the–\nMARGARET BRENNAN: European allies don't support that.",
    "MARKAROVA: Thank you and thank you to all your viewers and all American people for support.",
    "Can you revive any portion of build back better, which is completely stalled at the moment.",
    "So I know what it is to lose an election and I know what is to come back from the election.",
    "So defensive lethal equipment like anti-tank, like anti-air, all of these kinds of things.",
    "I think we should be focusing more on trying to keep the infection out in the first place.",
    "Now, the storm also whipped up waves Saturday, battering the entire New England coastline.",
    "And we cannot look past the strain on our health systems and substantial number of deaths.",
    "MARK STRASSMANN: Roughly 100 million eligible Americans have yet to get fully vaccinated.",
    "And, in Roanoke, Virginia:\nMAN: It's time to stop refusing parents their right to parent.",
    "So we do not necessarily believe in all of the consultants and the people who run things.",
    "I think that's an important point to make to show the potential of this kind of conflict.",
    "So it's an attack on democracy, and I believe nobody is safe if Ukraine will be attacked.",
    "That's when President Biden believes there's a distinct possibility Russia could invade.",
    "And we're very glad that this year U.S. is actually taking active role in negotiations.",
    "It maybe, perhaps extends the tail on the decline that we're seeing across the country.",
    "And I'd like to see the court have- a have a lot more balance, some common sense on it.",
    "Does it evade the immunity that we've acquired from Omicron infection or the vaccines?",
    "(Begin VT)\nMARK STRASSMANN (voice-over): Finally, a COVID update not steeped in dread.",
    "There was more snow here yesterday than the city averages the entire month of January.",
    "SEN. GRAHAM: No, I don't want to send any signal that it was OK to defile the Capitol.",
    "South Carolinians Republican Lindsey Graham and Democrat Jim Clyburn will be with us.",
    "The CDC's new guidance: Providers should get boosted and tested at least once a week.",
    "So I suspect that there's going to be some hesitation with the youngest kids as well.",
    "So you're still going to see kids be able to get infected even if they're vaccinated.",
    "Put me in the camp of making sure the court and other institutions look like America.",
    "She's a graduate of the University of South Carolina, a public education background.",
    "He's threatening- he's warning to get his way by threatening it to invade a country.",
    "But there's a political movement using the law to try to knock Trump out of running.",
    "I want to ask you about something\nREP. CLYBURN:I didn't say I was going to be done.",
    "We want to be sovereign, we are sovereign and we are fighting for our independence.",
    "MARGARET BRENNAN: OK, well, in your version of a bill, what would trigger invasion?",
    "And so far as we know that the vaccine isn't as protective at preventing infection.",
    "DR. SCOTT GOTTLIEB: You know, the question is, does this change the decision space?",
    "WOMAN: We have been trying to scream at the top of our lungs to say how bad it is.",
    "MARKAROVA: We are open and candid and we are discussing it with our partners here.",
    "I mean, look, we can have some discussions and we can have difference of opinions.",
    "MARGARET BRENNAN: Well, we will watch you to see if it actually will be done, sir.",
    "MARGARET BRENNAN: That was clear, Senator, before I let you go, I want to ask you.",
    "You've repeatedly said that black women are the backbone of the Democratic Party.",
    "LLOYD AUSTIN, SECRETARY OF DEFENSE: This is straight out of the Russian playbook.",
    "MARGARET BRENNAN: So if you had Omicron, can you be reinfected with this version?",
    "So I don't concede- I don't see Michelle Childs as an act of affirmative action.",
    "I do see putting a black woman on the court, making the court more like America.",
    "And as to Michelle Childs, I think she's qualified–\nMARGARET BRENNAN: All right.",
    "We're now joined by Oksana Markarova, Ukraine's ambassador to the United States.",
    "Jamie Harrison ran a very bruising race with the gentleman you just had on here.",
    "I said now, when is the last time you've been out asking anybody for their vote?",
    "We've had members of Congress out there regularly over the last couple of weeks.",
    "NATO says it's sending more fighter jets and ships to reinforce eastern Europe.",
    "MARGARET BRENNAN: But you're in terms of what you're asking U.S. taxpayers for.",
    "He questioned her- any potential impartiality from any of the candidates named.",
    "DR. GOTTLIEB: I don't think it unlocks everything else for a couple of reasons.",
    "It lowered the recommendation for isolation post-infection to about five days.",
    "I think he is exactly what we need for this party at this particular juncture.",
    "Affirmative action is picking somebody not as well qualified for past wrongs.",
    "It would be good for the court to have somebody who's not at Harvard or Yale.",
    "SEN. GRAHAM: It's okay to go to a public university and get your law degree.",
    "Since 2014, for eight years, we are at war and we are defending our country.",
    "At the same time, in order to defend our country, we cannot afford to panic.",
    "Back in November, you told the AP, \"Jaime Harrison knows how to do the job.",
    "What I'm talking about could be done in several days, if not several hours.",
    "I don't want to do anything that would make this more likely in the future.",
    "I know, but there's an effort here to use the law, I think inappropriately.",
    "The administration has wanted to wait and hold on to sanctions as leverage.",
    "Because President Biden has said he's not sending combat troops to Ukraine.",
    "We know President Biden is already looking at sanctions after an invasion.",
    "That's why I don't think this is going to create a huge wave of infection.",
    "They're dismembering the Ukraine by the invasion- the threat of invasion.",
    "Is there a clear benchmark yet for when health measures should be lifted?",
    "REP. CLYBURN: And he and I have been talking about it for several months.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Turning now to the tensions in Ukraine.",
    "MARGARET BRENNAN: All right, congressman, thank you for your time today.",
    "Everybody doesn't have to be from Harvard, Yale–\nMARGARET BRENNAN: Yeah.",
    "Is this enough or are you saying you're pushing President Biden further?",
    "Well, if you shut it down through a cyber attack, it's the same outcome.",
    "But day care centers remain worrisome, with kids too young for vaccines.",
    "Winds gusted as high as 83 miles per hour on Cape Cod in Massachusetts.",
    "We want to settle these issues through diplomacy, through arms control.",
    "MARGARET BRENNAN: So there is no sign yet of any kind of de-escalation.",
    "That fits right nicely with that March 1st State of the Union address.",
    "SEN. GRAHAM: And I think there's bipartisan support to reinforce NATO.",
    "The CDC defines low prevalence as 10 cases per 100,000 people per day.",
    "It was a relentless and historic single-day snowstorm here in Boston.",
    "GOVERNOR MIKE DEWINE (R-Ohio): We have done everything that we could.",
    "MARGARET BRENNAN: You are being very diplomatic in your answer there.",
    "HOLLY WILLIAMS: There are 8,500 American troops on heightened alert.",
    "Here in D.C. that just extended it to the end of February, at least.",
    "SEN. GRAHAM: The bipartisan working group will submit sanctions now.",
    "MARGARET BRENNAN: All right, Senator, I want to move on to Ukraine.",
    "President Reagan promised to nominate a woman, Sandra Day O'Connor.",
    "There's no reason that this situation has to devolve into conflict.",
    "MARGARET BRENNAN: Ambassador Nuland, thank you for your time today.",
    "\"We think it's important to be open and candid about that threat.\"",
    "HOUSE MAJORITY WHIP JIM CLYBURN: Yes, I did it several months ago.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Welcome back to Face the Nation.",
    "SEN. GRAHAM: So what's going on Georgia and the January 6th- Yeah.",
    "But qualifications have to be the- the- the biggest consideration.",
    "We will talk to two key players when it comes to the confirmation.",
    "What the vaccine is going to do is protect them from bad outcomes.",
    "But they are making preparations for a possible Russian invasion.",
    "Is this about containing the threat from becoming a regional war?",
    "I think it's hard to ask a two or three year old to wear a mask.",
    "Most of the evidence so far, it's preliminary, suggests it does.",
    "He's dismantled–\nMARGARET BRENNAN: On what specifically, though?",
    "Because there's an array of options Vladimir Putin's looking at.",
    "We're now averaging 2,300 COVID deaths a day, many preventable.",
    "You will also see it in the framework agreement that we signed.",
    "And look, he should have as much opportunity as everybody else.",
    "It means that people have different approaches to doing things.",
    "MARGARET BRENNAN: OK, Senator, thank you for joining us today.",
    "I- I don't want to reinforce that defiling the Capitol was OK.",
    "Experts say they've previously been a prelude to an incursion.",
    "Only about 25 percent of kids five to 11 have been vaccinated.",
    "So, I think there'll be bipartisan support for sanctions now.",
    "MARGARET BRENNAN: That- that sounds like pretty close to yes.",
    "It could be out much sooner, perhaps as early as early March.",
    "Can you sort of put in perspective what the strategy is here?",
    "And I'm the same way I lost three times before I got elected.",
    "REP. CLYBURN: That's one of the things that drawed me to him.",
    "MARGARET BRENNAN: You're saying the war has already started.",
    "Have you resolved this kind of friction with the Ukrainians?",
    "Until next week, for FACE THE NATION, I'm Margaret Brennan.",
    "We are under constant attack, especially in the cyberspace.",
    "LLOYD AUSTIN: And Mr. Putin can do the right thing as well.",
    "He's being hamstrung by people who never ran for anything.\"",
    "I want to deter people who did what–\nMARGARET BRENNAN: Yes.",
    "She's considered to be a fair minded, highly gifted jurist.",
    "You can't get your way by threatening to invade a country.",
    "San Francisco will ease its mask mandate starting Tuesday.",
    "MARGARET BRENNAN: But isn't that a dangerous thing to say?",
    "So I don't know what they're going to do in Fulton County.",
    "He said the impact would be horrific if Russia uses these.",
    "This is the reality of this recent escalation since April.",
    "MARGARET BRENNAN: I want to understand what you need now.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: That's it for us today.",
    "You know, you've got kids who don't wear masks very well.",
    "DR. GOTTLIEB: Yeah, this is going to be a real challenge.",
    "There's no affirmative action component if you pick her.",
    "I am tired of Putin, China and North Korea attacking us.",
    "This truly is the virus that wouldn't leave -- Margaret.",
    "MARGARET BRENNAN: There is a new variant of concern BA2.",
    "Because it sounds a lot like there's some friction here.",
    "Because the US is warning this could have global impact.",
    "This is the reality with which we live for eight years.",
    "I expect those who defile the Capitol to be prosecuted.",
    "This as Moscow continues to ship weapons and equipment.",
    "Do you feel that is what the White House is doing here?",
    "Now, plows are working on the roads again this morning.",
    "If they blew up a pipeline that would be an act of war.",
    "Right now, Washington, D.C. is at 50, New York's at 75.",
    "I'm not so sure we're going to get to 10 anytime soon.",
    "MARGARET BRENNAN: OK, Dr. Gottlieb, thank you so much.",
    "He's using the threat of force of arms to get his way.",
    "Is this good health policy along with economic policy?",
    "I don't know what the Jan. 6 committee is going to do.",
    "Senator Graham just gave her a glowing recommendation.",
    "Has Vladimir Putin made a decision on what to do next?",
    "There have been some loose talk from folks in Russia.",
    "We share the information with our friends and allies.",
    "That's what we are encouraging Ukraine to do as well.",
    "So yes, we believe the basis for sanctions is there.",
    "Ambassador, thank you very much for your time today.",
    "And I, particularly, don't like it or appreciate it.",
    "MARGARET BRENNAN: the certification of our election.",
    "The CDC says it's already here in the United States.",
    "And then the final question is, is it more virulent?",
    "But there will be more sanctions come if he invades.",
    "But I cannot say anything bad about Michelle Childs.",
    "MARGARET BRENNAN: Mola Lenghi in Boston, thank you.",
    "Last night, President Trump, at a rally, said this.",
    "We'll be right back with Congressman James Clyburn.",
    "It doesn't mean that he is wrong or they are wrong.",
    "I know he worked for you for years on Capitol Hill.",
    "AMBASSADOR VICTORIA NULAND: Good morning, Margaret.",
    "Is what the White House giving you not sufficient?",
    "MARGARET BRENNAN: We'll be right back in a moment.",
    "The January 6 committee was not the 911 committee.",
    "Thank you for sticking with us through that break.",
    "The CDC issued new guidance to child care centers.",
    "She's one of the most decent people I've ever met.",
    "MARGARET BRENNAN: That could be a big development.",
    "There's bipartisan support to sanction Russia now.",
    "Is there any indication of that type of buildup?",
    "You don't want to have divide with an ally here.",
    "REP. CLYBURN Thank you very much for having me.",
    "I also know he like all of us in this business.",
    "Who are those people whose standing in his way?",
    "REP. CLYBURN: Yes, we can do that by March 1st.",
    "MARGARET BRENNAN: We will be watching for that.",
    "He's trying to destroy a neighboring democracy.",
    "MARGARET BRENNAN: But a cyberattack in Ukraine?",
    "And FACE THE NATION will be back in one minute.",
    "And we've seen a lot of bad outcomes with kids.",
    "I don't think it really changes the narrative.",
    "And we'll see how she does if she's nominated.",
    "Michelle qual- Childs is incredibly qualified.",
    "REP. CLYBURN: As- I certainly do believe that.",
    "He believes in fighting rather than switching.",
    "NULAND: We have not seen nuclear weapons move.",
    "Is this a formal request from your government?",
    "Moscow says for military exercises next month.",
    "Have you spoken to President Biden about her?",
    "Did you tell him you're a yes vote on Childs?",
    "Well, the Congress has a different view here.",
    "MARGARET BRENNAN: Mark Strassmann, thank you.",
    "Good morning, and welcome to Face the Nation.",
    "Our Mola Lenghi reports from Boston -- Mola.",
    "About 18 percent have been fully vaccinated.",
    "And I will just say this to President Putin.",
    "SEN. GRAHAM: Well, it's not different to me.",
    "MARGARET BRENNAN: Good to see you in person.",
    "So if we can do those things, let's do them.",
    "MARGARET BRENNAN: Holly Williams, thank you.",
    "MARGARET BRENNAN: We'll be back in a moment.",
    "Now some post administrate... post-invasion.",
    "MARKAROVA: We are not downplaying the risk.",
    "Why is your president downplaying the risk?",
    "I fear he may not be allowed to do the job.",
    "HOUSE MAJORITY WHIP JIM CLYBURN: Thank you.",
    "So be careful what you wish for, my friend.",
    "MARGARET BRENNAN: Well, strong words there.",
    "Does this start to move us back to normal?",
    "MOLA LENGHI: Well, good morning, Margaret.",
    "Now a lot of people told him not to do it.",
    "Do you think the DNC needs new leadership?",
    "AMBASSADOR OKSANA MARKAROVA: Good morning.",
    "So we have to be prepared for all options.",
    "MARK STRASSMANN: The school board agreed.",
    "I want sanctions on Putin's behavior now.",
    "It will change the relationship forever.",
    "Masking is optional starting next month.",
    "What is the US assessment at this point?",
    "What are you asking the White House for?",
    "I'm not-\nMARGARET BRENNAN: By March 1st?",
    "So Jamie Harrison is just what we need.",
    "And just let me finish my thought here.",
    "But we also have to prepare, as I said.",
    "I mean, this is a drag for the country.",
    "It's all just ahead on Face the Nation.",
    "MARGARET BRENNAN: I'm Margaret Brennan.",
    "That's not the way to resolve disputes.",
    "SEN. GRAHAM: My Russian friends- Yeah.",
    "More against Russia, more for Ukraine.",
    "Let's see how she does at the hearing.",
    "It recommended toddlers remain masked.",
    "DR. GOTTLIEB: You should be protected.",
    "That's what our NATO allies are doing.",
    "Again, we just cannot afford to panic.",
    "So we know and we see what's going on.",
    "So again, here's, here's where we are.",
    "So we have to be ready for that, too.",
    "SENATOR LINDSEY GRAHAM: Good morning.",
    "Does a cyberattack trigger sanctions?",
    "So what exactly are you pushing for?",
    "MARGARET BRENNAN: You know, exactly.",
    "MARKAROVA: and we really value this.",
    "So we're preparing for any options.",
    "What exactly are you preparing for?",
    "Holly Williams is near Donbas (Sp?",
    "Will the president veto this bill?",
    "But he needs to be sanctioned now.",
    "SEN. GRAHAM: will give you a pass.",
    "She has wide support in our state.",
    "You said best case would be March.",
    "It appears to be more contagious.",
    "MARK STRASSMANN: A wintry sorrow.",
    "I mean, what would the impact be?",
    "SEN. GRAHAM: Kamala Harris- Yeah.",
    "Well, I think it's inappropriate.",
    "SEN. GRAHAM: Yeah give me a call.",
    "Russia illegally occupied Crimea.",
    "Good morning to you, ambassador.",
    "MARKAROVA: There is no friction.",
    "Good morning to you, Ambassador.",
    "Good morning to you Congressmen.",
    "SEN. GRAHAM: on January the 6th.",
    "There's some critical questions.",
    "Does it evade our immune system?",
    "She's been a workers comp judge.",
    "That should be outlawed in 2022.",
    "I know you're part of the talks.",
    "How concerned do we need to be?",
    "For instance, child tax credit.",
    "And so Jamie Harrison is there.",
    "MARGARET BRENNAN: By March 1st?",
    "DR. SCOTT GOTTLIEB: Thank you.",
    "They want to show up for work.",
    "I know you want sanctions now.",
    "SEN. GRAHAM: by every measure.",
    "This is 2022, for God's sake.",
    "Good morning to you, Senator.",
    "It's been very disappointing.",
    "HOLLY WILLIAMS: Good morning.",
    "And that's what this will do.",
    "He can choose to de-escalate.",
    "So strong political messages.",
    "MARGARET BRENNAN: Understood.",
    "MARGARET BRENNAN: All right.",
    "So that's the means test it.",
    "REP. CLYBURN: I hope we can.",
    "), close to the front lines.",
    "He knows what it is to lose.",
    "How concerned should you be?",
    "That is dedication, doctor.",
    "DR. GOTTLIEB: Thanks a lot.",
    "Are you sticking with that?",
    "He knows what it is to run.",
    "And they're not fooling us.",
    "What does he mean by that?",
    "(LAUGHTER) It can be done.",
    "I didn't like that either.",
    "So he's talking about you.",
    "MARGARET BRENNAN: Pardons?",
    "It's 2022, for God's sake.",
    "He hates democracy- Putin.",
    "We can't fully explain it.",
    "Look what Putin has done.",
    "She is an awesome person.",
    "So why is this different?",
    "We go back all this week.",
    "OK. Well, I advised that.",
    "Thank you for being here.",
    "You can do it next week.",
    "REP. CLYBURN: I'm sorry?",
    "MARGARET BRENNAN: Right.",
    "She is highly qualified.",
    "Mark Strassmann reports.",
    "She's highly qualified.",
    "She's a good character.",
    "MARGARET BRENNAN: Yeah.",
    "MARGARET BRENNAN: Okay.",
    "REP. CLYBURN - 0f 2020.",
    "REP. CLYBURN: I do not.",
    "MARKAROVA: We ask both.",
    "Thank you for watching.",
    "We go back on Tuesday.",
    "He has his detractors.",
    "SEN. GRAHAM: It is 20.",
    "I don't think it does.",
    "Is it more contagious?",
    "DR. GOTTLIEB: Exactly.",
    "Is it more dangerous?",
    "What needs to be hit?",
    "But it's one of many.",
    "We have to get ready.",
    "Good to be with you.",
    "You're close to him.",
    "We'll be right back.",
    "What is Putin doing?",
    "SEN. GRAHAM: More.",
    "You're a yes vote?",
    "He will never run.",
    "So we monitor it.",
    "Russia is there.",
    "You're a mentor.",
    "So stay with us.",
    "Good to see you.",
    "What is he done?",
    "Is this prudent?",
    "Is that right?",
    "We assess it.",
    "Good morning.",
    "Good morning.",
    "Do you agree?",
    "I have mine.",
    "It's Russia.",
    "Thank you.",
    "Margaret.",
    "Right?",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB.",
    "AMB."
  ]
}