{
  "id": 703,
  "mediaId": 2727,
  "date": "2022-04-22",
  "headline": "Disappointment: Queens U Faculty Rejects IHRA",
  "image": "https://static.timesofisrael.com/blogs/uploads/2018/09/Israeli-flags.jpg",
  "link": "https://blogs.timesofisrael.com/disappointment-queens-u-faculty-rejects-ihra/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Avi Benlolo",
  "authorUrl": "https://blogs.timesofisrael.com/author/avi-benlolo/",
  "termIds": [
    1469,
    1647,
    1945,
    2990,
    1103,
    4890,
    5041,
    5370
  ],
  "sentences": [
    "The Jewish community cannot carry this burden alone.”\nOn the heels of NDP’s “town hall to talk about ways to fight against hate” that was held yesterday in Burnaby, we asked the organizers if Antisemitism was specifically addressed, when and if it emerges within political parties.",
    "In contrast to Canadian universities that have flat-out rejected adopting the definition — thus making Jewish students vulnerable — in the UK, 216 universities, colleges, and other higher education providers have signed on to the IHRA in support of Jewish students.",
    "About the Author\nAvi Abraham Benlolo is the Founder and Chairman of The Abraham Global Peace Initiative (AGPI) He has been described as the nation's most prominent and noted expert in Holocaust studies, in countering Antisemitism and promoting human rights.",
    "Just last week, former Canadian Cabinet Ministers Peter MacKay, John Baird, Stockwell Day, and many other prominent Canadians and world leaders joined me in calling on US President Joe Biden not to delist Iran’s IRGC from the terror-designated list.",
    "We asked if the party specifically denounces Antisemitic campaigns such as BDS and most significantly, given the rise of Antisemitism, we asked what the NDP can do to address systemic Antisemitism – other than banning Swastikas and Nazi emblems.",
    "In Wisconsin-Madison University, the student government unanimously passed a resolution condemning Antisemitism while AGPI wrote a letter to UBC’s President Santa J. Ono commending him on rejecting demands that his university endorse BDS.",
    "Disappointingly, Arab media fueled anger against Israel, while Israel’s friends in the region issued condemnations, without recognizing that Israel was maintaining the safety and security of the area for all parishioners.",
    "In a breaking development, we are disappointed – but hardly surprised — by Queens University’s faculty for voting to oppose the International Holocaust Remembrance Alliance (IHRA) working definition of Antisemitism.",
    "Have the twenty years of anti-Israel campaigning and propaganda events such as the infamous “Israeli Apartheid Week” and BDS radicalized its faculty to an extent whereby it has become blinded to Antisemitism?",
    "To keep the Old City safe for people of all faiths to come and pray, Israeli police were forced to quell a minority of Palestinians who initiated violence by throwing rocks and firecrackers at worshippers.",
    "Similarly, this week, a German intelligence report noted the “normalization” of Antisemitism in that country and citing that the known cases of Antisemitism are only the tip of the iceberg in that country.",
    "In Ohio, Governor Mike DeWine signed an executive order that sets a clear definition for Antisemitic acts and ordered state agencies, departments, boards, public colleges, and universities to adhere to it.",
    "We are disappointed that 60% of voting faculty rejected adopting the IHRA definition – representing a failure in recognition of the urgent crisis experienced by Jewish students on university campuses.",
    "In other breaking news this week, we issued a stern letter to Ontario’s Premier Doug Ford and Toronto’s Mayor John Tory asking them to take action against the now infamous “Al Quds Day” march of hate.",
    "Beverley Hills Mayor Lili Bosse acknowledged AGPI’s condemnation of Antisemitic flyers distributed over Pesach, while in Florida, similar pro-Hitler flyers were also distributed to Jewish homes.",
    "Internationally, we have expressed concern over a reported 35% rise in Antisemitism in Australia, recognizing that in nearly every nation around the world, this pernicious hatred has increased.",
    "We further expressed outrage about consumer products that use Holocaust imagery after it became known that one seller was distributing “Schindler’s List” leggings on social media – OY!",
    "We stand with more than 1,600 Jewish students and Hillel Kingston who stood up to the Queens University Faculty Association to advocate for the adoption of the definition.",
    "Al Quds Day was invented by the Iranian regime as a way to incite hatred and violence – and it is time for all Canadians to recognize that this is a threat to us all.",
    "Naturally, a closed-door Security Council meeting was speedily arranged to condemn Israel (interesting to note how quickly the UN turns the focus on Israel).",
    "On January 8th, 2020, the IRGC allegedly shot down Ukrainian International Airlines killing 167 people on board, including 55 Canadian citizens.",
    "Given the fact that Canadian academia is rooted in a British and European framework, we ponder just what is wrong with Canadian universities?",
    "Exposing Iran’s damaging influence, we called on Canadians to “pay closer attention to foreign-driven threats to peace upon our soil.",
    "We welcomed the arrest of a New Jersey man who went on a spree of violent assaults against the Orthodox Jewish community.",
    "Hamas once again initiated a rocket attack against Israel – attempting to ignite a regional war and internal strife.",
    "This week, we also stood with Israel against the international media misrepresentation concerning the Temple Mount.",
    "In Tennessee, lawmakers this week passed a bill prohibiting schools from teaching “Antisemitic ideas”.",
    "In other words, Iranian-backed support on our streets should be a concern to every single Canadian.",
    "Hundreds of people have already signed onto our petition to condemn this annual festival of hate.",
    "Finally, we welcomed Arizona’s adoption of the IHRA working definition of Antisemitism.",
    "Antisemitism today needs to be fought institutionally, rather than symbolically.",
    "In today’s National Post, we called for less condemnation and more action.",
    "“Canadians know Iran’s terrorism well.",
    "There are rays of hope however.",
    ".",
    "."
  ]
}