{
  "id": 7041,
  "mediaId": 2921,
  "date": "2022-01-12",
  "headline": "Planned Parenthood, ACLU attempt to block Ohio law requiring burial of aborted babies' remains",
  "image": "https://cdn.christianpost.com/files/original/thumbnail/24/64/246443.jpg",
  "link": "https://www.christianpost.com/news/planned-parenthood-aclu-attempt-to-block-ohio-fetal-burial-law.html",
  "mediaOutlet": "Christian Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Gryboski",
  "authorUrl": "https://www.christianpost.com/by/michael-gryboski",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine signed the Unborn Child Dignity Act into law, which mandates “final disposition of fetal remains from a surgical abortion at an abortion facility [to] be by cremation or interment.”\nOther provisions included requiring abortion facilities to “document in the pregnant woman’s medical record the final disposition determination made” and “maintain evidentiary documentation demonstrating the date and method of the disposition of fetal remains from surgical abortions performed or induced in the facility.” Anyone failing to comply with the provisions of the law “is guilty of failure to dispose of fetal remains humanely, a misdemeanor of the first degree.”",
    "Judicial relief is critical to ensure patients are able to exercise their constitutionally protected right to obtain essential health care and determine the course of their own lives.”\nMark Harrington, president of the pro-life group Created Equal, said in a statement emailed to supporters that he believed the “courts ought to uphold this law and the dignity of human life.”\n“Laws requiring aborted babies to receive a dignified final disposition in some ways pose a bigger threat than many abortion bans do,” stated Harrington.",
    "Freda Levenson, legal director for the ACLU of Ohio, said in a statement released Friday that she believed the law would have “a devastating impact on the ability of patients to have autonomy over their own lives.”\n“The effect of the law will be to delay procedural abortions, forcing patients to carry an unwanted pregnancy for weeks or months and then to undergo riskier and more expensive procedures,” stated Levenson.",
    "The second injunction request comes after the plaintiffs received a temporary injunction against the law last April; at present, the clinics have until next month to comply with the law.",
    "The American Civil Liberties Union has filed a new complaint against Ohio over a state law that, among other things, requires the proper cremation or burial of aborted babies’ remains.",
    "Last Friday, the national ACLU, its Ohio chapter, and Planned Parenthood filed for a second preliminary injunction against the law on behalf of five abortion clinics in the state.",
    "“Finally, the law imposes a funeral ritual on every patient, regardless of their own religious and spiritual beliefs.",
    "That is why the abortion industry is fighting so hard to challenge this law.”\nIn late December 2020, Ohio Gov.",
    "“Because abortionists are the dregs of medicine, they will be unable to comply with these new regulations."
  ]
}