{
  "id": 7188,
  "mediaId": 2819,
  "date": "2022-01-20",
  "headline": "Exclusive: Intel Reveals Plans for Massive New Ohio Factory, Fighting the Chip Shortage Stateside",
  "image": "https://api.time.com/wp-content/uploads/2022/01/renderopener_final.jpg?quality=85",
  "link": "https://time.com/6140476/intel-building-factory-ohio/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alana Semuels",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Supply chain bottlenecks have motivated big companies to start increasing capacity in the U.S.; Intel itself said last year it would spend $20 billion to build two major factories in Arizona, and in 2020, the global leader in chip manufacturing Taiwan Semiconductor Manufacturing Co. (TSMC), said it would spend $12 billion to build a semiconductor factory, also in Arizona.",
    "Gelsinger has met with various leaders in Washington including the bipartisan Problem Solvers’ Caucus in Congress and the New Democrat Coalition to emphasize the need for bringing more semiconductor manufacturing capability to the U.S. “My first meeting with the Undersecretary of Defense basically scolded her,” he said.",
    "These are the kinds of the manufacturing jobs that are part of the modern economy.”\n\nAnd the past and future of manufacturing in the state is already inextricably tied up in the semiconductor supply chain; last year, Ford cut the production schedule at its Ohio Assembly Plant because of chip shortages.",
    "Although another location offered bigger incentives, Intel chose Ohio because it seemed like the best fit, he said; the company did not want to displace any residents, an increasingly important factor for companies since pushback against a proposed Amazon headquarters in New York City killed the deal.",
    "In August of 2020, Ohio State named a new president, Kristina M. Johnson, who received bachelor’s, master’s, and doctoral degrees in engineering from Stanford University and who established partnerships with tech companies like IBM while the head of the State University of New York.",
    "Semiconductor manufacturing has grown at a much slower rate in the U.S. than in other places around the world, particularly East Asia, in part because it costs 30% more to build and operate a fab over 10 years than it does in Taiwan, South Korea, or Singapore, according to the SIA.",
    "“I said, Why am I explaining why this is so important to Congress, and you’re not?’”\n\nWhy the U.S. needs chip manufacturing\n\nThe supply chain bottlenecks of the past two years are part of the reason there’s such urgency to create more chip manufacturing capability in the U.S.",
    "As part of an effort to regain its position as a leading maker of semiconductors amidst a global chip shortage, Intel is committing $20 billion to build a manufacturing mega-site in New Albany, on the outskirts of Columbus, Ohio, the company exclusively confirmed to TIME.",
    "Courtesy of Intel\n\nCEO Gelsinger, who took the reins of the company almost a year ago, has launched a strategy he calls IDM 2.0 in which Intel will continue to make its own chips, but also establish Intel Foundry Services, which will make chips for other companies.",
    "Ohio State is in the process of building an Innovation District to establish a health and sciences research space near its West Campus and recently hired a female robotics professor from the Georgia Institute of Technology to be dean of the College of Engineering.",
    "In advance of the Intel factory and other deals, the Ohio General Assembly also expanded its tax incentives, allowing mega projects with more than $1 billion in investment to benefit from job creation tax credits for up to 30 years, rather than the previous 15.",
    "“A lot of people have an impression that this is a clean industry—but the chemicals they are using are incredibly dangerous,” said Dennis O’Mara, a member of the Community Environmental Working Group, which advocates for improvements at the New Mexico facility.",
    "Partly because of enormous incentives offered by other countries to jumpstart semiconductor manufacturing on their shores, the share of chips made in the U.S. has fallen to 12%, from 37% in 1990, according to the Semiconductor Industry Association(SIA).",
    "Analysts attribute this delay to Intel’s structure; as other leading-edge companies focused on either designing chips and sending them elsewhere to be manufactured, or manufacturing chips for other customers, Intel has continued to try and do both.",
    "What the factory means for Ohio\n\nIntel’s choice of New Albany for its new facility is a vote of confidence in the Midwest as a manufacturing hub after years of factories decamping from Ohio, Michigan, and Indiana to the U.S. South and overseas.",
    "Locating a factory in the political battleground of Ohio could help the legislation gain even more support; on Jan. 14, GOP members of the Ohio congressional delegation asked Congress to fully fund the $52 billion CHIPS for America Act.",
    "The chip maker says it will build at least two semiconductor fabrication plants, or fabs, on the 1,000-acre site, where Intel will research, develop, and manufacture its most cutting-edge computer chips, employing at least 3,000 people.",
    "(Zillow estimates the typical New Albany home is worth $516,752, about one-third the value of homes in Intel’s home base of Santa Clara, Calif.) The pandemic has hastened a move from urban locations to suburban places with more space.",
    "He says that because Intel is categorized as a “minor” source of emissions, creating less than 100 tons per year of pollutants, the company is allowed to hire its own monitoring companies who are not verified by an independent party.",
    "When asked: will today’s New Albany residents recognize their small-town in what he sees for the future, Gelsinger replied: “New Albany today versus the high-tech mega manufacturing center of the heartland in five years?” he said.",
    "The company said it will spend $100 million over the next 10 years to establish the Intel Ohio Semiconductor Center for Innovation, a partnership with universities and community colleges to build semiconductor-specific curricula.",
    "Transforming a suburban town\n\nThe Intel project, the first leading-edge semiconductor fab in the Midwest, will accelerate the transformation of a sleepy rural area outside of Columbus into a diverse city full of tech workers.",
    "That makes analysts like Arya wonder who Intel’s customers will be as it expands its U.S. fabs, and how it plans to catch up to the technological prowess of TSMC when it is still focusing on both design and manufacturing.",
    "Intel considered 38 different sites “in every major state you can imagine” before choosing New Albany in December, Keyvan Esfarjani, Intel’s senior vice president of manufacturing, supply chains and operations told TIME.",
    "In short, he said, he hopes the tiny town today will soon become the hub of a global manufacturing hotspot more advanced than anything anywhere else, attracting the economic activity that high-tech facilities often do.",
    "Read More: Senate Overwhelmingly Passes $250 Billion Tech Investment Bill Aimed at Countering China\n\nNeighbors of Intel chip factories in other states have raised questions about the environmental impact of fabs, too.",
    "The pandemic has helped the state sell its low cost of living and suburban lifestyle, which is coming back into vogue after an era in which tech companies and their employees wanted to be in expensive, coastal cities.",
    "“Our expectation is that this becomes the largest silicon manufacturing location on the planet,” Intel CEO Pat Gelsinger told TIME; the company has the option to eventually expand to 2,000 acres and up to eight fabs.",
    "Intel has attracted suppliers and partners who have also set up in Chandler, and the influx of high-income residents has led to a bloom of restaurants, shopping, and tax revenue, said Chandler mayor Kevin Hartke.",
    "“It’s like trying to get back to being an Olympic level athlete—it doesn’t happen overnight.”\n\nIntel said that subsidies from the U.S. government will help it build more quickly and overtake overseas competitors.",
    "Making semiconductor chips is a completely different type of work than making cars; much of the work is done by engineers in “bunny suits”—protective clothing that ensures that no dust gets into the microchips.",
    "Unable to get the chips used in manufacturing cars, U.S. automakers such as General Motors idled some North American plants last year and resorted to manufacturing some cars without features that require chips.",
    "Three-quarters of the world’s semiconductor manufacturing capability is within the flight path of the Chinese Air Force, Hutcheson said, which could be problematic in an era of growing geopolitical tensions.",
    "He helped create a group, Clean Air for All Now, to advocate for stricter permitting requirements; a Change.org petition requesting that New Mexico require a change to Intel’s air permits has 199 signatures.",
    "Much of New Albany today consists of a master-planned community created in the 1990s by Les Wexner, the founder of L Brands—best known for subsidiaries like Victoria Secret—and Ohio developer Jack Kessler.",
    "Intel Corporation—Intel Corporation\n\nThere is some potential for some pushback from New Albany residents who are already worried that development is fundamentally changing the nature of where they live.",
    "Intel has joined with other leading semiconductor companies, including competitors AMD, Inc., NVIDIA, and GlobalFoundries, to lobby President Biden to fund semiconductor research and manufacturing.",
    "Chips cross borders dozens of times before they make their way to consumers in phones, computers, and cars, said Dan Hutcheson, vice chair at TechInsights, which follows the semiconductor industry.",
    "Intel said that it has a good neighbor policy that minimizes the impact of its operations on surrounding communities, and that it meets all applicable regulatory and environmental requirements.",
    "Locating a chip factory in the United States doesn’t necessarily insure against further supply chain disruptions; Intel’s chips will still be sent to Asia for assembly, packaging, and testing.",
    "“It’s going to be unrecognizable”\n\nWhen Intel started manufacturing in Arizona around 1980, Chandler, its hub, was a farm town known for citrus and cotton, with a population of around 24,000.",
    "The sand used to make semiconductors comes from the U.S. South, after all, so it’s not inconceivable that the process of making some chips, from start to finish, could happen domestically.",
    "Intel could bring some packaging, assembly, and testing back to the United States if the CHIPS for America Act is funded, Gelsinger said, which would be beneficial for national security.",
    "The New Albany site will be constructed with green building principles, and the company hopes to power the new factories with 100% renewable energy and achieve net positive water use.",
    "The choice of New Albany is a bet that after nearly two years of a global pandemic, Intel’s employees will embrace a suburban environment with reasonable home prices and good schools.",
    "“There were states where we were going to go, where we got a sense that people were not going to be happy, so we ruled them out,” he said, though he would not specify which states.",
    "Intel’s announcement is the largest private-sector investment in Ohio history and a bright spot in what has been a dismal few decades for manufacturing in Ohio and the Midwest.",
    "Intel makes the lion’s share of chips used in PCs, but analysts say that PC sales are at a cyclical peak, and that competitors like AMD are wrestling market share from Intel.",
    "It anticipates that increased demand from the automotive industry and from its newly-formed high performance computing business unit will provide more than enough demand.",
    "Read More: Apple Set to Cut iPhone Production Goals Due to Chip Crunch\n\nOf course, some of the urgency of having more chip manufacturers in the U.S. is purely political.",
    "But now, with increasing automation in chip factories and potential government funding, Intel is able to reshore some of this manufacturing and still be cost-effective.",
    "There are 34% fewer manufacturing jobs in Ohio now than there were in 1991; the closure of plants like General Motors’ Lordstown Complex have left whole towns reeling.",
    "That’s made it more difficult for U.S. consumers to buy cars, driving the price of used cars up 24% over the course of a year, and slowing national economic growth.",
    "Though Intel was once at the forefront of semiconductor manufacturing, it has fallen behind in recent years after delays on its 14 nanometer and 10 nanometer chips.",
    "Gelsinger argued that Intel is already catching up, with plans to accelerate the development of new technologies so that it can regain industry leadership by 2025.",
    "He consults with small businesses who are seeing costs go up locally but who aren’t offered the same tax incentives as the multinational tech companies, he said.",
    "He wants the New Albany site to be a place where every Ohio State graduate will want to work, but also a place that will attract PhDs and talent from all over.",
    "New Albany today features white picket fences, Georgian architecture, and walking trails: Drive through and you might mistake it for a Virginia horse farm.",
    "Since there are subsidies for the taking, now is the time to build semiconductor fabs in the U.S., said Stacy Rasgon, senior analyst at Bernstein Research.",
    "The state agreed to invest $1 billion in infrastructure improvements, including widening State Route 161, to support the factory and the nearby community.",
    "As booming demand and supply chain woes led to semiconductor shortages over the past year, entire U.S. industries like auto manufacturing were crippled.",
    "But as automation drives efficiency in factories, creating technical, rather than assembly-line jobs, Ohio is trying to mount a manufacturing comeback.",
    "In the summer, O’Mara and his wife have been overwhelmed by a smell like burnt coffee; once, recently, his wife had difficulty breathing in the fumes.",
    "The amount of available land in Ohio, in addition to a favorable regulatory environment, were factors in making the decision, Esfarjani told TIME.",
    "“Two years ago, there were cows, now there are houses,” said Andre Vatke, who has lived in New Albany since 1986, about the area around his home.",
    "“It’s a place where a new college grad can come with a husband, or wife, or significant other, a kid, and they can build a life,” Esfarjani said.",
    "“Because of how important Intel is to the state’s economy, the 73,000 of us living near this plant have to shoulder the entire risk,” he said.",
    "Read More: Inside the Taiwan Firm That Makes the World’s Tech Run\n\nWhat’s more, analysts say, long-term trends continue to disadvantage Intel.",
    "The two wanted to create the type of town that was attractive to companies while still offering an idyllic country lifestyle for residents.",
    "Last year, semiconductor industry sales grew 25% while Intel’s sales grew 1%, said Vivek Arya, semiconductor analyst at Bank of America.",
    "Last year, Intel said it would spend $3.5 billion to enable the New Mexico plant to make advanced semiconductor packaging technologies.",
    "In Arizona, residents are also concerned about the amount of water fabs use—millions of gallons a day—in their drought-stricken state.",
    "In recent years, companies like Google, Facebook, and Amazon have established data centers in New Albany, a city of 12,000 residents.",
    "So much chip manufacturing ended up in Asia because of the low cost of labor there, in addition to the incentives offered, he said.",
    "The CHIPS for America Act, passed last year, authorized federal investments in chip manufacturing, but it did not provide funding.",
    "Maddie McGarvey—Bloomberg/Getty Images\n\nThe announcement comes amidst a push to increase domestic manufacturing of semiconductors.",
    "Vatke has publicly objected to the tax abatements given to big tech data centers because the projects don’t create a lot of jobs.",
    "Then It Moved Its Workforce Overseas\n\nGelsinger has spoken of a new mega-fab as “a little city,” which requires a lot of space.",
    "Inside Intel’s comeback strategy\n\nThis new facility is part of Intel’s plan to catch up with industry leaders TSMC and Samsung.",
    "To create a more reliable supply of chips, the federal government is weighing providing incentives for chip makers in the U.S.",
    "“Now we’re going to do the Silicon Heartland.”\n\nA town sign is displayed in New Albany, Ohio, U.S., on Monday, May 6, 2019.",
    "And in Corrales, New Mexico, where Intel has had a factory for decades, residents have complained about air quality issues.",
    "Intel’s Arizona factory, Fab 42, became fully operational in 2020 on the company’s Ocotillo campus in Chandler, Arizona.",
    "Places where potential problems around protected species or land ownership might cause problems were taken off the list.",
    "Mike DeWine learned that Intel had selected New Albany as the location for its manufacturing mega-site on Christmas Day.",
    "They say that Intel’s previous attempts to be a foundry have failed, and that it’s fallen too far behind to catch up.",
    "But each time it’s done so, the new site has become a magnet for suppliers and talent from around the globe, he said.",
    "Warren Dillaway—The Star-Beacon/AP\n\nThe changing nature of manufacturing has helped the state attract new factories.",
    "Intel was also drawn to Ohio because of the availability of talent to draw on from local colleges and universities.",
    "When he moved in, New Albany was essentially a farm town; now it’s known as one of the wealthiest towns in Ohio.",
    "Last year, companies including Peloton, First Solar, and Amgen announced plans to establish factories in Ohio.",
    "Big employers like General Motors laid off thousands as factory jobs relocated to the U.S. South and overseas.",
    "Companies like Apple and Microsoft have begun to replace Intel processors with chips they design themselves.",
    "Gelsinger anticipates that New Albany could undergo a similar transition as Intel builds up its presence.",
    "Today, Chandler has around 280,000 residents, nearly a quarter of whom work in high-tech industries.",
    "Read More: From Cars to Toasters, America’s Semiconductor Shortage Is Wreaking Havoc on Our Lives.",
    "Construction will begin this year and the plant should be operational by 2025, the company said.",
    "The Senate passed $52 billion in funding in June, but the House has not passed the legislation.",
    "Over the last two years, 60% of Intel’s external hires have had a bachelor’s degree or higher.",
    "“We want to make sure that where we go, the community is going to be happy,” Esfarjani said.",
    "Ohio State University, with its 10,000 person College of Engineering, will be one partner.",
    "Subsidies for U.S. manufacturing have bipartisan support, especially in the tech industry.",
    "Ohio also seemed willing to move quickly to approve permits and plans, Esfarjani said.",
    "Mike DeWine told TIME, wearing a hooded sweatshirt and sitting by his home fireplace.",
    "“It’s a lot more enjoyable kind of manufacturing—clean, tech-oriented, higher-paying.",
    "“My objective would be sand to product to services, all on American soil,” he said.",
    "The city’s average household income of $114,000 is 32% higher than that of Arizona.",
    "And Intel doesn’t make chips for the biggest semiconductor market: smartphones.",
    "“This is not an industry where you just wake up and catch up, “ he said.",
    "The Ohio site will host Intel Foundry Services and make chips for Intel.",
    "1 suburb in 2015 because of the quality of its schools and public parks.",
    "DeWine said the state learned that it had won the site on Christmas Day.",
    "“Yea, it’s going to be unrecognizable.”\n\nContact us at letters@time.com.",
    "“It used to be assembly line work, now it’s tech work,” Ohio Lt. Gov.",
    "But some companies have started to move back to Ohio from the coasts.",
    "Intel hasn’t built a new site from scratch for several decades.",
    "Wall Street analysts are skeptical of Gelsinger’s strategy.",
    "A rendering of Intel's planned factory in New Albany, Ohio.",
    "Intel is the city’s biggest employer, with 12,000 workers.",
    "Samsung is investing $17 billion in a chip plant in Texas.",
    "Read More: U.S. Taxpayers Bankrolled General Electric.",
    "“We helped to establish the Silicon Valley,” he said.",
    "This is our time in history,” Ohio Gov.",
    "Insider named the town America’s No.",
    "“I truly believe this is our time.",
    "Jon Husted told TIME.",
    "Can We Fix It?",
    "Ohio Gov."
  ]
}