{
  "id": 7193,
  "mediaId": 5122,
  "date": "2022-01-30",
  "headline": "Parents, Students are Taking Universities to Court over COVID Vaccine Mandates",
  "image": "https://www.activistpost.com/wp-content/uploads/2022/01/vax-suits-cr.jpg",
  "link": "https://www.activistpost.com/2022/01/parents-students-are-taking-universities-to-court-over-covid-vaccine-mandates.html",
  "mediaOutlet": "activistpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "2905.12 on account that the mandate “coerces Plaintiffs from taking or refraining from actions over which they should have legal freedom of choice, by taking, withholding, or threatening to take or withhold official action.”\n\nThe suit also proposes that the mandate is in violation of Article I, Section I of the Ohio State Constitution as it “violates Plaintiffs’ right to refuse medical treatment.”\n\nFurthermore, action has been taken against Ohio University for similar vaccination requirements that went into effect on Aug. 31.",
    "“The University’s goal remains doing its part to ensure the health and safety of our community, and BGSU has no further comment regarding this litigation at this time.”\n\nAll texts include a statement declaring a “lack of authority” of the universities to “order public health or preventative health measures.” Such measures extend to vaccination mandates, masking, and testing for individuals who have not contracted the virus.",
    "However, after contacting the Ohio Department of Health about where to locate the vaccine in Ohio, he said that the department “can’t answer because it’s too political.”\n\nSaveOhioU, a student-led organization intended on reversing COVID-19 restrictions at the school, publicized the concern, as well, writing in an Instagram post, “Quick Fact: There is no FDA approved Covid vaccine available in America.",
    "Plaintiff and Ohio University student Tyce Patt spoke out against the university’s COVID-19 policies to Campus Reform, noting they are “changing faster than any student can keep up with.”\n\nPatt, who was previously elected to the student senate before resigning, noted the dismay of students who opposed the university mandates.",
    "The lawsuits are backed and financially funded by a freedom-centered organization titled “Ohio Stands Up!,” which has frequently opposed the implementation of vaccine mandates and has regularly tracked and supported litigation aimed at reversing such policies.",
    "“Brand names change all the time.”\n\nMendenhall remains firm in his argument, however, stating that the mandates still violate state law as the requirements regarding vaccination, masking, and testing apply to individuals who have not contracted COVID-19.",
    "[RELATED: EXCLUSIVE: ‘He is hungry, isolated, cold’: Parent of Ohio U student sounds alarm on quarantine dorm experience]\n\n“We made a very extreme effort to [produce] Comirnaty,” Mendenhall stated, referring to the vaccine’s brand name.",
    "Sharona Hoffman, a professor at Case Western Reserve University who specializes in pharmaceutical law, bioethics and employment discrimination, challenged the firm’s argument by claiming the Pfizer vaccines approval stamped by the FDA.",
    "“The University believes its actions addressing community health concerns brought on by the pandemic are necessary, scientifically supported, and legally valid,” Jim Sabin, Ohio University media relations manager, told Campus Reform.",
    "“We are united in our common goal to stand against continued violations of our Constitutional freedoms, while working to restore those freedoms from which we have been deprived,” the organization’s mission statement reads.",
    "“They announced that the vaccinated now had to get tested weekly, because part of our lawsuit was discrimination.”\n\n[RELATED: University withdraws employee ‘vaccine and testing requirements’ after SCOTUS ruling.",
    "The firm argues that policies regarding vaccination, masking, and testing at Ohio University, University of Cincinnati, Bowling Green State University, and Miami University of Ohio are in violation of state law.",
    "“The problem is the people that are forcing people to wear masks or not.”\n\nAn additional lawsuit was presented against Bowling Green State University (BGSU) for vaccination mandates that took effect on Sept. 3.",
    "They’re out of control.”\n\nThe policy requiring solely unvaccinated students to undergo weekly testing has since been reversed, and according to Noble, stems from the pressure applied from the lawsuit.",
    "Mandating Emergency Use Authorized vaccines is ILLEGAL.”\n\nVaccine mandates were the focus of the Ohio legislature last year, as Governor Mike DeWine signed H.B 244 on July 14.",
    "Repercussions for failing to comply with the mandate may result in “suspension or expulsion.”\n\nThat lawsuit is on behalf of 15 Ohio University students and 1 faculty member.",
    "Mendenhall Law Group, a firm based out of Akron, Ohio, has filed a series of lawsuits taking aim against COVID-19 policies in effect at four universities across the state.",
    "Whether or not the lawsuits will be successful is questionable, however, as the language used in the suits has been accused of not reflecting changes to vaccine approval.",
    "Speaking with Campus Reform, she discussed her son’s unusual college experience as he navigates his undergraduate degree online, as many other students are forced to do.",
    "They accuse the state-funded university of enacting discriminatory policies by allowing or disallowing students to participate in activities based on vaccination status.",
    "Breaking down the COVID-19 policies of Ohio University, Noble said the final straw was when the school mandated non-vaccinated students comply with weekly testing.",
    "Warner Mendenhall, the firm’s principal, told Campus Reform that he is proud of those who have stepped up to tackle concerns over university COVID-19 policies.",
    "The University of Cincinnati lawsuit represents four student plaintiffs and challenges the university’s vaccination policy that took effect on Sept. 1.",
    "“Recognizing the effectiveness of vaccines, BGSU offered a balanced vaccination and exemption program for all students, faculty and staff,” Solis said.",
    "“Students that I represented as my constituents would come to me, and they would express all sorts of terrible things that were happening,” Patt said.",
    "Molly Noble, a parent of one of the Ohio University plaintiffs, vocalized the concerns and frustrations that sparked her to pursue legal action.",
    "Miami University of Ohio had its lawsuit, which was dismissed on Dec. 6 by the Butler County Common Pleas Court, and is currently under appeal.",
    "By Alexa Schwerha\n\nMendenhall Law Group is suing four universities in Ohio over those institutions’ vaccine and COVID-19 testing requirements.",
    "The plaintiffs argue that requiring students, faculty, and staff to get the vaccine or weekly COVID-19 testing is a violation of R.C.",
    "“Everybody is starting to realize that the problem isn’t the people that are wearing a mask or aren’t wearing a mask,” Patt noted.",
    "Or support us at SubscribeStar\n\nDonate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news.",
    "As Campus Reform reported last month, Nevada recently overturned a state-wide COVID-19 mandate for college students.",
    "The legislation prevents public institutions from mandating the COVID-19 vaccine until FDA approval was received.",
    "Now a junior, he has only taken one in-person course during his undergraduate experience, according to Noble.",
    "“I think that they’re a little concerned right now with what’s going on with our lawsuit,” Noble said.",
    "Campus Reform has contacted all involved Universities, Ohio Stands Up!, and SaveOhioU for comment.",
    "Deputy Chief of Staff and BGSU spokesperson Alex Solis provided Campus Reform with a statement.",
    "Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, What Really Happened and GETTR.",
    "The lawsuits join growing nationwide opposition to vaccine mandates for returning students.",
    "“Pfizer was approved, so that’s not a valid argument,” Hoffman told The Columbus Dispatch.",
    "Students have continued to ask Patt how they can get involved in supporting the lawsuit.",
    "The lawsuits were filed on behalf of affected students, employees, and parents.",
    "“It’s my privilege to represent people who want to do something,” he stated.",
    "Campus Reform spoke with parents and students represented in the suits.",
    "The suit was presented to the Court of Common Pleas in Hamilton County.",
    "Additionally, the lawsuit cites an alleged violation of R.C.",
    "It represents three students and one faculty member.",
    "The remaining three cases are awaiting court dates.",
    "Provide, Protect and Profit from what’s coming!",
    "He had a great first semester,” she explained.",
    "Get a free issue of Counter Markets today.",
    "This article will be updated accordingly.",
    "My son started as a freshman in 2019.",
    "Follow @AlexaSchwerha1 on Twitter.",
    "Students cheer the reversal.]",
    "“Well, it’s been two years.",
    "We’ve had it, we’re done.",
    "“So, we filed a lawsuit.",
    "Become a Patron!",
    "3709.212."
  ]
}