{
  "id": 841,
  "mediaId": 2522,
  "date": "2022-04-15",
  "headline": "Trump has a major rally planned in a key election state",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-YouTube-Trump-Ohio-rally.png",
  "link": "https://www.bizpacreview.com/2022/04/15/trump-has-a-major-rally-planned-in-a-key-election-state-1226106/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BPR Wire",
  "authorUrl": "https://www.bizpacreview.com/author/bpr-wire/",
  "termIds": [
    1556,
    1688,
    1804,
    2201,
    3466,
    4526,
    4742,
    878,
    5212
  ],
  "sentences": [
    "Associates of Trump reportedly said the former president has concerns about all of the candidates running for the nomination and might not endorse anyone, The Columbus Dispatch reported.",
    "Numerous candidates have attempted to secure Trump’s endorsement, including former state treasurer Josh Mandel, businessman Mike Gibbons and former Ohio GOP Chair Jane Timken.",
    "Mike DeWine said he might skip Trump’s rally in order to fulfill a commitment to honor former president Ulysses S. Grant’s 200th birthday, The Cincinnati Enquirer reported.",
    "Sebastian Hughes, DCNF\nFormer President Donald Trump will travel to Ohio to hold a rally amid a contentious GOP primary to be the state’s next senator.",
    "Trump’s Save America PAC announced the rally would take place on April 23, though the attendees of the event have yet to be disclosed.",
    "Gibbons led Mandel by two points in a Fox News poll released in March, with no candidate securing more than 22% of the vote.",
    "DeWine’s primary challenger, former Rep. Jim Renacci, has already sent news releases and text messages about attending.",
    "“So we’ll have to kind of see if that works out,” DeWine said, The Cincinnati Enquirer reported.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Despite the spending of millions of dollars on the race, no clear frontrunner has emerged.",
    "The candidates are competing to fill the vacant seat left by retiring Republican Sen.",
    "A February poll from The Hill and Emerson College gave Gibbons a seven point lead.",
    "Trump is reportedly planning on endorsing venture capitalist and author J.D.",
    "Vance, according to three sources who allegedly spoke with NBC News.",
    "The public will not see it and we do not share it.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Republican Ohio Gov.",
    "Rob Portman."
  ]
}