{
  "id": 11063,
  "mediaId": 2540,
  "date": "2022-03-18",
  "headline": "Jan. 6 committee plans to use key video evidence and hire a writer to build a compelling narrative for the public",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220315134613-capitol-riot-0106-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/18/politics/january-6-committee-writer-multi-media-presentation-compelling-narrative/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Borger",
  "authorUrl": "https://www.cnn.com/profiles/gloria-borger",
  "termIds": [
    4617,
    5322,
    3037,
    1783,
    1880,
    2765,
    6709
  ],
  "sentences": [
    "Jason Miller, a long time spokesperson for Trump also met with the committee and his deposition was prominently featured in a legal brief filed by the committee designed to block Eastman's attempts to keep secret a tranche of emails the conservative attorney claimed should be protected by attorney client privilege.",
    "Describing the type of candidate to take on the writing job, another source familiar with the decision said \"the person who writes a press release isn't necessarily the person that's going to write the deep dive, and making sure that they can put the time and energy into it, was something that we talked about.\"",
    "But just because members believe they can complete their investigation using alternative information sources, does not mean they will stop short of holding individuals accountable, even issuing criminal contempt referrals for specific subpoena targets after the final report is released.",
    "After collecting mountains of information, committee members must now determine how much of it to use in building its case to a public still inundated with images of rioting at the US Capitol but which may not understand the full extent of the efforts to overturn the 2020 election.",
    "In recent months, the committee has interviewed Nick Luna, former President Donald Trump's body man, Cassidy Hutchinson a former aide to then-chief of staff Mark Meadows, and Ross Worthington, a White House aide and one of the writers of Trump's speech on the ellipse on January 6.",
    "Washington (CNN)The House select committee investigating the January 6, 2021, insurrection is planning to produce a multi-media presentation and hire a writer as part of its effort to turn its largely secretive work into a compelling narrative, multiple sources tell CNN.",
    "Members on the panel have also yet to make a decision on whether they want to subpoena their colleagues, such as Rep. Jim Jordan of Ohio, as the Republican lawmakers they have requested to hear from that hold key information have all turned down the voluntary requests.",
    "While many close Trump allies have dodged the committee's attempts to compel them to cooperate, the committee has quietly had success obtaining testimony from a handful of lesser-known White House aides and staffers who were in the West Wing on January 6.",
    "\"We're doing multiple things at once,\" committee member Rep. Pete Aguilar told CNN, referring to the multiple and simultaneous conversations that are ongoing not only about the process moving forward but the questions hanging over the investigation.",
    "The panel has the added burden of operating in the shadow of the 2019 Mueller report, which at more than 400 pages was largely seen as underwhelming and had trouble breaking through to the American people after years of heightened anticipation.",
    "Katrina Pierson, a prominent campaign spokesperson who was part of a West Wing meeting leading up to January 6 has met with the committee, as has Max Miller a former White House and campaign official who is now running for Congress.",
    "If the panel wraps up its depositions by April, it would likely leave a number of key Trump allies who have been subpoenaed in limbo, including Rudy Giuliani and former White House deputy chief of staff Dan Scavino.",
    "The source added that Mississippi Democratic Rep. Bennie Thompson, who chairs the panel, first raised the idea of hiring an outside writer as early as November, and that it has remained an active conversation since.",
    "The process of winnowing down hundreds of witness testimonies and thousands of documents has spurred debate among committee members about how best to complete their work ahead of the midterm elections in the fall.",
    "A review of publicly available information reveals the staff's expertise varies widely, and often includes a law degree from top schools, such as the University of Virginia, Georgetown, Stanford or UCLA.",
    "There is also no firm agreement over what the structure or topic of the long-awaited series of hearings will be, even as the panel enters the time frame for when they have said they will take place.",
    "The online multi-media presentation, which would include links to key video evidence, would be in addition to a traditional written report, according to a source familiar with the committee's work.",
    "In a recent court filing, the panel alleged that right wing lawyer John Eastman and former President Donald Trump were part of a \"criminal conspiracy\" to overturn the 2020 presidential election.",
    "Presenting its information in a comprehensive and engaging way will be crucial to creating a convincing argument for potential legislative changes as well as possible criminal referrals.",
    "Several attorneys for the committee have experience with the Department of Justice, including one who prosecuted notorious Mexican drug cartel leader Joaquin \"El Chapo\" Guzman.",
    "Since last year, the committee has also been talking to people involved in the 9/11 commission for advice and guidance on how to incorporate its findings into a final report.",
    "Giuliani has been engaging with the committee, through his attorney, and has signaled a willingness to answer questions but no formal cooperation agreement has been reached.",
    "One source described the committee as being \"in the slog\" with committee members and staff still thrashing out the best way to communicate everything they have gathered.",
    "The difficulty, this source says, is how to tell the story about people trying to overthrow the government without making it seem too political or polarizing.",
    "\"The committee takes seriously its duty to make sure the historic record is as complete as possible,\" said the source familiar with the committee's work.",
    "\"The last we left it was it's something that we're seeking, but we also have someone in house who's taking on an expanded role to help,\" the source said.",
    "Some of these details were first reported Friday morning by the Washington Post, which said the committee is looking to recruit high-profile journalists.",
    "The effort to hire a writer, confirmed to CNN by three sources familiar with the discussions, comes as the panel enters a new stage of its investigation.",
    "It's also a recognition of how most people consume information in 2022 -- and the massive amount of video evidence the committee has at its disposal.",
    "There has also been no decision yet about whether the committee will decide to make criminal referrals to the Justice Department, the source added.",
    "Whoever the committee hires to help craft its narrative will face the daunting task of turning months of material into a cogent report.",
    "The lack of cooperation from key holdouts however, will not slow the panel's investigation down, according to members on the committee.",
    "\"We're, having those conversations now on what this looks like, timing and which topics to address first,\" said Aguilar.",
    "\"We have some timetables, but when we get 10,000 pages of information that we need to go through, it moves.\"",
    "The committee has also had success in getting some level of cooperation from some Trump campaign officials.",
    "\"It is dedicated to making sure the report is accessible, with all the facts and gravity of what happened.\"",
    "According to a source familiar with the matter, the committee has reached out to at least one journalist.",
    "The committee has already interviewed nearly 750 witnesses and collected more than 84,000 documents.",
    "\"We don't want it to read like a clunky committee effort,\" Democratic Rep. Jamie Raskin told CNN.",
    "That we draft a report, and we wait until the end to see if we get everybody's participation.\"",
    "Thompson has told reporters the committee could wrap up depositions as early as April 1.",
    "He has been reluctant to put a specific timeline as to when a report will be released.",
    "Aguilar, a California Democrat, told CNN, \"Maybe we won't ever hear from some of them.",
    "\"The Muller report is the example of how we don't want it to read,\" said Raskin.",
    "And we're still pursuing lines that would help us get the information we need.\"",
    "\"We want it to have an authorial voice that tells the story of what happened.\"",
    "\"I think the committee is quite serious that everybody needs to participate.",
    "It's just that our report didn't rise or fall on one or two individuals.\"",
    "In recent months, the committee's staff has grown to more than 40 people.",
    "But some we've been able to get it and some we haven't,\" Thompson said.",
    "So yeah, I don't think we give anybody a free pass,\" said Raskin.",
    "The committee plans to hold a series of hearings as early as May.",
    "\"We really want to have engagement with everybody we approached.",
    "I mean, I wish I could tell you,\" Thompson told CNN.",
    "CNN's Whitney Wild contributed to this report.",
    "Others spent time at DHS and on Capitol Hill.",
    "Another served as an immigration attorney.",
    "It's also spent more than $2 million.",
    "\"You know, what, one possibility is?",
    "But we're not giving up yet.",
    "\"It's a moving target.",
    "\"We haven't given up."
  ]
}