{
  "id": 13119,
  "mediaId": 8428,
  "date": "2022-03-01",
  "headline": "Trump holds event for GOP candidates at Mar-a-Lago",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/02/trumpp-e1646168801243.png",
  "link": "https://www.rsbnetwork.com/news/trump-holds-event-for-gop-candidates-at-mar-a-lago/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    5868,
    3925,
    3403,
    2765,
    1126,
    748,
    351,
    6488
  ],
  "sentences": [
    "“We’re going to be doing it again a third time.”\nAdditionally, President Trump told the crowd on Saturday, “In 2022, we’re taking on this wretched and corrupt political establishment like never before.” He added that the mission of conservatives was to “exile [Democrats and RINOs] into political oblivion, never, ever to return again.”",
    "According to a report from The Hill, the event was a GOP candidate forum called the “Take Back Congress Candidate Forum.”\nAs the 2022 midterms approach, President Trump has given numerous endorsements to America First candidates nationwide.",
    "On Saturday, President Trump delivered a powerful speech at CPAC in Orlando, rallying Americans to come together to deal a crushing defeat to Democrats in the 2022 midterms.",
    "Additionally, candidates who do not yet hold public office attended, including Georgia congressional candidate Herschel Walker and Ohio congressional candidate Max Miller.",
    "President Donald J. Trump held an event for Republican candidates at Mar-a-Lago last week ahead of his CPAC speech in Orlando, Florida, Saturday.",
    "), Ronny Jackson (Texas), Mike Carey (Ohio), and Mary Miller (Ill.) were also present.",
    "Marsha Blackburn (Tenn.), Ted Cruz (Texas), and Lindsey Graham (S.C.).",
    "The Hill reported that among those in attendance were Sens.",
    "“We did it twice, and we’ll do it again,” he stated.",
    "Reps. Jim Banks (Ind."
  ]
}