{
  "id": 2522,
  "mediaId": 2551,
  "date": "2022-02-08",
  "headline": "Ofcom chief demands to regulate Netflix over Jimmy Carr Gypsy joke: Pressure piles on US streaming giant as 16,000 sign petition calling for comic's show to be removed while theatres are urged to CANCEL his upcoming comedy gigs",
  "image": "https://i.dailymail.co.uk/1s/2022/02/08/07/53910619-0-image-a-13_1644305605821.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10488207/Ofcom-chief-calls-regulate-Netflix-Jimmy-Carr-Gypsy-joke.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Gant For Mailonline",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=James+Gant+For+Mailonline",
  "termIds": [
    4511,
    4646,
    4753,
    121,
    890,
    943,
    6430
  ],
  "sentences": [
    "+15\nView gallery\nDame Melanie Dawes said she 'would welcome any chance to work on' regulating Netflix after the comedian was slammed for mocking murdered Gypsies\nDowning Street says Jimmy Carr's Holocaust joke is 'deeply disturbing' but matter for Netflix\nDowning Street has said Jimmy Carr's joke about the Holocaust was 'deeply disturbing' but it is a matter for Netflix whether the comedian's show should remain on its streaming service.",
    "+15\nView gallery\nThe Health Secretary also urged people to send streaming service Netflix a 'very strong message' by 'not watching or listening' to the stand-up star (pictured)\n+15\nView gallery\nMeanwhile a petition, labelled 'The Genocide of Roma is Not a Laughing Matter' , had been signed by more than 15,000 people\nJimmy Carr's Terribly Funny Tour... where is he performing this month?",
    "February 8: Dunstable\nFebruary 10: Southend\nFebruary 11: Liverpool\nFebruary 12: Cheltenham\nFebruary 13: London\nFebruary 16: Cambridge\nFebruary 19: London\nFebruary 20: Southampton\nFebruary 25: Rhyl\nFebruary 26: Leicester\nFebruary 27: Bromley\nAdvertisement\nChief Executive of Ofcom Dame Melanie told Channel 4 News: 'I can certainly see that there'll be real value in [regulating Netflix].",
    "+15\nView gallery\nFellow celebrities have queued up to criticise him, including his friend and fellow comedian David Baddiel (pictured) and the author Sir Philip Pullman\nThe Traveller Movement, a charity supporting the traveller community in the UK, said the joke in question was 'truly disturbing and goes way beyond humour'.",
    "+15\nView gallery\nComedian Jimmy Carr has always displayed a distinct taste for the tasteless in his stand-up routines and on his hit Channel 4 panel show, 8 Out Of 10 Cats\nFellow celebrities have queued up to criticise him, including his friend and fellow comedian David Baddiel and the author Sir Philip Pullman.",
    "My Big Fat Gypsy Wedding star Paddy Doherty (pictured right) has called for police to probe Carr's joke about gypsies killed in the Holocaust\nElsewhere, Irish traveller and bare-knuckle boxer Paddy Doherty said the 'disgusting' joke was an insult to the 1.5million gypsies exterminated in death camps.",
    "Jimmy Carr's crass attempt to challenge cancel culture with his Holocaust 'gag' will actually only strengthen it, writes CHRISTOPHER HART\nComedian Jimmy Carr has always displayed a distinct taste for the tasteless in his stand-up routines and on his hit Channel 4 panel show, 8 Out Of 10 Cats.",
    "They might argue in this instance, for example, that Carr was deliberately targeting an ethnic minority, the Roma, who have been persecuted, marginalised and finally murdered by the thousands, and within living memory, thanks to the vile ideology of 'racial purity' propounded by the Nazis.",
    "But it was during his recent outing on Netflix, in a comedy special entitled His Dark Material, that Carr — deliberately — pushed the boundaries of his brand too far for many with a joke about the Holocaust and a disparaging remark about the thousands of Gypsies killed by the Nazis.",
    "Olivia Marks-Woldman OBE, Chief Executive of Holocaust Memorial Day Trust, added: 'We are absolutely appalled at Jimmy Carr's comment about persecution suffered by Roma and Sinti people under Nazi oppression, and horrified that gales of laughter followed his remarks.",
    "'And I think that is a concern because it means that for viewers, it's really confusing that they've got different standards applied, for example, to Channel 4 News than they have to YouTube and other services, including Netflix, that come streamed on to our TVs.'",
    "+15\nView gallery\nMy Big Fat Gypsy Wedding star Paddy Doherty has called for police to probe Carr's joke about gypsies killed in the Holocaust\nAnd given that this is the case, no one should have the right to make jokes about something so terrible as genocide.",
    "He said: 'I think we all have a right to react to that, and one of the best ways anyone can react to that is show these platforms what they think about Jimmy Carr by not watching or listening to him, and that will send him a very strong message.'",
    "Boris Johnson's spokesman has weighed in, Culture Secretary Nadine Dorries described Carr's comment as 'abhorrent', and Health Secretary Sajid Javid is urging people to send Netflix a 'very strong message' by 'not watching or listening' to Carr.",
    "'We acknowledge that Jimmy Carr highlighted the widespread ignorance that exists with regard to non-Jewish victims of the holocaust, but it was nevertheless incredibly crass for him to claim his 'joke' therefore had an 'educational quality'.",
    "'We acknowledge that Jimmy Carr highlighted the widespread ignorance that exists with regard to non-Jewish victims of the holocaust, but it was nevertheless incredibly crass for him to claim his 'joke' therefore had an 'educational quality'.",
    "Back in the 1950s, it banned the music-hall comedian Max Miller and his song Let's Have A Ride On Your Bicycle, due to its 'outrageous' lyrics:\nAfter the ride I began to perspire\nIt wasn't the ride, I'd been pumping her tyre\nInnocent days.",
    "The petition states: 'In Netflix comedy special 'His Dark Material', Jimmy Carr 'jokes' that the Romani and Sinti genocide is ignored when people discuss the Holocaust because people don't want to 'focus on the positives'.",
    "The petition states: 'In Netflix comedy special 'His Dark Material', Jimmy Carr 'jokes' that the Romani and Sinti genocide is ignored when people discuss the Holocaust because people don't want to 'focus on the positives'.",
    "He's like a naughty boy who has deliberately stirred up a hornet's nest — to the delight of the morally indignant and perpetually outraged — and while he may well get stung himself, so too will many others in his wake.",
    "Many of those who identify broadly as 'conservative' feel deep in their bones that freedom of speech and expression are far more important than the right of any individual or group not to have their feelings hurt.",
    "Petition that tells Carr genocide 'is not a laughing matter' signed by more than 15,000\nA petition, labelled 'The Genocide of Roma is Not a Laughing Matter', had been signed by more than 15,000 people.",
    "Television bosses will, as a result of his joke, become yet more jittery and anxious, forever checking their Twitter feeds and social media to see if their stars or programmes have caused any offence.",
    "It said: 'We appreciate that comedy is subjective but in our view when punchlines are indistinguishable from the genuinely held views of fascists and neo-Nazis, a line has very clearly been crossed.'",
    "Please show your support by learning more, challenging hateful comments like these, and following accounts such as Roma Support Group, The Traveller Movement, and Friends, Families and Travellers.'",
    "But nowadays, the massed forces of Correctness and Woke — the most censorious and intolerant forces of our time — have some powerful arguments on their side, however much we may dislike that fact.",
    "He told the Mirror: 'His so-called joke was so offensive because there are many still living who witnessed the brutality of what happened, and many more who lost families in barbarous murders.'",
    "Advertisement\nSherrie Smith, from Gypsies and Travellers Essex, told the Times: 'We should be looking at Channel 4, all the theatres that endorse Jimmy Carr and everybody who he works next to.",
    "'We appreciate that comedy is subjective but in our view when punchlines are indistinguishable from the genuinely-held views of fascists and Neo-Nazis, a line has very clearly been crossed.",
    "'We appreciate that comedy is subjective but in our view when punchlines are indistinguishable from the genuinely-held views of fascists and Neo-Nazis, a line has very clearly been crossed.",
    "+15\nView gallery\n+15\nView gallery\nBoris Johnson's spokesman also said it was 'unacceptable to make light of genocide' and suggested the Government could push for a crack down on platforms.",
    "Arguably even worse was Carr's subsequent back-pedalling, when he tried to make out that his quip might be 'educational', raising awareness that many Roma were killed by the Nazis as well.",
    "'Hundreds of thousands of Roma and Sinti people suffered prejudice, slave labour, sterilisation and mass murder simply because of their identity – these are not experiences for mockery.",
    "'Broadly we are looking at toughening measures for social media and streaming platforms who don't tackle harmful content on their platforms and that is what we are moving forward for.",
    "She added: 'I can really understand why a lot of people found that very offensive and as you say, we don't regulate Netflix at the moment, they're underneath the Dutch regulator.",
    "In a tweet referencing the joke, The Traveller Movement - a charity supporting the traveller community in the UK, said: 'This is truly disturbing and goes way beyond humour.'",
    "+15\nView gallery\nCarr said: 'When people talk about the Holocaust, they talk about the tragedy and horror of six million Jewish lives being lost to the Nazi war machine.",
    "On stage in Whitley Bay at the weekend, after he was heckled about the Holocaust issue, he left the audience in no doubt that he had wanted to take on 'cancel culture'.",
    "Asked if Netflix should take down the Carr show, he added: 'That will be a matter for them, we are clear that mocking the atrocities of the holocaust is unacceptable.",
    "Culture Secretary Nadine Dorries previously suggested new laws via the Media Bill could hold to account streaming sites for airing jokes such as those made by Carr.",
    "'The widespread ignorance of this recent history needs to be addressed and we urge everyone to learn more about the past and the experiences of Roma people today.",
    "Nor is the instinct that drives the Censorious Woke, determined to silence anyone who disagrees with them or sees things differently, an entirely new development.",
    "Downing Street on Monday called Carr's comments 'deeply disturbing' but said it was a matter for Netflix whether the show should remain on its streaming service.",
    "She said she understands why people found it 'very offensive' but added there was not much she could do while the streaming service was under Dutch regulators.",
    "The stand-up comedian, also known for his roles on shows like 8 Out Of 10 Cats, made a disparaging remark about the deaths of thousands of Gypsies in the war.",
    "Sajid Javid also waded into the row - describing the comedian's joke as 'horrid' and urged people to send streaming service Netflix a 'very strong message'.",
    "Gypsy leaders called on Carr to join them at Auschwitz when they visit to remember the Holocaust on August 2, the date in 1944 when 4,000 Roma were killed.",
    "The genuinely funny and imaginatively outrageous will have a harder time getting heard as a result, and our cultural experience will be the poorer for it.",
    "In a widely-shared clip from the show, Carr joked about the horror of the Second World War systematic killings and 'six million Jewish lives being lost'.",
    "The charity have now launched a petition to Netflix calling for the 'removal of the segments of His Dark Material which celebrates the Romani genocide'.",
    "Carr said: 'When people talk about the Holocaust, they talk about the tragedy and horror of six million Jewish lives being lost to the Nazi war machine.",
    "'Or you can tell one that targets the oppressors, or draws attention to the fundamental evil of it, or shines and light on the humanity of the victims.",
    "Free speech has never been entirely free — and, indeed, a society where absolute free speech was practised would hardly be a society at all, but chaos.",
    "A comedian like Jimmy Carr has to make jokes about one of the most atrocious episodes in human history, the Holocaust, and the sufferings of the Roma.",
    "It comes as theatres were urged to boycott Carr's Terribly Funny Tour, with attention turned on the Grove Theatre in Dunstable, Bedfordshire, tonight.",
    "She said Facebook Chief Executive Mark Zuckerberg could get a jail sentence if the social media platform does not comply with new online safety laws.",
    "The head of Ofcom has said there would be 'real value' in the media watchdog regulating Netflix after Jimmy Carr made a joke about the Holocaust.",
    "that this will surely get him cancelled for ever, Carr may well find that it will be the outcome which, in his vanity, he thought he could avoid.",
    "But by exploiting the Holocaust for comedy material and then almost begging for attention by prefacing his show with the warning (or boast?)",
    "'There is no legitimate basis for this 'joke', and no positive to its inclusion which outweighs the profoundly negative impact it produces.'",
    "'There is no legitimate basis for this 'joke', and no positive to its inclusion which outweighs the profoundly negative impact it produces.'",
    "'If this was the case he would have used his considerable platform to raise awareness of Roma Holocaust Memorial Day to his 6.7m followers.",
    "'If this was the case he would have used his considerable platform to raise awareness of Roma Holocaust Memorial Day to his 6.7m followers.",
    "Meanwhile, comedian David Baddiel, a close friend of Carr, also criticised him over the joke, describing it as 'mean-spirited' and 'cruel'.",
    "In wiser moments, the comedian has reflected on how the times we live in remind him of hysterical episodes of book-burning through history.",
    "Spokesman for the UK's Roma Billy Welch said if the comedian and presenter went he may 'appreciate the hurt and fear he has stirred up'.",
    "Ms Dorries also warned over the weekend that she was putting social media giants such as Facebook on notice with her Online Safety Bill.",
    "Pictured: Survivors of Auschwitz\nAccording to reports, he told them: 'What I am saying on stage this evening is barely acceptable now.",
    "+15\nView gallery\n+15\nView gallery\nJewish comedian David Baddiel (pictured left) slammed Carr for joking about the Holocaust on stage.",
    "Speaking during a recent gig in Whitley Bay, Tyne and Wear, he told his audience 'the joke that ends my career is already out there'.",
    "Carr issued a 'trigger warning' to the audience at the beginning of the show, admitting his performance contained 'terrible things'.",
    "In the past, he has freely admitted, 'I do a lot of jokes about rape', and previous gags about amputee soldiers have disgusted many.",
    "Dame Melanie Dawes said she 'would welcome any chance to work on that' after the comedian was slammed for mocking murdered Gypsies.",
    "The comedian and TV host sparked outrage with a joke about the Holocaust in his recent one-hour Netflix special, His Dark Material.",
    "In the sort of phraseology favoured by the Woke, Jimmy Carr's facile quip risks 'legitimising violence against ethnic minorities'.",
    "'What we are focused on is making sure that the streaming services are more accountable and moving forward with our legislation.'",
    "He's talking about mass murder being a positive – would he be allowed to say this about black people killed by the Ku Klux Klan?",
    "'\nHe has a point, but I would argue that what Carr has done is to actively promote cancel culture, to fan the flames feeding it.",
    "It has also launched a petition demanding that the streaming service edit the segment of the show to remove the offending item.",
    "In his defence, Carr has protested that many servicemen loved his performances, and the black humour was typically 'squaddie'.",
    "The Grove Theatre in Dubstable, Bedfordshire, which is set to host him tonight, was under pressure to shelve the performance.",
    "Meanwhile a petition, labelled 'The Genocide of Roma is Not a Laughing Matter', had been signed by more than 15,000 people.",
    "Meanwhile a petition, labelled 'The Genocide of Roma is Not a Laughing Matter', had been signed by more than 15,000 people.",
    "Nowadays, in order to provoke a storm — and the cynic might say attract attention to a new show — saucy innuendo won't do.",
    "But does it matter if a joke is funny or not, or in such appallingly bad taste that it will offend many reasonable people?",
    "The joke was condemned Labour MPs including Labour's Nadia Whittome and David Lammy who described it as 'despicable'.",
    "Carr sparked outrage from various Traveller charities and anti-hate groups after a clip was shared on social media.",
    "Advertisement\nCarr sparked outrage with the comment, which was aired as a preview to his new Netflix show and tour.",
    "It is estimated between 200,000 and 500,000 Roma and Sinti people were murdered by the Nazis during the Holocaust.",
    "The Government is 'toughening measures for social media and streaming platforms who don't tackle harmful content'.",
    "The PM's spokesman said: 'Those comments are deeply disturbing and it's unacceptable to make light of genocide.'",
    "He said in a statement: 'These comments are deeply disturbing and it is unacceptable to make light of genocide.",
    "'I want to make them accountable, really for the first time, and to increase transparency across the industry.",
    "He then made a disparaging remark about the deaths of thousands of Gypsies who were also killed by the Nazis.",
    "He told a laughing audience: 'But they never mention the thousands of Gypsies that were killed by the Nazis.",
    "He said: 'You can obviously tell a Holocaust joke that is cruel and inhumane and mean-spirited and racist.",
    "A joke is just a joke, whether you find it funny or not, and it places no one in danger of physical harm.",
    "Jimmy Carr's joke was irresponsible; a calculated way of provoking and annoying the forces of censorship.",
    "But the truth is rarely simple, and freedom of speech flourishes best when it comes with responsibility.",
    "Gypsy leaders also invited the stand up performer to Auschwitz to remember the genocide later this year.",
    "'So that the public have got a much better sense of what's going on and how things are getting better.'",
    "Theatres set to host Carr's tour also saw the heat intensify last night from Traveller campaign groups.",
    "It also called for Carr to apologise and for Netflix to strip the segment out of the comedy special.",
    "After you've been through a tour of duty in Helmand, you're unlikely to get upset about a mere joke.",
    "Responding to these comments, Dame Melanie said: 'Fear isn't always what really makes a difference.",
    "The Government was focused on 'making sure that streaming services are more accountable', he added.",
    "Local campaign groups are weighing up plans for a protest at theatres set to hosting the comedian.",
    "The Luton Roma Trust called for the venue to ensure the 'gross racial slur' would not be repeated.",
    "It barely deserves repeating, but for the broader points I want to make it is necessary to do so.",
    "'It's not the subject matter of the joke that counts, it's the specifics of the individual joke.",
    "Asked whether Netflix should pull the show, the spokesman said: 'That will be a matter for them.",
    "His deadpan humour is challenging to say the least, and not something that appeals to everyone.",
    "'But you know, we'll have to see what sort of penalties the Government introduces in the Bill.",
    "'No one ever wants to talk about that, because no one ever wants to talk about the positives.'",
    "It added: 'We need all your support in calling this out #StopTravellerHate @StopFundingHate.'",
    "A woman in the audience heckled Carr by saying, 'Are we going to talk about the Holocaust?'",
    "He even introduced the joke in an arrogant fashion by saying 'it could be a career ender'.",
    "Before Political Correctness, there was Mary Whitehouse and Disgusted of Tunbridge Wells.",
    "You will say: 'I saw a man and he stood on a stage and he made light of serious issues.",
    "'You are going to be able to tell your grandchildren about seeing this show tonight.",
    "You are going to be able to tell your grandchildren about seeing this show tonight.'",
    "Taste aside, the joke that has caused the furore wasn't funny to with start with.",
    "Meanwhile, the BBC has been banning comedians since before many of us were born.",
    "But none of this can come as a surprise for Netflix (market value $175 billion).",
    "No one ever talks about that because no one wants to talk about the positives.'",
    "No one ever talks about that because no one wants to talk about the positives.'",
    "'Obviously we are looking at regulatory changes for those streaming companies.'",
    "But they never mention the thousands of Gypsies that were killed by the Nazis.",
    "But they never mention the thousands of Gypsies that were killed by the Nazis.",
    "And is it really, as one campaign group claimed, 'a celebration of genocide'?",
    "Others have gone further, demanding that viewers cancel their subscriptions.",
    "'Roma and Sinti people still face dreadful prejudice as this incident shows.",
    "We are clear that mocking the atrocities of the Holocaust is unacceptable.'",
    "Doesn't a comedian have the freedom to tell whatever jokes he or she wants?",
    "From what I know of soldiers' sense of humour, I think he's probably right.",
    "Carr replied: 'We are going to talk about cancel culture, the whole thing.",
    "Carr has actually given those who want to censor us even more ammunition.",
    "Loyalists to the principle of free speech might regard this as nonsense.",
    "Last night, it had attracted more than 13,000 signatures and counting.",
    "It'd be good to hear from him about what he thinks about these issues.",
    "He later said: 'We are speaking my friends in the last chance saloon.",
    "He told the Sunday Mirror: 'He should be investigated by the police.",
    "With Carr, they can't pretend they didn't know what they might get.",
    "So why did he give such a gift to the true enemies of free speech?",
    "He knew exactly what he was doing, and why, in initiating outrage.",
    "The Holocaust Memorial Day Trust said his comments were 'hateful'.",
    "What I am saying on stage this evening is barely acceptable now.",
    "He's a clever man, an experienced stand-up and TV professional.",
    "'I'd like to talk to Mark Zuckerberg, I haven't met him.",
    "We are going to talk about f***ing everything people.",
    "And so we would welcome any chance to work on that.'",
    "This is nothing short of a celebration of genocide.",
    "This is nothing short of a celebration of genocide.",
    "We used to call them jokes and people would laugh.'",
    "Carr and Netflix have been contacted for comment.",
    "More than a million of my people were killed.'",
    "To our knowledge, that has never happened.",
    "To our knowledge, that has never happened.",
    "'In ten years f***ing forget about it.",
    "Clearly, Jimmy Carr's was the former.'",
    "We need to look at why he did this.'",
    "'There's a level you don't go to.",
    "This is an absurd exaggeration.",
    "In ten years, forget about it.",
    "I do not want to defend Carr.",
    "Like I said, not funny.",
    "But it has backfired.",
    "'That wasn't a joke.",
    "the Mirror reported.",
    "That speaks volumes.",
    "That speaks volumes.",
    "What a joke!",
    "No it isn't.",
    "Quite so.",
    "Simple.",
    "Relax.'",
    "Yes."
  ]
}