{
  "id": 5299,
  "mediaId": 2641,
  "date": "2022-04-10",
  "headline": "'Trump Factor' Key Reason for Republican Retirements From House",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=cfdd48ea-dab2-4719-9991-73c62ad4028f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/gibbs-house-member-upton/2022/04/10/id/1065133/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Gizzi",
  "authorUrl": "",
  "termIds": [
    4804,
    2925,
    2905,
    2765,
    3822,
    4066,
    3483,
    1126,
    1477
  ],
  "sentences": [
    "\"Some Republicanss who have crossed paths with President Trump have realized that their districts are far more pro-Trump than they have been,\" said former House Appropriations Committee Chairman Bob Livingston, R.-LA, \"other than those who are running for higher office, several are just tired of the hostile and overly politicized fish bowl atmosphere in Washington.\"",
    "\"Gibbs is just the latest example that the large number of Republicans retiring can be attributed to one fact: Trump’s grip on the GOP hasn’t faded,\" Dan Eberhardt, longtime Republican contributor and fundraiser, told Newsmax, \"Just like the restaurant chain Ruth’s Chris Steakhouse, the Republican Party is still Trump’s Republican Party.\"",
    "\"It’s more an odd combination of circumstances- people who voted for impeachment are leaving, Members are redistricted out of seats, and Members are trying for higher office,\" said Henry Olsen, Senior Fellow at the Center For Ethics and Public Policy and author of a critically-acclaimed book on Ronald Reagan and blue-collar voters.",
    "Six-termer Gibbs, a strong conservative who almost always supported Trump, nonetheless opted out of re-election when a new redistricting plan placed him in the same district as Max Miller, former Trump White House staffer and scion of a wealthy real estate family in Cleveland.",
    "That number is not as high as the 31 Democrats who are leaving, but certainly noticeable—especially in a year in which Republicans almost universally exude confidene they will win control of the House and GOP Leader Kevin McCarthy (Cal.)",
    "Former Rep. John Linder of Georgia, a past National Republican Congressional Committee chairman, told Newsmax that \"several Members are avoiding primary challenges because of their votes for impeachment.",
    "Rep. Upton, one of 10 House Republicans to support impeachment of Trump last year, found his old district placed in new Western Michigan turf that was largely represented by fellow GOP Rep. Huizenga.",
    "Retirement announcements last week from Reps. Fred Upton (Mich.) and Bob Gibbs (OH) brought to 22 the number of House Republicans who are retiring, seeking another office, resigning, or have died.",
    "There are always varied personal reasons or unfavorable redistricting that will convince a Republican U.S. Representative to say \"outta here.\"",
    "But in 2022, there are growing signs of another reason: the strong hand in and resultance influence of Donald Trump in the Republican Party.",
    "Others we spoke to agreed with Eberhardt but said the circumstances surrounding the present exodus of Republican lawmakers was unique.",
    "Miller had Trump’s strong endorsement, which undoubtedly convinced Gibbs to step down.",
    "John Gizzi is chief political columnist and White House correspondent for Newsmax.",
    "That is an unusual circumstance that might be taken into consideration.",
    "Trump strongly endorsed Huizenga, who had opposed impeachment.",
    "For more of his reports, Go Here Now.",
    "will wield the gavel as speaker.",
    "It won’t happen often.\"",
    "All rights reserved.",
    "© 2022 Newsmax.",
    "Special Links:"
  ]
}