{
  "id": 7152,
  "mediaId": 2919,
  "date": "2022-04-06",
  "headline": "Ohio Rep. Bob Gibbs announces retirement over 'circus' of Ohio's unresolved congressional maps",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/19e8f33/2147483647/strip/true/crop/5760x3024+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F1d%2F0a%2F51c801fd46268a32e56dec7b803c%2Fap22096562322355.jpg",
  "link": "https://www.news5cleveland.com/news/state/ohio-rep-bob-gibbs-announces-retirement-over-circus-of-ohios-unresolved-congressional-maps",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    4820,
    2905,
    1126,
    1267,
    1477,
    6474,
    6067
  ],
  "sentences": [
    "“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District,\" Gibbs said in a statement announcing his retirement.",
    "Trump congratulated Gibbs on “a wonderful and accomplished career.”\nGibbs said in his announcement:\n“This circus has provided me the opportunity to assess my future.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "In a statement released Wednesday, Gibbs declared himself a casualty of “the circus” over the unresolved process to redraw Ohio’s congressional map.",
    "If he had not exited the primary race, Gibbs would have went up against Trump-backed challenger Max Miller, who was an aide to the former president.",
    "I want to thank family, friends, and supporters for their encouragement this election and the voters’ confidence in me the previous six elections.",
    "According to the Associated Press, Miller was initially recruited to defeat U.S. Rep. Anthony Gonzalez, a supporter of Trump's impeachment.",
    "Thank you to my family, especially my wife Jody, for putting up with the long drives, late dinners, and my weeks away from home.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Congressman Bob Gibbs, of Ohio, has announced his retirement as early voting is underway in Ohio’s primary.",
    "To that end, after considerable deliberation, I have decided to not seek re-election this year.",
    "I will use this opportunity to spend more time with her, my children, and grandchildren.\"",
    "Gibbs blamed the Ohio Supreme Court for drawing out Ohio's redistricting fight.",
    "Download now on your Apple device here, and your Android device here.",
    "This was a difficult decision, one which I did not make lightly.",
    "It has truly been an honor to advocate for Ohioans in Congress.",
    "I am eternally grateful for the opportunity.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "Gonzalez has since retired.",
    "CLEVELAND — Republican U.S."
  ]
}