{
  "id": 7619,
  "mediaId": 2636,
  "date": "2022-04-06",
  "headline": "Bob Gibbs, House Republican Facing Primary Challenge in Ohio, Will Retire",
  "image": "https://static01.nyt.com/images/2022/04/06/us/politics/06pol-gibbs-Bob/06pol-gibbs-Bob-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/06/us/politics/bob-gibbs-ohio-retire.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5853,
    1710,
    4303,
    4820,
    2765,
    1477,
    6067,
    6474
  ],
  "sentences": [
    "Mr. Gibbs’s name will still appear on the ballot in the district but signs will be posted at voting locations stating that votes for him will not be counted, said Rob Nichols, a spokesman for the Ohio Secretary of State, in a brief interview.",
    "Mr. Gibbs voted against impeaching Mr. Trump after the Capitol riot and voted to overturn the results of the presidential election, positions that the former president has treated as litmus tests for which Republicans he will support in 2022.",
    "“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new,” he said.",
    "— Max Miller (@MaxMillerOH) April 6, 2022\nThe court is planning to hold a hearing on the new congressional map sometime after the May 3 primary, and is hearing challenges to a fourth set of state legislative maps.",
    "Mr. Gibbs said in a statement that the tumultuous effort to redraw the state’s congressional map had become a “circus,” and he criticized the last-minute changes to his rural district south of Cleveland.",
    "Both parties have sought to give themselves advantages in states across the country — giving rise to legal wrangling in several states, including New York, Maryland, Alabama and North Carolina.",
    "Ohio’s redistricting process had forced Mr. Gibbs, who has served in Congress since 2011, into a Republican primary against a Trump-backed challenger, Max Miller, among others.",
    "Mr. Trump endorsed Mr. Miller last year when the Ohio candidate was aiming to unseat Representative Anthony Gonzalez, who had voted to impeach Mr. Trump.",
    "Frank LaRose, Ohio’s Secretary of State, removed the state legislative races from the May 3 ballot and a new date for those elections has not been set.",
    "Representative Bob Gibbs of Ohio announced on Wednesday that he would not seek re-election, just as early voting got underway in the state.",
    "Jen Miller, the executive director of the League of Women Voters of Ohio, echoed Mr. Gibbs’s frustration with redistricting.",
    "He has been a fighter for Ohio voters and we should all be thankful for his contribution to our state and our country.",
    "“Ohio is swingable but it doesn’t seem that way because we have this history of extreme gerrymandering,” she said.",
    "Mr. Gibbs was facing a serious primary challenge from Mr. Miller, an aide to former President Donald J. Trump.",
    "Redistricting is a potentially decisive factor in determining which party will control Congress.",
    "Congressman Bob Gibbs has championed Ohio values in Congress for more than a decade.",
    "Mr. Gibbs and Mr. Gonzalez were later drawn into the new Seventh District.",
    "But Mr. Gonzalez said in September that he would not run for re-election.",
    "Mr. Miller on Wednesday praised Mr. Gibbs’s tenure.",
    "Thank you for your service, Congressman.",
    "Michael Wines contributed reporting."
  ]
}