{
  "id": 7707,
  "mediaId": 2537,
  "date": "2022-04-03",
  "headline": "FC Cincinnati 2 defeats Toronto FC II for first-ever MLS NEXT Pro win",
  "image": "https://www.gannett-cdn.com/presto/2022/04/03/PCIN/529ebce1-ec72-47bd-8704-040799786810-FC_Cincy.jpg?crop=2039,1147,x4,y0&width=2039&height=1147&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/sports/soccer/fc-cincinnati/2022/04/03/fc-cincinnati-2-defeats-toronto-fc-2-first-ever-mls-next-pro-win/7200264001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pat Brennan",
  "authorUrl": "https://www.cincinnati.com/staff/2646672001/pat-brennan/",
  "termIds": [
    0
  ],
  "sentences": [
    "Credit for Cincinnati's second goal was a subject of debate, and it wasn't until after the match that the 73rd-minute score was awarded as an own-goal for Toronto after Ordonez and later Andrew Akindele had been given credit.",
    "FC Cincinnati's starting XI: Roman Celentano (GK, captain), Ashton Kamdem, Ian Murphy, Kai Thomas, Morgan Marshall, Zico Bailey, Avionne Flanagan, Harrison Robledo, Dado Valenzuela, Nick Markanich, Quimi Ordonez).",
    "CF Montreal wins seven-goal thriller against FC Cincinnati, 4-3\n\"Obviously, the most important thing is three points and it was good to get a crowd and play in the home stadium,\" Celentano said afterward.",
    "Leading 2-1 in second-half stoppage time, Cincinnati goalkeeper Roman Celentano conceded a penalty kick and then made a double save on the ensuing sequence to preserve FCC2's lead.",
    "Cincinnati improved to 1-1-0 in MLS NEXT Pro, which launched this year as a reserve league and a proving ground for academy players and other professionals seeking to reach MLS.",
    "An estimated crowd of about 250 spectators attended, and included among them were first-team veterans Haris Medunjanin, Kenneth Vermeer and Dominique Badji.",
    "The goal put Cincinnati back in front after Toronto tied the match in the 10th minute, but Ordonez playfully claimed the goal in post-match remarks.",
    "The match at the NKU's soccer complex, now named for former English Premier League chairman Richard Scudamore, was an event to see, and be seen at.",
    "Moments later, the referee's full-time whistle confirmed a gritty, 2-1 victory Sunday at the Northern Kentucky University's Scudamore Field.",
    "Kai (Thomas), obviously he's gonna make mistakes and that's part of the development but we like what we saw from the boys out there tonight.",
    "Arquimides Ordonez rounded Toronto FC II's goalkeeper and coolly dribbled an additional defender before passing the ball into an open net.",
    "Head coach Tyrone Marshall fielded a starting lineup that featured six FC Cincinnati players on first-team contracts including Ordonez.",
    "Also in attendance were General Manager Chris Albright, FCC Co-Chief Executive Officer Jeff Berding and other front office personnel.",
    "The day had plenty of ingredients to mark an enticing \"first\" in FC Cincinnati's history, and the crowd provided real atmosphere.",
    "Substitutes: Daniel Martin (Valenzuela); Isaac Atanga (Flanagan); Andrew Akindele (Kamdem); Max Miller; David Garcia (Markanich).",
    "I mean if anything – if anything – I feel like it could be my goal or an own-goal but it was already going in when I shot it.\"",
    "\"There's some other guys that stepped up from the last game (against Philadelphia) and played really well ...",
    "First, I tried to head it in and that didn't work out but it came right back to me,\" Ordonez said, smiling.",
    "The first-team players were in attendance less than 24 hours after Saturday's 4-3 loss to CF Montreal.",
    "That the quality that we want from the boys who are joining us from the first team,\" Marshall said.",
    "But Marshall lauded all his players for the win, saying each deserved man-of-the-match honors.",
    "The tally arrived in the fourth minute and stood as the first goal in FC Cincinnati 2 history.",
    "Medunjanin was seen taking pictures with fans during halftime in the venue's metal bleachers.",
    "I almost gave it away but happy the guys stuck together and worked to get the three points.\"",
    "\"The fans, the fact that they come for the second team, they come for the first team.",
    "That moment was just one of several memorable events that took place in the match.",
    "FCC2 then defended desperately in the seconds following Celentano's double save.",
    "\"I thought Quimi (Ordonez) did fantastic as well, scoring a goal and assisting.",
    "Did not play: Paul Walters, Owen Norverr, Darrell Turcios, Leonardo Vazquez.",
    "At least for me (and) I think the boys felt the same way, so it was good.\"",
    "We scored, the excitement, you can see there's people in the crowd.",
    "\"Oh yeah, it felt amazing,\" Ordonez said of the crowd size.",
    "In the back line, Roman – I'm gonna keep giving him praise.",
    "\"The guys worked hard and we earned the three points.",
    "\"I thought Nick Markanich played really well today.",
    "More:'Probably our most inconsistent performance.'",
    "That's why he had the captain's armband tonight.",
    "I think all of them deserved man of the match.\"",
    "It's pumps you up like this was an MLS match.",
    "I hit it cleanly and I think it's my goal.",
    "Like, the fans, they make everything.",
    "\"The ball popped up in the air.",
    "I didn't think they were bad.",
    "I think he's been fantastic.",
    "\"Went back to my right foot.",
    "The back line was OK."
  ]
}