{
  "id": 7723,
  "mediaId": 2557,
  "date": "2022-04-06",
  "headline": "BREAKING: Republican Rep announces retirement, slams redistricting ‘circus’ [Trump responds]",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-166274033.jpg",
  "link": "https://dennismichaellynch.com/breaking-republican-rep-announces-retirement-slams-redistricting-circus-trump-responds/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    2765,
    2905,
    1433,
    1126,
    1394,
    6678
  ],
  "sentences": [
    "I helped reform federal water resources policy, made clean water utilities more affordable for low-income communities, cut taxes & red tape for millions of American families & businesses… pic.twitter.com/xABqVFGHjw\n— Gibbs for Congress (@Bob_Gibbs) April 6, 2022\nAfter considerable deliberation, I have decided to not seek re-election this year.",
    "Gibbs did not mention Trump or Miller in his retirement notice but he did slam the “redistricting fiasco.”\nIn a statement on Twitter, Gibbs wrote:\nSince 2011, I’ve had the honor of serving the people of Ohio’s 18th, then 7th District.",
    "I helped reform federal water resources policy, made clean water utilities more affordable for low-income communities, cut taxes & red tape for millions of American families & businesses and fought for a cleaner, safer Lake Erie.",
    "Republican Ohio Rep. Bob Gibbs announces retirement, slams redistricting ‘circus’ https://t.co/1hb5AImTac #FoxNews\n— Chris Long (@OCAPresident) April 6, 2022\nTo get more information about this article, please visit Fox News.",
    "— Max Miller (@MaxMillerOH) April 6, 2022\nFormer President Donald Trump released the following statement on Gibbs’ retirement:\n“I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career.",
    "He was a strong ally to me and MAGA, voting to support… pic.twitter.com/6RN6dfzwY4\n— Liz Harrington (@realLizUSA) April 6, 2022\nThank you for your service, Congressman Gibbs.",
    "— Gibbs for Congress (@Bob_Gibbs) April 6, 2022\nGOP candidate Max Miller tweeted, “Congressman Bob Gibbs has championed Ohio values in Congress for more than a decade.",
    "The revisions to the district have removed much of the rural area Gibbs had previously represented, and includes more suburbs, according to an NBC News report.",
    "The redistricting process was pitting Gibbs in a primary race against former Trump White House and campaign aide Max Miller, who Trump has endorsed.",
    "Given Ohio’s redistricting fiasco, and the Ohio Supreme Court’s irresponsible handling of it, I’ve been given time to reassess my future.",
    "I want to thank family, friends, and supporters for their encouragement and the voters’ confidence in me the previous six elections.",
    "I want to thank family, friends, and supporters for their encouragement and the voters’ confidence in me the previous six elections.",
    "— Gibbs for Congress (@Bob_Gibbs) April 6, 2022\nI will use this opportunity to spend more time with her, my children, & grandchild.",
    "Thank you for your service, Congressman.”\nCongressman Bob Gibbs has championed Ohio values in Congress for more than a decade.",
    "He was a strong ally to me and MAGA, voting to support my America First agenda and fighting strongly against the Radical Left.",
    "Thanks to my family, especially my wife Jody, for putting up with the long drives, late dinners, & my weeks away from home.",
    "President Donald J. Trump:\n“I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career.",
    "He has been a fighter for Ohio voters and we should all be thankful for his contribution to our state and our country.",
    "He has been a fighter for Ohio voters and we should all be thankful for his contribution to our state and our country.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "His retirement, after serving in Congress for more than a decade, should be celebrated by all.",
    "His retirement, after serving in Congress for more than a decade, should be celebrated by all.",
    "It has been a a privilege to work for Ohioans in Congress & am grateful for the opportunity.",
    "I am proud of this work and am grateful for the opportunity to do it on behalf of Ohioans.",
    "Since 2011, I’ve had the honor of serving the people of Ohio’s 18th, then 7th District.",
    "I will use this opportunity to spend more time with her, my children, & grandchild.",
    "After considerable deliberation, I have decided to not seek re-election this year.",
    "This was a difficult decision, one which I did not make lightly.",
    "This was a difficult decision, one which I did not make lightly.",
    "May God continue to bless the Great State of Ohio and America.",
    "May God continue to bless the Great State of Ohio and America.",
    "Gibbs, 67, has served in the U.S. Congress since January 2011.",
    "Thank you for your service Bob – a job well done!”\nNEW!",
    "Listen to the latest daily DML podcasts below!",
    "Thank you for your service, Congressman.",
    "Then please share."
  ]
}