{
  "id": 7747,
  "mediaId": 2589,
  "date": "2022-04-06",
  "headline": "Ohio Republican announces retirement over redistricting",
  "image": "https://media.townhall.com/townhall/reu/o/2010/323/b71caa81-2680-49e1-a4aa-a34b9bdb7340@news.ap.org-1110x740.jpg",
  "link": "https://hotair.com/jazz-shaw/2022/04/06/ohio-republican-announces-retirement-over-redistricting-n460474",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jazz Shaw",
  "authorUrl": "https://hotair.com/author/jazz-shaw",
  "termIds": [
    2765,
    2905,
    4820,
    1267,
    1126,
    392,
    604,
    6474,
    6067
  ],
  "sentences": [
    "“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.”\nI’m not entirely sure why Gibbs decided to bow out now, actually.",
    "“These long, drawn-out processes, in which the Ohio Supreme Court can take weeks and months to deliberate while demanding responses and filings from litigants within days, is detrimental to the state and does not serve the people of Ohio,” Gibbs said.",
    "He criticized the “redistricting circus” that’s been going on in Ohio, complaining that the courts were giving candidates barely a week to prepare for a race after learning the very differently drawn district where they would be running.",
    "This redistricting situation seems like it’s turning into more and more of a mess every ten years and Congressman Gibbs just appears to have become collateral damage in the gerrymandering wars.",
    "In a statement issued Wednesday, Gibbs said he is “confident in the future of our nation,” while criticizing what he called the “circus” of redistricting that has taken place in his state.",
    "Gonzalez represented much of the same real estate on the current map and he did vote to impeach Trump, so Miller quickly gained an enthusiastic endorsement from the former president.",
    "But Gibbs would have to go out there and learn about a huge number of new constituents, while most of the people he previously served will now be in the 12th District.",
    "It’s true that his district moved quite a bit and it looks slightly more competitive than it used to, but FiveThirtyEight still rates it as being solidly leaning red.",
    "Bob Gibbs, a farmer turned politician, has been representing Ohio’s 7th District for a decade and has either won all of his reelection bids handily or run unopposed.",
    "(Fox News)\nRep. Bob Gibbs, R-Ohio, has announced that he is retiring at the end of his current term, the second Republican member of Congress to do so in two days.",
    "Most of the congressional retirement news we’ve seen this cycle has had to do with Democrats, but now another Republican is joining their ranks.",
    "He was facing a primary challenge from a candidate who was endorsed by Donald Trump, but that doesn’t seem to be the real reason he’s leaving.",
    "Then the new maps were drawn and the 7th District wound up being a more compact area closer to Cleveland, mostly in Gonzalez’s prior district.",
    "Gibbs didn’t vote to impeach Trump or anything, but the endorsement came about in a rather unusual way, once again impacted by redistricting.",
    "Perhaps he just felt that this was the right time to retire rather than working through all of these changes.",
    "He originally announced that he planned to take on Anthony Gonzalez in the primary in the 16th District.",
    "But now, at 67 years of age, Gibbs is hanging it up and heading back to his farm after this term ends.",
    "But Miller still wants to run so that puts him against Gibbs and he keeps Trump’s endorsement.",
    "Best of luck to Bob Gibbs in his retirement and please accept our thanks for your service.",
    "And Ohio is far from being the only place where this confusion is creating turmoil.",
    "But then Gonzalez announced his retirement, taking him away as a potential target.",
    "Gibbs’ expected primary opponent is Max Miller, a former aide to Donald Trump.",
    "Or maybe the primary challenge was concerning him more than he’s letting on.",
    "Or it would have had Gibbs not announced his retirement.",
    "(It’s an R+18 when it used to be an R+35.)"
  ]
}