{
  "id": 7791,
  "mediaId": 8484,
  "date": "2022-04-06",
  "headline": "Republican Rep. Bob Gibbs announces he will RETIRE before the midterms and clears the way for Stephanie Grisham's Trump-backed ex-boyfriend to win the GOP primary",
  "image": "https://i.dailymail.co.uk/1s/2022/04/06/16/56294169-0-image-a-52_1649258834101.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10692237/Republican-Rep-Bob-Gibbs-retiring-midterms-face-Trump-backed-primary-challenge.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Elkind",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Elizabeth+Elkind,+Politics+Reporter+For+Dailymail.Com",
  "termIds": [
    5891,
    4905,
    4820,
    1940,
    3124,
    2905,
    2765,
    2595,
    2638,
    1433,
    1126,
    6474
  ],
  "sentences": [
    "+6\nView gallery\nRep. Bob Gibbs, a pro-Trump Republican, has represented Ohio's 7th Congressional District since 2013 and has served in Congress since 2011\n+6\nView gallery\nLast month a newly-redrawn version of Ohio's district map made ex-Trump staffer Max Miller, who had been challenging anti-Trump Republican Rep. Anthony Gonzalez in the May 3 primary, switch to Gibbs' territory\nHe thanked his supporters as well as family and friends, stating he was 'eternally grateful' for his time at the US Capitol.",
    "+6\nView gallery\nTrump praised Gibbs' tenure in Congress shortly after the Ohio Congressman revealed he would be stepping down from the House at the end of 2022\n+6\nView gallery\nThe former president has vehemently endorsed his ex-staffer (pictured together in 2020), which Grisham called a 'gut punch' after her allegations\nThe latest shuffling changed the bounds of the 7th Congressional District that Gibbs had been representing since 2013, after first taking over the 18th District in 2011.",
    "'It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District,' Gibbs said.",
    "'While America still faces considerable challenges, many of which are self-inflicted crises by President Biden and the radical socialist policies in Congress, I am confident in the future of our nation and the prospects of a Republican majority in the House to stop the worst instincts of the Biden administration and the progressive liberal agenda,' Gibbs said.",
    "+6\nView gallery\nMiller was accused of physical violence by his ex-girlfriend Stephanie Grisham, who was one of Trump's press secretaries\nHowever, his outgoing statement takes aim at the Biden administration and makes his case for retirement on his 'confidence' in Republicans to take back the majority in the House of Representatives in November.",
    "Grisham seemed to acknowledge that Miller was the unnamed staffer in question when asked by CNN's Jake Tapper, telling him that 'I didn't put his name in there on purpose because I’ve moved on and if there's anything that I can take away from this experience, it's that I’m almost stronger than ever now.'",
    "'With the support of this district, the continued support of President Trump, and the resources necessary to win, I look forward to taking this first -- and the values of this District -- all the way to Congress as a representative of the people,' Miller said in a March 3 statement.",
    "Rep. Bob Gibbs (R-Ohio) is retiring from Congress at the end of this year, he announced on Wednesday, just weeks after a newly-drawn district map put him in a head-to-head primary race with Donald Trump's former aide Max Miller.",
    "Miller has the backing of the former president, who reasserted his support for the ex-staffer in November after Grisham told CNN that Trump's endorsement despite his alleged knowledge of her accusations felt like a 'gut punch.'",
    "In her book, I'll Take Your Questions Now, Grisham indicates that Miller was known around the White House as the 'Music Man' for his penchant for playing show tunes to calm the former president down when he was upset or angry.",
    "In his announcement to run in the 7th District, Miller made no mention of Gibbs but pointed out that the region 'includes 90% of the area where where I've spent the last year engaging with voters...This is also were I live.'",
    "When the former Trump aide first mounted his Congressional campaign last year, he was up against Rep. Anthony Gonzalez (R-Ohio), one of 10 House Republicans who voted to impeach Trump after the January 6 Capitol riot.",
    "Before running to represent Ohio's 7th Congressional district, Miller was known for a tumultuous relationship with ex-White House Press Secretary Stephanie Grisham when both were working for the Trump administration.",
    "Miller's attorneys filed a 13-page complaint that Grisham's op-ed was just a 'malicious attempt to secure personal financial gain' while trying to sell copies of her White House memoir.",
    "After claimed Trump told her how 'broken up' Miller had been about their breakup, Grisham wrote: 'I told the president that this “great guy” had anger issues and a violent streak.",
    "But since then Ohio's proposed new district map, drawn by the Republican majority, has been reshuffled multiple times and even faced litigation in the state Supreme Court.",
    "In October 2021, Miller's ex Grisham published an op-ed in the Washington Post titled 'I told the Trumps my relationship with a White House staffer had turned abusive.",
    "At the time, Grisham also claimed that Miller took from her a French Bulldog puppy that he'd given her as a birthday present 10 months before their breakup.",
    "Democrats on Ohio's redistricting commission had accused the GOP members of unconstitutionally favoring their own party in its attempts to redraw the map.",
    "His retirement, after serving in Congress for more than a decade, should be celebrated by all,' the former president said through his Save America PAC.",
    "Ohio's Supreme Court has yet to weigh in on the latest iteration, but state officials have decided to move ahead anyway with their May 3 primary.",
    "Gibbs, also a Trump supporter, blasted Ohio's redistricting process as a 'circus' in a statement announcing the end of his time in Congress.",
    "'Thank you to my family, especially my wife Jody, for putting up with the long drives, late dinners, and my weeks away from home.",
    "'He was a strong ally to me and MAGA, voting to support my America First agenda and fighting strongly against the Radical Left.",
    "Gibbs' office did not say whether he would endorse Miller or any other candidate when asked for comment by DailyMail.com.",
    "Miller's lawyer countered that the dog was not bought for her, and that all the animal's paperwork was in Miller's name.",
    "Trump praised the Ohio congressman after news of his retirement broke, though his statement made no mention of Miller.",
    "He has been a fighter for Ohio voters and we should all be thankful for his contribution to our state and our country.",
    "Grisham accused Miller of physically abusing her the day they broke up, after which he filed a defamation suit.",
    "Gibbs is the seventeenth House Republican to leave the lower chamber for retirement or to seek higher office.",
    "I will use this opportunity to spend more time with her, my children, and grandchildren,' Gibbs said.",
    "To that end, after considerable deliberation, I have decided to not seek re-election this year.",
    "'Keeping the dog he bought me for my birthday was the final insult,' Grisham said at the time.",
    "The newly-redrawn borders would put more suburbs in what had been a predominantly rural area.",
    "'I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career.",
    "A favorite song among those was reportedly 'Memory' from Andrew Lloyd Webber's musical Cats.",
    "'Congressman Bob Gibbs has championed Ohio values in Congress for more than a decade.",
    "'After I finished, the president crossed his arms and just said, \"That surprises me.",
    "Like Trump, Miller was equally congratulatory in his reaction to Gibbs' retirement.",
    "Thank you for your service, Congressman,' Miller wrote on Twitter Wednesday.",
    "He publicly thanked the conservative lawmaker for his service in Congress.",
    "Early voting, even with the current map in dispute, began on Tuesday.",
    "I hoped that he would take me seriously, that he would do something.'",
    "This was a difficult decision, one which I did not make lightly.'",
    "'This circus has provided me the opportunity to assess my future.",
    "Thank you for your service, Bob—a job well done!'",
    "I was not some stranger making a wild accusation.",
    "He was really broken up over things\",' she wrote.",
    "Thirty-one Democrats have done the same.",
    "They didn’t seem to care.'",
    "'Who does that?'"
  ]
}