{
  "id": 790,
  "mediaId": 2530,
  "date": "2022-02-25",
  "headline": "The Russian Invasion Of Ukraine Barely Came Up At The First Day Of CPAC",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-02/27/15/campaign_images/771f97982197/the-russian-invasion-of-ukraine-barely-came-up-at-2-1125-1645975324-7_dblbig.jpg",
  "link": "https://www.buzzfeednews.com/article/kadiagoba/cpac-russia-ukraine-invasion-desantis",
  "mediaOutlet": "Buzzfeed",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kadia Goba",
  "authorUrl": "https://www.buzzfeednews.com/author/kadiagoba",
  "termIds": [
    0
  ],
  "sentences": [
    "During an event at Mar-a-Lago Wednesday night, he said Russian President Vladimir Putin is “pretty smart” for “taking over a country for $2 worth of sanctions.”\nSen. Mike Braun, attending the conference Thursday, told BuzzFeed News he wouldn’t exactly go that far himself, but gave his own explanation for the concept.",
    "“If that is kind of convoluted into a compliment — I wouldn't go there — but I think the point being that you have to respect anybody that is a bad player like Putin.”\nJennifer Vitera, an attendee from Colorado, flatly said “no” when asked if she wanted speakers to talk more about the events happening in Ukraine.",
    "It’s disgusting what happened.”\nCPAC organizer Matt Schlapp coined the event “Awake Not Woke” and the speeches centered around more border security, parental oversight in schools, and “medical freedom” — what some Republicans describe as the answer to mask and vaccine mandates.",
    "“Defend our border, then we'll worry about somebody else's border 8,000 miles away from us, you follow me?”\n“It’s extremely important to be fully aware of world events because world events affect local events, affect the United States,” another attendee said.",
    "While criticizing President Joe Biden as a weak leader, Hawley called for him to “open up American trade energy,” a growing rallying point for Republicans in response to the invasion, to lessen the geopolitical power of Russia’s energy supply.",
    "“And oh how we pray for Ukraine and for the people of Ukraine,” Sen. Marsha Blackburn said in a speech Thursday before hundreds of activists and supporters inside Gatlin Ballroom at the Rosen Shingle Creek Hotel, in Orlando, Florida.",
    "“When you're talking about opposition leaders, if the point you're making is that you need to respect what they may or may not do, and you got to anticipate it based upon their prior actions, I think that makes sense,” he said.",
    "A wide range of conservatives gave 10- to 20–minute speeches, including Charlie Kirk and Rep. Andy Biggs, and multiple Republican candidates running for Congress, including Max Miller, Cory Mills, and Mark Walker.",
    "Speakers on the main stage talked about critical race theory, mask mandates, and illegal border crossings, but what was glaringly absent during the first day of CPAC was the biggest news of the day.",
    "Kirk was another one of the few speakers to mention Ukraine at some length onstage, and he mainly did so to say the focus should be on the US’s southern border.",
    "“I really do believe it's tragic and in fact, my daughter-in-law is Ukrainian and she’s suffering a lot at this point in time,” said attendee Cheryl Allen.",
    "ORLANDO, Florida – Republicans at the first day of the Conservative Political Action Conference focused on “the woke mob” even as Russia invaded Ukraine.",
    "After polling the crowd, the sentiment seemed to be that the Russian invasion, while fundamentally wrong, did not require American intervention.",
    "We should not be involved.”\nFormer president Donald Trump, who will give CPAC’s headlining speech on Saturday, has been slightly more outspoken.",
    "“That being said, though, I wish there was as much concern about our borders as there is about the Ukrainian border and our people.”",
    "“I think more so our southern border, I think that's the probably most important for our country right now, what's going on.",
    "Ron DeSantis, the rising Republican who spoke shortly before Blackburn, didn’t mention the crisis at all.",
    "That’s all she said about the Russia–Ukraine conflict, before quickly pivoting into critical race theory.",
    "We're being invaded.”\nSen. Josh Hawley was the rare lawmaker to actually address the crisis onstage.",
    "?I'd rather have our guys on the border here in this country,” William Vreeland told BuzzFeed News.",
    "“I think that they should stick to their agenda,\" Colleen Brown of Connecticut told BuzzFeed News.",
    "So let's talk about other things.”\n“It’s something that’s important,” Rodney Perez said.",
    "Instead, attendees said America should focus on another border: the southern one.",
    "But, I mean, everybody kind of knew it was gonna happen after the Olympics.",
    "“It may sound heartless, but we shouldn't be there,” she said.",
    "“You have to be alert to everything that's going on.",
    "“I don't think it's a shock what happened.",
    "“And everyone else is talking about it.",
    "But the lawmakers know their base.",
    "I think it's absolutely horrible.",
    "Neither did Sen. Ted Cruz.",
    "Should we be involved?",
    "That’s it.",
    "Gov.",
    "No.",
    "“?"
  ]
}