{
  "id": 7946,
  "mediaId": 2630,
  "date": "2022-04-06",
  "headline": "Rep. Bob Gibbs of Ohio, facing Trump-backed challenger, announces retirement",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-bob-gibbs-jm-0858-cced75.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/rep-bob-gibbs-ohio-facing-trump-backed-challenger-announces-retirement-rcna23196",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    4820,
    2905,
    1126,
    1267,
    6474,
    6067
  ],
  "sentences": [
    "Gibbs called the decision to proceed \"irresponsible ... especially in the 7th Congressional District where almost 90 percent of the electorate is new and nearly two-thirds is an area primarily from another district, foreign to any expectations or connection to the current 7th district.\"",
    "MEDINA, Ohio — Rep. Bob Gibbs, R-Ohio, announced his retirement Wednesday, a decision that follows a long and chaotic redistricting process that pushed him into a primary against a first-time candidate endorsed by former President Donald Trump.",
    "Miller, who hails from a Cleveland family well-known for its real estate development and philanthropy, earned Trump's endorsement for Congress last year when he was poised to challenge another GOP incumbent, Rep. Anthony Gonzalez.",
    "Ohio's congressional redistricting process — which has been led by Republicans who've been accused of being too partisan in their mapmaking — eventually resulted in a new 7th District that included the homes of Miller and Gibbs.",
    "But Republicans, who dominate state government, have more power in the new process and have faced repeated challenges from Democrats and other groups who believe the new boundaries remain unfairly favorable to the GOP.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nIn his statement Wednesday, Gibbs did not mention Miller or Trump, reserving his frustration for the redistricting process.",
    "Rep. Fred Upton of Michigan, who like Gonzalez voted to impeach Trump last year, announced Tuesday that he would not seek re-election in a race also upended by redistricting and Trump endorsements.",
    "\"This circus has provided me the opportunity to assess my future,\" Gibbs said in an emailed statement that accused the Ohio Supreme Court of moving too slow in hearing challenges to proposed maps.",
    "Gibbs, 67, is in his sixth term representing Ohio's 7th Congressional District, which for the last decade has covered a largely rural area of Northeast Ohio and several Cleveland suburbs.",
    "But Gibbs' most significant obstacle to a seventh term was former Trump White House and campaign aide Max Miller, one of several other candidates who filed for the May 3 primary.",
    "The state Supreme Court has yet to weigh in on the latest map, but state officials are proceeding with the May 3 primary for all congressional districts.",
    "Gonzalez, one of 10 Republicans who voted to impeach Trump after the 2021 attack on the Capitol, later announced he would not seek another term.",
    "But the former president reinforced his endorsement of Miller last month, a move that ratcheted up pressure on Gibbs to step aside.",
    "He was a strong ally to me and MAGA, voting to support my America First agenda and fighting strongly against the Radical Left.",
    "\"I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career,\" Trump said.",
    "\"To that end, after considerable deliberation, I have decided to not seek re-election this year.",
    "\"His retirement, after serving in Congress for more than a decade, should be celebrated by all.",
    "Trump, who took a victory lap after Upton's decision, praised Gibbs in a statement Wednesday.",
    "In 2018, Ohio voters approved a measure aimed at drawing more competitive districts.",
    "The redrawn district includes less of Gibbs' long-standing turf and more suburbs.",
    "His retirement is the second in as many days by a Republican member of Congress.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "This was a difficult decision, one which I did not make lightly.\"",
    "Gibbs, unlike Gonzalez, has never run afoul of Trump.",
    "Thank you for your service, Bob — a job well done!\"",
    "Early voting began Tuesday."
  ]
}