{
  "id": 8500,
  "mediaId": 8491,
  "date": "2022-04-06",
  "headline": "Ohio’s Bob Gibbs, citing redistricting ‘circus,’ is retiring from Congress",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/04/AP19352807810022.jpg?w=1280",
  "link": "https://www.wkbn.com/news/ohio/ohios-bob-gibbs-citing-redistricting-circus-is-retiring-from-congress/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/?post_type=profile&p=455963",
  "termIds": [
    0
  ],
  "sentences": [
    "Gibbs announced in November that he planned to run for reelection, but the six-term congressman released a statement Wednesday morning saying the slow-moving redistricting “circus” he blames on the court led him to the “difficult decision” to “not seek re-election this year.”\n“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,” Gibbs wrote, “especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.”\nThe redrawn, Republican-favoring district would have pitted Gibbs against GOP primary candidates that include Max Miller, a former White House and campaign aide to Donald Trump who the former president has already endorsed.",
    "His votes included objecting to certifying the presidential electors in Arizona and Pennsylvania, two swing states that Joe Biden won in 2020 despite unsubstantiated claims of election-altering irregularities and fraud.",
    "COLUMBUS, Ohio (WCMH) — U.S. Rep. Bob Gibbs, whose district includes rural parts of central Ohio, will retire from Congress instead of facing a competitive Republican primary in his redrawn district.",
    "The redrawn map for 2022, however, which the Ohio Supreme Court said last week it won’t rule on until after the May 3 primary, changes OH-7 to Cuyahoga, Medina, Wayne and Holmes counties.",
    "Ohio’s 7th Congressional District currently covers Canton, suburban and rural areas southwest of Cleveland and rural local counties Knox and Coshocton.",
    "His largely rural seat has long been comfortably Republican, with Gibbs’ lowest margin of victory in six elections being about 13 percentage points.",
    "He was born in Indiana, raised in the Cleveland area, and he graduated from Ohio State University’s agricultural campus in Wooster.",
    "After Gibbs announced his retirement, Trump congratulated him on his career, calling Gibbs “a strong ally” in a statement.",
    "Gibbs voted with Trump’s position 95% of the time, according to the political data website FiveThirtyEight.",
    "Gibbs, 67, was first elected to Congress in 2010 after spending eight years in the Ohio legislature.",
    "He won in 2022 with 67% of the vote."
  ]
}