{
  "id": 9670,
  "mediaId": 2909,
  "date": "2022-03-25",
  "headline": "Biden Blunders on the World Stage",
  "image": "https://deneenborelli.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-25-at-1.19.31-PM-copy.jpg",
  "link": "https://deneenborelli.com/2022/03/biden-blunders-on-the-world-stage/",
  "mediaOutlet": "deneenborelli.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Deneen Borelli",
  "authorUrl": "https://deneenborelli.com/author/deneenborelli/",
  "termIds": [
    4905,
    4591,
    6526,
    6678
  ],
  "sentences": [
    "Biden then traveled to Poland to visit U.S. troops and commented about the bravery of Ukrainians fighting for their country, saying, “You’re going to see when you’re there.”\nBut numerous times, Biden ruled out the option of U.S. military involvement.",
    "What makes you think Vladimir Putin will alter course based on the action you’ve taken today,” and Biden said, “sanctions never deter.”\nThe reporter repeated the question and Biden became testy, saying, “That’s not what I said.",
    "While addressing the troops, Biden called Defense Secretary Lloyd Austin the Secretary of State, and also incorrectly stated the number of times he went to Iraq and Afghanistan.",
    "The answer’s no.”\nHowever, a video montage of Biden’s administration, including Vice President Kamala harris, contradicts him.",
    "President Biden traveled to Europe to meet with world leaders this week and made a series of blunders on the world stage.",
    "Biden continues to show the world he is a horrible leader and not ready for prime time.",
    "Biden met with NATO allies in Brussels over the Russian invasion of Ukraine.",
    "Biden said food shortages are “going to be real” because of sanctions.",
    "The world is a far more dangerous place because Biden is president.",
    "At a press briefing, Biden was asked, “Sir, deterrence didn’t work.",
    "Biden addressed the president of Poland as ambassador.",
    "Upon arrival at the meeting, Biden snubbed the press.",
    "Critics commented on social media.",
    "You’re playing a game with me."
  ]
}