{
  "id": 20,
  "mediaId": 124,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "Trump is sitting on a fortune. Republicans want it for the midterms.",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-04/220401-donald-trump-hug-flag-2019-ac-1137p-b8c15d.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/trumps-fundraising-eyed-gop-wants-midterms-rcna22640",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1384,
    1563,
    1895,
    2006,
    2249,
    3085,
    3087,
    3094,
    183,
    428,
    545,
    571
  ],
  "sentences": [
    "House 2\nTheodore Budd\nN.C. Senate\nElise Stefanik\nN.Y. House 21\nAdam Laxalt\nNev. Senate\nMax Miller\nOhio House 7\nTimothy Scott\nS.C. Senate\nDiana Harshbarger\nTenn. House 1\nChuck Fleischmann\nTenn. House 3\nMichael Mccaul\nTexas House 10\nAugust Pfluger\nTexas House 11\nRonny Jackson\nTexas House 13\nBeth Van Duyne\nTexas House 24\nRoger Williams\nTexas House 25\nMichael Burgess\nTexas House 26\nMichael Cloud\nTexas House 27\nJohn Carter\nTexas House 31\nPat Fallon\nTexas House 4\nAlex Mooney\nW. Va. House 2\nJoe Kent\nWash. House 3\nDerrick Van Orden\nWis. House 3\nHarriet Hageman\nWyo.",
    "Senate\nLauren Boebert\nColo. House 3\nAnna Paulina Luna\nFla. House - Undetermined\nGus Bilirakis\nFla. House - Undetermined\nByron Donalds\nFla. House - Undetermined\nMichael Waltz\nFla. House - Undetermined\nMarco Rubio\nFla. Senate\nHerschel Walker\nGa. Senate\nMichael Crapo\nIdaho Senate\nCharles Grassley\nIowa Senate\nJerry Moran\nKan. Senate\nRand Paul\nKy. Senate\nJulia Letlow\nLa.",
    "Then-President Donald Trump at CPAC 2019 in National Harbor, Md.Tasos Katopodis / Getty Images file\nFor the most part, Trump has concerned himself with picking winners in Republican primaries, a tactic that could produce a crop of loyalists in Congress and state offices come November but may have little bearing on the GOP winning governing majorities.",
    "Trump's constant mining for cash for his own super PAC  he often sends out multiple solicitations a day  means it's more likely small-dollar donors have been bled dry and are less inclined to give to other Republican candidates, as one GOP operative who asked to remain anonymous to avoid drawing the former president's wrath told NBC News.",
    "One national GOP strategist, who spoke on the condition of anonymity because they were not authorized to speak on this subject, said that Trump \"has an opportunity to do a very positive thing\" by investing in battlegrounds that Republicans plan to compete in, which would help him build up \"goodwill\" among party faithful.",
    "\"It pisses me off,\" said Dan Eberhart, a GOP donor based in Arizona, who noted that Trump isn't even making more than a perfunctory direct contribution to help the allies who have secured his endorsement, much less the candidates the party will rely on to try to win majorities.",
    "Though current fundamentals show the GOP on the verge of significant gains this fall, some Republicans worry the party could leave House and Senate seats on the table if Trump doesn't dig deeper into his war chest to help battleground candidates in the coming months.",
    "House At Large\n Show more\nNotes\n*Dropped out of race\nSource: Federal Election Commission\nGraphic: Nigel Chiwaya / NBC News\nTrump has pitched in by headlining big-dollar fundraising dinners for the House GOP's campaign arm  and will do so again in the near future.",
    "The calls on where the former president's money could be used to good effect for Republican candidates would be made on a district-by-district basis if Trump had any intention of parting with larger sums of cash, the former Trump campaign official said.",
    "Cheney, who drew Trump's ire by voting to impeach him over the Jan. 6 attack on the Capitol and by joining the House panel investigating the riot, raised $7.2 million last year and had $4.7 million in the bank when the reporting period closed Dec. 31.",
    "In one instance, because Florida hasn't finished redrawing its congressional lines for the midterms, it remains to be seen whether Anna Paulina Luna, a Trump-endorsed and -funded candidate, will find herself in one of the NRCC's battlegrounds.",
    "\"If you're a Republican running in a swing seat, are you a little annoyed that a bunch of money is going to be wasted on Liz Cheney in a Republican seat instead of winning those swing seats that will get us a majority in the House?\"",
    "The vast majority of that money has gone to Republicans running in safe seats, or against incumbents he detests, rather than competitive races likely to help determine which party wins the House and Senate in November's midterms.",
    "Trump's decision to invert the purpose of a super PAC  spending limited amounts on other candidates while stockpiling cash that could be used in his own potential 2024 presidential bid  doesn't sit well with many Republicans.",
    "And there's no reason to expect Trump that will change his approach in order to assist fellow Republicans, a second former campaign adviser said on the condition of anonymity to avoid angering the former president.",
    "\"And if there are seats left on the table because he is stockpiling hundreds of millions of dollars and not spending it to help candidates,\" this person said, \"then that will leave a bad taste in people's mouths.\"",
    "In the 72 battleground districts identified by the National Republican Congressional Committee last week, Trump had donated to only two candidates: Ryan Zinke in Montana and Derrick Van Orden in Wisconsin.",
    "Through his \"Save America\" super PAC in support of Republicans, Trump doled out just $205,000 to 41 federal candidates through Feb. 28, the last date covered by his most recent campaign finance disclosure.",
    "WASHINGTON  Former President Donald Trump is sitting on more than $110 million in campaign cash at a time when his party is trying to win control of Congress  and it's starting to irk some in the GOP.",
    "\"He does not share well when it comes to money,\" this person said in an interview, speaking on the condition of anonymity so as to not incur backlash from the former president and those in his orbit.",
    "This week, the National Republican Senatorial Committee announced it raised $43 million in the first quarter and $13.28 million in March alone, the most it has raised for each in its history.",
    "Republican campaign veterans and Trump insiders say they are disappointed but not surprised by what they describe as a combination of stinginess and selfishness by the former president.",
    "They are watching him rake in money from persistent email solicitations to the party's small-donor base and at VIP receptions connected to a full schedule of campaign-style rallies.",
    "One former Trump campaign official said there was no way Trump would \"spend any money on these people in midterms,\" adding that the former president was raising money for himself.",
    "\"This next election is going to be a referendum on Joe Biden and the Democrats' absolute failure on the economy and crime, on the border, on everything else they've touched.\"",
    "But he hinted at the duality of Trump's shadow in the midterms: He's both the most powerful force in the GOP and a potential anchor for some candidates in swing districts.",
    "\"All the money that he's raising for himself, it's not going to candidates,\" said former Rep. Barbara Comstock, R-Va, who has long been critical of the former president.",
    "In South Carolina's 1st Congressional District, Rep. Nancy Mace, R-S.C., drew Trump's ire by criticizing him over Jan. 6  even though she didn't vote to impeach him.",
    "In Wyoming, where Trump endorsed Harriet Hageman in her GOP primary bid against Rep. Liz Cheney, Hageman raised less than $750,000 through the end of 2021.",
    "Beyond the direct contributions to campaigns, which are limited by federal law, a super PAC can spend unlimited sums independently to help candidates.",
    "She's facing two primary opponents, one of whom  Katie Arrington  has had trouble gaining traction despite a full-throated endorsement from Trump.",
    "\"I'm really grateful for his help doing that,\" the NRCC's chairman, Rep. Tom Emmer, R-Minn., said on a conference call with reporters last week.",
    "And House Minority Leader Kevin McCarthy, R-Calif., announced he raised $31.5 million in the first quarter and $104 million this cycle.",
    "With Trump sitting on his millions, national Republican fundraising operations have been able to bring in large hauls of their own.",
    "In the weeks since the latest disclosure, Trump has endorsed a handful of additional candidates who are battling for swing seats.",
    "\"I think they [Republicans] are seeing that it's all about him and that he doesn't care about Republicans winning a majority.\"",
    "Forty-one national campaigns have recieved $5,000 each from former President Trump's Save America political action committee.",
    "The next report, due April 20, is likely to show that Trump made donations in at least a handful more of these districts.",
    "That's evident, she said, in Trump's focus on backing primary challengers to Republican incumbents who have crossed him.",
    "And they see a man stockpiling a war chest for another presidential run instead of using his prowess to boost the party.",
    "Incumbent\nPrimary challenger\nCandidate\nRace\nMo Brooks\nAla. Senate\nKelly Tshibaka\nAlaska Senate\nRick Crawford\nArk.",
    "His endorsement typically comes with a check for $5,000  the maximum direct contribution the super PAC can make.",
    "In addition to the federal candidates, \"Save America\" has spread $145,500 to 29 hopefuls at the state level.",
    "\"He hasn't spent any money to win any election\" in which he's not the candidate, the former adviser said.",
    "Senate\nSteve Carra*\nMich. House - Ended campaign\nJohn Gibbs\nMich. House 3\nRyan Zinke\nMont.",
    "\"There are districts where Trump can hurt the Republican candidate,\" the source added.",
    "In some cases, candidates blessed by Trump have struggled to raise money on their own.",
    "\"You identify the races where the Republicans can win and Trump polls well,\" he said.",
    "\"No one is counting on him spending that money to help the party,\" this person added.",
    "A Trump representative did not respond to a request for comment from NBC News.",
    "Mace collected $3 million and had $1.5 million left at the end of last year.",
    "\"This next election is not about President Trump,\" Emmer said.",
    "McCarthy has transferred more than $37 million to the NRCC.",
    "I don't think Trump's team cares much about doing it.\"",
    "But there are more districts where he can help them.",
    " I don't think Trump's team knows how to do it.",
    "\"That is a huge problem,\" the operative said.",
    "And so you'd be targeting those districts.",
    "\"But he's been helpful in other ways.\"",
    "\"There's no question about that.",
    "Who has Trump given money to?",
    "House 1\nMatt Rosendale\nMont.",
    "Comstock asked rhetorically.",
    "House 1\nJohn Boozman\nArk.",
    "House 5\nJohn Kennedy\nLa.",
    "\"It's pretty selfish.\""
  ]
}