{
  "id": 2229,
  "mediaId": 63,
  "date": "d2022-03-18T13:14",
  "headline": "Checks & Imbalances: NRA Campaign Filing Confirms Ransomware Attack",
  "image": "https://imageio.forbes.com/specials-images/imageserve/623484eec00f730b5ddcafbf/0x0.jpg?format=jpg&width=1200&fit=bounds",
  "link": "https://www.forbes.com/sites/zacheverson/2022/03/18/checks--imbalances-nra-campaign-filing-confirms-ransomware-attack/",
  "sentiment": "0.0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    661,
    1135,
    1241,
    2006,
    2409,
    189,
    341,
    418,
    524,
    2661
  ],
  "sentences": [
    "lobbyists connect Ukraine officials with powerful allies to help in war against Russia? (CNBC)\nLobbying giant works to connect Ukraine officials with U.S. leaders after representing Russian bank as war rages on? (CNBC)\nRussian Oligarchs Find Ally In America's Small Business Lobby? (The Daily Poster)\nMaryland attorney registers as Ukrainian weapons helper? (LegiStorm)\nFederal and state lobbying spending soared to $10 billion during the 2020 election cycle, but state lobbying disclosure remains limited? (OpenSecrets)\nHouse Republicans who challenged Biden's win are losing lots of corporate cash? (Reuters)\nShutout for feds in straw donor trial? (Politico)\nStock ban showdown in Congress delayed after Rep. Zoe Lofgren gets COVID-19? (Insider)\nSenator Sheldon Whitehouse just reported buying up to $50,000 of $TSLA (Tesla) stock in January, and now advocates for taxes on oil company profits.? (Twitter/Congress Trading)\nCongressional Trading in 2021? (Unusual Whales)\nTrump-backing congressmen and a top DC lobbyist will make their own luck at a St. Patrick's Day political fundraiser? (Insider)\nNew in lobbying: Embattled Pegasus Israeli spyware maker NSO Group taps former Bill Clinton press aide Steve Rabinowitz and Bluelight Strategies for $50,000/month? (Twitter/Julian Pecquet of the Africa Report)\nHunter Biden Paid Tax Bill, but Broad Federal Investigation Continues? (The New York Times)\nClimate Activists Flex Their Political Muscle? (The New York Times)\nAdams quietly undoes de Blasio-era lobbying disclosure requirement? (Politico)\nSen.",
    "At the time, the NRA tweeted that it does not discuss matters relating to its physical or electronic security,? but that it takes extraordinary measures to protect information regarding its members, donors, and operations.?\nIn a filing made with the Federal Election Commission on Friday to explain why it needed to amend some reports, however, the NRA's Political Victory Fund admitted that the NRA had in fact been the victim of a ransomware attack:\nOn October 20, 2021, our sponsoring organization was victim of a ransomware attack that took our network offline for over two weeks.",
    "*****\nLast Thursday, the FEC asked the campaign for Joe Kent, a Washington state Republican running for Congress, for more details about expenditures from the candidate's personal funds on behalf of the committee.? Kent's sole disbursement on the report in question was $10,600, which was described as In-kind: Travel, airfare, lodging, parking.?\nTracking Trump\nThe National Shooting Sports Foundation is returning to Trump's D.C. hotel for its annual import/export conference in August, according to an email the group sent potential attendees.",
    "The Totally Dodgy Backstory of the Bank that Just Refinanced Trump Tower? (Rolling Stone)\nSaudi-Backed Golf League Plans Tournament at Trump's New Jersey Course? (Mother Jones)\nCritics accuse CPAC of becoming pay-to-play as Trump loyalists gain power? (The Guardian)\nOhio Senate hopeful Mike Gibbons is latest to score Trump meeting at Mar-a-Lago? (NBC News)\nDemocratic group complains Trump funding presidential campaign illegally? (Reuters)\nEditor's Picks\nU.S.",
    "As for government employees addressing customers of the then-president's hotel at past conferences, Oliva said, There have been no issues or concerns to my awareness of federal employees attending.?\nFormer President Donald Trump is effectively ruling out tapping former Vice President Mike Pence as his running mate should he mount a third White House bid in 2024 and win the Republican nomination,? the Washington Examiner reported on Wednesday.",
    "[He's] just another customer.?\nGregory Garrabrants, the CEO of Axos Bank of San Diego, which financed the Trump Tower mortgage, is also a political backer of his client, having contributed $50,000 to Republican campaigns, including $9,600 in support of Trump since 2012, according to records with the Federal Election Commission.",
    "*****\nIn response to threats from Iran, the State Department is spending approximately $2 million a month to protect former Secretary of State Mike Pompeo and another $175,000 a month to keep former Special Representative for Iran Brian Hook safe, according to a report to Congress reportedly seen by the Washington Examiner.",
    "Forbes continues to update Tracking Trump: A Rundown Of All The Lawsuits And Investigations Involving The Former President.? Among the latest developments: former tenants of rent-controlled apartments owned by Trump's father Fred allege the ex-president and some of his family members committed fraud and racketeering.",
    "In Case You Missed It\nTrump Political Supporter Chairs Company That Issued Title Insurance On New $100 Million Trump Tower Mortgage\nThe chairperson of the title insurer for Donald Trump's new $110 million mortgage of Trump Tower, billionaire William Foley II, is a major political supporter of the former president.",
    "A new FEC filing shows CFG paid Breitbart $25K for anti-McCrory ads.? (Twitter/Brendan Fischer of It's Documented)\nIn Closing\nWe have been captured by the thieves of the night\nHeld for ransom if you please\nHeaven help the devil may he have a few unpleasant memories?\n Gordon Lightfoot, Heaven Help the Devil?",
    "Menendez discloses his wife's pot of gold? (LegiStorm)\nJudge imposes $61K penalty on Omarosa for failing to file financial disclosure? (Politico)\nLast week, Breitbart broke that Club for Growth's super PAC would be dropping $10M against Pat McCrory in the NC Senate primary.",
    "In response, DeSantis called Disney woke? and accused the company of doing the bidding of Communist China.? Nobody ever said taking on Florida's political machine was for the feint of heartwhich may be why so few companies in the tourism industry have done it.",
    "When our Information Security team brought our network back online, the process was undertaken slowly and carefully, with the end result that we did not have full access to our network and the internet until the second week of November.",
    "Oopsies\nRebuilding America Now, a pro-Trump super PAC founded in 2016 and linked to Paul Manafort and Trump business associate Tom Barrack, told the FEC it would develop and enforce internal controls? in a filing earlier this month.",
    "NSSF fielded requests for proposals from several venues in Washington, D.C. and Trump International Hotel offered the most cost-effective, competitive rate,? he said, declining to disclose what that rate was.",
    "Disney CEO Bob Chapek's initial refusal to publicly criticize the so-called Don't Say Gay' bill passed by Florida's legislature drew swift and intense backlash from both outside and within the company.",
    "*****\nKelliPAC, a super PAC associated with Arizona GOP chair and subpoena recipient from the January 6 committee Kelli Ward, filed its February report 19 days late, according to records with the FEC.",
    "Documents recorded last week with New York City's Department of Finance identify Fidelity National Title Insurance Company as the organization that notified the city about the transaction.",
    "In October 2021, a Russian cybercriminal group called Grief claimed to have hacked the NRA and posted 13 of the organization's files to a site on the dark web, reported NBC News.",
    "Campaign finance reports show that Disney donated roughly $4.8 million to Florida candidates on both sides of the aisle, including $50,000 directly to Governor Ron DeSantis.",
    "NSSF's decision to host the conference at Trump International Hotel in Washington, D.C., was based on a best cost estimate, according to Mark Oliva, NSSF's spokesperson.",
    "Today, I've got a newsletter-exclusive update on that National Rifle Association hackplus another on the billionaire behind Donald Trump's $100 million mortgage.",
    "Continuing Irresolutions\nUpdates on Checks & Imbalances' previous reporting\nJurors heard the opening statements in the trial of Rep. Jeff Fortenberry (R-Neb.)",
    "The PAC's newfound commitment to processes and procedures came via a resolution with the FEC, after the committee's former treasurer misappropriated $278,000.",
    "NSSF relocated its conference to the then-president's hotel in 2019 and returned there in 2021 after canceling the 2020 renewal because of the pandemic.",
    "Thanks For Reading Checks & Imbalances\nThis is the Thursday, March 17, edition of the Checks & Imbalances newsletter, sent Mondays and Thursdays.",
    "Acampaign filing the NRA's political action committee made last week confirmed that the group did indeed suffer a ransomware attack last fall.",
    "Peter Sadowski, the chief legal officer for that firm's parent company, Fidelity National Financial, confirmed it issued the title insurance.",
    "Then came a cleanup,? reports Suzanne Rowan Kelleher for Forbes:\nChapek announced that Disney would pause all political donations in Florida.",
    "Former National Security Advisor John Bolton also has been receiving Secret Service protection, reportedly in response to the same threat.",
    "Since 1998, Foley has donated about $4 million to GOP campaigns, including $493,000 in support of Donald Trump, according to FEC records.",
    "The Forerunner: A Memoir by Congresswoman Cori Bush? will reach booksellers on Oct. 3, publisher Alfred A. Knopf announced on Monday.",
    "Visit Florida and Visit Orlando, the state's two largest tourism organizations, tout their pro-LGBTQ bona fides at every opportunity.",
    "While members of the House are not allowed to receive book advances, Bush signed her deal before being sworn in earlier this year.",
    "During the network restoration process, one batch of credit card receipts was not processed correctly into our donor database.",
    "KelliPAC didn't provide the FEC with an explanation for the delay nor did a spokesperson immediately respond to an inquiry.",
    "The CEO of the bank that financed the loan also donated to Trump's campaigns, as Checks & Imbalances previously reported.",
    "The Missouri Democrat's advance paid her more than $50,000 in 2020, according to a disclosure she filed in August 2021.",
    "Neither Foley nor politics had anything to do with the company's involvement in Trump's new mortgage, Sadowski said.",
    "It is simultaneously notable and unsurprising that neither organization has commented publicly on the bill.",
    "The 2022 agenda is not yet available, but in the past, government officials have spoken at the event.",
    "Pence's Great America Committee PAC spent $237,000 at Trump's D.C. hotel in 2018 through 2019.",
    "Foley founded Fidelity National Financial in 1984 and still serves as its chairperson.",
    "The article didn't mention that Breitbart would be getting a cut of that $10M.",
    "Fortenberry has denied the government's allegations that he lied to the FBI.",
    "Will Florida's Don't Say Gay' Law Hurt Its $97 Billion Tourism Industry?",
    "A spokesperson for the NRA did not immediately respond to an inquiry.",
    "During that time, we were not able to access email or network files.",
    "His campaign reported spending $158,000 on legal fees last year.",
    "Please support this work, if you can, by subscribing to Forbes.",
    "The PAC reported no contributions or disbursements that month.",
    "Fortenberry also launched a legal expense trust in August.",
    "To make sure you don't miss an issue, subscribe.",
    "And you can follow me on Twitter at @z_everson.",
    "Welcome to the Checks & Imbalances newsletter.",
    "A spokesperson for Axos declined to comment.",
    "Email me at zeverson@forbes.com.",
    "on Thursday, reported KOLN.",
    "Any tips or suggestions?",
    "Let's dive in.",
    "It's free.",
    "Thanks!"
  ]
}