{
  "id": 2230,
  "mediaId": 223,
  "date": "d2022-03-12T20:00",
  "headline": "Missiles Fired at U.S. Consulate in Iraq Reportedly Came from Iran",
  "image": "https://media.townhall.com/townhall/reu/ha/2016/133/6787b84c-3164-4a0f-96c0-11aaf51329e4.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/03/12/missiles-fired-at-us-consulate-in-iraq-n2604487",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    1020,
    2006,
    2125,
    38,
    2637,
    2655,
    2716,
    2717,
    2924,
    2930,
    2945
  ],
  "sentences": [
    "Joe Kent, a retired Green Beret who is running to challenge Rep. Jaime Herrera Beutler in the Republican primary to represent Washington's 3rd district, shared that the attack \"is how the Iranians thank Biden for wanting to get back in the Iran deal.\"",
    "The official, who spoke on condition of anonymity because information was still coming in, said it was still not certain exactly how many were fired and exactly where they landed.",
    "The Iraqi security officials said there were no immediate report of casualties from the attack, which occurred shortly after midnight and caused material damage in the area.",
    "The attack comes as negotiations in Vienna over Tehran's tattered nuclear deal hit a pause? over Russian demands about sanctions targeting Moscow over its war on Ukraine.",
    "Reports, as well as video footage, have indicated that several long-range ballistic missiles have been fired at the U.S. consulate in Erbil, Iraq.",
    "Though reports are still coming in, with security officials from Iraq and the United States cited as saying there are no casualties at this time.",
    "The Iran deal may have something to do with it:\nOne of the officials said the ballistic missiles were fired from Iran, without elaborating.",
    "As Guy reported more recently though, on Friday, the deal could be headed for failure, considering even House Democrats are opposed to it.",
    "On Sunday, Iran's state-run IRNA news agency quoted Iraqi media acknowledging the attacks in Irbil, without saying where they originated.",
    "Last week, it appeared a deal was close to being reached for the United States to rejoin the Joint Comprehensive Plan of Action (JCPOA).",
    "From Abdul-Zahra's report:\nEarly reports suggested there were no U.S. military casualties, a senior U.S. defense official said.",
    "The attack comes several days after an Israeli strike near Damascus, Syria killed two members of Iran's Revolutionary Guard.",
    "Writing for the Associated Press, Qassim Abdul-Zahra reported that at least six missiles have hit the consulate.",
    "Despite Vladimir Putin's unprovoked invasion of Ukraine, Russia also looks to be involved in the agreement.",
    "Source: AP Photo/Karim Kadim\nThe United States may find itself involved in another foreign policy crisis.",
    "Iran's foreign ministry strongly condemned the attack Wednesday and vowed revenge.",
    "As a result of the missles, \"Erbil\" and \"#Iraq\" have been trending on Twitter.",
    "The United States left in May 2018, under then President Donald Trump.",
    "They spoke on condition of anonymity in line with regulations.",
    "It also wasn't clear if there were other casualties.",
    "..."
  ]
}