{
  "id": 2233,
  "mediaId": 19,
  "date": "3/7/2022 12:00:00 AM",
  "headline": "Exclusive  Challenger Joe Kent: GOP Incumbent Is Totally Chamber of Commerce'",
  "image": "https://media.breitbart.com/media/2021/06/Joe-Kent-for-Congress-serious-facebook-640x480.jpg",
  "link": "https://www.breitbart.com/economy/2022/03/07/challenger-joe-kent-gop-incumbent-totally-chamber-commerce/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Neil Munro",
  "authorUrl": "https://www.breitbart.com/author/neil-munro/",
  "termIds": [
    2125,
    2344,
    2344,
    2125,
    13,
    13,
    544,
    544,
    545,
    545,
    428,
    428,
    2717,
    2717,
    2535,
    2535,
    2945,
    2945
  ],
  "sentences": [
    "I made a lot of direct action, going active, and kicking in doors, and then all the way working with the local forces trying to train Iraqis and Yemenis and guys in Africa  I fought in the second battle of Fallujah [which] would be the most prominent name that most people would recognize.?\nAs long as we can state what the national security interest is, I'm okay with using force.",
    "One of the best things that we can do is tighten up the labor market and when we tighten up the labor market, we're tightening it up in favor of the American employees so that they can really have a chance to negotiate for decent-paying jobs.?\nThis corporate preference for migrants is alienating some Americans from manual labor, he argued.",
    "The supply chain issue has exposed that this [policy] simply isn't safe  There's a very kitchen-table case to be made for saying, Hey, look, we do need to bring back a lot of these jobs in these industries to the district.' People understand the economy is not going well, so they recognize this would be a good thing for our economy.",
    "Between outsourcing, killing off our timber industry or fishing industry, just overregulation in general  [and] we used to have a decent amount of semiconductor advanced microchip production in the district, that's gone.?\nThe supply chain issues  gives us a really unique opportunity to have way more honest discussions,? Kent said.",
    "We invented the tech industry in Silicon Valley last time I checked.?\nI also reject the narrative that, Hey, there are jobs that Americans simply won't do, and so we have to bring in all these people primarily from South America to do these manual labor jobs.' I just don't think that's accurate at all,? he continued.",
    "[We need to] frame this in terms of this being a working-class [and] middle-class kitchen-table issue that affects Janet and Jack down the street, [who are up against] the Blackrocks [Wall Street investment firms] of the world [and] these major corporations that have the Beltway under their grasp,? Kent concluded.",
    "But then we find that when we actually get there, when we have our degrees  all these white-collar jobs that people promised us just aren't there  and now it's incredibly difficult to be able to get a decent job that you can provide for a family.?\nThe debate cannot be limited to economics, Kent asserted.",
    "There's a very common sense and compassionate case to be made for America First economics.?\nThe government's failure to help American families at home is especially sharp for Kent, who accomplished 11 overseas tours fighting for his government's open-ended goals in distant Iraq and Afghanistan.",
    "We just have to really point out that the visas that they are giving out are directly designed to take jobs away from Americans, either Americans that have college degrees and work in tech, or Americans that could be doing decent entry-pay, manual-labor type of jobs.",
    "President Donald Trump signs an executive order to try to bring jobs back to American workers and revamp the H-1B visa guest worker program during a visit to the headquarters of tool manufacturer Snap-On on April 18, 2017 in Kenosha, Wisconsin.",
    "We have to do something a little better with our culture of saying that Hey, this country was built by people who did really hard unsexy labor, there is a lot of value in very difficult manual labor, and there's nothing wrong with doing that.",
    "We say the whole premise of us having a government and us having borders is that we are trying to do the best we can  for our people, and this is a moral obligation.?\nI say the same thing about onshoring in our industry.",
    "I was a private in the infantry and that's about as blue-collar as it gets and it's good to pay your way.?\nMany advocates for migration say technology companies need foreign workers because Americans cannot do the work.",
    "Right now the poll if the race was held, the incumbent wouldn't even make it out of the primaries.?\nThe district has been hit hard by the one-two export of jobs and inflow of foreign contract workers, he said.",
    "Republican Joe Kent is running on a populist platform for a seat in Congress, but first he must win his Washington state GOP primary against incumbent Rep. Jaime Herrera Beutler and her corporate donors.",
    "I should take out loans and it would be worth it, and if I was really smart, I'd get a job in the tech industry [although] I had to go to one of the big cities and the big hubs to make that happen.",
    "So, yeah, she's totally Chamber of Commerce.?\nThe concerns of ordinary people have to be at the center of a normal economy, not corporate interests and failed government promises, Kent said.",
    "They say, Hey, Americans don't STEM very well,' so every time a foreigner comes to one of our colleges and graduates with a tech degree, we need to staple an H-1B visa on the back of it.",
    "A major problem is the federal government's policy of allowing technology companies to import their own workforce instead of hiring many Americans in the district, he said.",
    "So she is completely beholden to the $5,000 PAC [political action committee] checks and then the Super-PAC money that comes in from the special interest groups.",
    "Herrera Beutler has been a bipartisan leader voters can count on to get results,? said Dan Conston, president of the Congressional Leadership Fund Super PAC.",
    "It is something, I think, that we haven't done a good job of on the right is talking about the moral obligation that we have to our own people,? he said.",
    "She's getting money from Google, she's getting money from Amazon, she's voting for amnesty  she's supporting H-1B visas,? Kent told Breitbart News.",
    " The military-industrial complex is always going to say we have to have a massive deployment of troops like what's going on in Ukraine,? Kent said.",
    "So I think this is a very, very populist issue that we can bring people to the table, especially with inflation being absolutely out of control.",
    "We're leading in fundraising, with $1.3 million [in the bank], all raised through individual contributions, no corporate PAC money,? Kent said.",
    "That's why they're all about this unchecked legal and illegal immigration, because it allows them to undercut working and middle-class wages.",
    "We shipped all of our jobs overseas, we made it impossible to leave high school and get a decent-paying job that you can support a family on.",
    "It's just that this country exists to protect our own people, and this is what any country that's compassionate will actually do,? Kent said.",
    "In 2019, his widely-admired wife, Shannon Kent, was killed by a suicide bomber in Iraq, leaving two children with just their father.",
    "Herrera Beutler, however, won the district by 13 points in 2020, aided by $800,000 of spending by one corporate-funded Super PAC.",
    "But just having this blank check where we stay and we start getting into nation-building, that's where I have some heartburn.",
    "She's a complete corporatist  If you look at her [donations] report, she gets very little money in individual contributions.",
    "[Gross Domestic Product] Or  and I argue this strongly  are we a sovereign nation-state that cares deeply about our people?",
    "The American working class  it's white, it's black, it's Latino, it's the most diverse class that we have,? Kent continued.",
    "We have probably about three generations of data on the catastrophic effect that that's had on the American working class.",
    "The House district in southwest Washington State voted for Donald Trump by 8 points in 2016 and almost 4 points in 2020.",
    "That's why you see this harmony between your typical Country Club Republicans and your typical Country Club Democrats.",
    "But if [hiring migrants] just wasn't an option for employers, they would have to pay Americans for doing the jobs.",
    "The work visas, especially the H-1B visas for the tech workers, has been a huge issue in our district,? he said.",
    "I was in Iraq for the vast majority of it as [a Green Beret infantryman], including the bad years,? he said.",
    "Are we simply just in an economy where we always do what is in the best interest of the economy and the GDP?",
    "Look how it's failed  we can't get things in the grocery store in the most developed country in the world.",
    "(Scott Olson/Getty Images)\nKent is ahead in the polls, according to a Trafalgar poll released February 15.",
    "[Advocates for migration] say, Oh, you guys are being racist and heartless.' No, it's not that at all.",
    "The way that we've destroyed so many different families and so many lives is absolutely immoral.",
    "I'm 41, and since the time I was a kid, I was told that I had to go to college,? he said.",
    "We've had a cultural issue here where some Americans do think they are above some jobs.",
    "I grew up as middle class as I possibly could but I joined the Army when I was 18.",
    "Really, it's just an assault on the working class and the middle class,? he said.",
    "I can't think of anything that's more condescending or insulting to Americans.",
    "Trump endorsed Kent, in part, because Herrera Beutler voted to impeach Trump.",
    "Major corporations and Wall Street gain from cheap imported labor, he said.",
    "But Kent sharply disagreed, saying, I just completely reject that notion.",
    "The poll showed Kent with 26 percent, and Herrera Beutler at 22 percent.",
    "We've done that on the altar of free trade,? he said.",
    "That's what [the employers] are trying to prevent.",
    "Look, this experiment of globalism has failed.",
    "Hey, what is the purpose of having a country?",
    "Everything she gets is a corporate paycheck.",
    "You hear Republicans make this case a lot.",
    "It is the same thing with immigration.",
    "The primary takes place August 22.",
    "It's the corporate donor class."
  ]
}