{
  "id": 2242,
  "mediaId": 163,
  "date": "2/14/2022 12:00:00 AM",
  "headline": "U.S. Republicans try to out-Trump each other with tough border rhetoric ahead of election",
  "image": "https://www.reuters.com/resizer/_mGys1tiizaFmF8IL9ZdMSwVmPs=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/CHP62V6KOZPLTMFDHC4KRRHNCY.jpg",
  "link": "https://www.reuters.com/world/us/us-republicans-try-out-trump-each-other-with-tough-border-rhetoric-ahead-2022-02-14/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Ulmer",
  "authorUrl": "https://www.reuters.com/authors/alexandra-ulmer/",
  "termIds": [
    1147,
    1172,
    2006,
    2087,
    2125,
    2217,
    2379,
    428,
    2550,
    2945
  ],
  "sentences": [
    "Nonetheless, NumbersUSA, a hawkish advocacy group that pushes for lower levels of immigration, said it had received more responses than usual to an election-year survey it conducts among candidates to rate them on their hardline immigration stances - suggesting candidates are eager to establish their Trump-esque credentials.",
    "The tougher border proposals pushed by Abbott's challengers demonstrate how Republican candidates are trying to out-Trump each other on an issue that remains a powerful galvanizing force for the party's primary voters, despite economic issues and tensions around COVID policies dominating headlines.",
    "WASHINGTON, Feb 14 (Reuters) - In the past year, Texas Governor Greg Abbott has deployed thousands of National Guard troops to the southern U.S. border, begun building a new border barrier, and arrested migrants for allegedly trespassing on private property.",
    "Liberal advocacy groups say Republicans are demonizing migrants who come to the United States seeking refuge, distorting the economic effects of immigration, and trying to capitalize on xenophobic fears over the fate of the country's white majority.",
    "Allen West, a former Republican U.S. congressman, says Texas should arrest and deport immigrants who enter the United States illegally - something states do not have the power to do - if the federal government refuses to act.",
    "Candidates can tap into voter outrage over record-high attempted border crossings and the cost of providing public services to migrants, a message amplified by the country's popular conservative media like Fox News.",
    "Trump rewrote the party's immigration playbook after he successfully campaigned in 2016 on building a border wall and blocking the entry of refugees, often employing nativist language to describe his goals.",
    "Analysts say Washington's voting system, where candidates of all parties appear on the primary ballot together and the top two vote-winners advance to the general, will favor moderates like Herrera Beutler.",
    "'EVERY STATE IS A BORDER STATE'\nAs Republican candidates work to burnish their hardline immigration credentials, some are turning to Stephen Miller, the architect of Trump's restrictive immigration agenda.",
    "Republicans across the country have made immigration a major focus heading into the Nov. 8 congressional election, where Democrats risk losing control of Congress, stymieing Biden's legislative agenda.",
    "Abbott spokesperson Renae Eze rejected criticism of the governor's immigration record, saying that Texas had been forced to step up after Biden \"abdicated\" his responsibilities to safeguard the border.",
    "And for Republicans in competitive primaries, a tough stance on immigration is a way to differentiate themselves without risking backlash from voters, said Alex Conant, a Republican strategist.",
    "Miller is formally advising Republican hedge fund CEO David McCormick in his campaign for a U.S. Senate seat in Pennsylvania and informally speaking with other candidates, he told Reuters.",
    "Don Huffines, a businessman and former state senator, wants to close Texas' bridges with Mexico to most inbound traffic and deploy the entirety of the state's National Guard to the border.",
    "\"We need to have a full immigration moratorium,\" said Trump-endorsed Joe Kent, an Army veteran running in a Washington state primary against U.S. Representative Jaime Herrera Beutler.",
    "CALLS FOR MORE ACTION\nSome 68% of Republicans in Texas say border security or immigration are the top issues facing the state, according to an October 2021 University of Texas poll.",
    "But as Abbott runs for a third term, conservative candidates challenging him in a March 1 Republican nominating contest contend he is still not tough enough on illegal immigration.",
    "The two-term Republican governor has taken the lead in opposing Democratic President Joe Biden's immigration reforms, earning him an endorsement by former President Donald Trump.",
    "\"No issue grabs the attention of Republicans like immigration and border security do,\" said James Henson, director of the Texas Politics Project at the University of Texas.",
    "Lake, a former Fox News anchor, wants to forge an alliance among like-minded states to deport immigrants in the United States illegally, which is a federal responsibility.",
    "The attacks from his right flank show how even the staunchest Republican border hawks face pressure to be ever more stringent on the issue in the run-up to the election.",
    "While opinion polls show Abbott has a sizable lead over both West and Huffines, he will likely face the most competitive gubernatorial primary of his career.",
    "McCormick last week visited the Arizona town of Yuma near the Mexican border - some 2,400 miles (3,900 km) from Pennsylvania's capital Harrisburg.",
    "The current election cycle shows Trump's influence persists even after losing the presidency in 2020 - and that some candidates are going further.",
    "In Arizona, Kari Lake, the Trump-endorsed Republican frontrunner for governor, agrees with Texas' border crackdown but has vowed to go further.",
    "And while Republicans broadly approve of Abbott's immigration policies, according to surveys, the polling suggests they want even more action.",
    "McCormick entered the race for the U.S. Senate seat in Pennsylvania about a month ago and public polling has yet to gauge his standing.",
    "\"Every state is a border state when Joe Biden and his administration incentivize illegal immigration,\" he said in a written statement.",
    "Some Republican primary candidates are even taking aim at legal immigration, once a major plank of the party's pro-business stance.",
    "Kent says too many tech jobs are being taken by H-1B visa holders, a skilled-worker program whose recipients are majority Indian.",
    "Republican primary voters have a seemingly \"unlimited appetite\" for tough immigration measures, Henson added.",
    "\"A couple years ago it used to be, 'Legal immigration good, illegal immigration bad.'",
    "That used to be the Republican mantra,\" said Deputy Director Chris Chmielenski.",
    "Lake narrowly leads the field of Republican candidates for Arizona governor.",
    "The \"porous border\" shows how Abbott's approach has failed, West argues.",
    "It remains to be seen if enough voters will back the hardliners.",
    "\"You're starting to see less of that.\""
  ]
}