{
  "id": 225,
  "mediaId": 129,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "The G.O.P.'s Putin Wing'",
  "image": "https://static01.nyt.com/images/2022/04/07/multimedia/07-THE-MORNING-NL-PROMO/merlin_182362635_dea19ca6-751e-4fc7-9f60-b02525c050d4-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/07/briefing/republican-party-putin-wing.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2006,
    3094
  ],
  "sentences": [
    "Joe Kent, who is trying to win a primary over a House Republican who voted to impeach Trump over the Jan. 6 riot, called Putin's demand to control part of eastern Ukraine very reasonable.?\nIn some cases, Russian state television has shown its appreciation for these kind words toward Putin.",
    "We could use that on our southern border.?\nIn recent days, Trump has shifted to a more mixed message, both saying that Putin should negotiate a peace agreement and praising him as driven.? Trump has also encouraged Putin to release negative information on Biden's family.",
    "Representative Liz Cheney, the Wyoming Republican and frequent Trump critic, describes it as the Putin wing of the G.O.P.? It both admires him as a strong leader and likes his right-wing nationalism, including his opposition to NATO, Western liberalism and L.G.B.T.",
    "Political advocacy groups affiliated with Charles Koch have also questioned why the U.S. is levying harsh sanctions on Russia and have suggested that a Ukrainian victory is not in America's interest, as Judd Legum of the Popular Information newsletter has reported.",
    "Koch Industries, the conglomerate whose controlling family is a major funder of Republican candidates and conservative causes, has said it would continue to operate in Russia even as many Western companies have left.",
    "President Volodymyr Zelensky's government is corrupt, she claimed (without offering evidence), and is in power only because the Obama administration helped overthrow the previous regime (which is not true).",
    "State of the War\nRussia has withdrawn its forces from around Kyiv and Chernihiv in the north and has sent them to Belarus and Russia to prepare for the war's next phase, according to the Pentagon.",
    "Ukraine simply doesn't matter to America's security or our prosperity.?\nMarjorie Taylor Greene, a far-right Georgia congresswoman, has criticized both Russia's invasion and Ukraine's government.",
    "Three players are especially worth watching:\nShohei Ohtani, Los Angeles Angels: Ohtani, who draws comparisons to Babe Ruth as a pitcher who hits home runs, is the game's most exciting player.",
    "As a candidate, president and ex-president, Trump has repeatedly praised Putin, calling him strong,? savvy? and genius.? Trump has also echoed Putin's ideology, by harshly criticizing NATO.",
    "Senator Lindsey Graham has called Putin's defenders outliers,? while Kevin McCarthy, the Republican leader in the House, has described Putin as an evil dictator who is murdering people.",
    "Matt Rosendale, a Montana congressman, called Zelensky a less-than-forthright president of the Ukraine.?\nFormer Trump administration officials have echoed their boss's comments.",
    "Yet Trump's effect on Putin's popularity has not entirely disappeared: There is still a meaningful faction of Republican elites who feel an affinity for the Russian president.",
    "He is very savvy, very shrewd.? Peter Navarro, who was a Trump economic adviser, said that Ukraine was not really a country? because it used to be part of the Soviet Union.",
    "That's because the National League has adopted the designated hitter  allowing other players to bat in place of pitchers  nearly 50 years after the American League did.",
    "Max Scherzer, New York Mets: Scherzer, who has been named the league's best pitcher three times, joined a Mets roster that already had an elite starter, Jacob deGrom.",
    "It has aired clips of Carlson's show, defended Trump from what it calls unfair attacks by the American media and suggested that Trump should become president again.",
    "If anything, many Republican voters say they wish the Biden administration would take more aggressive action to help Ukraine, according to the Pew Research Center.",
    "Has Putin ever called me a racist??\nCarlson has also promoted a false rumor, popular in Russia, accusing the U.S. of funding biological weapons labs in Ukraine.",
    "And Trump remains a leading contender to win the 2024 Republican nomination, which suggests the party's Putin-friendly faction may not remain on the fringe.",
    "A man who dominated a group of young people he met after moving into a dorm at Sarah Lawrence College was found guilty of extortion and sex trafficking.",
    "Tucker Carlson, the host of one of cable television's highest-rated shows, has suggested that American liberals represent a bigger threat than Putin.",
    "The House voted to find the Trump allies Peter Navarro and Dan Scavino in contempt of Congress for not cooperating with the Jan. 6 investigation.",
    "In their own words\nIn the days leading up to the invasion, Trump praised Putin for recognizing Ukraine's economic and strategic value to Russia.",
    "A YouGov poll in January found that Republicans viewed Putin more favorably than they viewed President Biden, Kamala Harris or Nancy Pelosi.",
    "Lives Lived: Eric Boehlert was a veteran journalist who was a fierce critic of right-wing misinformation and hypocrisy in the news media.",
    "The invasion has exhausted a large portion of Russia's ground forces, and the Kremlin is scrambling to find enough combat-ready troops.",
    "More on Ukraine\nBA.2, an Omicron subvariant, is driving an increase in cases in New York City, but hospitalizations are still steady.",
    "Wander Franco, Tampa Bay Rays: The normally thrifty Rays signed Franco, a shortstop, to a lucrative deal after only his first season.",
    "The Minneapolis police officer who shot and killed Amir Locke, a Black man, during an apartment raid will not face criminal charges.",
    "Some Biden administration officials tested positive after attending the Gridiron Club dinner, a black-tie event in Washington.",
    "It might be worth asking yourself, since it is getting pretty serious, what is this really about?? Carlson said in February.",
    "These comments are consistent with Carlson's history of arguing that the U.S. should align itself with Russia over Ukraine.",
    "A Times classic: What our critic saw bingeing Game of Thrones.?\nAdvice from Wirecutter: Try a muscle-pummeling massage gun.",
    "The United States can and should do very little for Ukraine,? Will Ruger, the president of a Koch-funded group, has said.",
    "Politics\nThe Supreme Court reinstated a Trump administration rule limiting states' power to enforce the Clean Water Act.",
    "Jon Shields once opposed campus safe spaces.? Now he thinks open inquiry requires taking students' discomfort seriously.",
    "I think we should probably take the side of Russia, if we have to choose between Russia and Ukraine,? he said in 2019.",
    "Putin's invasion of Ukraine has changed the situation, damaging his popularity in the U.S., even among Republicans.",
    "Douglas Macgregor, another administration official, said that Russian forces had been too gentle? with Ukraine.",
    "Donald Trump turned Vladimir Putin into a popular figure among a significant segment of Republican voters.",
    "MORNING READS\nK.B.J.'s nomination: Black women at Harvard Law School reflect on Ketanji Brown Jackson.",
    "We are literally walking in her shoes.?\nUntz untz: Explore Germany's new museum dedicated to techno.",
    "Thousands of Ukrainians are fleeing the Luhansk and Donetsk regions before fighting escalates there.",
    "A Turkish court moved the trial in the murder of the journalist Jamal Khashoggi to Saudi Arabia.",
    "season preview\nThe Major League Baseball season, delayed by a labor fight, finally begins today.",
    "Some conservative rallies have taken on a religious bent, blending prayer with political anger.",
    "I have enormous respect for him,? Mike Pompeo, the former secretary of state, said of Putin.",
    "It is affecting coverage by the most important news source for Republicans voters: Fox News.",
    "For now, this wing remains on the party's fringe, with little ability to affect policy.",
    "Taking their cue from Trump, some Republican voters began to view Putin more favorably.",
    "A judge found a man not guilty in the first acquittal connected to the Jan. 6 riot.",
    "It seems to be shaping the behavior of another major corporation: Koch Industries.",
    "Unearthed footage: How a local TV station found a clip of Prince at 11 years old.",
    "The wild fox that roamed around Capitol Hill and bit several people had rabies.",
    "He may also be the only pitcher to hold a bat with any frequency this season.",
    "Western officials say Russia is recruiting mercenaries and Syrian fighters.",
    "The pangrams from yesterday's Spelling Bee were organizing and razoring.",
    "The U.N. established the World Health Organization 74 years ago today.",
    "They will need his preternatural batting talent to compete in the A.L.",
    "I don't really care what happens to Ukraine one way or another,? J.D.",
    "Here's today's Mini Crossword, and a clue: Inclined (five letters).",
    "East: The Yankees, Blue Jays and Red Sox all have strong lineups.",
    "She has argued that the U.S. should not send weapons to Ukraine.",
    "Both liberals and conservatives failed them, says Ross Douthat.",
    "At least two Republican candidates have made similar comments.",
    "The duo could be fearsome once deGrom returns from an injury.",
    "If you're in the mood to play more, find all our games here.",
    "Opinions\nMany vaccine-hesitant Americans were persuadable.",
    "Thanks for spending part of your morning with The Times.",
    "He's going to go in and be a peacekeeper,? Trump said.",
    "But the G.O.P.'s Putin wing still has influence.",
    "On the Modern Love podcast, City Hall marriages.",
    "Here is today's puzzle  or you can play online.",
    "It's unclear what endemic Covid will look like.",
    "Vance, who is running for Senate in Ohio, said.",
    "Today's newsletter looks at this faction.",
    "The Mets are now outspending the Yankees.",
    "This will most likely end the last case.",
    "Endemic diseases can take many forms.",
    "The Daily? is about Covid in Africa.",
    "draws anything at your command.",
    "Will they also outplay them?",
    "Why do I hate Putin so much?",
    "SPORTS AND IDEAS\nAn M.L.B.",
    "Here's today's Wordle.",
    "See you tomorrow.",
    "DALL-E: This A.I.",
    "He died at 57.",
    " David\nP.S.",
    "rights."
  ]
}