{
  "id": 2256,
  "mediaId": 237,
  "date": "1/17/2022 12:00:00 AM",
  "headline": "A top GOP House candidate in Georgia says election doubts still driving voters",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/940695_s_1642171782296.png",
  "link": "https://www.washingtonexaminer.com/news/a-top-gop-house-candidate-in-georgia-says-election-doubts-still-driving-voters",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://www.washingtonexaminer.com/author/emily-brooks",
  "termIds": [
    2354,
    2354,
    2250,
    2250,
    2131,
    2131,
    2214,
    2214,
    2365,
    2365,
    2396,
    2396,
    2503,
    2503,
    905,
    905,
    717,
    717,
    815,
    815,
    1090,
    1090,
    1053,
    1053,
    1145,
    1145,
    1096,
    1096,
    1248,
    1147,
    1147,
    1609,
    1609,
    1335,
    1335,
    1248,
    2087,
    2074,
    2034,
    2034,
    2074,
    2010,
    2010,
    2087,
    2095,
    2095,
    2125,
    2125,
    2005,
    2005,
    1901,
    1901,
    1614,
    1614,
    1765,
    1765,
    562,
    571,
    562,
    571,
    615,
    615,
    428,
    428,
    545,
    545,
    459,
    459,
    146,
    146,
    145,
    145,
    255,
    255,
    2550,
    2550,
    2672,
    2672,
    2953,
    2953,
    2910,
    2910,
    2834,
    2834
  ],
  "sentences": [
    "Until we make sure that people are confident, they're going to go back to vote,? Collins said, adding that Democrats' election reform proposals are a political stunt.?\nBut it is also a personal concern for Collins, who is finding success with his campaign in a crowded field to replace Republican Rep. Jody Hice, who is running for secretary of state rather than seeking a fifth term.",
    "But that does not necessarily mean he is part of the Republican establishment.?\nCollins said that he and firebrand Georgia Republican Rep. Marjorie Taylor Greene think a lot alike,? as far as their approach to Congress, and he sees himself fitting in with her as well as Reps. Matt Gaetz of Florida, Jim Jordan of Ohio, and Jim Banks of Indiana.",
    "It's going to come from the right, too.?\nHe was one of two Republican candidates, along with Joe Kent of Washington, to attend a September Justice for J6? rally in support of alleged participants of the Jan. 6 Capitol riot still in Washington, D.C., jails.",
    "Full campaign finance reports for 2021 are not due until Jan. 30, but Federal Election Commission data show that Collins had a significantly larger war chest than the rest of the primary field as of Sept. 30.\nThis election was stolen,? Collins said.",
    "But with just over four months until primary election day, Collins boasts a number of high-profile endorsements: former House Speaker Newt Gingrich, former Sen. Rick Santorum, and former national security adviser Gen. Michael Flynn.",
    "I just called him and said, Look, man, we've got a big change of plans.'?\nHe also has a different perspective than former 2020 Democratic presidential candidate Andrew Yang on the threat that automation poses to truckers.",
    "As Democrats in Washington turn their attention to election overhaul legislation, a top Republican contender for an open ruby-red Georgia House seat says that election issues are still a top concern for Republicans, too.",
    "If we counted the legal votes that were cast in the state of Georgia, you're going to find Donald Trump won the state.?\nCollins is the owner of a trucking company, which he grew from just one truck to 115 over 31 years.",
    "Among Collins's primary opponents is Paul Broun, a physician who preceded Hice in representing Georgia's 10th Congressional District in Congress from 2007 to 2015 and unsuccessfully ran for Senate in 2014.",
    "He handed day-to-day operations of the company over to his twin sons a few years ago and has since been taking flying lessons, but that's taken a back seat to his political ambitions.",
    "Some analysts think that dynamic led to a drop-off in Republican voters from Election Day 2020 to the Senate runoff on Jan. 5, 2021, that resulted in victory for Democratic Sens.",
    "And Collins has said that he will not support House Minority Leader Kevin McCarthy to be speaker of the House come 2023. You need new blood every once in a while,? Collins said.",
    "1 is still the elections out here,? Mike Collins, a candidate in a crowded primary for Georgia's 10th Congressional District, told the Washington Examiner in an interview.",
    "Collins is the son of the late former Rep. Mac Collins, who was a Georgia congressman from 1993 to 2005 and previously ran for the seat in a runoff against Hice in 2014.",
    "Georgia's 10th Congressional District, which stretches from east of the Atlanta metropolitan area to the South Carolina state line, is heavily Republican-leaning.",
    "Collins raised just under $1 million in 2021 since his campaign launch in May and ended the year with $751,155 in cash-on-hand, according to his campaign.",
    "Whoever wins the May 24 primary, or June 21 runoff if no candidate with at least 50% of the vote, will almost certainly represent the district in 2023.",
    "They don't trust the machines.?\nPart of his concern is that loss of trust in elections among the Republican base could keep people from voting.",
    "You better go to Washington with a warrior mentality, with the understanding that you're going to try to be knocked down,? Collins said.",
    "Hice, who narrowly defeated Collins in a runoff for the seat in 2014, endorsed Georgia State Rep. Tim Barr to be his replacement.",
    "Other candidates include former Trump administration official Patrick Witt and former Henry County Tax Commissioner David Curry.",
    "Broun also unsuccessfully sought to represent Georgia's 9th Congressional District, now held by Rep. Andrew Clyde, in 2020.",
    "I even had already put money down on the plane, had it inspected, was ready to give him my money,? Collins said.",
    "An early December poll from SoCo Strategies found Collins with a 15-point lead over the rest of the field.",
    "I mean, we don't have near as many horses pulling buggies out there.?\nHe is not a political newcomer.",
    "Jon Ossoff and Raphael Warnock  a pair of wins that gave Democrats their current Senate majority.",
    "He would be open to a meeting with McCarthy to discuss it, though.",
    "That includes a $400,000 personal loan to his own campaign.",
    "And then it's not always going to come from the far-left.",
    "We can't be scared of technology,? Collins said.",
    "I'm securing what I have here,? Collins said.",
    "It may change the way it looks.",
    "I'm secure in who I am.",
    "They don't trust them.",
    "The No."
  ]
}