{
  "id": 68,
  "mediaId": 163,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump",
  "image": "https://www.reuters.com/resizer/R11fj6ljwZ_iLcQ2QSQqLvrW_z4=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/UOWRDOFVJVIVXNFDCOTUHGAQFA.jpg",
  "link": "https://www.reuters.com/legal/government/republican-us-lawmakers-funnel-money-colleagues-who-crossed-trump-2022-02-01/",
  "sentiment": "0",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Ulmer",
  "authorUrl": "https://www.reuters.com/authors/alexandra-ulmer/",
  "termIds": [
    1901,
    2006,
    2125,
    3094
  ],
  "sentences": [
    "Alexandra Ulmer\nU.S. National Affairs Correspondent who spent four years in Venezuela covering President Maduro's administration and the humanitarian crisis and has also reported from Chile, Argentina and India, she was Reuters Reporter of the Year in 2015 and a leading member of a team that won an Overseas Press Club award for best coverage of Latin America in 2018.",
    "The former president, who still holds a strong grip over his party after a contentious four years in office that ended in January 2021, has labeled those who voted against him in the impeachment battle as RINOs - Republicans In Name Only - and has urged challengers to seek to topple them in party nomination contests.",
    "Representatives August Pfluger of Texas, Virginia Foxx of North Carolina, Byron Donalds of Florida and Carlos Gimenez of Florida - who each have been endorsed by Trump in their re-election bids for this year - also transferred money to impeachment voters from their campaigns or leadership committees.",
    "At least 71 Republican members of the House of Representatives and Senate transferred money to the campaigns of seven House Republicans who voted to impeach Trump on a charge of incitement of insurrection arising from last year's Capitol riot and Senator Lisa Murkowski, who voted to convict him.",
    "Cheney and Murkowski both are facing Republican primary challengers endorsed by Trump, as is Representative Fred Upton of Michigan, another Republican who voted to impeach Trump and took contributions from the leadership committee of Representative Cathy McMorris Rodgers of Washington.",
    "Feb 1 (Reuters) - Republican U.S. lawmakers donated more than $380,000 last year to the campaigns of eight colleagues who Donald Trump is trying to drive from office, prioritizing the goal of regaining control of Congress over the former president's desire for vengeance.",
    "Scalise gave money in September to at least three House members who voted to impeach Trump: Peter Meijer of Michigan and Jaime Herrera Beutler of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "EYE OF THE TIGER\nThe contributions ranged from $2,000 to $5,000 and came from Scalise's re-election campaign committee or from his \"Eye of the Tiger\" fundraising group, a so-called leadership committee that lawmakers use to support other candidates.",
    "A week after the deadly Jan. 6, 2021, attack on the Capitol by a mob of Trump's supporters, the House voted to impeach him, with the Senate then falling short of the super-majority needed to convict him and bar him from future public office.",
    "3 House Republican after Cheney was ousted from her post following her vote to impeach Trump, made a $5,000 contribution to Herrera Beutler from her \"E-PAC\" leadership committee, which Stefanik uses to support Republican women candidates.",
    "Election experts said these contributions to colleagues reflect a long-standing practice among lawmakers to share money freely to help their party secure a majority, with incumbents typically seen as having the best chances of winning.",
    "Nonetheless, congressional Republicans are donating to colleagues who Trump has disparaged as \"disloyal\" and \"losers,\" according to financial disclosures filed with the Federal Election Commission ahead of a Monday deadline.",
    "The group also gave $10,000 to the campaign of Murkowski, who is the only one of the Republican senators who voted to convict Trump in his Senate impeachment trial last year who is seeking re-election this year.",
    "Cheney, the scion of a storied Republican family and the most forceful Trump critic in Congress, received $5,000 from McConnell's \"Bluegrass Committee\" fundraising group.",
    "Joe Kent, a U.S. Army veteran endorsed by Trump to unseat Herrera Beutler, said the lawmakers backing the incumbent are hoping Trump's movement \"will just go away.\"",
    "Scalise also transferred money in December to the re-election campaign of Dan Newhouse of Washington, a House Republican who also voted for impeachment.",
    "The incumbents targeted by Trump ended 2021 with more money in their campaign war chests than any of their challengers, including those backed by Trump.",
    "Trump's efforts to brand a swath of the party as an enemy faction, Albert added, in part represents \"showmanship or, really, political marketing.\"",
    "A Trump spokesperson and representatives for Scalise, Stefanik, McConnell and McMorris Rodgers also did not respond to requests for comment.",
    "Three House lawmakers targeted by Trump already have dropped out of their races following public backlash from Republican leaders.",
    "2 House Republican, and a group aligned with Mitch McConnell, the Senate Republican leader, were among those making the donations.",
    "\"It's very much a strategic consideration,\" said political scientist Zachary Albert of Brandeis University in Massachusetts.",
    "The company and law firm names shown above are generated automatically based on the text of the article.",
    "Republicans are trying to take over one or both chambers in the Nov. 8 congressional elections.",
    "President Joe Biden's fellow Democrats control both the House and Senate with slim majorities.",
    "We welcome feedback, which you can provide using the feedback tab on the right of the page.",
    "Representative Elise Stefanik, who replaced Representative Liz Cheney as the No.",
    "We are improving this feature as we continue to test and develop in beta.",
    "If they do so, they could torpedo Biden's legislative agenda.",
    "\"2022 is a referendum on the establishment,\" Kent said.",
    "Their offices did not respond to requests for comment.",
    "Steve Scalise, the No."
  ]
}