{
  "id": 8197,
  "mediaId": 43,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "Previous Guy recruits a GOP that will crime for him and divert attention from his prosecution",
  "image": "https://images.dailykos.com/images/1024191/story_image/FIb1xUHVgAIqLSG1?1641509947",
  "link": "https://www.dailykos.com/story/2022/2/1/2077715/-2022-the-shoot-that-couldn-t-gang-straight-Trump-seeks-GOP-who-will-crime-for-him",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    815,
    1147,
    1218,
    1767,
    1888,
    2006,
    3085,
    3087,
    3686,
    5527,
    5772,
    5970,
    428
  ],
  "sentences": [
    "Duty To Warn  (@duty2warn) February 1, 2022\nx\nOf the 93 candidates endorsed by Trump for 2022 so far, a majority of them have questioned the 2020 election results, according to an NBC News analysis.https://t.co/ZM17HYahZZ pic.twitter.com/BrPkY57Omn\n Meet the Press (@MeetThePress) January 14, 2022\nHouse of Representatives\nGus Bilirakis of Florida\nLauren Boebert of Colorado\nVern Buchanan of Florida\nMichael Burgess of Texas\nSteve Carra of Michigan\nJohn Carter of Texas\nMichael Cloud of Texas\nAndrew Clyde of Georgia\nRick Crawford of Arkansas\nMario Diaz-Balart of Florida\nByron Donalds of Florida\nPat Fallon of Texas\nChuck Fleischmann of Tennessee\nVirginia Foxx of North Carolina\nJohn Gibbs of Michigan\nCarlos Gimnez of Florida\nPaul Gosar of Arizona\nHarriet Hageman of Wyoming\nDiana Harshbarger of Tennessee\nRonny Jackson of Texas\nJoe Kent of Washington\nAnna Paulina Luna of Florida\nMichael McCaul of Texas\nMax Miller of Ohio\nMary Miller of Illinois\nAlex Mooney of West Virginia\nGary Palmer of Alabama\nAugust Pfluger of Texas\nMatt Rosendale of Montana\nBeth Van Duyne of Texas\nDerrick Van Orden of Wisconsin\nRoger Williams of Texas\nMike Waltz of Florida\nRyan Zinke of Montana\nSenate\nJohn Boozman of Arkansas\nMo Brooks of Alabama\nTed Budd of North Carolina\nMike Crapo of Idaho\nChuck Grassley of Iowa\nRon Johnson of Wisconsin\nJohn Kennedy of Louisiana\nAdam Laxalt of Nevada\nJerry Moran of Kansas\nHerschel Walker of Georgia\nRand Paul of Kentucky\nMarco Rubio of Florida\nTim Scott of South Carolina\nKelly Tshibaka of Alaska\nwww.msn.com/...\nx\nA series of recent Trump comments and disclosures  including his discussing federal agencies seizing voting machines  have stripped away any pretense that 1/6 was anything but the culmination of his single-minded pursuit of retaining power.",
    "pic.twitter.com/hptzSdPVeP\n SPIES&VESPERS (@SpiesVespers) February 1, 2022\nFlorida Man Again Calls Immigrants 'Snakes' but doesn't yet fall from a tree\nx\nIt's so cold in Florida, frozen iguanas are falling from the trees https://t.co/MnEK6BkZYj\n ABC 7 Chicago (@ABC7Chicago) January 31, 2022\nx\nTrump Again Calls Immigrants Snakes  Using Lyrics From A Black Civil Rights Activist https://t.co/Ti7tYfdNia\n #TuckFrump (@realTuckFrumper) January 31, 2022\nTrump has always inaccurately referred to the story as a poem.",
    "x\nNEW: The 84 people who signed bogus documents claiming that Trump won the 2020 election include 7 current candidates for public office, 8 current office holders, and at least 5 previous state and federal office holders https://t.co/87rNWY6ns0\n Kira Lerner (@kira_lerner) January 31, 2022\nx\nWARNING: Election-integrity nonprofit States United Action has a new tracker for 2022 races--2/3 of contests for governor & sec of state & 1/3 for state AGs include an \"election denier\" GOP candidate.",
    "emptywheel (@emptywheel) February 1, 2022\nTheres really not all that much new in the story as laid out here, except that a bunch of people who know their communications are in the FBIs hands (and, in the case of Costello, who has spent the last nine months reviewing the content of those communications, including those Byrne describes Powell claiming to have sent Rudy) providing updated versions of the least-damning story they can tell here.",
    "White House aides who participated in the meeting, including White House chief of staff Mark Meadows and counsel Pat Cipollone, also pushed back intensely on the suggestion of naming Powell as a special counsel to investigate voter fraud allegations Trumps own administration has dismissed (or, as seems more feasible, hiring her in the administration for some kind of investigatory role).",
    "I actually think the American public is dramatically underplaying how significant and dangerous this is, he said, because we cannot process the basic truth of what we are learning about President Trumps efforts  which is weve never had a president before who fundamentally placed his own personal interests above the nations.",
    "Story >https://t.co/7Pzjd7VTDI\n Shane Goldmacher (@ShaneGoldmacher) February 2, 2022\nThen, The New York Times reported this week that Mr. Trump himself had directed his lawyer, Rudolph W. Giuliani, to ask the Department of Homeland Security whether it could legally seize voting machines in three key swing states.",
    "Not only did he review  and withhold  a bunch of communications before sharing some with the Select Committee, but once the Select Committee figured out that Meadows had violated the Presidential Records Act by failing to turn over those communications he conducted on his personal  but his emails!",
    "But historians say the episodes and Mr. Trumps new comments acknowledging his determination to stay in power  and his effective embrace of the Jan. 6 rioters at the Capitol, who he said must be treated fairly  have newly underscored the fragility of the nations democratic systems.",
    "I waved in General Flynn and Sidney Powell on the Friday night of the 18th  for which Mark Meadowss office revoked my guest privileges, Mr. Ziegler said on a podcast, adding that he had done so because he was frustrated with the current counsel Mr. Trump was getting.",
    "If only Pence had a spine, a pair of testicles, or a modicum of self-respect ... if only ... sigh ...\n Duty To Warn  (@duty2warn) January 31, 2022\nx\nIs now a good time to mention Maria Butina's former boyfriend was urging Trump to seize voting machines?",
    "Jeffrey Engel, director of the Center for Presidential History at Southern Methodist University, said voters were understandably desensitized, if not numb, after a year in which Mr. Trump methodically sought to undermine faith in the electoral process.",
    "When Mr. Flynn, Ms. Powell and Mr. Byrne arrived at the White House to discuss their plan to use the military to seize voting machines, they were not let into the Oval Office by a typical gatekeeper, like Mark Meadows, Mr. Trumps chief of staff.",
    "www.nytimes.com/...\nx\nWhat's NEW is that Rudy and Sidney Powell (and those she conspired with) know that FBI have their comms, and Mark Meadows is busy trying to avoid PRA and obstruction crimes by providing his comms from the event to NARA.",
    "Rs & Ds, know these candidates & defeat them.https://t.co/TrywBu2D52\n Jackie Calmes (@jackiekcalmes) February 1, 2022\nx\nWe now know that Trump's advisers (co-conspirators) drafted two versions of an executive order to seize voting machines.",
    "https://t.co/Z13uAprMkZ\n John W. Dean (@JohnWDean) January 30, 2022\nx\nAfter Trump's daily delusional diatribe today, I find myself wishing Mike Pence would issue an appropriate rebuttal statement himself.",
    "read.gov/...\nTrump has hijacked a civil rights activists lyrics to serve his own racist and xenophobic ends, his daughter Africa Brown complained to Don Lemmon on CNN in an interview in 2018.",
    "pic.twitter.com/hgy4sE5eF0\n Michael Worley (@michaelworley) January 31, 2022\n www.documentcloud.org/...\nx\nTrump is sending a signed copy of his new book \"If I Did It\" to Merrick Garland.",
    "The sisters told Lemon that they had sent cease-and-desist letters to Trump to stop using their fathers lyrics beginning during his first campaign, but that they were ignored.",
    "NARA, of course, has been ordered by a court to share such communications, even the ones that Trump might otherwise have invoked Executive Privilege over, with the Committee.",
    "That guy  the former Chief of Staff who also was getting and sending a bunch of texts on his phone  that guy has also spent some time recently reviewing his communications.",
    "Daughter Maggie Brown characterized Trumps political agenda as supporting separatism, racism, sexism ... thats polar opposite to what Oscar Brown Jr. was about.",
    "Mr. Trump also raised, in an Oval Office meeting with Attorney General William P. Barr, the possibility of the Justice Departments seizing the machines.",
    "All Trump did today was create a convoluted argument that what he wanted Pence to do wasn't illegal, because isnt that what you do in racketeering.",
    "devices, Meadows has been spending time trying to find such communications so he can share them with the National Archives to uncommit some crimes.",
    "https://t.co/tbt4GST3SL\n The Lincoln Project (@ProjectLincoln) January 30, 2022\nx\nThis is beyond being a demagogue to the stuff of dictators.",
    "Rather, they were escorted in by Garrett Ziegler, a young aide to another Trump adviser, Peter Navarro, according to Mr. Zieglers account.",
    "She said she was absolutely outraged that late fathers words are being stolen to promote [Trumps] hate message and intolerance, she said.",
    "She said it was wrenching to see Trump repeatedly pull her fathers lyrics from his breast pocket to quote his words verbatim every time.",
    "Brown, who died in 2005, based the lyrics on the Aesop fable The Farmer and the Viper, illustrating that kindness can be betrayed.",
    "If thinking Americans dont understand what Trump is doing and what the criminal justice system must do we are all in big trouble!",
    "The 11/6 Committee doesn't have a template, but there are some great lawyers on that committee and great lawyers on their staff.",
    "Every Trump endorsee for 2022 and 2024 needs to be asked how far they would go to break the Constitution in the name of Trump.",
    "In fact, each time he tells the tale, hes reading song lyrics written in 1963 by Black civil rights activist Oscar Brown Jr.",
    "Meadows shows up in yesterdays NYT story only as not being the one who let Powell and Flynn and Byrne in the White House.",
    "The Farmer knew how deadly the Snake could be, and yet he picked it up and put it in his bosom to warm it back to life.",
    "As he drew his last breath, he said to those standing around:\n Learn from my fate not to take pity on a scoundrel.",
    "In fact, she said, its Trump who is the living embodiment of the snake that my father wrote about in that song.",
    "x\nPer Patrick Byrne, Sidney Powell told Rudy in real time that all this was documented in texts and emails.",
    "As CNN described it in the 2020 version of the story (but NYT did not), Mark Meadows was also involved.",
    "The Snake soon revived, and when it had enough strength, bit the man who had been so kind to it.",
    "If they weren't destroyed, DOJ would have both sides of those comms in their possession.",
    "The Farmer & the Snake\n A Farmer walked through his field one cold winter morning.",
    "The song was further popularized by R&B singer Al Wilson five years later.",
    "Frozen iguanas drop from trees  come back to life when they warm up.",
    "They are frozen iguanas ready to awake as election day approaches.",
    "One directed DOD to do so, the other one directed DHS to do so.",
    "Elizabeth de la Vega (@Delavegalaw) January 31, 2022\nx\nCorrect.",
    "Her father, she said, always worked with all people of color.",
    "www.huffpost.com/\nx\nRon DeSantis spokesperson tweeted this.",
    "On the ground lay a Snake, stiff and frozen with the cold.",
    "Failure to confront a tyrant only encourages bad behavior.",
    "The bite was deadly and the Farmer felt that he must die.",
    "The fascistic underpinnings of this are just galling.",
    "Just one more key part of the story that has changed.",
    "emptywheel (@emptywheel) February 1, 2022\nx\nI agree.",
    "Cheri Jacobus (@CheriJacobus) February 1, 2022",
    "One brainchild of the scheme was Flynn.",
    "They're doing an outstanding job.",
    "He was never against immigrants.",
    "Make sure your followers see it.",
    "He is defying the rule of law.",
    "Both ideas quickly fizzled.",
    "And its absolutely wrong.",
    "She tried to delete it."
  ]
}