{
  "id": 95,
  "mediaId": 33,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Peter Thiel plans to wind down his involvement in 2022 after Vance's victory in Ohio",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220506125216-02-peter-thiel-0407-file-restricted-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/05/06/politics/peter-thiel-jd-vance-ohio-gop/index.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr and Michael Warren",
  "authorUrl": "",
  "termIds": [
    2006,
    3085,
    3094
  ],
  "sentences": [
    "People close to both Thiel and Trump expect the billionaire tech investor to remain quietly involved in the political arena even if his financial contributions slow down, citing his proximity to the former President and the likelihood that he would serve as an informal adviser to Masters and Vance should one or both make it to the Senate.",
    "Throughout the Ohio primary, for instance, he made no effort to dictate how the money he gave to Protect Ohio Values, a super PAC supporting Vance, should be spent -- instead entrusting those in charge of the group to spend the nearly $15 million he contributed in whatever ways they saw fit.",
    "A Trump endorsement and primary win for Masters could be a rousing scenario that lures Thiel back into the game if he feels he can have a significant impact elsewhere, as could a situation in which Masters or Vance find themselves struggling in general election contests.",
    "Former White House director of presidential personnel Johnny McEntee, for example, reportedly secured funding from Thiel for a dating app he created and regularly speaks to both men, while other informal Trump advisers were deeply involved in working to elect Vance.",
    "Just a few weeks later and right as early voting began on April 5, Vance's campaign released its first TV ad that hit the exact same message on immigration, with one important distinction: Vance himself appeared in the spot, speaking directly to the camera.",
    "At that event, Thiel reportedly told guests he is eager to unseat \"the traitorous 10\" House Republicans who voted to impeach Trump for inciting an insurrection at the US Capitol on January 6, 2021 (four of whom have since announced their plans to retire).",
    "Either way, the entrepreneur-turned-populist firebrand has demonstrated his potential as one of the most powerful forces in Republican politics and an influential advocate for the strain of Trump-style populism that guides the candidates he is backing.",
    "Arizona Senate Republican hopeful Blake Masters, who co-authored Thiel's 2014 book \"Zero to One\" and who has also been bankrolled by the tech leader in his race, appears poised to receive a Trump endorsement ahead of his state's August primary.",
    "Of the eye-popping sum Thiel has spent so far this cycle, more than $20 million went to super PACs supporting Vance and Masters, both of whom have embraced Trump's lies about the 2020 election and are patrons of the \"America First\" agenda.",
    "But as Thiel has voiced support for helping to rid the GOP of its non-Trumpian members, his actual involvement so far -- large contributions to only two candidates and smaller donations to a handful of others -- tells a different story.",
    "And two congressional challengers whom Thiel has also supported -- Joe Kent in Washington and Harriet Hageman in Wyoming -- have mounted competitive bids against incumbent Republicans who voted to impeach former President Trump.",
    "It also delivered enough of a momentum boost for Vance in the polls at the right time to appeal to Trump -- at a time when the other Ohio Republican campaigns seemed to have run out of ways to close the deal down at Mar-a-Lago.",
    "Thiel didn't convince Trump to endorse Vance, but after the Ohioan's victory on Tuesday, the former President now believes that the tech mogul has a knack for picking \"winners,\" according to a person close to Trump.",
    "One 30-second ad that first aired in March began with a voiceover declaring that for Vance, \"border security is personal\" and ended with a reminder that the candidate has a \"personal mission to secure the border.\"",
    "He's not putting any more money into any more races or getting involved in new races,\" said one person familiar with Thiel's plans who spoke to CNN on the condition of anonymity to describe private conversations.",
    "Vance succeeded in Tuesday's Ohio Senate GOP primary, surging to victory in the final days of the race after a last-minute endorsement from former President Donald Trump and a seven-figure boost from Thiel.",
    "Thiel himself also hosted a fundraiser for Hageman, the Wyoming GOP hopeful who is looking to unseat Rep. Liz Cheney, at his Miami Beach mansion earlier this year that featured Donald Trump Jr. as a guest.",
    "I heard Blake was the person that showed up and I want to thank Blake,\" Trump said over the phone to the campaign event's audience, who had gathered to hear about so-called election integrity in Arizona.",
    "In between, the ad touts Vance's Trump-like promises to \"finish the wall\" and \"end welfare for illegals\" with an even more Trumpian declaration that \"elites and establishment politicians have failed us.\"",
    "After mockingly asking if Republican voters are \"racist\" and listing off the problems with illegal drugs and \"Democrat voters\" coming into the country over the border, Vance pauses and looks down.",
    "But what the super PAC did in public, Thompson said, informed the campaign's moves in a way that placed Vance in the best position to get Trump's endorsement -- and, subsequently, the nomination.",
    "Trump and Thiel have huddled at least three times in the last year at the former President's properties in New York, Bedminster and Palm Beach, according to people familiar with these meetings.",
    "\"He [Thiel] has certainly stepped out more because he feels aligned with Trump and that has made him feel more comfortable in his skin than anything else,\" said another former Trump aide.",
    "'s win makes it even more likely,\" said the former Trump campaign official, noting that Trump stepped out of a wedding at Mar-a-Lago last Saturday to call into a Masters campaign event.",
    "Some Trump allies said they will be closely watching Thiel's next moves before they get too excited about the prospect of him emerging as a consistent mega-donor on the right.",
    "Thiel, who has contributed more than $25 million this cycle, has been satisfied with the returns on his investments so far, said a second person familiar with the matter.",
    "\"I think people are underestimating how much his personal friendship with these guys has to do with his activity and level of involvement,\" this person said.",
    "Inside Trump's orbit, the former President's allies expect Vance's come-from-behind victory to result in an endorsement of Masters in the near future.",
    "Given his personal friendship with Vance, Thompson said, Thiel communicated his advice and thoughts directly to the campaign, not Protect Ohio.",
    "Luke Thompson, the executive director of the super PAC, told CNN he has had virtually no interaction with the billionaire benefactor.",
    "And though they are not as close as some might imagine, the two men have quite a bit of crossover between their aides and advisers.",
    "is going to be at all reflective of that activity in the future,\" said one of the people familiar with the matter.",
    "But as the 2022 midterm cycle heats up, Thiel is winding down, according to two people familiar with the matter.",
    "Trump has already endorsed both Kent and Hageman, who have received contributions from Thiel toward their races.",
    "That ad, Thompson said, made a bigger impression with voters in focus groups than any of the primary debates.",
    "\"They are friendly, but it's not like Peter's in his inner circle,\" a former Trump campaign official said.",
    "\"We had him [Vance] tied for first with Gibbons and Mandel going into early voting,\" Thompson said.",
    "\"I think a lot of people assume [Thiel] is going to be the next Sheldon Adelson or whatever.",
    "So far, Thiel appears to prefer operating far more behind the scenes than Trump.",
    "(CNN)Billionaire tech mogul Peter Thiel won big when his longtime friend J.D.",
    "\"At that point, we sort of passed the baton to the campaign,\" Thompson said.",
    "A Thiel representative did not immediately return a request for comment.",
    "With the new ad and then the Trump endorsement, \"he had exit velocity.\"",
    "\"I don't think the level of support that he's given Blake and J.D.",
    "\"I nearly lost my mother to the poison coming across our border.",
    "I'm not so sure of that yet,\" said one person close to Trump.",
    "\"I think a Masters endorsement was already happening but J.D.",
    "\"I just want to thank you all, you're an incredible group.",
    "Of course, the tech tycoon could still reverse course.",
    "Vance is heading to a general election.",
    "No child should grow up an orphan.\"",
    "\"This issue is personal,\" he says.",
    "\"He's done for the cycle."
  ]
}