{
  "id": 13093,
  "mediaId": 2710,
  "date": "2022-03-01",
  "headline": "Bangerter Highway project means this church he helped build will have to move",
  "image": "https://www.sltrib.com/resizer/r-4xS4Ob7I8rPEt_0iXB67Hcsq4=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/4UUQKVMQTBGHFBMQSW6XFEJ6YQ.JPG",
  "link": "https://www.sltrib.com/news/2022/03/01/bangerter-highway-project/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alixel Cabrera",
  "authorUrl": "https://www.sltrib.com/author/acabrera",
  "termIds": [
    0
  ],
  "sentences": [
    "The Utah Department of Transportation plans to raze the building and others — including dozens of homes — to construct a freeway-style intersection on Bangerter Highway and 4700 South along the border of Taylorsville and neighboring West Valley City.",
    "(Francisco Kjolseth | The Salt Lake Tribune) The Bible Baptist Church in Taylorsville, below right, is scheduled to be displaced as the Utah Department of Transportation builds a freeway-style interchange on Bangerter Highway and 4700 South.",
    "“People around here, who don’t really come to the church, say it’d be a shame to see that go because this place is like a landmark.”\n(Chris Samuels | The Salt Lake Tribune) The Bible Baptist Church in Taylorsville, Wednesday, Feb. 23, 2022.",
    "It also takes into account variables such as the current real estate market, and how much it could cost property owners to move into a similar setup to the one they are leaving, said Brian Allen, UDOT project manager.",
    "“We’ve been looking for properties to relocate to, but we don’t even know how much we have to work with.”\nMoving a congregation\nTo make the new interchange possible, the state would have to acquire more than 17 acres.",
    "“When you put your sweat and blood into things,” Warneke said, “you don’t like to see it torn down.”\n(Chris Samuels | The Salt Lake Tribune) The Bible Baptist Church in Taylorsville, Wednesday, Feb. 23, 2022.",
    "It would affect 91 parcels — 55 partial property acquisitions (41 residential parcels and 14 commercial ones) and 36 full property acquisitions (29 residential parcels and seven commercial ones).",
    "Now that the plan is in motion, the Bible Baptist Church is trying to decide its next move, but it’s difficult because officials don’t know yet what kind of buyout it will receive from the state.",
    "Property owners would be compensated under rules in the Utah Relocation Assistance Act and Real Property Acquisition Policies Act, with the state buying the properties at fair market value.",
    "“...We have a very robust relocation process to help people get into a situation similar or better in the future.”\nWarneke would like to keep his church on the Salt Lake Valley’s west side.",
    "“Wherever we relocate to,” Warneke said, “I don’t know that we’ll get to have a little farm like that.”\nLosing his church’s place in the neighborhood weighs heavily on the pastor’s mind.",
    "“When you put your sweat and blood into things,” pastor says, “you don’t like to see it torn down.”\nEditor’s note • This story is available to Salt Lake Tribune subscribers only.",
    "The memory is a little blurry, but Josh Warneke remembers as a young boy cleaning up construction trash, moving boards and sweeping floors to help build the Bible Baptist Church.",
    "University of Utah Health’s Westridge Health Center stands to lose six stalls from its south-side parking lot, but it still has space on the north to accommodate patients.",
    "Your donation to match our RFA grant helps keep her writing stories like this one; please consider making a tax-deductible gift of any amount today by clicking here.",
    "The fate of two clinics\nBesides the to-be-displaced homeowners wary about reentering a tough housing market, some commercial businesses also will have to relocate.",
    "Alixel Cabrera is a Report for America corps member and writes about the status of communities on the west side of the Salt Lake Valley for The Salt Lake Tribune.",
    "Apart from the church building, Bible Baptist’s land includes two triplexes, which provide housing for staff and ministry officials who travel to Utah.",
    "The church will face demolition as the Utah Department of Transportation converts Bangerter Highway into a freeway-style interchange at 4700 South.",
    "The church will face demolition as the Utah Department of Transportation converts Bangerter Highway into a freeway-style interchange at 4700 South.",
    "It would open in 2025 to ease congestion in the area, and follows similar Bangerter projects at 6200 South, 10400 South and 12600 South.",
    "Now the church, with all those recollections, stands in the way of a road project and has to relocate after 43 years on its foundation.",
    "In addition, Life Church Utah, kitty-corner to Bible Baptist, and two health clinics will be partially affected by the roadwork.",
    "We are going to have better access.”\nIntermountain Healthcare’s Taylorsville InstaCare also will lose some of its property.",
    "But such projects take time, and the department did not have funding then to start working on the 4700 South interchange.",
    "“It’s going to be a little stressful in the construction, but eventually it is going to be a lot better for our patients.",
    "“And you can see it happening every step along the way.”\nThe pastor even contacted UDOT before the plan was announced.",
    "But UDOT and the clinics are working together to ensure patients can access the facilities during the construction.",
    "He spent most of his childhood in that Taylorsville building, where his father, Marshall, was pastor.",
    "It also covers the cost of any special additions that properties may have and moving expenses.",
    "Warneke also recalls being around 12 years old and helping to erect the church’s schoolhouse.",
    "Church leaders have seen the transformations taking place along the highway for some time.",
    "Under that roof and within those walls, Warneke grew up and became a pastor himself.",
    "The road at 4700 South is due to remain closed for about nine to 12 months in 2024.",
    "“We are optimistic,” said Eugenia Smith, the clinic’s outpatient services manager.",
    "By that time, he was old enough to swing hammers and carry shingles up a ladder.",
    "UDOT hires third-party appraisers to determine the value of the properties.",
    "“It’s just kind of scary” for property owners, Allen conceded.",
    "The church also uses land in the rear, where folks can garden.",
    "‘Knew this was coming’\nThe dislocation is hardly a surprise.",
    "It averages about 85 worshippers at Sunday services.",
    "“We’re still kind of in limbo,” Warneke said.",
    "Thank you for supporting local journalism.",
    "“We knew this was coming,” Warneke said.",
    "“It’s definitely a huge loss,” he said.",
    "RELATED STORIES"
  ]
}