{
  "id": 14001,
  "mediaId": 8422,
  "date": "2022-03-18",
  "headline": "Column: Ryan Poles’ calculated start to free agency shows the long timeline of the Chicago Bears rebuild",
  "image": "https://www.readingeagle.com/wp-content/uploads/2022/03/202203180716TMS_____MNGTRPUB_SPORTS-COLUMN-RYAN-POLES-CALCULATED-START-FREE-1-TB5.jpg?w=1024&h=658",
  "link": "https://www.readingeagle.com/2022/03/18/column-ryan-poles-calculated-start-to-free-agency-shows-the-long-timeline-of-the-chicago-bears-rebuild/",
  "mediaOutlet": "readingeagle.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.readingeagle.com/author/tribune-service/",
  "termIds": [
    0
  ],
  "sentences": [
    "A cautious approach in free agency so far has led to speculation he could be creating a situation in which the Bears receive multiple compensatory draft picks in 2023, when they have a pick in every round after regaining a sixth-rounder via the Mack deal to replace the one used to acquire Grant.",
    "Asking general manager Ryan Poles and coach Matt Eberflus on Jan. 31 how long their contracts run was worthwhile considering where the Chicago Bears are on March 18 with an arduous rebuilding process underway.",
    "Poles said teams can discover value after the extravagant spending calms down by identifying motivated players looking for short-term deals with an opportunity to return to the negotiating table.",
    "There are starting spots to fill all over the place and almost no depth in place with the departures of Mack, nose tackle Eddie Goldman and inside linebacker Danny Trevathan, who were released.",
    "Consider when former GM Ryan Pace was entering his second season in 2016, the Bears had 15 players on the roster originally brought to the organization by the previous regime.",
    "The Bears added guard/center Lucas Patrick at $8 million for two seasons and inside linebacker Nicholas Morrow on a one-year deal with $2.5 million guaranteed and some upside.",
    "But other than trading pass rusher Khalil Mack to the Los Angeles Chargers at the start of the new league year, they’ve been more under the radar as this cycle begins.",
    "Eight of the top 10 players on special teams in terms of playing time, a list that does not include punter Pat O’Donnell, who left for the Green Bay Packers.",
    "Coming off a 6-11 season with a talent-short team that entered 2021 as the second-oldest roster in the NFL, change isn’t just a good idea, it’s badly needed.",
    "Poles made it clear he wants to be shrewd when it comes to free agency, and that’s wise with a roster that isn’t a couple quick moves from being overhauled.",
    "The Bears have only six draft picks — three in the first 147 picks — so it’s not as if Poles’ first draft class will be expected to transform the roster.",
    "The Bears will be flush with salary-cap room after this season, something that stands to reason with only 19 players under contract through 2023.",
    "Of the 31 free agents (not counting Scales) and three others that were cast off, the Bears have lost:\n12 players who made at least six starts.",
    "That means the Bears will be active sorting through options for the next couple of weeks and after the draft, when veterans can be cut loose.",
    "But this is a massive undertaking, not something the Bears would be able to patch together with a spending spree beginning Wednesday.",
    "There’s a saying that life comes at you fast, and the churning of the Bears roster is going to move at the same rate.",
    "Defensive tackle Larry Ogunjobi signed a three-year, $40.5 million contract that includes $26.35 million guaranteed.",
    "The Bears over the previous decade have been one of the NFL’s bigger newsmakers at the opening of free agency.",
    "Poles not only needs to create competition for starting roles, he needs to back fill those spots with depth.",
    "It’s a long play for Poles and Eberflus, and, that’s why it’s worth wondering how long their contracts run.",
    "They also added Equanimeous St. Brown, who was primarily a special teams player for the Green Bay Packers.",
    "The only player on that list to be re-signed is long snapper Patrick Scales, who joined the team in 2015.",
    "It’s possible some pending free agents could be re-signed, but any list of those returning will be short.",
    "Patience is going to be required, and this will be a significantly different Bears roster in two months.",
    "It’s fair to think the moves so far say plenty about the timeline the GM and coach are operating with.",
    "The Bears had 32 players who became free agents Wednesday afternoon when the new league year began.",
    "They were in the running to sign Los Angeles Rams center Brian Allen but couldn’t finalize a deal.",
    "It should not come as a surprise the Bears have not been more aggressive with the check book.",
    "It might be surprising if that many players from the Pace era remain in 2023.",
    "72 starts by 11 offensive players, including 43 starts on the offensive line.",
    "Nearly all production at wide receiver that wasn’t made by Darnell Mooney.",
    "It’s believed they remain active seeking additions for the offensive line.",
    "He was a productive complementary player for the Kansas City Chiefs.",
    "One of the team’s two Pro Bowl players — punt returner Jakeem Grant.",
    "Players who accounted for five of the team’s eight interceptions.",
    "The league standard for most head coaches has become five years.",
    "That was the length of the deal Matt Nagy signed in 2018.",
    "Players who accounted for 14 of the team’s 33 touchdowns.",
    "Players who accounted for 10 of 16 receiving touchdowns.",
    "Byron Pringle was signed to a one-year, $4 milliondeal.",
    "99% of snaps at tight end not taken by Cole Kmet.",
    "The Bears picked up two wide receivers Thursday.",
    "59% of the snaps taken by defensive linemen.",
    "Only four teams had fewer touchdowns.",
    "87 starts by 14 defensive players.",
    "()"
  ]
}