{
  "id": 2321,
  "mediaId": 2710,
  "date": "2022-02-10",
  "headline": "How a planned Bangerter Highway interchange would affect dozens of property owners",
  "image": "https://www.sltrib.com/resizer/E9J-8b7Nd3V8VaukYGPdyySFlYo=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/BFSGDDX4UFFINFRFMLDYIDG2V4.jpg",
  "link": "https://www.sltrib.com/news/2022/02/10/how-planned-bangerter/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alixel Cabrera",
  "authorUrl": "https://www.sltrib.com/author/acabrera",
  "termIds": [
    0
  ],
  "sentences": [
    "And we have a very robust relocation process to help people get into a situation similar or better in the future.”\nThe interchange project also would include the relocation of a portion of the Jordan Valley Water Conservancy District aqueduct, between the Utah and Salt Lake Canal and the South Jordan Canal, the study states.",
    "In either case, the state would have to acquire more than 17 acres, which would affect 91 parcels; 55 partial property acquisitions (41 residential parcels and 14 commercial parcels) and 36 full property acquisitions (29 residential parcels and seven commercial parcels).",
    "The department also takes into account variables such as the current housing market, and how much money it would take for property owners to move into a similar housing situation to the one they are leaving, said Brian Allen, UDOT project manager.",
    "“But I still hope maybe there’ll be something that stops it from happening because we’re too old to be displaced at this point.”\nWillesen and her family are already looking for another place in West Valley City, but uncertainty remains.",
    "It’s affecting a lot of families, honestly, and it’s just really devastating.”\nKaye Willesen, who has lived in her West Valley City house for 30 years, also heard UDOT’s presentation on the environmental impact of the highway’s work.",
    "After speaking with UDOT representatives at a community meeting this week, the couple have more answers and feel more comfortable with the project, but the disruption of their neighborhood still weighs heavily on their minds.",
    "“And now the market is pretty high, pretty intense.”\nThe environmental study states that property owners would be compensated under rules in the Utah Relocation Assistance Act and Real Property Acquisition Policies Act.",
    "“We can’t really know what our plans are,” she said, “when the market is so pricey.”\nUDOT is receiving public comments about the project until Feb 15 and expects to complete its environmental study by March.",
    "“We won’t have an answer for a couple of months on that.”\nRepresentatives from this project are available to answer questions and comments on their hotline 888-766-7623 and by the email bangerter@utah.gov.",
    "“People who live next to Bangerter Highway have seen other interchanges happen, so it’s somewhat expected that impacts could occur, and it’s just kind of scary,” said UDOT’s Allen.",
    "It was such a startling call, the couple cut their trip short and rushed back to their West Valley City home to learn more about what this project would mean for them.",
    "Your donation to match our RFA grant helps keep her writing stories like this one; please consider making a tax-deductible gift of any amount today by clicking here.",
    "Alixel Cabrera is a Report for America corps member and writes about the status of communities on the west side of the Salt Lake Valley for The Salt Lake Tribune.",
    "The Utah Department of Transportation plans to build a freeway-style interchange on Bangerter Highway at 4700 South in West Valley City and Taylorsville.",
    "Homeowners would have to find new places to live, and it’s not the best time to be moving — “The market is pretty high, pretty intense,” says one.",
    "UDOT is studying different alternatives for this project, which would place exit and entrance ramps from Bangerter Highway to 4700 South.",
    "Correction • Feb. 10, noon: The sentence about road closures for nine to 12 months on 4700 South in 2024 has been corrected.",
    "If the model in which Bangerter goes under 4700 South is selected, West Valley City is expected to help with funding.",
    "“We’re worried about that whole financial thing — how it’s going to affect families,” said Brenda Galicia.",
    "One option would leave 4700 South at its existing grade, and Bangerter Highway would go over 4700 South.",
    "West Valley City • Jesus and Brenda Galicia were on vacation in Disneyland when they got the call.",
    "It also covers the cost of any special additions that properties may have and moving expenses.",
    "“It’s sad because they’re relocating a lot of older people, and they had a lot of years here.",
    "UDOT is working with West Valley City and Taylorsville regarding the project’s final design.",
    "This means that there would be road closures for nine to 12 months on 4700 South in 2024.",
    "The other, more expensive option would put Bangerter Highway under 4700 South.",
    "UDOT hires third-party appraisers to determine the value of the properties.",
    "One of the full property acquisitions would cost the Galicias their home.",
    "This means that the state would buy the properties at fair market value.",
    "Tonight has cleared up a lot of things, a lot of questions,” she said.",
    "The department hopes to move on with acquisitions in a month or two.",
    "“We purchased our home around two years ago,” Jesus Galicia said.",
    "It would be ready in 2025 to ease congestion in the area.",
    "“We’re in the middle of those conversations,” Allen said.",
    "It was from one of their neighbors carrying bad news.",
    "The roadwork would take out the Galicias’ house.",
    "A previous version listed the wrong street.",
    "“We follow the state and federal law.",
    "“I’m feeling better now.",
    "RELATED STORIES"
  ]
}