{
  "id": 4376,
  "mediaId": 2925,
  "date": "2022-01-25",
  "headline": "School mural pays homage to county’s history and future",
  "image": "https://thegrio.com/wp-content/uploads/2022/01/mural-e1643145075920.jpeg",
  "link": "https://thegrio.com/2022/01/25/underground-railroad-mural/",
  "mediaOutlet": "thegrio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Candice Marie Benbow",
  "authorUrl": "https://thegrio.com/author/candice-benbow/",
  "termIds": [
    0
  ],
  "sentences": [
    "Watson-Vandiver also sees the mural at William Hall Academy as a kind of “interrogation of knowledge and power” and “gives students a visual depiction of living history that they can see and walk by every day.”\nYet, the history of Van Horn’s home is not just in its Confederate past.",
    "In a moment when many across the country are fighting to have everything related to America’s dark past of enslavement and segregation wiped from the history books, artist Brian Allen is using the mural as a history lesson.",
    "Through it, Allen is sending a clear message to the students of William Hall Academy: “where you end up is just as important.”\nWatson-Vandiver agrees and believes more murals and creative informative projects should exist.",
    "“Because we know that the education system is standardized and often does not promote non-White narratives.”\nCandice Marie Benbow is theGrio’s daily lifestyle, education and health writer.",
    "“I think that’s very important to know that he was a slaveholder, but also knowing it was used in the Underground Railroad as well to free slaves,” Allen told the local news affiliate.",
    "Dr. Marcie Watson-Vandiver, Assistant Professor of Elementary Education at Towson University, sees the Underground Railroad as a quintessential part of American history.",
    "The sprawling 1803 mansion, that originally had nine bedrooms and eight fireplaces, was once also home to Nation of Islam leader Elijah Muhammad and his wife Clara.",
    "She’s also the author of Red Lip Theology: For Church Girls Who’ve Considered Tithing to the Beauty Supply Store When Sunday Morning Isn’t Enough.",
    "At the center of the mural is a home, originally owned by Archibald Van Horn, head of the Maryland militia and House of Delegates member.",
    "Though the Underground Railroad reflects a painful moment in America’s history, the placement of the mural is intended to represent hope.",
    "TheGrio is available for FREE wherever you use the internet — on our new mobile App, Roku, Amazon Fire TV, and AppleTV!",
    "When the students of William Hall Academy walk into their school, they have a beautiful reminder that past is prologue.",
    "The William Hall Academy in Prince George's County is home to a new mural paying tribute to the Underground Railroad.",
    "“As such, it should be centralized and included as part of the narrative kids learn about,” she tells theGrio.",
    "Former Egyptian President Anwar al-Sadat, Malcolm X and Muhammad Ali also visited the home.",
    "is now home to a mural paying homage to the enduring legacy of Prince George’s County.",
    "Have you subscribed to theGrio podcasts, Dear Culture or Acting Up?",
    "“We have to demand our stories be told,” she says.",
    "Find her on Twitter and Instagram @candicebenbow.",
    "The K-8th grade school in Capitol Heights, Md.",
    "And a Black Podcast Network coming soon!",
    "Download our newest episodes now!"
  ]
}