{
  "id": 5591,
  "mediaId": 2605,
  "date": "2022-04-21",
  "headline": "Comeback aside, Cam Akers unimpressed with own performance during Rams’ Super Bowl run",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/d3648fd/2147483647/strip/true/crop/4448x2335+0+315/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe4%2Fcf%2Ffa5946544fe9ae67552f4e3725f8%2F914166-sp-0213-super-bowl-rcg-jpg-12196.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-04-21/comeback-aside-cam-akers-explains-his-disappointment-in-rams-super-bowl-run",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But everybody’s going to do it in their own way.”\nCornerback Robert Rochell is competing to start\nWith Darious Williams gone after signing with the Jacksonville Jaguars, Rochell is vying to fill a starting role in a secondary that also includes star cornerback Jalen Ramsey and fourth-year pro David Long.",
    "“You’re not replacing Whit because you can’t,” said Havenstein, an eighth-year pro, adding, “You put all of our combined playing experience, you still don’t make it up to where Whit is.”\nHavenstein, Noteboom and Allen are among players that could help fill the void.",
    "“It was more, ‘How can I get better?’ ”\nAkers, 22, is aiming to play a full season in 2022, when the Rams will try to become the first team to repeat as Super Bowl champions since the New England Patriots achieved the feat in the 2003 and 2004 seasons.",
    "... 2022 is the focus and we’re moving on and trying to get better.”\nNo replacing Andrew Whitworth\nFor the first time since 2017, the Rams are preparing for a season without left tackle Andrew Whitworth, who retired after a 16-year career.",
    "Less than six months after suffering an Achilles injury that sidelined him for nearly the entire season, Rams running back Cam Akers returned just before the playoffs and helped his team make a run to a Super Bowl title.",
    "“I don’t feel like I played the best games throughout that time span,” he said during a videoconference with reporters, “so there wasn’t really a lot of celebrating for me.",
    "“So, this offseason I’ve been hitting all of those deficits trying to get better.”\nOther takeaways from the Rams’ first week of the offseason program:\nLetdown?",
    "Akers was happy to win a championship — “It’s been cool; everything you can imagine,” he said Thursday — but he was not overly impressed with his performance.",
    "But last July, on the eve of training camp, Akers suffered a torn right Achilles, a setback that typically would sideline a player for the entire season.",
    "Joe Noteboom will start at left tackle, but Whitworth’s accrued wisdom cannot be replaced individually or collectively, right tackle Rob Havenstein said.",
    "Akers, however, returned for the season finale against the San Francisco 49ers, and he carried the ball five times for three yards in a 27-24 defeat.",
    "Akers and fourth-year pro Darrell Henderson are the projected top running backs for a team that has not moved to re-sign free agent Sony Michel.",
    "Rochell began his rookie season as a reserve but moved into the starting lineup for five games after Williams suffered an injury.",
    "After several notable performances as a rookie in 2020, Akers had prepared for the 2021 season with high expectations.",
    "“I don’t feel like I played my best games the five games I returned, but I did what I was supposed to do,” he said.",
    "“But obviously that’s not enough.”\nAkers said he began working on his craft again a few days after the Super Bowl.",
    "After winning the Super Bowl, the Rams are expecting opponents to be “gunning” for them, center Brian Allen said.",
    "In four postseason games, Akers averaged nearly 17 carries and 43 yards per game but did not score a touchdown.",
    "over the Cincinnati Bengals, Akers rushed for 21 yards in 13 carries, and caught three passes for 14 yards.",
    "His season ended when he suffered a season-ending rib injury in a Dec. 5 game against the Jaguars.",
    "“First rib by my collar bone,” Rochell said when asked about the injury and his recovery.",
    "“I got a lot to improve on, a lot to polish up on when it comes to my game,” he said.",
    "“You already hear things like, ‘Super Bowl lulls’ and things like that,” Allen said.",
    "He fumbled twice in an NFC divisional-round victory over the Tampa Bay Buccaneers.",
    "“It’s the power of the team, power of the [offensive line] room,” Havenstein said.",
    "“One of the craziest injuries I ever went through because it’s so rare.",
    "The Rams on Thursday completed their first week of offseason workouts.",
    "“Guys stepping up and taking another step towards their leadership.",
    "It was a remarkable comeback with something of a storybook ending.",
    "“Those are things that I really just don’t think will exist here.",
    "So, there was a lot of mental stuff that went into it.”",
    "In the 23-20 Super Bowl victory.",
    "“Everybody wants to get better.",
    "But the Rams will be prepared.",
    "Rochell intercepted one pass.",
    "No treatment.",
    "What letdown?",
    "Just pain."
  ]
}