{
  "id": 5806,
  "mediaId": 2559,
  "date": "2022-04-12",
  "headline": "Is Iowa football's defensive line poised to make a big leap? Returning experience says so.",
  "image": "https://www.gannett-cdn.com/presto/2021/09/07/PIHC/4cc2751c-b68b-453e-bc52-6f6e196cc890-20210904_IowaVsIndiana_00350.JPG?crop=4389,2469,x0,y207&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.hawkcentral.com/story/sports/college/iowa/football/2022/04/12/iowa-football-defensive-line-grown-question-mark-strength-zach-vanvalkenburg-nfl-lukas-van-ness/7270905001/",
  "mediaOutlet": "Des Moines Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kennington Lloyd Smith III",
  "authorUrl": "https://www.desmoinesregister.com/staff/4382562002/kennington-lloyd-smith-iii/",
  "termIds": [
    4995,
    4385,
    1772,
    3328,
    859,
    657,
    364,
    6244
  ],
  "sentences": [
    "On the field, there's opportunity available for almost every player to get significant reps. Evans has been out with an injury and sophomore Ethan Hurkett is still recovering from a leg injury that sidelined him for most of last season.",
    "In 2021, the unit lost three future NFL players: Chauncey Golston (Cowboys), Jack Heflin (Packers) and Daviyon Nixon (Panthers), and questions about who would replace them were among the biggest storylines of last off-season.",
    "Sophomore Deontae Craig has gotten a lot of first-team snaps in Evans' place and fellow sophomore Lukas Van Ness, last season's co-sacks leader, is experimenting at defensive end after playing mostly tackle last season.",
    "There's some guys you feel good about, guys you keep your fingers crossed that you hope do well and everything they're doing right now would lead you to believe they'll have a good fall but it hasn't happened yet.\"",
    "There's millions of (offensive) cues from where the offensive tackle is looking, location of the fullbacks and tight ends that young guys that haven't played a lot of reps, they're just not looking at that.",
    "We have our scheduled meetings but a lot of guys are getting extra sessions in with (assistant defensive line coach Jay Niemann) and coach Bell, and you can see it on the field every day.",
    "So I think as a group as that increases, I think the production of the group increases because what you get is guys that are able to play above and beyond what the play call is.\"",
    "More on Iowa's defense:Leistikow: A revealing look into what makes Iowa football's defense remarkably consistent\nIowa is returning eight of its top nine contributors last year.",
    "Last year, with a largely inexperienced defensive line, the Hawkeyes finished first in takeaways, third in total defense, third in rush defense and sixth in pass defense.",
    "VanValkenburg is the lone departure, meaning Iowa is returning more than 75% of its production (total tackles, tackles for loss and sacks) from last season.",
    "The leaders who have emerged include seniors Joe Evans and John Waggoner at defensive end and senior Noah Shannon and junior Logan Lee at defensive tackle.",
    "More consistent (and disruptive) defensive line play will make life much easier for Iowa's back seven, which is also expected to perform at a high level.",
    "What he does know is he has a core group that he can trust and hopes more players earn that trust between spring and fall to fulfill the expectations.",
    "Shannon said he, Evans and Waggoner had conversations during the winter period about taking over the leadership void left by VanValkenburg.",
    "Bell later chimed in that many players didn't speak up last year because senior Zach VanValkenburg typically had the answer for everything.",
    "\"That's not just turning around, getting the call from (defensive coordinator Phil Parker) and putting your hand in the dirt and playing.",
    "Shannon said that because so many players got significant playing time last year, they know more because they've seen a lot more.",
    "With several proven commodities, Bell is emphasizing the mental aspect of the game as the next step in the group's development.",
    "The group has gotten off to a strong start this spring and could take one of the biggest leaps of any Hawkeye position group.",
    "\"When (defensive line coach Kelvin Bell) is talking, asking questions, there's more guys who are confident to speak now.\"",
    "VanValkenburg is gone and preparing for the NFL Draft, but the Hawkeyes return plenty of experience and talent in 2022.",
    "Bell foresees more disruptive plays from the group once they can better identify what the offense is doing pre-snap.",
    "The defensive line's continued emergence should solidify Iowa as a top defensive team in the Big Ten again in 2022.",
    "Iowa already has two early enrollees participating in spring practice: three-stars Brian Allen and Caden Crawford.",
    "Their message to the younger guys in the room is that they can feel comfortable speaking up despite their age.",
    "If I'm out there messing up then I want the younger guy to be able to say 'Hey, you're not doing this right.'\"",
    "Bell said junior Louie Stec and redshirt freshman Jeremiah Pittman are two players who are taking advantage.",
    "I couldn't be more pleased with where we are, which a lot of it is due to a lack of injury; knock on wood.\"",
    "Kennington Lloyd Smith III covers Iowa Hawkeyes football and men's basketball for the Des Moines Register.",
    "\"I talk to the guys all the time about developing and increasing their pre-snap intelligence,\" Bell said.",
    "\"A lot of guys are getting more reps than they probably thought (they would) this spring,\" Shannon said.",
    "There's a much different feeling in Iowa's defensive line room this year compared to last year.",
    "\"I feel like the room is definitely a lot louder,\" veteran defensive tackle Noah Shannon said.",
    "Related content:Several Iowa football backups are getting unexpected starter reps this spring.",
    "Logan Jones' move to the offensive line opened up an opportunity for reps at defensive tackle.",
    "You can connect with Kennington on Twitter @SkinnyKenny_ or email him at ksmith@gannett.com.",
    "Aaron Graves, a four-star recruit and Army All-American, will join the team in June.",
    "\"There's guys I know I can count on based on what they did last year,\" Bell said.",
    "\"I think it's good for them, and their sense of urgency to improve is very high.",
    "\"They just may be thinking 'I got the call, let me line up in the right place.'",
    "Got a couple of guys who have enrolled early, which is the first time for me.",
    "The amount of guys that we have and the reps they're getting is invaluable.",
    "\"There's a lot of guys who've played for us that are returning,\" Bell said.",
    "Those injuries have opened the door for more snaps for the defensive ends.",
    "This spring, there's much more certainty and confidence among the group.",
    "And the Hawkeyes aren't done adding talent to their defensive line.",
    "\"We want the young guys to be able to approach us and coach us too.",
    "\"Then there's guys I'm waiting to emerge and see if I can count on.",
    "For Bell, it's too early to put energy into season projections.",
    "They're not going to mess up on the same thing every day.\"",
    "\"No one person is bigger than the other,\" Shannon said.",
    "\"That changes the dynamic of the room.",
    "Who's standing out?"
  ]
}