{
  "id": 6082,
  "mediaId": 2523,
  "date": "2022-04-21",
  "headline": "Super wasn’t good enough for Rams’ Cam Akers",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/04/imageedit_3_37359425-16x9-1.jpg?w=1024&h=579",
  "link": "https://www.dailynews.com/2022/04/21/super-wasnt-good-enough-for-rams-cam-akers/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.dailynews.com/author/kevin-modesti/",
  "termIds": [
    4827,
    4385,
    1744,
    2832,
    1279,
    859,
    731,
    275
  ],
  "sentences": [
    "Akers said he was fully healthy by the time he returned to light duty in the Rams’ regular-season-ending loss to the San Francisco 49ers, although he felt “behind a little bit physically, conditioning-wise.”\nA shoulder injury in the NFC championship game victory over San Francisco wasn’t a factor against Cincinnati, Akers said.",
    "It was more, ‘How can I get better?’”\nEven if the Rams hadn’t gone on to defeat the Cincinnati Bengals, 23-20, in Super Bowl LVI on Feb. 13, they would have been thrilled with Akers’ recovery and return to action less than six months after a pre-training camp Achilles’ tendon tear that initially was feared to be season-ending.",
    "When he really is 100% healthy, the sky’s the limit for him.”\nRa’Shaad Samples, hired as running backs coach as Thomas Brown moves over to tight ends, praised Akers’ recovery as “ridiculous.”\n“He was a little rusty at times, but just what he did was amazing,” Samples said last week.",
    "Darrell Henderson is second on the depth chart going into the final year of his contract, and other running backs on the roster are Jake Funk, Xavier Jones, Raymond Calais and Javian Hawkins.",
    "The NFL draft April 28-30 should bring reinforcements, but running back isn’t as high a priority for the Rams next week as the offensive line, outside linebacker and cornerback.",
    "Now, he said, he wants to work on improving, well, “everything.”\nThe Rams hope Akers, who will turn 23 in June, can play the starting role for a full season for the first time.",
    "“Coming off of an Achilles’, six months, and doing what he can to help our football team win, just having him back was awesome,” Rams center Brian Allen said Thursday.",
    "That’s why, Akers says, he was back in training long before Rams players and coaches reunited this week for the first phase of offseason workouts.",
    "But after rushing twice for 4 yards and catching a Matthew Stafford pass for 7 yards on the Rams’ first three plays, Akers tapered off.",
    "For Cam Akers, being part of the Rams’ Super Bowl championship run in his second NFL season was all he could have wished for.",
    "“We won the (playoff) games, so it went well at the end of the day,” Akers said of his late-season experience.",
    "But his production in five games was a far cry from his breakout performance late in his rookie season.",
    "A reporter used the word “supernatural” to describe Akers’ recovery from the Achilles’ tendon injury.",
    "I know he’ll be a lot more comfortable going into this training camp.”\nSaid Allen: “He’s a freak.",
    "Akers gained 175 yards on 72 carries and 86 yards on 11 receptions and scored no touchdowns.",
    "I always felt like God had his hands placed on me,” Akers said, drawing a fine distinction.",
    "He fumbled twice as the Rams nearly blew their second-round playoff game at Tampa Bay.",
    "Playing the whole season.”\nThe work began, he said, just days after the Super Bowl.",
    "“Just his energy, who he is as a person, provides a little spark for our offense.",
    "He finished the Super Bowl with 13 carries for 21 yards and three catches for 14.",
    "I don’t feel like I played my best games in the five games (after) I returned.",
    "The running back’s own performance, though, left something to be desired.",
    "“I did what I was supposed to, but obviously that’s not enough for me.”",
    "Sony Michel, the team’s leading rusher in 2021, remains a free agent.",
    "“But as far as me, I don’t feel like I played my best games.",
    "We’re grateful that he was willing to push the pace for us.",
    "It’s been everything you can imagine,” Akers said Thursday.",
    "In his five games, Akers averaged 2.4 yards per carry.",
    "I just always felt real blessed throughout my process.",
    "“I was healthy at the end of the season,” Akers said.",
    "His first real snaps were in Week 1 of the playoffs.",
    "“But there were a lot of things to learn from.",
    "So there wasn’t a lot of celebrating for me.",
    "“It’s hard coming off an injury like that.",
    "His teammates looked at the bright side.",
    "“Now it’s about staying healthy.",
    "I never looked at it like that.",
    "He’s an awesome running back.",
    "“We won the Super Bowl.",
    "“Supernatural?"
  ]
}