{
  "id": 662,
  "mediaId": 2523,
  "date": "2022-02-26",
  "headline": "Every NFL Team's 2022 Offseason To-Do List",
  "image": "https://img.bleacherreport.net/img/images/photos/003/920/630/hi-res-fedd30607aa5969bf7fcc75eb47a0eea_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953742-every-nfl-teams-2022-offseason-to-do-list",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Davenport",
  "authorUrl": "https://bleacherreport.com/users/56e814d7-af6d-4d06-81ed-30c56f8841e0",
  "termIds": [
    0
  ],
  "sentences": [
    "San Francisco 49ers\nFind a taker for Jimmy Garoppolo\nReload vs. rebuild on the back end\nBring back OG Laken Tomlinson\nThe 49ers made it all the way to the NFC Championship Game last year, but with some prominent contributors set to hit free agency and less than $3 million in cap space, the Niners could be looking at some difficult decisions this spring.",
    "The Buccaneers may be short on wiggle room, but they are long on in-house free agents, including wide receiver Chris Godwin, edge-rusher Jason Pierre-Paul, center Ryan Jensen, defensive tackle Ndamukong Suh, running backs Leonard Fournette and Ronald Jones, cornerback Carlton Davis, tight end Rob Gronkowski and safety Jordan Whitehead.",
    "Jacksonville Jaguars\nGet Trevor Lawrence more weapons\nGet Trevor Lawrence better protection\nSettle on a guy to be \"the guy\" in the 2022 draft\nFor the Jacksonville Jaguars and new head coach Doug Pederson, the offseason is all about putting young quarterback Trevor Lawrence in a better position to succeed in his second season.",
    "Miami Dolphins\nAttack the offensive line in free agency\nImprove the weapons on offense\nTrim the fat from the roster\nThere isn't a team better positioned to attack the offseason than the Miami Dolphins, as they have a whopping $61.2 million war chest, eight draft picks and three first-rounders over the next two seasons.",
    "Indianapolis Colts\nFigure out the QB position\nAdd help for Michael Pittman at wide receiver\nImprove the pass rush\nLike many teams, the path the Indianapolis Colts take in the offseason hinges largely on how the team handles its first major decision of the offseason: what to do with veteran quarterback Carson Wentz.",
    "But whether it's a veteran tackle such as Terron Armstead of the Saints, a free agent guard such as Jacksonville's Andrew Norwell, a rookie lineman such as Boston College's Zion Johnson or some combination, Cincinnati's first, last and most pressing matter has got to be doing a better job of keeping Burrow upright.",
    "The team may also have a sizable hole in the secondary to fill—27-year-old corner Anthony Averett could command in excess of $12 million per season on a new contract, and if the Ravens choose to keep him, it could mean parting ways with veteran Marcus Peters, who missed the entire 2021 campaign with a torn ACL.",
    "Try to keep the band together\nFind a temporary solution at wide receiver\nAdd offensive line help\nThe Los Angeles Rams enter the offseason riding high after winning Super Bowl LVI, but as the team is about to find out, sometimes staying on top can be harder than getting there.",
    "Philadelphia Eagles\nGet better on the edge\nGet DeVonta Smith help at wide receiver\nAdd a linchpin linebacker\nThere has been no shortage of speculation that the Eagles could look to upgrade at quarterback this offseason, as Philly has three first-round picks to bargain with.",
    "But given that Rudolph is 5-4-1 in those 10 starts, it's a safe bet that whether it's a trade for a veteran such as Jimmy Garoppolo, a free agent such as Mitchell Trubisky or a rookie such as Liberty's Malik Willis, the team is going to explore all its options under center.",
    "But if the trade market fails to develop and/or the asking price for a player such as Jimmy Garoppolo is too steep, Washington may have to choose whether to go the stopgap route again with a Mitchell Trubisky or Jameis Winston or draft a quarterback 11th overall.",
    "Releasing wide receivers DeVante Parker and Allen Hurns, safety Eric Rowe and kicker Jason Sanders would clear almost $20 million in additional cap space, while trading one of the team's high-priced corners could clear more financial room and add even more picks.",
    "Chicago's line was average on its best day and abysmal at its worst, and veteran tackle Jason Peters (arguably Chicago's best O-lineman in 2021) is well past his prime, coming off an injury and due to hit free agency even if he decides to play another year.",
    "Defensively, the Eagles amassed the second-fewest sacks in the league a year ago, and with edge-rusher Derek Barnett about to hit free agency, one of those first-rounders will all but certainly be used on a pass-rusher such as George Karlaftis of Purdue.",
    "No, that's a pick that will more likely be used on an elite offensive line prospect such as North Carolina State's Ickey Ekwonu, a high-end edge-rusher such as Oregon's Kayvon Thibodeaux or a top defensive back such as Notre Dame safety Kyle Hamilton.",
    "With running back Cordarrelle Patterson and wide receiver Russell Gage about to become free agents, the Falcons have one of the weakest assemblages of offensive firepower in the league, although the potential return of Calvin Ridley would help.",
    "Carolina Panthers\nAddress the quarterback position\nImprove the offensive line\nKeep the defense from springing leaks\nThe Carolina Panthers aren't in especially bad shape against the salary cap, as the team has about $15 million in wiggle room.",
    "Washington Commanders\nFind a new starting quarterback\nGet Terry McLaurin a running mate\nBid goodbye to Landon Collins\nThere isn't a quarterback on the free-agent or trade market who won't be linked to the Washington Commanders this offseason.",
    "Whether it's a tackle with one of the team's two first-round picks or help along the interior line on Day 2, if the G-Men have any intention of really putting Daniel Jones in a position to succeed, the team has to get better in front of him.",
    "With Joe Haden, Ahkello Witherspoon and Arthur Maulet all headed for free agency and Pittsburgh sitting on over $29 million in cap space, the team could be in play for some of this year's bigger names at cornerback on the free-agent market.",
    "Last year's Von Miller trade left the Broncos thin on the edge outside Bradley Chubb, and with veterans Bryce Callahan and Kyle Fuller both about to hit free agency, the team's depth at cornerback could become an issue in the near future.",
    "As a matter of fact, the success that teams enjoy (or do not) in October and November depends largely on what they do in March and April, whether it's successfully navigating free agency or making good use of draft capital in Las Vegas.",
    "But after watching Burrow absorb the third-most sacks (including the playoffs) that any quarterback ever has in a season, it's abundantly clear that Cincinnati's biggest priority in the offseason is bolstering the line in front of him.",
    "Goff would have better chances of success with more talent around him, and while Detroit's offensive line is relatively solid, the team's wide receiver room badly needs an injection of talent behind second-year pro Amon-Ra St. Brown.",
    "With that in mind—and with the NFL Scouting Combine (begins on March 1) just around the corner and free agency not far behind that (March 16 start)—here's a look at some of the biggest items on the to-do lists of all 32 NFL teams.",
    "The trade that brought Sam Darnold to Carolina appears to have been a boondoggle, but with Darnold under contract for one more season and not much out there in free agency, adding a veteran signal-caller isn't particularly likely.",
    "Seattle Seahawks\nMake THE decision\nAdd an impact pass-rusher\nBolster a leaky back end defensively\nTo be fair, the Seattle Seahawks have problems that go well beyond the ongoing saga that is Russell Wilson's future with the team.",
    "With holes galore on both sides of the ball, little cap space to play with and Matt Ryan's contract hanging around the team's neck like an anchor, Atlanta general manager Terry Fontenot has his work cut out for him this spring.",
    "With his 32nd birthday looming, Jones is closer to the end of his career than the beginning, but after recording over 10 sacks five times in six years with the Redbirds, Jones won't hurt for suitors if he hits the open market.",
    "Cleveland Browns\nMake the Mayfield decision\nRework the wideout room\nMake improvements along the defensive line\nThe Cleveland Browns are on a mission in 2022—a mission to wash off the stink of last year's miserable performance.",
    "Buffalo Bills\nMaintain depth along the defensive line\nGet better where everyone needs to (offensive line)\nAdd a complementary wide receiver\nThe Buffalo Bills possess one of the deepest and most talented rosters in the league.",
    "Retain key free agents\nHit the bargain bin for outside help\nAdd a wideout early in the 2022 draft\nThe Kansas City Chiefs have no shortage of talent on both sides of the ball, but that doesn't mean the team doesn't have needs.",
    "But while reports of a rift between player and team may drive news cycles and give talking heads on television something to discuss, the odds that anyone but Murray is the team's starter under center Week 1 are slim to none.",
    "Atlanta Falcons\nOverhaul the skill positions on offense\nDo something about an anemic pass rush\nImprove the defensive backfield\nFrankly, it would be easier to list the areas where the Atlanta Falcons don't need help in 2022.",
    "Add more passing-game weapons for Zach Wilson\nShore up the secondary\nConsider a trade down in Round 1\nThe New York Jets are primed to take a sizable step forward in 2022 if general manager Joe Douglas plays his cards right.",
    "The 26-year-old Watson's future in the league is under question with 22 civil lawsuits and 10 criminal complaints from women accusing him of committing sexual assault or misconduct during massage sessions still active.",
    "Redoing deals for veterans such as wide receiver Amari Cooper and edge-rusher Demarcus Lawrence could free up some dough, but Dallas is still going to have to decide which in-house free agents are the highest priority.",
    "Williams set a career high with 1,146 receiving yards last year, and while there are alternatives who will be available in free agency, Williams has a rapport with Justin Herbert and knowledge of the Chargers offense.",
    "Minnesota Vikings\nAdd help at cornerback\nRestructure contracts to free up cap space\nRevamp/rebuild the pass rush\nAs the Minnesota Vikings kick off the Kevin O'Connell era, the team does so with some pressing issues.",
    "With Gallup headed to free agency and Cooper's cap hit of $22 million in 2022 killing the team's cap, it's possible that one of the strengths of Dallas' roster last year could be a weakness in the season to come.",
    "But the Panthers aren't in great shape either—especially with players such as cornerback Stephon Gilmore and edge-rusher Haason Reddick about to command significant interest (and a fat payday) on the open market.",
    "Dallas Cowboys\nRestructure contracts to free up cap space\nTry to keep in-house free agents\nDraft a wideout early\nFor the Dallas Cowboys, this offseason is more about avoiding subtractions than making additions.",
    "Detroit Lions\nImprove the passing-game weapons\nKick the tires on a rookie quarterback\nGet better all over the defense\nThe good news for the Detroit Lions in 2022 is the team has resources with which to improve.",
    "Denver Broncos\nShake the tree at quarterback\nFill in some holes on defense\nUpgrade the offensive line\nIt's hardly a state secret that the Denver Broncos need to get better at football's most important position.",
    "Whether it's in the first round with a player such as Ohio State's Chris Olave or on Day 2 with a guy such as Purdue's David Bell, one of the Cowboys' first few picks has a good chance of being a pass-catcher.",
    "Hold the secondary together\nAdd an outside receiver\nBring in some beef on the interior\nThe Las Vegas Raiders made the postseason in 2021, but that didn't stop the team from making big changes in the offseason.",
    "Among them, Verrett is likely the most impactful player, but with depth on the back end already an issue for the team, the 49ers will have to address any departures by signing or drafting a comparable talent.",
    "The Chargers also need to consider sinking some of that free-agent cabbage or early-round draft capital into the defensive backfield, as cornerback Chris Harris is past his prime and headed for free agency.",
    "With about $21 million in cap space, the Eagles have the wiggle room to take a run at a veteran addition, and with one of those three picks, a rookie such as Treylon Burks of Arkansas could also be in play.",
    "Arizona Cardinals\nMake a decision on Chandler Jones\nReloading vs. revamping at wide receiver\nUpgrade the secondary\nSome may expect to see quarterback Kyler Murray atop the Cardinals' offseason to-do list.",
    "That $7.3 million looks like that much less when you consider that after picking off 22 passes over the past three seasons, cornerback J.C. Jackson could easily command twice that annually on a new deal.",
    "Left tackle Andrew Whitworth is the NFL's oldest active player at 40, while two starters along the interior of the line (guard Austin Corbett and center Brian Allen) are about to become free agents.",
    "There's a reason that Miami has been mentioned so often as a trade destination for Houston Texans quarterback Deshaun Watson, but the team has problems that go well beyond the quarterback position.",
    "Given those financial realities, if the team can find a taker for a player such as cornerback James Bradberry, freeing up some cap space while adding additional draft capital is worth considering.",
    "With the first pick in 2018 heading into the fifth and final season of his contract, Cleveland's entire offseason plan hinges on how much confidence the team has that Mayfield can rebound in 2022.",
    "And even if the team does pull off that magic act for a second straight year, re-upping in-house free agents such as tackle Terron Armstead and safety Marcus Williams could be next to impossible.",
    "Guard Connor Williams, edge-rusher Randy Gregory, wide receiver Michael Gallup, tight end Dalton Schultz and safety Jayron Kearse all played significant roles for the NFC East champions in 2021.",
    "Allen Robinson is coming off a positively miserable season and is headed into free agency and is widely expected to move on after all but accusing the team of attempting to sabotage him in 2021.",
    "Baltimore Ravens\nGet better in the trenches\nBolster the secondary\nGet an extension done with Lamar Jackson\nThere's no question what the dominant offseason storyline is for the Baltimore Ravens.",
    "And there are some key contributors to the team's Super Bowl run whose contracts are expiring, including edge-rusher Von Miller, wide receiver Odell Beckham Jr. and cornerback Darious Williams.",
    "Whether the team retains Hayward, looks for a similarly priced option such as Xavier Rhodes or even shoots the moon for an upgrade in a J.C. Jackson, the Raiders can't afford a backslide here.",
    "Pittsburgh Steelers\nFind a better starting quarterback\nImprove the offensive line\nAdd depth and talent at cornerback\nIt's the dawn of a new age in Pittsburgh: the post-Ben Roethlisberger era.",
    "The skill-position talent isn't especially formidable either outside of young wideout Jaylen Waddle and tight end Mike Gesicki, as Miami's leading rusher had just over 600 yards last season.",
    "One of those picks would probably be well-spent on one of this year's top defensive backs, as the Jets fielded the league's third-worst pass defense last year, allowing 259.4 yards per game.",
    "But with an offense loaded with firepower and the second-most cap space in the league, the Bolts are well-positioned for an offseason that will help them build on last year's 9-8 record.",
    "Couple that with Robert Woods carrying a cap hit north of $15 million coming off his own season-ending injury, and there's more than a little uncertainty opposite Cooper Kupp at wideout.",
    "Corey Davis and Elijah Moore are an OK one-two punch, but signing a wideout such as Michael Gallup or a tight end such as Mike Gesicki can only help Wilson's chances of a step forward.",
    "Cornerback isn't New England's only need, as wide receiver remains an issue despite last year's spending spree, and the Pats could use an infusion of talent at the linebacker position.",
    "Buffalo rode a heavy rotation of edge-rushers to a respectable 42 sacks in 2021, but with Mario Addison and Jerry Hughes both pending free agents, someone may wind up the odd man out.",
    "With Lamar Jackson entering the final year of his rookie contract, locking up the 2019 NFL MVP long-term has to be at or near the top of general manager Eric DeCosta's \"to-do\" list.",
    "Of course, moving on from Wentz means a big hole under center, and while the Colts have over $36 million in cap space, the free agents who are currently available are underwhelming.",
    "Still, regardless of who the team's starting quarterback will be this season, the Browns need to improve the weapons at that quarterback's disposal in free agency and/or the draft.",
    "Re-sign cornerback J.C. Jackson\nTry again at wide receiver\nObtain some help at linebacker\nAfter a one-season absence, the New England Patriots were back in the postseason in 2021.",
    "Whoever the team's quarterback is in 2022, that passer would benefit considerably from the team improving a wide receivers room that thins out quickly behind Michael Pittman.",
    "Kansas City at least its contender status to fall back on as a selling point—aging veterans may be willing to take less money if it means a real chance at a deep playoff run.",
    "Washington can add a sizable amount to that pile by releasing veteran safety Landon Collins; designating him as a post-June 1 cut would save the team almost $12 million more.",
    "Myles Garrett will be back wreaking havoc off the edge, but after posting nine sacks last season, Jadeveon Clowney is set for free agency and should be a sought-after player.",
    "For every club with cap space to burn looking to be a big player in free agency, there's another that will need to redo some deals or make cuts just to get under the cap.",
    "If one (or both) is willing to return on a reasonable offer, a reunion could be in the offing, but the team has had something of a weak spot at that position for a while.",
    "But the lasting memory from that season will be Ryan Tannehill's miserable performance in the postseason as much as anything the team accomplished in the regular season.",
    "How the Jags do (and who they get) on the open market may wind up impacting whether it's Neal or another player who hears his name called first on April 28 in Las Vegas.",
    "Landry isn't the only defensive free agent Tennessee has to worry about, as inside linebackers Rashaan Evans and Jayon Brown are also on the cusp of hitting the market.",
    "Tennessee Titans\nRetain edge-rusher Harold Landry\nAdd help at inside linebacker\nUpgrade at tight end\nThe Tennessee Titans posted the best record in the AFC last year.",
    "Still, the Cardinals have plenty of problems to solve in the offseason—and precious little in the way of salary-cap space (under $3 million) with which to solve them.",
    "Per Zak Keefer of The Athletic, the Colts have all but made up their minds that after last season's late meltdown, Wentz's time in Indianapolis is going to be brief.",
    "Minnesota's pass defense ranked 28th a year ago, and two of the team's top three cornerbacks (Patrick Peterson and Mackensie Alexander) are about to hit free agency.",
    "The problem is the team lacks the resources to attack them, as Minnesota has the fourth-worst cap situation in the league, sitting $14 million and change in the red.",
    "That latter need is the reason that more than one mock draft of late has forecast Alabama offensive tackle Evan Neal as the first overall pick in this year's draft.",
    "After the Ryan Fitzpatrick experiment failed in spectacular fashion last season, the Commanders would probably just as soon eschew the second-tier free-agent route.",
    "Trading him would knock over $25 million off the books for San Fran, and there are those who believe that the 30-year-old could fetch as much as a first-round pick.",
    "Houston Texans\nGet Deshaun Watson off the team\nOverhaul the offense\nOverhaul the defense\nThe Houston Texans have arguably the league's most talent-deficient roster.",
    "The Bengals need to bring back safety Jessie Bates, and as with most teams, the defending AFC champions could use some added talent on the back end of the defense.",
    "Thanks in part to injuries, an offensive line that was one of the team's strengths dropped outside the top 20 in the end-of-season rankings at Pro Football Focus.",
    "Los Angeles Chargers\nBring back Mike Williams\nStrengthen the secondary\nUpgrade the run defense\nThe 2021 season didn't end the way the Los Angeles Chargers wanted.",
    "Most of the improvements the Giants make in 2022 will hinge on this year's festivities in Las Vegas, as New York is over $11 million upside down against the cap.",
    "That offense only stays loaded if the Chargers prevent any major losses on that side of the ball, which makes re-upping wide receiver Mike Williams a priority.",
    "The Raiders have an underrated defensive line, but that line could take a hit in 2022 with tackles Quinton Jefferson and Solomon Thomas headed for free agency.",
    "\"In light of some conversations over the last six or seven days, it's my full expectation that he is moved by the end of this free-agency period,\" Keefer said.",
    "The Broncos are at least well-positioned to be players in free agency, as Denver is sitting on the sixth-most cap space ($39 million and change) in the league.",
    "The Bengals have the cash (and the cache) to do some damage up front, as only three teams have more cap space than the $48.8 million Cincinnati is sitting on.",
    "But while it's possible a trade could happen, the most likely scenario remains Jalen Hurts staying the team's starting quarterback for at least one more year.",
    "Georgia's Nakobe Dean could be in play for Philly, and Utah's Devin Lloyd has been a popular hypothetical target for the Eagles among the draftnik community.",
    "Re-signing Brown and Mathieu will all but certainly put the Chiefs tight against the cap, so bolstering the pass rush or secondary will take some creativity.",
    "Replace the irreplaceable\nRebuild vs. Reload\nReassemble a wide receiver corps\nThe Tampa Bay Buccaneers have a simple enough offseason dilemma ahead of them.",
    "1 pass defense last year, while maintaining (if not improving) the offensive line is a substantial priority for a team with aspirations of a Super Bowl run.",
    "But despite the team's financial complications, Kansas City has to figure out a way to retain offensive tackle Orlando Brown Jr. and safety Tyrann Mathieu.",
    "Couple that with last season's Antonio Brown fiasco, and a wideout corps that was a strength for the Buccaneers six months ago is now a glaring weakness.",
    "Offensively, last year's Julio Jones trade and some bad contracts (Jones' deal included) don't leave a lot of leeway on the offensive side of the ball.",
    "With that said, while every team has work to do in the offseason, the items on the list in need of being checked off can vary widely from team to team.",
    "Both quarterback Kirk Cousins ($45 million cap hit) and edge-rusher Danielle Hunter $26.1 million cap hit) are candidates to have their deals redone.",
    "But the Patriots fielded the league's second-best pass defense in 2021 in large part because of Jackson's ability to lock down one side of the field.",
    "Vegas could stand to add some beef on the interior defensive line, with Georgia tackle Travon Walker a potential target with the 22nd overall pick.",
    "The Raiders were a respectable 13th in pass defense in 2021, but the team's best cover man (veteran Casey Hayward) is about to hit the open market.",
    "Getting tackle DeForest Buckner and second-year edge-rusher Kwity Paye some pass-rushing help is the Colts' top priority on that side of the ball.",
    "Adding Michigan edge-rusher Aidan Hutchinson would not only fill arguably the biggest hole on the team but also do so with a \"hometown\" prospect.",
    "But you don't have to look far to find a mock draft projecting the Panthers to look hard at this year's top quarterbacks with their first pick.",
    "Miami allowed 40 sacks in 2021, ranked 30th in rushing yards and sported the lowest-graded line in the league, according to Pro Football Focus.",
    "General manager John Lynch would be well-served to keep the offensive line together by re-signing guard Laken Tomlinson, who was solid in 2021.",
    "The first is the future of edge-rusher Chandler Jones, who is set to hit free agency after ranking second on the team with 10.5 sacks in 2021.",
    "No, that second overall pick will probably be used on a defense that needs everything from pass-rushers to safeties and all points in-between.",
    "New York's 34 total sacks last year ranked 22nd in the NFL, and improvement by the team as a whole depends on getting better in the trenches.",
    "Whether it's Notre Dame safety Kyle Hamilton or LSU cornerback Derek Stingley Jr., the Jets should just about have their pick of the litter.",
    "High-priced veterans such as Preston Smith and Za'Darius Smith could be sent packing as part of the opening salvo of a post-Rodgers rebuild.",
    "The former cost the Chiefs a first-round pick in a trade with the Ravens, while the latter is arguably Kansas City's best defensive player.",
    "The Chargers have to turn that run D around, which means adding upgrades along the interior of the defensive line and at inside linebacker.",
    "Defensively, the Steelers have the reigning Defensive Player of the Year in T.J. Watt, but the pass defense struggled in coverage at times.",
    "Until the Bucs have at least a rough idea of how they are proceeding, they won't know how best to allocate what little cap space they have.",
    "The moment that one of those offers goes from thought exercise to real possibility, everything changes for general manager John Schneider.",
    "Like many of the teams in this piece, it's almost as important that the Steelers improve the protection in front of their new quarterback.",
    "With veterans Brandon Williams and Calais Campbell headed for free agency, Baltimore's defensive line could be in for big changes in 2022.",
    "But having no plans to trade Wilson doesn't preclude suitors from making offers—the sorts of offers that could become staggeringly large.",
    "Of course, that trade will also leave the Texans with a massive hole at the quarterback position, one they likely won't fill with the No.",
    "That bucket of cash the Jets have under the cap, on the other hand, could be best used to try luring a high-end free-agent pass-catcher.",
    "There are also multiple free agents in the secondary, including cornerbacks Jason Verrett and K'Waun Williams and safety Jaquiski Tartt.",
    "That's the question that will dominate the conversation in Green Bay until Aaron Rodgers makes his intentions clear for the 2022 season.",
    "But per Sayre Bedinger of Predominantly Orange, Denver general manager George Paton said:\n\"Unfortunately, they're not falling off trees.",
    "Chicago Bears\nRevamp the pass-catching corps\nImprove the offensive line\nGet better at cornerback\nIt's the dawn of a new era in Chicago.",
    "But teams with Super Bowl aspirations can't afford to let 25-year-old pass-rushers who just paced the squad in sacks walk out the door.",
    "The Commanders have a young star at wide receiver in Terry McLaurin, but the drop-off after Scary Terry is terrifying in its own right.",
    "Improve the offensive line\nBolster the edge-rushers\nLook to trade a veteran for future picks\nSome things never change in the Big Apple.",
    "What they don't possess is much in the way of wiggle room against the salary cap—Buffalo is in the red to the tune of over $2 million.",
    "Until Rodgers has more to say on the subject than cryptic Instagram posts, the Packers don't know if they are rebuilding or reloading.",
    "There's one way the team could make those decisions easier: find a taker on the trade market for veteran quarterback Jimmy Garoppolo.",
    "There has been speculation that the Buccaneers could get aggressive in attempting to replace Tom Brady by trading for Deshaun Watson.",
    "The Seahawks also allowed more passing yards per game last season than any team in the NFC, so some help in the secondary is needed.",
    "The Jets are sitting on the fifth-most cap space in the league ($44.7 million) and have two selections inside the top 10 this year.",
    "Even if the Rams can bring Beckham back in 2022, the timing of his latest ACL tear puts his Week 1 eligibility in serious jeopardy.",
    "The team's 32 sacks allowed ranked in the middle of the pack last season, but PFF still graded the unit in the league's bottom 10.",
    "The other of those two top-seven picks will probably be spent on one of this year's multitude of high-end pass-rushing prospects.",
    "Green Bay Packers\nResolve the Aaron Rodgers saga\nBolster the front seven\nSort out the wide receiver position\nWill he or won't he?",
    "The Bears aren't without needs on defense as well—needs that won't be easy to address without a pick in the first round in 2022.",
    "Still, given the unsettled nature of the other teams in the NFC South, the Falcons could contend for the division title in 2022.",
    "No matter who is playing under center in Philadelphia this year, the team needs to improve the passing-game weaponry around him.",
    "Survive the capocalypse\nAddress the mess under center\nAdd talent at wide receiver\nThe New Orleans Saints have problems—plural.",
    "The Steelers have offered up a vote of confidence in fourth-year veteran Mason Rudolph, who has started 10 games for the team.",
    "And there are a couple of spots that stand out as good places to invest some of Chicago's $26 million and change in cap space.",
    "Cincinnati Bengals\nImprove the offensive line\nImprove the offensive line\nImprove the offensive line\nIs there an echo in here?",
    "Oh, and the Saints' salary-cap situation is an absolute disaster, as New Orleans is a knee-buckling $76.2 million in the red.",
    "The pass rush could be an issue as well, especially if Hunter and/or free agents such as Anthony Barr move on to other teams.",
    "That defensive help could also come via the 30th pick in the draft in a youngster such as Clemson cornerback Andrew Booth Jr.",
    "Given all the issues the Panthers already have, adding to the pile by popping holes defensively isn't going to help matters.",
    "The cornerback position already is—the Cardinals could use an infusion of both depth and talent in the defensive backfield.",
    "The Commanders have the coin to make an impact signing or three, as the team is sitting on almost $31 million in cap space.",
    "But every decision Seattle is about to make comes down to one question: Is Wilson really in the Seahawks' long-term plans?",
    "But there's enough to make at least one impact signing, and the spot that could use the most help is probably cornerback.",
    "The team doesn't sport the weakest assemblage of pass-catching talent in the league, but it's also nowhere near the best.",
    "Daniel Jeremiah of NFL.com recently identified Pitt signal-caller Kenny Pickett as a potential target with the 18th pick.",
    "However, there are areas on the roster that simply must be improved for the Falcons to make any kind of push this season.",
    "Whether it's Watson, Tua Tagovailoa or someone else, it's hard for a quarterback to succeed without weapons or blocking.",
    "Pittsburgh fielded the seventh-worst line in the league last season, per PFF, and ranked 29th in the league in rushing.",
    "Edge-rusher Takkarist McKinley is also a pending free agent, as are defensive tackles Malik Jackson and Malik McDowell.",
    "Again, second overall is early to draft any of this year's receivers, but a Day 2 rookie or veteran add would be wise.",
    "The Bills have one of the league's best receivers in Stefon Diggs and a potential star in the making in Gabriel Davis.",
    "But in addition to the first pick in April, the Jags also have the third-most cap space ($56.1 million) in the league.",
    "Whether or not Rodgers is in green and gold come training camp dictates everything the team does from now until then.",
    "The first step is deciding whether Baker Mayfield's injury-marred mess of a 2021 campaign was more rule or exception.",
    "Godwin may well be the most sought-after receiver in free agency this year, which all but guarantees he's moving on.",
    "What is broken in Los Angeles is a run defense that surrendered 138.8 yards per game, the third-most in the league.",
    "With the two-time defending MVP on the roster, the Packers are one of the leading Super Bowl contenders in the NFC.",
    "In most other years, given Detroit's situation under center, a quarterback would be in play with that second pick.",
    "The Eagles have seemingly been trying to upgrade at linebacker since long before head coach Nick Sirianni arrived.",
    "Until they settle on one, there isn't a team in the league in more dire need of a veteran upgrade at the position.",
    "To date, there's been nothing to indicate he isn't, as he has stated he wants to remain in the Pacific Northwest.",
    "Star wide receiver Davante Adams will undoubtedly be brought back via the franchise tag or a long-term extension.",
    "That contract (and how it is structured) will go a long way toward dictating how the Ravens approach free agency.",
    "No team had fewer sacks than the 18 the Falcons amassed in 2021—fewer than Pittsburgh's T.J. Watt had by himself.",
    "Adding a backup for Jared Goff on Day 2 is a possibility, but it's likely his team for at least one more season.",
    "The Saints remain optimistic that Michael Thomas will be back this season, but the talent behind him is wanting.",
    "Head coach Sean Payton is gone, replaced by a coach in Dennis Allen who is 20 games under .500 over his career.",
    "While the Bears are retooling Fields' receivers, the team also needs to improve the protection in front of him.",
    "Poles' edict is clear: increase Justin Fields' chances of success in year two by improving the team around him.",
    "Kidding aside, there isn't a team with more clarity on their offseason to-do list than the Cincinnati Bengals.",
    "It's going to take more than a little financial finagling just to get the Saints into compliance with the cap.",
    "There's no way that Tampa can afford them all, and if the team is starting a rebuild, it may not even want to.",
    "After spending a fortune in free agency last year, the Patriots aren't working with much cap space this year.",
    "No team in the NFC tallied more sacks than the Vikings in 2021, but no Minnesota player had more than eight.",
    "It feels like forever that the Giants have been trying to improve one of the league's worst offensive lines.",
    "It's a deep crop at the position in both free agency and the draft, so there are multiple options available.",
    "The Raiders have an excellent slot receiver and tight end, but the perimeter receivers could use some work.",
    "The former has been a popular pick in mock drafts of late, with Georgia's Jordan Davis a trendy pick at No.",
    "With only about $11.5 million in cap space, the team doesn't have a ton of scratch with which to meet them.",
    "Jackson's chances of a rebound in 2022 hinge at least in part on Baltimore's ability to rectify that issue.",
    "Green set to hit free agency, the wide receiver depth behind DeAndre Hopkins could soon be a major concern.",
    "Every NFL Team's 2022 Offseason To-Do List\nHere's the thing about the NFL offseason—there really isn't one.",
    "If Adams gets the franchise tag but Rodgers isn't hanging around, it's likely so the former can be traded.",
    "But if at all possible, the Titans should pursue an improvement at tight end in free agency or the draft.",
    "Defensively, the Colts managed just 33 sacks in 2021, a number that slotted the team 25th in the league.",
    "Surprisingly, per Phil Perry of NBC Sports Boston, Jackson said the Pats haven't discussed an extension.",
    "Green Bay will do anything and everything it can to improve the roster for one more run at a Super Bowl.",
    "After posting 34 sacks in 2021 (10th-fewest in the league), Seattle needs to add some pop off the edge.",
    "But Emmanuel Sanders is a free agent and Cole Beasley has been mentioned as a potential cut candidate.",
    "Other than that, Buffalo's offseason will be more polishing the edges than rebuilding the foundation.",
    "Quite the opposite, as there are only two teams farther upside-down against the cap than the Cowboys.",
    "Once the Vikings do manage to wrangle some cap room, the team's biggest areas of need are on defense.",
    "Per Pro Football Focus, no team in the NFC fielded a worse offensive line in 2021 than the Panthers.",
    "There will be no shortage of handwringing regarding megadeals for Aaron Rodgers and Russell Wilson.",
    "10) and another team makes the Jets an offer, a trade down in the first round could be a wise move.",
    "Marvin Jones is a capable veteran wideout, and Laviska Shenault has shown flashes of explosiveness.",
    "Still, as first-year coaches go, Josh McDaniels inherited a roster that's in relatively good shape.",
    "There's work to be done—work that won't be especially easy with negative-$6.9 million in cap space.",
    "Once the Niners clear some cap space, there are a couple of items that will need to be addressed.",
    "But whether it's late on Day 1 or at some point on Day 2, the Chiefs need to add a wide receiver.",
    "Guards Michael Jordan and John Miller combined to surrender a whopping 13 sacks in just 21 games.",
    "There are a few areas that the team needs to address, though—or at least potential areas of need.",
    "Pro Football Focus barely graded Denver's offensive line inside the league's top 20 last season.",
    "Maybe this is finally the year they find a reliable secondary wideout to pair with Tyreek Hill.",
    "That puts the team squarely in the bidding for high-end free agents at just about any position.",
    "There is an urgency to get the right guy, the right quarterback, but you just can't force it.\"",
    "The Lions have over $20 million in cap space and own the second overall pick in April's draft.",
    "Cleveland has $24.9 million in cap space, but addressing premium positions doesn't come cheap.",
    "Even with some creative accounting, the Bills aren't going to be major players in free agency.",
    "The team's highest-graded interior lineman (center Matt Paradis) is about to hit free agency.",
    "However, he could fetch the Texans a boatload of draft picks if a trade partner can be found.",
    "Tre'Davious White's health and Levi Wallace's free agency raise questions with the NFL's No.",
    "The bad news is the team has way more holes than that amount of cash and one pick will fill.",
    "For every club with just a hole or two to fill, there's one with needs all over the roster.",
    "That's not going to make keeping the team's own free agents easy, much less sign outsiders.",
    "The Jaguars were 22nd in passing offense in 2021, averaging just over 202 yards per game.",
    "The team has a talented young wideout in DeVonta Smith, but there's not much behind him.",
    "Colorado State's Trey McBride has gotten some hype in mock draft circles in that regard.",
    "One thing is for sure: The Ravens have to get better up front on both sides of the ball.",
    "But the team's most likely avenue of landing a new signal-caller remains the 2022 draft.",
    "Only one Cleveland receiver topped 50 catches last year, and he could be a cap casualty.",
    "The list of pending unrestricted free agents the Cowboys have in 2022 is a daunting one.",
    "However, if Rodgers decides he wants to retire or play elsewhere, the paradigm changes.",
    "Edge-rusher Harold Landry, for one, will be in high demand after a career year in 2021.",
    "The Seahawks also have the war chest ($35.4 million) to make some noise in free agency.",
    "Hill has already demonstrated that at best he's a short-term Band-Aid at the position.",
    "That cap room is that much slimmer when you consider the Chiefs' in-house free agents.",
    "That possibility will probably preclude the team from going into full rebuilding mode.",
    "A team that's more than one or two surgical strikes away from going, well, anywhere.",
    "All the team has to do is replace the greatest quarterback the NFL has ever known.",
    "The games may end in February, but for NFL teams the work most assuredly does not.",
    "There's a new head coach in Matt Eberflus and a new general manager in Ryan Poles.",
    "Seattle's offseason to-do list looks much different without Wilson than with him.",
    "The quarterback room consists of gadget player Taysom Hill, and that's about it.",
    "But while the team made improvements last season, there's still work to be done.",
    "The team would also save at least $24 million under the cap by trading Watson.",
    "Just improving the quarterback spot won't fix all Washington's offensive ills.",
    "2 receiver or look to draft one within the first two or three rounds in April.",
    "Regardless of how they do it, the Saints have to do something at quarterback.",
    "That likely makes the first order of business clearing up salary cap space.",
    "The kind that could allow the team to almost instantly reset the franchise.",
    "Dallas isn't exactly in a position to get tied up in a bidding war, either.",
    "Whoever is taking the snaps in Week 1, there's work to be done around him.",
    "For starters, the Rams' position relative to the salary cap is…not ideal.",
    "It's a list with one item on it in giant, glowing, 14-foot tall letters.",
    "But per PFF, there were only two worse O-lines in the league last year.",
    "It can be argued that quantity is nearly as important as quality here.",
    "Repeating that finish without an \"anchor\" edge-rusher won't be easy.",
    "Even if the team had a quarterback, the wide receivers aren't good.",
    "With that said, they have multiple needs on both sides of the ball.",
    "Chark is headed for free agency after an injury-marred 2021 season.",
    "We'll cast a wide net there too like we do at every other position.",
    "Terrell, the talent in the secondary isn't scaring anyone, either.",
    "But this year's crop at the position isn't especially impressive.",
    "The team has Darnell Mooney at wide receiver—and that's about it.",
    "The team has also said it has no plans to trade the 33-year-old.",
    "But until one thing happens, the Texans can't start rebuilding.",
    "Houston has to get quarterback Deshaun Watson off the roster.",
    "There's also the matter of Carolina's situation under center.",
    "If the right player isn't there at either of those spots (No.",
    "That will more likely than not change, or at least it should.",
    "\"I guess they feel like they don't need me,\" Jackson said.",
    "Vegas isn't sitting on a ton of cap space ($19.8 million).",
    "It's the first domino of many that needs to fall in Tampa.",
    "One of them getting released outright can't be ruled out.",
    "Edge-rusher isn't the only spot Arizona needs to address.",
    "Contract and salary-cap information courtesy of Spotrac.",
    "Multiple first-round picks and starter-caliber players.",
    "Wide receiver needs to be a priority for the team too.",
    "I think this is a when situation, not an if situation.",
    "\"Whether that's a cut or a trade remains to be seen.",
    "The team needs help wherever it can get it up front.",
    "This is a roster that's a long way from contending.",
    "Offensively, the biggest need lies on the outside.",
    "Jacksonville's offensive line needs work as well.",
    "There are holes at more position groups than not.",
    "Are there other areas that need to be addressed?",
    "But the unit lacks a \"go-to\" receiver, and D.J.",
    "It's a similar story along the offensive line.",
    "FIX THE OFFENSIVE LINE IN FRONT OF JOE BURROW.",
    "Among them, cornerback is the most pressing.",
    "The defensive line could also use some work.",
    "In fact, they are $13 million over the cap.",
    "\"I guess I can't be that important to them.",
    "For starters, the offensive line is awful.",
    "I know I am, but they're not showing me.\"",
    "Miami could add even more offseason ammo.",
    "All will have suitors on the open market.",
    "There are also glaring needs on defense.",
    "Those problems on offense aren't minor.",
    "Both are also on the wrong side of 30.",
    "Depth at wideout may become a problem.",
    "Outside of 23-year-old cornerback A.J.",
    "None amassed even 600 receiving yards.",
    "New England can't afford to lose him.",
    "Washington needs to add a veteran No.",
    "Don't fix things that aren't broken.",
    "I think the decision has been made.\"",
    "That space could evaporate quickly.",
    "With both Christian Kirk and A.J.",
    "We're looking and we will look.",
    "The first is at wide receiver.",
    "Bargain-bin free agents.",
    "3 pick in the draft.",
    "Day 2 draft picks.",
    "No problem, right?",
    "That's the thing.",
    "Not in earnest.",
    "Not really.",
    "17 overall.",
    "4 and No.",
    "Both.",
    "Sure."
  ]
}