{
  "id": 9422,
  "mediaId": 2523,
  "date": "2022-03-21",
  "headline": "WR Allen Robinson wants to help Rams reach even higher",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/03/AP20307572761119.jpg?w=1024&h=576",
  "link": "https://www.dailynews.com/2022/03/21/wr-allen-robinson-wants-to-help-rams-reach-even-higher/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.dailynews.com/author/kevin-modesti/",
  "termIds": [
    2257,
    2125,
    3708,
    4564,
    4073,
    4186,
    265,
    731,
    859
  ],
  "sentences": [
    "“I’m excited to get back here in April (for spring workouts) and get work to kind of fine-tune my role in this offense and kind of pinpoint what exactly I’m able to bring to the table.”\nRobinson, a second-round draft pick from Penn State by the Jacksonville Jaguars in 2014, led the NFL in touchdowns (14) and Pro Bowl selection in 2015 and moved to the Bears as a free agent in 2018.",
    "Allen Robinson, the former Chicago Bears receiver the Rams signed as a free agent last week, introduced himself to Los Angeles on Monday as a player with a longing to work with a quarterback like Matthew Stafford, respect for his new team’s winning culture, and a desire to keep expanding his game at age 28.",
    "“I think the environment is going to be a great place for Allen (Robinson) to come in and kind of just step right in and do what he’s expecting from himself.”\nRobinson said he hopes to benefit from having Stafford as his quarterback while Stafford benefits from having another target to pass to.",
    "“Just watching Matt’s career from afar, and seeing all the receivers that he’s played with and seeing everything he’s been able to help his receivers accomplish from Detroit to here,” Robinson said, “for me being able to step into that and build that relationship, that’s what I’m looking for.”",
    "Robinson’s signing, for three years and $46.5 million ($30.7 million guaranteed), allowed the Rams to trade receiver Robert Woods to the Tennessee Titans in exchange for a 2023 sixth-round draft pick and $7.1 million in salary cap relief.",
    "Robinson and center Brian Allen, who spoke with reporters Monday for the first time since re-signing as a free agent for three years and $24 million, both said knowing Stafford will be here was one attraction of signing with the Rams.",
    "I think you get the best of both worlds when it comes to that from him.”\nStafford agreed Saturday to a four-year, $160 million contract extension ($135 million guaranteed) to stay with the Rams through the 2026 season.",
    "“It’s an exciting thing as a player to know where you’re going to be, kind of put some roots down and try to make something really special for a while.”\nStafford could have commanded more money, contract analysts say.",
    "Even without Woods, and without free agent Odell Beckham Jr. being re-signed yet, it’s a powerful wide receiver corps headed by NFL Offensive Player of the Year Cooper Kupp and including Van Jefferson.",
    "“I just had so much fun playing with this team this year, playing with this organization and this coaching staff, I wanted to make sure that I was able to do that for a long time,” Stafford said.",
    "Guys are body-on-body a whole lot more, and his ability to go up and make catches over guys and around guys is really special,” Stafford said during his own virtual press conference Monday.",
    "Kind of that basketball mentality a little bit,” Robinson said in a virtual press conference with L.A. writers when he was asked what he will bring to the Rams.",
    "In this change, he moves to a Rams team that won the Super Bowl after going 12-5 in the regular season with the NFL’s fifth-most productive passing attack.",
    "Joining an already elite team could be intimidating, but Robinson said he just plans to “be myself.”\n“It’s a great winning culture,” Robinson said.",
    "And as a versatile receiver who brings something extra to the offense with his ability to leap high to grab passes away from defensive backs.",
    "In his first change of teams, Robinson moved to a Bears team that had gone 5-11 in 2017 and helped it improve to 12-4 and win the NFC North.",
    "“(I’ve been) able to see the success that they’ve had over the past years, year in and year out, and how they continue to get better.",
    "All of those guys have been able to play and be at their best.”\nKnowing a few Rams already gives him a head start in fitting in.",
    "“I think I’m a very versatile player, (with a knack for) route-running ability, 50-50 balls, contested catches, jump balls.",
    "I see that across the board from players that they bring in, whether that’s draft, free agency, whatever the case may be.",
    "Robinson played at the same Detroit-area high school, St. Mary’s Prep, as Jefferson (though not at the same time).",
    "A big target like this is something Rams coach Sean McVay and General Manager Les Snead coveted in recent years.",
    "He played with cornerback Jalen Ramsey with the Jaguars and outside linebacker Leonard Floyd with the Bears.",
    "“But at the same time, for a guy his size, I think he does a great job of separating (from coverage) too.",
    "Stafford said he sees Robinson’s skill set paying off in the red zone, close to the opposing end zone.",
    "“There’s just less field for defenders to defend, therefore it’s a little bit easier to cover guys.",
    "But the contract is set up to leave the Rams money to keep surrounding Stafford with talent.",
    "His familiarity with Stafford, and vice versa, comes from three years of Bears-Lions games.",
    "After winning the Super Bowl, the Rams and their offense might have nowhere to go but down.",
    "They’ve responded to that danger by adding a wide receiver who specializes in going up.",
    "I think it’ll work out the best for all of us, which I’m excited about,” he said.",
    "“I think it was just the right time and right place to do something like that.",
    "“Matthew’s such a great leader, just such a good person, easy to work with.",
    "It’s not like that everywhere,” Brian Allen said."
  ]
}