[
  {
    "id": 3612,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona GOP Candidate <span class='selected-term'>Kari Lake</span> on OAN: Biden “Couldn’t Even Attract the Number of People at the Port-o-Johns” at a Trump Rally (VIDEO)\nPart of the border in Yuma, Arizona, doesn’t even have a barrier, and illegal immigrants walk into our country and surrender.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona Gubernatorial Candidate Kari Lake: “DAY ONE – We Will Issue A Declaration Of Invasion”, Plans An Interstate Compact To Secure Southern Border"
  },
  {
    "id": 3820,
    "mediaId": 2540,
    "date": "2022-01-27",
    "sentence": "The headline was repeated on Twitter by <span class='selected-term'>Kari Lake</span>, a Republican candidate for Arizona governor.",
    "author": "Daniel Dale",
    "title": "Fact check: Right-wing website falsely claims Wisconsin assembly voted to withdraw its Biden electoral votes"
  },
  {
    "id": 940,
    "mediaId": 8475,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Jeremy Duda",
    "title": "Arizona GOP gov candidates embrace Brnovich’s opinion on using troops to repel border 'invasion'"
  },
  {
    "id": 1095,
    "mediaId": 2595,
    "date": "2022-02-11",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 10, 2022\nKari Lake Tapes the Loser as He’s Taping Her and Trying to Destroy Her – She’s Prepared\nThis next bit is great where she goes after the snob.",
    "author": "M Dowling",
    "title": "We Would Hate to Be the Dem Running Against Kari Lake – Watch 3 videos!"
  },
  {
    "id": 13135,
    "mediaId": 2738,
    "date": "2022-03-06",
    "sentence": "But now he has a new plan: he’s filing a class action lawsuit against “all machines.”\nAt a rally for Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, another Big Lie cheerleader, Lindell talked about how, on top of everything else he’s done to promote his nonsense claims — presumably while also running a pillow business — he’s been tirelessly planning to sue technology, or something.",
    "author": "Matt Prigge",
    "title": "Mike Lindell Has Threatened A Class Action Lawsuit Against ‘All Machines’ In His Latest Attempt To Prove The ‘Big Lie’"
  },
  {
    "id": 11363,
    "mediaId": 2596,
    "date": "2022-03-07",
    "sentence": "He was appearing at a rally for Arizona GOP gubernatorial candidate and fellow Big Lie believer <span class='selected-term'>Kari Lake</span> recently we he said he’s planning to sue technology, seemingly as a whole.",
    "author": "",
    "title": "Trump fanatic Mike Lindell is filing a lawsuit against 'all machines'"
  },
  {
    "id": 16022,
    "mediaId": 8349,
    "date": "2022-03-10",
    "sentence": "The Arizona GOP filed a lawsuit with the Supreme Court claiming mail-in ballots are unconstitutional and <span class='selected-term'>Kari Lake</span> filed an amicus brief to urge the Arizona Supreme Court to take the case.",
    "author": "Garret Lewis",
    "title": "Garret Talks To Kari Lake About Joining Lawsuit To Stop Mail-In Ballots"
  }
]