[
  {
    "id": 4574,
    "mediaId": 2605,
    "date": "2022-01-06",
    "sentence": "In Arizona, he endorsed <span class='selected-term'>Kari Lake</span>, a former television broadcaster running for governor who falsely claims Trump won the state.",
    "author": "Chris Megerian",
    "title": "The battle for the Capitol ended. The war for democracy continues"
  },
  {
    "id": 3689,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "Bringing along names like <span class='selected-term'>Kari Lake</span> and Mike Lindell to warm up the crowd, Trump didn’t hold back when it came time for him to speak, bashing President Joe Biden’s leadership when it came to the Southern border, the Capitol Hill January 6 incident, and COVID-19.",
    "author": "Red Voice Media",
    "title": "Trump Rails Biden’s ‘Ridiculous Unscientific’ Big Pharma Mandates And Dem Race-Based COVID Treatments [VIDEOS]"
  },
  {
    "id": 3671,
    "mediaId": 2590,
    "date": "2022-01-17",
    "sentence": "“You could tell it wasn’t Trump,” Protzman said in a live chat excerpted below, referring to a moment where the former president invited Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to the stage.",
    "author": "David Moye",
    "title": "Some QAnon Believers Think JFK Disguised Himself As Trump At Arizona Rally"
  },
  {
    "id": 3643,
    "mediaId": 2614,
    "date": "2022-01-17",
    "sentence": "While Trump has endorsed Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> in Arizona, he has yet to issue an endorsement in the state’s Senate primary.",
    "author": "RobManess.com",
    "title": "Trump Eviscerates Biden For Being ‘Incompetent’ – Predicts ‘Red Wave’ Is Coming"
  },
  {
    "id": 4202,
    "mediaId": 2614,
    "date": "2022-01-18",
    "sentence": "ARIZONA – Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span>, who became a rising star in the conservative movement in Arizona after spending over two decades in broadcast journalism within the state, recently proposed forming an interstate compact in effort to combat illegal immigration stemming from the southern border.",
    "author": "Red Voice Media",
    "title": "AZ Gubernatorial Candidate Kari Lake Proposes Interstate Compact To Combat Illegal Immigration"
  },
  {
    "id": 4297,
    "mediaId": 2818,
    "date": "2022-01-19",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> has a day one plan if she’s elected.",
    "author": "The First",
    "title": "‘DAY ONE, I’LL CLOSE THE BORDER’: Candidate for AZ Governor Says She Will Issue a ‘Declaration of Invasion’"
  },
  {
    "id": 3951,
    "mediaId": 2605,
    "date": "2022-01-20",
    "sentence": "Prominent at Trump’s rally was <span class='selected-term'>Kari Lake</span>, his choice to dump Arizona Gov.",
    "author": "Jackie CalmesColumnist",
    "title": "Column: Biden’s first year is a chronicle of Republican obstruction and Trump’s shadow"
  },
  {
    "id": 3682,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Trump endorsed Paxton in July 2021, while his wife Angela, a candidate for state senate in Texas, picked up the former president’s backing a couple of weeks after the fundraiser.”\nEverson notes that two other Republicans “whose campaigns have spent at least $50,000” at Mar-a-Lago are <span class='selected-term'>Kari Lake</span> and Sarah Huckabee Sanders.",
    "author": "Alex Henderson",
    "title": "Texas AG Paxton’s campaign spent $50,000 at Mar-a-Lago: report"
  },
  {
    "id": 3633,
    "mediaId": 2578,
    "date": "2022-01-21",
    "sentence": "Arizona must follow suit and protect ALL workers from losing their job for not taking the shot pic.twitter.com/z1jdHqJFXB\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) January 21, 2022",
    "author": "Jim Hoft",
    "title": "BREAKING: Federal District Judge Blocks Biden’s Last Vaccine Mandate on Federal Employees"
  },
  {
    "id": 3935,
    "mediaId": 2748,
    "date": "2022-01-22",
    "sentence": "Arizona Trump-endorsed GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span> tweeted a portion of the judge’s order and demanded that the state of Arizona “must follow suit and protect ALL workers from losing their job for not taking the shot.”\nRead the judge’s decision here:",
    "author": "",
    "title": "BREAKING: Fed District Judge Deals Another Blow To Authoritarian Biden Regime...Rules Against Federally Mandated COVID Jab For Workers"
  },
  {
    "id": 4197,
    "mediaId": 2642,
    "date": "2022-01-22",
    "sentence": "Arizona must follow suit and protect ALL workers from losing their job for not taking the shot pic.twitter.com/z1jdHqJFXB\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) January 21, 2022\nThis case was about whether the president may “force millions of federal workers to undergo a medical treatment as a condition of their employment” simply by signing an executive order, according to Brown’s decision.",
    "author": "Wayne Dupree",
    "title": "Biden’s Proposed Federal Mandate For Federal Workers Dealt Another Blow By Trump-Appointed Federal Judge!!"
  },
  {
    "id": 4014,
    "mediaId": 8345,
    "date": "2022-01-25",
    "sentence": "“I'm talking to people every day around this state,” said <span class='selected-term'>Kari Lake</span>, a former television news anchor now seeking the GOP nomination for governor.",
    "author": "",
    "title": "GOP election rules advance, include releasing ballot images"
  },
  {
    "id": 4356,
    "mediaId": 2530,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Sarah Mimms",
    "title": "Trump Supporters Believe Wisconsin Withdrew Its Electoral College Voters For Joe Biden. It Never Happened."
  },
  {
    "id": 4396,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "\"I endorsed [Starbuck] months ago and I stand by my endorsement,\" tweeted Rep. Madison Cawthorn, R-N.C.\n\"I endorsed Robby months ago & believe he's exactly what we need in these difficult times,\" wrote Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Igor Derysh",
    "title": "Allies revolt after Trump endorses rival to MAGA darling: He 'has it completely wrong'"
  },
  {
    "id": 3858,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alex Henderson",
    "title": "GOP state majority leader slams far-right MAGA rep for proposing Wisconsin retract electoral votes for Biden: 'It is illegal'"
  },
  {
    "id": 3649,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "\"I endorsed [Starbuck] months ago and I stand by my endorsement,\" tweeted Rep. Madison Cawthorn, R-N.C.\n\"I endorsed Robby months ago & believe he's exactly what we need in these difficult times,\" wrote Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Igor Derysh",
    "title": "'Trump has it completely wrong': Allies revolt after Trump endorses rival to MAGA darling"
  },
  {
    "id": 3424,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "“While Trump has recently taken aim at vaccine skepticism — rejecting concerns about its efficacy in a December interview with far-right commentator Candace Owens and revealing that he received a booster dose — some of his top proxy candidates are promoting a contrary message on the campaign trail.”\nNEW: Many Trump-endorsed candidates who have blindly embraced his claims about the 2020 election are showing a rare willingness to challenge him on Covid-19 vaccines.https://www.cnn.com/2022/01/31/politics/trump-candidates-covid-vaccines/index.html\\u00a0\\u2026\n— Gabby Orr (@Gabby Orr) 1643645160\nThose GOP anti-vaxxers, according to Orr, range from Arizona gubernatorial hopeful <span class='selected-term'>Kari Lake</span> to Joe Kent — who is giving Rep. Jaime Herrera Beutler a primary challenge in Washington State.",
    "author": "Alex Henderson",
    "title": "Trump’s pro-vaccine message is putting him at odds with far-right MAGA anti-vaxxers he has endorsed: report"
  },
  {
    "id": 3044,
    "mediaId": 2512,
    "date": "2022-02-01",
    "sentence": "If candidates like <span class='selected-term'>Kari Lake</span> in Arizona and David Perdue in Georgia are successful, it would give them final say over whether to certify a slate of electors for a presidential candidate.”\nPanetta adds, “Such trends raise the risk of a disputed or possibly stolen election in the 2022 midterms.",
    "author": "Alex Henderson",
    "title": "Here’s how 'rogue' GOP governors could steal the 2024 election for Trump — and cause a 'constitutional tailspin'"
  },
  {
    "id": 3334,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was recently interviewed by an ABC rookie journalist.",
    "author": "",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 3162,
    "mediaId": 2543,
    "date": "2022-02-03",
    "sentence": "An ABC News reporter sought to corner Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "author": "Randy DeSoto",
    "title": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM"
  },
  {
    "id": 3535,
    "mediaId": 2594,
    "date": "2022-02-03",
    "sentence": "Among them are Trump-endorsed candidates running for governor in closely watched states that voted for Joe Biden: <span class='selected-term'>Kari Lake</span> of Arizona and former US Senator David Perdue of Georgia.",
    "author": "Alex Woodward",
    "title": "How members of Congress plan to stop the next Trump from stealing a presidential election"
  },
  {
    "id": 16655,
    "mediaId": 2720,
    "date": "2022-02-03",
    "sentence": "An ABC News reporter sought to corner Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "author": "Randy DeSoto",
    "title": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM"
  },
  {
    "id": 2028,
    "mediaId": 2557,
    "date": "2022-02-04",
    "sentence": "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nThe DML News App offers the best in news reporting.",
    "author": "DML News App",
    "title": "WATCH: GOP governor candidate turns tables on reporter regarding 2020"
  },
  {
    "id": 1871,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> recently suggested that Joe Biden join Rogan’s fact-based show to argue his stance.",
    "author": "Jordan Conradson",
    "title": "Arizona Gubernatorial Candidate Kari Lake: “If I Knew That Joe Biden Could Carry A Coherent Conversation, I’d Suggest He Go On Rogan”"
  },
  {
    "id": 2544,
    "mediaId": 2748,
    "date": "2022-02-05",
    "sentence": "Trump, who has endorsed a number of former Democrats including ex-Obama donor <span class='selected-term'>Kari Lake</span> (AZ), took to the airwaves on Tuesday to offer his thoughts on the decision that has roiled his MAGA base:\n“Well, I didn’t know Robby Starbuck; I have known Morgan; she’s been in the administration; she did a good job,” Trump told anchor Rob Schmitt.",
    "author": "Blarp Blog",
    "title": "The Battle for TN-5: Trump Defends Ortagus Pick and Suggests Robby Starbuck Voted for Obama… Except He Didn’t?"
  },
  {
    "id": 2447,
    "mediaId": 2557,
    "date": "2022-02-07",
    "sentence": "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\n<span class='selected-term'>Kari Lake</span>, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "author": "DML News App",
    "title": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle"
  },
  {
    "id": 2328,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "The motto has surfaced in a campaign video released Monday — which affirms that the active U.S. Navy Reserve Officer, business executive, wife and mother of a toddler has the “complete and total endorsement” of Mr. Trump — who called her “strong and impressive.”\nMs. Ortagus, by the way, describes her young daughter Adina as “the light of our lives.”\nFind her campaign at MorganOrtagus.com\nADVICE FROM <span class='selected-term'>KARI LAKE</span>\nNow here’s an intriguing thought.",
    "author": "Jennifer Harper",
    "title": "Abbott, Biden face off in vaccine wars over National Guard"
  },
  {
    "id": 2067,
    "mediaId": 2599,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Stephen Green",
    "title": "All Republican Candidates Must Learn a Lesson From Arizona Gubernatorial Hopeful Kari Lake."
  },
  {
    "id": 1790,
    "mediaId": 2573,
    "date": "2022-02-08",
    "sentence": "In Arizona, Trump-endorsed gubernatorial candidate <span class='selected-term'>Kari Lake</span> touted her \"historic grassroots\" fundraising.",
    "author": "Paul Steinhauser",
    "title": "2022 elections: Trump-endorsed candidates struggle with fundraising"
  },
  {
    "id": 1095,
    "mediaId": 2595,
    "date": "2022-02-11",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 10, 2022\nKari Lake Tapes the Loser as He’s Taping Her and Trying to Destroy Her – She’s Prepared\nThis next bit is great where she goes after the snob.",
    "author": "M Dowling",
    "title": "We Would Hate to Be the Dem Running Against Kari Lake – Watch 3 videos!"
  },
  {
    "id": 1492,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 1263,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 203,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "Close allies of Mr. Trump — including Rep. Madison Cawthorn, North Carolina Republican; <span class='selected-term'>Kari Lake</span>, the Trump-backed candidate for Arizona Secretary of State; and Jenna Ellis, a former lawyer for Mr. Trump — have already begun using Truth Social.",
    "author": "Ramsey Touchberry",
    "title": "Trump social media app debuts, but early glitches prevent some new users"
  },
  {
    "id": 445,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nThe video, titled “Rigged Elections Have Consequences” calls out the fake news media for their silence on the 2020 election and lists the terrible consequences we face, including our weak southern border and rampant inflation.",
    "author": "Jordan Conradson",
    "title": "INCREDIBLE! Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs"
  },
  {
    "id": 82,
    "mediaId": 2621,
    "date": "2022-02-25",
    "sentence": "159 comments\n<span class='selected-term'>Kari Lake</span>, the longtime Phoenix-area news anchor turned Trump-backed candidate for Arizona governor, has been campaigning with a man who pleaded guilting to trying to hire a hitman to kill an FBI informant.",
    "author": "Alex Griffing",
    "title": "Trump-Backed Candidate For Governor of Arizona Campaigning With Felon Who ‘Plotted to Kill’ FBI Informant: Report"
  },
  {
    "id": 12827,
    "mediaId": 2578,
    "date": "2022-02-26",
    "sentence": "Trump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari lake</span> will warm up the crowd with Rep. Mark Green, Gov.",
    "author": "Jordan Conradson",
    "title": "LIVE-STREAM VIDEO: President Trump To Deliver Remarks At CPAC 2022 in Orlando – 7pm ET"
  },
  {
    "id": 12813,
    "mediaId": 2520,
    "date": "2022-03-04",
    "sentence": "Every one of them, from <span class='selected-term'>Kari Lake</span> to Blake Masters to Matt Salmon to Mark Brnovich to Karrin Taylor Robson, are promising to either finish the wall or miraculously secure our southern border with Mexico.",
    "author": "Elvia Díaz",
    "title": "Trump's $15 billion, supposedly impenetrable border wall with Mexico is a joke"
  },
  {
    "id": 12836,
    "mediaId": 2590,
    "date": "2022-03-06",
    "sentence": "Advertisement\nLindell seemed perfectly serious when he made the announcement during a speech endorsing Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Mary Papenfuss",
    "title": "Mike Lindell Vows 'Class Action' Suit Against 'All Machines' Over Rigged Election Lie"
  },
  {
    "id": 13135,
    "mediaId": 2738,
    "date": "2022-03-06",
    "sentence": "But now he has a new plan: he’s filing a class action lawsuit against “all machines.”\nAt a rally for Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, another Big Lie cheerleader, Lindell talked about how, on top of everything else he’s done to promote his nonsense claims — presumably while also running a pillow business — he’s been tirelessly planning to sue technology, or something.",
    "author": "Matt Prigge",
    "title": "Mike Lindell Has Threatened A Class Action Lawsuit Against ‘All Machines’ In His Latest Attempt To Prove The ‘Big Lie’"
  },
  {
    "id": 12540,
    "mediaId": 2664,
    "date": "2022-03-06",
    "sentence": "Appearing at an Arizona rally for GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, MyPillow CEO Mike Lindell announced his plans to file a class-action suit against \"all machines\" as part of his battle over what he claims was fraud in the 2020 presidential election.",
    "author": "Tom Boggioni",
    "title": "Mike Lindell announces plan to file lawsuit against 'all machines' at Arizona rally"
  },
  {
    "id": 11363,
    "mediaId": 2596,
    "date": "2022-03-07",
    "sentence": "He was appearing at a rally for Arizona GOP gubernatorial candidate and fellow Big Lie believer <span class='selected-term'>Kari Lake</span> recently we he said he’s planning to sue technology, seemingly as a whole.",
    "author": "",
    "title": "Trump fanatic Mike Lindell is filing a lawsuit against 'all machines'"
  },
  {
    "id": 11027,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Trump-backed Arizona candidate threatens Australian journalist: ‘Your days are numbered’"
  },
  {
    "id": 10939,
    "mediaId": 8405,
    "date": "2022-03-09",
    "sentence": "Meanwhile, key allies like <span class='selected-term'>Kari Lake</span>, the Rogers-endorsed candidate for governor, seem to be standing upwind of the woman.",
    "author": "Laurie Roberts",
    "title": "Wendy Rogers v. Kelly Townsend? Get ready, Arizona, for a race for the ages"
  },
  {
    "id": 10934,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 11331,
    "mediaId": 2663,
    "date": "2022-03-14",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> gave quite the performance on 60 Minutes Australia over the weekend, dodging serious questions and abruptly cutting the interview short.",
    "author": "Dan Tracer",
    "title": "Trump-endorsed candidate Kari Lake rants about guns and freedom before storming off “60 Minutes” set"
  },
  {
    "id": 11421,
    "mediaId": 2748,
    "date": "2022-03-15",
    "sentence": "60 Minutes Australia finally aired a small edited portion of Trump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span>’s interview with leftist hack Liam Bartlett.",
    "author": "",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 10911,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 10783,
    "mediaId": 2540,
    "date": "2022-03-15",
    "sentence": "Watch what happened next\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> abruptly stopped an interview with 60 Minutes Australia, after the journalist asked her about the US Capitol attack.",
    "author": "",
    "title": "Trump-endorsed candidate asked about January 6. Watch what happened next"
  },
  {
    "id": 10882,
    "mediaId": 2662,
    "date": "2022-03-15",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe video finally aired on Sunday.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 11504,
    "mediaId": 2790,
    "date": "2022-03-17",
    "sentence": "Sometimes, those things are even lies, like in an ad from Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Domenico Montanaro",
    "title": "The truth in political advertising: 'You're allowed to lie'"
  },
  {
    "id": 11062,
    "mediaId": 2662,
    "date": "2022-03-18",
    "sentence": "President Trump has released a statement putting Arizona Attorney General Mark Brnovich on notice while praising Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> for her huge primary lead, which is greatly due to her agenda to get to the bottom of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "JUST IN: President Trump Puts AZ Attorney General Mark Brnovich On Notice – Asks When Ruling On Election Fraud and large-scale Election Irregularities Is Coming"
  },
  {
    "id": 10895,
    "mediaId": 2512,
    "date": "2022-03-18",
    "sentence": "Pointing to an ad featuring Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>, NPR's Domenico Montanaro noted her remarks at the beginning of the ad.",
    "author": "Meaghan Ellis",
    "title": "'You're allowed to lie': NPR correspondent sheds light on the truth about political advertising"
  },
  {
    "id": 10984,
    "mediaId": 2618,
    "date": "2022-03-18",
    "sentence": "President Trump has released a statement putting Arizona Attorney General Mark Brnovich on notice while praising Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> for her huge primary lead, which is greatly due to her agenda to get to the bottom of the 2020 election.The Maricopa County election audit discovered massive evidence of election law violations and hundreds of thousands of illegal ballots in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "Just In: President Trump Puts AZ Attorney General Mark Brnovich On Notice – Asks When Ruling On Election Fraud and large-scale Election Irregularities Is Coming"
  },
  {
    "id": 8894,
    "mediaId": 2618,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Pam Key",
    "title": "Kinzinger: Many ‘Will Move Heaven and Earth to Ensure’ Trump Doesn’t Win 2024"
  },
  {
    "id": 8923,
    "mediaId": 2618,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Wills Robinson & Josh Boswell",
    "title": "Exclusive: Senator Ron Johnson leads Republicans asking when the 'corrupt' media, Twitter and Facebook will be held to account for taking a YEAR to 'acknowledge' the Hunter Biden laptop story after dismissing it as fake"
  },
  {
    "id": 9638,
    "mediaId": 2520,
    "date": "2022-03-20",
    "sentence": "Opinion: <span class='selected-term'>Kari Lake</span> goes on a weekend tirade against Karrin Taylor Robson, stooping low in her bid to become Arizona's next governor.",
    "author": "Laurie Roberts",
    "title": "Kari Lake goes on the attack and Karrin Taylor Robson must be ... pleased"
  },
  {
    "id": 8907,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Godbehere on Tuesday earned a supportive tweet from former TV anchor <span class='selected-term'>Kari Lake</span>, the far-right conspiracy theorist that Donald Trump is supporting for governor.",
    "author": "",
    "title": "Morning Digest: Mo Brooks just found out Trump's Complete and Total endorsements are anything but"
  },
  {
    "id": 9154,
    "mediaId": 2636,
    "date": "2022-03-25",
    "sentence": "Mr. Trump is backing a former newscaster, <span class='selected-term'>Kari Lake</span>, and Mr. Ducey has not yet endorsed anyone.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump’s Role as the G.O.P. ‘Kingpin’"
  },
  {
    "id": 7950,
    "mediaId": 2818,
    "date": "2022-03-31",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> spoke exclusively with Just The News about her plans to tackle the crisis at the southern border.",
    "author": "The First",
    "title": "‘I’M FINISHING TRUMP’S WALL’: AZ Gubernatorial Candidate Says She’s Not Bluffing, Will Declare Invasion Day One"
  },
  {
    "id": 7716,
    "mediaId": 2833,
    "date": "2022-03-31",
    "sentence": "Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> has urged police to arrest Hunter Biden for child rape crimes.",
    "author": "Sean Adl-Tabatabai",
    "title": "Trump-Backed Arizona Gov. Kari Lake: “Hunter Biden Must Be Arrested for Child Rape”"
  },
  {
    "id": 7558,
    "mediaId": 2642,
    "date": "2022-04-04",
    "sentence": "pic.twitter.com/t5mnazMv8x\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 29, 2022\nIf this was me or you, we’d be in solitary confinement by now.",
    "author": "Missy Crane",
    "title": "[VIDEO] Trump’s AZ Candidate Kari Lake Wants Hunter Charged With “Child Molestation”"
  },
  {
    "id": 7726,
    "mediaId": 8428,
    "date": "2022-04-05",
    "sentence": "Photo credit: Alamy\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> demanded Monday that both Wisconsin and Arizona decertify the results of the 2020 presidential election based on recently unearthed voter fraud evidence.",
    "author": "Timothy Frudd",
    "title": "Kari Lake calls for decertification of Wisconsin and Arizona"
  },
  {
    "id": 7675,
    "mediaId": 2642,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] President Trump’s Candidate for MI Secretary of State is a GOP SUPERSTAR In The Making"
  },
  {
    "id": 7266,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Other guests included former trade adviser Peter Navarro, former White House advisers Kellyanne Conway and Hope Hicks, right-wing attorney Cleta Mitchell, Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>, former spokesman Hogan Gidley, former campaign manager Corey Lewandowski, former White House chief of staff Reince Priebus, Truth Social CEO Devin Nunes and One America News anchor Christina Bobb.",
    "author": "Travis Gettys",
    "title": "Trump holds a dazzling pity party at Mar-A-Lago for debut of election fraud conspiracy film"
  },
  {
    "id": 7163,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "The Trump-backed gubernatorial candidate in Arizona’s 2022 election, former TV news anchor <span class='selected-term'>Kari Lake</span>, told Breitbart News at the premiere that the film “was one of the most important movies I’ve ever seen.”\n“Americans are busy.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Trump at ‘Rigged’ Premiere: ‘It Shouldn’t Be Allowed’ for Mark Zuckerberg to Privately Finance Election Operations"
  },
  {
    "id": 7617,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "Republican and Trump-endorsed gubernatorial candidate <span class='selected-term'>Kari Lake</span> called for the decertification of the election results on Monday, citing the shocking numbers included in Brnovich’s newest report and fraud in Wisconsin.",
    "author": "Summer Lane",
    "title": "Maricopa County election fraud highlighted as some call for decertification of 2020"
  },
  {
    "id": 7567,
    "mediaId": 2642,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "President Trump Just Discovered The GOP’s New SUPER Star"
  },
  {
    "id": 7319,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 7275,
    "mediaId": 2662,
    "date": "2022-04-09",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is broadcasting with Right Side Broadcasting Network tonight.",
    "author": "Jim Hoft",
    "title": "LIVE-STREAM VIDEO: President Trump Holds Another MASSIVE Rally in Selma, North Carolina — Estimated Start Time 7 PM ET"
  },
  {
    "id": 7206,
    "mediaId": 2662,
    "date": "2022-04-09",
    "sentence": "Watch right now on Rumble or through my app!https://t.co/yVIDSuHsyr\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) April 9, 2022",
    "author": "Jim Hoft",
    "title": "THOUSANDS Expected at Trump NC Rally Tonight with Ted Budd, Madison Cawthorn, Dan Bishop and Greg Murphy at 7 PM ET"
  },
  {
    "id": 5914,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "Trump doubled down on his criticism during a fundraiser for Arizona gubernatorial GOP candidate <span class='selected-term'>Kari Lake</span>, who is running for the governorship being vacated by Republican Governor Doug Ducey.",
    "author": "Andrew Stanton",
    "title": "Trump Says Candidates Rejecting His Election Fraud Claims Have Gone 'Woke'"
  },
  {
    "id": 5282,
    "mediaId": 2720,
    "date": "2022-04-10",
    "sentence": "pic.twitter.com/KvhYInBH6N\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nArizona is slated to hold some of the most competitive state elections in the country in the November midterms, with a U.S Senate seat and the governor’s office up for grabs.",
    "author": "Richard Moorhead",
    "title": "Trump Predicts Arizona Candidate Could Potentially Become the 'Greatest Governor in American History'"
  },
  {
    "id": 5797,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as The Daily Beast reported, Lindell and Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> were in Selma, North Carolina for a Trump rally, because of course they were.",
    "author": "Jennifer Wood",
    "title": "Pillow Man Mike Lindell Thanked Madison Cawthorn For Taking The Heat Off Of Him By Talking About ‘Pornos Things’"
  },
  {
    "id": 5467,
    "mediaId": 2742,
    "date": "2022-04-11",
    "sentence": "But <span class='selected-term'>Kari Lake</span> is fantastic.",
    "author": "James Fulford",
    "title": "Trump In Selma, NC Full Transcript: Speaking On The January 6 Gulag, Transgenders In Sports, Illegal Immigration, Visa Lottery, Chain Migration, And Anti-White Discrimination"
  },
  {
    "id": 6008,
    "mediaId": 2509,
    "date": "2022-04-11",
    "sentence": "He traveled to Mar-a-Lago last Thursday to attend a fundraiser for Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> that featured the former president.",
    "author": "Will Steakin",
    "title": "Former Trump lawyer, amid clash with Jan. 6 committee, pushing to decertify 2020 election"
  },
  {
    "id": 5675,
    "mediaId": 2574,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Collin Anderson",
    "title": "Trump-Backed Kari Lake Knocked Doors for Obama, Former Colleague Says"
  },
  {
    "id": 5330,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> recently appeared on Real America with Dan Ball to discuss the invasion of our southern border in Arizona, where thousands are pouring into our country each day.",
    "author": "Assistant Editor",
    "title": "Trump-Endorsed AZ Gubernatorial Candidate Kari Lake On Securing Southern Border: “As Governor I Will Not Take Any Orders From Joe Biden He’s Illegitimate. That Election Was a Sham” (VIDEO)"
  },
  {
    "id": 5559,
    "mediaId": 2589,
    "date": "2022-04-20",
    "sentence": "ROBBY HAS BEEN ENDORSED BY SENATOR RAND PAUL, CANDACE OWENS, CHARLIE KIRK, CONGRESSMAN MADISON CAWTHORN, CONGRESSMAN THOMAS MASSIE, CONGRESSWOMAN MARJORIE TAYLOR GREENE, TURNING POINT ACTION, LEXIT, PRESIDENT TRUMP’S LAWYER JENNA ELLIS, WILLIAMSON COUNTY SHERIFF DUSTY RHOADES, SEBASTIAN GORKA, CONGRESSMAN RALPH NORMAN, NYC MAYOR RUDY GUILIANI, CONGRESSMAN KEN BUCK, REPUBLICANS FOR NATIONAL RENEWAL, AZ GOP CHAIR KELLI WARD, BIENVENIEDO, BULL MOOSE PROJECT, AZ GOV CANDIDATE <span class='selected-term'>KARI LAKE</span> AND MANY MORE\nStarbuck says a full statement is coming soon.",
    "author": "Karen Townsend",
    "title": "TN GOP kicks 3 candidates off ballot, including Trump and Pompeo endorsee"
  }
]