[
  {
    "id": 4202,
    "mediaId": 2614,
    "date": "2022-01-18",
    "sentence": "ARIZONA – Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span>, who became a rising star in the conservative movement in Arizona after spending over two decades in broadcast journalism within the state, recently proposed forming an interstate compact in effort to combat illegal immigration stemming from the southern border.",
    "author": "Red Voice Media",
    "title": "AZ Gubernatorial Candidate Kari Lake Proposes Interstate Compact To Combat Illegal Immigration"
  },
  {
    "id": 3820,
    "mediaId": 2540,
    "date": "2022-01-27",
    "sentence": "The headline was repeated on Twitter by <span class='selected-term'>Kari Lake</span>, a Republican candidate for Arizona governor.",
    "author": "Daniel Dale",
    "title": "Fact check: Right-wing website falsely claims Wisconsin assembly voted to withdraw its Biden electoral votes"
  },
  {
    "id": 3162,
    "mediaId": 2543,
    "date": "2022-02-03",
    "sentence": "An ABC News reporter sought to corner Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "author": "Randy DeSoto",
    "title": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM"
  },
  {
    "id": 16655,
    "mediaId": 2720,
    "date": "2022-02-03",
    "sentence": "An ABC News reporter sought to corner Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "author": "Randy DeSoto",
    "title": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM"
  },
  {
    "id": 2028,
    "mediaId": 2557,
    "date": "2022-02-04",
    "sentence": "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nThe DML News App offers the best in news reporting.",
    "author": "DML News App",
    "title": "WATCH: GOP governor candidate turns tables on reporter regarding 2020"
  },
  {
    "id": 1095,
    "mediaId": 2595,
    "date": "2022-02-11",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 10, 2022\nKari Lake Tapes the Loser as He’s Taping Her and Trying to Destroy Her – She’s Prepared\nThis next bit is great where she goes after the snob.",
    "author": "M Dowling",
    "title": "We Would Hate to Be the Dem Running Against Kari Lake – Watch 3 videos!"
  },
  {
    "id": 572,
    "mediaId": 2593,
    "date": "2022-02-22",
    "sentence": "pic.twitter.com/KnDC2jHXVB\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 3, 2022\nAt a rally former President Donald Trump held outside of Phoenix last month, Lake called the 2020 race “rotten to its core,” adding, “You don’t steal our vote” and just expect people to accept it.",
    "author": "Randy DeSoto",
    "title": "Must-See Ad: Kari Lake Lights Up Fake News Media for Its Relative Silence on 2020 Election Integrity"
  },
  {
    "id": 10812,
    "mediaId": 2520,
    "date": "2022-03-14",
    "sentence": "For pointing that out, I’ll, no doubt, join the growing growing ranks of scolded journalists who dared to criticize <span class='selected-term'>Kari Lake</span>, or even ask a question that might lead one to conclude that when it comes to matters of substance, this particular Lake is a puddle.",
    "author": "Laurie Roberts",
    "title": "Kari Lake is unmasked after her disaster of a Down Under interview"
  },
  {
    "id": 10911,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 8951,
    "mediaId": 2614,
    "date": "2022-03-30",
    "sentence": "During a recent appearance on Steve Bannon’s War Room, Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was asked by Bannon whether Governor Doug Ducey is prepared for the fallout of ending Title 42.",
    "author": "Red Voice Media",
    "title": "Kari Lake On Southern Border: ‘This Is Going To Be Biggest Invasion On Our Homeland’ [VIDEO]"
  },
  {
    "id": 7716,
    "mediaId": 2833,
    "date": "2022-03-31",
    "sentence": "Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> has urged police to arrest Hunter Biden for child rape crimes.",
    "author": "Sean Adl-Tabatabai",
    "title": "Trump-Backed Arizona Gov. Kari Lake: “Hunter Biden Must Be Arrested for Child Rape”"
  },
  {
    "id": 7558,
    "mediaId": 2642,
    "date": "2022-04-04",
    "sentence": "pic.twitter.com/t5mnazMv8x\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 29, 2022\nIf this was me or you, we’d be in solitary confinement by now.",
    "author": "Missy Crane",
    "title": "[VIDEO] Trump’s AZ Candidate Kari Lake Wants Hunter Charged With “Child Molestation”"
  },
  {
    "id": 7726,
    "mediaId": 8428,
    "date": "2022-04-05",
    "sentence": "Photo credit: Alamy\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> demanded Monday that both Wisconsin and Arizona decertify the results of the 2020 presidential election based on recently unearthed voter fraud evidence.",
    "author": "Timothy Frudd",
    "title": "Kari Lake calls for decertification of Wisconsin and Arizona"
  },
  {
    "id": 5282,
    "mediaId": 2720,
    "date": "2022-04-10",
    "sentence": "pic.twitter.com/KvhYInBH6N\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nArizona is slated to hold some of the most competitive state elections in the country in the November midterms, with a U.S Senate seat and the governor’s office up for grabs.",
    "author": "Richard Moorhead",
    "title": "Trump Predicts Arizona Candidate Could Potentially Become the 'Greatest Governor in American History'"
  },
  {
    "id": 5675,
    "mediaId": 2574,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Collin Anderson",
    "title": "Trump-Backed Kari Lake Knocked Doors for Obama, Former Colleague Says"
  }
]