[
  {
    "id": 2917,
    "mediaId": 8476,
    "date": "2022-01-31",
    "sentence": "Eating their own: An anti-Trump GOP group known for negative ads about far-right candidates set its sights on <span class='selected-term'>Kari Lake</span> with an ad noting her false claims about election fraud and interest in overturning the 2020 election results.",
    "author": "Rachel Leingang and Hank Stephenson",
    "title": "The Daily Agenda: Florida Man Shows Up in Arizona Court"
  },
  {
    "id": 16655,
    "mediaId": 2720,
    "date": "2022-02-03",
    "sentence": "An ABC News reporter sought to corner Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "author": "Randy DeSoto",
    "title": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM"
  },
  {
    "id": 940,
    "mediaId": 8475,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Jeremy Duda",
    "title": "Arizona GOP gov candidates embrace Brnovich’s opinion on using troops to repel border 'invasion'"
  },
  {
    "id": 12813,
    "mediaId": 2520,
    "date": "2022-03-04",
    "sentence": "Every one of them, from <span class='selected-term'>Kari Lake</span> to Blake Masters to Matt Salmon to Mark Brnovich to Karrin Taylor Robson, are promising to either finish the wall or miraculously secure our southern border with Mexico.",
    "author": "Elvia Díaz",
    "title": "Trump's $15 billion, supposedly impenetrable border wall with Mexico is a joke"
  },
  {
    "id": 10984,
    "mediaId": 2618,
    "date": "2022-03-18",
    "sentence": "President Trump has released a statement putting Arizona Attorney General Mark Brnovich on notice while praising Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> for her huge primary lead, which is greatly due to her agenda to get to the bottom of the 2020 election.The Maricopa County election audit discovered massive evidence of election law violations and hundreds of thousands of illegal ballots in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "Just In: President Trump Puts AZ Attorney General Mark Brnovich On Notice – Asks When Ruling On Election Fraud and large-scale Election Irregularities Is Coming"
  },
  {
    "id": 11062,
    "mediaId": 2662,
    "date": "2022-03-18",
    "sentence": "President Trump has released a statement putting Arizona Attorney General Mark Brnovich on notice while praising Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> for her huge primary lead, which is greatly due to her agenda to get to the bottom of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "JUST IN: President Trump Puts AZ Attorney General Mark Brnovich On Notice – Asks When Ruling On Election Fraud and large-scale Election Irregularities Is Coming"
  },
  {
    "id": 9638,
    "mediaId": 2520,
    "date": "2022-03-20",
    "sentence": "Opinion: <span class='selected-term'>Kari Lake</span> goes on a weekend tirade against Karrin Taylor Robson, stooping low in her bid to become Arizona's next governor.",
    "author": "Laurie Roberts",
    "title": "Kari Lake goes on the attack and Karrin Taylor Robson must be ... pleased"
  },
  {
    "id": 8903,
    "mediaId": 2550,
    "date": "2022-03-27",
    "sentence": "Arizona is critical in 2022—in every way possible\nDaily Kos' The Brief\nFollowShare\n0:0058:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nGodbehere on Tuesday earned a supportive tweet from former TV anchor <span class='selected-term'>Kari Lake</span>, the far-right conspiracy theorist that Donald Trump is supporting for governor.",
    "author": "",
    "title": "county abruptly resigns, triggering special election"
  },
  {
    "id": 7617,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "Republican and Trump-endorsed gubernatorial candidate <span class='selected-term'>Kari Lake</span> called for the decertification of the election results on Monday, citing the shocking numbers included in Brnovich’s newest report and fraud in Wisconsin.",
    "author": "Summer Lane",
    "title": "Maricopa County election fraud highlighted as some call for decertification of 2020"
  },
  {
    "id": 5854,
    "mediaId": 2731,
    "date": "2022-04-11",
    "sentence": "One of the regents who filed the bar complaint, Karrin Taylor-Robson, is running for governor as a Republican, but most conservatives don’t appreciate that and her ties to ASU, so Trump-endorsed <span class='selected-term'>Kari Lake</span> is trouncing her and the rest of the competition.",
    "author": "Rachel Alexander",
    "title": "Finally, Someone Who Dares to Sue Public Universities"
  }
]