[
  {
    "id": 3642,
    "mediaId": 8439,
    "date": "2022-01-16",
    "sentence": "One, <span class='selected-term'>Kari Lake</span>, received a key endorsement from former President Donald Trump.",
    "author": "Stacey Barchenger",
    "title": "Kimberly Yee drops out of Arizona governor's race, will run for reelection as treasurer"
  },
  {
    "id": 4202,
    "mediaId": 2614,
    "date": "2022-01-18",
    "sentence": "ARIZONA – Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span>, who became a rising star in the conservative movement in Arizona after spending over two decades in broadcast journalism within the state, recently proposed forming an interstate compact in effort to combat illegal immigration stemming from the southern border.",
    "author": "Red Voice Media",
    "title": "AZ Gubernatorial Candidate Kari Lake Proposes Interstate Compact To Combat Illegal Immigration"
  },
  {
    "id": 3682,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Trump endorsed Paxton in July 2021, while his wife Angela, a candidate for state senate in Texas, picked up the former president’s backing a couple of weeks after the fundraiser.”\nEverson notes that two other Republicans “whose campaigns have spent at least $50,000” at Mar-a-Lago are <span class='selected-term'>Kari Lake</span> and Sarah Huckabee Sanders.",
    "author": "Alex Henderson",
    "title": "Texas AG Paxton’s campaign spent $50,000 at Mar-a-Lago: report"
  },
  {
    "id": 3951,
    "mediaId": 2605,
    "date": "2022-01-20",
    "sentence": "Prominent at Trump’s rally was <span class='selected-term'>Kari Lake</span>, his choice to dump Arizona Gov.",
    "author": "Jackie CalmesColumnist",
    "title": "Column: Biden’s first year is a chronicle of Republican obstruction and Trump’s shadow"
  },
  {
    "id": 4014,
    "mediaId": 8345,
    "date": "2022-01-25",
    "sentence": "“I'm talking to people every day around this state,” said <span class='selected-term'>Kari Lake</span>, a former television news anchor now seeking the GOP nomination for governor.",
    "author": "",
    "title": "GOP election rules advance, include releasing ballot images"
  },
  {
    "id": 3858,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alex Henderson",
    "title": "GOP state majority leader slams far-right MAGA rep for proposing Wisconsin retract electoral votes for Biden: 'It is illegal'"
  },
  {
    "id": 3044,
    "mediaId": 2512,
    "date": "2022-02-01",
    "sentence": "If candidates like <span class='selected-term'>Kari Lake</span> in Arizona and David Perdue in Georgia are successful, it would give them final say over whether to certify a slate of electors for a presidential candidate.”\nPanetta adds, “Such trends raise the risk of a disputed or possibly stolen election in the 2022 midterms.",
    "author": "Alex Henderson",
    "title": "Here’s how 'rogue' GOP governors could steal the 2024 election for Trump — and cause a 'constitutional tailspin'"
  },
  {
    "id": 3279,
    "mediaId": 2662,
    "date": "2022-02-03",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\n<span class='selected-term'>Kari Lake</span>: Well he’s obviously sitting in the White House.",
    "author": "Jim Hoft",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 3334,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was recently interviewed by an ABC rookie journalist.",
    "author": "",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 2028,
    "mediaId": 2557,
    "date": "2022-02-04",
    "sentence": "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nThe DML News App offers the best in news reporting.",
    "author": "DML News App",
    "title": "WATCH: GOP governor candidate turns tables on reporter regarding 2020"
  },
  {
    "id": 1888,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 2447,
    "mediaId": 2557,
    "date": "2022-02-07",
    "sentence": "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\n<span class='selected-term'>Kari Lake</span>, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "author": "DML News App",
    "title": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle"
  },
  {
    "id": 2067,
    "mediaId": 2599,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Stephen Green",
    "title": "All Republican Candidates Must Learn a Lesson From Arizona Gubernatorial Hopeful Kari Lake."
  },
  {
    "id": 1790,
    "mediaId": 2573,
    "date": "2022-02-08",
    "sentence": "In Arizona, Trump-endorsed gubernatorial candidate <span class='selected-term'>Kari Lake</span> touted her \"historic grassroots\" fundraising.",
    "author": "Paul Steinhauser",
    "title": "2022 elections: Trump-endorsed candidates struggle with fundraising"
  },
  {
    "id": 940,
    "mediaId": 8475,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Jeremy Duda",
    "title": "Arizona GOP gov candidates embrace Brnovich’s opinion on using troops to repel border 'invasion'"
  },
  {
    "id": 1263,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 1492,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 685,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is on the agenda, but neither of her top opponents will appear.",
    "author": "",
    "title": "Opinion This year’s CPAC lineup speaks volumes about the conservative movement"
  },
  {
    "id": 11263,
    "mediaId": 2520,
    "date": "2022-03-08",
    "sentence": "“Send (sic) a message to him and already got a message back #StandWithUkraine?.”\n<span class='selected-term'>Kari Lake</span>, the far-right extremist seeking to replace Corieri’s boss, won’t have any of that righteous charity.",
    "author": "Elvia Díaz",
    "title": "Will Gov. Doug Ducey really support Kari Lake if she's the GOP nominee?"
  },
  {
    "id": 15445,
    "mediaId": 8475,
    "date": "2022-03-08",
    "sentence": "Republican gubernatorial hopeful Matt Salmon has called on her to resign from the Senate, and even allies like gubernatorial candidate <span class='selected-term'>Kari Lake</span> and Arizona Republican Party Chairwoman Kelli Ward, both of whom thrive on controversy, have shied away from publicly defending her.",
    "author": "Jeremy Duda",
    "title": "Kelly Townsend drops Az congressional bid to challenge Wendy Rogers"
  },
  {
    "id": 10934,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 11331,
    "mediaId": 2663,
    "date": "2022-03-14",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> gave quite the performance on 60 Minutes Australia over the weekend, dodging serious questions and abruptly cutting the interview short.",
    "author": "Dan Tracer",
    "title": "Trump-endorsed candidate Kari Lake rants about guns and freedom before storming off “60 Minutes” set"
  },
  {
    "id": 10911,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 14075,
    "mediaId": 8348,
    "date": "2022-03-17",
    "sentence": "Summary:\nA campaign ad for <span class='selected-term'>Kari Lake</span>, a Republican candidate for Arizona governor, includes baseless claims of a rigged 2020 election.",
    "author": "qzqBPYZWRghfR",
    "title": "The truth in political advertising: 'You're allowed to lie'"
  },
  {
    "id": 8923,
    "mediaId": 2618,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Wills Robinson & Josh Boswell",
    "title": "Exclusive: Senator Ron Johnson leads Republicans asking when the 'corrupt' media, Twitter and Facebook will be held to account for taking a YEAR to 'acknowledge' the Hunter Biden laptop story after dismissing it as fake"
  },
  {
    "id": 9243,
    "mediaId": 2618,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Staff",
    "title": "Longest-serving US congressman Don Young dies aged 88 midair on flight from LA to Seattle: Republican Alaska representative served his state for 25 years and filed for reelection"
  },
  {
    "id": 9362,
    "mediaId": 2745,
    "date": "2022-03-23",
    "sentence": "Those protests include demonstrations led by <span class='selected-term'>Kari Lake</span>, a former Arizona television news anchor running for governor with Trump’s endorsement.",
    "author": "",
    "title": "As GOP lawmakers push for more election fraud charges, prosecutors find few cases"
  },
  {
    "id": 9154,
    "mediaId": 2636,
    "date": "2022-03-25",
    "sentence": "Mr. Trump is backing a former newscaster, <span class='selected-term'>Kari Lake</span>, and Mr. Ducey has not yet endorsed anyone.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump’s Role as the G.O.P. ‘Kingpin’"
  },
  {
    "id": 7726,
    "mediaId": 8428,
    "date": "2022-04-05",
    "sentence": "Photo credit: Alamy\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> demanded Monday that both Wisconsin and Arizona decertify the results of the 2020 presidential election based on recently unearthed voter fraud evidence.",
    "author": "Timothy Frudd",
    "title": "Kari Lake calls for decertification of Wisconsin and Arizona"
  },
  {
    "id": 7171,
    "mediaId": 2641,
    "date": "2022-04-06",
    "sentence": "In Arizona, several Republican women have declared runs, including state Treasurer Kimberly Yee, Secretary of the Arizona Board of Regents Karrin Taylor Robson and former TV anchor <span class='selected-term'>Kari Lake</span>, CNN reported.",
    "author": "Peter Malbin",
    "title": "New Organization Recruits More Female Republicans to Be Governor"
  },
  {
    "id": 7163,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "The Trump-backed gubernatorial candidate in Arizona’s 2022 election, former TV news anchor <span class='selected-term'>Kari Lake</span>, told Breitbart News at the premiere that the film “was one of the most important movies I’ve ever seen.”\n“Americans are busy.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Trump at ‘Rigged’ Premiere: ‘It Shouldn’t Be Allowed’ for Mark Zuckerberg to Privately Finance Election Operations"
  },
  {
    "id": 7567,
    "mediaId": 2642,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "President Trump Just Discovered The GOP’s New SUPER Star"
  },
  {
    "id": 7319,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 5914,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "Trump doubled down on his criticism during a fundraiser for Arizona gubernatorial GOP candidate <span class='selected-term'>Kari Lake</span>, who is running for the governorship being vacated by Republican Governor Doug Ducey.",
    "author": "Andrew Stanton",
    "title": "Trump Says Candidates Rejecting His Election Fraud Claims Have Gone 'Woke'"
  },
  {
    "id": 5394,
    "mediaId": 2583,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "Mike Lindell Shouts ‘Dominion,’ Bashes Fox, Calls Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 5661,
    "mediaId": 2645,
    "date": "2022-04-12",
    "sentence": "MORE NEWS: <span class='selected-term'>Kari Lake</span>: We’re Going To Take Back Control Of The Border",
    "author": "",
    "title": "Democrat Rep. Slotkin against ending Title 42"
  },
  {
    "id": 5300,
    "mediaId": 2512,
    "date": "2022-04-19",
    "sentence": "Less tested or more extreme candidates, like Arizona governor hopeful <span class='selected-term'>Kari Lake</span> or North Carolina House candidate Bo Hines, could jeopardize the GOP’s chances in swing states and districts come November.”\nThe “blurred lines” that Shepard is referring to in X-Factor #2 are maps for House districts.",
    "author": "Alex Henderson",
    "title": "These 5 'X-factors' could ‘scramble’ the 2022 midterms: journalist"
  },
  {
    "id": 5559,
    "mediaId": 2589,
    "date": "2022-04-20",
    "sentence": "ROBBY HAS BEEN ENDORSED BY SENATOR RAND PAUL, CANDACE OWENS, CHARLIE KIRK, CONGRESSMAN MADISON CAWTHORN, CONGRESSMAN THOMAS MASSIE, CONGRESSWOMAN MARJORIE TAYLOR GREENE, TURNING POINT ACTION, LEXIT, PRESIDENT TRUMP’S LAWYER JENNA ELLIS, WILLIAMSON COUNTY SHERIFF DUSTY RHOADES, SEBASTIAN GORKA, CONGRESSMAN RALPH NORMAN, NYC MAYOR RUDY GUILIANI, CONGRESSMAN KEN BUCK, REPUBLICANS FOR NATIONAL RENEWAL, AZ GOP CHAIR KELLI WARD, BIENVENIEDO, BULL MOOSE PROJECT, AZ GOV CANDIDATE <span class='selected-term'>KARI LAKE</span> AND MANY MORE\nStarbuck says a full statement is coming soon.",
    "author": "Karen Townsend",
    "title": "TN GOP kicks 3 candidates off ballot, including Trump and Pompeo endorsee"
  }
]