[
  {
    "id": 1899,
    "mediaId": 2618,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Chris Pleasance & Nick Fagge",
    "title": "Olympic war games: Vladimir Putin appears to NAP as the Ukrainian team walks out at Winter opening ceremony while Xi Jinping gets a one-minute ovation as he presides over games under strict Zero Covid restrictions"
  },
  {
    "id": 10939,
    "mediaId": 8405,
    "date": "2022-03-09",
    "sentence": "Meanwhile, key allies like <span class='selected-term'>Kari Lake</span>, the Rogers-endorsed candidate for governor, seem to be standing upwind of the woman.",
    "author": "Laurie Roberts",
    "title": "Wendy Rogers v. Kelly Townsend? Get ready, Arizona, for a race for the ages"
  },
  {
    "id": 10934,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 9278,
    "mediaId": 2618,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Chris Donaldson",
    "title": "Stuttering Psaki plays clean-up on Biden’s call with Chinese leader over ‘consequences’ for helping Putin"
  },
  {
    "id": 7266,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Other guests included former trade adviser Peter Navarro, former White House advisers Kellyanne Conway and Hope Hicks, right-wing attorney Cleta Mitchell, Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>, former spokesman Hogan Gidley, former campaign manager Corey Lewandowski, former White House chief of staff Reince Priebus, Truth Social CEO Devin Nunes and One America News anchor Christina Bobb.",
    "author": "Travis Gettys",
    "title": "Trump holds a dazzling pity party at Mar-A-Lago for debut of election fraud conspiracy film"
  }
]