{
  "id": 10815,
  "mediaId": 2664,
  "date": "2022-03-11",
  "headline": "Republicans are using Trump's Putin praise as a way to distance themselves from him: report",
  "image": "https://www.rawstory.com/media-library/donald-trump-vladimir-putin.jpg?id=29523332&width=1200&coordinates=0%2C54%2C0%2C0&height=600",
  "link": "https://www.rawstory.com/republicans-are-using-trump-s-putin-praise-as-a-way-to-distance-themselves-from-him/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    2765,
    3006,
    4566,
    4591,
    1126,
    6672
  ],
  "sentences": [
    "Writing, \"...it’s one of the more meaningful distinctions that rank-and-file members of the party have drawn recently between themselves and the former president, a man with an almost preternatural ability to turn anyone who questions him into a political pariah,\" Godfrey added, \"Many Republicans seem relieved, both for the reprieve and for the chance to distance themselves a bit from Trump.\"",
    "Republican lawmakers who have been living under the thumb of Donald Trump for over five years are seizing upon his praise of and support Russian President Vladimir Putin as a way to put distance between themselves and the former president reports the Atlantic's Elaine Godfrey.",
    "In normal times, many of them have had difficulty mustering the will to challenge the former president when they might want to, given how much political power he wields,\" the report continued.",
    "Fearful of Trump's supporters -- and personal attacks from the former president himself -- GOP lawmakers have spent years either defending Trump or avoiding talking about him altogether.",
    "With public support now solidly behind Ukraine which is struggling to stop Putin's invasion, Republicans are finding a way to break with Trump that won't set off a firestorm.",
    "That, the report states has emboldened Republicans to aim some rare barbs at Trump with Katko pointing out, \"Putin isn’t a genius, and neither is Trump.”",
    "It makes you feel good!”\n\"Many Republicans seem quite happy—eager, even—to use Ukraine as a way to distance themselves from Trump.",
    "Rep. John Katko (R-NY) agreed, telling the Atlantic, \"We’re generally united in a mission to help Ukraine as much as we can.",
    "According to Rep. Steve Chabot (R-OH), the reason is simple: \"There’s zero support for Putin.\"",
    "\"But in this particular case, questioning the GOP figurehead is safe.",
    "On Ukraine, Trump has been out of step with most Americans.\"",
    "It’s kind of inspiring."
  ]
}