{
  "id": 2253,
  "mediaId": 2679,
  "date": "2022-02-05",
  "headline": "Little of the Paycheck Protection Program’s $800 billion protected paychecks",
  "image": "",
  "link": "https://www.seattletimes.com/business/little-of-the-paycheck-protection-programs-800-billion-protected-paychecks/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STACY COWLEY",
  "authorUrl": "https://www.seattletimes.com/author/cap-stacy-cowley/",
  "termIds": [
    5320,
    2255,
    1014,
    201
  ],
  "sentences": [
    "Coleman testified that the program had allowed his 34 employees “to go home every night knowing that they could pay their rent, feed their family and, more importantly, feed the massive amounts of pets that they own.”\nAdvertising\n Skip Ad\nThe Paycheck Protection Program ran dry and closed down in May, and Biden and Congress have shown little interest in reviving it.",
    "Advertising\n Skip AdSkip AdSkip Ad\nNearly every company in America with 500 or fewer workers (and some larger ones) qualified: law firms, construction companies and restaurant chains as well as Uber drivers, freelancers and the bars, boutiques, grocery stores and hair salons that are the backbone of many Main Streets.",
    "It went to business owners and their shareholders and their creditors.”\nQuestions about the success of the program have gained urgency as the omicron variant of the coronavirus disrupts the country’s economic upswing, intensifying calls from hard-hit industries like restaurants for a new round of federal aid.",
    "Lawmakers in both parties have backed the Paycheck Protection Program — it was created during the Trump administration and distributed an additional round of funding after President Joe Biden took office — in part because every congressional district is filled with entrepreneurs like Kelly.",
    "Rep. Carolyn Bourdeaux, D-Ga., praised the program for giving local mainstays like the Aurora Theater, an arts venue, “the resources they need to get back on their feet.”\nAnd Rep. Steve Chabot, R-Ohio, brought Dr. Rich Coleman, owner of Four Paws Animal Hospital, to a House hearing.",
    "The analysis by Autor’s group, circulated for comment last month by the National Bureau of Economic Research, put the cost of saving a job for a year at $169,300 — far more than the $58,200 average compensation for those jobs, according to the group’s calculations.",
    "One new analysis found that only about a quarter of the money spent by the program paid wages that would have otherwise been lost, partly because the government steadily loosened the rules for how businesses could use the money as the pandemic dragged on.",
    "Related\n More on the Economy\n Strong jobs report shows resilient economy despite COVID wave\n WA unemployment agency to cut nearly 800 staff\nMore\nThe effects were strongest for the smallest businesses and for those in areas with higher poverty rates.",
    "But Michael Dalton, a research economist for the Bureau of Labor Statistics who drew on extensive wage records collected by the government that other researchers did not have access to, said it had performed better than he expected.",
    "And because many businesses remained healthy enough to survive without the program, another analysis found, the looser rules meant the Paycheck Protection Program ended up subsidizing business owners more than their workers.",
    "“It took everything for me to apply for the PPP loan, because I was scared of loans, especially during COVID,” said Kelly, who started the business after she was laid off from a 30-year career in corporate communications.",
    "Advertising\n Skip Ad\nDawn Kelly isn’t sure the Nourish Spot, a juice bar and sandwich shop in the Queens borough of New York City, would have survived without an $11,220 Paycheck Protection Program loan and other aid.",
    "Congress rushed to create the Paycheck Protection Program in the pandemic’s early days, trying to prevent struggling small companies from gutting their workforces and adding to the staggering unemployment rate.",
    "But some small-business owners — particularly in the restaurant industry — are hoping for additional aid as omicron heightens the pressures they feel from high inflation and a tight labor market.",
    "Businesses that received a loan from the program were 5.8% less likely to be closed one month after receiving the money, and 3.5% less likely to be shut down after seven months, Dalton found.",
    "She cut her hours — but not her staff — and new opportunities, like a contract last summer for concessions space at Forest Hills Stadium, have helped her keep eight employees on the job.",
    "“Jobs and businesses are two separate things,” said David Autor, an economics professor at the Massachusetts Institute of Technology who led a 10-member team that studied the program.",
    "(Some of those payments, in turn, propped up other industries: An analysis last year found that Paycheck Protection Program money reduced commercial mortgage delinquencies.)",
    "Out of the roughly $510 billion the program lent in 2020, a maximum of $175 billion — about 34% — went to paying workers who would have lost their jobs, Autor’s team found.",
    "The Nourish Spot’s loan worked exactly as lawmakers first intended: a relatively modest amount that supported workers long enough for the business to recover organically.",
    "As the pandemic dragged on and businesses’ woes deepened, lawmakers softened the program’s rules and refashioned it into a more general small-business support effort.",
    "Sen. Marco Rubio, R-Fla., speaks glowingly of Island Grove Wine, a winery and wedding site that the pandemic turned into “a money pit,” in the words of its owner.",
    "Early studies of the program — which generally focused on the largest small companies — were not flattering, finding it had little effect on preserving jobs.",
    "Seventy-two percent of the program’s relief money ended up in the hands of those whose household income is in America’s top 20%, Autor’s group found.",
    "The program offered business owners low-interest loans of up to $10 million to cover roughly two months of payroll and a few additional expenses.",
    "Hanging over the $800 billion Paycheck Protection Program, one of the government’s most expensive pandemic relief efforts, is a simple question.",
    "Sponsored\n Skip Ad\n Skip Ad\n Skip Ad\n Skip Ad\nThat allowed business owners to spend more of the money on rent, utilities and other expenses.",
    "In a recent survey of business owners participating in a Goldman Sachs training program, 71% said omicron had taken a toll on their sales.",
    "Within one month of being approved, companies that got loans had an average head count 8% higher than comparable businesses that didn’t.",
    "Kelly opened the store five years ago in what she calls a “food swamp,” an urban neighborhood where shops with fresh produce are scarce.",
    "New research, drawing on millions of wage and payroll records, suggests a complicated answer: Yes, but at an extraordinarily high cost.",
    "During the first two years, she mostly staffed the shop on her own 11 hours a day, six days a week, and struggled to turn a profit.",
    "Most Read Business Stories\nWhen lawmakers created the program in March 2020, they anticipated a short period of intense disruption.",
    "Covering employers’ payrolls for eight weeks, they figured, would be enough to get them through the worst of the COVID-19 crisis.",
    "Most notably, they gutted the requirement that borrowers who wanted their loans forgiven maintain their pre-pandemic head counts.",
    "“We tried to figure out, ‘Where did the money go?’ — and it turns out it didn’t primarily go to workers who would have lost jobs.",
    "Kelly’s smoothies and snacks adapted well to a takeout model, but the fees charged by delivery apps had a steep financial toll.",
    "“There are long-term impacts to businesses closing, on local communities and the local economies in those areas,” Dalton said.",
    "After seven months, their workforces were still 4% larger, maintaining a lead even as hiring nationwide began to bounce back.",
    "Money that didn’t specifically preserve jobs was effectively a windfall for business owners — on the whole a wealthy group.",
    "And they reduced the percentage of the loan that borrowers seeking forgiveness had to spend on payroll, to 60% from 75%.",
    "“This program was highly, highly regressive,” Autor said, using the economic term for policies that favor the richest.",
    "For every $1 in wages that it prevented from being lost, it handed out $3.13 that went somewhere else, Dalton found.",
    "More than a third said they had to close temporarily or scale back operations because of rising COVID case counts.",
    "But her sales grew, and she brought on interns from youth job programs, hiring the best as part-time workers.",
    "Advertising\n Skip AdSkip AdSkip Ad\nBut overall, the Paycheck Protection Program was extremely inefficient.",
    "That is because the relief effort’s shifting goals ultimately put less of a premium on worker pay.",
    "When the Paycheck Protection Program offered a second round of loans last year, she didn’t apply.",
    "At the end of 2019, she had about 10 employees and was finally breaking even.",
    "And some ventures that would have been forced out of business stayed alive.",
    "The loans would be forgiven as long as the money went to permitted costs.",
    "“We’re doing OK.”\nThis story was originally published at nytimes.com.",
    "Kelly is prepared to white-knuckle her way through the uncertainty.",
    "But the pandemic wiped out foot traffic and sit-down dining.",
    "So where did the rest of the money go?",
    "The loan helped stabilize the shop.",
    "“I didn’t need it,” she said.",
    "Into deeper pockets.",
    "They guessed wrong.",
    "Read it here.",
    "Did it work?"
  ]
}