{
  "id": 7861,
  "mediaId": 3987,
  "date": "2022-04-08",
  "headline": "All Americans Pay a Price for Republicans’ Nativism",
  "image": "http://americasvoice.org/wp-content/uploads/2020/06/construction.jpg",
  "link": "https://americasvoice.org/press_releases/all-americans-pay-a-price-for-republicans-nativism/?utm_source=rss&utm_medium=rss&utm_campaign=all-americans-pay-a-price-for-republicans-nativism",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AV Press Releases",
  "authorUrl": "",
  "termIds": [
    5732,
    5303,
    4013,
    2564,
    2765,
    1126,
    1356
  ],
  "sentences": [
    "Republican Rep. Steve Chabot recently stated during a hearing that “Republicans support legal immigration,” but as the Cato Institute’s David Bier noted, “They’re just against any bill that makes it even a tiny little bit easier and for any bill that makes it harder, even impossible.”\nMichelle Hackman of the Wall Street Journal recently explored the economic toll of the declining immigrant population, finding that our economy and demographic trends argue for exactly the opposite: we need more immigrant workers rather than fewer.",
    "‘This decline reflects both tougher immigration policies and the pandemic which reduced legal immigration and caused some recent immigrants to return to their native countries,’ David Kelly, chief global strategist at JPMorgan Funds, said in a recent report.”\nThe Washington Post recently editorialized,\n“The labor force participation rate, a measure of how many civilians 16 and older are working or looking for work, is at 62.4 percent — down a full percentage point from before the pandemic.",
    "It was also the lowest level since 2003 … The lack of immigrants has become a contributing factor to the current labor shortage, Federal Reserve Chairman Jerome Powell recently said.”\nWhile COVID is a major factor in the decline in immigrants, so too are the policies put in place by Donald Trump and Stephen Miller to keep out immigrants – policies Republican Party candidates and elected officials continue to embrace.",
    "In her article, “Add Declining Immigration to Problems Weighing on the Labor Market,” Hackman cites the research of UC Davis economist Giovanni Peri, noting:\n“Labor shortages stem from a wide variety of factors, including early retirement, Covid-19 sickness or fear of it, lack of child care and a desire to start a business.",
    "The U.S. closed consulates around the world, stopped processing refugees and began turning away most adult migrants at the Southern border under a new public-health authority known as Title 42.”\nAs CBS News reports today:\n“In the middle of the last decade, the U.S. was adding about 1 million immigrants a year.",
    "Washington, DC – As Republicans go for broke on an anti-immigrant midterm strategy, this week brought fresh reminders about the economic consequences for all Americans of the GOP’s efforts to keep out and kick out immigrants, refugees, and asylum seekers.",
    "…\nThe slowdown in immigration began in 2017, when the Trump administration adopted a broad range of policies to curb both illegal and legal immigrants, including refugees, foreign recruits, international students and family members of American citizens.",
    "Much of this decline can be explained by two factors: a surge in Americans retiring and a massive drop in legal immigration under President Donald Trump that has yet to turn around … Companies are desperate for workers.",
    "What should be a no-brainer for our country and a boost for our economy during a time when the labor market is hot, is instead sacrificed to the GOP’s embrace of anti-immigrant politics and Stephen Miller’s policies.",
    "As Yahoo News reported, the U.S. “saw a 31% decline in legal immigration in 2020 as the coronavirus pandemic swept across the country, according to data from the Department of Homeland Security.",
    "This shouldn’t be so hard to fix.”\nAccording to Douglas Rivlin, Director of Communication for America’s Voice,\nAll Americans pay a price for Republicans’ nativism.",
    "At a time that our economy needs more immigrants and additional legal pathways, Republicans want fewer immigrants and higher walls.",
    "But those numbers, which slowed down during the Trump administration, hit a brick wall when COVID-19 erupted in 2020.",
    "Those already-reduced flows were then cut in half in 2020 by the onset of the pandemic and the related restrictions.",
    "Industries with above-average levels of foreign-born workers are likelier to have high job-opening rates.",
    "The number of immigrants — about 707,000 — fell below the 1 million mark for the first time since 2013.",
    "The soundbite that Republicans support legal immigration simply isn’t true.",
    "Millions of legal immigrants want to work in the United States.",
    "Additionally, Mr. Peri noted, fewer immigrants are a factor.",
    "Immigrants who help spark the economy are in short supply."
  ]
}