[
  {
    "id": 4467,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "New Joint Fundraisers\nNittany-Buckeye Joint Committee (Reps. <span class='selected-term'>Brian Fitzpatrick</span>, Brad Wenstrup, BRINGING AMERICA TOGETHER PAC, BUILDING AND RESTORING THE AMERICAN DREAM FUND)\nWinning Red Committee (Sens.",
    "author": "",
    "title": "Pelosi aide joins theGROUP"
  },
  {
    "id": 3748,
    "mediaId": 4018,
    "date": "2022-01-20",
    "sentence": "A photo from the meeting showed Republicans Kat Cammack, Dan Meuser and <span class='selected-term'>Brian Fitzpatrick</span> in attendance in addition to Bacon and Cuellar.",
    "author": "Shira Hanau",
    "title": "Non-Jewish House reps form congressional ‘Caucus for Advancement of Torah Values,’ with Canadian rabbi’s help"
  },
  {
    "id": 12835,
    "mediaId": 2546,
    "date": "2022-02-28",
    "sentence": "The 1st District in the Philadelphia suburbs, held by Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span>, will remain one of the state’s most competitive.",
    "author": "Michael Macagnone",
    "title": "Pennsylvania GOP urges Supreme Court to toss congressional map"
  },
  {
    "id": 12779,
    "mediaId": 2746,
    "date": "2022-03-01",
    "sentence": "Mr. Gottheimer will deliver that “perspective” alongside Rep. <span class='selected-term'>Brian Fitzpatrick</span>, a Pennsylvania Republican, with whom he chairs the Congressional Problem Solvers Caucus.",
    "author": "Haris Alic",
    "title": "Democrats’ divisions spill into view with competing responses to Biden’s State of the Union"
  },
  {
    "id": 13045,
    "mediaId": 2671,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that “immediately following” the speech, it would host “an unprecedented bipartisan perspective” panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "The Right Scoop",
    "title": "THREE Democrats will be responding to Joe Biden’s SOTU address"
  },
  {
    "id": 13085,
    "mediaId": 2619,
    "date": "2022-03-01",
    "sentence": "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "author": "Victor Reklaitis",
    "title": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech"
  },
  {
    "id": 12633,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Gottheimer will be speaking alongside Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> and the director of No Labels.",
    "author": "Bryan Metzger",
    "title": "Josh Gottheimer says it's 'massively unproductive' for Rashida Tlaib to give a State of the Union response even though he's also giving one"
  },
  {
    "id": 12528,
    "mediaId": 2658,
    "date": "2022-03-04",
    "sentence": "Reps. Josh Gottheimer (D-N.J.) and <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) have introduced a matching House version of the bill.",
    "author": "",
    "title": "Democrats spar over Russia oil embargo"
  },
  {
    "id": 10691,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "FIRST ON FOX NEWS: REPUBLICAN NATIONAL COMMITTEE SHATTERS FUNDRAISING RECORDS IN FEBRUARY\nThe RJC is also endorsing Republican Reps. David Schweikert of Arizona (AZ-01), David Valadao of California (CA-22), Andy Harris of Maryland (MD-01), Peter Meijer of Michigan (MI-03), Don Bacon of Nebraska (NE-02), Yvette Herrell of New Mexico (NM-02), Nicole Malliotakis of New York (NY-11), <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania (PA-01) and Nancy Mace of South Carolina (SC-01).",
    "author": "Paul Steinhauser",
    "title": "Sen. Ron Johnson tops list of Republicans endorsed by top Jewish GOP organization"
  },
  {
    "id": 9751,
    "mediaId": 8322,
    "date": "2022-03-28",
    "sentence": "The House also saw several high-profile GOP lawmakers sign onto the bill, including Reps. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, Bryan Steil of Wisconsin, and Ken Buck of Colorado.",
    "author": "Kelly Laco",
    "title": "Republicans introduce bill requiring DOJ to disclose info on felony pre-trial releases"
  },
  {
    "id": 7213,
    "mediaId": 2551,
    "date": "2022-04-01",
    "sentence": "Rep. <span class='selected-term'>Brian Fitzpatrick</span>, Pa.\nAdvertisement\nBut Rep. Cathy McMorris Rodgers, R-Wash., complained the legislation is only 'a small piece of a larger package around government price controls for prescription drugs.'",
    "author": "Morgan Phillips",
    "title": "House PASSES bill to cap the cost of insulin at $35 a month: 12 Republicans join Democrats to push through legislation which the GOP has compared to 'government price fixing'"
  },
  {
    "id": 7247,
    "mediaId": 2621,
    "date": "2022-04-03",
    "sentence": "The biggest congressional recipient of her generosity in 2021 was Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-PA), who received a total of $5,800.",
    "author": "Katherine Huggins",
    "title": "Tiger King’s Carole Baskin Gave More Than $30,000 to Congressional Candidates in 2021"
  }
]