[
  {
    "id": 4443,
    "mediaId": 2547,
    "date": "2022-01-21",
    "sentence": "Stern told the Guardian he spent several hours in November telling House panel investigators about the alleged drive by Flynn associates who sought campaign finance and other dirt on Pennsylvania’s Senator Pat Toomey and Congressman <span class='selected-term'>Brian Fitzpatrick</span> to win their support for an audit to bolster Trump’s debunked charges that Biden’s win was fraudulent.",
    "author": "Susie Madrak",
    "title": "Witness Ties Flynn Allies To Election Audit Extortion Plot"
  },
  {
    "id": 3977,
    "mediaId": 2687,
    "date": "2022-01-24",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Lawmakers Push Pelosi, McCarthy on Stock Trading Ban"
  },
  {
    "id": 1012,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "Pompeo’s PAC donated $2,500 to at least three Republican congressmen — <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, Don Bacon of Nebraska and Andrew Garbarino of New York — among the 13 GOP members voting in support of the $1.2 trillion infrastructure bill.",
    "author": "Tim Carpenter",
    "title": "Pompeo's PAC spends $2.2 million as he lays the foundation for a presidential campaign"
  },
  {
    "id": 13028,
    "mediaId": 2916,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Zachary Evans",
    "title": "Manchin, Murkowski Propose Bill to Ban Imports of Russian Oil"
  },
  {
    "id": 15408,
    "mediaId": 8418,
    "date": "2022-03-11",
    "sentence": "The VAWA Reauthorization includes Kayden’s Law, which U.S. Representative <span class='selected-term'>Brian Fitzpatrick</span> (PA-01) authored to honor the memory of Kayden Mancuso of Lower Makefield.",
    "author": "Bucks Local News",
    "title": "House and Senate pass Fitzpatrick-authored Kayden’s Law; legislation heads to President’s desk"
  },
  {
    "id": 10691,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "FIRST ON FOX NEWS: REPUBLICAN NATIONAL COMMITTEE SHATTERS FUNDRAISING RECORDS IN FEBRUARY\nThe RJC is also endorsing Republican Reps. David Schweikert of Arizona (AZ-01), David Valadao of California (CA-22), Andy Harris of Maryland (MD-01), Peter Meijer of Michigan (MI-03), Don Bacon of Nebraska (NE-02), Yvette Herrell of New Mexico (NM-02), Nicole Malliotakis of New York (NY-11), <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania (PA-01) and Nancy Mace of South Carolina (SC-01).",
    "author": "Paul Steinhauser",
    "title": "Sen. Ron Johnson tops list of Republicans endorsed by top Jewish GOP organization"
  },
  {
    "id": 9751,
    "mediaId": 8322,
    "date": "2022-03-28",
    "sentence": "The House also saw several high-profile GOP lawmakers sign onto the bill, including Reps. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, Bryan Steil of Wisconsin, and Ken Buck of Colorado.",
    "author": "Kelly Laco",
    "title": "Republicans introduce bill requiring DOJ to disclose info on felony pre-trial releases"
  },
  {
    "id": 7820,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "Rep. Daniel Meuser of Pennsylvania, Rep. Mariannette Miller-Meeks of Iowa, Rep. Bill Posey of Florida, Rep. Christopher Smith of New Jersey, Rep. Fred Upton of Michigan, Rep. Andy Harris of Maryland, Rep. Jaime Herrera Beutler of Washington, Rep. Richard Hudson of North Carolina, Rep. John Katko of New York, Rep. Nicole Malliotakis of New York, Rep. Don Bacon of Nebraska, and Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania were the only Republicans to join the vote in favour.",
    "author": "Johanna Chisholm",
    "title": "Most House Republicans vote against lowering the price of insulin"
  },
  {
    "id": 7247,
    "mediaId": 2621,
    "date": "2022-04-03",
    "sentence": "The biggest congressional recipient of her generosity in 2021 was Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-PA), who received a total of $5,800.",
    "author": "Katherine Huggins",
    "title": "Tiger King’s Carole Baskin Gave More Than $30,000 to Congressional Candidates in 2021"
  },
  {
    "id": 7179,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) received $5,800 from Baskin, the most of any individual lawmaker.",
    "author": "Callie Patteson",
    "title": "Carole Baskin donated over $31K to GOP, Dem lawmakers in 2021"
  }
]