{
  "id": 2384,
  "mediaId": 124,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "Biden's Supreme Court pick thrills progressives looking for a win",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220225-Ketanji-Brown-Jackson-joe-biden-se-221p-72fa03.jpg",
  "link": "https://www.nbcnews.com/politics/elections/bidens-supreme-court-pick-thrills-progressives-looking-win-rcna17429",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1916,
    1916,
    2087,
    2087,
    2347,
    2347,
    2039,
    2039,
    698,
    698,
    648,
    648,
    816,
    816,
    1464,
    1464,
    482,
    482
  ],
  "sentences": [
    "Mandela Barnes, who is running for Senate there, said he was thrilled to see President Biden making good on his promise to create a court system that looks and lives more like America.? One of his primary rivals, Outagamie County Executive Tom Nelson, noted that Jackson would be the first justice since the famed Thurgood Marshall to have significant experience as a public defender,? bringing a perspective to the bench that has been absent for decades.?\nAs progressives celebrated, top Republicans cast Jackson as too ideological for a lifetime appointment to the high court.",
    "Unlike the last three Supreme Court confirmations, we expect the Senate will comply with standard norms and procedures in considering President Biden's nomination.?\nStill, some on the left noted that conservatives will retain their 6-3 majority on the court  Jackson would replace liberal justice Stephen Breyer, who plans to retire at the end of the court's current term  and reiterated their dream of adding more seats to the bench.",
    "When we push all that kind of stuff away, that we are at this moment in our country's history, which is long overdue, to have her being nominated by President Biden...is, in fact, a beautiful thing.?\nRep. Cori Bush, D-Mo., praised Jackson's record of standing up for justice.?\nThere are no words to describe how my soul is moved by witnessing her nomination,? Bush tweeted.",
    "To have progressives rally and really push for the type of jurist that they wanted to see and to get that nomination, it really just goes to show that when progressives push  that when the people push, things can and do happen,? said Turner, a congressional candidate who is challenging Rep. Shontel Brown, D-Ohio, in a rematch of their 2021 special election fight.",
    "Ketanji Brown Jackson stresses love of country and Constitution after nomination to Supreme Court\nFeb. 25, 202206:58\nNina Turner, who co-chaired Sen. Bernie Sanders' presidential campaign in 2020 and has occasionally criticized Biden, praised him for making good on his promise to make history by nominating a Black woman.",
    "While Judge Jackson will bring a much-needed voice to the bench, her nomination will not change the balance of power on the Court,\" said Rep. Mondaire Jones, D-N.Y. \"The only way to restore integrity to the Supreme Court is to expand it.?\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "Despite approving of Jackson's appointment to the country's second highest court just months ago, he tweeted that Jackson's nomination means the radical Left has won President Biden over yet again.?\nThe attacks by the Left on Judge Childs from South Carolina apparently worked,? Graham added.",
    "When a seat on the court opened late in former President Barack Obama's second term, he nominated now-Attorney General Merrick Garland, who was seen as a consensus pick who could garner bipartisan support because he had been overwhelmingly confirmed to a lower court.",
    "Childs had bipartisan advocates, including House Majority Whip Jim Clyburn, D-S.C, a key Biden ally who has been credited with almost single handedly saving Biden's flagging presidential campaign with an endorsement during the 2020 primaries.",
    "Republicans essentially stole Justice Scalia's seat on the Court by refusing to comply with Senate norms,? said former Democratic Sen. Russ Feingold, who is now president of the American Constitution Society, a left-leaning legal group.",
    "Supreme Court politics have become increasingly polarized in recent years, especially since Senate Republicans undid the 60-vote threshold that had previously been required to confirm justices to the high court.",
    "But Republicans blocked Garland's nomination and then rammed through former President Donald Trump's three Supreme Court nominees, eliminating the ability for the Democratic minority to filibuster the picks.",
    "Left-leaning groups had rallied around Jackson, who was on a shortlist of Black women Biden was considering, citing a preference for someone with experience as a public defender or in civil rights law.",
    "Susan Collins, R-Maine, and Lisa Murkowski, R-Alaska, who both voted to confirm Jackson last year, praised her academic and legal credentials and said they would seriously consider her nomination.",
    "He added that he thought the White House felt it needed to \"give a bone to progressives\" after the failure of Democrats' voting rights bill and massive Build Back Better social spending package.",
    "President Joe Biden announced Friday he had selected Judge Ketanji Brown Jackson as his nominee to the Supreme Court, delighting progressives whose legislative agenda has stalled in Congress.",
    "The Republican National Committee will make sure voters know just how radical Jackson is.?\nSen. Lindsey Graham, R-S.C., who was one of three Republicans to vote to confirm Jackson to the D.C.",
    "\"By picking Jackson, Biden put far-left special interests ahead of defending Americans' rights and liberties,? Republican National Committee Chair Ronna McDaniel said in a statement.",
    "The White House may have decided it could go with a more progressive nominee since few Republicans were likely to vote for Biden's nominee, no matter whom he selected.",
    "Biden knocked it out of the park with this choice!? tweeted Malcolm Kenyatta, who is vying to be the first Black and openly gay senator from Pennsylvania.",
    "Senate races in particular could be ripe for Supreme Court politics, given the chamber's 50-50 split and the battle for partisan control this fall.",
    "Some on the left fatalistically assumed Biden would disappoint them by picking U.S. District Judge J. Michelle Childs of South Carolina.",
    "\"Democrats, however, slowly have woken up and started to mobilize,? said Sean McElwee, the founder of the think tank Data for Progress.",
    "Turner said she also appreciates that he chose someone with unique credentials and a reputation for being friendly to organized labor.",
    "Other candidates in this year's midterm elections with progressive profiles quickly weighed in with enthusiastic approval.",
    "Republicans threw Senate norms out the window starting in 2016 when they refused to even consider Judge Merrick Garland.",
    "I know we get caught up in who's on the left, who's on the right, or who's more progressive,? Turner added.",
    "Detractors who objected to Childs' corporate law background were pleased to be proven wrong Friday.",
    "We don't want the court to be political, but it obviously is a very politicized institution.\"",
    "Circuit last year, publicly promoted fellow South Carolinian Childs for the vacancy.",
    "John Fetterman, tweeted that he would proudly cast a vote? to confirm Jackson.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "One of his leading opponents in the primary, Lt. Gov.",
    "Other Republicans were more conciliatory.",
    "Progressives got their woman.",
    "Wisconsin Lt. Gov.",
    "Sens."
  ]
}