{
  "id": 2409,
  "mediaId": 178,
  "date": "1/19/2022 12:00:00 AM",
  "headline": "Democratic Senate candidate files election lawsuits",
  "image": "https://assets.startribune.com/static/img/branding/logos/strib-social-card.png?d=1642617364",
  "link": "https://www.startribune.com/democratic-senate-candidate-files-election-lawsuits/600137392/",
  "sentiment": "0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    2039,
    3096
  ],
  "sentences": [
    "In one case, Peckarsky asked a judge to order the Wisconsin Elections Commission to bar Milwaukee and other cities from marking absentee ballots with numbers that could reveal how individual voters cast their ballots.",
    "MADISON, Wis.  A Democratic candidate for U.S. Senate filed two lawsuits Tuesday alleged that Wisconsin election officials aren't keeping all ballots secret and are not properly vetting voting machines.",
    "That could lead to members of the public figuring out how individual voters cast their ballots, violating the state's guarantee of secret ballots, Peckarsky argues in one of the lawsuits.",
    "Most communities in Wisconsin count their absentee ballots at polling places, but Milwaukee and about three dozen other municipalities count theirs in one location.",
    "The Milwaukee Journal Sentinel reported Wednesday that candidate Peter Peckarsky, an attorney, filed the lawsuits in Milwaukee County Circuit Court.",
    "State law requires those that count them in one spot to write the poll list numbers of absentee voters on the back of their ballots.",
    "Peckarsky is making a longshot bid in a crowded Democratic primary that will decide who can challenge Republican Sen. Ron Johnson.",
    "The second lawsuit argues the commission is not following a state law that requires it to keep copies of voting machine software.",
    "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson.",
    "In the other, Peckarsky is seeking to force the commission to more thoroughly scrutinize voting machine software.",
    "The lawsuit says the state keeps the software with an escrow company instead of retaining it itself.",
    "Milwaukee blacks out the poll list number on ballots when people make public records requests.",
    "A spokesman for the elections commission did not immediately return a message seeking comment.",
    "Both the ballots and poll list numbers are available under the state's open records law.",
    "Whether all other communities follow the same practice is unknown.",
    "That prevents anyone from deciphering how others vote.",
    "Whether that could actually happen is not clear.",
    "Other Democrats in the race include Lt. Gov."
  ]
}