{
  "id": 2414,
  "mediaId": 424,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "Ron Johnson Breaks His Term-Limit Pledge in Order to Keep Serving the Billionaire Class",
  "image": "https://www.thenation.com/cdn-cgi/image/width=896,quality=80,format=auto/wp-content/uploads/2022/01/GettyImages-1230013857.jpg",
  "link": "https://www.thenation.com/?post_type=article&p=405324",
  "sentiment": "0.0",
  "mediaOutlet": "The Nation ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nichols",
  "authorUrl": "https://www.thenation.com/authors/john-nichols/",
  "termIds": [
    1568,
    2039
  ],
  "sentences": [
    "Yet, after months of delays in consideration of President Biden's nomination of the internationally renowned academic's nomination to serve at the US State Department's anti-Semitism envoy, The New York Times reports, Republicans are said to be mulling asking Dr. Lipstadt to publicly apologize to Mr. Johnson before allowing her nomination to proceed.?\nBut to a far greater extent than others in the circle of Trumpian acolytes, Johnson eschews criticism of the billionaire class and multinational corporations.",
    "He especially liked it when that spotlight was shined on him by Donald Trump (the senator once suggested that he and the 45th president could campaign together as The Ronald and The Donald?) and Fox News hosts such as Maria Bartiromo, whose Sunday morning show the senator chose as the venue for an exclusive broadcast interview following the publication of his announcement screed by the Journal.",
    "Another of the Democrats seeking to challenge the senator in 2022, Wisconsin Lieutenant Governor Mandela Barnes, summed things up succinctly when he observed, Ron Johnson used his office to enrich some of his wealthiest campaign donors while raising taxes on the middle class and widening the income inequality gap.?\nThe senator's machinations had nothing to do with Wisconsin.",
    "He bought his Senate seat with a generous outlay of family cash and contributions from other wealthy families in 2010, and he headed to Washington on a mission to lower his own taxes, cut regulations on corporations like the ones his family owns, and generally serve the billionaires who funded his 2016 reelection bid and are already writing checks for the 2022 race.",
    "Johnson broke his promise not with an apologetic announcement in the state the scandal-plagued Republican is supposed to representand where breaking the term-limit pledge was sure to get him called out as a political perjurerbut in his political safe space on the op-ed pages of Australian-born media tycoon Rupert Murdoch's Wall Street Journal.",
    "The Trump plan for a $1.5 trillion giveaway to the billionaire class was precisely the sort of Wall Streetfavored initiative that Johnson had dutifully backed since his election to the Senate in 2010 as the blandest member of that year's Republican wave.? Yet the Wisconsinite announced that he was opposed to the proposal.",
    "There, with the headline, Why I'm Seeking a Third Senate Term,? and the subhead, I'd like to retire, but I think the country is in too much peril,? Johnson made mendacious excuses for his infamy:\nDuring the 2016 campaign, I said it would be my last campaign and final term.",
    "Ron Johnson, the Wisconsin senator who has caused jaws to drop by promoting Covid vaccine skepticism while at the same time suggesting that gargling with mouthwash might help beat the virus, is running for reelection after pledging to quit at the end of his current term.",
    "A ProPublica investigation of the 2017 tax-cut fight recalled: Making the rounds on cable TV, the Wisconsin Republican became the first GOP senator to declare his opposition, spooking Senate leaders who were pushing to quickly pass the tax bill with their thin majority.",
    "He's been an ardent supporter of Wall Streetbacked free trade? deals and outsourcing schemes, a visceral critic of unions and regulations that protect workers and consumers, and, above all, a champion of tax breaks for the super-rich and the corporations they control.",
    "Over the past year, Johnson has earned so many headlines for his peddling of conspiracy theories and his extreme statements that it is easy to imagine that he is a Senate version of off-the-deep-end House members such as Georgia Republican Marjorie Taylor Greene.",
    "Wisconsinites who had paid attention to Johnson's lies during the course of his first term as a rubber stamp for Senate Republican leader Mitch McConnell (R-Ky.) were always skeptical about the millionaire politician's 2016 promise to give up his seat in 2022.",
    "For instance, after Johnson said he would have been more concerned if the January 6, 2021, insurrectionists who attacked the US Capitol had been Black Lives Matter activists, Holocaust scholar Deborah Lipstadt tweeted, This is white supremacy/nationalism.",
    "Confidential tax records obtained by ProPublica revealed\nthat Johnson's last-minute maneuver benefited two families more than almost any others in the countryboth are worth billions and both are among the senator's biggest donors.",
    "According to the ProPublica report:\nJohnson's demand was simple: In exchange for his vote, the bill must sweeten the tax break for a class of companies that are known as pass-throughs, since profits pass through to their owners.",
    "Neither of us anticipated the Democrats' complete takeover of government and the disastrous policies they have already inflicted on America and the world, to say nothing of those they threaten to enact in the future.",
    "Johnson identifies himself as a representative from Wisconsin, a politically divided state that is expected to be the scene of one of 2022's most hotly contested races in the battle for control of the Senate.",
    "Dick and Liz Uihlein of packaging giant Uline, along with roofing magnate Diane Hendricks, together had contributed around $20 million to groups backing Johnson's 2016 reelection campaign.",
    "Johnson praised such companies as engines of innovation.? Behind the scenes, the senator pressed top Treasury Department officials on the issue, emails and the officials' calendars show.",
    "Why did Johnson fight so hard against a president for whom he has generally been willing to debase himself as the most willing lapdog in the Senate Republican Caucus?",
    "He's not a fiscal conservative, he's a corrupt errand boy for the ultra rich,? says Outagamie County Executive Tom Nelson, a Democrat who is running against Johnson.",
    "The expanded tax break that Johnson muscled through netted them $215 million in deductions in 2018 alone, drastically reducing the income they owed taxes on.",
    "That's what happened in 2017, when Trump and his congressional allies were pushing to secure approval of the new president's tax cut plan for the ultrarich.",
    "Johnson is so committed to doing the bidding of the elites that it is the one issue on which he will break with benefactors like Trump and McConnell.",
    "Most senators launch their reelection runs by holding press conferences in communities they serve and giving interviews with their hometown papers.",
    "So when Ron Johnson wants to communicate with his actual constituents, he speaks to them via the editorial pages of The Wall Street Journal.",
    "Johnson, who obtained his fortune by marrying into a wealthy family, has historically made service to the investor class his top priority.",
    "At the time, Wisconsin media speculated that Johnson Wants a Bigger Tax Cut for Himself.? There was certainly something to that argument.",
    "At that rate, the cut could deliver more than half a billion in tax savings for Hendricks and the Uihleins over its eight-year life.",
    "Like Greene, he gets in bizarre fights that reveal not only that he is wrongheaded but also that he is exceptionally thin-skinned.",
    "Trump personally called the senator to beg for his support, and the bill's authors fattened the tax cut for these businesses.",
    "But the senator really represents Wall Street and the investor class that knows no loyalty to states or nations.",
    "Because The Wall Street Journal is, for all intents and purposes, this political careerist's hometown paper.",
    "Indeed, the historically low-profile senator became the energetic face of opposition to Trump's plan.",
    "But it turns out that, in this particular instance, Johnson was not just thinking of himself.",
    "His primary function as a senator has always been, and remains, the service of the ber-rich.",
    "That was my strong preference, and my wife'swe both looked forward to a normal private life.",
    "While Hendricks maintains a residence in the state, the Uihleins live in Lake Forest, Ill.",
    "He could care less about working people in Milwaukee or Madison, Oshkosh, or Kenosha.",
    "Was Ron Johnson really going to upend a plan to make rich people like himself richer?",
    "If they can pass it without me, let them,' Johnson declared.?\nWhat was going on?",
    "He was just bargaining to make his wealthy campaign donors wealthier.",
    "Johnson was already showing signs of an addiction to the spotlight.",
    "He represents the global billionaire class, wherever they live.",
    "Johnson flipped to a yes? and claimed credit for the change.",
    "Within two weeks, Johnson's ultimatum produced results.",
    "They fund his campaigns, and he delivers for them.",
    "Pure and simple.? That was an indisputable point.",
    "But that doesn't matter to Ron Johnson.",
    "But not Ron Johnson.",
    "The bill passed.",
    "Why so?",
    "No."
  ]
}