{
  "id": 2436,
  "mediaId": 21,
  "date": "1/8/2022 12:00:00 AM",
  "headline": "GOP Sen. Ron Johnson of Wisconsin, a top foil for Democrats who pledged to only serve for two terms, poised to run for reelection to a third: sources",
  "image": "https://i.insider.com/61d9b10c276e820019384466?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/ron-johnson-wisconsin-third-senate-term-conservative-sources-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    1968,
    1968,
    1925,
    1925,
    2087,
    2087,
    2039,
    2039,
    1568,
    1568,
    489,
    489,
    428,
    428,
    146,
    146,
    2972,
    2972,
    2855,
    2855
  ],
  "sentences": [
    "Two sources recently told CBS News that Johnson would launch his campaign next week, but the senator was still coy about his intentions for the fall contest, which will be pivotal for both parties as they seek control of the Senate for the second half of President Joe Biden's first term.",
    "The senator has attracted a wave of controversy in recent years, notably in stating that he \"might have been a little concerned\" if Black Lives Matters protestors had stormed the Capitol while expressing sympathy for the pro-Trump mob that broke into the apex of American government.",
    "Republican Sen. Ron Johnson of Wisconsin  who was first elected in 2010 as part of the Tea Party wave and previously pledged to serve for only two terms  is poised to run for reelection to a third term in the upper chamber, according to GOP sources who spoke with multiple outlets.",
    "Johnson  an accountant and businessman  is a staunch ally of former President Donald Trump and has a strong relationship with grassroots Republicans in the Badger State, which Biden narrowly won over the former president in the 2020 election.",
    "Democrats  still smarting from the senator defeating former Sen. Russ Feingold in 2010 and 2016  have been angling to beat him for years and have a full slate of party members who have launched campaigns in recent months.",
    "An internal poll released by the Barnes campaign on Friday showed him dominating the Democratic primary with 40% of the vote, followed by Lasry at 11%, Godlewski with 10%, and Nelson earning 8% of the vote, respectively.",
    "In the leadup to the 2020 presidential election, the senator  as chair of the Homeland Security Committee  pursued an aggressive probe regarding Hunter Biden's business dealings in Ukraine.",
    "The development would give the GOP its preferred candidate in the hotly-contested Midwestern swing state and comes after months of intense speculation about Johnson's political future.",
    "Republicans have gathered that Johnson will seek a third term in office  according to party sources who spoke with the media outlet  and would be shocked if he chose not to run.",
    "Several Republicans who would likely seek an open GOP seat have grown tired of waiting on the senator as they map out their own political plans, according to the CNN report.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Mandela Barnes  who is seen as the frontrunner in the race  along with state Treasurer Sarah Godlewski, Outagamie County Executive Tom Nelson, and businessman Alex Lasry.",
    "A report released in September of that year was unable to show that Hunter Biden's role on the board of a Ukrainian energy company impacted US policy.",
    "GOP leaders  namely Senate Minority Leader Mitch McConnell of Kentucky  have been pushing Johnson for months to pursue a reelection bid.",
    "\"I'm not ready to say anything,\" Johnson told CNN this week when asked if he would make his campaign announcement in the coming days.",
    "In November, Johnson told the Milwaukee Journal Sentinel that he would be best positioned to hold the seat for the GOP.",
    "Samuel Corum/Getty Images\nRepublican Sen. Ron Johnson is poised to run for a third term in office, per GOP sources.",
    "And last June, YouTube temporarily suspended Johnson for spreading misinformation about COVID-19 vaccines.",
    "Johnson, first elected to office in 2010, pledged in 2016 to only serve for two terms in the Senate.",
    "Democrats are angling to win back the key seat in a state that President Joe Biden won in 2020.",
    "The same poll also had Barnes and Johnson tied 43%-43% in a potential general election matchup.",
    "A Republican source informed CNN that the formal announcement could come as soon as next week.",
    "Subscribe to push notifications\n Deal icon An icon in the shape of a lightning bolt.",
    "There have also been larger implications to Johnson's indecision about the race.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "I mean the political pros believe that,\" he told the newspaper.",
    "\"Oh, it's not just me, I think just about everybody I talk to.",
    "For you\n Close icon Two crossed lines that form an 'X'.",
    "Stay up to date with what you want to know.",
    "The field of candidates includes Lt. Gov.",
    "Sign up for notifications from Insider!",
    "Sen. Ron Johnson of Wisconsin.",
    "Loading Something is loading."
  ]
}