{
  "id": 8648,
  "mediaId": 195,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Emboldened Democrats eye Ron Johnson amid new controversies",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/johnsonron_020922gn3_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3508853-emboldened-democrats-eye-ron-johnson-amid-new-controversies/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    741,
    802,
    923,
    1147,
    1568,
    1925,
    2039,
    2087,
    2145,
    146,
    298,
    318,
    428,
    2972
  ],
  "sentences": [
    "Johnson ignited controversy last week when he suggested that wokeness and critical race theory were the cause of recent mass shootings in the U.S. Additionally, the senator hit back at report from the Milwaukee Journal Sentinel saying he has been using tax dollars to travel between Washington, D.C., and a Florida vacation home, calling it a fully coordinated attack.",
    "Mandela Barnes (D) said Johnson and his gun lobby-funded colleagues are the reason we haven't been able to pass commonsense gun reform, while Milwaukee Bucks executive Alex Lasry said Doing nothing has resulted in one thing: more dead children and the people of Wisconsin are tired of having a do-nothing Senator in Washington.",
    "If Republicans and Ron Johnson can talk to those issues that are important to the average person who is independent-minded, but [say] hey this is affecting me personally,' I think that will help his chances, said Stephanie Soucek, the chairwoman of the Door County, Wis., GOP.",
    "The headlines have given Democrats running to replace Johnson fodder ahead of the general election as the Wisconsin senator's popularity declines in the state, and have them wondering if the Senate race could be a rare bright spot in a year expected to favor Republicans.",
    "Wisconsinites have a sense that [Johnson] doesn't carry their values, that he's rich himself, that he carries the wealthy and corporate special interests, said JB Poersch, the president of the Senate Majority PAC, a Democratic group.",
    "An analysis of past Marquette University polling on Johnson in the Milwaukee Journal Sentinel found that the senator's support has risen from 50 percent to 57 percent among Republicans over the last six years.",
    "Republicans argue that the way around this is for Johnson to focus on what they say are the failures of Democrats on kitchen table issues, like inflation, gas prices, the supply chain crisis, and the border.",
    "Sen. Ron Johnson (R-Wis.) is facing a slew of negative headlines ahead of his reelection bid later this year, potentially complicating what was already expected to be a tough race for the two-term senator.",
    "Earlier last month, Majority Forward, the nonprofit arm of the Senate Majority PAC, went up on statewide broadcast, cable, satellite, and digital as part of a $2.7 million advertising campaign.",
    "Over the past two years, Johnson's favorability ratings have fluctuated between the low 30's and mid '40s, getting as low as 32 percent in August of 2020, according to data from Marquette.",
    "The incumbent senator has stirred controversy with his past comments on the coronavirus vaccine, the 2020 presidential election results, racial justice protests, and other issues.",
    "The analysis also found that Johnson's name recognition has grown, with only 20 percent of voters saying they didn't know the senator or didn't have an opinion of him.",
    "Democrats argue that while Johnson is appealing to his conservative and Republican bases, he will end up struggling to gain support among moderates and independents.",
    "Democrats have particularly hit Johnson over his support for former President Trump's 2017 tax legislation, arguing that the bill ultimately benefitted Johnson.",
    "Fifty-six percent of respondents said the state was on the wrong track, while 69 percent said they were very concerned about inflation, according to the poll.",
    "Whoever wins in the U.S Senate race and in the gubernatorial race, I think you're looking at a point or two that divides the winners and losers, Scholz said.",
    "The poll also found that 39 percent of respondents said that Johnson cares about people like me, while 50 percent said that statement does not describe him.",
    "I think it's generally something he's had to deal with for a long time but I think it's more true now because he's been in Washington for twelve years.",
    "Ron Johnson has been underestimated probably as much as any politician out there, said former GOP strategist Brandon Scholz, who is based in Wisconsin.",
    "A Marquette University Law School poll released in April reflected the national mood Republicans have felt confident about going into the midterms.",
    "When you talk to every small business member in this state, owners, and operators, and others, that wasn't a Ron Johnson special, Scholz said.",
    "Outagamie County Executive Tom Nelson said Johnson is bearing false witness when he refuses to name the cause of these mass tragedies.",
    "But while Johnson's popularity among his core base of supporters may be high, the level of Democratic disdain for him has also risen.",
    "This idea that Ron Johnson is one foot in the grave and they've got the casket ready to go, I think is a tad premature, Scholz said.",
    "But despite the negative headlines against Johnson, Republicans maintain that the senator should not be underestimated in November.",
    "The four top primary candidates went on the offensive against Johnson after his comments about the cause of recent mass shootings.",
    "Wisconsin State Treasurer Sarah Godlewski hit Republicans, like Johnson, who she said are bought and paid for by the gun lobby.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "That was a small business tax break in a massive tax package that gave gazillions of tax breaks all over the place.",
    "It also stands to be one of the tightest with the non-partisan Cook Political Report calling it a toss-up.",
    "The 2022 campaign cycle is not the first time Johnson has had to deal with low favorability ratings.",
    "President Biden holds a 43 percent favorability rating and 53 percent unfavorability in the state.",
    "The Democratic primary is not until Aug. 9 but the party is already setting its sights on Johnson.",
    "Johnson's favorable rating sat at 36 percent, while his unfavorable rating came in at 46 percent.",
    "Six years ago, 40 percent of voters said they didn't know him or did not have an opinion of him.",
    "But Johnson is also no stranger to controversy and has overcome it on two previous occasions.",
    "The general election is expected to be one of the most closely-watched races in November.",
    "But the poll showed the state's incumbent GOP senator with low approval ratings as well.",
    "Tony Evers holds a 47 percent favorability rating and a 42 percent unfavorable rate.",
    "At the end of the month, the group booked an additional $3.6 million in airtime.",
    "The Democrats vying to oust Johnson also have launched their own attacks on him.",
    "His language in terms of Democrats, moderates, progressives is so nasty.",
    "They really don't truly see him as being for them, he continued.",
    "I think his opponents pretty much have a free ride, Scholz said.",
    "When you get to the general, it's kind of hand-to-hand combat.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He hasn't done enough to ensure the middle, Poersch said.",
    "And Johnson remains popular among Wisconsin Republicans.",
    "All of the attention is essentially focused on Johnson.",
    "I think he's counting on a base victory, he added.",
    "Yes, I think he is because he's a known quantity.",
    "It's not somebody who's inviting people in.",
    "Is Johnson a motivator for Democrats?",
    "He's polarizing, Poersch said.",
    "Wisconsin's Democratic Gov.",
    "Republicans dispute that.",
    "Lt. Gov."
  ]
}