{
  "id": 8653,
  "mediaId": 195,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Internal campaign poll shows Godlewski leading in Wisconsin Democratic Senate primary",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/06/GodlewskiSarah.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3507964-internal-campaign-poll-shows-godlewski-leading-in-wisconsin-democratic-senate-primary/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    741,
    802,
    1568,
    1925,
    2039,
    482,
    571,
    2855,
    2972
  ],
  "sentences": [
    "The browser does not support the specified video codec\nWisconsin state Treasurer Sarah Godlewski is leading in the state's Democratic Senate primary, according to an internal campaign polling memo exclusively obtained by The Hill.",
    "The poll, which was conducted by the left-leaning Public Policy Polling on behalf of Godlewski's campaign, shows Godlewski leading the pack at 35 percent support among likely Democratic primary voters, while Lt. Gov.",
    "Godlewski, who is the only woman running in the primary, has zeroed in on the issue of abortion rights, releasing an ad hitting incumbent Sen. Ron Johnson (R-Wis.) over the issue.",
    "She has more than doubled her vote from the Marquette University Law School poll in April, continuing her upward trajectory as the campaign heads into the critical summer months.",
    "Godlewski has made the most significant gains of any candidate in recent months following her communications on prescription drugs and, notably, choice, the campaign wrote.",
    "Eighty percent said the leak of a Supreme Court draft decision that showed the high court poised to overturn Roe v. Wade makes them more motivated to vote in the primary.",
    "An internal poll released by Lasry's team last week showed Barnes at 34 percent support among likely Democratic voters, with Lasry close behind at 31 percent support.",
    "Seventy-five percent of female likely Democratic primary voters said the issue made them much more motivated to vote, while 52 percent of men said the same.",
    "Meanwhile, a Marquette University Law School poll from April showed Barnes at 19 percent support and Lasry at 16 percent support.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Godlewski came in at 18 percent support, while Outagamie County Executive Tom Nelson received five percent support.",
    "Those findings include 67 percent of likely Democratic primary voters who said it makes them much more motivated.",
    "The Public Policy Poll was conducted among 566 likely Democratic primary voters in Wisconsin from May 23 to 24.",
    "Additionally, the memo found that abortion rights are a major issue among Wisconsin Democratic primary voters.",
    "The primary's other Democratic candidates have also spoken out in favor of abortion rights following the leak.",
    "Mandela Barnes (D) and Milwaukee Bucks executive Alex Lasry follow at 25 percent and 17 percent, respectively.",
    "Godlewski's campaign wrote in the memo that the internal poll shows she is making gains ahead of the primary.",
    "Lasry also released an ad last month vowing to be a relentless supporter of a woman's right to choose.",
    "Three percent of voters said they supported someone else, while 20 percent said they were not sure.",
    "Barnes spoke at an abortion rights rally last month and called for Roe v. Wade to be codified.",
    "Godlewski and Nelson came in at 7 percent and 5 percent support, respectively.",
    "She was the first candidate in the primary to release an ad on the issue.",
    "Outagamie County Executive Tom Nelson was not tested in the poll.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The margin of error is plus or minus 4.1 percentage points.",
    "That poll's margin of error is plus or minus 4.1 percent.",
    "Polls show a tightening race ahead of the Aug. 9 primary.",
    "The poll's margin of error is plus or minus 3.7 percent.",
    "The results came after an informed vote took place."
  ]
}