[
  {
    "id": 4021,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, who facilitated the shady, corrupt 2020 election, recently said that “AZ must go 100% ballot by mail.” Rogers responded by calling him a “crook” and telling him her plans for this session.",
    "author": "Jordan Conradson",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 12733,
    "mediaId": 2662,
    "date": "2022-02-28",
    "sentence": "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> “acted unlawfully” by creating his own voter guidelines that were not authorized by the Elections Procedures Manual.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona"
  },
  {
    "id": 12646,
    "mediaId": 2662,
    "date": "2022-03-01",
    "sentence": "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> also “acted unlawfully” by exceeding his constitutional authority and making up his own election instructions.",
    "author": "Jordan Conradson",
    "title": "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations"
  },
  {
    "id": 8715,
    "mediaId": 8350,
    "date": "2022-04-08",
    "sentence": "Richer, a Republican who unseated Democrat <span class='selected-term'>Adrian Fontes</span> in November 2020, said he was “100%” certain the election was handled properly.",
    "author": "MARCIA HAMMOND",
    "title": "Maricopa County Recorder Richer ‘sick of’ ongoing election challenge"
  },
  {
    "id": 5177,
    "mediaId": 8476,
    "date": "2022-04-18",
    "sentence": "On the Democratic side, Reginald Bolding raised $160,000, edging out the $139,000 that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> raised.",
    "author": "Dillon Rosenblatt",
    "title": "The haves and the have nots become clear in governor, secretary of state races"
  },
  {
    "id": 4790,
    "mediaId": 8475,
    "date": "2022-04-18",
    "sentence": "On the Democratic side, Reginald Bolding raised $160,000, edging out the $139,000 that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> raised.",
    "author": "Dillon Rosenblatt",
    "title": "The haves & have nots become clear in Arizona governor, secretary of state races"
  }
]