{
  "id": 3286,
  "mediaId": 187,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "How Politics Poisoned the Evangelical Church",
  "image": "https://cdn.theatlantic.com/thumbor/Aovs3sKbZH1KaKKWFsuQw_imhBg=/0x0:2162x1441/1856x1238/media/img/posts/2022/04/WEL_ALberta_Evangelicalsinside1/original.jpg",
  "link": "https://www.theatlantic.com/magazine/archive/2022/06/evangelical-church-pastors-political-radicalization/629631/",
  "sentiment": "0.0",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Alberta",
  "authorUrl": "https://www.theatlantic.com/author/tim-alberta/",
  "termIds": [
    1901,
    3007,
    2983,
    2550,
    2645,
    2672,
    2945,
    3063,
    3073
  ],
  "sentences": [
    "He defended the January 6 insurrection, which was not a big deal. In fact, Bolin himself nearly traveled to Washington that day because a lot of people from our church were going, and because I love Donald Trump.\nThe Trump conversion experiencehaving once been certain of his darkness, suddenly awakening to see his lightis not to be underestimated, especially when it touches people whose lives revolve around notions of transformation.",
    "The battle lines Bolin described as having emerged over the past five yearscultural reckonings over racism and sexual misconduct; a lethal pandemic and fierce disputes over vaccines and government mandates; allegations of election theft that led to a siege of the U.S. Capitol; and, underlying all of this, the presidency, prosecution, and martyring of Trump himselfhave carved up every institution of American society.",
    "The executive director of Stand Up Michigan decried the evil Democrats in charge of the state; said there was probably some truth to QAnon, which holds that satanic liberal elites are cannibalizing children for sustenance; and warned that Christians are too nice. The chair of the county board of commissioners railed against diversity training and critical race theory.",
    "Once left to cry jeremiads about civilizational declinehaving lost fights over sex and sexuality, drugs, abortion, pornography, standards in media and education, prayer in public schoolsconservative Christians organized their churches, marshaled their resources, and leveraged their numbers, regaining the high ground, for a time, in some of these culture wars.",
    "From the June 2020 issue: Adrienne LaFrance on how QAnon is more important than you think\nMany right-wing pastors have formed allianceswith campaign consultants, education activists, grassroots groups, even MAGA-in-miniature road shows promoting claims of an assault on American sovereigntythat bring a steady flow of fresh faces into their buildings.",
    "At one point, I show Bolin a Facebook post he wrote months earlier: Im still wondering how 154,000,000 votes were counted in a country where there are only 133,000,000 registered voters. This was written, I tell him, well after the Census Bureau had published data showing that more than 168 million Americans were registered to vote in 2020.",
    "Having convinced so many evangelicals that the next election could trigger the nations demise, Christian leaders effectively turned thousands of churches into unwitting cells in a loosely organized, hazily defined, existentially urgent movementthe types of places where paranoia and falsehoods flourish and people turn on one another.",
    "Some of the Christian rights leading voicespeople like Paul Weyrich, of the Heritage Foundation, and James Dobson, of Focus on the Familypromoted visions of postmillennialism, a controversial interpretation of scripture that encourages amassing political power as a means of building a kingdom in this life parallel to that in heaven.",
    "Not only were Christians conditioned to understand their struggle as one against flesh and blood, fixated on earthly concerns, a fight for a kingdom of this worldall of which runs directly counter to the commands of scripturethey were indoctrinated with a belief that because the stakes were getting so high, any means was justified.",
    "He suggests there is mounting evidence of a stolen election, concluding, With the information thats coming out in Arizona and Georgia and other places, I think its time for there to be a full audit of all 50 states to find out the level of cheating and the level of manipulation that actually took place. The people around me cheer.",
    "However effective Brown might be at soothing his congregants for 45 minutes on a Sunday morning, Rush [Limbaugh] had them for three hours a day, five days a week, and Fox News had them every single night. Brown kept reminding his people that scriptures most cited command is Fear not. But he couldnt break through.",
    "Probably the most egregious thing I ever did, Bolin said, chuckling, was I did do a Nazi salute and called her Whitler. \nIn my ensuing visits to FloodGate, and in long conversations with Bolin, it became clear that this type of extreme political expression is central to his churchs identity, and to his own.",
    "Jeff added: It was the pastors sonwho, he claimed, is said to be a member of antifa in Canadalecturing on white privilege and critical race theory. (I could not confirm that the pastors son is, in fact, a member of antifa in Canada; several people who know the family laughed when I asked the question.)",
    "And it didnt just start during COVID.\nFurkas describes herself as a moderate Democratwhich, she joked, makes me the most liberal person at our church. When Trump became the Republican nominee and Pastor Brown shared his intention to vote for him, Furkas was so disappointed that she left the church.",
    "He begins telling me about a couple of Democrats who attend FloodGate and have rebuked him for his political rhetoricbut who reassure him, Bolin says, When it comes to the Word, youre rock-solid. Then he tells me something surprising: Hes thinking of scaling back Headline News on Sunday mornings.",
    "This explains why, even during a period of slumping church attendance, the number of white evangelicals has grown: The Pew Research Center reports that more and more white Trump supporters began self-identifying as evangelicals during his presidency, whether or not they attended church.",
    "And if that fails, we have a countryyes, Ill say itto take back.\nLockes sermon is about the Philistines of the Old Testament stealing the Ark of the Covenant from the Israelites, because they sensed that the only way to defeat Gods chosen people was to separate them from God.",
    "Brown wrote to me explaining the combustible dynamics within the evangelical Church and describing his own effortsas the conservative pastor of a conservative congregationto keep his members from being radicalized by the lies of right-wing politicians and media figures.",
    "Having read blog posts about a FEMA program that recruited clergy to help calm communities after natural disasters, this man believed that Brown had gone to D.C. for covert trainingand that he and other pastors were preparing to help the government enforce martial law.",
    "Christians have languished with their participation in politics, he said, which is one of the reasons were in this dire position as a nation.\nWhen Bolin arrived at FloodGate in 2010, the churchfounded in 1972 and formerly called the Fathers Housewas mostly apolitical.",
    "A state senator tried to play to the basejoking that shed asked God why hed allowed Gretchen Whitmer to become governorbut then cowered when the base turned on her, with people standing to demand that she answer the question of whether Trump had won Michigan in 2020.",
    "I cant prove what would have happened, Brown said, but my guess is that our church would have descended into the sort of war zone that other churches have become.\nThere are days when Brown envies his colleagues from other churches who havent waded into this fight.",
    "But a years worth of conversations with pastors, denominational leaders, evangelical scholars, and everyday Christians tells a clear story: Substantial numbers of evangelicals are fleeing their churches, and most of them are moving to ones further to the right.",
    "He tells of a doctor who claims to know that between 100 and 200 United States Congress members, plus many of their staffers and family members with COVID, were treated by a colleague of his over the past 15 months  with  Bolin stops and puts a hand to his ear.",
    "But in leading their predominantly white, Republican congregations, Brown and Bolin have come to agree on one important thing: Both pastors believe there is a war for the soul of the American Churchand both have decided they cannot stand on the sidelines.",
    "One rarely needs to read to the bottom of a poll to learn that the religious group most opposed to vaccines, most convinced that the 2020 presidential election was stolen, most inclined to subscribe to QAnon conspiracy theories is white evangelicals.",
    "The pastor said his concern was not simply for his congregation of 300, but for the millions of American evangelicals who had come to value power over integrity, the ephemeral over the eternal, moral relativism over bright lines of right and wrong.",
    "This downward spiral owes principally to two phenomena: the constant stench of scandal, with megachurches and prominent leaders imploding on what seems like a weekly basis; and the growing perception that Christians are embracing extremist views.",
    "He began by suggesting that COVID-19 was possibly being manipulated with the funding and blessing of Dr. Anthony Fauci, the man who put us in masks. When he heard scattered boos, Bolin said: Thats right, go ahead! The sanctuary filled with jeers.",
    "What I worry about is people tuning Ken outpeople who dont like his politics, and because of that, they stop letting him be their pastor, Bob Fite, a high-school history teacher who has attended Community Bible for more than a decade, told me.",
    "In the time since, as hes traveled the country and counseled pastors on the intensifying divisions within their congregations, Moore has become convinced that the problem of political fanaticism inside the Church poses real threats outside it.",
    "He promotes a new book that tells of how the left has done a power grab to systematically dismantle religion and banish God from the lips, minds, and hearts of believers, prompting the couple in front of me to make a one-click Amazon purchase.",
    "We had a visitor this morning who said, You know, its really refreshing to hear a pastor talk about issues like this.  Basking in the ovation hes just invited, Bolin adds: Im okay talking about these things.\nHe asks if he can keep going.",
    "Back when I believed there was an honorable alliance between Republicans and evangelicals, it was because I believed that our values would ultimately prevail, come what may on this Earth, whether we win or lose some election, Brown said.",
    "The moment Bolin stops lighting fires from the pulpit at FloodGate, how many of its memberswho are now accustomed to that sort of inferno, who came to FloodGate precisely because they wanted the heatwill go looking for them elsewhere?",
    "Pastor Bill Bolin calls it his diatribe. The congregants at FloodGate Church, in Brighton, Michigan, call it something else: Headline News.\nBolin, in his mid-60s, is a gregarious man with thick jowls and a thinning wave of dyed hair.",
    "Smaller denominations are losing affiliate churches as pastors and congregations break from their leadership over many of the same cultural flash points, choosing independence over associating with those who do not hold their views.",
    "Setting out on his Christian journeyworking as a substance-abuse counselor, attending Bible college, pastoring in churches from California to PennsylvaniaBolin found that many of his old stances were incompatible with his new faith.",
    "Jeff and Deidre, he tells me, werent just pushing him on abortion; they were challenging the pastors policy of political neutrality from the pulpit, and accusing him of taking the easy way out of the debates fracturing his church.",
    "Its the story of millions of American Christians who, after a lifetime spent considering their political affiliations in the context of their faith, are now considering their faith affiliations in the context of their politics.",
    "In the Book of John, Chapter 10, Jesus warns of the hired hand who puts his own safety ahead of the flocks: So when he sees the wolf coming, he abandons the sheep and runs away.\nBrown believes hes been called to be a shepherd.",
    "When COVID arrivedbringing with it a new flood of misinformationBrown and his leadership team wrote a letter to the congregation laying out their reasons for closing the church and specifying the sources they were relying on.",
    "Evangelicalsincluding my own fatherbecame compulsively political, allowing specific ethical arguments to snowball into full-blown partisan advocacy, often in ways that distracted from their mission of evangelizing for Christ.",
    "The nations largest denomination, the Southern Baptist Convention, is bleeding members because of ferocious infighting over race relations, women serving in leadership, accountability for sexual misconduct, and other issues.",
    "Weve talked at length about extremism in his churchthe people who were certain that Trump would never leave office, the people who swear by QAnonand Bolin seems, at some level, to genuinely be reckoning with his role in it.",
    "Many of his members, Brown said, have told him over the past year that they swore off cable news or deleted their social-media accounts; not coincidentally, some of them seem more engaged with scripture than ever before.",
    "In this environment, a church leaders stance on biblical inerrancy is less important than whether he is considered woke. His command of scripture is less relevant than suspicions about how he voted in the last election.",
    "Some of the same people who tormented Clinton and lectured on morality were just as ethically compromised as he wasbut because they played for what was ostensibly Gods chosen political team, they faced little scrutiny.",
    "Pastors are not immune from anxiety over their mortgage or kids college tuitions; many younger clergy members, in particular, worry that they havent amassed enough goodwill to get argumentative with their congregation.",
    "For white evangelicals, the only thing more galvanizing than perceptions of their idealized nation slipping away was the conviction that their favored political party was unwilling to fight for the countrys survival.",
    "In 1975, more than two-thirds of Americans expressed a great deal or quite a lot of confidence in the church, according to Gallup, and as of 1985, organized religion was the most revered institution in American life.",
    "Brown is a pastors kid and lifelong conservative whos never had a sip of alcohol; Bolin is an erstwhile radical liberal who once got so high on LSD that he jumped onstage and grabbed a guitar at a Tom Petty concert.",
    "He tells me he doesnt want his rants about Biden or the 2020 electionwhich are nonessentialsto be taken with the seriousness of his statements about Jesus, which are the essentials people should come to church for.",
    "In the time I spent listening to Bolin preach, sitting with him for interviews, and following his Facebook page, I recorded dozens of political statements that were either recklessly misleading or flat-out wrong.",
    "The second you get into any of the political stuff, you start losing focus, Michael Bingham, the lead pastor at Aldersgate United Methodist Church, in Greenville, South Carolina, told me during a visit last fall.",
    "The churches that host election-fraud profiteers and weeknight speakers denouncing the pseudo-satanic agenda of Black Lives Matterchurches that consider themselves mainstreamwere starting to feel like old hat.",
    "But these same pastors report having lostin the past few years alonea significant portion of their congregation because of complaints that they and their staff did not advance right-wing political doctrines.",
    "Once the president of the Southern Baptist policy arm, Moore quit the denomination in 2021 after enduring years of psychological warfare for his opposition to Trumpism and advocacy for racial reconciliation.",
    "From the October 2018 issue; The tiny blond bible teacher taking on the evangelical political machine\nJen Furkas, who began attending Community Bible in 2003, wondered if Browns efforts were coming too late.",
    "I got to know him during the 2020 presidential campaign, when I was writing dispatches from around the country and asking readers about the stories and trends they thought werent receiving enough attention.",
    "My only hope is that, when the time comes, our people can separate without shattering.\nKen Brown knows plenty of pastors like Bingham, who refuse to talk about the very things tearing their churches apart.",
    "Second, and of more immediate relevance when we spoke, the United Methodist Church was finalizing plans for a denominational divorce over core social divisions, including whether to ordain gay ministers.",
    "When I met with some of the longest-tenured laypeople of the church, almost everyone indicated that when the UMC divorce was finalized, they would follow the church that reflected their political views.",
    "Introduced at the beginning of the program as the rock star who disobeyed the government, Bolin took the stage and wasted no time before showing his visitors just how uncouth one could be in the pulpit.",
    "He has called President Biden a sex-trafficking, demon-possessed mongrel.\nIf this all sounds a bit strangeominous, or even dangerous, as one local pastor warned me the night before I visitedwell, sure.",
    "The Atlantic Interview: Why this evangelical got fired for promoting vaccines\nYeah, thats one I regret, he tells me, explaining that he subsequently learned that the numbers hed posted were incorrect.",
    "I knew which pastors were feuding; whose congregations were mired in scandal; which church softball teams had a deacon playing shortstop, and which ones stacked their lineups with non-tithing ringers.",
    "The irony, Brown said, is that by pretending that a clash of Christian worldviews isnt happening, these pastors risk losing credibility with members who can see it unfolding inside their own church.",
    "Having grown up just down the road, the son of the senior pastor at another church in town, Ive spent my life watching evangelicalism morph from a spiritual disposition into a political identity.",
    "All the while, his congregation swelledmoving from their old church building, which seated 250, into a large outdoor tent, then into an even bigger tent, and eventually into the current colossus.",
    "Under the tentative plans, individual churches will vote on whether to break away and join the new conservative denomination or side with the liberals and remain under the existing UMC umbrella.",
    "He hears the grousing that his political commentary takes the focus off Jesus, but his entire rationale rests on the belief that Jesus long ago became a secondary focus for some in the church.",
    "Sometimes, when someone leaves, he said, that means youve been successful in protecting the rest of your flock.\nBut not everyone whos dissatisfied with a church leavesat least, not right away.",
    "Bolin had diagnosed in some detail the sorting within evangelicalismthe scramble of Christians switching congregations, churches rising and falling, pastors adapting or heading for the exits.",
    "From the January/February 2022 issue: Tim Alberta on Peter Meijer and what the GOP does to its own dissenters\nThere are different truths in politicsTrumps truth, Bidens truth, whatever, B.J.",
    "And they fell for it.\nTony and Linda say FloodGates styleand Bolins fiery messages on topics like vaccines and voter fraudhas changed the way they view their responsibilities as Christians.",
    "There are people at the church, people who Id consider friends, who would have said very hurtful, very unbiblical things, Furkas, the assistant principal of a local public school, told me.",
    "It became all about winning.\nLate in Clintons tenure, Brown, who was serving as an associate pastor in Flat Rock, Michigan, was commissioned to plant a new church down the road in Trenton.",
    "When Trump was elected thanks to a historic showing among white evangelicals81 percent voted for him over Hillary Clintonthe victory was rightly viewed as the apex of the movements power.",
    "Despite being personally conservative on most issuesand estimating that two-thirds of the church agrees with himBingham has maintained a posture of unflinching neutrality from the pulpit.",
    "Literally moments before he talked about the fervency dying down, Bolin previewed a shtick he was going to deliver on Sunday morning about Apple adding a pregnant-man emoji to the iPhone.",
    "Eager to put on a show for the visitors, Locke announces that his special guesthe tries to book one every Sundayis the actor John Schneider, who played Bo Duke on The Dukes of Hazzard.",
    "For generations, white evangelicals have cultivated a narrative pitting courageous, God-fearing Christians against a wicked society that wants to expunge the Almighty from public life.",
    "It was clear that hed seen how this fanaticism had infected the church.\nFurkas recalled how, a few years ago, Brown delivered a sermon reminding everyone whom Jesus had come to save.",
    "Still, membership has been in decline for years, in part because so many Christians today gravitate toward the places that are outspokenly aligned with their extra-biblical beliefs.",
    "But if I didnt see Trumpand Trumpismas a danger to our mission, they would never hear me say anything about Trump.\nBrown has informed the church that hes headed toward retirement.",
    "Tony and Linda had their share of complaintsthe church was too moderate and too seeker-friendly, catering more to newcomers than longtime Christiansbut they had no plans to leave.",
    "Once, when he visited Washington, D.C., for a pastors conference, he returned home to learn that people in the church had been entertaining a rumor started by one of its members.",
    "From the April 2018 issue: Michael Gersons cover story on Trump and the evangelical temptation\nWhen we finally met, in the spring of 2021, Brown told me his alarm had only grown.",
    "A local nurse who attends FloodGate, who is anonymous at this timeshe reported to my wife the other day that at her hospital, they have two COVID patients that are hospitalized.",
    "It was May 2021, and the church was hosting an event for Stand Up Michigan, a group that had formed to protest pandemic shutdowns, masking, and, most recently, vaccine mandates.",
    "When we got to FloodGate, it confirmed for us what wed been missing.\nDeFelice, a building inspector, had been attending the Plymouth church for 14 years when the pandemic began.",
    "When I would challenge him, asking for a source, Bolin would either cite multiple articles he had read or send me a link to a website like Headline USA or Conservative Fighters.",
    "Atmospherics asideits not every day you worship inside a tent next to an armed man wearing an Alex Jones shirtthe substance was familiar and predictable to the point of tedium.",
    "I dont know of a single church thats not affected by this.\nMore than a few times, Ive heard casual talk of civil war inside places that purport to worship the Prince of Peace.",
    "On this particular fall Sunday, Bolin riffs on everything from California forcing vaccines on schoolchildren to the IRS proposing more oversight of personal banking accounts.",
    "The first piece of scripture I memorized as a childthe verse that continues to guide my own imperfect walkis from Pauls second letter to the early Church in Corinth, Greece.",
    "The result is not merely a willingness to act with desperation and embrace what is wrong; it can be a belief, bordering on a certainty, that what is wrong is actually right.",
    "The first service she attendedin which Pastor Bolin unapologetically advocated for people, like Jeff and Deidre, who felt cheated by their old churchesbrought her to tears.",
    "Paul is a conservative, but his conservatism has no teeth.\nTony DeFelice is another new arrival at FloodGateand another Christian who got tired of his pastor lacking teeth.",
    "And hes confident that righteousness will prevail: States are going to begin decertifying the results of the last election, he says, and Trump will be returned to office.",
    "Bolin says FloodGate and churches like it have grown in direct proportion to how many Christians felt betrayed by their pastors. That trend looks to be holding steady.",
    "Brown was an undergraduate at the University of Michigan, and for the first time, the Christian kid whod graduated from a Christian high school was outside his bubble.",
    "Brown pastors a traditional church where people wear sweaters and sing softly; Bolin leads a charismatic church where people dress for a barbecue and speak in tongues.",
    "Bolin told me that after a troubled childhood in Southern Californiahe said he began drinking and doing drugs at age 9he discovered an interest in political activism.",
    "Having spent my entire life in and around the evangelical Church, I had in recent years become desensitized to all the rhetoric of militarism and imminent Armageddon.",
    "Their worst fears had already been confirmed: A friend on the elder board had told them that Jenkinsontheir pastor, their friendhad argued to keep the church closed.",
    "Though they were frustrated that the preaching wasnt more overtly political, they were highly engaged: leading a marriage ministry, active with other homeschoolers.",
    "Brown also launched a blog and a podcast, vying for his members attention at a moment when so many were suddenly stuck at home and swimming in hearsay and innuendo.",
    "Walking out of Global Vision, I asked myself: How many pastors at smaller right-wing churchespastors like Bolinwould have felt uneasy sitting inside this tent?",
    "The more he thinks about it, Bolin says, he might just cut the segment altogether, posting those political musings on Facebook but keeping them out of worship.",
    "Oak Pointe Novi, the parent church, introduced a video series called Conversations, which featured interviews with Black pastors and social-justice activists.",
    "Brown acknowledged that his tactics had pushed some people away, but he shrugged off the number, saying four or five families and a few individuals had left.",
    "And many Christians are not practicing it. A stocky man with steely blue eyes and a subdued, matter-of-fact tone, Brown struck me as thoroughly disheartened.",
    "Bolin tells me the church has sold the building were sitting inwhere the congregation has met since the 1970sand purchased a sprawling complex down the road.",
    "This mission creep inside evangelicalism is why some churches have taken an absolutist approach: no preaching on elections, no sermons about current events.",
    "Theres such energy that even some very serious-looking mendressed in paramilitary gear, firearms strapped to their sidesbounce on their toes and clap along.",
    "But whereas Brown became disillusioned by the religious rights hypocrisy and political ruthlessness, Bolin believes that evangelicals didnt go far enough.",
    "The United Methodist Church, Americas second-largest denomination, is headed toward imminent divorce over irreconcilable social and ideological divisions.",
    "Perhaps it shouldnt be surprising that Christians, like Americans from every walk of life, are self-selecting into cliques of shared habits and thinking.",
    "The American life weve known  If we see threats to something we value, we fearthat is, we revere, we hold in inappropriate awethose who can take it away.",
    "After an outcry, the pastor apologized for the ruptures that have occurred, while the elders issued a separate statement denouncing critical race theory.",
    "One Sunday morning in November, Locke, prowling the stage in a bright-orange tie, asks how many people have traveled to his tent from outside Tennessee.",
    "With the country on the brink of defeat at the hands of secularists and liberals, Tony no longer distinguishes between the political and the spiritual.",
    "Its a mass estrangement, in which people stop listening to the pastor or stop trusting one anotheror bothand the church slowly loses its cohesiveness.",
    "He became infatuated with Robert F. Kennedy and Martin Luther King Jr., committing himself to the art of protesting: marches, sit-ins, hunger strikes.",
    "To many evangelicals today, the enemy is no longer secular America, but their fellow Christians, people who hold the same faith but different beliefs.",
    "To his credit, even when my dad would lean hard into a political debate, he was careful to remind his church of the appropriate Christian perspective.",
    "Pastors report losing an occasional liberal member because of their refusal to speak on Sunday mornings about bigotry or poverty or social injustice.",
    "Some of it was explainable: The cultural climate was getting chilly for evangelicals; the Great Recession was squeezing his blue-collar congregation.",
    "When I pressed him on these beliefsoffering evidence that Joe Biden won legitimately, and probing for the source of his convictionTony did not budge.",
    "Then, when he was 20 years old, he was packing for a cross-country hitchhiking trip and discovered a Bible that had been given to him years earlier.",
    "Hes just not sure anymore that Community Bible is a good fit for someone like himdeeply conservative, a Trump voter, a consumer of right-wing media.",
    "So many people who love the Lord, who give their time and money to the poor and the mourning and the persecuted, have been reduced to a caricature.",
    "For all their talk of keeping Aldersgate unified, Bingham and Myers acknowledged that in a few years time, they would belong to different churches.",
    "Then, in 2016, he went viral with a selfie video, shot outside his local Target, skewering the companys policies on bathrooms and gender identity.",
    "So I wrote her back and said, Hey, heres the deal: If you have forwarded this to anyone, you have an obligation to go back to them and correct it.",
    "But I know its come at a cost.\nEvery person I spoke with from Community Bible brought up the fact that some longtime members had quit the church.",
    "Nestled in a wooded stretch of exurban Wilson County, Tennessee, the campus of Greg Lockes Global Vision Bible Church feels more like a compound.",
    "I aint never had a wino or a drunkard [come] in here and say, I cant believe you! I aint never had a crackhead mad for keeping this church open!",
    "When I visited, the churchan elegant structure with room for 500 in the sanctuarywas hosting maybe 150 people total across two Sunday services.",
    "Many of the backwater websites and podcasts Bolin relies on for political information were the same ones cited to me by people from his church.",
    "With rumors of this imminent split roiling Aldersgate, Bingham told me, the last thing he wanted was to exacerbate tensions within his church.",
    "Hands down, the biggest challenge facing the Church right now is the misinformation and disinformation coming in from the outside, Brown said.",
    "Beginning in the 1980s, white evangelicals imposed themselves to an unprecedented degree on the government and the countrys core institutions.",
    "He felt threatened by what he saw all around him: moral relativism, shameless sexuality, far-left professors who openly disparaged his faith.",
    "I worried that could come back to haunt us.\nJust when Browns passion for politics was beginning to abate, Bill Clinton was elected president.",
    "He aligned himself with figures like Dinesh DSouza and Charlie Kirk to gain clout as one of the Christian rights staunchest Trump supporters.",
    "They really wondered whether I was a part of this secret government plot.\nEven as Brown became more vocal, he knew he was being drowned out.",
    "A pastor asked me the other day, What percentage of churches would you say are grappling with these issues? And I said, One hundred percent.",
    "I told Valerie, One day, if Ken says the wrong thing, I might have to stand up and leave. \nBill Bolin knows something about people leaving.",
    "When they asked the pastor why, despite being personally pro-life, he had never preached on abortion, they got the response theyd dreaded.",
    "He reminded his people that Christians aspire to a higher standard than the lesser of two evils. Brown felt confident they understood him.",
    "Then came Easter 2020, when Bolin announced that he would hold indoor worship services in defiance of Michigans emergency shutdown orders.",
    "Why arent we just sticking to that truth?\nBob Fite said he addressed these concerns in a letter to Pastor Brown and the leadership team.",
    "I realize these are hard conversations, but the reason we left Milford is they were never willing to have the conversation, Jeff said.",
    "Followers of Jesus are to orient themselves toward his enduring promise of salvation, and away from the fleeting troubles of humanity.",
    "While covering presidential campaigns, I had attended political rallies at churches across Iowa, South Carolina, Texas, and elsewhere.",
    "At a place like Community Bible, with a core of members who have been together for years, the concern isnt necessarily a mass exodus.",
    "Listening to Bolin that morning, I kept thinking about another pastor nearby, one who approached his job very differently: Ken Brown.",
    "Between 40 minutes of praise music and 40 minutes of preaching is the strangest ritual Ive ever witnessed inside a house of worship.",
    "When the church closed, rumors flew about the board of elders holding contentious late-night meetings to debate pandemic protocols.",
    "If youre not taking a side, youre on the wrong side.\nIf this is a tale of two churches, it is also the tale of churches everywhere.",
    "Locke salutes them as soldiers rising up in Gods army. Some hear this more literally than others: I spot a few folks carrying guns.",
    "And it cheapens the Gospel.\nWhatever the specifics of their exchange, to Jeff and Deidre, Jenkinsons stance amounted to cowardice.",
    "Since what is seen is temporary, but what is unseen is eternal.\nPauls admonishment of the early Church contains no real ambiguity.",
    "Then he would concede that the claims were in dispute, and insist that he didnt necessarily believe everything he said or posted.",
    "Doesnt he worry that if people see him getting the easy things wrong, they might suspect hes also getting the hard things wrong?",
    "More people will leave churches that refuse to identify with a tribe and will find pastors who confirm their own partisan views.",
    "(I thought they were doing preemptive COVID contact tracing; they were actually enlisting volunteers for political activities.)",
    "For the next 15 minutes, Bolin does not mention the forgiveness of sins, the resurrection of the body, or the life everlasting.",
    "Instead, he spouts misinformation and conspiratorial nonsense, much of it related to the radically dangerous COVID-19 vaccines.",
    "His influence on the courts will change the country for the next 50 years. Bolin sounded ashamed of having ever doubted Trump.",
    "And for evangelicals, it was time to play for keeps.\nWhen I first walked into the sanctuary at FloodGate, I didnt see a cross.",
    "And then, Brown said, came Barack Obama.\nIt felt silly at firstjokes about Obamas birth certificate, comments about his faith.",
    "At his previous church, in the Democratic-leaning Detroit suburb of Plymouth, they did not speak a single word about politics.",
    "Over that time, he says, hes watched as political disputes have traveled from the periphery of church life to the heart of it.",
    "These days, Locke preaches to 2.2 million Facebook followers and has posed for photos with Franklin Graham at the White House.",
    "One day, a longtime member told Brown something that at the time sounded shocking: The president wore a secret Islamic ring.",
    "Brown found an identity in the nascent evangelical movement that aimed to restore the religious values of Americas founding.",
    "was raised evangelical, graduated from Bob Jones University, and believes its his responsibility to be active in the Church.",
    "was upset that Brown had released multiple podcast episodes vilifying the people responsible for the January 6 insurrection.",
    "There are Christians taking all the populist passions and adding a transcendent authority to it.\nMoore is not exaggerating.",
    "The crowd erupts and everyone hoists their phone in the air, heralding Schneiders arrival like Catholics awaiting the pope.",
    "He is just as convinced that Trump won the 2020 election, he said, as he is that Jesus rose from the dead 2,000 years ago.",
    "He recently accused multiple women at his church of being witches (his source: a demon he encountered during an exorcism).",
    "He says the new lead pastor doesnt necessarily need to share his approach to the crises of discernment and disinformation.",
    "Substantial numbers of evangelicals are fleeing their churches, and most of them are moving to ones further to the right.",
    "Neither should you.\nBrighton is a small town, and I knew the local evangelical scene like it was a second reporting beat.",
    "Then he put up a photograph of Ilhan Omar, the Democratic representative from Minnesota and a Muslim, wearing her hijab.",
    "But then something else happens in the cultureand if you preached on abortion, well, you better preach on voting rights.",
    "And I heard a voice: Return to me, or you will die. \nBolin got a ride to Reno, Nevada, where he had a Christian cousin.",
    "The Church is becoming radicalizedand pastors who dont address this fact head-on are only contributing to the problem.",
    "Yet a strictly apolitical approach can be counterproductive; their unwillingness to engage only invites more scrutiny.",
    "More than a few times, Ive heard casual talk of civil war inside places that purport to worship the Prince of Peace.",
    "Brown committed himself not just to the dogma of the religious right, but to the precepts of political conservatism.",
    "Aside from preaching against abortionan issue Brown sees as inherently biblicalhe kept politics out of his sermons.",
    "felt, had minimized the concerns of peoplelike himselfwho worried they would lose their jobs for refusing the shot.",
    "When Jeff and Deidre met with Jenkinson to inform him that they were leaving the Milford church, tensions ran high.",
    "That makes it easy for evangelicals to dismiss Global Vision as an outlier, the same way they did Westboro Baptist.",
    "Its much harder to scrutinize the extremism that has infiltrated their own church and ponder its logical end point.",
    "But his entire rationale rests on the belief that Jesus long ago became a secondary focus for some in the church.",
    "About 90 percent of his Sunday crowd at FloodGate has migrated from other congregations over the past two years.",
    "For many yearswhile getting married, starting a career in technology, having childrenhe remained rooted in both.",
    "As with most of his letters, the apostle was addressing dysfunction and breakage in the community of believers.",
    "This wasnt the same guy who was sold out to this mindset of Well, it all comes back to abortion and the courts.",
    "Brown is grateful that, after 20 years leading Community Bible, he gets lots of latitude from his congregation.",
    "COVID, the whole thing, is the biggest lie perpetrated on humanity that were ever going to see in our lifetime.",
    "It is charging ahead into an era of expansion, with ambitions of becoming southeast Michigans next megachurch.",
    "Deidre saw friends from other congregations, also displaced by shutdowns, posting on Facebook about FloodGate.",
    "I have tried to tell him, Stay in your lane. \nFite said that Brown is losing people with his political agenda.",
    "Clicking through a PowerPoint on the sanctuarys projector screens, Brown showed pictures of well-known faces.",
    "He and his wife, Linda, had friends and family there; one of their daughters still works on the church staff.",
    "But that only validates his approach: Without this intervention, how much worse off might Community Bible be?",
    "It didnt matter that doing so meant, in some cases, walking away from the church theyd attended for decades.",
    "He organized a book-burning event to destroy occult-promoting Harry Potter novels and other books and games.",
    "But the pair were working diligently to keep any trace of those political disagreements out of church life.",
    "Firebrand statements have been part of the pulpit, and part of politics, for as long as weve been a nation.",
    "And there is a long history of both sides exaggeratinglike in a post like that.\nStill, Bolin seems rattled.",
    "Bob cant imagine leaving the place he loves, the place where he and his wife, Valerie, teach Sunday school.",
    "As of the spring of 2020, Jeff and Deidre Myers belonged to Oak Pointe Milford, a suburban-Detroit church.",
    "Pastors used to be the primary influencers in their communities in determining who we elected, Bolin said.",
    "He leaned into plenty of political controversiesincluding Trumps candidacybut his membership stayed flat.",
    "Looking back, its fair to wonder whether thats because he was on the wrong side of that particular issue.",
    "The longer the church remained locked, the more people speculated on who was casting the deciding votes.",
    "Christianity has traditionally been seen as a stabilizing, even moderating, influence on American life.",
    "I do make a separation between our religious perspective and our political perspective, Bolin tells me.",
    "This article appears in the June 2022 print edition with the headline How Politics Poisoned the Church.",
    "The pastor is pushing harder than ever, and he feels, for the first time, that momentum is on his side.",
    "I need to do better explaining why Im dropping these comments in such a volatile cultural environment.",
    "First, Bingham simply does not believe that pastors should contaminate the Gospel with political talk.",
    "A few were devotees of Alex Jones, the internet-radio host famous for his hateful conspiracy theories.",
    "Before I turn to the Word, the preacher announces, Im gonna do another diatribe.\nGo on! one man yells.",
    "FloodGates attendance soared as members of other congregations defected to the small roadside church.",
    "Every time I heard Bolin preach, I could also hear Brown, the pastors voices dueling inside my brain.",
    "Donald Trump was the last person I wanted elected president, Bolin said, letting go of a belly laugh.",
    "Ive just decided Im not touching any of it.\nBingham has been a pastor in the UMC for nearly 25 years.",
    "But I get letters from preachers all the time: Oh, Brother Locke, you just need to take a chill pill.",
    "Which is fittingbecause whats happening at Global Vision can feel less like a revival than a circus.",
    "And, far from feeling misplaced, these conversations draw legitimacy from a sense of divine justice.",
    "The more he studied scripture, the less confident he felt in the people hed listened to for so long.",
    "Like so many evangelicals, the pastor viewed Clinton as the manifestation of Americas moral decline.",
    "There was this sense that America is under siege, that the barbarians were at the gates, Brown said.",
    "George W. Bush, whom evangelicals claimed as one of their own, was popular with Browns congregants.",
    "Then and now.\nMuch like Pastor Brown, Bolin married conservative theology to conservative ideology.",
    "It occurs to me, while he discusses these potential changes, that no church is guaranteed anything.",
    "Or maybe hell cut the political headlines in half, adding some feel good news to balance the mood.",
    "His choice came down to abortion, he explained, and the Supreme Court appointments in the balance.",
    "I started to realize that a lot of these religious-right guys werent actually trained theologians.",
    "But Im telling you, there is a serious effort to turn this two countries talk into something real.",
    "I was a card-carrying memberliterally, a card-carrying memberof the Moral Majority, Brown told me.",
    "Because of this, the pastor told me, he can no longer justify a passive approach from the pulpit.",
    "Evangelical leaders set something in motion decades ago that pastors today can no longer control.",
    "In a sense, Christians have always lived a different epistemological existence than nonbelievers.",
    "In a sense, Christians have always lived a different epistemological existence than nonbelievers.",
    "Sitting inside a cramped office at the back of FloodGate, Bill Bolin is second-guessing himself.",
    "The video has collected 18 million views, and it launched Locke as a distinct evangelical brand.",
    "One Sunday, Furkas came back to Community Bible and noticed something different about the place.",
    "I lifted it upand remember, Im a supernaturalistand felt like my arm was on fire, Bolin told me.",
    "The battle lines have been drawn, Bolin told me, sitting in the back of his darkened sanctuary.",
    "The whisper campaigns brand conservative pastors as moderate, and moderate pastors as Marxists.",
    "When Brown felt called to join the clergy, he enrolled at Detroit Baptist Theological Seminary.",
    "There are still holdouts, Brown said, people whod prefer the church to go in another direction.",
    "From there, the fusion of new Republican orthodoxy with old conservative theology is seamless.",
    "He also resented the fact that Brown had written blog posts endorsing COVID vaccines and, B.J.",
    "He thought Trump was a charlatan, a lifelong Democrat who was defrauding conservative voters.",
    "But whats notable about the realignment inside the white evangelical Church is its asymmetry.",
    "Hard data are difficult to come by; churches are not required to disclose attendance figures.",
    "Every last one of them cowards, Ive shamed all of them! The audience leaps to its feet again.",
    "He believes the 2020 election was stolen as part of a demonic plot against Christian America.",
    "You can also have reverence and awe for other thingsreally, anything you put great value on.",
    "Still, the pastor emphasized Trumps personal failings and warned against political idolatry.",
    "I think, in conservative-Christian circles, we place a lot of value on the life weve known.",
    "There were flags on the screens behind the stage, flags on the literature being handed out.",
    "But Brown was growing equally disillusioned with Christian conservatives and their tactics.",
    "But whenever he considers that temptation, Brown says he is reminded of a favorite passage.",
    "Global Vision and FloodGate may be different in degree, but they are not different in kind.",
    "It seemed a dangerous practice for anyone, let alone someone trusted as a teacher of truth.",
    "In the fall of 2016, Ken Brown informed his congregants that he planned to vote for Trump.",
    "There was an altar call, and I went down and got baptized that same afternoon, Bolin said.",
    "Discernmentones basic ability to separate truth from untruthis a core biblical discipline.",
    "Over the next four years, the pastor watched as many of his people became MAGA disciples.",
    "According to Jeff and Deidre, they were just two members in a stampede out of Oak Pointe.",
    "Hes searching for a successor and hopes in a few years to transition into a support role.",
    "Ten years ago, Global Vision would have been dismissed as a blip on Christianitys radar.",
    "It took a pandemic, and the temporary closing of their churches, for them to sever ties.",
    "People were beginning to confront him with questions and concerns he couldnt comprehend.",
    "Honestly, Im more concerned than I was a year agoand thats saying something, Moore said.",
    "And I remember telling them, The harder thing to do is what Im doing,  the pastor says.",
    "A minute later, the pastor was boasting about how far hed taken his insults of Whitmer.",
    "Brown leads his own ministry, Community Bible Church, in the Detroit suburb of Trenton.",
    "As word got around the conservative suburbs of Detroit, Bolin became a minor celebrity.",
    "How you gain people is, you pick a tribe, raise the flag, and be really loud about it.",
    "I thought I was going to vomit, Deidre told me, recalling her reaction to one episode.",
    "The erosion of confidence in the institution of American Christianity will accelerate.",
    "It would be simpler to spend his final years as a lead pastor sticking to scripture.",
    "She still attends Community Bible; the two have not spoken about the incident since.",
    "Local politicians and activists borrowed his pulpit to promote right-wing interests.",
    "God doesnt bite his fingernails over any of this, he would say around election time.",
    "He was a proud hippie more interested in the occult than in any organized religion.",
    "In particular, his views of abortion and religious freedom were turned upside down.",
    "Modern evangelicalism is defined by a certain fatalism about the nations character.",
    "And all too many Christiansunder the guise of a plandemicare allowing it to happen.",
    "Bingham is proud to say that he hasnt driven anyone away with his political views.",
    "I dont view political statements as being infallible.\nThats putting it generously.",
    "Inside the sanctuary, attendees wore MAGA caps and Second Amendmentrelated shirts.",
    "Almost all of them, he says, came bearing grievances against their former pastors.",
    "In fact, he said hed been engaged in a weeks-long text exchange with Pastor Brown.",
    "There was even a flag on the face mask of the single person I spotted wearing one.",
    "All of them,  Russell Moore, the public theologian at Christianity Today, told me.",
    "Today, Gallup reports, just 37 percent of Americans have confidence in the Church.",
    "Brown hears the grousing that his political commentary takes the focus off Jesus.",
    "Jeff and Deidre pressed Jenkinson on the churchs refusal to engage with politics.",
    "He rolled his eyes at the condescending Christians who criticized Trumps ethics.",
    "Behind them, many hundreds of people jump up and down on a floor of cedar chips.",
    "There is one person Pastor Brown doesnt have to convince of this: Pastor Bolin.",
    "It was there that he began to question the union of his politics and his faith.",
    "A lot of them didnt know what they were talking about, biblically, Brown said.",
    "He cast himself on social media as a lone voice of courage within Christendom.",
    "Heaps of felled oak trees border the property, evidence of hurried expansion.",
    "Maybe hell just read news clips verbatim, he says, without adding commentary.",
    "The fervency is going to die down.\nExcept there will always be something new.",
    "For much of my lifetime, however, American Christians have done the opposite.",
    "One stray remark could split their congregation, or even cost them their job.",
    "Thats the left.\nAn urgencybordering on paniccould be felt inside the Church.",
    "it was apparent that he was wrestling with whether to leave Community Bible.",
    "This isnt my first time at FloodGate, so none of what Bolin says shocks me.",
    "Its a spiritual battle, and we are right at the precipice of it, Tony said.",
    "Some people feel like Im just dropping random anti-Trump bombs, Brown said.",
    "They also know that his deputy, Johannah Myers, is a committed progressive.",
    "We are doing everything we can to hold this place together, Myers told me.",
    "Listening to Locke that morning, I felt a peculiar sort of disappointment.",
    "For a decade, Bolin preached to a crowd of about 100 on a typical Sunday.",
    "The crisis for the Church is a crisis of discernment, he said over lunch.",
    "Then along comes Donald Trump, who says he can make America great again.",
    "Most evangelicals dont think of themselves as Lockes target demographic.",
    "The pastor has suggested that autistic children are oppressed by demons.",
    "He says hes worried about Christians getting their priorities mixed up.",
    "We fix our eyes not on what is seen, but on what is unseen, Paul wrote.",
    "He read the books, watched the videos, listened to the radio programs.",
    "Inside, men wearing earpieces and camouflage pants guard the entrance.",
    "The tent holds 3,000 people and would be the envy of Barnum & Bailey.",
    "Between songs, Schneider offers a different catalog of greatest hits.",
    "I aint never had a prostitute mad at me for keeping this church open!",
    "There will no longer be this massive division over COVID, Bolin says.",
    "The pastor says FloodGates revenue has multiplied sixfold since 2020.",
    "But over time, the discourse inside the church became more worrisome.",
    "They were even friends with the pastor, Paul Jenkinson, and his wife.",
    "And neither had most of the people sitting around me, until recently.",
    "Brown is polished and buttoned-down; Bolin is ostentatious and loud.",
    "A chorus of people responds: Ivermectin. Bolin pretends not to hear.",
    "There was nothing sui generis about the man or this Sunday service.",
    "A quick Google search would have given Bolin the accurate numbers.",
    "The parking lot swarmed with vehicles covered in partisan slogans.",
    "But this was, in many ways, also the beginning of its unraveling.",
    "By Easter 2021, FloodGate was hosting 1,500 people every weekend.",
    "He decries the Christian elites who look down on people like him.",
    "A rutted gravel parking lot climbs high away from the main road.",
    "But this only adds to the urgency of fortifying Community Bible.",
    "But much of the anxiety felt amorphous, crypticand manufactured.",
    "All the while, his congregation hovered right around 100 people.",
    "And the actual work of evangelizing will get much, much harder.",
    "But this is something newand something decidedly nonessential.",
    "He turned out to be the most pro-life president weve ever had.",
    "Ive been going to church with a lot of apprehension, Bob said.",
    "Fear, the pastor says, was taking root inside Community Bible.",
    "Brown wasnt faced with just Obama-centric conspiracy theories.",
    "So I began checking out his sermons, podcasts, and blog posts.",
    "They have 103 vaccine-complication patients. The crowd gasps.",
    "They would rather keep the peace than risk alienating anyone.",
    "And yet, it reflects a phenomenon greater than Trump himself.",
    "Liberals have devised a plot to separate Christians from God.",
    "And this is every weekend! Locke cries in his hickory drawl.",
    "Some people say, Well, you have to preach on abortion. Okay.",
    "But he also cant imagine standing by while Brown pushes B.J.",
    "The narthex was jammed with people scribbling on clipboards.",
    "This was the launch of the groups Livingston County chapter.",
    "He obsessed over the presidents every scandal and deception.",
    "Others fear that speaking up would only make matters worse.",
    "The same thing is happening in America today, Locke warns.",
    "Jenkinson remembers the conversation somewhat differently.",
    "That was the beginning of a new ministry for me, he said.",
    "Short-lived victories, however, came at a long-term cost.",
    "Bolin texted me the following day saying hed deleted it.)",
    "Let me tell you something, Locke says, his voice rising.",
    "Not long ago, Locke was a small-time Tennessee preacher.",
    "It was good for some laughs and lighthearted commentary.",
    "The movement spent 40 years at war with secular America.",
    "He aimed to restore that tradition in his own ministry.",
    "For the next three hours, the church became a coliseum.",
    "It changed who I am.\nThat change included his politics.",
    "I have always been prone to protesting, Bolin told me.",
    "He said, Id lose half my congregation,  Jeff recalled.",
    "Lets be clear: Locke belongs to a category of his own.",
    "An attack on Donald Trump is an attack on Christians.",
    "He rattled off the former presidents accomplishments.",
    "Some posted ugly, combative messages on social media.",
    "The Church is not a victim of Americas civic strife.",
    "Good people were taken in by this stuff, Brown said.",
    "We feel like youve shamed us. \nLocke starts nodding.",
    "Locke said nothing I hadnt heard from other pastors.",
    "Plenty of people there know that hes a conservative.",
    "The hired hand, he says, is no better than the wolf.",
    "God is calling you to do something, Schneider says.",
    "Yet Im still struggling to make sense of the place.",
    "His floral shirt is untucked over dark-blue jeans.",
    "Amen! shouts a woman several pews in front of me.",
    "What was that? he says, leaning over the lectern.",
    "We revere God; we hold him in awe, Brown told me.",
    "We are people of truth. \nThe woman never replied.",
    "Shame, shame, shame! he shouts, wagging a finger.",
    "He talks about the flu shot making someone sick.",
    "Almost everyone is concerned about job security.",
    "Biblically, fear is primarily reverence and awe.",
    "Yet most had never considered looking elsewhere.",
    "But in church, theres supposed to be one truth.",
    "But none of the other congregations felt right.",
    "And then, in March 2020, everything fell apart.",
    "A sign reads This Is A MASK FREE Church Campus.",
    "The caricature of evangelicals will get uglier.",
    "They were just trying to keep everybody happy.",
    "And she sent me this fake, Photoshopped thing.",
    "Instead, it is one of the principal catalysts.",
    "This time, they shout: Ivermectin! Bolin nods.",
    "It was a period of harmony inside the church.",
    "I didnt see a single person carrying a Bible.",
    "The table had been set by Bill Bolin himself.",
    "Around that time, George Floyd was murdered.",
    "Did Jesus come for her? The room was silent.",
    "It didnt take long to debunk, Brown told me.",
    "At one point, Bolin looks up from his notes.",
    "At the summit stands an enormous white tent.",
    "Theres no way around that, Bingham told me.",
    "He didnt have time to worry about politics.",
    "Because Christians cannot foment falsehood.",
    "But Id never seen anything quite like this.",
    "I love the evolution from Ken, Furkas said.",
    "Some people left the church; others joined.",
    "He would have his own flock to look after.",
    "It was time to visit the furthest fringes.",
    "Thats not a risk he seems willing to take.",
    "He hints at a potential violent uprising.",
    "Brown demanded to know the womans source.",
    "The apocalypse, Brown recalled, laughing.",
    "But I did see American flagslots of them.",
    "But it was a watershed moment for Brown.",
    "Were now going from pandemic to endemic.",
    "Churches are breaking apart everywhere.",
    "The evangelical Church is no exception.",
    "Meanwhile, other pastors feel trapped.",
    "Visibly shaken, she refused to answer.",
    "Thats how you gain a bunch of numbers.",
    "The truth is coming out, Tony told me.",
    "Schneider has come to speak and sing.",
    "I dont, Bolin says, shaking his head.",
    "The crowd answers with more applause.",
    "And honestly, hes making me nervous.",
    "We are born for such a time as this.",
    "Whats coming is going to be brutal.",
    "The answer, I suspect, is very few.",
    "Things like sanctity and salvation?",
    "But what is left to hold together?",
    "Not on a single issue, he told me.",
    "The church left us, Tony told me.",
    "It was time to go see Greg Locke.",
    "He knows they have their reasons.",
    "She spent a year shopping around.",
    "It may sound like Chicken Little.",
    "Looking back, he understands why.",
    "But over time, there was a shift.",
    "Which brings us to Donald Trump.",
    "He understands their reluctance.",
    "The same went for their members.",
    "This is about good against evil.",
    "God isnt biting his fingernails.",
    "Losing was no longer an option.",
    "The earthly life we have known.",
    "He proved me wrong, Bolin said.",
    "I had never heard of FloodGate.",
    "How about this one? Bolin says.",
    "Two. Bolin pauses dramatically.",
    "We have a country to get back.",
    "But strange compared to what?",
    "They went to church together.",
    "His confidence was misplaced.",
    "They were glued to Fox News.",
    "What about her? Brown asked.",
    "This is how you lose people.",
    "One of those people is B.J.",
    "Now its at war with itself.",
    "On the vaccines  he begins.",
    "Thats the world we live in.",
    "Some dont know what to say.",
    "(The post was still active.",
    "But this is something new.",
    "We didnt leave the church.",
    "Scores of people stand up.",
    "He made a compelling case.",
    "They had found a new home.",
    "Ive never been the same.",
    "Our culture will change.",
    "One thing didnt change.",
    "Jeff was equally moved.",
    "That is so easy to do.",
    "It was Ken, she said.",
    "But I understand why.",
    "But nothing changed.",
    "How did this happen?",
    "Thats Barack Obama.",
    "And then COVID hit.",
    "Bolin changed that.",
    "He has two reasons.",
    "Its heartbreaking.",
    "They arent alone.",
    "He had changed.",
    "When I met B.J.",
    "But FloodGate?",
    "Or gun rights.",
    "Or immigrants.",
    "I really dont.",
    "But I sure am.",
    "Not too much.",
    "out the door.",
    "FiteBobs son.",
    "It was 1981.",
    "told me.",
    "I have!",
    "B.J.",
    "B.J.",
    "No."
  ]
}