{
  "id": 84,
  "mediaId": 43,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "Ten House Republicans voted to impeach Trump. Some then fell silent while others spoke up",
  "image": "https://images.dailykos.com/images/1023899/story_image/GettyImages-13309322621.jpg?1641423957",
  "link": "https://www.dailykos.com/story/2022/1/5/2072913/-10-House-Republicans-voted-to-impeach-Trump-Some-fell-silent-while-others-spoke-up",
  "sentiment": "-0.463",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1901,
    2005,
    2010,
    2125,
    2214,
    3094,
    255,
    428,
    562
  ],
  "sentences": [
    "And right now, there are far too many Republicans who are trying to enable the former president, embrace the former president, look the other way and hope that the former president goes away.?\nDaily Kos needs your help\n Daily Kos is the country's largest progressive, independent news outlet.",
    "So far, Trump has endorsed primary opponents for at least five of them, including Gonzalez (who's retiring), Reps. Liz Cheney of Wyoming, Jaime Herrera Beutler of Washington, and Peter Meijer and Fred Upton of Michigan, who serve neighboring districts on the west side of the state.",
    "I think that's proven overly optimistic.?\nFour of them, according to the Times, have fallen unmistakably silent, including Reps. John Katko of New York, Dan Newhouse of Washington, Tom Rice of South Carolina, and David Valadao of California.",
    "Of the 10 House Republicans who voted to impeach Trump, some have decided not to run for reelection, others have grown outspokenly defiant, and still others are laying low in hopes the storm will blow over by the time November rolls around.",
    "I've never seen anything like this before.?\nMeijer, a freshman congressman, thinks that if anyone miscalculated, it's the GOP members who believed the party was moving beyond Trump when they took the easy way out and gave him a pass.",
    "Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL) participate in a hearing of the House Select Committee investigating the Jan. 6 attack on the U.S. Capitol on July 27, 2021 at the Cannon House Office Building in Washington, D.C.",
    "Many political journalists seem to believe those Republicans made the wrong political bet in a moment when it appeared Republican leadership might actually be up to the task of breaking with Trump.",
    "And it's surely no secret at this point that two of them have doubled down, serving on the House select committee investigating Jan. 6 while making it their mission to reclaim the party from Trump.",
    "In the wake of the Jan. 6 attack on the Capitol that Donald Trump both inspired and declined to stop, 10 House Republicans chose to cast their votes to impeach the GOP commander in chief.",
    "For some, that may be true, but many in the small cadre likely took a vote of conscience and concluded they couldn't look at the themselves in the mirror if they had done otherwise.",
    "\"The 2020 election was not stolen,? Rep. Adam Kinzinger of Illinois said in a video message Wednesday marking the anniversary of Jan. 6. Joe Biden won, and Donald Trump lost.",
    "Though Michigan's redistricting has left Upton's GOP challengers in flux, the 35-year House veteran doesn't appear to be relishing the current environment on the Hill.",
    "And finally there's Cheney, who has been the least squeamish of all of them about laying the current threat plaguing the country at the feet of Republicans alone.",
    "They lied to the American people and continue to push the big lie and echo the conspiracy theories that line their pockets, keeping them in power.\"",
    "Kinzinger, who was redistricted out of a seat, included a link to country1st.com, a new PAC with the stated mission to \"Defeat Toxic Tribalism.\"",
    "\"I don't believe he can ever be president again,? Gonzalez said in a September interview announcing he would not seek reelection.",
    "A recent New York Times article suggested the group made a \"fundamental miscalculation about the direction of their party.\"",
    "One of them, former rising GOP star Rep. Anthony Gonzalez of Ohio, called Jan. 6 a \"line-in-the-sand moment.\"",
    "But it's fair to say everyone in the small clique has trod an unusually thorny path over the past year.",
    "The view among some was that this would be essentially a self-correcting issue,? Meijer said of Trump.",
    "We can either be loyal to Donald Trump, or we can be loyal to the Constitution, but we cannot be both.",
    "The tone gets, you know, tougher and tougher, and it's a pretty toxic place,? he told CNN last month.",
    "Our biggest source of income is small donations from hundreds of thousands of readers like you.",
    "Most of my political energy will be spent working on that exact goal.\"",
    "You've got metal detectors now going on the House floor.",
    "We don't have billionaire backers or corporate sponsors.",
    "Can you support our work by donating $3 right now?",
    "But the leadership of the Republican Party won't.",
    "Our party has to choose,? Cheney told the Times.",
    "We get really nasty threats at home.",
    "Donate $3\nDonate $5 monthly",
    "We have to admit it."
  ]
}