[
  {
    "id": 3571,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "ROB PORTMAN have spent $10 million each: MATT DOLAN, a state senator and part owner of the Cleveland Guardians baseball team, and investment banker <span class='selected-term'>MIKE GIBBONS</span>.",
    "author": "",
    "title": "POLITICO Playbook: Biden confronts major troop decision"
  },
  {
    "id": 2830,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "One candidate, <span class='selected-term'>Mike Gibbons</span>, has already spent $10 million on an ad campaign that will run through the state’s early May primary.",
    "author": "Chris Cillizza",
    "title": "More than $100 million in ads has *already* been spent on just 5 Senate races"
  },
  {
    "id": 3461,
    "mediaId": 8465,
    "date": "2022-01-31",
    "sentence": "The Van Wert County Republican Central Committee will welcome U.S. Senate candidate <span class='selected-term'>Mike Gibbons</span> to a “Meet and Greet” at 7 p.m. Thursday, February 3, at Wild Hare BBQ in Van Wert.",
    "author": "",
    "title": "U.S. Senate candidate to visit Van Wert"
  },
  {
    "id": 1959,
    "mediaId": 2641,
    "date": "2022-02-04",
    "sentence": "Sen. Rand Paul, R-Ky., a vocal critic of Fauci, recently released an ad endorsing Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> in a video noting his support for firing the nation's top expert on infectious disease.",
    "author": "Theodore Bunker",
    "title": "GOP Campaign Ads Vilify Fauci: 'Freedom Over Flip-Flops'"
  },
  {
    "id": 2475,
    "mediaId": 2562,
    "date": "2022-02-04",
    "sentence": "Sen. Rand Paul, R-Ky., a vocal critic of Fauci, recently released an ad endorsing Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> in a video noting his support for firing the nation's top expert on infectious disease.",
    "author": "NationalWatch",
    "title": "GOP Campaign Ads Vilify Fauci: ‘Freedom Over Flip-Flops’"
  },
  {
    "id": 2528,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "“I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nIn enlisting Paul to pad his anti-vaccine mandate credentials, Gibbons chose a top Fauci nemesis to make his point.",
    "author": "",
    "title": "Fauci might as well be running for office"
  },
  {
    "id": 2607,
    "mediaId": 2512,
    "date": "2022-02-04",
    "sentence": "I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nOz’s ad, meanwhile, finds him saying, “The big government medical establishment came after me because I dared to challenge Fauci on COVID.”\nIt's past time Fauci faces the fact that he got COVID wrong.",
    "author": "Alex Henderson",
    "title": "Republicans once praised Anthony Fauci for saving lives -- and now he’s the boogieman of MAGA attack ads"
  },
  {
    "id": 2337,
    "mediaId": 2629,
    "date": "2022-02-04",
    "sentence": "I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nOz’s ad, meanwhile, finds him saying, “The big government medical establishment came after me because I dared to challenge Fauci on COVID.”\n“Anthony Fauci has been a GOP target for nearly two years, as the party cast the president’s chief medical adviser as a villain for pandemic-era policies,” Murray explains.",
    "author": "Alex Henderson",
    "title": "Praised By Republican Presidents, Fauci Is Now Target Of GOP Attack Ads"
  },
  {
    "id": 2479,
    "mediaId": 8373,
    "date": "2022-02-10",
    "sentence": "INFORMATION SIDEBAR:\nHere’s a brief resume of <span class='selected-term'>Mike Gibbons</span>, Ohio U.S. Senate candidate:\nEDUCATION: Played football at St. Ignatius High School in Cleveland; earned degrees from Kenyon College, Case Western Reserve University and the Cleveland-Marshall College of Law.",
    "author": "Bob Pepalis",
    "title": "Gibbons tells Knox Republican Women, 'We're in uncharted territory'"
  },
  {
    "id": 1439,
    "mediaId": 2540,
    "date": "2022-02-15",
    "sentence": "“I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nGeorgia GOP Rep. Marjorie Taylor Greene and others have been pushing for Fauci to be fired for months.",
    "author": "Chris Cillizza",
    "title": "2021: The year scientists became a political football"
  },
  {
    "id": 274,
    "mediaId": 2618,
    "date": "2022-02-21",
    "sentence": "Ohio’s crowded Republican Senate primary is still 2 1/2 months away, but one candidate has made gains in recent weeks: businessman <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Kate Scanlon",
    "title": "Mike Gibbons takes lead in Republican race for Ohio seat"
  },
  {
    "id": 360,
    "mediaId": 8358,
    "date": "2022-02-24",
    "sentence": "",
    "author": "",
    "title": "Mike Gibbons: Putin’s invasion of Ukraine is because of the weakness of the Biden Administration"
  },
  {
    "id": 165,
    "mediaId": 2537,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Mike Gibbons",
    "title": "Opinion: Financial crisis looming for working class as inflation hits record high"
  },
  {
    "id": 17403,
    "mediaId": 8390,
    "date": "2022-02-28",
    "sentence": "Ohio Senate candidate <span class='selected-term'>Mike Gibbons</span> leads the GOP primary field in the Buckeye State, according to new polling from The Hill/Emerson College released Monday.",
    "author": "",
    "title": "Gibbons leads Ohio GOP Senate primary: poll"
  },
  {
    "id": 17623,
    "mediaId": 8473,
    "date": "2022-03-01",
    "sentence": "Besides <span class='selected-term'>Mike Gibbons</span>, an investment banker who unsuccessfully ran for a Senate seat in 2018, Dolan has given more of his own money to his campaign than any other candidate in this race.",
    "author": "David Skolnick",
    "title": "Dolan: Biden may bear some responsibility for Russia’s invasion of Ukraine"
  },
  {
    "id": 11575,
    "mediaId": 2668,
    "date": "2022-03-09",
    "sentence": "At CPAC a couple of weeks ago, I had the opportunity to interview Ohio US Senate Candidate <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Scott Hounsell",
    "title": "CPAC Interview: Ohio Senate Candidate Mike Gibbons"
  },
  {
    "id": 14012,
    "mediaId": 8390,
    "date": "2022-03-15",
    "sentence": "Ohio investment banker <span class='selected-term'>Mike Gibbons</span> has shot to the top of the polls in the state’s Senate GOP field in recent weeks ahead of what is expected to be a bloody final sprint to the May 3 primary.",
    "author": "",
    "title": "Gibbons rises as Ohio's Senate GOP primary nears end"
  },
  {
    "id": 10831,
    "mediaId": 2687,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Ohio Republican Spoke Offensively About Asians"
  },
  {
    "id": 11570,
    "mediaId": 2742,
    "date": "2022-03-17",
    "sentence": "Earlier(2014) : Charles Murray on the 20th Anniversary of \"The Bell Curve\"\nFrom the New York Times news section:\n<span class='selected-term'>Mike Gibbons</span>, a leading contender to succeed Senator Rob Portman, made the comments in a 2013 podcast on doing business in China.",
    "author": "Steve Sailer",
    "title": "NYT: Shocking Revelation: A GOP Candidate Has Read THE BELL CURVE"
  },
  {
    "id": 11321,
    "mediaId": 2570,
    "date": "2022-03-18",
    "sentence": "“The Totally Dodgy Backstory of the Bank that Just Refinanced Trump Tower” (Rolling Stone)\n“Saudi-Backed Golf League Plans Tournament at Trump’s New Jersey Course” (Mother Jones)\n“Critics accuse CPAC of becoming pay-to-play as Trump loyalists gain power” (The Guardian)\n“Ohio Senate hopeful <span class='selected-term'>Mike Gibbons</span> is latest to score Trump meeting at Mar-a-Lago” (NBC News)\n“Democratic group complains Trump funding presidential campaign illegally” (Reuters)\nEditor’s Picks\n“U.S.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: NRA Campaign Filing Confirms Ransomware Attack"
  },
  {
    "id": 14028,
    "mediaId": 8283,
    "date": "2022-03-20",
    "sentence": "There are many candidates to pick from in this year’s primary, but <span class='selected-term'>Mike Gibbons</span> is the only one who is legitimately concerned about the value of the U.S. dollar disappearing and has the experience and knowledge to fix this mess.",
    "author": "Chillicothe Gazette",
    "title": "Letters to the Editor"
  },
  {
    "id": 12329,
    "mediaId": 8390,
    "date": "2022-03-23",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Mike Gibbons</span> on Wednesday rolled out an ad touting his own business experience as the race for the GOP nomination in the state turns ugly.",
    "author": "",
    "title": "Gibbons rolls out ad touting business experience as Ohio Senate primary turns ugly"
  },
  {
    "id": 8924,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Neil Munro",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 8917,
    "mediaId": 2573,
    "date": "2022-03-23",
    "sentence": "Cleveland businessman and leading Republican Senate candidate <span class='selected-term'>Mike Gibbons</span> joins FOX News Radio's Jessica Rosenthal to discuss past controversial comments, specifically about people of Asian descent, and more on \"The Fox News Rundown.\"",
    "author": "Fox News Staff",
    "title": "The New York Times hates any conservative: GOP Ohio Senate candidate"
  },
  {
    "id": 9128,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Continue reading …\nNYT BLASTED – Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> lashed out at The New York Times saying the paper \"hates any conservative.\"",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker resign; The spies among us -- one former spy speaks out"
  },
  {
    "id": 9387,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Blarp Blog",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 8992,
    "mediaId": 2584,
    "date": "2022-03-25",
    "sentence": "If the pandemic hadn’t happened, New Zealand’s tourism industry and its effects “would still be on a fast track to destruction”, says <span class='selected-term'>Mike Gibbons</span>, the village’s general manager.",
    "author": "Eva Corlett",
    "title": "Maori village nestled among hot springs reckoning with the return of foreign tourists"
  },
  {
    "id": 8972,
    "mediaId": 2636,
    "date": "2022-03-28",
    "sentence": "In Ohio, <span class='selected-term'>Mike Gibbons</span>, a businessman who is leading the Senate Republican primary in some polls, is fending off allegations that he once favored outsourcing jobs to China.",
    "author": "",
    "title": "Marco Rubio Leads G.O.P. Push for a More Combative Stance on China"
  },
  {
    "id": 7267,
    "mediaId": 2660,
    "date": "2022-04-04",
    "sentence": "At a recent debate, businessman <span class='selected-term'>Mike Gibbons</span>, a top contender, repeated a favored talking point.",
    "author": "Jon Greenberg",
    "title": "In Ohio, GOP candidate falsely says more votes than registered voters in 2020 election"
  },
  {
    "id": 7553,
    "mediaId": 2699,
    "date": "2022-04-05",
    "sentence": "And while Scott’s proposal to make all Americans pay some federal income tax—to have some, in his words, “skin in the game”—was denounced by many Republicans, at least one leading candidate, <span class='selected-term'>Mike Gibbons</span> of Ohio, had already taken up that same mantle.",
    "author": "Sam Brodey",
    "title": "GOP Candidates Can’t Stop Touching the Third Rail of Politics"
  },
  {
    "id": 8644,
    "mediaId": 2517,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "One more step"
  },
  {
    "id": 7479,
    "mediaId": 2630,
    "date": "2022-04-06",
    "sentence": "Local chapters recently hosted events for Republican candidates such as <span class='selected-term'>Mike Gibbons</span> in Ohio’s Senate race and Garrett Soldano in Michigan’s governor’s contest to speak to its members.",
    "author": "",
    "title": "From schools to statehouses, conservative Moms for Liberty push to grow influence"
  },
  {
    "id": 8446,
    "mediaId": 8497,
    "date": "2022-04-06",
    "sentence": "\"We need to start concentrating on education,\" said Cleveland businessman <span class='selected-term'>Mike Gibbons</span> at Miami University last night.",
    "author": "John London",
    "title": "Ohio lawmakers propose bill similar to one in Florida dubbed the 'Don't Say Gay' bill"
  },
  {
    "id": 8295,
    "mediaId": 8491,
    "date": "2022-04-08",
    "sentence": "COLUMBUS, Ohio (AP) — <span class='selected-term'>Mike Gibbons</span>, a leading Republican Senate candidate from Ohio, said at a media event last fall that middle-class Americans don’t pay “any kind of a fair share” of income taxes.",
    "author": "JULIE CARR SMYTH Associated Press",
    "title": "OH GOP Senate hopeful: Middle class doesn’t pay fair share"
  },
  {
    "id": 7347,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "On Friday, The Washington Post reported that newly unearthed footage from a media event last fall shows <span class='selected-term'>Mike Gibbons</span>, a candidate for the Republican Senate nomination in Ohio, complained that the middle class does not pay enough in taxes.",
    "author": "Matthew Chapman",
    "title": "GOP banker spends $11 million on his campaign — and whines the middle class don’t pay enough taxes: report"
  },
  {
    "id": 7604,
    "mediaId": 2687,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "GOP Candidate Said Middle Class Doesn’t Pay ‘Fair Share’"
  },
  {
    "id": 7764,
    "mediaId": 3997,
    "date": "2022-04-09",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 7425,
    "mediaId": 2695,
    "date": "2022-04-09",
    "sentence": "A spokesperson for Gibbons's campaign told TheBlaze that \"<span class='selected-term'>Mike Gibbons</span> does not support tax increases on any Americans – and never has.\"",
    "author": "Samuel Mangold-Lenett",
    "title": "Ohio Senate candidate Mike Gibbons says middle-class Americans don't pay 'any kind of fair share' of income taxes"
  },
  {
    "id": 5639,
    "mediaId": 2627,
    "date": "2022-04-12",
    "sentence": "Senate hopeful <span class='selected-term'>Mike Gibbons</span> — by some measures, the frontrunner in Ohio’s GOP primary — pledged yesterday that he will not support new taxes if elected.",
    "author": "Steve Benen",
    "title": "Ohio Republican: Middle class doesn’t pay ‘fair share’ in taxes"
  },
  {
    "id": 5311,
    "mediaId": 2550,
    "date": "2022-04-12",
    "sentence": "x\nOhio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> on a Crain’s Cleveland Business podcast:\n“The top 20% of earners in the U.S. pay 82% of federal income tax — and, you do the math, and 45% to 50% don’t pay any income tax… The middle class is not really paying any kind of a fair share.” pic.twitter.com/VUYzPTlqmX\n— Heartland Signal (@HeartlandSignal) April 8, 2022\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Ohio GOP Senate hopeful: Middle class isn't paying its fair share"
  },
  {
    "id": 5824,
    "mediaId": 2731,
    "date": "2022-04-14",
    "sentence": "Maybe he'll decide to pass over JD Vance in the #OHSEN race for that knucklehead \"businessman\" <span class='selected-term'>Mike Gibbons</span>, who decided the big problem in America today is that the middle class is not paying enough in taxes.",
    "author": "Kurt Schlichter",
    "title": "If You Like Donald Trump Then You Want a Real Primary"
  },
  {
    "id": 5563,
    "mediaId": 2562,
    "date": "2022-04-16",
    "sentence": "",
    "author": "NationalWatch",
    "title": "Mike Gibbons to Newsmax: Trump’s Vance Endorsement ‘Above My Pay Grade’"
  }
]