[
  {
    "id": 2830,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "One candidate, <span class='selected-term'>Mike Gibbons</span>, has already spent $10 million on an ad campaign that will run through the state’s early May primary.",
    "author": "Chris Cillizza",
    "title": "More than $100 million in ads has *already* been spent on just 5 Senate races"
  },
  {
    "id": 274,
    "mediaId": 2618,
    "date": "2022-02-21",
    "sentence": "Ohio’s crowded Republican Senate primary is still 2 1/2 months away, but one candidate has made gains in recent weeks: businessman <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Kate Scanlon",
    "title": "Mike Gibbons takes lead in Republican race for Ohio seat"
  },
  {
    "id": 11575,
    "mediaId": 2668,
    "date": "2022-03-09",
    "sentence": "At CPAC a couple of weeks ago, I had the opportunity to interview Ohio US Senate Candidate <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Scott Hounsell",
    "title": "CPAC Interview: Ohio Senate Candidate Mike Gibbons"
  },
  {
    "id": 12329,
    "mediaId": 8390,
    "date": "2022-03-23",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Mike Gibbons</span> on Wednesday rolled out an ad touting his own business experience as the race for the GOP nomination in the state turns ugly.",
    "author": "",
    "title": "Gibbons rolls out ad touting business experience as Ohio Senate primary turns ugly"
  },
  {
    "id": 7425,
    "mediaId": 2695,
    "date": "2022-04-09",
    "sentence": "A spokesperson for Gibbons's campaign told TheBlaze that \"<span class='selected-term'>Mike Gibbons</span> does not support tax increases on any Americans – and never has.\"",
    "author": "Samuel Mangold-Lenett",
    "title": "Ohio Senate candidate Mike Gibbons says middle-class Americans don't pay 'any kind of fair share' of income taxes"
  },
  {
    "id": 5311,
    "mediaId": 2550,
    "date": "2022-04-12",
    "sentence": "x\nOhio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> on a Crain’s Cleveland Business podcast:\n“The top 20% of earners in the U.S. pay 82% of federal income tax — and, you do the math, and 45% to 50% don’t pay any income tax… The middle class is not really paying any kind of a fair share.” pic.twitter.com/VUYzPTlqmX\n— Heartland Signal (@HeartlandSignal) April 8, 2022\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Ohio GOP Senate hopeful: Middle class isn't paying its fair share"
  },
  {
    "id": 5639,
    "mediaId": 2627,
    "date": "2022-04-12",
    "sentence": "Senate hopeful <span class='selected-term'>Mike Gibbons</span> — by some measures, the frontrunner in Ohio’s GOP primary — pledged yesterday that he will not support new taxes if elected.",
    "author": "Steve Benen",
    "title": "Ohio Republican: Middle class doesn’t pay ‘fair share’ in taxes"
  }
]