[
  {
    "id": 6474,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "Bringing along names like <span class='selected-term'>Kari Lake</span> and Mike Lindell to warm up the crowd, Trump didn’t hold back when it came time for him to speak, bashing President Joe Biden’s leadership when it came to the Southern border, the Capitol Hill January 6 incident, and COVID-19.",
    "author": "Red Voice Media",
    "title": "Trump Rails Biden’s ‘Ridiculous Unscientific’ Big Pharma Mandates And Dem Race-Based COVID Treatments [VIDEOS]"
  },
  {
    "id": 6442,
    "mediaId": 2614,
    "date": "2022-01-17",
    "sentence": "While Trump has endorsed Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> in Arizona, he has yet to issue an endorsement in the state’s Senate primary.",
    "author": "RobManess.com",
    "title": "Trump Eviscerates Biden For Being ‘Incompetent’ – Predicts ‘Red Wave’ Is Coming"
  },
  {
    "id": 6457,
    "mediaId": 2590,
    "date": "2022-01-17",
    "sentence": "“You could tell it wasn’t Trump,” Protzman said in a live chat excerpted below, referring to a moment where the former president invited Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to the stage.",
    "author": "David Moye",
    "title": "Some QAnon Believers Think JFK Disguised Himself As Trump At Arizona Rally"
  },
  {
    "id": 6837,
    "mediaId": 2614,
    "date": "2022-01-18",
    "sentence": "ARIZONA – Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span>, who became a rising star in the conservative movement in Arizona after spending over two decades in broadcast journalism within the state, recently proposed forming an interstate compact in effort to combat illegal immigration stemming from the southern border.",
    "author": "Red Voice Media",
    "title": "AZ Gubernatorial Candidate Kari Lake Proposes Interstate Compact To Combat Illegal Immigration"
  },
  {
    "id": 7132,
    "mediaId": 2818,
    "date": "2022-01-19",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> has a day one plan if she’s elected.",
    "author": "The First",
    "title": "‘DAY ONE, I’LL CLOSE THE BORDER’: Candidate for AZ Governor Says She Will Issue a ‘Declaration of Invasion’"
  },
  {
    "id": 6586,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona GOP Candidate <span class='selected-term'>Kari Lake</span> on OAN: Biden “Couldn’t Even Attract the Number of People at the Port-o-Johns” at a Trump Rally (VIDEO)\nPart of the border in Yuma, Arizona, doesn’t even have a barrier, and illegal immigrants walk into our country and surrender.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona Gubernatorial Candidate Kari Lake: “DAY ONE – We Will Issue A Declaration Of Invasion”, Plans An Interstate Compact To Secure Southern Border"
  },
  {
    "id": 6492,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Anti-vaxxer <span class='selected-term'>Kari Lake</span>, who appears to the frontrunner in Arizona’s 2022 GOP gubernatorial primary, is right out of the Marjorie Taylor Greene/Lauren Boebert school of MAGA lunacy.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 6834,
    "mediaId": 2642,
    "date": "2022-01-22",
    "sentence": "Arizona must follow suit and protect ALL workers from losing their job for not taking the shot pic.twitter.com/z1jdHqJFXB\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) January 21, 2022\nThis case was about whether the president may “force millions of federal workers to undergo a medical treatment as a condition of their employment” simply by signing an executive order, according to Brown’s decision.",
    "author": "Wayne Dupree",
    "title": "Biden’s Proposed Federal Mandate For Federal Workers Dealt Another Blow By Trump-Appointed Federal Judge!!"
  },
  {
    "id": 6429,
    "mediaId": 2578,
    "date": "2022-01-22",
    "sentence": "EXCLUSIVE: Woke ASU ‘Pandemic Horror’ Professor Dr. Michael Stancliff Calls Trump Racist For Saying COVID-19 Escaped From Chinese Lab – “There Is NO PROOF Of This, Of Course”\nArizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> calls for the loss of funding and new leadership at Arizona State University.",
    "author": "Jordan Conradson",
    "title": "WOKE Arizona State University President Michael Crow Surrenders To Cancel Culture – Cancels Conservative Event Featuring Congressman Andy Biggs"
  },
  {
    "id": 6943,
    "mediaId": 2530,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Sarah Mimms",
    "title": "Trump Supporters Believe Wisconsin Withdrew Its Electoral College Voters For Joe Biden. It Never Happened."
  },
  {
    "id": 6803,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "Schmidt, who has been kicked off most social media platforms for COVID-19 disinformation, has appeared at the events of far-right election conspiracy theorist and Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Matthew Chapman",
    "title": "Notorious Trump supporter banned from the Arizona House after he films himself harassing lawmakers"
  },
  {
    "id": 6426,
    "mediaId": 2512,
    "date": "2022-02-01",
    "sentence": "If candidates like <span class='selected-term'>Kari Lake</span> in Arizona and David Perdue in Georgia are successful, it would give them final say over whether to certify a slate of electors for a presidential candidate.”\nPanetta adds, “Such trends raise the risk of a disputed or possibly stolen election in the 2022 midterms.",
    "author": "Alex Henderson",
    "title": "Here’s how 'rogue' GOP governors could steal the 2024 election for Trump — and cause a 'constitutional tailspin'"
  },
  {
    "id": 6286,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was recently interviewed by an ABC rookie journalist.",
    "author": "",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 5554,
    "mediaId": 2662,
    "date": "2022-02-03",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n<span class='selected-term'>Kari Lake</span>: Well he’s obviously sitting in the White House.",
    "author": "Jim Hoft",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 5652,
    "mediaId": 2557,
    "date": "2022-02-04",
    "sentence": "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "WATCH: GOP governor candidate turns tables on reporter regarding 2020"
  },
  {
    "id": 5848,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> recently suggested that Joe Biden join Rogan’s fact-based show to argue his stance.",
    "author": "Jordan Conradson",
    "title": "Arizona Gubernatorial Candidate Kari Lake: “If I Knew That Joe Biden Could Carry A Coherent Conversation, I’d Suggest He Go On Rogan”"
  },
  {
    "id": 5900,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 5525,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> called for perp walks after seeing this video.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE – ELECTION FRAUD ON VIDEO: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server Before Delivery To Auditors"
  },
  {
    "id": 6163,
    "mediaId": 2599,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Stephen Green",
    "title": "All Republican Candidates Must Learn a Lesson From Arizona Gubernatorial Hopeful Kari Lake."
  },
  {
    "id": 5127,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "For example, no matter who wins the Republican Senate primary in Arizona, the gubernatorial primary (Ducey is term-limited) will probably be won by a Trumpist lunatic named <span class='selected-term'>Kari Lake</span>.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 4851,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 4932,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nThe video, titled “Rigged Elections Have Consequences” calls out the fake news media for their silence on the 2020 election and lists the terrible consequences we face, including our weak southern border and rampant inflation.",
    "author": "Jordan Conradson",
    "title": "INCREDIBLE! Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs"
  },
  {
    "id": 5375,
    "mediaId": 2533,
    "date": "2022-02-22",
    "sentence": "pic.twitter.com/1E2wLhqQOS\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 21, 2022\nI mean, DAYUM.",
    "author": "",
    "title": "Kari Lake’s Latest Campaign Ad For AZ Gov Is So Freaking Badass"
  },
  {
    "id": 5092,
    "mediaId": 2578,
    "date": "2022-02-22",
    "sentence": "(Federal law requires broadcasters accept candidates' political ads regardless of content) https://t.co/fdlG7jq63s\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 22, 2022\nFCC guidelines require these fake news outlets to air advertisements for political candidates regardless of the content.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: 12 News Did NOT Air AZ Gubernatorial Candidate Kari Lake’s Ad Exposing Corrupt Fake News During Purchased Time Slot – Why?"
  },
  {
    "id": 5115,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "On Tuesday, former local news anchor and pro-Trump Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> took to Twitter to accuse Phoenix's 12 News of illegally refusing to air her political ad — which if true would run afoul of Federal Communications Commission rules prohibiting broadcasters from censoring political ads based on their content.",
    "author": "Matthew Chapman",
    "title": "Pro-Trump Arizona candidate gets promptly smacked down after falsely claiming her ads were being censored"
  },
  {
    "id": 3988,
    "mediaId": 2621,
    "date": "2022-02-25",
    "sentence": "Watkins wrote in an October post on Telegram, “Just had dinner with <span class='selected-term'>Kari Lake</span>, the next Governor of Arizona.",
    "author": "Alex Griffing",
    "title": "Trump-Backed Candidate For Governor of Arizona Campaigning With Felon Who ‘Plotted to Kill’ FBI Informant: Report"
  },
  {
    "id": 4437,
    "mediaId": 2818,
    "date": "2022-02-28",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is taking, perhaps, the most aggressive stance against the southern border invasion to date: blow up the drug tunnels, take out the smuggling terrorists.",
    "author": "The First",
    "title": "‘YES, MY PLAN CALLS FOR BLOWING UP DRUG TUNNELS’: AZ Gov. Hopeful Lake Wants to Go After Smuggler ‘Terrorists’"
  },
  {
    "id": 3852,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat Katie Hobbs, <span class='selected-term'>Kari Lake</span> is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 4025,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed <span class='selected-term'>Kari Lake</span> is the only candidate who can win the general election against Soros-funded socialist frontrunner Katie Hobbs.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 3710,
    "mediaId": 2664,
    "date": "2022-03-06",
    "sentence": "Appearing at an Arizona rally for GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, MyPillow CEO Mike Lindell announced his plans to file a class-action suit against \"all machines\" as part of his battle over what he claims was fraud in the 2020 presidential election.",
    "author": "Tom Boggioni",
    "title": "Mike Lindell announces plan to file lawsuit against 'all machines' at Arizona rally"
  },
  {
    "id": 4108,
    "mediaId": 2528,
    "date": "2022-03-06",
    "sentence": "\"It's a class-action lawsuit against all machines,\" Lindell said at a rally for Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> on Saturday.",
    "author": "Alia Shoaib",
    "title": "MyPillow CEO Mike Lindell says he plans to sue 'all machines' over false election fraud claims"
  },
  {
    "id": 3130,
    "mediaId": 2550,
    "date": "2022-03-08",
    "sentence": "Doug Doucey has refused to take a stand against Rogers, and the Rogers-endorsed <span class='selected-term'>Kari Lake</span> has yet to issue a statement about her colleague’s conduct.",
    "author": "",
    "title": "Arizona's Wendy Rogers extremely desperate to be on the wrong side of history"
  },
  {
    "id": 2946,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "https://t.co/rICGW5SUHg\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 8, 2022\nThe Senate Judiciary Committee decided to reschedule the bill for Thursday.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 2993,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 3390,
    "mediaId": 2663,
    "date": "2022-03-14",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> gave quite the performance on 60 Minutes Australia over the weekend, dodging serious questions and abruptly cutting the interview short.",
    "author": "Dan Tracer",
    "title": "Trump-endorsed candidate Kari Lake rants about guns and freedom before storming off “60 Minutes” set"
  },
  {
    "id": 2970,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 2941,
    "mediaId": 2662,
    "date": "2022-03-15",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe video finally aired on Sunday.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 3480,
    "mediaId": 2748,
    "date": "2022-03-15",
    "sentence": "60 Minutes Australia finally aired a small edited portion of Trump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span>’s interview with leftist hack Liam Bartlett.",
    "author": "",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 2842,
    "mediaId": 2540,
    "date": "2022-03-15",
    "sentence": "Watch what happened next\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> abruptly stopped an interview with 60 Minutes Australia, after the journalist asked her about the US Capitol attack.",
    "author": "",
    "title": "Trump-endorsed candidate asked about January 6. Watch what happened next"
  },
  {
    "id": 3472,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Amy Sherman",
    "title": "Jan. 6 defendants “are being held in prison without being charged.”"
  },
  {
    "id": 3563,
    "mediaId": 2790,
    "date": "2022-03-17",
    "sentence": "Sometimes, those things are even lies, like in an ad from Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Domenico Montanaro",
    "title": "The truth in political advertising: 'You're allowed to lie'"
  },
  {
    "id": 2928,
    "mediaId": 2578,
    "date": "2022-03-18",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 18, 2022\nArizona is watching their every move.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Teneo Network, FDD, Koch, And Bill Kristol – AZ Attorney General Mark Brnovich Caught Hanging Out With #NeverTrumpers at Secret AZ Gathering"
  },
  {
    "id": 3121,
    "mediaId": 2662,
    "date": "2022-03-18",
    "sentence": "President Trump has released a statement putting Arizona Attorney General Mark Brnovich on notice while praising Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> for her huge primary lead, which is greatly due to her agenda to get to the bottom of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "JUST IN: President Trump Puts AZ Attorney General Mark Brnovich On Notice – Asks When Ruling On Election Fraud and large-scale Election Irregularities Is Coming"
  },
  {
    "id": 2067,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate <span class='selected-term'>Kari Lake</span> even calling for the arrest of Secretary of State Katie Hobbs.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 1859,
    "mediaId": 2550,
    "date": "2022-03-27",
    "sentence": "Arizona is critical in 2022—in every way possible\nDaily Kos' The Brief\nFollowShare\n0:0058:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nGodbehere on Tuesday earned a supportive tweet from former TV anchor <span class='selected-term'>Kari Lake</span>, the far-right conspiracy theorist that Donald Trump is supporting for governor.",
    "author": "",
    "title": "county abruptly resigns, triggering special election"
  },
  {
    "id": 1907,
    "mediaId": 2614,
    "date": "2022-03-30",
    "sentence": "During a recent appearance on Steve Bannon’s War Room, Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was asked by Bannon whether Governor Doug Ducey is prepared for the fallout of ending Title 42.",
    "author": "Red Voice Media",
    "title": "Kari Lake On Southern Border: ‘This Is Going To Be Biggest Invasion On Our Homeland’ [VIDEO]"
  },
  {
    "id": 1826,
    "mediaId": 2818,
    "date": "2022-03-31",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> spoke exclusively with Just The News about her plans to tackle the crisis at the southern border.",
    "author": "The First",
    "title": "‘I’M FINISHING TRUMP’S WALL’: AZ Gubernatorial Candidate Says She’s Not Bluffing, Will Declare Invasion Day One"
  },
  {
    "id": 1592,
    "mediaId": 2833,
    "date": "2022-03-31",
    "sentence": "Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> has urged police to arrest Hunter Biden for child rape crimes.",
    "author": "Sean Adl-Tabatabai",
    "title": "Trump-Backed Arizona Gov. Kari Lake: “Hunter Biden Must Be Arrested for Child Rape”"
  },
  {
    "id": 1265,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nRepublican Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> vowed Wednesday to declare the border crisis an “invasion” and deploy troops to the U.S.-Mexico border.",
    "author": "DML News App",
    "title": "WATCH: Republican Governor Candidate Vows To Declare ‘Invasion,’ Deploy Troops To Border On Day One"
  },
  {
    "id": 1434,
    "mediaId": 2642,
    "date": "2022-04-04",
    "sentence": "pic.twitter.com/t5mnazMv8x\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 29, 2022\nIf this was me or you, we’d be in solitary confinement by now.",
    "author": "Missy Crane",
    "title": "[VIDEO] Trump’s AZ Candidate Kari Lake Wants Hunter Charged With “Child Molestation”"
  },
  {
    "id": 928,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> – whom former President Donald Trump has endorsed because she supports his \"Big Lie\" that the 2020 election was stolen by President Joe Biden – believes that absentee voting should be reserved for people who are unable to physically cast a ballot on Election Day.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 1195,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 592,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as The Daily Beast reported, Lindell and Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> were in Selma, North Carolina for a Trump rally, because of course they were.",
    "author": "Jennifer Wood",
    "title": "Pillow Man Mike Lindell Thanked Madison Cawthorn For Taking The Heat Off Of Him By Talking About ‘Pornos Things’"
  },
  {
    "id": 698,
    "mediaId": 2645,
    "date": "2022-04-11",
    "sentence": "OAN Newsroom\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> vowed to put an end to the Biden border crisis.",
    "author": "",
    "title": "Kari Lake: We’re going to take back control of the border"
  },
  {
    "id": 476,
    "mediaId": 2528,
    "date": "2022-04-12",
    "sentence": "—<span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) April 10, 2022\nHer tweet comes as the White House's COVID-19 response coordinator, Ashish Jha, said Monday on the Today show that an extension of the transportation mask mandate is \"absolutely on the table\" and would be decided by the Centers for Disease and Control Prevention.",
    "author": "Matthew Loh",
    "title": "Trump-endorsed Arizona gubernatorial candidate Kari Lake says she would fine airlines $1,000 for making passengers wear masks"
  },
  {
    "id": 470,
    "mediaId": 2574,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Collin Anderson",
    "title": "Trump-Backed Kari Lake Knocked Doors for Obama, Former Colleague Says"
  },
  {
    "id": 600,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In Arizona’s upcoming governor contest, Trump endorsed former journalist <span class='selected-term'>Kari Lake</span>.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 125,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> recently appeared on Real America with Dan Ball to discuss the invasion of our southern border in Arizona, where thousands are pouring into our country each day.",
    "author": "Assistant Editor",
    "title": "Trump-Endorsed AZ Gubernatorial Candidate Kari Lake On Securing Southern Border: “As Governor I Will Not Take Any Orders From Joe Biden He’s Illegitimate. That Election Was a Sham” (VIDEO)"
  },
  {
    "id": 719,
    "mediaId": 2818,
    "date": "2022-04-21",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> says busing migrants to D.C. doesn’t solve the problem —we have to send them back across the border.",
    "author": "The First",
    "title": "RETURN TO SENDER: AZ Gov Candidate Kari Lake Says Send Migrant Buses Back Across the Border"
  }
]