[
  {
    "id": 6586,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona GOP Candidate <span class='selected-term'>Kari Lake</span> on OAN: Biden “Couldn’t Even Attract the Number of People at the Port-o-Johns” at a Trump Rally (VIDEO)\nPart of the border in Yuma, Arizona, doesn’t even have a barrier, and illegal immigrants walk into our country and surrender.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona Gubernatorial Candidate Kari Lake: “DAY ONE – We Will Issue A Declaration Of Invasion”, Plans An Interstate Compact To Secure Southern Border"
  },
  {
    "id": 6555,
    "mediaId": 2540,
    "date": "2022-01-27",
    "sentence": "The headline was repeated on Twitter by <span class='selected-term'>Kari Lake</span>, a Republican candidate for Arizona governor.",
    "author": "Daniel Dale",
    "title": "Fact check: Right-wing website falsely claims Wisconsin assembly voted to withdraw its Biden electoral votes"
  },
  {
    "id": 6152,
    "mediaId": 2595,
    "date": "2022-02-11",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 10, 2022\nKari Lake Tapes the Loser as He’s Taping Her and Trying to Destroy Her – She’s Prepared\nThis next bit is great where she goes after the snob.",
    "author": "M Dowling",
    "title": "We Would Hate to Be the Dem Running Against Kari Lake – Watch 3 videos!"
  },
  {
    "id": 4305,
    "mediaId": 2738,
    "date": "2022-03-06",
    "sentence": "But now he has a new plan: he’s filing a class action lawsuit against “all machines.”\nAt a rally for Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, another Big Lie cheerleader, Lindell talked about how, on top of everything else he’s done to promote his nonsense claims — presumably while also running a pillow business — he’s been tirelessly planning to sue technology, or something.",
    "author": "Matt Prigge",
    "title": "Mike Lindell Has Threatened A Class Action Lawsuit Against ‘All Machines’ In His Latest Attempt To Prove The ‘Big Lie’"
  },
  {
    "id": 3422,
    "mediaId": 2596,
    "date": "2022-03-07",
    "sentence": "He was appearing at a rally for Arizona GOP gubernatorial candidate and fellow Big Lie believer <span class='selected-term'>Kari Lake</span> recently we he said he’s planning to sue technology, seemingly as a whole.",
    "author": "",
    "title": "Trump fanatic Mike Lindell is filing a lawsuit against 'all machines'"
  },
  {
    "id": 1590,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "On the Republican side, a recent poll from Alloy Analytics shows former news anchor <span class='selected-term'>Kari Lake</span>, who I interviewed last July, leading in the primary for governor.",
    "author": "Madeline Leesman",
    "title": "Democratic Arizona Gubernatorial Candidate Will Not Say If She Supports Limits on Abortion"
  }
]