[
  {
    "id": 6474,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "Bringing along names like <span class='selected-term'>Kari Lake</span> and Mike Lindell to warm up the crowd, Trump didn’t hold back when it came time for him to speak, bashing President Joe Biden’s leadership when it came to the Southern border, the Capitol Hill January 6 incident, and COVID-19.",
    "author": "Red Voice Media",
    "title": "Trump Rails Biden’s ‘Ridiculous Unscientific’ Big Pharma Mandates And Dem Race-Based COVID Treatments [VIDEOS]"
  },
  {
    "id": 5900,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 5939,
    "mediaId": 2557,
    "date": "2022-02-07",
    "sentence": "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\n<span class='selected-term'>Kari Lake</span>, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "author": "DML News App",
    "title": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle"
  },
  {
    "id": 2970,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 1551,
    "mediaId": 2642,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] President Trump’s Candidate for MI Secretary of State is a GOP SUPERSTAR In The Making"
  },
  {
    "id": 1590,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "On the Republican side, a recent poll from Alloy Analytics shows former news anchor <span class='selected-term'>Kari Lake</span>, who I interviewed last July, leading in the primary for governor.",
    "author": "Madeline Leesman",
    "title": "Democratic Arizona Gubernatorial Candidate Will Not Say If She Supports Limits on Abortion"
  },
  {
    "id": 928,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> – whom former President Donald Trump has endorsed because she supports his \"Big Lie\" that the 2020 election was stolen by President Joe Biden – believes that absentee voting should be reserved for people who are unable to physically cast a ballot on Election Day.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 1443,
    "mediaId": 2642,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "President Trump Just Discovered The GOP’s New SUPER Star"
  },
  {
    "id": 456,
    "mediaId": 2645,
    "date": "2022-04-12",
    "sentence": "MORE NEWS: <span class='selected-term'>Kari Lake</span>: We’re Going To Take Back Control Of The Border",
    "author": "",
    "title": "Democrat Rep. Slotkin against ending Title 42"
  },
  {
    "id": 95,
    "mediaId": 2512,
    "date": "2022-04-19",
    "sentence": "Less tested or more extreme candidates, like Arizona governor hopeful <span class='selected-term'>Kari Lake</span> or North Carolina House candidate Bo Hines, could jeopardize the GOP’s chances in swing states and districts come November.”\nThe “blurred lines” that Shepard is referring to in X-Factor #2 are maps for House districts.",
    "author": "Alex Henderson",
    "title": "These 5 'X-factors' could ‘scramble’ the 2022 midterms: journalist"
  }
]