[
  {
    "id": 5554,
    "mediaId": 2662,
    "date": "2022-02-03",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n<span class='selected-term'>Kari Lake</span>: Well he’s obviously sitting in the White House.",
    "author": "Jim Hoft",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 5848,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> recently suggested that Joe Biden join Rogan’s fact-based show to argue his stance.",
    "author": "Jordan Conradson",
    "title": "Arizona Gubernatorial Candidate Kari Lake: “If I Knew That Joe Biden Could Carry A Coherent Conversation, I’d Suggest He Go On Rogan”"
  },
  {
    "id": 5525,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> called for perp walks after seeing this video.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE – ELECTION FRAUD ON VIDEO: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server Before Delivery To Auditors"
  },
  {
    "id": 5560,
    "mediaId": 2662,
    "date": "2022-02-10",
    "sentence": "WATCH: AZ Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> DEMOLISHES 60 Minutes Australia – “The Only Thing Keeping Us From Being Australia Right Now, Or Canada Is Our Second Amendment.”\nKari Lake doesn’t let the fake news make her look bad.",
    "author": "Jordan Conradson",
    "title": "EPIC! Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by Kari Lake — Then GETS SCHOOLED Again (VIDEO)"
  },
  {
    "id": 4932,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nThe video, titled “Rigged Elections Have Consequences” calls out the fake news media for their silence on the 2020 election and lists the terrible consequences we face, including our weak southern border and rampant inflation.",
    "author": "Jordan Conradson",
    "title": "INCREDIBLE! Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs"
  },
  {
    "id": 5092,
    "mediaId": 2578,
    "date": "2022-02-22",
    "sentence": "(Federal law requires broadcasters accept candidates' political ads regardless of content) https://t.co/fdlG7jq63s\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 22, 2022\nFCC guidelines require these fake news outlets to air advertisements for political candidates regardless of the content.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: 12 News Did NOT Air AZ Gubernatorial Candidate Kari Lake’s Ad Exposing Corrupt Fake News During Purchased Time Slot – Why?"
  },
  {
    "id": 4025,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed <span class='selected-term'>Kari Lake</span> is the only candidate who can win the general election against Soros-funded socialist frontrunner Katie Hobbs.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 2946,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "https://t.co/rICGW5SUHg\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) March 8, 2022\nThe Senate Judiciary Committee decided to reschedule the bill for Thursday.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 2941,
    "mediaId": 2662,
    "date": "2022-03-15",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe video finally aired on Sunday.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 1082,
    "mediaId": 2662,
    "date": "2022-04-09",
    "sentence": "Watch right now on Rumble or through my app!https://t.co/yVIDSuHsyr\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) April 9, 2022",
    "author": "Jim Hoft",
    "title": "THOUSANDS Expected at Trump NC Rally Tonight with Ted Budd, Madison Cawthorn, Dan Bishop and Greg Murphy at 7 PM ET"
  },
  {
    "id": 125,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> recently appeared on Real America with Dan Ball to discuss the invasion of our southern border in Arizona, where thousands are pouring into our country each day.",
    "author": "Assistant Editor",
    "title": "Trump-Endorsed AZ Gubernatorial Candidate Kari Lake On Securing Southern Border: “As Governor I Will Not Take Any Orders From Joe Biden He’s Illegitimate. That Election Was a Sham” (VIDEO)"
  }
]