[
  {
    "id": 4635,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "Five members of <span class='selected-term'>Kari Lake</span>’s campaign team attempted to infiltrate planning meetings for an anti-sexual assault protest organized by a coalition of leftist student groups at Arizona State University, the groups alleged.",
    "author": "Jeremy Duda",
    "title": "Leftist Arizona State student groups allege infiltration by Kari Lake campaign staffers"
  },
  {
    "id": 5115,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "On Tuesday, former local news anchor and pro-Trump Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> took to Twitter to accuse Phoenix's 12 News of illegally refusing to air her political ad — which if true would run afoul of Federal Communications Commission rules prohibiting broadcasters from censoring political ads based on their content.",
    "author": "Matthew Chapman",
    "title": "Pro-Trump Arizona candidate gets promptly smacked down after falsely claiming her ads were being censored"
  },
  {
    "id": 3852,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat Katie Hobbs, <span class='selected-term'>Kari Lake</span> is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 4025,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed <span class='selected-term'>Kari Lake</span> is the only candidate who can win the general election against Soros-funded socialist frontrunner Katie Hobbs.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 928,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> – whom former President Donald Trump has endorsed because she supports his \"Big Lie\" that the 2020 election was stolen by President Joe Biden – believes that absentee voting should be reserved for people who are unable to physically cast a ballot on Election Day.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 1590,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "On the Republican side, a recent poll from Alloy Analytics shows former news anchor <span class='selected-term'>Kari Lake</span>, who I interviewed last July, leading in the primary for governor.",
    "author": "Madeline Leesman",
    "title": "Democratic Arizona Gubernatorial Candidate Will Not Say If She Supports Limits on Abortion"
  },
  {
    "id": 600,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In Arizona’s upcoming governor contest, Trump endorsed former journalist <span class='selected-term'>Kari Lake</span>.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  }
]