[
  {
    "id": 6466,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Trump endorsed Paxton in July 2021, while his wife Angela, a candidate for state senate in Texas, picked up the former president’s backing a couple of weeks after the fundraiser.”\nEverson notes that two other Republicans “whose campaigns have spent at least $50,000” at Mar-a-Lago are <span class='selected-term'>Kari Lake</span> and Sarah Huckabee Sanders.",
    "author": "Alex Henderson",
    "title": "Texas AG Paxton’s campaign spent $50,000 at Mar-a-Lago: report"
  },
  {
    "id": 1112,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "One prominent gubernatorial candidate, <span class='selected-term'>Kari Lake</span> in Arizona, has even called for arresting her opponent, Secretary of State Katie Hobbs.",
    "author": "Matthew Chapman",
    "title": "New ad begs Trump to rescind endorsement of 'grifting loser' AG candidate in Michigan"
  },
  {
    "id": 1142,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Other guests included former trade adviser Peter Navarro, former White House advisers Kellyanne Conway and Hope Hicks, right-wing attorney Cleta Mitchell, Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>, former spokesman Hogan Gidley, former campaign manager Corey Lewandowski, former White House chief of staff Reince Priebus, Truth Social CEO Devin Nunes and One America News anchor Christina Bobb.",
    "author": "Travis Gettys",
    "title": "Trump holds a dazzling pity party at Mar-A-Lago for debut of election fraud conspiracy film"
  },
  {
    "id": 1039,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "The Trump-backed gubernatorial candidate in Arizona’s 2022 election, former TV news anchor <span class='selected-term'>Kari Lake</span>, told Breitbart News at the premiere that the film “was one of the most important movies I’ve ever seen.”\n“Americans are busy.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Trump at ‘Rigged’ Premiere: ‘It Shouldn’t Be Allowed’ for Mark Zuckerberg to Privately Finance Election Operations"
  },
  {
    "id": 1151,
    "mediaId": 2662,
    "date": "2022-04-09",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is broadcasting with Right Side Broadcasting Network tonight.",
    "author": "Jim Hoft",
    "title": "LIVE-STREAM VIDEO: President Trump Holds Another MASSIVE Rally in Selma, North Carolina — Estimated Start Time 7 PM ET"
  }
]