[
  {
    "id": 6474,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "Bringing along names like <span class='selected-term'>Kari Lake</span> and Mike Lindell to warm up the crowd, Trump didn’t hold back when it came time for him to speak, bashing President Joe Biden’s leadership when it came to the Southern border, the Capitol Hill January 6 incident, and COVID-19.",
    "author": "Red Voice Media",
    "title": "Trump Rails Biden’s ‘Ridiculous Unscientific’ Big Pharma Mandates And Dem Race-Based COVID Treatments [VIDEOS]"
  },
  {
    "id": 4596,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 4305,
    "mediaId": 2738,
    "date": "2022-03-06",
    "sentence": "But now he has a new plan: he’s filing a class action lawsuit against “all machines.”\nAt a rally for Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, another Big Lie cheerleader, Lindell talked about how, on top of everything else he’s done to promote his nonsense claims — presumably while also running a pillow business — he’s been tirelessly planning to sue technology, or something.",
    "author": "Matt Prigge",
    "title": "Mike Lindell Has Threatened A Class Action Lawsuit Against ‘All Machines’ In His Latest Attempt To Prove The ‘Big Lie’"
  },
  {
    "id": 4108,
    "mediaId": 2528,
    "date": "2022-03-06",
    "sentence": "\"It's a class-action lawsuit against all machines,\" Lindell said at a rally for Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> on Saturday.",
    "author": "Alia Shoaib",
    "title": "MyPillow CEO Mike Lindell says he plans to sue 'all machines' over false election fraud claims"
  },
  {
    "id": 4006,
    "mediaId": 2590,
    "date": "2022-03-06",
    "sentence": "Advertisement\nLindell seemed perfectly serious when he made the announcement during a speech endorsing Arizona GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Mary Papenfuss",
    "title": "Mike Lindell Vows 'Class Action' Suit Against 'All Machines' Over Rigged Election Lie"
  },
  {
    "id": 3710,
    "mediaId": 2664,
    "date": "2022-03-06",
    "sentence": "Appearing at an Arizona rally for GOP gubernatorial candidate <span class='selected-term'>Kari Lake</span>, MyPillow CEO Mike Lindell announced his plans to file a class-action suit against \"all machines\" as part of his battle over what he claims was fraud in the 2020 presidential election.",
    "author": "Tom Boggioni",
    "title": "Mike Lindell announces plan to file lawsuit against 'all machines' at Arizona rally"
  },
  {
    "id": 3422,
    "mediaId": 2596,
    "date": "2022-03-07",
    "sentence": "He was appearing at a rally for Arizona GOP gubernatorial candidate and fellow Big Lie believer <span class='selected-term'>Kari Lake</span> recently we he said he’s planning to sue technology, seemingly as a whole.",
    "author": "",
    "title": "Trump fanatic Mike Lindell is filing a lawsuit against 'all machines'"
  },
  {
    "id": 1195,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 189,
    "mediaId": 2583,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "Mike Lindell Shouts ‘Dominion,’ Bashes Fox, Calls Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 592,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as The Daily Beast reported, Lindell and Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> were in Selma, North Carolina for a Trump rally, because of course they were.",
    "author": "Jennifer Wood",
    "title": "Pillow Man Mike Lindell Thanked Madison Cawthorn For Taking The Heat Off Of Him By Talking About ‘Pornos Things’"
  },
  {
    "id": 803,
    "mediaId": 2509,
    "date": "2022-04-11",
    "sentence": "He traveled to Mar-a-Lago last Thursday to attend a fundraiser for Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> that featured the former president.",
    "author": "Will Steakin",
    "title": "Former Trump lawyer, amid clash with Jan. 6 committee, pushing to decertify 2020 election"
  }
]