[
  {
    "id": 6837,
    "mediaId": 2614,
    "date": "2022-01-18",
    "sentence": "ARIZONA – Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span>, who became a rising star in the conservative movement in Arizona after spending over two decades in broadcast journalism within the state, recently proposed forming an interstate compact in effort to combat illegal immigration stemming from the southern border.",
    "author": "Red Voice Media",
    "title": "AZ Gubernatorial Candidate Kari Lake Proposes Interstate Compact To Combat Illegal Immigration"
  },
  {
    "id": 6642,
    "mediaId": 2605,
    "date": "2022-01-20",
    "sentence": "Prominent at Trump’s rally was <span class='selected-term'>Kari Lake</span>, his choice to dump Arizona Gov.",
    "author": "Jackie CalmesColumnist",
    "title": "Column: Biden’s first year is a chronicle of Republican obstruction and Trump’s shadow"
  },
  {
    "id": 6466,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Trump endorsed Paxton in July 2021, while his wife Angela, a candidate for state senate in Texas, picked up the former president’s backing a couple of weeks after the fundraiser.”\nEverson notes that two other Republicans “whose campaigns have spent at least $50,000” at Mar-a-Lago are <span class='selected-term'>Kari Lake</span> and Sarah Huckabee Sanders.",
    "author": "Alex Henderson",
    "title": "Texas AG Paxton’s campaign spent $50,000 at Mar-a-Lago: report"
  },
  {
    "id": 6492,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "Anti-vaxxer <span class='selected-term'>Kari Lake</span>, who appears to the frontrunner in Arizona’s 2022 GOP gubernatorial primary, is right out of the Marjorie Taylor Greene/Lauren Boebert school of MAGA lunacy.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 6411,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alex Henderson",
    "title": "GOP state majority leader slams far-right MAGA rep for proposing Wisconsin retract electoral votes for Biden: 'It is illegal'"
  },
  {
    "id": 6426,
    "mediaId": 2512,
    "date": "2022-02-01",
    "sentence": "If candidates like <span class='selected-term'>Kari Lake</span> in Arizona and David Perdue in Georgia are successful, it would give them final say over whether to certify a slate of electors for a presidential candidate.”\nPanetta adds, “Such trends raise the risk of a disputed or possibly stolen election in the 2022 midterms.",
    "author": "Alex Henderson",
    "title": "Here’s how 'rogue' GOP governors could steal the 2024 election for Trump — and cause a 'constitutional tailspin'"
  },
  {
    "id": 6286,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> was recently interviewed by an ABC rookie journalist.",
    "author": "",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 5554,
    "mediaId": 2662,
    "date": "2022-02-03",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n<span class='selected-term'>Kari Lake</span>: Well he’s obviously sitting in the White House.",
    "author": "Jim Hoft",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 5652,
    "mediaId": 2557,
    "date": "2022-02-04",
    "sentence": "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) September 28, 2021\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "WATCH: GOP governor candidate turns tables on reporter regarding 2020"
  },
  {
    "id": 5900,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 5939,
    "mediaId": 2557,
    "date": "2022-02-07",
    "sentence": "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\n<span class='selected-term'>Kari Lake</span>, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "author": "DML News App",
    "title": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle"
  },
  {
    "id": 6163,
    "mediaId": 2599,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Stephen Green",
    "title": "All Republican Candidates Must Learn a Lesson From Arizona Gubernatorial Hopeful Kari Lake."
  },
  {
    "id": 5127,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "For example, no matter who wins the Republican Senate primary in Arizona, the gubernatorial primary (Ducey is term-limited) will probably be won by a Trumpist lunatic named <span class='selected-term'>Kari Lake</span>.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 4851,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 4955,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 4596,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The Big Lie — the false and totally debunked claim that the 2020 presidential election was stolen from Donald Trump because of widespread voter fraud — continues to be aggressively promoted on the MAGA far-right, from MyPillow CEO Mike Lindell to Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> to Trump himself.",
    "author": "Alex Henderson",
    "title": "This former Ted Cruz advisor is trying to keep Republicans he once advised from stealing the 2024 election"
  },
  {
    "id": 5064,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is on the agenda, but neither of her top opponents will appear.",
    "author": "",
    "title": "Opinion: This year’s CPAC lineup speaks volumes about the conservative movement"
  },
  {
    "id": 3852,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat Katie Hobbs, <span class='selected-term'>Kari Lake</span> is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 2993,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 3390,
    "mediaId": 2663,
    "date": "2022-03-14",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> gave quite the performance on 60 Minutes Australia over the weekend, dodging serious questions and abruptly cutting the interview short.",
    "author": "Dan Tracer",
    "title": "Trump-endorsed candidate Kari Lake rants about guns and freedom before storming off “60 Minutes” set"
  },
  {
    "id": 2970,
    "mediaId": 2614,
    "date": "2022-03-15",
    "sentence": "Although <span class='selected-term'>Kari Lake</span> is still a gubernatorial candidate for Arizona, she has already captivated Republican voters and headlines for attacking the mainstream media promoting the Democrat’s agenda.",
    "author": "Red Voice Media",
    "title": "Kari Lake Vows To Defend Arizona Against Federal Gov – Joe Biden Can Come Down Here & Arrest Me [VIDEOS]"
  },
  {
    "id": 2318,
    "mediaId": 2745,
    "date": "2022-03-23",
    "sentence": "Those protests include demonstrations led by <span class='selected-term'>Kari Lake</span>, a former Arizona television news anchor running for governor with Trump’s endorsement.",
    "author": "",
    "title": "As GOP lawmakers push for more election fraud charges, prosecutors find few cases"
  },
  {
    "id": 2110,
    "mediaId": 2636,
    "date": "2022-03-25",
    "sentence": "Mr. Trump is backing a former newscaster, <span class='selected-term'>Kari Lake</span>, and Mr. Ducey has not yet endorsed anyone.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump’s Role as the G.O.P. ‘Kingpin’"
  },
  {
    "id": 1976,
    "mediaId": 2664,
    "date": "2022-03-25",
    "sentence": "Greitens comments came one day after Trump's endorsed candidate for Arizona governor, <span class='selected-term'>Kari Lake</span>, attacked Ronna Romney McDaniel, who remains as chairwoman of the RNC after being picked by Trump.",
    "author": "Bob Brigham",
    "title": "GOP civil war escalates as Republicans keep slamming each other in meaner and meaner terms"
  },
  {
    "id": 1112,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "One prominent gubernatorial candidate, <span class='selected-term'>Kari Lake</span> in Arizona, has even called for arresting her opponent, Secretary of State Katie Hobbs.",
    "author": "Matthew Chapman",
    "title": "New ad begs Trump to rescind endorsement of 'grifting loser' AG candidate in Michigan"
  },
  {
    "id": 1265,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nRepublican Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> vowed Wednesday to declare the border crisis an “invasion” and deploy troops to the U.S.-Mexico border.",
    "author": "DML News App",
    "title": "WATCH: Republican Governor Candidate Vows To Declare ‘Invasion,’ Deploy Troops To Border On Day One"
  },
  {
    "id": 928,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> – whom former President Donald Trump has endorsed because she supports his \"Big Lie\" that the 2020 election was stolen by President Joe Biden – believes that absentee voting should be reserved for people who are unable to physically cast a ballot on Election Day.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 1047,
    "mediaId": 2641,
    "date": "2022-04-06",
    "sentence": "In Arizona, several Republican women have declared runs, including state Treasurer Kimberly Yee, Secretary of the Arizona Board of Regents Karrin Taylor Robson and former TV anchor <span class='selected-term'>Kari Lake</span>, CNN reported.",
    "author": "Peter Malbin",
    "title": "New Organization Recruits More Female Republicans to Be Governor"
  },
  {
    "id": 1443,
    "mediaId": 2642,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Sophie O’Hara",
    "title": "President Trump Just Discovered The GOP’s New SUPER Star"
  },
  {
    "id": 1195,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 709,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "Trump doubled down on his criticism during a fundraiser for Arizona gubernatorial GOP candidate <span class='selected-term'>Kari Lake</span>, who is running for the governorship being vacated by Republican Governor Doug Ducey.",
    "author": "Andrew Stanton",
    "title": "Trump Says Candidates Rejecting His Election Fraud Claims Have Gone 'Woke'"
  },
  {
    "id": 189,
    "mediaId": 2583,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "Mike Lindell Shouts ‘Dominion,’ Bashes Fox, Calls Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 456,
    "mediaId": 2645,
    "date": "2022-04-12",
    "sentence": "MORE NEWS: <span class='selected-term'>Kari Lake</span>: We’re Going To Take Back Control Of The Border",
    "author": "",
    "title": "Democrat Rep. Slotkin against ending Title 42"
  },
  {
    "id": 95,
    "mediaId": 2512,
    "date": "2022-04-19",
    "sentence": "Less tested or more extreme candidates, like Arizona governor hopeful <span class='selected-term'>Kari Lake</span> or North Carolina House candidate Bo Hines, could jeopardize the GOP’s chances in swing states and districts come November.”\nThe “blurred lines” that Shepard is referring to in X-Factor #2 are maps for House districts.",
    "author": "Alex Henderson",
    "title": "These 5 'X-factors' could ‘scramble’ the 2022 midterms: journalist"
  },
  {
    "id": 354,
    "mediaId": 2589,
    "date": "2022-04-20",
    "sentence": "ROBBY HAS BEEN ENDORSED BY SENATOR RAND PAUL, CANDACE OWENS, CHARLIE KIRK, CONGRESSMAN MADISON CAWTHORN, CONGRESSMAN THOMAS MASSIE, CONGRESSWOMAN MARJORIE TAYLOR GREENE, TURNING POINT ACTION, LEXIT, PRESIDENT TRUMP’S LAWYER JENNA ELLIS, WILLIAMSON COUNTY SHERIFF DUSTY RHOADES, SEBASTIAN GORKA, CONGRESSMAN RALPH NORMAN, NYC MAYOR RUDY GUILIANI, CONGRESSMAN KEN BUCK, REPUBLICANS FOR NATIONAL RENEWAL, AZ GOP CHAIR KELLI WARD, BIENVENIEDO, BULL MOOSE PROJECT, AZ GOV CANDIDATE <span class='selected-term'>KARI LAKE</span> AND MANY MORE\nStarbuck says a full statement is coming soon.",
    "author": "Karen Townsend",
    "title": "TN GOP kicks 3 candidates off ballot, including Trump and Pompeo endorsee"
  }
]