[
  {
    "id": 6442,
    "mediaId": 2614,
    "date": "2022-01-17",
    "sentence": "While Trump has endorsed Republican gubernatorial candidate <span class='selected-term'>Kari Lake</span> in Arizona, he has yet to issue an endorsement in the state’s Senate primary.",
    "author": "RobManess.com",
    "title": "Trump Eviscerates Biden For Being ‘Incompetent’ – Predicts ‘Red Wave’ Is Coming"
  },
  {
    "id": 5900,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 2993,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 2067,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate <span class='selected-term'>Kari Lake</span> even calling for the arrest of Secretary of State Katie Hobbs.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 2110,
    "mediaId": 2636,
    "date": "2022-03-25",
    "sentence": "Mr. Trump is backing a former newscaster, <span class='selected-term'>Kari Lake</span>, and Mr. Ducey has not yet endorsed anyone.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump’s Role as the G.O.P. ‘Kingpin’"
  },
  {
    "id": 95,
    "mediaId": 2512,
    "date": "2022-04-19",
    "sentence": "Less tested or more extreme candidates, like Arizona governor hopeful <span class='selected-term'>Kari Lake</span> or North Carolina House candidate Bo Hines, could jeopardize the GOP’s chances in swing states and districts come November.”\nThe “blurred lines” that Shepard is referring to in X-Factor #2 are maps for House districts.",
    "author": "Alex Henderson",
    "title": "These 5 'X-factors' could ‘scramble’ the 2022 midterms: journalist"
  }
]