{
  "id": 2905,
  "mediaId": 136,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Will 'Orgy' Claims Cost Madison Cawthorn His GOP Career?",
  "image": "",
  "link": "https://www.newsweek.com/madison-cawthorn-orgy-gop-republicans-1694155",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    2303,
    2341,
    2341,
    2303,
    2226,
    2226,
    1609,
    1993,
    1993,
    1421,
    1421,
    1609,
    428,
    562,
    562,
    428,
    2590,
    2590,
    2834,
    2834
  ],
  "sentences": [
    "Shanahan said Cawthorn had been elected \"on a populist wave\" but that \"he hasn't delivered anything for the people of North Carolina's 11th district and may well be seen in his district, as well as across the House, as more a liability than an electoral asset in November.\"",
    "Cawthorn, a Republican representing North Carolina's 11th congressional district, has faced strong criticism in recent days following an interview where he claimed he'd been invited to an \"orgy\" during his time in Washington, D.C. and seen people taking cocaine.",
    "Cawthorn announced late last year that he would run in the newly drawn 13th district in 2022, but when that map was thrown out by a court and redrawn, he decided he would stick with the 11th district, as Shanahan pointed out.",
    "\"Former Cawthorn supporters in NC11 are coming over to Team Woodhouse in droves as the America First conservative in this race to assure we don't lose this seat to an establishment centrist politician or a radical liberal.\"",
    "\"If he continues to trash his own reputation through this ongoing pattern of claims-without-evidence, he won't even make it through the primary and faces a serious threat of censure or worse from this current Congress.\"",
    "Mark Shanahan is an associate professor at the Department of Politics and International Relations at Reading University in the U.K., and co-editor of The Trump Presidency: From Campaign Trail to World Stage.",
    "Rep. Madison Cawthorn could be in for a tough fight to keep his seat as primary opponents circle and prominent Republicans take aim at the youngest member of the U.S. House of Representatives.",
    "\"Having initially misjudged which race to run in the upcoming midterms, he now faces GOP challenges in the 11th district,\" Shanahan said, noting Edwards and Woodhouse in particular.",
    "Bruce O'Connell, a hotel and restaurant operator and another of Cawthorn's primary opponents, was also highly critical of the Republican in a statement to Newsweek.",
    "\"As long as elements of the Republican base are willing to overlook such behaviorand many areit's hard to imagine these statements being fatal for Cawthorn.\"",
    "A Serious Threat\nPolitical experts who spoke to Newsweek about Cawthorn's future wondered if the Republican might have gone too far in his recent remarks.",
    "\"Just ask Marjorie Taylor Greene, Paul Gosar or any number of extreme right-wing voices on Capitol Hill who make a living off their exhibitionism.\"",
    "\"Not only has the Republican House leadership lost confidence in him, so too have the voters of NC11,\" Woodhouse told Newsweek in a statement.",
    "The two U.S. senators from North CarolinaRepublicans Thom Tillis and Richard Burr have both publicly criticized the 26-year-old congressman.",
    "There's no evidence to this,\" said McCarthy, a California Republican, adding that he could potentially take further action against Cawthorn.",
    "\"But that's no longer true in today's GOP, where outlandish comments are often rewardedor at least rarely punishedby primary voters.",
    "\"Callous and self-regarding, yes, but without the experience, street-smarts, and undoubted charisma of the former president.\"",
    "Cawthorn's most recent remarks about goings-on in D.C. also earned a stern rebuke from House Minority Leader Kevin McCarthy.",
    "Michele Woodhouse, a former Republican Party chair for North Carolina's 11th district, is hoping to defeat Cawthorn in May.",
    "'Unelectable'\nCawthorn is facing several opponents in the upcoming primary, including the now Tillis-endorsed Edwards.",
    "Tillis has even endorsed one of Cawthorn's opponents in the May GOP primary, State Senator Chuck Edwards.",
    "\"A decade ago, Cawthorn's bizarre comments might have been a death knell for the congressman,\" Gift said.",
    "Gift said that Republican lawmakers generally \"don't want to make enemies within their own ranks.\"",
    "Today's GOP\nHowever, Thomas Gift, founding director of University College London's Centre on U.S.",
    "\"His continued antics and cavalier attitude with the truth have put this 'safe' seat at risk.",
    "But what matters is what primary voters think, much more than party leadership,\" Gift said.",
    "\"It's hard to imagine what was going through Cawthorn's head when he made the statements.",
    "He told Newsweek that Cawthorn had borrowed \"straight from the Trump playbook.\"",
    "Politics, told Newsweek that Cawthorn could survive the controversy.",
    "We need a non-politician if we have any hope for positive change.",
    "We must change who and what we are sending to Washington.\"",
    "\"Mr. Cawthorn's behavior is unacceptable,\" O'Connell said.",
    "\"Mr. Edwards is getting the political club behind him.",
    "Newsweek has asked Cawthorn's office for comment.",
    "\"But he's no Donald Trump\" Shanahan said.",
    "She called the congressman \"unelectable.\"",
    "\"This is unacceptable."
  ]
}