{
  "id": 2946,
  "mediaId": 129,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too.",
  "image": "https://static01.nyt.com/images/2022/03/29/us/politics/00pol-cawthorn-top/00pol-cawthorn-top-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/30/us/politics/madison-cawthorn-congress.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1090,
    1090,
    952,
    952,
    2303,
    1501,
    1501,
    1609,
    1609,
    1577,
    1577,
    428,
    562,
    562,
    428,
    255,
    255,
    2672,
    2672
  ],
  "sentences": [
    "At the debate, Mr. Edwards confined his attacks to a resolution Mr. Cawthorn introduced in Washington: a 52-point plan calling for a one-third reduction in federal spending, as well as reforming Social Security by incentivizing people to work and get off entitlement programs.''\nI would not cut Social Security benefits by a third, as is suggested in our congressman's garbled 52-point plan for America,'' Mr. Edwards said.",
    "Had he not flirted with another district, he wouldn't be in this situation, where there's a question of whether he'll win this primary,'' said Christopher Cooper, a political scientist at Western Carolina University in Cullowhee, N.C. It's the thing that opened the door for the field to expand.?\nIt's unclear if Mr. Cawthorn's temporary desertion has penetrated to average voters, even if it angers party officials.",
    "HENDERSONVILLE, N.C.  In the era of Donald Trump's takeover of the Republican Party  when making falsehoods about an election isn't disqualifying, when heckling a president at the State of the Union is no big deal, when attending an event tied to white supremacists doesn't lead to exile  it may still be possible for a hard-right member of Congress to go too far.",
    "George Erwin, a retired county sheriff who organized a group of law enforcement officials to endorse Mr. Cawthorn in 2020, said he no longer backed him, in part because of his actions around Jan. 6.\nThe words that come out of his mouth incite people,'' said Mr. Erwin, who is now supporting a Cawthorn challenger, Rod Honeycutt, a retired Army colonel.",
    "Days earlier, he had tweeted, It's time to fight.'' In the aftermath of the riot, he denounced the violence, writing in a tweet that it wasn't patriotism it was thuggery.?\nThis year, a group of North Carolina voters sought to have Mr. Cawthorn disqualified from re-election because of his participation in an insurrection.? A judge blocked the effort.",
    "Unlike some other far-right members of Congress  including Representatives Marjorie Taylor Greene of Georgia and Lauren Boebert of Colorado, both of whom booed President Biden during his State of the Union speech  Mr. Cawthorn is also saddled with a yearslong series of hyperbolic claims about his personal life, raising questions about his honesty.",
    "I think driving without a license is saying, I can do what I want, the law doesn't pertain to me.' That's not the kind of person I want representing me.''\nMr. Cawthorn has the advantage of broad name recognition in a field of challengers who, with a couple of exceptions, have raised little money needed to become better known.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year's map is poised to be surprisingly fair\nGovernors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "But Mr. Baker, an employee benefits expert, said rank-and-file Republicans like himself still support Mr. Cawthorn because of his clarity on those issues that were so important to Trump.?\nMr. Cawthorn was raised in Hendersonville, N.C., a small community where he was home-schooled.",
    "He also has the endorsement of Mr. Trump, whom Mr. Cawthorn identified on Saturday as a man who mentors me.?\nAn internal poll of likely Republican voters this month for a Cawthorn rival showed the congressman leading the field with 52 percent and 17 percent undecided.",
    "Mr. Cawthorn faces a total of seven Republican challengers, a field that includes other former supporters, who accuse him of neglecting constituents while chasing Instagram followers with fiery rhetoric and pursuing donors with expensive travel outside the state.",
    "Although Mr. McCarthy recently condemned Ms. Taylor Greene for an appearance at a conference organized by a white supremacist, he refused last year to back her removal from committees for endorsing violent behavior and spreading bigoted conspiracy theories.",
    "One of those claims finally set off his fellow House Republicans this week: a bizarre assertion he made on a conservative YouTube channel that people he looked up to? in Washington  presumably Republican lawmakers  invited him to orgies and used cocaine.",
    "That is the object lesson of Representative Madison Cawthorn of North Carolina, the House's youngest member, whose bid for a second term is in jeopardy after a series of incendiary statements and personal foibles have soured many former supporters.",
    "They include Representatives Paul Gosar of Arizona, who posted an animated video showing him killing a Democratic congresswoman, and Matt Gaetz of Florida, who is under federal investigation for allegations of sex trafficking.",
    "If you really want to back the blue, obey the law.?\nThe biggest primary threat to Mr. Cawthorn may come from a state senator, Chuck Edwards, who has the endorsements of most members of the state legislature in the district.",
    "Interviews last week with Republican voters and party leaders in his district  a largely working-class region set amid the beauty of the Blue Ridge Mountains  suggested that his impetuousness is working against him.",
    "On Tuesday, upset House Republicans at a closed-door meeting questioned the remarks, and Representative Kevin McCarthy of California, the House minority leader, told colleagues that he would speak to Mr. Cawthorn.",
    "Mr. Cawthorn has been one of the House's top fund-raisers, pulling in $2.8 million in 2021 thanks to a national donor base, but he has also spent prodigiously, with more than half going toward fund-raising.",
    "I voted for Madison, but I think I'll pass now because of integrity issues,'' said John Harper, a retired furniture finisher in Franklin, N.C., at a Republican event in Mr. Cawthorn's district last week.",
    "Cawthorn is right on the bubble of the 50 percent mark; incumbents who slip below that during the campaign are in danger,'' wrote Glen Bolger, a top Republican pollster who conducted the poll.",
    "His meteoric rise began with his defeat of a primary candidate handpicked to fill the seat held by former Representative Mark Meadows, who was appointed Mr. Trump's White House chief of staff.",
    "Well before Mr. Cawthorn's latest episode, his youthful brashness  which once appealed to the conservative older voters of far-west North Carolina  struck some as reckless and immature.",
    "His comments about Ukraine ushered in more open criticism, including from Senator Thom Tillis and the State House speaker, Tim Moore, who called him reckless? in The News & Observer.",
    "Chelsea Walsh, a life insurance agent who volunteered for Mr. Cawthorn in 2020 but said she is open to other candidates now, predicted a runoff between Mr. Cawthorn and Mr. Edwards.",
    "I believe he probably has lost most of the local-level Republican movers and shakers,'' said David Baker, a voter who attended a recent Republican convention in Jackson County.",
    "Luke Ball, a spokesman for Mr. Cawthorn, predicted that Mr. Cawthorn would easily win the primary and suggested that voters at the district gatherings were unrepresentative.",
    "People of western North Carolina are tired of the antics,'' said Michele Woodhouse, the elected Republican chair of Mr. Cawthorn's district and a former staunch supporter.",
    "During the 2020 campaign, a group of alumni of Patrick Henry College, which Mr. Cawthorn briefly attended, accused him of sexually predatory behavior,'' which he denied.",
    "events are affiliated with Congressman Cawthorn's primary opponents and have welcomed the opportunity to slight Mr. Cawthorn's service and candidacy,'' Mr. Ball said.",
    "The congressman, who declined repeated requests for an interview, seemed to acknowledge some of the doubts about him at a debate in Henderson County on Saturday.",
    "Mr. Cawthorn, who has used a wheelchair since being injured in an automobile accident when he was 18, was charged this month with driving with a revoked license.",
    "Mr. Edwards, the owner of several McDonald's franchises, had more than $300,000 in his campaign account at the end of last year, more than Mr. Cawthorn reported.",
    "It would require you to go back to work to collect your Social Security.?\nMr. Cawthorn responded that he wants to cut wasteful? spending but not Social Security.",
    "I won't be fooled again.?\nMr. Cawthorn, 26, called President Volodymyr Zelensky of Ukraine a thug? and his country incredibly evil? as Russian tanks rolled in.",
    "Mr. McCarthy, who aspires to be House speaker, acted only after declining to discipline other members for norm-shattering behavior and accusations.",
    "He spent $28,000 on campaign air travel and $11,000 at a Waldorf Astoria hotel in Orlando, according to an analysis by The Asheville Citizen Times.",
    "To prevail in the primary on May 17, a candidate must win with more than 30 percent of the vote; if not, the top two finishers will face a runoff.",
    "The leading Democrat in the race, Jasmine Beach-Ferrara, is considered a long shot in a district that Mr. Trump won by 10 percentage points.",
    "Days after being sworn in, Mr. Cawthorn addressed the rally behind the White House on Jan. 6 that preceded the violent siege of the Capitol.",
    "Obviously when it comes to driving, I've got some work to do.''\nThe audience, largely voters with gray hair, laughed, and some applauded.",
    "The minority leader said that he told the freshman congressman that he had lost trust in him and that he needed to turn his life around.",
    "Mr. Cawthorn did himself no favors last year when he announced he would run in a new district near Charlotte, the state's largest city.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "The congressman has made headlines for bringing a knife to a school board meeting and bringing a gun through airport security.",
    "But then legal challenges led to a redrawn state congressional map, and Mr. Cawthorn's planned new district tilted Democratic.",
    "Political insiders speculated that he sought a higher profile in a major media market ahead of an eventual statewide run.",
    "Jennifer Cook, a nurse in Macon County, attended one such gathering to support her husband, who is running for sheriff.",
    "He suggested during the campaign that his 2014 auto accident had derailed? his plans to attend the Naval Academy.",
    "I'll be the first to admit, 26 years old, I don't have all the wisdom in the world,'' he told the crowd.",
    "There is broad speculation over whether Mr. Cawthorn, even as the front-runner, can surpass 30 percent.",
    "So he returned home to his old district, where viable contenders had joined the race in his absence.",
    "In the past, North Carolina's Republican officials largely held their tongues about Mr. Cawthorn.",
    "Madison has disappointed me in his actions on many things since he was elected,'' Ms. Cook said.",
    "Afterward, Mr. McCarthy told reporters that Mr. Cawthorn admitted the allegations were untrue.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Reporting showed that his Annapolis application had already been rejected before the crash.",
    "Still, whether his rivals can pull down his support to such a threshold remains to be seen.",
    "He says he backs the blue, but what he does is, he backs them in a corner with his antics.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "She said she voted for Mr. Cawthorn in 2020 but has no plans to do it again.",
    "If I had to pick, I would say Madison is still the front-runner,'' she said.",
    "But he has his work cut out for him.?\nAnnie Karni contributed reporting.",
    "He has a May court date on the misdemeanor count that carries jail time.",
    "He amplified false conspiracies of fraud in the presidential election.",
    "Now she is running against him in the primary in May.",
    "Here are the four incumbents most at risk.",
    "Go read it,'' he told the audience.",
    "See the full primary calendar.",
    "Some attending local G.O.P.",
    "On Wednesday, he did so.",
    "I was fooled last time."
  ]
}