{
  "id": 2989,
  "mediaId": 209,
  "date": "3/11/2022 12:00:00 AM",
  "headline": "Cawthorn primary challengers respond after lawmaker calls Zelensky 'a thug'",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1646941938/GettyImages-1327882915.jpg",
  "link": "https://theweek.com/russo-ukrainian-war/1011166/cawthorn-primary-challengers-respond-after-lawmaker-calls-zelensky-a",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    2303,
    667,
    667,
    1969,
    2303,
    1969,
    600,
    600,
    525,
    525,
    2834,
    2945,
    2945,
    2834,
    2876,
    2876
  ],
  "sentences": [
    "A spokesperson for Cawthorn said the lawmaker was \"expressing his displeasure at how foreign leaders, including Zelensky, had recently used false propaganda to entice America into becoming involved in an overseas conflict,\" per the Post.",
    "Cawthorn supports both Ukraine and Zelensky in their defense of Russian aggression, \"but does not want America drawn into another conflict through emotional manipulation,\" the spokesperson continued.",
    "And on Thursday, Raleigh-based TV station WRAL shared a video in which Cawthorn, who is seeking re-election, called Ukrainian President Volodymyr Zelensky \"a thug,\" The Washington Post reports.",
    "We must unite as a nation to pray for President Zelensky and the brave people of Ukraine who are fighting for their lives and their freedom,\" said candidate and state Sen. Chuck Edwards.",
    "Cawthorn tweeted out a similar message on Thursday, linking \"to a blog detailing some pro-Ukraine misinformation being spread online,\" writes the Post.",
    "Another opponent, Michele Woodhouse, told WRAL that Zelensky is \"a hero\" and said Cawthorn's comments were \"boorish,\" per Raleigh News & Observer.",
    "\"Remember that the Ukrainian government is incredibly corrupt, and it is incredibly evil, and it has been pushing woke ideologies,\" he continues.",
    "The comments were first reported Wednesday night in a Wall Street Journal op-ed penned by Republican strategist Karl Rove, the Post notes.",
    "On Wednesday, it was reported that the freshman representative was charged with a misdemeanor for driving with a revoked license.",
    "At least two GOP candidates challenging Hawthorn in his North Carolina primary rose up to criticize his remarks.",
    "Rep. Madison Cawthorn (R-N.C.) is having a moment ... and not exactly a good one.",
    "\"Remember that Zelensky is a thug,\" Cawthorn, 26, says in the video.",
    "\"Anything less is counter to everything we stand for in America.\"",
    "The thug is Vladimir Putin.",
    "\"Let's be clear."
  ]
}