{
  "id": 25614,
  "mediaId": 2572,
  "date": "2022-03-24",
  "headline": "'The Ingraham Angle' on Kamala Harris, Ketanji Brown Jackson",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6952d03d-078f-4bd3-80d1-fbec73c4af17/e26429d0-35fe-4e6d-a52d-cb48e9cfb4eb/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/the-ingraham-angle-on-kamala-harris-ketanji-brown-jackson",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13400,
    13504,
    13764,
    13795,
    13813,
    13830,
    13834,
    13846,
    14313
  ],
  "sentences": [
    "And this is what I will tell you, if he wasn't willing to stand up, posture or act to stop this war from happening, then he's not going to be willing to fight it toe-to-toe, in my opinion, in which case I agree with how he's handling it, which is to let Ukraine find it, say the right things, add the sanctions, and hope for the best, because if you don't have the backbone or even the strategic plan to win a war, don't fight it.",
    "And oh, by the way, I didn't even mention that just a few months ago we had a whistleblower come forward and he had talked about an email he received from the FBI, went out to FBI agents across the country, that says put this threat tag designation, put this label on moms and dads, this whole domestic terrorism concern that Merrick Garland said wasn't happening but sure looks like it is.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "And this is the same FBI that mishandled classified information during the Clinton investigation, the same FBI that spied on President Trump, the same FBI where Inspector General Horowitz has given us report after report that says they are not following the FISA procedures, and now we find out this.",
    "So I think Joe Biden is actually tipping his head to what he is actually trying to accomplish, which is really the abolition of American sovereignty in favor of a lot of these global institutions, which of course, don't care about middle Americans and don't care about the people who live there.",
    "This is something that goes through a lot of areas of criminal law, and I think it's concerning that someone who obviously spent a lot of time considering the sentencing guidelines on the sentencing commission herself seems to be having a view that the judge is constantly departing downward.",
    "It tells you all you need to know, obviously, about Kamala Harris, but it also tells you all you need to know about Joe Biden and then the fact that they're now backstabbing one another inside the White House and trying to pull the rug out from underneath Kamala Harris in the White House.",
    "But he wants to squelch free speech that he disagrees with, and wants to just cover up for the fact that this nominee was picked by a White House Counsel's Office, where guess who works there, someone who came right from one of the main liberal dark money groups that's been pushing her.",
    "PIRRO: And you know what no one brought up today, no one brought up the fact that she was on a sentencing commission, and her judicial philosophy, which she won't talk about, but as it relates to sentencing, is that no first defender in a child porn case should get a mandatory minimum.",
    "But Kate Bedingfield, Biden's comms Director, reportedly had a different take in their new book Martin and Burns write quote \"In private, Bedingfield noted that the vice presidency was not the first time in Harris's political career that she had fallen short of sky-high expectations.",
    "PIRRO: OK.\nGINGRICH: Finally, he ought to go to NATO, and the number one thing they need to agree on is a public explicit commitment that if Putin goes to chemical weapons, they will immediately within a couple of hours do everything they can to destroy that capability.",
    "We'll be able to get the truth to the American people, and that will have an impact on what they decide to do in the 2024 presidential election, because when it comes to holding people accountable, only the executive branch can do that, only the Justice Department.",
    "It's believed that Russia has 2,000 to 3,000 of these what we call small nukes, and President Trump outfitted our submarines with variable nuclear warheads, which means that we could change the size of the blast but the radiation itself would remain at large.",
    "Politico reports, \"The authors recounted a meeting with Congressional Black Caucus leaders in mid-April, in which Biden heaped praise on Harris, but also said he'd given her the important task of handling immigration and that she would do 'a hell of a job'.",
    "You see her 10th person leave her staff, who was by the way, the national security adviser who was with her in Poland, who must have been totally embarrassed and demoralized by watching her break up laughing when talking about the Ukrainian refugees.",
    "PIRRO: The amazing part of it is that they have got this one FBI agent as a relates to the falsifying of the affidavit who was Clinesmith, and he was sentenced to, I think, probation, and he is still in good standing with the bar in Washington.",
    "JONES: The fact we are sitting here in a Tuesday night, two Americans without any viable security clearance to know with the Pentagon is doing, either this administration is so inept that we know what they are doing, or they are doing more.",
    "PIRRO: Well, you know, Kira it's kind of interesting that she's almost an insurance policy for Joe Biden in the sense that no one will talk about the 25th Amendment, or any kind of impeachment, because they know what they're going to get.",
    "He just went on and on about concerns, about the conservative dark money and ignored the fact that the nominee he's looking at, as Senator Graham alluded to, she's the one has been pushed by some of the most extreme dark money groups.",
    "They want to effectively abolish all borders with unchecked immigration, and they want to abolish national economies with nonstop free-trade, which of course shifts our manufacturing base off to China and Mexico and similar countries.",
    "KETANJI BROWN JACKSON, NOMINEE FOR THE SUPREME COURT: I am reluctant to talk about my faith in this way just because I want to be mindful of the need for the public to have confidence in my ability to separate out my personal views.",
    "House Judiciary Republicans are now asking Director Wray to explain why his testimony contradicts a 2019 agency audit that revealed rule breaking by agents who were investigating politicians, candidates, and religious groups.",
    "And one of the things if you really drill into the details of the Biden economic agenda, of the globalist economic agenda, one of the things that you see is it's really good for big tech, it's really good for big finance.",
    "\"Harris dispatched Tina Flournoy to talk to top Biden advisor and Anita Dunn to convey displeasure that White House staff was not standing up for Harris when she entered the room the way they did for the President Biden.",
    "It's one thing, for some federal agency, we don't want any federal agency doing wrong behavior, but it's one thing that some federal agency that no one has ever heard of and they are not exactly following all the rules.",
    "They are paying more for gas, they're paying more for food, and that's hitting a lot of folks, especially if you think about seniors who are living on a fixed income, they cannot handle this additional inflation.",
    "And what's really shocking right there is that quote from Bedingfield, where she's talking about all who've - the - all of the ways that Kamala Harris was a disaster in her Senate office and in the campaign.",
    "My guess is Merrick Garland, the same guy who started this whole thing about spying on parents, the same FBI that has done the things I just talked about, they're not going to be interested in doing that.",
    "(END VIDEO CLIP)\nPIRRO: Is this an adequate explanation, Carrie, for her sentencing many of these child porn possessors to less than the recommended sentence by both of the prosecutor and the guidelines?",
    "Well, if she was uncomfortable with that, where was she and others when they were destroying Amy Coney Barrett, who's a faithful woman, who is a traditional Catholic who - her faith means a lot to her.",
    "The fear is that if Mr. Putin feels cornered in the conflict, he might choose to detonate one of his lesser nuclear arms, breaking the taboo set 76 years ago after the U.S. hit Hiroshima and Nagasaki.",
    "And here's the problem, you can't keep coming in front of Congress and saying everything is wonderful, and then in the report comes a few months later that says it's exactly the opposite of that.",
    "Plus, we have the latest from the ground in Ukraine, including new reports that Ukrainian soldiers are going on the offensive and fears that the use of nuclear weapons is not out of the question.",
    "But it's terrible for American energy production, it's terrible for American manufacturing, it's terrible for frankly most of the economy that the people I want to represent actually rely on.",
    "PIRRO: In addition to punishing them for the economic policies, it doesn't seem like he's interested in doing anything other than kowtowing to other countries, and he doesn't have any ideas.",
    "Aside from an attack on a NATO member country, will it take a chemical attack, a biological attack, a nuclear attack by Russia, even massive civilian casualties to get the West involved?",
    "If we end up three months from now with Zelenskyy agreeing to the same terms that Putin offered two weeks ago, the other things that has changed are tens of thousands of Ukrainians died.",
    "I think when somebody starts killing your women, your children, destroying your cultural heritage, you have a right to defend yourself by taking out their airfields and their missiles.",
    "And I think that's why you're starting to see a real schism among Democrats in Congress, in Washington, who are really frightened by this administration and frightened by the behavior.",
    "SEN. LINDSEY GRAHAM (R-SC): Well, I think what I was asking her questions about her faith and I don't believe for a minute that her faith will determine how she would rule on a case.",
    "And when you watch her day after day, you watch her go to Poland, break up laughing in a press conference with the Polish president, when she's asked about the refugees from Ukraine.",
    "(BEGIN VIDEO CLIP)\nJOE BIDEN, (D) PRESIDENT OF THE UNITED STATES: My mother had an expression, out of everything terrible, something good will come if you look hard enough for it.",
    "(BEGIN VIDEO CLIP)\nSEN. SHELDON WHITEHOUSE (D-RI): That selection process took place out of the public eye and it appears to have been informed heavily by dark money interests.",
    "And the groups that she was representing associated with wanted to destroy the legal regime at Guantanamo Bay that will allow us to hold these terrorists as enemy combatants.",
    "The American public is now looking at this saying, hey, they do whatever they want, but they can monitor the rest of us, break their own rules, and there are no consequences.",
    "Hillary Clinton, her emails where it was her only form of communication, and then she erased them, and they say, don't worry about it, Hillary, but let's spy on Donald Trump.",
    "The second thing, I think you do, is you find somebody, whether it's the Secretary of State, or somebody else who you empower to go around the world and pretend they're you.",
    "The - look, I think we have never seen a national political figure, not just a vice president, but a national political figure, who is as self destructive as Kamala Harris.",
    "Third, Biden ought to say, if Putin is going to engage in a policy of killing civilians then we're going to give surface to surface missiles and cruise missiles to Ukraine.",
    "JACKSON: What I was doing in the context of the habeas petitions at this very early stage in the process was making allegations to preserve issues on behalf of my clients.",
    "The statute says, calculate the guidelines, but also look at various aspects of this offense and impose a sentence that is 'sufficient but not greater than necessary.'",
    "The Senate's resident conspiracy theorist Democrats Sheldon Whitehouse used his time during today's confirmation hearing to insult this show as well as my next guest.",
    "But if we get President Trump back in the White House, which is what I hope happens, and we get the right attorney general, maybe then we can hold people accountable.",
    "\"Some of Harris's advisers believes the President's almost entirely white inner - White House inner circle did not show the vice president the respect she deserved.\"",
    "And he - groups that have spent orders of magnitude more than our organization, and groups that are linked to people that he actually receives money from himself.",
    "The cackling about Ukrainian refugees, the correcting Joe Biden about immigration, the refusal to go to the border, the refusal to fix the problem, for example.",
    "That falls back to the west and our government for not having a better plan in place and understanding both of these forces at war better before this started.",
    "Here's Laura Ingraham on Fox News, concerned about abortion cases coming up before the court after all the money that's been raised, the Federalist Society.",
    "Top House Judiciary Republicans are alleging that FBI Director Chris Wray might have lied to their committee last year about rule breaking by his agents.",
    "But I'm beginning to think that she's like Spiro Agnew, who turned out to be so bad that when he got replaced, it set the stage for Nixon to be replaced.",
    "But Senator Cotton started to bring this out in some of his questions, and I think we'll probably hear more about it in tomorrow's questioning as well.",
    "We are at an inflection point, I believe, in the world economy -- not just the world economy, the world -- that occurs every three or four generations.",
    "And it's been pointed out that when she is considering those factors as a judge, those factors are already taken into consideration by the guidelines.",
    "GINGRICH: Well, look, I think the first thing he ought to do is make sure that there are anti-ship missiles that are being sent to Ukraine right now.",
    "And frankly, as a black woman, I think she's an embarrassment to the legacy of what it's supposed to mean, to be the first woman of color in office.",
    "And as clashes continue here, President Biden heading to Europe on Wednesday, NATO G7, EU on Thursday, Poland Capitol and officials there on Friday.",
    "Anything that the New York Times reports for the rest of history, I automatically doubt and presume that it's made up because that's what they do.",
    "And while speaking at a Business Roundtable meeting, Joe Biden let slip a disturbing phrase that at least for this show raised serious red flags.",
    "I'm here standing here on the northern flank, on the eastern flank talking about what we have in terms of the eastern flank and our NATO allies.",
    "in terms of how we are going to affect the banking system and implement our sanctions, some of which don't even go into effect until June 24th.",
    "Is there another person that they would pull up in front of the nation to at least deliver on some of the issues Americans want to hear about?",
    "She actually participated in three briefs by liberal organization's amicus briefs that accused the Bush administration of being war criminals.",
    "Joining me now, is Charlie Hurt, Washington Times opinion editor and Fox News contributor; also here is Kira Davis, editor-at-large Red State.",
    "The Vice President actually corrects him at once, the author's report, 'Excuse me', she said, 'It's the Northern Triangle, not immigration'.\"",
    "If - she's a vice president, what could this president - forget that he's Biden, what would any president with a vice president like that do?",
    "JUDGE JEANINE PIRRO, FOX NEWS HOST: I'm Judge Jeanine Pirro in for Laura Ingraham and this is THE INGRAHAM ANGLE from New York City tonight.",
    "GINGRICH: Well, I mean, the first thing you do is you send her to the Naval Observatory, which is the home of the--\nPIRRO: Where she lives.",
    "And one of the things that Biden said when he was running for president is that he would return civility and normalcy back to the country.",
    "And I thought that she was an insurance policy to make sure that nobody tried to replace Biden, no matter how bad his cognitive problems.",
    "This is - the catastrophes that we're witnessing domestically in this country right now have nothing to do with Republicans or Democrats.",
    "This, however, is the key port city of Mariupol, which we've been telling you about for days continues to get bombarded by the Russians.",
    "And that we believe you, Amy Coney Barrett, that the dogma lives loudly within you and that question is your ability to be a fair judge.",
    "SEVERINO: This is actually an issue that goes well beyond even just the child porn cases that were discussed that are disturbing enough.",
    "I think about where we were three, four years ago with gas reasonable, able to provide, people were able to provide for their families.",
    "And we've seen a lot of payback from this administration in terms of picking judicial nominees that feed into this dark money network.",
    "A new book by New York Times reporters Jonathan Martin and Alex Burns reveals the growing tensions between the Biden and Harris camps.",
    "But just on this topic of escalating, or as the Russians say, escalate to deescalate, I would imagine bio or chem weapons come first.",
    "So I don't buy the idea that she wasn't an activist when it came to changing the legal regime that protected this nation since 9/11.",
    "I mean, imagine what Michelle and Barack Obama had to put up with now that we've seen Joe Biden when he could really speak his mind.",
    "PIRRO: You know, Newt, I want to get your sense of what you think President Biden will accomplish when he goes to Europe this week.",
    "Second, I want to know whether or not the high-altitude anti-aircraft missiles, which Biden promised last week, are now in Ukraine.",
    "How could a lawyer accuse the President of United States and the Secretary of Defense of being a war criminal and not remember it?",
    "We had something called a Davy Crockett nuke that yield 0.078 kilotons, just fraction of Hiroshima, and we had those in the 1950s.",
    "One reason we have turned towards tactical nukes is they are less regulated in our attempt to a prohibition over nuclear warheads.",
    "But to play it the way they are, I don't know that Vladimir Putin is going to need to use nuclear weapons, to be honest with you.",
    "JOHNNY \"JOEY\" JONES (RET), U.S. MARINES BOMB TECHNICIAN: The first thing to talk about here is this has been around for decades.",
    "GRAHAM: Well, how would you feel if a senator up here said your faith, that dogma lives loudly within you and that's of concern?",
    "The difference between how a warhead goes off, which is the bomb part, and how you deliver it are the generational divide here.",
    "(BEGIN VIDEO CLIP)\nHARRIS: Well, I mean, listen - I - this is going to sound immodest, but I'm obviously a top tier candidate.",
    "We don't investigate people for his speech, for association, for assembly, for membership in domestic First Amendment groups.",
    "We should give Joe Biden a little bit of credit here, and that phrase has been bouncing around left-wing circles for a while.",
    "Accusations that the Democrats withheld important documents from Jackson's past on some of her most controversial beliefs.",
    "But I will say that--\nGRAHAM: You believe that's true that America was acting as war criminals in holding these detainees?",
    "(BEGIN VIDEO CLIP)\nGRAHAM: Did you ever accuse anyone of your habeas petitions, the government of acting as war criminals?",
    "Because we have the ability to see what can be unburdened by what has been, and then to make the possible actually happen.",
    "Because when she was a lawyer, not only did she represent for Gitmo defendants as a public defender, which I'm fine with.",
    "And Ukrainians ought to be basically destroying the Russian Sixth Fleet - sixth - the Black Sea Fleet, which we could do.",
    "(COMMERCIAL BREAK)\nPIRRO: Just when you thought Dems couldn't have been more revolting in today's hearing, this happened.",
    "\"The Washington Post\" reports \"Food bank officials are reporting growing lines at their distribution centers nationwide.",
    "We're going to have a full analysis in moments, including why she recommended lenient sentences for child sex predators.",
    "Ukrainian President Zelenskyy out in front again, this time via video link to Italy's Parliament calling for more help.",
    "\"The New York Times\" reports today, both Russia and the United States have nuclear arms that are much less destructive.",
    "The question though, Judge, is what will it take for the U.S. to do more for Ukraine, for NATO to do more for Ukraine?",
    "So when you put all this together, this is why we are concerned and we want to see that audit in its unredacted form.",
    "And you should think about the argument that they made as well, he was mean on Twitter, he was mean on social media.",
    "Ohio Congressman Jim Jordan, ranking member of House Judiciary, is right in the middle of all this and joins me now.",
    "After Harris's disastrous and frankly embarrassing trip to Eastern Europe last week, who could blame Ms. McEldowney.",
    "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nCHRISTOPHER WRAY, FBI DIRECTOR: We do not investigate First Amendment groups.",
    "He doesn't care about a big chunk of his own country, and I think he's punishing them with these economic policies.",
    "JORDAN: What we can do about it is put Republicans back in charge, then we will be able to get all the information.",
    "Let's hope that come this fall they're going to start that process and put Republicans back in charge of Congress.",
    "I mean, it's bad enough to think about Biden being President, when he's clearly not totally in touch with reality.",
    "But first, is it any surprise that the country's a mess when Biden can't even keep his own White House in order?",
    "I'm not going to armchair quarterback the president in the middle of it, because I don't know what I don't know.",
    "All of this is to say we don't have a clue if Vladimir Putin is going to use one or what our reaction would be.",
    "UNIDENTIFIED MALE: I welcome everyone to this confirmation hearing on the nomination of--\nHARRIS: Mr. Chairman.",
    "So we are simply saying give us the unredacted, give us the full audit of what this investigation really said.",
    "So he pretends that there's no connection there, but they have a huge amount of influence in the White House.",
    "So I don't know if he hoped that she would be better, or if they were just setting her up to be the fall guy.",
    "But the fact is, when you watch the Black Sea Fleet of the Russian Navy start to bombard the Ukrainian coast.",
    "So he really isn't opposed to dark money, per se, or 501(c)(4) organizations, as I would like to call them.",
    "This is the Federal Bureau of Investigation, part of the Justice Department, not following their own rules.",
    "In early February, 10 percent of those polled said their household sometimes it doesn't have enough to eat.",
    "PIRRO: OK. And Judge Brown Jackson responded to criticisms about her light sentences in child porn cases.",
    "Well, you know, Senator Whitehouse delivered some really top shelf gaslighting today during his hearing.",
    "Carrie Severino, president of Judicial Crisis Network and former Supreme Court clerk for Justice Thomas.",
    "Because I think most Americans realize that the prospect of her being President is genuinely terrifying.",
    "Day two of the Ketanji Brown Jackson's Supreme Court confirmation hearing is still ongoing at this hour.",
    "(COMMERCIAL BREAK)\nPIRRO: Day two of Judge Ketanji Brown Jackson's confirmation ended just moments ago.",
    "(BEGIN VIDEO CLIP)\nSEN. LINDSEY GRAHAM (R-SC): How faithful would you say you are in terms of religion?",
    "PIRRO: And the amazing part of it is he thinks this new world order with the United States at the head.",
    "(COMMERCIAL BREAK)\nPIRRO: Now a truly frightening prospect, Ukraine turning into a nuclear battlefield.",
    "PIRRO: But what about giving them the S-300 or the Patriot or the Iron Dome, a missile defense system?",
    "Let's go now to Ukraine, where Ukrainian troops are actually making some gains against Russian forces.",
    "Fox News Senior Foreign Affairs correspondent Greg Palkot is standing by now in Lviv with the latest.",
    "Congress has decided what it is that a judge has to do in this and any other case when they sentence.",
    "(END VIDEO CLIP)\nPIRRO: Let's face it, Kamala was a disaster even before she entered the White House.",
    "(BEGIN VIDEO CLIP)\nRACHEL MADDOW, MSNBC HOST: It has been only a year since Kavanaugh's confirmation.",
    "I mean, of all the things that she's worried about, people standing up when she walks into the room.",
    "Senator, Judge Jackson seems to imply that being openly religious somehow taints the judge's status?",
    "Joey, \"The Times\" suggests the risk of these less destructive nukes being used is small but growing.",
    "(END VIDEO CLIP)\nPIRRO: Joining us now is Senator Lindsey Graham of the Senate Judiciary Committee.",
    "Well, why does demand justice in every other nutjob liberal group want her more than anybody else?",
    "And I think it is a dramatic wound to our position in the world to have Kamala Harris go anywhere.",
    "Are the American people just left with the belief that there is nothing we can do about this this?",
    "PIRRO: We'll see what happens, but in the meantime, they are getting away with it left and right.",
    "(END VIDEO CLIP)\nPIRRO: Senator, Brown Jackson repeatedly stated how much she loves this country.",
    "Talking about the significance of the passage of time by the significance of the passage of time.",
    "But knowing politicians, knowing Joe Biden, knowing Kamala Harris, I believe every word of this.",
    "Tells you all you need to know about the people that Joe Biden hires and surrounds himself with.",
    "(BEGIN VIDEO CLIP)\nKAMALA HARRIS, VICE PRESIDENT OF THE UNITED STATES: What do you want to know?",
    "And yes, some new gains being made by the Ukrainian forces against that much bigger Russian foe.",
    "About 100 bombs and missiles hitting there each day, some even coming from ships off the coast.",
    "You have people all around the world watching the United States be humiliatingly incompetent.",
    "We don't have to accept some deal where the Russians get to fight, while Russia remains safe.",
    "So the sensitive investigative matters, they have a set of rules they are supposed to follow.",
    "This is sensitive investigative matters, so this is a matter that impact the First Amendment.",
    "Plus, news tonight that the Democrats actually hid information on the judge from Republicans.",
    "And so if this administration was going to prevent this war, I would have supported it fully.",
    "It's one of the biggest kept secrets of our Defense Department is what are nuclear plant is.",
    "I mean, I've often wondered what going on behind closed doors with the Obama administration.",
    "(BEGIN VIDEO CLIP)\nJACKSON: There's a statute that tells judges what they're supposed to do.",
    "So they can hit Russian airfields and Russian missile bases that are firing into civilians.",
    "But this line of questioning from my next guest, expose the utter hypocrisy from Democrats.",
    "A key suburb west of the capital Kyiv taken in a counter offensive by the Ukrainian forces.",
    "(END VIDEO CLIP)\nPIRRO: Now, she's bringing the same energy to the Vice President's office.",
    "Joining me now is Joey Jones, retired U.S. Marine bomb technician and FOX News contributor.",
    "It's a little bit misleading when they talk about these as if they are some new invention.",
    "Catch me weekdays on \"THE FIVE\" and go to Cameo.com/JudgeJeanine for a personalized video.",
    "UNIDENTIFIED FEMALE: I want to give you the--\nHARRIS: A friend in need is a friend indeed.",
    "And I think people on both sides of the ideological fence can agree, this woman is a mess.",
    "I mean - and that's saying something when the President of the United States is Joe Biden.",
    "But joining me now is Newt Gingrich, Fox News contributor and former Speaker of the House.",
    "(END VIDEO CLIP)\nPIRRO: Was the FBI director lying when he told Congress this last summer?",
    "REP. JIM JORDAN, (R-OH) HOUSE JUDICIARY COMMITTEE RANKING MEMBER: No, they haven't, Judge.",
    "VANCE: It's truly heartbreaking, and I hear about this all the time when I'm on the trail.",
    "And for him to say he is going to lead, even in terms of Russia we have to follow the E.U.",
    "President Trump predicted that this would happen, he predicted the inflation would go up.",
    "But the point I'm trying to make is Judge Jackson said basically, I call it as I see it.",
    "And we brought those down from 1,000 to about 200, and they are scattered around Europe.",
    "I think this presents us with some significant opportunities to make some real changes.",
    "But it's just another sign of how completely chaotic and insane this administration is.",
    "(END VIDEO CLIP)\nPIRRO: And our failed presidential campaign was an even bigger fiasco.",
    "CHARLIE HURT, WASHINGTON TIMES OPINION EDITOR: I think that's a very fair assessment.",
    "I'll never hold it against a lawyer for representing somebody that no one else likes.",
    "One foot in and one foot out for 20 years in Afghanistan yielded no tangible results.",
    "That uptick is more significant with households with children rising to 13 percent.\"",
    "And so it's not surprising that Biden's economy has been terrible for those people.",
    "GRAHAM: Equivalent in the Air Force, you take the clients that come in your office.",
    "But the result is that, she's actually an embarrassment on the international scene.",
    "PIRRO: It doesn't look like an iron domain placed there in any way, shape, or form.",
    "Her Senate office had been messy, and her presidential campaign had been a fiasco.",
    "And - but, Charlie, speaking of the border, here's another excerpt from the book.",
    "(BEGIN VIDEO CLIP)\n(INAUDIBLE)\n(END VIDEO CLIP)\nPIRRO: Five-second rule, I guess.",
    "And it turns out, the source of much of the dysfunction seems to be this person.",
    "And you offer her books and movies and video games, but you don't let her leave.",
    "(END VIDEO CLIP)\nPIRRO: So Carrie, you were in the room when he said this today.",
    "And unfortunately, the Federalist Society was not alone right down the hallway.",
    "I think that a lot of Americans right now would love to have Donald Trump back.",
    "But the idea of being replaced by Kamala, I think is astonishingly frightening.",
    "I wasn't sure that now you're going to show some of how Kamala is unbelievable.",
    "So Ukraine is a country in Europe exists next to another country called Russia.",
    "So when you think about it, there is great significance to the passage of time.",
    "(END VIDEO CLIP)\nPIRRO: And the passage of time hasn't been kind to her office.",
    "KIRA DAVIS, \"JUST LISTEN TO YOURSELF\" PODCAST: I swear, Jeanine, this is Veep.",
    "(BEGIN VIDEO CLIP)\nHARRIS: We've been to the border, we've been to the border.",
    "Yes, some air raid sirens here in Lviv, but a lot of noise across the country.",
    "So she is kind of doubling considering anything that would lower the sentence.",
    "The fact that we're sitting here --\nPIRRO: Does it look like we are not, Joey?",
    "And so the technology going into nuclear warheads is continuing to be ongoing.",
    "You can see that leading into this fight and you can see it during the fight.",
    "We've got to bow to dictatorial countries to try to get them to give us oil.",
    "PIRRO: But what can you do once you get the audit in the non-redacted form?",
    "And, of course, obviously, we have to take everything with a grain of salt.",
    "There's going to be a new world order out there, and we've got to lead it.",
    "VANCE, (R) OHIO SENATE CANDIDATE: Maybe he actually exactly what he meant.",
    "We'll hear about new rapid response forces, more Military aid for Ukraine.",
    "I don't know what they are doing, but this is what I will tell you, Judge.",
    "We have lots of missiles, which are capable of destroying those warships.",
    "I'd take $2 a gallon gas right now with the few mean tweets on top of it.",
    "The most recent of which was National Security Adviser Nancy McEldowney.",
    "All of these things are - and you're starting to see rats jump the ship.",
    "Kira, this seems to imply that team Kamala thinks that Biden is racist?",
    "Perhaps, she suggested the problem was not the vice president's staff.\"",
    "And so I did expect that I would be on the stage and take hits tonight.",
    "They wanted to treat them as common criminals, try them or let them go.",
    "A lot of goods were reasonably priced, and a lot of wages were rising.",
    "Kira, the easiest way to lose respect is to so pathetically demand it.",
    "How about all of those promises you made to your constituents running?",
    "But, Senator, you also asked Judge Brown Jackson something troubling.",
    "Politico reports, the book also reveals this bit of palace intrigue.",
    "This is a rush transcript of \"The Ingraham Angle\" on March 22, 2022.",
    "She said in the past about her time defending Guantanamo detainees.",
    "So she was uncomfortable with me asking about how faithful she was.",
    "So this idea, she's a neutral observer of the law, not an activist.",
    "Oh, eventually there'll be sanctions, eventually will do something.",
    "And I have a hunch that she's on a very, very short fuse right now.",
    "GINGRICH: And you say, please don't leave for the next three years.",
    "Copy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "And I think that is where we are with our current administration.",
    "I mean, it is - people need to realize, this isn't just politics.",
    "Rates of reported hunger have been increasing since early August.",
    "Congressman Jim Jordan, thanks so much for being with us tonight.",
    "Carey, let's show our viewers what Senator Whitehouse said today.",
    "What we do do is investigate individuals with proper predication.",
    "And Kamala's main priority is, are people standing enough for me?",
    "And I think that - and I think Kira is exactly right about this.",
    "The warheads have a similar yield that they've had for 50 years.",
    "And in moments we tackle a frightening question out of Ukraine.",
    "NEWT GINGRICH, FORMER HOUSE SPEAKER: Well, look - yes, I could.",
    "But you don't allow her ever again to leave the United States.",
    "Senator Lindsey Graham and Carrie Severino have reaction next.",
    "Congressman Jim Jordan is here next with the alarming details.",
    "GREG PALKOT, SENIOR FOREIGN AFFAIRS CORRESPONDENT: Hi, Judge.",
    "But what I can tell you is this -- they are leveling Ukraine.",
    "These are the same players whether you get the audit or not.",
    "In particular, it means two things to a lot of these people.",
    "It's all about what the American people do on Election Day.",
    "He even pitched to Pope Francis to help mediate this thing.",
    "Charlie and Kira, thanks so much for being with us tonight.",
    "I found it offensive when they said it about Judge Barrett.",
    "They are, quite frankly, bizarre behavior of Kamala Harris.",
    "Here's another excerpt from the book according to Politico.",
    "She lost 10 high profile staffers in the last nine months.",
    "Russia decided to invade a smaller country called Ukraine.",
    "This copy may not be in its final form and may be updated.",
    "HARRIS: I was a part of that hearing and - a sham process.",
    "Russia is a bigger country, Russia is a powerful country.",
    "We'll be able to subpoena people if, in fact, we have to.",
    "Vance is running for Senate in Ohio, and he joins us now.",
    "And we can't have an administration playing war that way.",
    "This report says they weren't following their own rules.",
    "CARRIE SEVERINO, JUDICIAL CRISIS NETWORK PRESIDENT: Yes.",
    "DAVIS: I mean, I think Biden maybe has some race issues.",
    "Are people respecting me enough when I walk in the room?",
    "Is Kamala's biggest problem the fact that she's Kamala?",
    "Anyway, J.D., thanks so much for being with us tonight.",
    "They basically said that your faith is too much for us.",
    "100,000 are now thought to be trapped inside that city.",
    "But I don't think race is an issue here, to be honest.",
    "And we'll check back in with you later on in the show.",
    "That's what's being wrestled with at this very moment.",
    "JACKSON: Senator, I'm--\nGRAHAM: I would if I were you.",
    "J.D., why would he use that phrase, \"new world order\"?",
    "So Carrie, very interesting, very interesting answers.",
    "HARRIS: We cannot possibly move forward, Mr. Chairman.",
    "And somehow they managed to get something right here.",
    "PIRRO: Well, she's a mess and she's an embarrassment.",
    "There's something called the Judicial Crisis Network.",
    "But the Ukrainians are only allowed to be on defense.",
    "And they ought to all be in the hands of Ukrainians.",
    "I don't make up the law, apply the facts in the law.",
    "Newt, we'll get your thoughts on Ukraine in moments.",
    "Russian troops are said to be demoralized, weakened.",
    "J.D., this is a truly underreported and scary issue.",
    "The Vice President took it as a sign of disrespect.\"",
    "Whether you like that or hate that, it's consistent.",
    "Is he afraid Putin is going to say that's offensive?",
    "And yet Joe Biden picked her as his vice president.",
    "Could nuclear weapons be coming to the battlefield?",
    "The United States, we can't even do our own energy.",
    "I've never seen anyone worse at their job than her.",
    "But first, let's go back to Biden's Kamala problem.",
    "And it has a particular ideology behind it, Judge.",
    "Congressman, has the FBI responded to you tonight?",
    "UNIDENTIFIED MALE: You haven't been to the border.",
    "I mean, it's an embarrassment all the way around.",
    "Because I think most Americans are uncomfortable.",
    "PIRRO: Listen, Joey, I can't agree with you more.",
    "But that doesn't square with what we just heard.",
    "There should be no confusion about none of this.",
    "And day two of Ketanji Brown Jackson's hearing.",
    "Senator Lindsey Graham has reaction in moments.",
    "Harris's team is apparently bent out of shape.",
    "Could she judge somebody of a different faith?",
    "What they did to Judge Barrett was despicable.",
    "I just don't think you can get away from that.",
    "Her potential 2024 rivals must be loving this.",
    "JONES: And here's an issue that I see as well.",
    "I'm Judge Jeanine Pirro in for Laura Ingraham.",
    "Listen, have you ever been a public defender?",
    "It's still the same people running the joint.",
    "People really are paying more for everything.",
    "The Biden dumped impossible tests on her lap.",
    "So they didn't even follow their own rules.",
    "I did believe that about Amy Coney Barrett.",
    "JACKSON: I don't remember that accusation.",
    "We are on the brink of survival, he said.",
    "Now is the time when things are shifting.",
    "Oh, we're going to forgive student loans.",
    "The (inaudible) character and Veep to do.",
    "Tonight's Last Bite is an unsanitary one.",
    "Charlie, this woman is an embarrassment.",
    "UNIDENTIFIED MALE: You're out of order.",
    "I've not heard anybody talk about this.",
    "President Biden is a bit of a war dove.",
    "There are definitely new enhancements.",
    "There were a lot of revealing moments.",
    "And you watch other things she's done.",
    "Oh, we're going to bring back America.",
    "So she's like a real insurance policy.",
    "But the dysfunction doesn't end there.",
    "UNIDENTIFIED MALE: --Brett Kavanaugh.",
    "HARRIS: And I haven't been to Europe.",
    "Soft fireworks erupting late tonight.",
    "in terms of sanction, follow the E.U.",
    "I think most Americans agree with me.",
    "That's a bias in one direction only.",
    "Her Senate career was a train wreck.",
    "This is exactly what I would expect.",
    "It's tragic, it's absolutely tragic.",
    "We'll hear about troop deployments.",
    "They should go at him immediately.",
    "Now we're the highest in 40 years.",
    "How much more do you need to say?",
    "Thanks for being with us tonight.",
    "What do you do in this situation?",
    "PIRRO: Newt, let me ask you this.",
    "We don't know what they're doing.",
    "That is where my ire is pointed.",
    "Greg Gutfeld takes it from here.",
    "Kirby alluded to that yesterday.",
    "It's not passing the smell test.",
    "This could be political figures.",
    "So I believe every word of this.",
    "Senator Graham, thanks so much.",
    "And that's part of the problem.",
    "JONES: We don't know we're not.",
    "They are leveling that country.",
    "What is the problem with that?",
    "All these big fat cat dinners.",
    "GRAHAM: Well, here's my point.",
    "She is a terrible politician.",
    "You're going to vote for her?",
    "That is how our system works.",
    "VANCE: That is exactly right.",
    "(END VIDEO CLIP)\nPIRRO: J.D.",
    "And understand what this is.",
    "She's not a good politician.",
    "PIRRO: Very dangerous times.",
    "Greg Palkot, thanks so much.",
    "GINGRICH: --vice president.",
    "We'll hear about sanctions.",
    "So this is the same agency.",
    "31 percent recidivism rate.",
    "Senator, one last question.",
    "PIRRO: There's no question.",
    "So basically, that's wrong.",
    "It's absolutely ridiculous.",
    "Everything sucks right now.",
    "I can tell you this, Judge.",
    "You'll see why in moments.",
    "This is Veep in real life.",
    "But take a listen to this.",
    "This could be candidates.",
    "This is religious groups.",
    "Lot of loss of equipment.",
    "HURT: Yes, she really is.",
    "That's it for us tonight.",
    "We don't know we're not.",
    "Everybody is feeling it.",
    "I was a public defender.",
    "I think it's by design.",
    "He is just not leading.",
    "The details in moments.",
    "PIRRO: All right, Kira.",
    "Charlie, is that right?",
    "We know that about him.",
    "PIRRO: Got to go, Joey.",
    "What is your reaction?",
    "What else do you need?",
    "We want to look at it.",
    "We have that capacity.",
    "Newt, thanks so much.",
    "How about the border?",
    "HARRIS: Mr. Chairman.",
    "Everything is worse.",
    "It's not just funny.",
    "I'm not an activist.",
    "PIRRO: Agree, agree.",
    "Injury toll is high.",
    "But this is the FBI.",
    "PIRRO: Right, right.",
    "Thanks for watching.",
    "ALL RIGHTS RESERVED.",
    "GRAHAM: Stay tuned.",
    "Death toll is high.",
    "Everybody knows it.",
    "But one last thing.",
    "PIRRO: All right.",
    "PIRRO: All right.",
    "Stay right there.",
    "He's not leading.",
    "Can you hear me?",
    "I have no idea.",
    "Thanks so much.",
    "JONES: I agree.",
    "JORDAN: Right.",
    "Your response?",
    "I'll proceed.",
    "Take a look.",
    "Back to you.",
    "Take a look.",
    "Stay there.",
    "PIRRO: Yes.",
    "All right.",
    "PIRRO: No.",
    "PIRRO: OK.",
    "All right.",
    "Greg?",
    "J.D.",
    "SGT."
  ]
}