{
  "id": 25647,
  "mediaId": 2572,
  "date": "2022-02-07",
  "headline": "Trump 2020 campaign manager takes sides in Ohio’s GOP Senate showdown",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Mike-Gibbons.jpg",
  "link": "https://www.foxnews.com/politics/trump-2020-campaign-manager-takes-sides-in-ohios-gop-senate-showdown",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    13469,
    13592,
    13809,
    13942,
    13203,
    13312,
    13372,
    14243,
    14317
  ],
  "sentences": [
    "THE FRENZY TO LAND TRUMP'S ENDORSEMENT FUELS OHIO'S GOP SENATE PRIMARY\nGibbons, a Cleveland entrepreneur, real estate developer, and investment banker and a 2018 Ohio Republican Senate candidate, is one of the leading candidates in a GOP race that’s become a battle by most of the major contenders to showcase their support for Donald Trump hopes of securing the former president’s endorsement.",
    "Moreno had shelled out over $4 million of his own money the past two months to run TV commercials to try and boost his Senate bid,\nAs with other high-profile statewide Republican primary battles across the country in the 2022 election cycle, Trump campaign and White House alumni are on different sides in the Ohio race.",
    "Chris Christie’s successful gubernatorial election and reelection campaigns, served as national field director on Trump’s 2016 presidential campaign, political director at the Trump White House, and took over as the then-president’s campaign manager in June 2020.",
    "EXCLUSIVE - Bill Stepien, who served as former President Donald Trump’s campaign manager during the summer and autumn of 2020, is jumping into Ohio’s crowded and contentious Republican Senate primary in the race to succeed retiring GOP Sen.",
    "The other major contenders in the packed field of GOP Senate contenders includes former Ohio treasurer and former two-time Senate candidate Josh Mandel; former Ohio GOP chair Jane Timken; best-selling author and venture capitalist J.D.",
    "A source close to Gibbons’ orbit says that now that the candidate feels his Senate bid is viable, he is reaching out to friends and colleagues in the Republican donor class for investments in his campaign.",
    "Bernie Moreno, a successful Cleveland-based businessman and luxury auto dealership giant, suspended his campaign late last week after requesting and holding a private meeting with Trump.",
    "Having worked with them both on Trump’s 2016 campaign, I know first-hand that their advice and expertise will be invaluable as we move into the final stretch of the primary.",
    "Biundo, who has served as a senior adviser to Gibbons since he launched his campaign last April, worked with Stepien and Clark on Trump’s 2016 general election campaign.",
    "Kellyanne Conway, who steered Trump’s 2016 general election campaign and served as a senior counselor in the Trump White House, was a top adviser on Moreno’s campaign.",
    "Justin Clark, another founding partner of National Public Affairs and a deputy campaign manager on Trump’s 2020 reelection campaign, is also joining the Gibbons team.",
    "Trump campaign veteran Andy Surabian is advising Vance’s campaign and Trump 2016 and 2020 pollster Tony Fabrizio is doing surveys for Vance’s Senate bid.",
    "Not only is Mike poised to win the primary, but he will be an excellent Senator for the great state of Ohio,\" Stepien told Fox News in a statement.",
    "It's a bit of a Trump campaign reunion, as Stepien and Clark will now team up with longtime GOP consultant Mike Biundo in advising Gibbons.",
    "A couple of recent internal campaign polls suggest that Gibbons is either in first or second place in the Republican primary race.",
    "Mike Gibbons has the momentum in the Ohio Senate race and is committed to the America First agenda and MAGA movement.",
    "Fox News learned on Monday that Stepien is joining Mike Gibbons’ Senate campaign as a senior adviser.",
    "The additions of Stepien and Clark come with less than three months to go until Ohio’s May 3 primary.",
    "Vance, and Ohio state Sen. Matt Dolan, whose family owns Major League Baseball’s Cleveland Guardians.",
    "We have momentum on our side and look forward to being victorious on May 3,\" Biundo said.",
    "He’s a founding partner of National Public Affairs, a political consulting firm.",
    "Gibbons has already invested $11.4 million of his own money into his campaign.",
    "\"National Public Affairs is proud to join the Gibbons campaign.",
    "\"We are excited to have Bill and Justin as part of our team.",
    "Stepien, who steered former New Jersey Gov.",
    "Rob Portman."
  ]
}