{
  "id": 25659,
  "mediaId": 2512,
  "date": "2022-03-08",
  "headline": "‘Bonkers’ Senate Republicans are giving Democrats a wealth of ammunition to use against them: conservative",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29501597&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/03/bonkers-senate-republicans-democrats-ammunition/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    13690,
    13744,
    13764,
    13803,
    13197,
    13309,
    13312,
    13369,
    13372
  ],
  "sentences": [
    "In other cases, Rs couldn't get best cand to runhttps://www.washingtonpost.com/opinions/2022/03/08/senate-republicans-might-help-democrats-keep-majority/?tid=ss_tw\\u00a0\\u2026\n— Jennifer 'I stand with Ukraine' Rubin \\ud83c\\uddfa\\ud83c\\udde6\\ud83c\\uddfa\\ud83c\\udde6 (@Jennifer 'I stand with Ukraine' Rubin \\ud83c\\uddfa\\ud83c\\udde6\\ud83c\\uddfa\\ud83c\\udde6) 1646756024\nThe 59-year-old columnist, who voted Republican in most presidential elections but voted for Hillary Clinton in 2016 and Biden in 2020, goes on to cite some examples of how “bonkers” Senate Republicans are.",
    "Furthermore, he apparently aims to ban abortion nationwide and dictate what every school teaches students about race.”\nOn top of those things, the columnist adds, Sen. Ron Johnson of Wisconsin has “confessed that Republicans still want to repeal the Affordable Care Act.”\n“Yes, they did try it when they had control of both houses and the White House, but John McCain gave the thumbs down on that unpopular idea,” Rubin recalls.",
    "Doug Ducey.”\nRubin continues, “But arguably more damaging than the weak candidate selection and tepid fundraising, the self-inflicted wounds from candidates’ own mouths provide a steady stream of gifts to Democrats eager to run on the ‘At least we’re trying, but the other guys are bonkers’ message.”\nIn GA and M), GOP candidates have a planeload of baggage, incl substantial allegations of domestic violence, though they deny.",
    "“To millions of Americans who have benefited from subsidized health insurance premiums, Johnson’s message amounts to: Tough luck.”\nFrom Cruz to Johnson, Rubin writes, Republican senators are showing that they have no interest in finding solutions to problems.",
    "It remains to be seen what the 2022 midterms’ outcome will be, but according to Never Trump conservative and Washington Post columnist Jennifer Rubin, Senate Republicans are giving Democrats plenty of ammunition to use against them this election year.",
    "Then, late last month, came what might have been the worst policy gaffe in recent political history: Sen. Rick Scott (R-Fla.) rolled out a plan to raise taxes on 100 million Americans and to let Social Security and Medicare expire in five years.",
    "“In Georgia and Missouri,” Rubin explains in a March 8 column, “GOP Senate candidates have a planeload of baggage, including substantial allegations of domestic violence, though they deny wrongdoing.",
    "Those three and their fellow MAGA-pandering senators have let us know in no uncertain terms that they are extremists, bent on yanking the country back to the nightmarish Trump years.",
    "If the 2022 midterms go down like the 2010 midterms, Democrats will lose their majority in the U.S. House of Representatives but keep their majority in the U.S. Senate.",
    "President Joe Biden’s weak approval ratings are not a good sign for Democrats, who ideally, would like to maintain control of both branches of Congress.",
    "“In truth,” Rubin argues, “Republicans view government not as a vehicle for solving problems, but as a stage for performative politics….",
    "haven’t been shy about suggesting that impeachment of President Biden is in the cards if Republicans take back the House and Senate….",
    "Should voters give them back control of the Senate, venomous politics and chaos will be the order of the day.",
    "In other cases, Republicans haven’t been able to persuade their favorite recruits to run: e.g., Vermont Gov.",
    "Rubin notes, “Republicans such as the unctuous MAGA crowd-pleaser Sen. Ted Cruz (R-Tex.)",
    "Vance and Josh Mandel to determine who is the most outlandish MAGA crowd-pleaser.",
    "Scott, Johnson and Cruz might find themselves in a whole lot of Democratic ads.",
    "Phil Scott and former Sen. Kelly Ayotte from New Hampshire, Arizona Gov.",
    "Vance and Josh Mandel vie for most outlandish MAGA crowd-pleaser.",
    "In Ohio, a duel has broken out between J.D.",
    "You cannot say you were not warned.”",
    "In Ohio, J.D."
  ]
}