{
  "id": 25650,
  "mediaId": 2699,
  "date": "2022-02-10",
  "headline": "Republicans Admit: MTG’s Blessing Is the Next Best Thing to Trump’s in 2022",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644549730/220210-mtg-maga-tease-01_pj00bc",
  "link": "https://www.thedailybeast.com/republicans-admit-marjorie-taylor-greenes-blessing-is-the-next-best-thing-to-donald-trumps-in-2022?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Asawin Suebsaeng",
  "authorUrl": "https://www.thedailybeast.com/author/asawin-suebsaeng",
  "termIds": [
    13592,
    13702,
    13764,
    13954,
    13963,
    13222,
    13304,
    13312,
    13372
  ],
  "sentences": [
    "According to four longtime Republican operatives working at senior levels on a variety of competitive GOP primaries across the nation, Greene’s endorsement in competitive 2022 Republican House and Senate primaries is not only considered as welcome, but also as one that should be actively courted—particularly in races where the nominee is likely to be decided by which candidate most animates the ultra-Trumpist grassroots.",
    "Nick Dyer, a spokesman for Greene, said she is a “direct reflection of the grassroots across the country” and declared she has “become one of the most popular Republicans nationwide.”\n“Every GOP candidate who is in a competitive primary wants Congresswoman Greene’s endorsement because she went to Washington, did what she said she was going to do, and earned the trust of conservative voters everywhere,” Dyer said.",
    "Asked about her status as a coveted endorsement, Shepherd said, “I did not see that coming when I first met Marjorie.”\nBut, Shepherd added, Greene has “found her niche” and is “more influential than you’d expect any freshman member of the House to be, especially one that doesn’t have any committee assignments.”\n“If you can get MTG, she’s exciting,” he said.",
    "“We’re going to win this thing and take the country back from the scumbags.”\nGreene, commonly known just as “MTG” to fans and detractors alike, may seem to the casual observer like a bizarre choice for an in-demand endorsement, even for a political party that seems determined to wed itself to its own anti-democratic extremes and conspiracist indulgences.",
    "One of the things we’ve seen over the past decade-plus now, but that Donald Trump really drove home, is that politics is performance art.”\nThe congresswoman has been especially vocal in backing challengers to Republicans who have been deemed disloyal to Trump, either by impeaching him or criticizing him faintly, or even by working with Democrats.",
    "But even in today’s increasingly extreme GOP—where a twice-impeached, one-term president who led a failed coup is the gold standard of endorsements—there is one person whose emergence as a sought-after 2022 endorser has surprised even some of the most hardened and cynical Republican operatives.",
    "Her continued rise in the conservative movement and in the party this election year underscores just how far the Republican Party’s mainstream is going to tolerate, if not wholeheartedly embrace, its far-right luminaries and policies—even if they’re to the hard right of Trump himself.",
    "So far, at least seven GOP candidates have landed that coveted nod from the freshman Georgia congresswoman, from the loudly pro-Trump Rep. Mo Brooks, running for U.S. Senate in Alabama, to the conservative personality Robby Starbuck, running for U.S. House in Tennessee.",
    "“It doesn’t surprise me at all that, for a part of the electorate, Marjorie Taylor Greene has become an in-demand endorsement,” Doug Heye, a veteran Republican strategist and former senior official at the Republican National Committee, said on Thursday.",
    "“If you can’t get Donald Trump, you are going to want to have MTG in your back pocket,” another one of the four operatives, who professed zero personal admiration for Greene, conceded, in discussing the most desired 2022 endorsements today.",
    "And she has the unique baggage—a glaring standout even among the race-baiting, MAGA-cultish right wing—of being associated with antisemitic lies about Jewish space lasers and, most recently, warnings of Pelosi’s “Gazpacho” secret police.",
    "But as the national media attention and controversy over her committee assignments swelled early last year, Greene started seeing her popularity and positive polling on the right conspicuously increase as Joe Biden’s presidency unfolded.",
    "Greene is soon slated to headline a rally in favor of Christian Collins, a conservative operative running in a heated primary in Texas’ 8th District against a candidate, Morgan Luttrell, who is championed by Rep. Dan Crenshaw (R-TX).",
    "At the violent, historically disgraceful conclusion of Donald Trump’s presidency, it was still inevitable that Republicans would soon crawl back to him, and beg and compete for his endorsements in the critical 2022 elections.",
    "“Of the 435 members of the House, she’s the one being picked on most by the Democrats… If they’re going to pick on her, there must be something they’re scared of, so they have to rally behind her.”\nUpdated 2/16 for clarity.",
    "According to federal campaign finance filings, Greene’s campaign has made only one contribution to another campaign committee: a $150,000 check to a joint fundraising committee she shares with Rep. Matt Gaetz (R-FL).",
    "Jason Shepherd, a former chair of the GOP in Cobb County, Georgia, has known Greene since she explored a run for Congress in that part of suburban Atlanta—not the rural northwest district she represents now.",
    "Rep. Marjorie Taylor Greene (R-GA), the COVID vaccine-hating, conspiracy theory-spewing freshman congresswoman who came to national prominence as a far-right QAnon promoter, is increasingly in demand.",
    "In general, however, Greene is said to be very deliberate with her endorsements, according to another source familiar with the matter, with an eye toward which candidate can actually win a race.",
    "In January—just as Vance’s own internal polling showed him badly behind with the GOP base—he rolled out Greene’s backing like a victory lap, complete with her accompanying him to campaign stops.",
    "In Tennessee’s 5th District, near Nashville, Trump offered his support for Morgan Ortagus, a State Department spokesperson during his presidency, even before she made her run official.",
    "In South Carolina’s 7th District, she backed Graham Allen, one of 10 GOP candidates vying to unseat Rep. Tom Rice (R-S.C.), who voted to impeach Trump after the Jan. 6 insurrection.",
    "It’s been a year since she was stripped of her House committee assignments for, among other things, endorsing violence against Nancy Pelosi and conspiracy theories about Sept. 11.",
    "At the dawn of the Biden era, Greene was viewed as potentially toxic, or at least an unbridled nuisance, by a host of Republican lawmakers and staff on Capitol Hill.",
    "Last year, Greene vowed to fundraise for candidates challenging Republicans who voted in favor of a bipartisan infrastructure bill championed by President Joe Biden.",
    "“It’s not that everyone is trying to get her endorsement, but…if you’re running on ‘Let’s own the libs,’ and ‘Let’s be culture warriors,’ that’s where you go.",
    "Actually, it can be good for the candidate, and I don’t know if I would have predicted that a year ago.”\nProof positive of that growing sentiment was how J.D.",
    "Over the past year, she has emerged as a recurring public-relations headache for House Republican leadership and her less zealous colleagues.",
    "Since taking office in January 2021, Greene has raised over $7 million, making her one of the most prolific fundraisers in the entire House.",
    "Trump is already facing blowback from the grassroots for his choice—largely because Ortagus backed Jeb Bush in 2016, POLITICO reported.",
    "That Greene is shaping up to be a GOP kingmaker is not surprising to those who have watched her rise in the MAGA movement.",
    "Vance, the once anti-Trump author turned high-profile MAGA candidate for U.S. Senate in Ohio, played Greene’s endorsement.",
    "This is due in large part to her direct line to former President Trump, and her vast network of small, grassroots donors.",
    "Greene has also found opportunities to needle some of her many nemeses in the House GOP through her endorsements.",
    "“Her popularity among much of the base and what she brings to a campaign right now is not nothing.",
    "Days after Trump publicly prodded Ortagus to run, Greene announced her endorsement of Starbuck.",
    "In January, just a few months after he got Greene’s endorsement, Allen dropped out of the race.",
    "But in at least one case, Greene and Trump have offered competing endorsements.",
    "That largesse has not yet extended to the candidates she’s backing.",
    "“Honored to have Marjorie’s endorsement,” Vance wrote on Twitter.",
    "Greene and Crenshaw have feuded extensively in recent months.",
    "Some of Greene’s picks have already flamed out, however.",
    "Privately, that view has not exactly disappeared.",
    "“It is stunning,” one of these sources said.",
    "Send it to The Daily Beast here.",
    "Got a tip?"
  ]
}