{
  "id": 25741,
  "mediaId": 2658,
  "date": "2022-02-03",
  "headline": "Republican Bernie Moreno drops out of crowded Ohio Senate primary",
  "image": "https://static.politico.com/cf/9b/a45a022247ae92afec245b52394c/ap20308815211814-1.jpg",
  "link": "https://www.politico.com/news/2022/02/03/bernie-moreno-ohio-senate-race-00005569",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13592,
    13724,
    13901,
    14045,
    13285,
    13312,
    13372,
    14317,
    14357
  ],
  "sentences": [
    "Trump backed the move with a statement released soon after Moreno’s, thanking the candidate for his “time and effort.”\n“I was very impressed with Bernie who was tough on illegal immigration which, after the Biden disaster at the Border, has become a big issue for all candidates,” Trump said.",
    "Moreno said that during a private meeting with Trump Thursday afternoon, the two agreed the race was filled with too many “Trump candidates,” which could threaten the MAGA movement’s chances of holding onto the Senate seat.",
    "To whomever wins the Senate race, I hope and pray they take the actions needed to stop illegal immigration, bring our manufacturing base back to America, and shrink the size and scale of the Federal Government.",
    "| Aaron Doster/AP Photo\nBy Myah Ward\n 02/03/2022 09:24 PM EST\nRepublican Bernie Moreno on Thursday dropped out of the crowded Ohio Senate primary, citing a conversation with former President Donald Trump.",
    "Republican Bernie Moreno, a luxury car dealer and now blockchain businessman, was one of the leading GOP contenders throwing in cash at a contest to replace retiring Republican Sen.",
    "Vance, former state treasurer Josh Mandel, state Sen. Matt Dolan, investment banker Mike Gibbons and former Ohio state GOP chair Jane Timken to battle it out for the nomination.",
    "Moreno, a luxury car dealer and now blockchain businessman, was one of the leading GOP contenders throwing in cash at a contest to replace retiring Republican Sen.",
    "Thank you, Bernie, for your support and keep fighting!”\nMoreno said he’ll focus on supporting the candidate who wins Trump’s endorsement.",
    "The winner will likely face Rep. Tim Ryan, a Democrat facing an uphill battle in a state that’s turned more Republican.",
    "Moreno gave $3.75 million of his own money to his campaign and launched a $4 million television ad spree in December.",
    "Moreno is the first to drop out of the Republican primary, leaving “Hillbilly Elegy” author J.D.",
    "It’s not too much for Americans to expect their government work for them,” the statement said.",
    "“This decision may surprise some, but it is what I feel gives us the best chance of success.",
    "His decision will help ensure the MAGA Ticket wins BIG, as it is all over the Country.",
    "Rob Portman — in what’s likely to be one of the closest watched midterms in 2022.",
    "“He has done much for Ohio and loves his State and our great MAGA Movement.",
    "Business leaders recognize patterns before they happen,” Moreno said.",
    "“I am a businessman, not a politician.",
    "The stakes are too high.",
    "Rob Portman."
  ]
}