{
  "id": 25756,
  "mediaId": 2572,
  "date": "2022-02-04",
  "headline": "Trump helps narrow field in crowded Ohio Republican Senate primary",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Donald-Trump-Arizona-Rally-6.jpg",
  "link": "https://www.foxnews.com/politics/trump-ohio-senate-republican-primary-bernie-moreno-suspends-campaign",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    13454,
    13592,
    13901,
    14008,
    14045,
    13312,
    13372,
    14243,
    14317
  ],
  "sentences": [
    "Longtime Democratic Rep. Tim Ryan of northeastern Ohio is the front-runner in a small field of contenders that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate,\nWhoever wins the GOP primary will likely be considered the favorite in November’s general election in Ohio, a one-time premiere battleground state that Trump won by eight points in both his 2016 presidential election and his 2020 reelection defeat.",
    "MORENO SHELLS OUT $4 MILLION TO RUN AD BLITZ IN OHIO'S GOP SENATE PRIMARY\nMoreno’s departure, with three months to go until Ohio’s May 3 primary, doesn’t end the full court press by the other top contenders to tout their Trump credentials in hopes of landing the former president’s backing which would be a game changer in a party where Trump remains the most popular and powerful politician.",
    "FRENZY TO LAND TRUMP'S ENDORSEMENT SPARKS FISTFIGHT IN OHIO'S GOP SENATE PRIMARY\nMoreno, a successful Cleveland-based businessman and luxury auto dealership giant who shelled out over $4 million of his own money the past two months to run TV commercials to try and boost his Senate bid, suspended his bid after requesting and holding a private meeting with Trump.",
    "The remaining large lineup includes former Ohio treasurer and former two-time Senate candidate Josh Mandel; former Ohio GOP chair Jane Timken; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; and best-selling author and venture capitalist J.D.",
    "And spokesperson Michael Beyer argued that \"in order to stand out, the out-of-touch millionaires will be forced to take unpopular positions and deepen nasty feuds that will harm whoever emerges from this clown car Republican primary.\"",
    "Besides Moreno’s $4 million infusion, Gibbons has dished out over $11 million of his own money to finance his campaign and Dolan’s poured in more than $10 million, with Timken spending a couple million of her own.",
    "The Ohio Democratic Party told Fox News that Moreno's departure \"only highlights how chasing an out-of-state endorsement instead of focusing on Ohioans has made this crowded primary nasty and chaotic.\"",
    "After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat,\" Moreno explained in a statement Thursday night.",
    "Another candidate in the field of leading contenders - Ohio state Sen. Matt Dolan, whose family owns Major League Baseball’s Cleveland Guardians – is not making a play for Trump’s support.",
    "Trump appeared to be instrumental in move by Republican businessman Bernie Moreno, one of roughly a half dozen of the major contenders in the GOP primary, to suspend his campaign.",
    "And a super PAC supporting Vance is fueled by a massive $10 million contribution from PayPal co-founder and billionaire venture capitalist Peter Thiel, Vance’s former boss.",
    "Rob Portman has become a battle by most of the leading candidates to showcase their support and loyalty to Trump hopes of securing the former president’s endorsement.",
    "He has yet to make an endorsement in Ohio's competitive and expensive Republican Senate primary, but former President Donald Trump is helping to narrow the field.",
    "And minutes later Trump, in a statement, praised Moreno doing much \"for Ohio and loves his State and our great MAGA Movement.",
    "CLICK HERE FOR THE LATEST FOX NEWS REPORTING FROM THE CAMPAIGN TRAIL\nThe intra-party fistfight in Ohio’s an expensive one.",
    "Club for Growth Action, an outside group backing Mandel, has spent freely in the race to target rival candidates.",
    "The Democratic Senate primary – in comparison to the GOP slugfest – has been a sedate affair.",
    "His decision will help ensure the MAGA Ticket wins BIG, as it is all over the Country.",
    "Thank you, Bernie, for your support and keep fighting!\"",
    "Business leaders recognize patterns before they happen.",
    "The Republican fight to succeed retiring GOP Sen.",
    "\"I am a businessman, not a politician.",
    "Vance."
  ]
}