{
  "id": 25801,
  "mediaId": 2658,
  "date": "2022-02-08",
  "headline": "Coinbase forms a PAC",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/02/08/coinbase-forms-a-pac-00006657",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13394,
    13399,
    13553,
    14160,
    13175,
    13181,
    13297,
    14361
  ],
  "sentences": [
    "… Rather than total spending, SAGP weights companies based on their ‘lobbying intensity’, taking into account their size.”\nSPOTTED at a DCCC fundraising dinner hosted by Brownstein Hyatt Farber Schreck at Joe’s Seafood last night, per a PI tipster: Speaker Nancy Pelosi, DCCC Chair Sean Patrick Maloney (D-N.Y.), Reps. Pete Aguilar (D-Calif.), Joyce Beatty (D-Ohio), Sean Casten (D-Ill.), Jason Crow (D-Colo.), Diana DeGette (D-Colo.), Rosa DeLauro (D-Conn.), Suzan DelBene (D-Wash.), Ruben Gallego (D-Ariz.), Robin Kelly (D-Ill.), Dan Kildee (D-Mich.), Joe Neguse (D-Colo.), Ed Perlmutter (D-Colo.), Bobby Scott (D-Va.), Brownstein’s Zach Pfister, Nadeam Elshami, David Reid, LaKeitha Anderson, Mark Begich, Katelynn Bradley, Mimi Burke, Annmarie Conboy, Steve Demby, Doug Friednash, Laura Johnson, Tim Keating, Radha Mohan, Al Mottur, Sage Schaftel, Mike Stratton and Russ Sullivan, and friends and clients of the firm.",
    "Vance, who is running for Senate in Ohio.”\nPI PERSONAL FINANCE CORNER: Investors may soon be able to take advantage of the political whiplash that’s gripped the nation’s capital in recent years — and corporations’ attempts to weather the storm — according to Financial Times’ Steve Johnson, who reports that “New York-based Strategas Asset Management has unveiled an exchange traded fund designed to tap into companies’ efforts to increase their profitability by lobbying the US federal government.”\n— “Dan Clifton, head of policy research and lead portfolio manager for the Strategas Global Policy Opportunities ETF (SAGP), said the launch aimed to capitalise on the US experiencing ‘the most politically volatile period since the end of the Civil War, with the party in power having changed in seven of the last eight election cycles.’”\n— “‘One year it is tax cuts or healthcare reform, then it gets taken away.",
    "Innovation PAC (Coinbase Innovation PAC) (PAC)\nDistrict 66 Westside Board of Education (Super PAC)\nStrength in Seven PAC (Leadership PAC: Shontel Brown)\nWeb3 Forward (Super PAC)\nWisconsin Truth PAC (Super PAC)\nNew Lobbying Registrations\nCapitol Counsel LLC: Glaxosmithkline LLC\nFederal Hall Policy Advisors, LLC: Fir Tree Partners\nLiberty Partners Group, LLC: Atlas Healthcare Partners (C-Asc Coalition)\nMurray, Montgomery & O'Donnell: City Of Escondido\nThe Ingram Group LLC: Tennessee Business Forum\nThe Livingston Group, LLC: Bespoke Design LLC\nThe Livingston Group, LLC: Covisus Corporation\nVon Batten-Montague-York: United Somali Alliance Of The USa\nNew Lobbying Terminations\nCornerstone Government Affairs, Inc.: Chegg, Inc.",
    "A spokesperson said the Coinbase PAC intends to contribute to lawmakers of both parties, telling PI in an email that “we believe the bi-partisan potential is clear and we intend to support crypto-forward lawmakers who align with our mission to advance economic freedom for all Americans.”\n— Kara Calvert, who the company brought on in December as its senior director of public policy for North America, will run the PAC alongside CFO Alesia Haas, according to the committee's FEC statement of organization.",
    "Then last month, a group of crypto financiers launched a bid to spend $20 million supporting congressional candidates “who work to give consumers and innovators the opportunity to build and use next-generation technologies and services here in America.” Yet another super PAC seeded with crypto money plans to spend $10 million in Democratic primaries to back candidates who take a “long-term” view on policy planning, including as it relates to pandemic preparedness and prevention.",
    "Coinbase forms a PAC\nBy CAITLIN OPRYSKO\n02/08/2022 04:16 PM EST\nPresented by Speak4\nWith Daniel Lippman\nCOINBASE FORMS A PAC (AGAIN): As major cryptocurrency players continue to ramp up their presence in Washington — and the overlap between digital assets and campaigning continues to expand — crypto exchange Coinbase is the latest on the scene to form a vehicle with which to steer money toward crypto-friendly candidates ahead of the midterms.",
    "‘As the industry and our firm gets a higher profile, I think it becomes more and more important for us to be engaging with policymakers in D.C.’”\n— “With the exception of a $1,000 contribution to Sen. Michael Bennet (D-Colo.) he made as an 18-year-old student, Bankman-Fried was not heavily involved in campaign finance until he contributed millions to super PACs backing Biden in October 2020.",
    "Susan Collins of Maine, Mitt Romney of Utah, Lisa Murkowski of Alaska and Ben Sasse of Nebraska.” And as noted above, “his colleagues have stepped up their giving as well.”\nTHE CIVIL LIBERTY TO SILICON VALLEY PIPELINE: “The tight-knit civil liberties advocacy community has helped shepherd through the most significant reforms to government surveillance over the past decade.",
    "Cornerstone Government Affairs, Inc.: Cribs For Kids, Inc.\nNational Association Of Colleges And Employers: National Association Of Colleges And Employers\nO'Neill And Associates: Analogic\nO'Neill And Associates: Edaville Operations LLC\nResolution Public Affairs, LLC: Alliance For Trade Enforcement\nResolution Public Affairs, LLC: March For Our Lives Action Fund\nFollow Us",
    "We believe these companies have an earnings advantage over other companies.’”\n— How it works: “Clifton argued that smaller companies may get more bang from their lobbying buck than large ones, which might have to spend on lobbying every year as a form of ‘maintenance’, around issues such as workers’ rights and healthcare.",
    "THIEL STEPS DOWN FROM META TO FLEX HIS INFLUENCE GAME: “Peter Thiel, one of the longest-serving board members of Meta, the parent of Facebook, plans to step down … to focus on influencing November’s midterm elections,” a person with knowledge of Thiel’s thinking tells The New York Times’ Ryan Mac and Mike Isaac.",
    "But a growing number of experienced civil liberties and privacy activists have taken jobs at major tech companies in recent years, even as the data collection and practices of tech companies and the government come under increasing scrutiny,” Emily Birnbaum and Daniel report in Morning Tech.",
    "An alum of Sen. Tim Scott (R-S.C.), Smith was one of the chief advocates for the landmark criminal justice reform bill former President Donald Trump signed into law, and became a familiar face during mass protests in 2020 over police brutality and systemic racism that swept the country.",
    "— “He was a political nonentity until the last election cycle, when he spread $5.2 million across two super PACs backing President Joe Biden’s election” though now, “‘I care about policy more than politics,’ Bankman-Fried said in an interview crammed between meetings on Capitol Hill.",
    "MEET CRYPTO’S WANNABE WASHINGTON KINGMAKER: POLITICO’s Sam Sutton talks with FTX chief executive Sam Bankman-Fried, the 29-year-old billionaire who founded the cryptocurrency exchange and who is now working to expand the industry’s influence with policymakers in Washington.",
    "— According to their analysis of recent departures, at least nine high-level advocates focused on government surveillance, data ethics and privacy have left civil society to work at major tech companies since 2019, including four in the past year alone.",
    "— He most recently served as executive director of the Center for Advancing Opportunity, and previously registered to lobby with Meeks, Butera & Israel on behalf of the advocacy arm of a criminal justice reform organization founded by rapper Meek Mill.",
    "— Though Coinbase has had registered lobbyists in town since 2015, the company went on a lobbying hiring spree last year, spending $1.5 million on federal lobbying — a sum that blows away its previous record outlay of $230,000 in 2020.",
    "DGA’s LOBBYING ARM ADDS JA’RON SMITH: Ja’Ron Smith has joined Dentons Global Advisors Government Relations, the new lobbying subsidiary of the global consultancy comprising Dentons and the Albright Stonebridge Group, as a partner.",
    "— Scott Bennett is joining Boehringer Ingelheim as senior associate director of government affairs and public policy for their Animal Health division, primarily handling the livestock, poultry and equine portfolios.",
    "— Digital public affairs firm Engage has promoted Riley Bechdel and Ryan Fraase, both formerly vice presidents, to partner — its first such elevations in nearly a decade — as the firm marks its 15th anniversary.",
    "— David Gillette will succeed Marvin Feuer as AIPAC’s chief lobbyist and director of policy and government affairs as Feuer moves into the role of director of strategy, per Jewish Insider.",
    "Todd White, a relative veteran in the crypto lobbying space, helped launch a super PAC last fall seeking to haul in $300 million to help elect a new generation of crypto-savvy politicians.",
    "Thiel sees the midterms as crucial to changing the direction of the country, this person said, and he is backing candidates who support the agenda of former president Donald J. Trump.",
    "The transitions have split the civil liberties advocacy community, with some glad to see advocates getting roles with major platforms and others expressing alarm at the trend.",
    "Yarmosky was previously a senior communications adviser and Katuin was previously assistant secretary of public safety and homeland security under Virginia Gov.",
    "Good afternoon and welcome to PI, where your host is putting out an APB to find the best queso in the DMV (white preferred, but all varieties accepted).",
    "— Smith served in the Trump administration as deputy assistant to the president and deputy director of the White House’s Office of American Innovation.",
    "He was previously deputy assistant secretary for legislative affairs at Treasury and served as the economic lead for the Trump transition before that.",
    "Over the last year, Mr. Thiel, who has a net worth estimated at $2.6 billion by Forbes, has become one of the Republican’s Party’s largest donors.",
    "But now its efforts have coincided with a major boom for cryptocurrencies — and in heightened interest in Washington in regulating the industry.",
    "He gave $10 million each last year to the campaigns of two protégés, Blake Masters, who is running for a Senate seat in Arizona, and J.D.",
    "A PAC the company registered in 2018 shut down less than a year later without reporting any funds raised or spent, FEC filings show.",
    "His contributions over the last eight months include a string of direct donations to Republican campaigns, including those of Sens.",
    "He was most recently executive vice president and managing director at the Managed Funds Association and is a GWU and IMF alum.",
    "Companies are now saying they have a greater risk to their business from Washington than from other risks,’ Clifton added.",
    "She was most recently at Edelman Global Advisory, and previously served as chief agricultural negotiator at USTR.",
    "Political Action Committee (AmeriHealth Caritas PAC) (PAC)\nCertified Conservatives PAC (PAC)\nCoinbase, Inc.",
    "He was most recently a legislative correspondent and grants coordinator for Sen. John Cornyn (R-Texas).",
    "— The Nature Conservancy is adding Darci Vetter as its global lead for policy and government relations.",
    "— The America First Policy Institute has tapped Steve Yates to chair its new China Policy Initiative.",
    "— Evergreen Strategy Group has hired Alena Yarmosky as a director and Jacquelyn Katuin as a manager.",
    "Jobs Report\n— Holten Stringer is joining Van Scoyoc Associates as manager for government relations.",
    "— The Coinbase Innovation PAC is the trading platform’s second go at direct spending on candidates.",
    "— Paul Brigner is joining the Electric Coin Company as head of U.S. policy and strategic advocacy.",
    "He was most recently director of congressional affairs for the American Farm Bureau Federation.",
    "— Michael Pedroni has joined the Investment Company Institute as chief global affairs officer.",
    "Send any leads, with the promise that I will not out your hidden gems: coprysko@politico.com.",
    "Five in all went to Meta, two left for Microsoft and the other two went to Apple and Twitter.",
    "‘They understand that they need to be at the table as part of the process in Washington.",
    "Van Scoyoc has also promoted Laurie Katz and David Haines to associate vice presidents.",
    "He was most recently director of technology policy at the Chamber of Digital Commerce.",
    "— Coinbase isn’t the only crypto player looking to get involved in the midterms.",
    "— Steve Pavlick has been promoted to partner at Renaissance Macro Research.",
    "Small and mid-cap have had a tremendous performance in backtesting.",
    "It’s the first time we are incorporating that style,’ Clifton said.",
    "He is an Idaho GOP, Dick Cheney and Radio Free Asia alum.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "They say “we are going to get a return on this”.",
    "‘Small companies see this as a R&D expense.",
    "His recent activity has been bipartisan.",
    "New PACs\nAMHP Holdings Corp.",
    "New Joint Fundraisers\nNone.",
    "Ralph Northam.",
    "— “Mr."
  ]
}