{
  "id": 25832,
  "mediaId": 2699,
  "date": "2022-03-12",
  "headline": "Biden Can’t Let Putin Draw a Red Line Over Aid to Ukraine",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1647030518/220311-Lewis-Biden-tease_plefep",
  "link": "https://www.thedailybeast.com/biden-cant-let-putin-draw-a-red-line-over-aid-to-ukraine-amid-russian-invasion?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Lewis",
  "authorUrl": "https://www.thedailybeast.com/author/matt-lewis",
  "termIds": [
    13436,
    13702,
    13722,
    13764,
    13953,
    14192,
    14328,
    14332,
    14355,
    14357
  ],
  "sentences": [
    "Let me explain how slippery slopes work: Just one month ago, if you had said we would be using a U.S. air base to send planes to be used against Russia, there might have been a huge uproar of fear and surprise.",
    "It’s time for [Putin] to be fearful of what we might do.”\nI like Romney’s can-do attitude, which reminds me of James “Mad Dog” Mattis’ response to the question, “What keeps you awake at night?” His reply?",
    "After building an impressive coalition to support Ukraine in the face of Russia’s invasion, Biden is now taking friendly fire for failing to send MiG fighter jets to Ukraine.",
    "In my opinion, our goal with Ukraine should be to support the besieged nation morally and militarily (including billions in humanitarian aid), while they do the fighting.",
    "Besides, Putin has already said that our economic sanctions are “akin to an act of war.” And if he needs an excuse, he could just invent some pretext for attacking us.",
    "If we’re too soft, we empower, appease, and embolden a brutal dictator who will keep gobbling up his neighbors, even as we abandon our friends to a gruesome end.",
    "After all, Putin watched as Biden’s old boss, former President Barack Obama, drew a red line regarding chemical weapons that Syria crossed with impunity.",
    "But the nuclear threat means we have to be prudent and cautious—considering how devastating even a conventional war between the U.S. and Russia would be.",
    "“I believe there’s a sentiment that we’re fearful about what Putin might do,” Romney said on Wednesday, “and what he might consider as an escalation.",
    "We should take steps to project our power and deter our enemies while simultaneously mitigating the chance of, you know, thermonuclear Armageddon.",
    "It’s not like the Soviet Union’s Afghan occupation, where the U.S. tried to maintain plausible deniability in its otherwise obvious involvement.",
    "Then, they surprised us by insisting they fly the planes to a U.S. air base in Germany, where they would then be sent to Ukraine.",
    "“There is no logic which has been provided to this committee or to the nation for the lack of rapidity in making this decision.",
    "Biden has pledged that the U.S. will “defend every inch of NATO territory.” This, presumably, is his red line with Russia.",
    "Regardless, NATO territory seems to be the line that Biden is trying to walk, which strikes me as a reasonable stance.",
    "It makes no sense.”\nI’ll try to explain it by summarizing this: Poland was supposed to give the MiGs to Ukraine.",
    "President Joe Biden has drawn a line in the sand, and Republican Sen. Mitt Romney is criticizing its placement.",
    "“I simply do not understand the logic for not getting the MiGs to the Ukrainians immediately,” Romney said.",
    "If we are going to risk a clash with Russia, the decision to do so should not result from hapless error.",
    "This, hopefully, would discourage Russia (and China) from any more invasions of neighboring countries.",
    "The easy thing to do is embrace strict isolationism or, conversely, become the world’s policeman.",
    "Even if he manages to walk the line—he’ll still necessarily disappoint the hawks and the doves.",
    "Are we willing to risk starting World War III over, as author and Ohio Senate candidate J.D.",
    "These objectives are in tension, and accomplishing both will necessarily feel unsatisfying.",
    "But this may be the one instance where Joe Biden’s stubbornness pays off in the long run.",
    "This potentially increases the odds of direct confrontation between the U.S. and Russia.",
    "But we should view this as part of a long-term strategy for containment and deterrence.",
    "And it would also avoid direct combat with Russia over the fate of a non-NATO member.",
    "We were already openly planning to “backfill” the planes Poland was supposed to send.",
    "I don’t think we should allow Russia’s nuclear arsenal to hold the world hostage.",
    "How can Biden justify helping Ukraine without giving them everything they want?",
    "I keep other people awake at night.”\nAmerica is the strongest nation on Earth.",
    "But when the stakes are this high, the line should be intentional and clear.",
    "Today, it just seems like the next logical step, if you care about Ukraine.",
    "We can’t walk around on eggshells like we are afraid of our shadows.",
    "But it’s important to remember this about Russia: THEY’VE GOT NUKES.",
    "I mean, America is already providing military support to Ukraine.",
    "As a non-NATO member, Ukraine is on the wrong side of that line.",
    "Regardless, it’s one more step toward being dragged into a war.",
    "Now, there’s a danger that Putin thinks even this is a bluff.",
    "Biden, I think correctly, determined that would be unwise.",
    "We don’t even have implausible deniability with Ukraine.",
    "But why draw the line at America sending in the MiGs?",
    "That doesn’t mean we shouldn’t be supporting Ukraine.",
    "I want to find a way to get those planes to Ukraine.",
    "Vance put it, a country that is 6,000 miles away?",
    "Ukrainians understandably want a No-Fly Zone.",
    "This brings us back to Romney’s comments.",
    "At some point, you have to draw the line.",
    "Ukraine will understandably want more.",
    "This is not even an open secret.",
    "This caveat complicates things.",
    "Biden has a thankless job.",
    "“Nothing.",
    "We are!"
  ]
}