{
  "id": 25835,
  "mediaId": 6615,
  "date": "2022-03-02",
  "headline": "Readers stand with Ukraine but differ on how strong U.S., Europe have responded | Letters",
  "image": "https://www.gannett-cdn.com/presto/2022/03/01/PNAS/13e4c9fb-56c8-460f-9595-5ae9fcfcc850-Ukraine_Bldgs_24.jpg?crop=1999,1125,x0,y100&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.tennessean.com/story/opinion/2022/03/02/ukraine-invasion-readers-condemn-putin-but-differ-bidens-response/6978974001/",
  "mediaOutlet": "Tennessean",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13392,
    13702,
    13996,
    14156,
    14193,
    14332,
    14355,
    14357
  ],
  "sentences": [
    "Trying to guess a dictator’s rationale assumes that he’s rational, but one plausible explanation finds its origin in Putin’s ethno-nationalist worldview that Eastern European historian Timothy Snyder calls “the politics of eternity.”\nFor the sake of brevity, the politics of eternity displaces history as something we build in the present for the sake of a better future.",
    "Tom Zazzi, Franklin 37064\nHow to punish Putin's aggression\nIf the world is really serious about sanctioning Russia's Vladimir Putin, it should have the International Court of Justice in the Hague declare him a \"war criminal\" and put a billion-dollar bounty on his head for the indiscriminate killing of innocent Ukrainian women, children, and the elderly.",
    "Ukrainians valiantly resist Putin's autocratic aims\nAs the sovereign nation of Ukraine valiantly resists Vladimir Putin’s war of aggression, this David vs. Goliath struggle between democracy and autocracy is gaining strength because the underdog in this fight has summoned national unity (and international support) coupled with courage and urgency.",
    "While Putin is no Hitler (not yet), his zeal to make Russia great again helps us to see that democracy is about inspiring a future that’s better than the present, while autocracy, on the other hand, is about inciting fearful people in the present to rebuild a past that can never be.",
    "The politics of eternity, conversely, cycles back to a time in the past where a nation, or a lone despot, is driven by resentment and victimhood (much like Hitler’s exploitation of the Treaty of Versailles to exacerbate Germany’s sense of humiliation after WWI).",
    "Nations that commit to rapidly scaling these technologies will be in much stronger positions than countries that choose to remain where the U.S. and Europe are now: lacking effective strategies against aggressors so they’ll let us buy fossil fuels from them.",
    "They continue to condemn the teaching about race in school but do not even understand the parallel between Putin and Hitler and the attitude the United States had about Europe before Hitler began his terrifying and horrendous march through Europe.",
    "After all, Putin knows that Europe depends on the oil and gas it imports from Russia and that U.S. gas prices have already increased in response to the crisis and are likely to increase more in response to sanctions.",
    "Prior to 2020 Putin had the tacit approval of the administration in his pocket, NATO and UN scattered, oil money in reserve, and nearly half of the American people believing he had no Hitleresque tendencies?",
    "| Opinion\nResist Russian government aggression\nI write to cheer on the brave people of Ukraine, especially their leader, Volodymyr Zelenskyy, who refused our country’s offer to help him flee.",
    "He cares nothing about his people, and has been given the resources, complete control of the military/police, and the control of the press he needs to be that weasel-eyed bully.",
    "Sylvia Russell, Nashville 37218\nRussian invasion shows why renewable energy matters\nIt’s heartbreaking to watch ordinary Ukrainians face Russian troops invading their country.",
    "Leo Hillmann, Nashville 37221\nShame on politicians who are ignorant of history\nI am appalled that some politicians are saying they do not care about what happens in Ukraine.",
    "Clean, abundant, homegrown solar and wind power are not only what we need to address the climate crisis, they also give us strategic advantages over dictators like Putin.",
    "While this tragedy unfolds, most of the Russian people, many of whom have familial ties with the Ukrainians, oppose the annexation and subjugation of a peaceful neighbor.",
    "Of course, some will oppose this by comparing this idea to Trump killing Soleimani and al-Baghdadi but will ignore Obama killing bin Laden or Biden killing al-Qurayshi.",
    "Jane Fleishman, Nashville 37206\nPutin wouldn't have invaded Ukraine with Trump in charge\nThe Ukrainians will soon begin to hate us Americans because of Joe Biden.",
    "Patrick Lynch, Estill Springs 37330\nSign up for Latino Tennessee Voices newsletter: Read compelling stories for and with the Latino community in Tennessee.",
    "To our leaders and representatives, please continue to take whatever steps you can to stop the evil and illegal efforts at taking over these free nations.",
    "Why would anyone be deterred from aggression when one of the first things the \"leader\" of the free world says is that America's military won't intervene?",
    "The technologies needed to run our cars, trucks and homes from renewable sources exist and are becoming cheaper and more commonly used all the time.",
    "I don’t really care what happens to Ukraine one way or the other.”\nIs this kind the of person we want representing us in the United States Senate?",
    "Putin, just like despots in other oil producing countries, has the strategic advantage as long as our economy depends so heavily on fossil fuels.",
    "While they're at it, ban all Russians from international athletic events, including the Olympics, until Russia abandons every inch of Ukraine.",
    "Jane Carroll, Nashville 37215\nU.S., European leaders must be more courageous\nVladimir Putin is determined to reconstitute the Soviet bloc.",
    "I believe Putin waited this long believing that the 2020 election was going to turn his way – Especially with the Russian intel meddling.",
    "Their own demonstrations in Moscow and elsewhere denounce Putin’s delusional vision of restoring an empire that exists only in his mind.",
    "The sanctions imposed by the international community are an appropriate response, even if they are unlikely to deter Vladimir Putin.",
    "My opinion is that Putin simply wants what you and I and most of Europe, and yes Ukraine, have for himself and his cronies.",
    "Has he not watched any of the broadcasts showing Ukrainians fighting and dying for their freedom against the Russian army?",
    "Mark Forrester, Nashville 37216\nMore:Ukraine invasion is a wakeup call: How can we defend democracy if we are divided?",
    "Putin never thought about invading Ukraine while Trump was President because he knew that hell would rain down on him.",
    "He took Crimea while Obama was in office because he knew he would not face any outside resistance that was meaningful.",
    "The current crisis is one more reason for the U.S. to urgently double down on developing sources of renewable energy.",
    "The letters to the editor were written by readers across Middle Tennessee about the Russian invasion of Ukraine.",
    "After all, how can one justify the mass murder of people for no reason I cannot rationally “put my arms around.\"",
    "The people of Mexico are fleeing to a safer place and away from the terrible state of living in their homeland.",
    "Does he not know his history where Hitler did the same thing in 1939 to Poland, and the ultimate consequences?",
    "The invasion of Ukraine is just one move that will be followed by other moves unless leaders stand up to him.",
    "And sanctions must have sharp teeth making life hard on Russia’s rich and powerful, including Putin himself.",
    "Do we need to stop buying oil from Russia and be short on oil until we can reopen our American pipelines?",
    "I also bow with respect to the Russian citizens who have dared to publicly protest Putin’s invasion.",
    "Right now, we need folks like Lincoln, Churchill, Teddy Roosevelt and John McCain more than ever.",
    "Shame on any politicians that do not understand the differences and that history repeats itself.",
    "It is also totally asinine to compare our border with Mexico and Ukraine’s border with Russia.",
    "And apologies for my frankness but life will be hell for many because Biden is spineless.",
    "As to why Putin would cause such global disruption in the first place is anybody’s guess.",
    "For others, war in Ukraine hits closer to home\nWhy would Putin wait until now to attack?",
    "The people of Ukraine are trying to protect themselves and maintain their way of life.",
    "My apologies to Eastern Europe, and Taiwan, I hope they survive the next three years.",
    "I read in The Tennessean where Republican candidate for the U.S. Senate in Ohio, J.D.",
    "Herman Lawson, Hendersonville 37075\nMore:Some stores stop selling Russian products.",
    "I have read other thoughts and opinions, and most readers have read/heard the same.",
    "Sanctions hurt everyone as much as they hurt Russia; trade works both ways.",
    "I’m embarrassed for him and hope that the voters of Ohio do not elect him.",
    "Let’s unite for the cause of the free in this very challenging time.",
    "Send your response of 250 words or fewer to letters@tennessean.com.",
    "Still, I have trouble as to why Putin waited until now to attack.",
    "Vance embarrasses himself with Ukraine snub\nI am flabbergasted!",
    "Putin wants to cement his legacy and remake the Soviet Union.",
    "The Tennessean\nDo you agree or disagree with the writers?",
    "Some in the Kremlin might think that was a good deal.",
    "We have a dearth of leadership in the West right now.",
    "I have thought a lot about Putin and the invasion.",
    "Did these people not take history in high school?",
    "Thoughtful responses to this forum appreciated.",
    "Certainly, I have more questions than answers.",
    "So far Biden and European leaders are timid.",
    "They look like Chamberlain, not Churchill.",
    "Vance, stated “I gotta be honest with you.",
    "The democracies of the west are at stake.",
    "Leaders need to be wise and stand firm.",
    "Ukraine needs peacekeeping assistance.",
    "That should get their attention.",
    "James Bottum, Hillsboro 37342",
    "Who will stand in his way?",
    "This has got to change.",
    "The danger is great.",
    "Godspeed Ukraine."
  ]
}