{
  "id": 25836,
  "mediaId": 2574,
  "date": "2022-03-04",
  "headline": "Free Beacon Poll: On Ukraine, Republican Voters Unified in Call for Forceful Response",
  "image": "https://freebeacon.com/wp-content/uploads/2021/06/GettyImages-1233483521-e1632939955366.jpg",
  "link": "https://freebeacon.com/national-security/free-beacon-poll-on-ukraine-republican-voters-unified-in-call-for-forceful-response/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Simonson",
  "authorUrl": "https://freebeacon.com/author/joseph-simonson/",
  "termIds": [
    13563,
    13592,
    14192,
    13312,
    14233,
    14324,
    14332,
    14355,
    14357
  ],
  "sentences": [
    "National Security\nIsolationist sentiment almost non-existent, as GOP voters take hawkish turn\nAn overwhelming majority of Republicans believe the United States should take an active role in stopping Russia’s invasion of Ukraine, a Washington Free Beacon survey of likely Pennsylvania voters found.",
    "The poll of 600 likely Pennsylvania primary voters, conducted from Feb. 25 to 28, found a major swing in support towards U.S. Army veteran and business executive David McCormick, who has leapfrogged celebrity doctor Mehmet Oz in the race to be the Republican's U.S. Senate candidate.",
    "The poll’s findings contradict many commentators and journalists' assertions that Republican voters, and particularly supporters of former president Donald Trump, have grown more receptive to an isolationist foreign policy in recent years.",
    "Just 14 percent of Republican voters surveyed said Vladimir Putin’s invasion of Ukraine was \"not our problem,\" and that the United States should \"do nothing\" in response, according to the poll, conducted by TargetPoint Consulting.",
    "‘We don't have a strategic interest in reducing the global supply of energy, and that would raise prices at the gas pump for the American people,\" press secretary Jen Psaki said Thursday.",
    "Vance, who said in the days prior to Russia's invasion that he didn't \"care what happens to Ukraine one way or another,\" was found to be the least popular response to the growing crisis.",
    "Both Republican and Democratic lawmakers have called on Biden to enact harsher economic penalties against Putin, in particular those that would target Russia’s energy sector.",
    "Voters who said they strongly supported Trump were the most likely to take an isolationist position, but also the most likely to support a muscular military response.",
    "The former president reportedly told Putin that any move on Ukraine while he was in office would have resulted in a U.S. strike on Russia's capital city of Moscow.",
    "Forty-five percent of voters said the United States should \"impose the strongest possible sanctions on Russia and seek a diplomatic resolution.\"",
    "Another 23 percent said the United States should \"arm and support the Ukrainian resistance so they can kill as many Russians as possible.\"",
    "McCormick has called Putin a \"tyrant on the world stage\" and said the invasion of Ukraine came because of weakness in the White House.",
    "Trump has said, however, that he never would have allowed Putin to get away with the invasion if he was still in the White House.",
    "\"All those beautiful golden turrets will be blown up,\" Trump warned Putin, according to the New York Post's Michael Goodwin.",
    "In sum, a plurality of those who favorably view Trump chose stronger sanctions against Russia as the best possible option.",
    "The dominant view among respondents is that President Joe Biden is not doing enough to counter Russia’s military campaign.",
    "On Thursday, Speaker of the House Nancy Pelosi (D., Calif.), said she supported stopping all importation of Russian oil.",
    "Another 17 percent said they support deploying \"U.S. troops to support the Ukrainian resistance fighting the Russians.\"",
    "Critics of Trump took aim at the former president's comment last month that Putin's invasion decision was \"genius.\"",
    "\"Without Joe Biden in office this crisis, I believe, would not have happened,\" McCormick said.",
    "The United States currently imports around 650,000 barrels of oil a day from Russia.",
    "The poll found that Trump's staunchest supporters were divided on the question.",
    "The White House has repeatedly said it is not considering any import ban.",
    "The isolationist view adopted by Republican figures such as Ohio's J.D."
  ]
}