{
  "id": 25877,
  "mediaId": 2745,
  "date": "2022-04-05",
  "headline": "The Trailer: 'Socialism.' 'Beijing Dave.' In primary stretch, Pennsylvania's Senate contenders go after the front-runners.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KEPS5LVRZQI6ZHN5BVDATVCMDQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/05/trailer-socialism-beijing-dave-primary-stretch-pennsylvania-senate-contenders-go-after-front-runners/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13531,
    13592,
    13778,
    13870,
    13294,
    13372,
    14225,
    14324,
    14327,
    14366
  ],
  "sentences": [
    "“I've been to the combat zone,” Peters says after firing a few shots at targets, “and now I'm ready to go to Washington to fight the socialists.”\n“Would you likely support Vice President Kamala Harris in the New Hampshire Primary if President Biden declined to run, or would you likely support a new candidate?” (Saint Anselm College Survey Center, March 23-24, 570 New Hampshire Democratic voters)\nNo Democrat wants to talk about it, and why would they, but plenty of ordinary voters speculate whether the president, who will be 81 years old at the next election, will seek another term.",
    "“I’ve signed ‘Fred’ to over a million letters, cast more votes than anyone in this chamber while here, and, by most accounts, have succeeded in making a difference.”\nTrump endorsed Huizenga last month, after previously endorsing a state legislator's challenge to Upton, before maps drawn by an independent commission backed the two incumbents into the same western Michigan seat.",
    "Her first ad ahead of the May 3 primary doesn't mention Ryan, referring instead to how she's the “only Democrat for Senate who's always supported Medicare-for-all and a $15 minimum wage” and has “always been pro-choice.” Ryan, a Catholic who opposed abortion rights at the start of his career, announced seven years ago that he'd come to “trust women” and support them.",
    "Conway, the only candidate to win an election in any part of the district, jumped in 11 weeks ago and was quickly viewed as the candidate to beat; she raised less money than Stoll, who loaned his campaign $100,000, or Heng, whose 2018 race against Rep. Jim Costa (D-Calif.) and brief 2022 campaign for U.S. Senate forged some relationships with GOP donors.",
    "Physician Al Gross, the 2020 Democratic nominee for U.S. Senate, is running for the seat as a “nonpartisan” candidate, and when Palin entered the race, the 314 Action Fund — which spent $2.4 million to help Gross's unsuccessful 2020 bid — paid for a Change Research poll that found Gross tied with Palin in a hypothetical four-candidate second round.",
    "His height (6’9’’), story (mayor of a failing steel town), politics (unapologetically left-wing), and wardrobe (shorts, hoodies, and Dickies work shirts) made him an irresistible subject for media outlets trying to understand the Rust Belt; when the late Anthony Bourdain came to Pittsburgh, he filmed a dinner with Fetterman and his wife, Gisele.",
    "“Would you say that you are better off, worse off, or about the same economically compared to a year ago?” (Texas Lyceum Poll, March 11-20, 1200 adults)\nBetter off: 14%\nWorse off: 45%\nAbout the same: 38%\nTexas Democrats were thrilled by this poll, the first all year that's found ex-Rep. Beto O'Rourke (D) trailing Gov.",
    "Environmental groups have conducted polling that found most Michiganders in favor of closing the pipeline to prevent possible spillage, while independent pollsters have found the opposite, and the growing assumption is that voters angry at high energy prices will support any idea that they're told might lower them.",
    "Chuck Edwards for Congress, “Limelight.” Edwards, a state senator running for Congress against Rep. Madison Cawthorn (R-N.C.) in the GOP primary, avoids attacking the first-term congressman directly, but keeps making references to some candidate who seems to be focused on fame instead of western North Carolina.",
    "Kenyatta jumped in 11 days later, saying that the race would not be about anyone’s “cult of personality.” Six months later, Lamb entered the race, talking about his record of winning close elections, and building relationships with local Democrats who had the right to endorse a candidate before the primary.",
    "… 28 days until the next primaries\n… 49 days until Texas runoffs and the special primary in Minnesota's 1st Congressional District\n… 67 days until the special House primary in Alaska\n… 70 days until the special election in Texas's 34th Congressional District\n… 211 days until the midterm elections",
    "“The swamp hates Mo Brooks,” says a narrator, which is why “Mitch McConnell spent over $15 million attacking him.” (That number adds up the McConnell-aligned PAC spending against Brooks in his 2017 special election campaign for the state's other Senate seat, and the spending in this one.)",
    "“We warmly invite Republicans to light their money on fire for a seat that is completely out of their reach come November.”\nThe June 14 special election, of course, won't happen in the new lines — it'll be the last election in a border district that shifted to the right two years ago.",
    "Tony Evers appointed Kornblum, and Democrats have supported her as Republicans lined up with Lazar, in a campaign that has questioned whether Kornblum is soft on sex offenders, and linked her to the 2021 killings committed by a driver who plowed through a Waukesha Christmas parade.",
    "“We look forward to helping Mayra Flores make history, and offering South Texas voters a representative they can be proud to support.”\nIn the week between those elections, on June 11, Alaska voters will vote on a successor to the late Rep. Don Young in the state's sole House seat.",
    "He never has, and he won’t, because the socialist label sticks.”\nIn Allentown, Lamb said that endorsing Medicare-for-all in his last campaigns would let Republicans bury Fetterman with the sort of “socialism” and “$34 trillion” messaging that they’d wanted to use against Sanders.",
    "“There's a lot left to do,” says Pritzker, walking past a stack of cargo, “but Illinois moving forward.”\nSam Peters for Congress, “Sam Peters for Congress.” It's been a few days since a candidate shot a gun on camera, but the trope is back in Nevada's 4th Congressional District.",
    "His break-glass response: A two-minute digital ad that combines the domestic violence allegations against Walker (“Did you know Herschel once held a razor to her throat?”) with the insinuation that there may be “more women” with stories that would destroy Walker's candidacy.",
    "Mike Lee (R): 43%\nDon't know: 24%\nEvan McMullin (I): 19%\nKael Weston (D): 11%\nOther: 3%\nRepublican-turned-independent Evan McMullin is running to build a new version of the coalition from his 2016 presidential campaign — frustrated anti-Trump Republicans and Democrats.",
    "The Mo Brooks for Senate Committee, “Conservative.” Less than two weeks after Donald Trump yanked his endorsement from Rep. Mo Brooks (R-Ala.), the candidate continues to present the GOP's U.S. Senate primary as a referendum on Senate Minority Leader Mitch McConnell.",
    "We've learned that Maloney's campaign will report more than $600,000 raised in the first three months of 2022, and headed into April with more than $2 million on hand; Schmitt has not reported his latest numbers, but ended 2021 with a bit more than $250,000 on hand.",
    "And only comes up when you have elections like this.”\nThe Republican campaign has been even more divisive, and far more expensive with McCormick emerging only recently as the favorite — one who, unlike Fetterman, had no political profile in the state before running.",
    "But former GOP state Assembly leader Connie Conway, tech CEO and 2018 congressional candidate Elizabeth Heng, and Democratic bureaucrat Lourin Hubbard are running to represent the former Nunes seat through the end of the 2022, will not seek another office this year.",
    "After he talked to more than 150 voters in Gettysburg, several with shirts designed by a fan and sold by the campaign — “I'm voting for Gisele's husband” — he said that Democrats who knew him, and had campaigned with him, were debasing themselves by going negative.",
    "The brief campaign didn't expose any big differences between the Republicans, who alternated between promises to protect farmers from environmental regulation and attacks on Democratic “socialism,” and the Democrats got little attention without Nunes as a foil.",
    "Last year, after Sen. Patrick J. Toomey (R-Pa.) announced his retirement, Army veteran Sean Parnell spent six months leading the field — two of them with Donald Trump’s endorsement, before a messy custody battle with his ex-wife convinced him to quit the race.",
    "Morgan Harper for Ohio, “My Ohio Story.” Harper, an attorney at the Consumer Financial Protection Bureau now running for U.S. Senate, has trailed Rep. Tim Ryan (D-Ohio) since getting into the race and couldn't stop the state Democratic Party for endorsing him.",
    "“I'm not a steppingstone candidate.”\nBut Stoll and ex-FBI agent Michael Maher are running in the new 21st Congressional District, too, as is Marine veteran Eric Garcia, an independent-turned-Democrat who got into the race when Nunes looked ready to run again.",
    "Rep. Fred Upton (R-Mich.), who arrived in the House during Ronald Reagan's second term, tearfully announced his retirement on Tuesday, dodging a member-on-member primary with Rep. Bill Huizenga (R-Mich.)\n“This is it for me,” Upton said on the House floor.",
    "The state's first congressional vacancy in 49 years has led to a massive field of candidates, none as well known as Palin — arguably, not even Santa Claus, the legal name of a member of the North Pole, Alaska, city council who was born Thomas O’Connor.",
    "California's 22nd Congressional District will either get a new member of Congress today, or a two-month runoff, as four Republicans and two Democrats vie to replace ex-Rep. Devin Nunes, who quit the House to lead the Trump Media & Technology Group.",
    "Republicans in Austin redrew the 15th district to become winnable for their party, and in doing so, they added Democratic precincts to the 34th, turning a seat that had voted for Joe Biden by 4 points into one that supported him by double digits.",
    "Both McCormick and Oz skipped a Feb. 22 candidate forum; McCormick skipped another session this weekend at the Pennsylvania Leadership Conference, an annual conservative gathering where moderators had been selected from like-minded media outlets.",
    "“Fetterman has done no campaigning whatsoever.”\nLocal Democrats and some outside groups expected Fetterman to sink as the race went on; the first ads attacking him over the 2013 incident, from Collective PAC, went on the air 11 months ago.",
    "McCormick, a Gulf War veteran who'd become the CEO of Bridgewater Associates, moved home from Connecticut to run, announcing his candidacy not long after physician and TV star Oz moved back to the Philadelphia area for his own campaign.",
    "Some Democrats see an opportunity with Palin in the race — a universally known Republican with lingering negative ratings in Alaska thanks to her 2009 decision to quit her job as governor and her campaigning against Young in 2008.",
    "As she campaigned around the state, she said, it was clear — and it was best for the party — that the candidate who many Washington Republicans saw as the strongest candidate face questions before Democrats could pose their own.",
    "J.B. Pritzker's version of that comes after a story about the expansion of Rockford's airport, which benefited immensely from a national problem — clogged supply lines overloading bigger airports, like O'Hare, 75 miles away.",
    "In New Hampshire, where Biden never caught fire with primary voters, 49 percent of voters who say they intend to vote in the 2024 Democratic primary plan to support Biden, and 30 percent would like to support someone else.",
    "The Central Valley district, which starts in east Fresno and stretches through farms and small cities in Tulare County, was torn up in the commission-drawn redistricting that will take effect for the November elections.",
    "Over the weekend, both rivals began attacking the lieutenant governor more directly, warning outright that the party can’t win if it nominates him, and that he’s never truly had to face MAGA-era Republican campaigning.",
    "Local elections are taking place all over the state today, from the final round of the race for mayor of Milwaukee to more of the suburban school board races that have captured so much conservative energy since 2020.",
    "One potential reason: Abbott is running on a combination of conservative achievements, like last year's strict new abortion law, and on keeping the state a magnet for jobs and for people fed up with high-tax states.",
    "Despite appeals from some elected Democrats to leave the race, and give McMullin a clean shot at Lee, Weston has continued running his campaign, and gets more of the Democratic vote in this poll than McMullin does.",
    "“I’m seeking this opportunity to serve and finish the term,” Conway told Republicans at a candidate forum two months ago, before the Fresno County GOP split its endorsement between her and Navy veteran Matt Stoll.",
    "But only 32 percent of Texans in this poll say that the state is “better off” than the rest of the country, the lowest rating that this poll has ever found on that question — even before Abbott was governor.",
    "Gretchen Whitmer (D-Mich.), transforms the first-term governor into both President Biden and Secretary of Energy Jennifer Granholm, who left the governor's office 11 years ago with abysmal approval numbers.",
    "The victory, in a room full of Pennsylvania conservatives, went to Kathy Barnette, an unsuccessful 2020 congressional candidate who'd built a reputation with conservatives by challenging the 2020 election.",
    "“Not one dollar that anyone entrusts in our campaign will be spent against a fellow Democrat,” Fetterman said in an interview on Sunday, shortly after the debate, and after his own rally in Gettysburg.",
    "Fetterman raised $3.1 million from January through March, bringing his total raised over $15 million; as of Jan. 1, Lamb had raised a bit less than $4 million, and Kenyatta had raised $1.5 million.",
    "McCormick did attend a forum in Erie earlier in the week, but during Saturday’s event was hours from the conference, stopping at diners in the state's deep red northeast, as his opponents unloaded.",
    "Perry Johnson for Governor, “Quality Energy Means Lower Prices.” Morphing a photo of your opponent into someone you know voters don't like has been a standby of attack ads since the 1990s at least.",
    "“The socialist label sticks on John because of the policies he actually has advocated and the people like Bernie Sanders that he has actively campaigned with,” Lamb explained after the debate.",
    "JB for Governor, “Cargo Load.” More and more Democratic incumbents are including defensive language in their messaging, to assure voters that they don't think everything's on the right track.",
    "He'd skipped the Muhlenberg College forum, they said, because he didn't want to talk about the time he'd allegedly mistaken a Black jogger for a fleeing criminal and pointed a shotgun at him.",
    "In the state's second district court of appeals, which covers southeast Wisconsin outside Milwaukee, Judge Lori Kornblum is facing a challenge from Waukesha County Circuit Judge Maria Lazar.",
    "Polling in the GOP race has been less one-sided than polling for Democrats: Oz led a pair of Trafalgar surveys in February, while McCormick has held single-digit leads in a few polls since.",
    "That's what's happening in this ad, which follows a series of pro-Vance PAC spots focused on immigration and describing the “Hillbilly Elegy” author as tough enough to fight the left.",
    "The vice president, who quit the 2020 race well before the New Hampshire primary, runs slightly behind that — a majority of Democrats, right now, would like to explore their options.",
    "But as McCormick has gained ground, his opponents have made a version of the case Lamb and Kenyatta make against Fetterman: It would be impossible to win if the voters pick this guy.",
    "Both Fetterman and ex-hedge fund CEO David McCormick, a Republican, have been attending debates only at their leisure; McCormick skipped one at a conservative conference on Saturday.",
    "Fetterman’s opponents are promising that the 2013 jogger incident and the candidate’s embrace of Sen. Bernie Sanders (I-Vt.) will, in Lamb’s words, be “fatal” in a general election.",
    "“We need to know whether that’s something we want to get in bed with, or if it’s another Hunter Biden laptop waiting to explode on us.”\nDid you come here to read about Sarah Palin?",
    "Vela's decision gave Republicans a chance to do what they've pulled off several times in state legislative races in the Rio Grande Valley: Flip a historically Democratic district.",
    "Gary Black for Senate, “Imagine.” No Trump-endorsed U.S. Senate candidate has dominated his race like Herschel Walker, a Georgia football legend who's never run for office before.",
    "In the last Trailer, we talked to New York legislator Colin Schmitt, who's challenging Rep. Sean Patrick Maloney (D-N.Y.) and arguing that the chairman of the DCCC is vulnerable.",
    "Because he knows it’s not true.”\nFetterman, who lost an insurgent primary campaign for this seat six years ago, was both an obvious front-runner and an unlikely-looking nominee.",
    "McCormick’s rivals warn that he’s vulnerable over the investments his fund made in China, with Mehmet Oz and his allies arguing that “Beijing Dave” can’t beat the Democrats.",
    "In this edition: Pennsylvania's U.S. Senate primaries get real, special elections unfold in every time zone, and Wisconsin holds the year's most contentious local races yet.",
    "We're in a unique situation where the incumbent president and vice president have less support ahead of the next primary than an ex-president who currently holds no office.",
    "The Democrats' strategy here has been to focus on a few big issues, like education and the power grid, and argue that Abbott's too distracted by social issues to fix them.",
    "“If you want a celebrity, go watch the Kardashians,” says Edwards, repeating a list of accomplishments from his first ad, such as banning “sanctuary cities” in the state.",
    "Kenyatta warned that the jogger incident would give the GOP an easy way to depress Black turnout, and asked why the lieutenant governor had never truly apologized for it.",
    "“As I’ve watched the far left destroy the country,” Palin said in a statement, “I knew I had to step up and join the fight.” Two days later, Donald Trump endorsed her.",
    "But no Democrat has announced his or her intention to seek the seat for the rest of Vela's term, and Gonzalez can't run for it while he represents another district.",
    "Like a lot of Republican veterans this cycle, Peters, who served in the Air Force and earned the Bronze Star, says that his war record prepared him for politics.",
    "When voters hear about this, they don’t like it — not just Black voters, but it’s anathema to suburban women.”\nThe attack, Fetterman said, simply will not work.",
    "“I think about Kyle Rittenhouse and people who decided that they could, with impunity, take the law into their own hands.”\nThey were jabbing at an empty podium.",
    "“He made a choice to point a shotgun at the chest of an unarmed Black man, and then say afterwards that he would do it again.”\n“I think about Trayvon Martin.",
    "Every contender will appear on the same ballot, and the four who get the most votes will head to a second ballot, on Aug. 16, the day of the regular primary.",
    "Half of the candidates running today are running in June's primary for one of the new seats, the reshaped and Democratic-leaning 21st Congressional District.",
    "If a candidate clears 50 percent of the vote in this race, he or she will head to Congress; if not, the top two finishers will meet in a runoff on June 7.",
    "Greg Abbott scheduled a race to replace ex-Rep. Filemon Vela (D), who resigned for one of the year's least scandalous reasons: He joined a lobbying firm.",
    "“The reason Beijing Dave is not here is because he built the biggest hedge fund in China with over billion dollars,” Oz said at the forum in Harrisburg.",
    "“Make no mistake: A Democrat will be sworn in to represent Texas’s 34th Congressional District in January 2023,” said DCCC spokeswoman Monica Robinson.",
    "He briefly looks down, composing himself, to say that he nearly lost his mother “to the poison coming across our border,” another theme in the PAC ads.",
    "But with six weeks left to go before the primary, neither Kenyatta nor Lamb has threatened Fetterman in polls, and both have lagged his fundraising.",
    "Sanders returned the favor in 2018, helping Fetterman dominate a crowded race for lieutenant governor, where the ex-mayor’s reputation flourished.",
    "(Kornblum previously worked under District Attorney John Chisholm, who critics blame for not keeping the driver behind bars for a prior offense.)",
    "(Vance's mother, who's been sober since before the publication of his memoir, survived an overdose when the future candidate was in law school.)",
    "“Lamb campaigned,” ex-Rep. Robert A. Brady, a longtime Democratic leader in Philadelphia, said after the city’s Democratic club endorsed Lamb.",
    "Do you hate Mexicans?” Vance says with a smirk in his own ad, saying that anyone who wants to finish “Trump's wall” has to deal with insults.",
    "All three support closing Enbridge Line 5, a 69-year old petroleum pipeline that runs under the Great Lakes; Johnson wants to keep it open.",
    "Brooks doesn't repeat what he's said in other ads, that he'd vote for someone other than McConnell to lead the party in the Senate.",
    "(Phil Arballo, a Democrat who raised $5 million in his 2020 challenge to Nunes, is running in the new 13th Congressional District.)",
    "With six weeks left in Pennsylvania’s U.S. Senate primaries, two candidates have forged ahead in Republican and Democratic polling.",
    "ALLENTOWN, Pa. — On Sunday, two Democrats running for U.S. Senate in Pennsylvania delivered their toughest attacks yet on Lt. Gov.",
    "The race rapidly turned into a TV air war, with two self-funders and some supportive PACs unloading every page of the oppo book.",
    "Emil Notti, a Native American activist who lost to Young 49 years ago, is running and pledging to simply serve out the term.",
    "“I’m not just in here to run for a special election to get some sort of title,” Maher said at the February candidate forum.",
    "abandoned his own 15th Congressional District to replace Vela, who announced last year that he would not seek another term.",
    "Just weeks after President Biden’s inauguration, Fetterman launched a new Senate campaign, but he did not clear the field.",
    "Another one of the Republicans who voted to impeach Donald Trump last year is hanging it up instead of seeking reelection.",
    "So they could make more money.”\nOz narrowly trailed McCormick in the weekend's straw poll, but neither candidate won it.",
    "Mayra Flores, the GOP's nominee in the new 34th district, quickly confirmed that she would run in the special election.",
    "Vance for Senate, “Are You a Racist?” Super PACs and individual candidates can't coordinate, but they can sing harmony.",
    "“People know a lot about him, kinda,” Kenyatta said in an interview on Monday, after knocking doors in Philadelphia.",
    "Voters will get to rank their choices from 1 to 4, with ballots tallied up until one candidate cracks 50 percent.",
    "“Look, it’s unfortunate that after Conor saw his poll numbers, he decided to embrace this attack, this smear.",
    "Fetterman was standing 120 miles away, finishing up a mini-tour of places carried by Donald Trump in 2020.",
    "Fifty candidates filed to run by the Friday deadline, but only one has won statewide office before: Palin.",
    "Harper tacks on a policy promise seen in very few ads this year: She wants to expand the Supreme Court.",
    "Black, the elected state agricultural commissioner, has trailed in public polling by up to 60 points.",
    "But Palin, unlike most high profile Trump-endorsed candidates, isn’t running in a Republican primary.",
    "In 2016, Fetterman was one of fairly few Pennsylvania Democrats to back Sanders over Hillary Clinton.",
    "But the poll did not test the next step of the ranked-choice process, to see who'd climb to the top.",
    "Both have shrugged off attacks that their opponents promise will be used against them in November.",
    "The June 11 race will first to be held under a new “top four” system approved by voters in 2020.",
    "“Democrats have no candidates and no plan to hold TX-34,” said NRCC spokeswoman Torunn Sinclair.",
    "Texas's 34th Congressional District will now hold an election just one week later, after Gov.",
    "Don't worry, we'll get there, after we deal with an election actually happening today.",
    "He had skipped previous candidate forums, too, getting negative headlines every time.",
    "“With me, what you get is someone who has already weathered these exact attacks.",
    "“We need to know what McCormick did in China,” said Barnette in an interview.",
    "“It had nothing to do with race and had everything to with community safety.",
    "I was elected by the largest margin ever four months after that episode.",
    "“John made a choice,” U.S. Rep. Conor Lamb told the college audience.",
    "They have a candidate in November: Rep. Vicente Gonzalez (D-Tex.)",
    "Every allegation and question appears in the “Law & Order” font.",
    "I think about Ahmaud Arbery,” said state Rep. Malcolm Kenyatta.",
    "Johnson, a Republican running for the nomination to face Gov.",
    "“They understood what that circumstance was about,” he said.",
    "And Democrats start the special election in a strange bind.",
    "I have been through this and I've come out the winner.",
    "Neither has released their first quarter totals yet.",
    "“But they don’t actually know that much about him.",
    "(That's Donald Trump, if you have to ask.)",
    "Neither group has fully gotten behind him.",
    "And both are confidently blowing it off.",
    "Greg Abbott within the margin of error.",
    "That is the difference.",
    "“Are you a racist?",
    "John Fetterman.",
    "Illinois Gov.",
    "Wisconsin.",
    "New York.",
    "Michigan.",
    "“Why?",
    "Gov.",
    "J.D."
  ]
}