{
  "id": 25883,
  "mediaId": 2752,
  "date": "2022-02-21",
  "headline": "J.D. Vance, Still An A-Hole",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTM5MDEyMC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2NzkwMjgwNH0.DggbgAp-9bwPr5AJseNCkFQKV-FH6504D2aGp5Xc8qo/img.png?width=1200&coordinates=0%2C0%2C0%2C48&height=600",
  "link": "https://www.wonkette.com/j-d-vance-still-an-a-hole",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    13443,
    13592,
    14116,
    14172,
    14192,
    13250,
    14260,
    14332,
    14355
  ],
  "sentences": [
    "Democracy is our best guarantee against war and best assurance of peace.”\nHyping his backstory as a former Marine, Vance boldly declared that “we did not serve in the Marine Corps to go fight Vladimir Putin because he didn't believe in transgender rights.",
    "Michigan State University professor of history Matthew Pauly, who unlike Vance is an actual expert on Russia and Ukraine, told ABC News, \"Ukraine is a democracy, it's the only really functioning democracy of the few in the former Soviet space.\"",
    "During an interview with festering boil Steve Bannon, Vance wondered why America should care that a hostile nation (Russia) that’s attacked our own elections (also Russia) might invade Ukraine (our ally, a democracy).",
    "Which the State Department is saying is a major problem.” Yes, the Russian government’s transgender policies are almost worse than Florida’s, but that has nothing to do with the current crisis.",
    "I got to be honest with you, I don’t really care what happens to Ukraine one way or the other.”\nThat's just sociopathic and shortsighted, which would be an ideal title for Vance’s next book.",
    "Vance should ask Steve Bannon how much “fine wine” he’s enjoyed while \"working-class kids died on the battlefield.”\nAnyway, General McCaffrey earned three Purple Hearts and two Silver Stars.",
    "His comments are those of a stooge for Russian aggression.” Although that’s probably one of the nicest things anyone’s said about Vance recently, it was not an endorsement.",
    "You’d think a former Marine (who worked in Public Affairs) or, well, anyone with proper home training, would refer to McCaffrey as “General” and not “Barry,” but J.D.",
    "We guess McCaffrey is one of the military leaders Carlson and other right-wing commentators have now decided to lump into the liberal \"elite\" they hate so much.",
    "The “conservative populism” that’s seemingly critical of the military-industrial complex is not a potential area of agreement with the Jill Stein far left.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "He’s making a more focused appeal now for Donald Trump supporters, we guess, after internal polling shows him tanking with the MAGA electorate.",
    "He added, \"Although democratization has had sort of a challenging path in Ukraine, it's hard to argue that it is not a democracy.",
    "No, Trump has reportedly been confused by military leaders and troops, because they made personal sacrifices he never would.",
    "The guy who wants to be Ohio’s next senator said, “I think it’s ridiculous that we are focused on this border in Ukraine.",
    "You drank fine wine at bullshit security conferences while thousands of working class kids died on the battlefield.",
    "He commanded the 24th Infantry Division in Desert Storm, which I didn’t know Republicans now considered a failure.",
    "It’s possible Ohio is so MAGA-ed up right now that bashing military heroes is an effective political strategy.",
    "Trump promoted an isolationist foreign policy that was especially convenient for Vladimir Putin’s ambitions.",
    "McCaffrey later pointed out that two of his kids served abroad and two of his grandkids are also serving.",
    "Vance is just playing along with current conservative dogma that the US military is overly “woke.\"",
    "Oh, by the way, how much do you stand to gain financially from a war with Russia, Barry?\"",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "However, most polls indicate Vance won’t even make it out of the GOP primary.",
    "Retired four-star Army General Barry R. McCaffrey tweeted Saturday that “J.D.",
    ": Donald Trump Tells Best Bud Vladimir Putin, Sure, Go Ahead And Keep Crimea.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "I can’t wait to see your loser ass absolutely shamed on election day.",
    "He led the 24th ID in our massive assault into Iraq in Desert Storm.",
    "Hillbilly Elegy author and future failed GOP Senate candidate J.D.",
    "Vance is now parroting Tucker Carlson’s pro-Russia talking points.",
    "Once he loses, he might try to assume a more respectable posture.",
    "Vance\nIraq War veteran Fred Wellman immediately whaled on Vance.",
    "They abide by a code of honor that would make his brain melt.",
    "\"Your entire time in military leadership we won zero wars.",
    "Vance is leaning into his Trump-inspired asshole persona.",
    "He's also on the board of the Portland Playhouse theatre.",
    "Vance is a shameful person unsuitable for public office.",
    "Naturally, Vance picked a fight with the general.",
    "You…were briefly a fucking PAO in an air wing.",
    "His son describes him as a “play typer guy.\"",
    "[McCaffrey] nearly lost his arm in Vietnam.",
    "Please click the clickie, if you are able.",
    "Democracy in Ukraine is worth protecting.",
    "How often would you like to donate?",
    "Vance is not very good at this.",
    "He doesn’t drink wine, either.",
    "He writes reviews for the A.V.",
    ": Everybody Hates J.D.",
    "\"You piece of shit.",
    "This is who J.D.",
    "Don’t let him.",
    "You Earned It!",
    "That's you!",
    "Vance is.",
    "REMEMBER?",
    "REMEMBER?",
    "Coward.\""
  ]
}