{
  "id": 25886,
  "mediaId": 2660,
  "date": "2022-03-04",
  "headline": "Fact-checking whether Biden’s Russia sanctions over Ukraine didn’t start for 30 days, had loopholes",
  "image": "https://static.politifact.com/politifact/rulings/meter-half-true.jpg",
  "link": "https://www.politifact.com/factchecks/2022/mar/04/mike-gibbons/fact-checking-whether-bidens-russia-sanctions-over/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    13764,
    13942,
    14045,
    13372,
    14332,
    14355,
    14357
  ],
  "sentences": [
    "Alan Cole, a former economist with Congress’ Joint Economic Committee and former adviser to U.S. Sen. Mike Lee, R-Utah, wrote in an article cited by Gibbons’ campaign that while the sanctions are \"an impressive effort overall, the sanctions also have a glaring weakness: They largely spare Russia’s all-important energy sector, the backbone of its entire economy, and its agricultural center — the country is a major wheat exporter.\"",
    "Rep. Ted Budd, who is running for the U.S. Senate in North Carolina, and Georgia U.S. House candidate Alan Sims both said the sanctions were \"too little, too late\"; Jeffrey Sossa-Paquette, who is running for a U.S. House in Massachusetts, said the sanctions \"leave out gas and oil.\"",
    "Russia expert Harley Balzer, an emeritus professor of government and international affairs at Georgetown University, told PolitiFact that Biden \"is endeavoring to balance punishing Russia and preventing serious damage in Europe from rising energy prices and threatened supplies.\"",
    "Daleep Singh, a deputy national security advisor and deputy director of the National Economic Council, said at a news conference on the Feb. 24 sanctions:\n\"To be clear: Our sanctions are not designed to cause any disruption to the current flow of energy from Russia to the world.",
    "The Feb. 24 sanctions, according to a Treasury Department news release, targeted \"all of Russia’s largest financial institutions and the ability of state-owned and private entities to raise capital — and further bars Russia from the global financial system.\"",
    "Navin Bapat, a professor of peace and war in political science at the University of North Carolina, said the Feb. 24 sanctions provided for a period of 30 days to allow U.S. financial institutions to wind down their transactions.",
    "The Feb. 22 sanctions focused on two major Russian state-owned financial institutions, imposed restrictions on Russian sovereign debt and sanctioned five \"Kremlin-connected elites,\" according to the U.S. Treasury Department.",
    "We’ve carved out energy payments on a time-bound basis to allow for an orderly transition of these flows away from sanctioned institutions, and we’ve provided other licenses to provide for an orderly winddown of business.\"",
    "The Biden administration, facing the possibility that energy sanctions could lead to higher gas prices in the United States and energy prices abroad, has acknowledged that the energy sector was not a major target.",
    "Besides Gibbons, the Republican candidates include Ohio state Sen. Matt Dolan; former Ohio state treasurer Josh Mandel; former Ohio Republican Party chair Jane Timken; and \"Hillbilly Elegy\" author J.D.",
    "\"The financial sanctions are causing havoc on the Russian stock market, causing the market cap of major Russian firms to drop more than 90% on foreign exchanges and clobbering the ruble,\" he added.",
    "Russia invaded Ukraine Feb. 24, but the United States began imposing sanctions two days earlier, in response to Russia’s deployment of troops into two pro-Russian regions of eastern Ukraine.",
    "In all, between Feb. 22 and March 3, the U.S. imposed 148 sanctions on Russia, according to a running list produced by CORRECTIV, a nonprofit investigative newsroom in Germany.",
    "Featured Fact-check\nGibbons’ campaign cited clauses in the sanctions that allow exceptions for certain financial transactions, including some related to the energy industry.",
    "\"We’ve cut off Russia’s largest bank — a bank that holds more than one-third of Russia’s banking assets by itself — cut it off from the U.S. financial system,\" Biden said.",
    "They prohibited U.S. institutions from participating in purchasing rubles or any other assets from Russian financial institutions after March 1, Bapat said.",
    "\"Biden's sanctions are riddled with loopholes and don't even start for 30 days,\" investment banker Mike Gibbons said in his ad on Facebook and Instagram.",
    "In announcing the Feb. 24 sanctions, Biden said some effects were immediate, but he also alluded to 30 days in terms of assessing their effects.",
    "In ads for their 2022 campaigns, some Republicans are attacking President Joe Biden’s sanctions on Russia as too slow and too weak.",
    "Overall, the Ohio race is rated variously by campaign watchers as \"lean Republican,\" as \"likely Republican\" and \"solid Republican.\"",
    "If Your Time is short\nSome of the U.S. sanctions against Russia took immediate effect, while some were phased in over 30 days.",
    "The Ohio Senate seat Gibbons wants is open because the incumbent, Republican Rob Portman, is not seeking reelection.",
    "One ad is in the race for an open Senate seat in Ohio, which could help determine which party controls the Senate.",
    "Our ruling\nGibbons said Biden's sanctions on Russia \"are riddled with loopholes and don't even start for 30 days.",
    "\"Freezing the Russian Central Bank assets abroad reduced their reserves from $600 billion to $300 billion.",
    "The claim is a mixed bag: Some of the sanctions took immediate effect, some were phased in over 30 days.",
    "They are spending $5 billion to $10 billion per day to keep the ruble from depreciating even more.",
    "Republican and Democratic lawmakers have moved to stop the U.S. from importing oil from Russia.",
    "Both the GOP and the Democratic Senate primaries, to be held May 3, are contested.",
    "Some of the sanctions made a quick impact and some were phased in over 30 days.",
    "Let’s have a conversation in another month or so to see if they’re working.\"",
    "The sanctions we imposed have generated two-thirds of the world joining us.",
    "He added: \"The sanctions we imposed exceed anything that’s ever been done.",
    "All of that has far more immediate impact than the oil and gas sanctions.\"",
    "The energy sector was largely spared, but banks were targeted directly.",
    "The energy sector was largely spared, but banks were targeted directly.",
    "The energy sector was largely spared, but banks were targeted directly.",
    "\"They have carve outs for the energy and financial sectors.\"",
    "Cronies' assets are being confiscated at an increasing pace.",
    "They have carve outs for the energy and financial sectors.\"",
    "The leading Democratic candidate is U.S. Rep. Tim Ryan.",
    "Other Republicans have run ads similar to Gibbons’.",
    "But the Feb. 22 sanctions took effect more quickly.",
    "Gibbons’ ad cited that news release.",
    "They are profound sanctions.",
    "We rate the claim Half True.",
    "Vance."
  ]
}