{
  "id": 25894,
  "mediaId": 2553,
  "date": "2022-03-31",
  "headline": "Rand Paul Warns Sanctions On Russia, China Haven’t Done Anything",
  "image": "https://dw-wp-production.imgix.net/2022/03/Screen-Shot-2022-03-31-at-2.27.40-PM.png?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/rand-paul-warns-sanctions-on-russia-china-havent-done-anything",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Margaret Olohan",
  "authorUrl": "https://www.dailywire.com/author/mary-margaret-olohan",
  "termIds": [
    13429,
    13764,
    14019,
    14192,
    14284,
    14325,
    14332,
    14357,
    14361
  ],
  "sentences": [
    "The Kentucky Republican emphasized “important precepts” of “constitutional foreign policy,” saying that “war should be a last resort, not a first result, that the decision to go to war should be difficult, and that war should never be exercised or begun in our country from the sole decision of one person.”\n“I think if we stick by those, there’s a lot of good things that come from that,” he said.",
    "Can you tell me one behavior Russia has changed because of a sanction?”\nSenator @RandPaul on sanctions at #UpFromChaos this afternoon pic.twitter.com/8r4IL1bv14\n— American Moment (@AmMomentOrg) March 31, 2022\n“I don’t think any of the sanctions we have put on Russia, and we have hundreds, have done anything,” he continued.",
    "“We will continue to target [Russian] President [Vladimir] Putin’s war machine with sanctions from every angle, until this senseless war of choice is over.”\nFellow speakers at the “Up from Chaos” event included “Hillbilly Elegy” author and Ohio GOP senatorial candidate J.D.",
    "Paul also mentioned a “growing movement” of lawmakers within Congress that he is part of “that truly does believe in the constitutional role of congress in war.”\n“I think we are having some successes in making them think twice about intervention,” the senator added.",
    "But once they’re placed on, particularly if they are placed on without any sort of explanation of how they are going to come off…I think the sanctions have no effect and are probably deleterious.”\n\"I don’t think the sanctions we’ve put on Russia have done anything.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "WASHINGTON — Republican Kentucky Sen. Rand Paul questioned Thursday whether sanctions the United States has placed on Russia and China have had any serious effect, warning that sanctions are mostly useful as threats.",
    "Paul spoke Thursday afternoon at the Marriott Marquis in Washington, D.C. at Up From Chaos, an event on conserving American security hosted by The American Conservative and American Moment.",
    "Paul criticized the “intemperate” and “bellicose” remarks of Republican South Carolina Sen. Lindsey Graham, who has suggested that Russian President Vladimir Putin should be assassinated.",
    "His comments come as President Joe Biden’s administration has blacklisted 10 individuals and 17 entities who are reportedly seeking to evade the international sanctions on Russia.",
    "In fact, when representatives from the state department come before my committee, I usually ask them … can you tell me one behavior that Russia has changed because of sanctions?",
    "“These designations will further impede Russia’s access to western technology and the international financial system,” Secretary of State Antony Blinken said in a statement.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "'”\n“I’ve never had a clear answer from one person in the state department on one behavior that has changed,” added Paul.",
    "Vance, Republican Kentucky Rep. Thomas Massive, and Washington state congressional candidate Joe Kent.",
    "“I don’t think any of the sanctions we have put on China have done anything.",
    "The Kentucky senator emphasized the usefulness of “the threat” of sanctions.",
    "I don’t think the sanctions we’ve put on China have done anything.",
    "“We have lots of sanctions on Russia,” Paul told attendees.",
    "“I think sanctions can have leverage as a threat.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "They say ‘Well, um, no.",
    "Believe the same?"
  ]
}