{
  "id": 25906,
  "mediaId": 2656,
  "date": "2022-04-15",
  "headline": "Trump Plans Ohio Senate Endorsement in Crowded Field",
  "image": "https://media.townhall.com/townhall/reu/o/2021/336/913039ea-72aa-493b-bf08-ee37f7d42ac0-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/04/15/trump-plans-ohio-senate-endorsement-in-crowded-field-n1590057",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    13592,
    13702,
    13724,
    13803,
    13901,
    13285,
    13312,
    13372,
    14251,
    14317
  ],
  "sentences": [
    "A collection of more than three dozen county GOP chairs and state party central committee members — including some from the state’s most populous counties — also banded together to sign a letter urging Trump not to endorse Vance, noting that he “referred to your supporters as ‘racists’ and proudly voted for Evan McMullin in 2016.”\n“While we were working hard in Ohio to support you and Make America Great Again,” they wrote in a letter obtained by POLITICO, “JD Vance was actively working against your candidacy.”\nLisa Stickan, the chair of the Cuyahoga County GOP, said a group of county Republican chairs and state central committee members came up with the letter on Thursday after NBC reported that Trump plans to endorse Vance.",
    "An internal Republican poll conducted by the Mandel campaign purportedly showed that with Trump’s endorsement, Mandel would be in front with 33% of the vote, followed by Cleveland Indians (Guardians) executive Matt Dolan and Mike Gibbons tied at 15%, with Vance and former GOP party chair Jane Timken both at 9%.",
    "Trump replied by saying he heard Vance had the best performance during a recent debate — a forum where Mandel nearly took a swing at GOP opponent Gibbons — and remarked that Mandel’s behavior was “embarrassing.” Trump didn’t mention Gibbons during the conversation, according to the person.",
    "But Trump is using a different calculus than local politicians in weighing this decision, which is why he’s likely to go ahead and endorse Vance — perhaps as soon as April 23 during a speech in Delaware, Ohio, just outside of Columbus.",
    "During a late March fundraiser for Ohio GOP congressional candidate Max Miller, two donors and vocal supporters of Mandel put the hard-sell on Trump about endorsing him, according to a person who attended.",
    "But there are three other viable, well-funded candidates in Ohio who, hearing rumblings of Trump’s imminent nod to Vance, frantically tried to get the former president to change his mind.",
    "Currently, Vance is in third place in the latest polls, with former state treasurer Josh Mandel and investment banker Mike Gibbons running almost even and ten points ahead.",
    "Related: Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel\nWith so much opposition to Mandel, is Trump having second thoughts?",
    "Donald Trump has been tight-lipped about who he might endorse in the crowded Republican Senate field in Ohio as candidates woo the former president for his support.",
    "Recent polling by Trump pollster Tony Fabrizio, commissioned by a pro-Vance super PAC, showed Vance catching up to Mandel and Gibbons in a three-way primary.",
    "Trump has stayed out of the Ohio Senate race for the entire year, and some of his advisors question why he should risk endorsing a losing candidate.",
    "Trump appears unconcerned about Vance’s previous NeverTrumpism, although it obviously still rankles with a lot of Ohio Republicans.",
    "Vance, according to NBCNews, which reports that he asked aides to write up an endorsement speech for the candidate.",
    "Mandel partisans sought to convince Trump that even with his endorsement, Vance was a loser.",
    "In recent days, Trump has apparently settled on endorsing Hillbilly Elegy author J.D."
  ]
}