{
  "id": 25927,
  "mediaId": 2570,
  "date": "2022-02-07",
  "headline": "Peter Thiel Leaving Meta Board To Focus On Pro-Trump Politics",
  "image": "",
  "link": "https://www.forbes.com/sites/zacharysmith/2022/02/07/peter-thiel-leaving-meta-board-to-focus-on-pro-trump-politics/?sh=88546bc147e5",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Snowdon Smith",
  "authorUrl": "https://www.forbes.com/sites/zacharysmith/",
  "termIds": [
    13470,
    13592,
    13593,
    13607,
    13702,
    13894,
    14008,
    14357
  ],
  "sentences": [
    "In 2016, Thiel voiced enthusiastic but qualified support for Trump, describing Trump’s comments about women as “clearly offensive and inappropriate,” but suggesting that Trump would help make the U.S. more prosperous by reducing deficits and taking the U.S. out of “undeclared wars.” In 2021, Thiel donated $10 million to groups backing the campaigns of Trump-supported Arizona Senate candidate Blake Masters and Hillbilly Elegy author and venture capitalist J.D.",
    "Thiel also invested in Rumble, a video sharing platform that bills itself as “immune to cancel culture.”\nThiel’s company Founders Fund invested more than $10 million in Boldend, a “cyber warfare” startup that developed tools for hacking Meta-owned messaging platform WhatsApp, a source familiar with the company told Forbes.",
    "Topline\nBillionaire Peter Thiel—one of Facebook’s earliest investors—plans to leave Meta’s board of directors, the company announced Monday, and plans to focus on influencing November’s midterm elections in favor of Trump-aligned candidates, according to an unnamed source cited by the New York Times.",
    "Key Facts\nThiel became increasingly outspoken in favor of Trump, speaking at the 2016 Republican National Convention and defending Trump’s “Muslim ban” in 2017, and as Facebook moved to ban Trump from its platform, his position on the board became increasingly contentious.",
    "In his 2022 book Our Journey Together, Trump decried Zuckerburg’s “censorship” and campaign contributions and claimed that Zuckerberg visited the White House to curry favor with him.",
    "Thiel and Meta CEO Mark Zuckerberg issued statements representing Thiel’s departure as amicable and warmly praising one another for their personal and professional qualities.",
    "In January, Thiel and Donald Trump Jr. co-hosted two fundraisers for Harriet Hageman, a Republican primary challenger to Rep. Liz Cheney (R-Wyo.",
    "), who on Friday was censured by the Republican National Committee for serving on a House committee investigating the January 6 riot.",
    "Trump’s relationship with Meta has soured since he was subjected to a two-year Facebook ban in 2021, following the Capitol riot.",
    "Truth Social, an alternative social media platform from Trump Media and Technology Group, is scheduled to launch February 21.",
    "Vance, an Ohio Senate candidate who has fought to rebrand himself as pro-Trump despite previous harshly critical comments.",
    "Thiel was one of Facebook’s first large investors, investing $500,000 in the company in 2004."
  ]
}