{
  "id": 25958,
  "mediaId": 2912,
  "date": "2022-02-07",
  "headline": "Peter Thiel to exit board of Facebook parent Meta to support Trump-aligned candidates",
  "image": "https://www.staradvertiser.com/wp-content/uploads/2022/02/web1_20220207_brk_pth01.jpg",
  "link": "https://www.staradvertiser.com/2022/02/07/breaking-news/peter-thiel-to-exit-board-of-facebook-parent-meta-to-support-trump-aligned-candidates/",
  "mediaOutlet": "HonululuAdvertiser",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13470,
    13592,
    13600,
    13702,
    13894,
    14008,
    13209
  ],
  "sentences": [
    "In 2019 and 2020, as Facebook grappled with how to deal with political speech and claims made in political advertising, Thiel urged Zuckerberg to withstand the public pressure to take down those ads, even as other executives and board members thought the company should change its position.",
    "In October at a Miami event organized by a conservative technology association, he said he would “take QAnon and Pizzagate conspiracy theories any day over a Ministry of Truth.”\nThiel’s investing has also clashed with his membership on Meta’s board.",
    "But scrutiny of Thiel’s position on the board has steadily increased as the company was embroiled in political controversies, including barring Trump from the platform, and as the venture capitalist has become more politically active.",
    "In October, the two Senate candidates argued in an opinion piece in the New York Post that Zuckerberg’s $400 million in donations to local election offices in 2020 amounted to “election meddling” that should be investigated.",
    "His talents will serve Meta well as he leads the company into a new era.”\nThiel first met Zuckerberg 18 years ago when he provided the entrepreneur with $500,000 in capital for Facebook, valuing the company at $4.9 million.",
    "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nIn a statement today, Thiel said: “It has been a privilege to work with one of the great entrepreneurs of our time.",
    "He invested in a company that became Clearview AI, a facial-recognition startup that scraped billions of photos from Facebook, Instagram and other social platforms in violation of their terms of service.",
    "In 2020, when Trump’s incendiary Facebook posts were put under the microscope, critics cited Thiel’s board seat as a reason for Zuckerberg’s continued insistence that Trump’s posts be left standing.",
    "He counseled the company through its early years of rapid user growth and through its difficulties shifting its business to mobile phones about the time of its 2012 initial public offering.",
    "Thiel’s political influence and ties to key Republicans and conservatives have also offered a crucial gateway into Washington for Zuckerberg, especially during the Trump administration.",
    "Thiel sees the midterms as crucial to changing the direction of the country, this person said, and he is backing candidates who support the agenda of former President Donald Trump.",
    "The company, which recently marked its 18th birthday, is undertaking a shift toward the so-called metaverse, which Zuckerberg believes is the next generation of the internet.",
    "The 10-member board has undergone significant changes in recent years, as many of its members have left and been replaced, often with Silicon Valley entrepreneurs.",
    "“Peter has been a valuable member of our board and I’m deeply grateful for everything he’s done for our company,” Meta CEO Mark Zuckerberg said in a statement.",
    "Among those House candidates are three people running primary challenges to Republicans who voted in favor of impeaching Trump for the events of Jan. 6, 2021.",
    "Thiel, 54, wants to focus on influencing November’s midterm elections, said a person with knowledge of Thiel’s thinking and who declined to be identified.",
    "Vance, who used to work at one of Thiel’s venture funds, and Masters, chief operating officer of Thiel’s family office, have railed against Facebook.",
    "Founders Fund also invested in Boldend, a cyberweapons company that claimed it had found a way to hack WhatsApp, a Meta-owned messaging platform.",
    "Over the past year, Thiel, who has a net worth estimated at $2.6 billion by Forbes, has become one of the Republican Party’s largest donors.",
    "He has also been seen as the contrarian who has Zuckerberg’s ear, championing unfettered speech across digital platforms when it suited him.",
    "Last year, he gave $10 million each to the campaigns of two proteges, Blake Masters, who is running for a Senate seat in Arizona, and J.D.",
    "Recently, Thiel has publicly voiced his disagreement with content moderation decisions at Facebook and other major social media platforms.",
    "That gave Thiel, who with his venture firm Founders Fund controlled a 10% stake in the social network, a seat on its board of directors.",
    "Facebook banned Trump’s account last year after the Jan. 6, 2021, storming of the U.S. Capitol, saying his messages incited violence.",
    "In the past year, Thiel, who also is chair of software company Palantir, has increased his political giving to Republican candidates.",
    "In 2016, Thiel was one of the few tech titans in largely liberal Silicon Valley to publicly support Trump’s presidential campaign.",
    "Peter Thiel, one of the longest-serving board members of Meta, the parent of Facebook, plans to step down, the company said today.",
    "Thiel has been on Meta’s board since 2005, when Facebook was a tiny startup and he was one of its first institutional investors.",
    "Drew Houston, CEO of Dropbox, joined Facebook’s board in 2020, and Tony Xu, founder of DoorDash, joined it last month.",
    "The episode became a key rallying point for conservatives who say that mainstream social platforms have censored them.",
    "Last week, Meta reported spending more than $10 billion on the effort in 2021, along with mixed financial results.",
    "He funded a secret war against media website Gawker, eventually resulting in the site’s bankruptcy.",
    "His conservative views also gave Facebook’s board what Zuckerberg saw as ideological diversity.",
    "Ahead of the midterms, he is backing three Senate candidates and 12 House candidates.",
    "Facebook and Zuckerberg have long taken heat for Thiel’s presence on the board.",
    "The departure means Meta loses its board’s most prominent conservative voice.",
    "Mark Zuckerberg’s intelligence, energy and conscientiousness are tremendous.",
    "In October 2019, Zuckerberg and Thiel had a private dinner with Trump.",
    "That wiped more than $230 billion off the company’s market value.",
    "Since then, Thiel has become a confidant of Zuckerberg’s.",
    "Meta didn’t address whether it intends to replace Thiel.",
    "But Thiel’s views on speech were at times contradictory.",
    "This article originally appeared in The New York Times.",
    "Meta declined to comment on Thiel’s investments.",
    "Vance, who is running for Senate in Ohio.",
    "Zuckerberg sided with Thiel."
  ]
}