{
  "id": 25982,
  "mediaId": 3987,
  "date": "2022-04-06",
  "headline": "Republicans Continue to Warn of an “Invasion” at the Southern Border – That Doesn’t Exist",
  "image": "http://americasvoice.org/wp-content/uploads/2022/01/GOP-1200x800.png",
  "link": "https://americasvoice.org/blog/republicans-continue-to-warn-of-an-invasion-at-the-southern-border-that-doesnt-exist/?utm_source=rss&utm_medium=rss&utm_campaign=republicans-continue-to-warn-of-an-invasion-at-the-southern-border-that-doesnt-exist",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Mueller",
  "authorUrl": "",
  "termIds": [
    13463,
    13606,
    13752,
    13764,
    13831,
    13921,
    14113,
    13312,
    14327
  ],
  "sentences": [
    "For example, Stephen Miller on Hannity on April 3: “the southern border is the perfect place for new viruses, new variants, and evolutions of this disease to spread … the decision to end what’s left of Title 42 will end the peace, calm and total security of the Trump era into an utter nightmare, an illegal immigration apocalypse.” Similar baseless and xenophobic arguments have long been deployed to thwart efforts to allow new migrants to seek refuge on America’s shores.",
    "This is how nations end.”\nNational Border Patrol Council President Brandon Judd appeared on a segment with Fox News anchor Bill Hemmer to discuss the Title 42 news on April 4 and said, “I believe that they’re trying to change the demographics of the electorate; that’s what I believe they’re doing.” Later that evening, House Minority Leader Kevin McCarthy invited Judd to a roundtable hearing and offered no criticism of his white nationalist comments earlier that day.",
    "Every day the southern border is left unsecured is an impeachable offense.” The wealthy former Ambassador to Denmark’s words struck an disturbing similar tone as the anti-Semitic gunman who wrote, “HIAS (the Hebrew Immigrant Aid Society) likes to bring invaders that kill our people” before he murdered 11 people at the Tree of Life Synagogue in Pennsylvania in 2018.",
    "Republicans increasingly claim that the arrival of people at the border to exercise their legal right to apply for refugee status constitutes an “invasion.” In fact, the border has never been more secure, the border security apparatus has never been better funded, and the effectiveness of agents in apprehending those who cross our border has never been higher.",
    "Millions of people are pouring in, descending into our communities, camping in our towns, depleting our resources, flouting our laws, and are bringing crime, drugs, and death to the streets of our communities.”\nOnce the provenance of white nationalists, these absurd and dangerous conspiracy theories are now central to the Republican party’s political attacks.",
    "Here are a few examples of leading voices in the Republican party deploying this racist fiction in response to the news about the ending of Title 42:\n“We are being invaded by millions and millions of people,” Former President Donald Trump falsely told his crowd at his rally in Washington Township, Michigan, on April 2.",
    "Legitimizing dehumanization by comparing real humans desperate for safety to natural disasters like “tsunamis,” as the Washington Post Editorial Board did in their lede last week, only adds to the Republican political narrative and comes at the expense of the reader’s deeper understanding of the issue.",
    "In the coming two months, as the program hopefully comes to an end, Republicans are likely to continue their breathless attacks employing white nationalist conspiracy theories; at the very least, the rest of us can reject their lies and dehumanizing rhetoric.",
    "“The shortfall of immigrants over the past two years has had immediate adverse consequences for filling jobs and also harms the long-run prospects for the U.S. economy,” as UC Davis labor economists Giovanni Peri and Reem Zaiour, among others, point out.",
    "Carla Sands, a leading candidate in the US Senate GOP primary race in Pennsylvania, took to Twitter on April 4, warning, “Joe Biden has surrendered our border to criminals and traffickers and welcomed an army of invaders to cross the southern border.",
    "As Republicans turn away from legitimate discourse, preferring instead to trade in racist fiction, it is even more incumbent for all of us to challenge their narrative and respect the dignity of others despite the challenges they may present.",
    "So from a COVID-control standpoint, a border-control standpoint and an economic standpoint – not to mention from a humanitarian standpoint – Stephen Miller’s Title 42 policy and Republican efforts to keep it in place are policy disasters.",
    "Steven Bannon, a former Senior Strategist to Donald Trump whose program the “War Room” reaches some 3.5 million people each month, fretted about “the invasion of the southern border when Title 42 comes off,” on his show on March 31.",
    "Joe Biden and his Far Left policies are destroying our country.”\nFormer Senior Advisor to Donald Trump and the chief architect behind the implementation of Title 42, Stephen Miller, claimed, “This will mean armageddon on the border.",
    "The idea that the same Republican party who has been crowing about mask mandates and resisting vaccines and other COVID measures is now acting in good faith around a concern for the spread of COVID should be dismissed out of hand.",
    "This is despite the fact that both notions are connected to the racist “replacement theory” popularized through the chants of “Jews will not replace us” on the streets of Charlottesville, Virginia in the summer of 2017.",
    "Republicans’ embrace of white nationalists lies to score political points is concerning on its own, but it is compounded when mainstream outlets adopt dehumanizing language with an indifference to the relevant context.",
    "Elected members in Congress have begun to move this racist conspiracy theory as well:\nRep. Jim Banks (IN-03) wrote: “If Title 42 ends, illegal immigrants will account for most of America’s population growth next year.",
    "For those who were kept out by closing ports of entry and blocked from making asylum claims via Title 42, there very well may be pent-up demand to request asylum when Title 42 no longer blocks them from doing so.",
    "A deliberate fabrication that Republicans are embracing out of a cynical political calculation, it has nothing to do with the health and safety of Americans and everything to do with their nativist agenda.",
    "And while the number of encounters with migrants seeking to enter the U.S. has spiked significantly since Title 42 was instituted, we are catching, detaining or deporting more of the migrants than ever.",
    "However, when Republicans do address the veneer of public health, they often trade in the same sort of xenophobic misinformation and racist fictions when trying to establish this disingenuous claim.",
    "Despite the lack of a sound justification for such a blanket approach to denying asylum claims, the Trump administration used the opportunity to further its cruelty and chaos approach to the border.",
    "This pseudo-legal argument is advanced by a number of Republicans, including the Attorney General of Arizona, Mark Brnovich, whose office issued a “legal opinion” supporting the “invasion” claim.",
    "Third-ranking House Republican, Elise Stefanik again waded into this racist conspiracy theory writing “Ending Title 42 will worsen the already catastrophic invasion at our Southern Border.",
    "Finally, while Republicans are ratcheting up immigration “invasion” hysteria, it is important to note that actual immigration is way down and is having an impact on the U.S. economy.",
    "While legally laughable, Brnovich was trying to establish the legal authority for states to unilaterally authorize the use of military force against migrants seeking a better life.",
    "The Biden administration knows this, and they’re complicit in this continued invasion.”\nRep. Lance Gooden (TX-05) wrote: “What’s going on at the southern border is not immigration.",
    "Republicans have recently increased their xenophobic rhetoric in response to the announcement that the Biden administration will finally end the unjustified use of Title 42.",
    "Or, as Trump argued in his keynote speech at CPAC in February, “we are losing our country, no different than if we lost it in a war, no different, no different.",
    "The eighty-year-old public health law was contorted by Stephen Miller in 2020 to deny people the opportunity to apply for refugee status under established law.",
    "In response to the news of Title 42, Rep. Marjorie Taylor Greene incorrectly cited the Constitution’s Article 4 as a means of protection against invasion.",
    "Ending the program simply returns our asylum system to a pre-pandemic state, which, as we know, was already very restrictive and decades out of date.",
    "It turbocharged recidivism, inflated the number of “border encounters,” and prevented the use of consequence delivery mechanisms under existing law.",
    "Ideas that have since been echoed by mass murderers who attacked Christchurch, the Tree of Life Synagogue in Pittsburgh, and the Walmart in El Paso.",
    "Those who are caught multiple times trying to enter the country illegally will face federal felony charges that they do not face under Title 42.",
    "Republicans, however, are seeing the ending of Title 42 as an opportunity for a disingenuous political attack in the run-up to the midterms.",
    "Many in the GOP go further, arguing that Democrats are intentionally letting in immigrants and refugees to “replace” white Americans.",
    "A major win for Joe Biden, and a major loss for America.”\nRep. Michael Cloud (TX-27) wrote: “This is a complete dereliction of duty.",
    "Warnings of an “invasion” or assertions about a Democrat ploy to “change the demographics” of the country have become commonplace.",
    "According to the U.S. Census Bureau, net immigration to the United States in 2021 was just one-quarter of what it was in 2016.",
    "This is not just a problem of the far edges of the party, but something that has been embraced by leading Republican voices.",
    "Critically, these baseless conspiracy theories also entirely ignore the alleged public health justification for Title 42.",
    "Judd is also a sought-after voice for Republicans as they seek his endorsement and appearances in their political ads.",
    "Without Title 42, our Border Patrol officers will experience an illegal immigrant surge at record-shattering levels.",
    "Many Republicans emphatically argue their fictional “invasion” is, in fact, real, even justifying military force.",
    "Removing Title 42 would actually cut down on the number of migrants repeatedly trying to enter the country.",
    "The embrace of these racist fictions has become as predictable and ubiquitous as it is disturbing.",
    "Not to mention, the exact same dog-whistle language was employed by Trump and Republican J.D.",
    "(For example, check out our reporting on the top of the ticket races in Arizona and Ohio).",
    "They want to boost turnout by scaring voters with white nationalist conspiracy theories.",
    "Madness.”\nThis kind of language is more than irresponsible hyperbole for Republicans.",
    "Putin sent 150,000 troops into Ukraine and we are ready to set fire to the world.",
    "They are organizing their midterm messages around this racist conspiracy theory.",
    "It’s an invasion.”\nRep. Paul Gosar (AZ-04) wrote: “This is full scale invasion.",
    "Those who request asylum and are rejected will still be expelled.",
    "Doing so again won’t bring on the “apocalypse” Miller predicts.",
    "Now, even the thinly veiled pretext is largely dismissed.",
    "Eliminating Title 42 will only add fuel to the fire.",
    "But America has managed asylum claims for decades.",
    "By all objective measures, it has been a failure.",
    "Ultimately, hoping to completely end asylum.",
    "This is 540,000 in one month.",
    "Vance."
  ]
}