{
  "id": 25991,
  "mediaId": 2540,
  "date": "2022-03-09",
  "headline": "Trump remains undecided on whether he should endorse in Ohio’s crowded GOP Senate primary",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211030104629-donald-trump-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/09/politics/trump-ohio-primary/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr",
  "authorUrl": "https://www.cnn.com/profiles/gabby-orr",
  "termIds": [
    13572,
    13592,
    13803,
    13954,
    14085,
    13285,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "That was true in 2017 when President Trump endorsed her to lead the Ohio Republican Party … and it’s true today as to why everyone from Senator Portman to Kellyanne Conway, Senator Joni Ernst to Congresswoman Elise Stefanik, and over 180 Ohio conservative leaders are supporting her campaign.”\nTrump faces a dilemma as primary day approaches\nOn the heels of last week’s congressional and gubernatorial primary elections in Texas, Trump took a victory lap as most of his chosen candidates largely prevailed or advanced to runoff contests.",
    "“We expect the Democrats to highlight it and it’s not worth taking the risk.”\nAnother Trump adviser said the former President’s “fear is (that) these records are released during a general election and a shoo-in quickly turns into an embarrassing loss,” while a third adviser said that “everyone down at Mar-a-Lago is pretty cognizant and aware of this situation.”\n‘No good options’\nThe former state treasurer isn’t the only candidate about whom Trump has reservations.",
    "Trump also remains hung up on Vance’s sharp criticism of him during the 2016 GOP presidential primary – something Ohio voters were reminded of in a spate of ads the Club for Growth ran late last year that featured footage of Vance calling Trump an “idiot” and “offensive.” The club, which has endorsed Mandel, hoped the ads would impair Vance’s image in a state Trump won by 8 percentage points in 2020.",
    "After Vance mentioned the AP story during a campaign stop last month, Gibbons released an op-ed describing the Ohio primary as a “vicious arena where craven political opportunists seize on any and every opportunity to mischaracterize their opponents” and defending himself as “100 percent pro-life.”\n“I ask every pro-life voter to look beyond the sound bites and the petty attacks.",
    "Though Trump is in talks with Republican Mike Gibbons’ campaign about a possible meeting with the Cleveland-based investment banker, two people familiar with the matter said Trump has told allies that he finds Gibbons underwhelming even as Gibbons has tapped a trio of former Trump aides – including 2020 campaign manager Bill Stepien – to advise his campaign.",
    "Trump has not yet scheduled a meeting with Gibbons, according to a person familiar with the matter, but has been paying close attention to his campaign, which has launched a multimillion-dollar ad buy touting his business acumen and casting two of his rivals, Vance and former Ohio Republican Party chair Jane Timken, as faux Trump supporters.",
    "As a Republican candidate for Senate in the 2018 cycle, Gibbons told The Associated Press in an interview that he personally opposed abortion and supported overturning Roe v. Wade, the Supreme Court case that established a constitutional right to the procedure, but was “not a woman” and thus wouldn’t choose for them.",
    "While the former President is still unsure about Gibbon’s viability in the general election, one person close to Trump said he has also been warned by some of his advisers that backing Gibbons could irritate Trump’s religious supporters given a recent controversy over past comments Gibbons has made about abortion.",
    "“When there are conflicting alliances and nobody has really broken away from the pack, I don’t think he will do anything.”\nMultiple people close to Trump said Timken’s biggest misstep was her defense last year of Ohio Rep. Anthony Gonzalez, one of 10 House Republicans who voted to impeach Trump.",
    "In recent weeks, Trump has expressed concern about the general election viability of former Ohio state Treasurer Josh Mandel, who abruptly ended his 2018 Senate campaign over a still-undisclosed health issue that said his then-wife was facing and whose sealed divorce file has given Trump pause.",
    "Asked about Mandel’s sealed divorce filing, a campaign spokesman noted that Mandel and his ex-wife, Ilana Shafran, who told The Cincinnati Enquirer last year that she was willing to “help elect” him, have jointly made records related to their divorce available to members of the media.",
    "Former Trump adviser Bryan Lanza, who doesn’t expect Trump to make an endorsement before Ohio’s May 3 primary, said the involvement of so many Trump allies in the Ohio Senate race has made it increasingly difficult for the former President to bet on a single candidate in the primary.",
    "Despite the fast-approaching Ohio primary, the former President has signaled to aides that he isn’t in a rush to get behind one of the candidates who have sought his endorsement and prefers to see if the field narrows or a definitive front-runner emerges over the next few weeks.",
    "The Mandel spokesman also pointed to a March 12, 2021, court filing in which Judge Ronald Forsthoefel, who initially sealed their divorce records, argued for the dismissal of a lawsuit brought by the Enquirer, which requested that the divorce filing be unsealed in its entirety.",
    "Others in Trump’s orbit who are affiliated with the various campaigns want him to act now, hoping that an endorsement would propel their candidate to the front of the pack and force the field to narrow by causing some of the other Trump-aligned candidates to drop out.",
    "Gibbons and Mandel are currently leading the pack of Senate Republican contenders in Ohio, according to a Fox News poll released Tuesday that found Gibbons with 22 percent support and Mandel with 20 percent – a difference within the poll’s 3-point margin of error.",
    "Also competing for Trump’s endorsement is Timken, whom the former President was on the brink of endorsing last spring until he was talked out of it by top advisers – including his eldest son, Donald Trump Jr., who has developed a close relationship with Vance.",
    "Trump’s misgivings about getting involved stem from concerns he has about each of the four candidates seeking his support – concerns that have been exacerbated in recent months by how other Republican hopefuls with his backing have fared in their primaries.",
    "Moreover, the former President has become noticeably more cautious about doling out Senate endorsements since his preferred candidate in Pennsylvania – Sean Parnell – suspended his campaign last November amid an ugly custody battle with his estranged wife.",
    "Later this month, the five leading candidates in the GOP race – Gibbons, Mandel, Timken, Vance and state Sen. Matt Dolan, a moderate who has not actively lobbied for Trump’s endorsement – will participate in an hourlong televised debate for the first time.",
    "But the former President made no promises during the meeting and remains uneasy about getting behind Vance, who has struggled to pull away from the rest of the candidates, both in polling and enthusiasm on the ground, one of these people said.",
    "In a February 2021 story, the Enquirer said the records that were made available by Mandel’s campaign detailed the couple’s custody arrangements, income, and assets, but offered limited insight into why they chose to dissolve their marriage.",
    "CNN —\nLess than two months out from the Ohio Senate primary, aides and allies of former President Donald Trump tell CNN he is still uncertain about endorsing one of the four Trump-aligned candidates vying to succeed retiring GOP Sen.",
    "While Mandel and his ex-wife have made records related to their divorce available to reporters since the outset of his 2022 campaign, Trump has told allies that he is concerned about Mandel’s viability in a general election contest.",
    "Forsthoefel said that the records Mandel’s campaign shared with the Enquirer and other press outlets “accurately reflect the source documents on file with the Court,” according to a copy of his motion to dismiss that CNN obtained.",
    "“He’s been sizing people up directly in individual meetings but is a ways away from making a decision,” said one of the Trump advisers, noting that he has already met with three of the four Ohio candidates seeking his support.",
    "Brooks has struggled to widen the gap against his competitors and is now widely expected to face a runoff contest that he had initially hoped to avoid, while Perdue has been massively outraised by incumbent GOP Gov.",
    "Now, as he looks to Ohio and other primary contests occurring in May, some of Trump’s top advisers have told him endorsements in these states could provide far less reliable odds for maintaining his winning streak.",
    "Trump has also been paying close attention to Timken’s embrace of Portman, who endorsed her last month to succeed him in the Senate but has been far from a Trump acolyte inside the upper chamber over the past year.",
    "Former Trump campaign manager Kellyanne Conway, who serves as a senior strategist for Timken’s campaign, told CNN that Trump and Portman spoke by phone before the outgoing Ohio senator formally endorsed Timken.",
    "Despite endorsing Brooks in deep-red Alabama, where the tide of MAGA supporters remains strong, the GOP congressman has struggled to fend off opponents in the primary who lack the coveted Trump endorsement.",
    "Though Timken eventually walked back her support for Gonzalez and called on him to resign, her comments are “seared in [Trump’s] memory and he’s not a forgiving person,” said one Trump adviser.",
    "“Very sad that the RINOs in the House and Senate gave Biden and Democrats a victory on the ‘Non-infrastructure’ Bill,” Trump said in a statement in November after the House passed the bill.",
    "“He’s freaked out that he’s endorsing people who aren’t winning,” said one person close to Trump, citing Alabama Senate hopeful Mo Brooks and Georgia gubernatorial candidate David Perdue.",
    "Despite recently hiring two of Trump’s longtime confidantes, David Bossie and Corey Lewandowski, as campaign consultants, Timken has struggled to regain the former President’s favor.",
    "Conway described it as “a very cordial conversation.”\nIn a separate statement, Timken spokeswoman Mandi Merritt said, “Jane has always been a candidate of addition, not subtraction.",
    "In private conversations with Trump, they have argued that his endorsement carries enough weight in a state like Ohio to ensure that whoever he endorses would win the primary.",
    "More than half a dozen sources close to Trump, many of whom requested anonymity to speak candidly about his thinking, described the Ohio Senate primary as a thorn in his side.",
    "Portman has been critical of Trump’s role in the January 6, 2021, insurrection at the US Capitol, after which he voted to certify the 2020 election results without objection.",
    "“It’s hard to imagine him staying out,” said one person familiar with Trump’s thinking, who said the former President is approaching “crunch time” to make a decision.",
    "Trump has since refrained from endorsing a different Republican in that race and has also withheld endorsements so far in the Arizona and Missouri Senate primaries.",
    "With no discernable front-runner and his allies working for competing candidates, Trump feels he has “no good options,” said one of the people close to him.",
    "Four people familiar with the matter said that what transpired in Pennsylvania with Parnell has cast a shadow over the primary in neighboring Ohio.",
    "The North Carolina Senate primary has similarly shown a tight two-man race between Rep. Ted Budd, who has Trump’s backing, and former Gov.",
    "Trump recently met with conservative tech mogul Peter Thiel at Mar-a-Lago to hear his case for endorsing “Hillbilly Elegy” author J.D.",
    "However, the same poll also found that nearly a quarter of Republican primary voters (24%) remained undecided about who to support.",
    "a lot but hasn’t quite gotten over his criticism and is less than impressed with his polling,” said one of the Trump advisers.",
    "He was also one of 19 Republican senators who voted for the Biden administration’s $1 trillion infrastructure bill in August.",
    "He is also working with Trump campaign attorney Justin Clark and former 2016 Trump campaign adviser Michael Biundo.",
    "“With so many candidates and such a tight window, he doesn’t know who to pick,” said Lanza.",
    "“We could lose a seat with (Mandel) and Trump doesn’t want to be responsible for that.",
    "Trump is likely to pay close attention to how the debate plays out, one ally said.",
    "Gibbons used the phrase “pro-people” to describe his views at the time.",
    "Rob Portman and may wait until the 11th hour if he decides to wade in.",
    "But Trump has seen for himself that lately that isn’t always the case.",
    "He doesn’t want to pick a loser in Ohio,” said one Trump adviser.",
    "A spokesperson for Vance declined to comment on the record.",
    "So far, he has been receptive to their cautionary warnings.",
    "Vance, according to two people familiar with the meeting.",
    "Then make your decision,” Gibbons wrote in the op-ed.",
    "(Gonzalez has since declined to seek reelection.)",
    "Look into our life stories.",
    "Pat McCrory, who does not.",
    "Look into our hearts.",
    "“He likes J.D.",
    "Brian Kemp."
  ]
}