{
  "id": 26049,
  "mediaId": 2752,
  "date": "2022-02-28",
  "headline": "J.D. Vance Pretty Sure You Can’t Care About Both Ukraine, Your Own Mother At Same Time",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTQzNzk3MC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY4OTA4MDA3Nn0.Dweu04JrvtyocNoaI5qfVOLUSiT4XCzoyYqvJcnErwI/img.png?width=1200&coordinates=0%2C0%2C0%2C198&height=600",
  "link": "https://www.wonkette.com/j-d-vance-pretty-sure-you-cant-care-about-both-ukraine-your-own-mother-at-the-same-time",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    13702,
    14114,
    14172,
    14192,
    14193,
    13169,
    14328,
    14331,
    14332,
    14355
  ],
  "sentences": [
    "Last week, he literally didn’t \"care one way or another.” Then he started fawning over Donald Trump’s imaginary “strength and diplomatic engagement that kept Putin in check” while blasting President Joe Biden’s “lack of leadership,” because politics no longer ends at the water’s edge.",
    "He said:\nI’ve got a lock of flak in the last week because I had the audacity to suggest that before our leaders obsess over a Ukrainian/Russian border 6,000 miles away, maybe they better guarantee the sovereignty of their own country and their own border first.",
    "I’m sick of being told that we have to care more about people 6,000 miles away than we do people like my mom and my grandparents ...\nPeople who care about human suffering thousands of miles away can also care about their loved ones.",
    "There is a humanitarian crisis at the US border, but America’s sovereignty isn’t at stake unless you’re a white nationalist freak show like Tucker Carlson who’s apparently afraid migrants will fuck the white out of America.",
    "He wants Americans to believe we have a limited supply of compassion and it’s foolish to freely share it with others “6,000 miles away.” That’s the solipsistic worldview of a sociopath and it’s worthy only of our contempt.",
    "Anyone with a short-term memory and access to Google knows damn well that what Vance actually said was \"I think it’s ridiculous that we are focused on this border in Ukraine.",
    "Vance continued grossly:\nWe have a leadership in this country that is constantly focused on stuff that has nothing to do with citizens in our country.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Short-sighted “America First” isolationism claims we can’t be bothered with an international crisis unless everything’s perfect in America.",
    "World War II is just one of many examples of why it’s a bad idea for America to look the other way when a madman runs rampant in Europe.",
    "And while Vance will never admit this, Biden’s Build Back Better bill would’ve addressed issues impacting people like his mother.",
    "Instead, Republicans, with Joe Manchin’s help, pretend as if Build Back Better would only ban cars and make everyone transgender.",
    "Vance took a defiantly callous tone again during his appearance at the Conservative Political Action Conference (CPAC).",
    "Vance is a small, petty man, who especially pales next to a true leader such as Ukraine President Volodymyr Zelenskyy.",
    "Russians aren’t crossing Ukraine’s border to pick tomatoes and maintain low labor costs for big-name companies.",
    "Russia conquering Ukraine would also imperil our NATO allies Poland, Hungary, and Romania, among others.",
    "I got to be honest with you, I don’t really care what happens to Ukraine one way or the other.\"",
    "Vladimir Putin made the stakes very clear with his increasingly deranged remarks last week.",
    "Vance has been all over the place regarding his response to Russia’s invasion of Ukraine.",
    "This is actually more serious than all the CPAC whining about critical race theory.",
    "Vance, Still An A-Hole\nWhat’s happening in Ukraine isn’t a mere border dispute.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "It has nothing to do with serving middle-class citizens of my state of Ohio.",
    "America is a global superpower that has a moral obligation to its allies.",
    "These are troops with guns who are trying to seize the capital.",
    "It’s not the zero sum game Vance seemingly wants to play.",
    "He's also on the board of the Portland Playhouse theatre.",
    "Ladies and gentlemen, it’s just time to stop.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "It’s about Ukraine’s right to exist.",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "GOP Senate candidate J.D.",
    "PREVIOUSLY: J.D.",
    "I’m sick of it.",
    "That's you!"
  ]
}