{
  "id": 26055,
  "mediaId": 2550,
  "date": "2022-02-24",
  "headline": "Many Ukrainians now regret giving up their nuclear arsenal for worthless Russian security guarantee",
  "image": "https://images.dailykos.com/images/1041463/story_image/GettyImages-1238724008.jpg?1645709983",
  "link": "https://www.dailykos.com/stories/2022/2/24/2079904/-Many-Ukrainians-now-regret-giving-up-their-nuclear-arsenal-for-worthless-Russian-security-guarantee?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charles Jay\nCommunity",
  "authorUrl": "/users/charles jay",
  "termIds": [
    13420,
    13592,
    14192,
    14210,
    14286,
    14332,
    14355
  ],
  "sentences": [
    "2014 New York Times op-ed piece, Russian journalist Maxim Trudolyubov, who now writes for the independent Moscow Times, wrote: “The Kremlin now sees international treaties concerning Ukraine, including the Budapest Memorandum to the 1994 Nuclear Nonproliferation Treaty that guarantees Ukraine’s territorial integrity, as null and void.”\nThe Obama administration, with Secretary of State Hillary Clinton and Vice President Joe Biden taking lead roles, did try to uphold its security commitments to Ukraine under the Budapest Memorandum by imposing strong economic sanctions that weakened the Russian economy.",
    "It was a far cry from the 2012 presidential race when Republican nominee Mitt Romney declared that he considered Russia to be the country’s “number one geopolitical foe.”\nTrump’s remarks prompted Ukraine’s ambassador to the U.S., Valeriy Chaly, to take the extraordinary step of writing an opinion piece on Aug. 4, 2016, in which he accused Trump of calling for “appeasement of an aggressor.”\nChaly said a candidate for president in any country should “uphold his or her country’s international commitments,” specifically referring to the Budapest accord.",
    "… I know him very well.”\nThat prompted this response from White House press secretary Jen Psaki at her Tuesday briefing: “Well as a matter of policy, we try not to take advice from anyone who praises President Putin and his military strategy, which I believe is what happened there, expresses an openness to lifting sanctions about the seizing of territory in Crimea; or at any point in time, told leaders of the G7 that Crimea is a part of Russia, regardless if they are a former president.",
    "“We cannot but react to this real danger, all the more so since, let me repeat, Ukraine’s Western patrons may help it acquire these weapons to create another threat to our country.”\nActually, Ukraine turned the remains of its once-formidable nuclear arsenal into a tourist attraction, putting them on display at the Strategic Missile Forces Museum, which opened in 2001 on the site of a former missile base near the town of Pobuzke, about 160 miles south of Kyiv.",
    "He said neglecting the cause of a young democracy fighting for its independence and its choice to be part of the West “would send a wrong message to the people of Ukraine and many others in the world who look to the U.S. as a beacon of freedom and democracy.”\nOn Inauguration Day, Trump’s first national security adviser, retired Gen. Michael Flynn, said sanctions on Russia would be “ripped up” early in the Trump administration.",
    "We already had one of those some time ago.’”\nYuri Kostenko, a former environment and nuclear safety minister who helped negotiate Ukraine’s nuclear disarmament deals in the 1990s, told Politico that in retrospect Ukraine should have held out for more ironclad protections from Western allies, such as NATO membership, “Looking back, Ukraine’s nuclear disarmament, in the way it happened, was a terrible mistake,” he said.",
    "…\n“That’s probably why President Biden, and not his predecessor, was able to rally the world and the global community in taking steps against … Russia’s aggression.”\nWhat’s At Stake in Ukraine is the Future of Nuclear Arms Non-Proliferation\nAnd so the burden falls on President Biden’s shoulders to undo the damage that Trump did and rebuild the Western alliance to counter Putin’s push into Ukraine.",
    "It reduced the overall number of nuclear weapons in the world and that makes everyone safer.”\nThe bipartisan 1991 Soviet Nuclear Threat Reduction Act, co-sponsored by Democratic Sen. Sam Nunn of Georgia and Republican Sen. Richard Lugar of Indiana, provided U.S. funding for supplies and equipment to destroy nuclear missiles and their silos in Ukraine and other former Soviet republics.",
    "In exchange, Kyiv received security guarantees from Russia, Britain, and the U.S. “to respect the independence and sovereignty and the existing borders of Ukraine” and “refrain from the threat or use of force against the territorial integrity or political independence of Ukraine.”\nAt the time, under Yeltsin, Russia seemed to be on the path to becoming more democratic.",
    "At the Republican National Convention, the Trump campaign worked behind the scenes to make sure that the party’s platform would not include a call for giving lethal weapons to Ukraine to fight Russian and rebel forces in the Donbas region in eastern Ukraine—where Russia recently recognized two breakaway states and moved in additional troops to seize more territory.",
    "In 1993, John J. Mearsheimer, a controversial international relations theorist at the University of Chicago, wrote an article in Foreign Affairs that stated that a nuclear deterrent was “imperative” for Ukraine to ”maintain peace with Russia.”\n”That means ensuring that the Russians, who have a history of bad relations with Ukraine, do not move to reconquer it.",
    "During the House Intelligence Committee’s Nov. 2019 hearings preceding Trump’s first impeachment, Fiona Hill, the former top Russia expert on the National Security Council, admonished Republican members for playing into Putin’s hands by pushing the conspiracy theory that Ukraine, not Russia, had meddled in the 2016 election.",
    "Republicans Spread Russian Disinformation About Ukraine\nThen Rudy Giuliani undertook his mission to Ukraine in early 2019 not only to press then-President Petro Poroshenko to announce an investigation of Joe and Hunter Biden, but also to investigate a mysterious DNC computer server that Trump believed was hidden in Ukraine.",
    "As evidence mounted that Russia had actively meddled in the 2016 election to help Trump, the Kremlin threw him a lifeline with a disinformation campaign pushing a conspiracy theory that Ukraine had hacked the Democratic National Committee server in an effort to frame Russia and help Clinton’s campaign.",
    "At the same July 27, 2016, news conference at which Trump suggested that Russia should hack Hillary Clinton’s email server, the Republican nominee made Putin’s day when he said if elected president he would consider recognizing Crimea as Russian territory and lifting the sanctions against Russia.",
    "“It was a huge mistake for Ukraine to completely get rid of nuclear weapons,” Nikolay Filatov, the former commander of the 46th Rocket Division, which operated 86 intercontinental ballistic missile silos in the Pervomais’k area in central Ukraine, told Canada’s The Globe and Mail newspaper.",
    "Ukrainian nuclear weapons are the only reliable deterrent to Russian aggression.”\nHowever, Ukraine’s first president, Leonid Kravchuk, decided that maintaining a nuclear arsenal would be too costly given the country’s economic crisis and would turn the country into an international pariah.",
    "Ukraine’s Prosecutor General Yuriy Lutsenko told The New Yorker that he “was near the red line (of announcing an investigation into the Bidens), but I didn’t cross it.” Lutsenko said Poroshenko pulled back because he was afraid of damaging Ukraine’s relations with the Democratic Party.",
    "x\nx\nx\nThe Budapest Memorandum\nUkraine President Leonid Kuchma, Russian President Boris Yeltsin, President Bill Clinton and British Prime Minister John Major signed the 1994 Budapest Memorandum under which Kyiv agreed to have all its nuclear warheads and delivery systems dismantled.",
    "That didn’t happen and Flynn was forced to resign a few weeks later after it was revealed that he had misled Vice President Mike Pence and other top White House officials about his conversations with the Russian ambassador to the United States during the transition.",
    "Trump and His GOP Cultists Disavow U.S. Security Guarantees to Ukraine\nWith Russia now mounting a full-scale invasion of Ukraine, it’s disconcerting to see that so many Republicans are ready to abandon the security guarantees the U.S. made to Ukraine back in 1994.",
    "According to the Nuclear Threat Initiative, Ukraine’s nuclear arsenal consisted of 130 SS-19 and 46 SS-24 intercontinental ballistic missiles (ICBMs) with 1,240 warheads, and 44 Tupolev-95 and Tupolev-160 strategic bombers (with 1,081 nuclear cruise missiles).",
    "“Today, our people are dying in eastern Ukraine because of Russian troops, all because we unthinkingly gave up nuclear weapons.”\nAndriy Zahorodniuk, a former Ukrainian defense minister, told The New York Times: “We gave away the capability for nothing.",
    "One member of parliament, General-Major Volodymyr Tolubko, the former commander of a nuclear missile base, told the Rada, the Ukrainian parliament, that it would prove “romantic and premature” for Ukraine to declare itself a non-nuclear state.",
    "And then there were Trump’s remarks on a conservative radio show on Tuesday in which he called Putin’s proposed dismembering of independent Ukraine an act of “genius.”\n“So Putin is now saying, ‘It’s independent.’ a large section of Ukraine.",
    "x\nx\nx\nUkraine once had the world’s third-largest nuclear arsenal\nBack in Dec. 1991, when the Soviet Union dissolved, newly independent Ukraine inherited the third-largest nuclear arsenal in the world after the United States and Russia.",
    "Faced with a Russian invasion, many Ukrainians now regret that their country gave up a huge nuclear arsenal in exchange for Russian and U.S. security guarantees that Vladimir Putin declared null and void and Donald Trump undermined.",
    "Kostenko, the former Ukrainian nuclear arms control negotiator, told Politico: “What happened in 2014 and what we’re seeing today totally destroyed 70 years of security architecture and trust” established after World War II.",
    "He told a Canadian journalist: “Ukraine can become a hostage of its own missiles, they can be more dangerous than Chernobyl,” a reference to the deadly 1986 nuclear accident at a nuclear power plant in Ukraine.",
    "Ukraine-born Mariana Budjeryn of Harvard University, an expert on nuclear non-proliferation, told NPR’s All Things Considered in a recent interview that she felt Ukraine made the right decision at the time.",
    "The warheads themselves were sent to Russia to be destroyed, with the highly enriched uranium contained within made into commercial reactor fuel that was purchased by the U.S. under a separate program.",
    "But everything changed when the Euromaidan protests, a wave of demonstrations and civil unrest that had started in late 2013, finally toppled Yanukovych, forcing the ousted president to flee to Russia.",
    "In his fiery speech to the Russian people on Monday, he claimed that Ukraine and the United States were secretly plotting to put nuclear weapons back into the country, The New York Times reported.",
    "As Trump emerged as the favorite for the Republican nomination, he chose a new campaign manager, Paul Manafort, who hadn’t been involved in a U.S. presidential campaign since Bob Dole’s in 1996.",
    "Ukraine Becomes a Non-Nuclear Weapon State\nIn 1994, Ukraine decided to give up its nuclear arsenal and join the Treaty on the Non-Proliferation of Nuclear Weapons as a non-nuclear-weapon state.",
    "Ukraine cannot defend itself against a nuclear-armed Russia with conventional weapons, and no state, including the United States, is going to extend to it a meaningful security guarantee.",
    "Putin Declares the Budapest Memorandum Null and Void\nPutin saw Yanukovych’s ouster as a Western-inspired regime change, accusing the U.S. of actively supporting the Euromaidan protests.",
    "Russia “glibly violated” the Budapest Memorandum, arguing that it had “signed it with a different [Ukrainian] government, not with this ‘illegitimate’” government, Budjeryn told NPR.",
    "But what Washington and Kyiv failed to consider was the emergence of an authoritarian Russian leader like Putin who succeeded Yeltsin and was determined to make Russia great again.",
    "Republicans have made a talking point of comments made by Fox News host Tucker Carlson comparing a Russian invasion of Ukraine to the manufactured crisis at the U.S.-Mexico border.",
    "If the Budapest Memorandum’s security guarantees are shown to be worthless, it will deal a blow to nuclear arms non-proliferation and make the world a much more dangerous place.",
    "Donald Trump Undermines U.S. Security Guarantees for Ukraine\nBut then Donald Trump came along and undermined the U.S. commitment to security guarantees for Ukraine.",
    "”If Ukraine acquires weapons of mass destruction, the situation in the world and in Europe will drastically change, especially for us, for Russia,” Putin said.",
    "Manafort was paid millions of dollars to serve as a political strategist from 2004-2014 to Ukraine’s pro-Russian leader Yanukovych and his Party of Unions.",
    "The protests were partially triggered by Yanukovych’s decision to abandon a trade agreement with the European Union and seek closer ties with Russia.",
    "In March 2014, Ukraine called for such a meeting which did take place in Paris, but Russian Foreign Minister Sergei Lavrov simply didn’t show up.",
    "But that didn’t stop Russian President Vladimir Putin from spinning out yet another conspiracy theory to justify his decision to invade Ukraine.",
    "Then he accused the United States of planning to put nuclear weapons on Ukrainian territory—implausible since Ukraine isn’t a member of NATO.",
    "“This is a fictional narrative that has been perpetrated and propagated by the Russian security services themselves,” she told the committee.",
    "The Budapest Memorandum called for a meeting of the signatories should any issues arise, but lacked any effective enforcement provisions.",
    "The pro-Russian politician Viktor Yanukovych held key posts as prime minister and president for most of the years between 2002 and 2014.",
    "Within weeks, Russia had annexed Crimea and increased military support for pro-Russian separatists in Ukraine’s eastern Donbas region.",
    "His ouster ushered in a new government committed to strengthening Ukraine’s ties to the West, particularly the European Union.",
    "And it will encourage more nations like Saudi Arabia and South Korea to pursue their own nuclear arms programs as a deterrent.",
    "He advocated retaining some ICBMs sufficient to “deter any aggressor,” although he wasn’t necessarily referring to Russia.",
    "Imagine what would have happened if Lutsenko had crossed that red line before Joe Biden had even announced his candidacy.",
    "Manafort also had business ties to two Kremlin-linked oligarchs, Russian Oleg Deripaska and Ukrainian Dmytro Firtash.",
    "That is a far bigger invasion than anything Vladimir Putin is planning in Ukraine,” Carlson said earlier this month.",
    "“Today, our example is a key motivation for countries like Iran or North Korea not to drop their nuclear ambitions.”",
    "Kravchuk also realized that Ukraine could not maintain the nuclear warheads and missiles without Russian help.",
    "“Texas is a state that’s had well over 1 million foreign nationals pour into it illegally over the last year.",
    "It could have been a mortal blow to Biden’s candidacy, and Democrats would have been furious at Ukraine.",
    "He feared that some warheads, particularly on tactical nuclear weapons, could fall into the wrong hands.",
    "It will discourage countries like Iran and North Korea from giving up their nuclear weapons programs.",
    "Now, every time somebody offers us to sign a strip of paper, the response is, ‘Thank you very much.",
    "“Ukraine intends to create its own nuclear weapons, and this is not just bragging,” Putin said.",
    "Ukrainian servicemen get ready to repel an attack in Ukraine's Luhansk region on Feb. 24, 2022.",
    "“I don’t really care what happens to Ukraine one way or another,” Ohio Senate candidate J.D.",
    "What’s at stake could be the future of efforts to control the spread of nuclear weapons.",
    "In May 1996, Ukraine sent the last of its nuclear warheads to Russia to be dismantled.",
    "The former Soviet republic had more nuclear weapons than Britain, France, and China.",
    "In the early 1990s, Ukrainian leaders debated what to do with the nuclear arsenal.",
    "“It did the right thing by itself, and also by the international community.",
    "Support for Ukraine collapsed among Republican lawmakers loyal to Trump.",
    "Kyiv also possessed an unspecified number of tactical nuclear warheads.",
    "Ukraine is in no position now to produce or acquire nuclear weapons.",
    "Ukraine doesn’t even have the capability of producing nuclear fuel.",
    "`How smart is that?’ And he’s going to go in and be a peacekeeper.",
    "Ukraine was viewed as a model state for nuclear arms control.",
    "The fuel was used in Ukrainian nuclear power plants.",
    "Those security guarantees were respected until 2014.",
    "That’s the strongest peace force I’ve ever seen.",
    "That’s the strongest peace force.” Trump said.",
    "There wasn’t any whistleblower at the time.",
    "“We could use that on our southern border.",
    "But there’s no turning back the clock.",
    "Vance said in a podcast interview.",
    "… Here’s a guy who’s very savvy.",
    "Right over the border.",
    "In a Mar.",
    "I said."
  ]
}