{
  "id": 26073,
  "mediaId": 2643,
  "date": "2022-02-07",
  "headline": "'Hillbilly Elegy' Author's Campaign Suffering Over His Anti-Trump Views",
  "image": "",
  "link": "https://www.newsweek.com/hillbilly-elegy-authors-campaign-suffering-over-his-anti-trump-views-1677020",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Villarreal",
  "authorUrl": "https://www.newsweek.com/authors/daniel-villarreal",
  "termIds": [
    13425,
    13592,
    13690,
    13702,
    14169,
    13312,
    13372
  ],
  "sentences": [
    "In her statement of endorsement, Greene said that Vance would fight back \"against an unholy alliance of left-wing radicals and corporate oligarchs who seek to undermine our God-given rights, destroy traditional American values and force us all to live under their woke authoritarianism.\"",
    "When the infamous Access Hollywood tape leaked in which Trump said that women let rich men non-consensually \"grab them by the p***y,\" Vance wrote in a now-deleted October 2016 tweet, \"Fellow Christians, everyone is watching us when we apologize for this man.",
    "Roughy 29 percent see him as liberal and 50 percent see him as anti-Trump, perceptions that make those voters less likely to support Vance, according to polling conducted in January by Tony Fabrizio, a pollster for the Protect Ohio Values super PAC.",
    "\"What changed my mind about Donald Trump more than anything is that I saw the corruption in our institutions,\" Vance said at a January campaign speech in Middletown, Ohio, Spectrum News reported.",
    "At the event, he also criticized current inflation, the immigrant crisis at the southern border and alleged censorship of conservatives by \"Big Tech\"—all issues regularly mentioned by Trump.",
    "Vance has since said he was \"wrong about\" Trump and has since begun adopting political stances that align with Trump and the former president's ever-devoted America First Caucus.",
    "Vance, the author of Hillbilly Elegy who is running as a Republican Ohio candidate for U.S. Senate, has suffered due to his past statements against former President Donald Trump.",
    "He also once said Trump's great political failures were his signature corporate tax cuts and his unsuccessful attempts to undo the Affordable Care Act, also known as Obamacare.",
    "Republican Georgia Representative Marjorie Taylor Greene—who authored the \"Fire Fauci Act,\" a bill that would defund the doctor's federal position—has recently endorsed Vance.",
    "One of those stances includes supporting legislation that would investigate and withhold the salary of White House medical adviser Dr. Anthony Fauci, The Week reported.",
    "In the ad, Vance also says that he didn't vote for Trump, calls him \"outrageous and offensive\" and says he would have to \"hold his nose and vote for Hilary Clinton.\"",
    "The political action committees (PAC) Club for Growth and USA Freedom Fund have spent nearly $2 million in ads highlighting Vance's anti-Trump comments from 2016.",
    "Before Trump's 2016 presidential election, Vance issued numerous tweets against Trump, calling his rhetoric \"reprehensible\" and writing, \"God wants better of us.\"",
    "At the time, Vance called himself a \"Never Trump guy\" and also called Trump an \"idiot,\" \"noxious\" and \"offensive,\" among other comments.",
    "His opponents are reportedly using his past anti-Trump statements against him to paint him as someone lacking conservative credentials.",
    "One of Vance's old October 2016 tweets mentioned in the ad states, \"Trump makes people I care about afraid, Immigrants, Muslims, etc.",
    "In past comments, he also compared Trump to an opioid, calling him an \"easy escape from the pain,\" the Anchorage Daily News reported.",
    "The shift represents part of a larger shift among Republicans, embracing the former president to curry favor with right-wing voters.",
    "In response, Vance has seemed to increasingly adopt rhetoric in favor of Trump and pro-Trump political stances.",
    "Fauci has long been a Republican target as the public face of COVID-19 prevention mandates across the country.",
    "Vance began deleting many of these critical tweets in 2021 before starting his Senate campaign, CNN reported.",
    "\"I can't vote for Trump, I think that he is noxious,\" Vance states in the Club for Growth's ad.",
    "In another October 2016 tweet mentioned in the ad, he wrote of Trump, \"My god what an idiot.\"",
    "... She's precisely the type of leader we need in our party: genuine, honest, and courageous.",
    "Vance is one of eight Republican candidates competing in a crowded primary for the seat.",
    "The ads may have affected Vance's standing in the state among Republican voters.",
    "Unfortunately, there are too few like her,\" The Hill reported.",
    "Vance said, \"I am so honored to have Marjorie's support.",
    "Because of this, I find him reprehensible.",
    "The political campaign of J.D.",
    "God wants better of us.\"",
    "Lord help us.\""
  ]
}