{
  "id": 26108,
  "mediaId": 6404,
  "date": "2022-04-16",
  "headline": "Donald Trump Endorses J.D. Vance In Ohio Senate Race",
  "image": "https://americanlookout.com/wp-content/uploads/2021/07/JD-Vance.jpg",
  "link": "https://americanlookout.com/donald-trump-endorses-j-d-vance-in-ohio-senate-race/",
  "mediaOutlet": "americanlookout.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://americanlookout.com/author/aleister/",
  "termIds": [
    13592,
    13702,
    13724,
    13764,
    13803,
    13942,
    13285,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "Trending: Washington Post Already Floating Names Of Democrats Who Could Run In 2024 Instead Of Biden\nDuring the 2016 campaign the venture capitalist and “Hillbilly Elegy” author called Trump “noxious,” “reprehensible” and an “idiot,” before stating last summer he was a “good president” as he threw his hat into the ring.",
    "The endorsement in the GOP primary race came after Vance, 37, walked back previous criticisms of Trump in a charm offensive meant to secure his backing in the race — which is expected to largely be decided by supporters of the ex-president.",
    "Since the about-face, Vance has cozied up to Trump allies and parroted many of his positions on trade and immigration during frequent appearances on Steve Bannon’s podcast and Fox News.",
    "Trump gave the coveted nod to Vance over rivals Josh Mandel, Mike Gibbons and Jane Timken, calling him “the candidate most qualified and ready to win in November,” in a statement.",
    "Vance’s bid for the hotly contested Republican US Senate seat in Ohio got a boost Friday when he was endorsed by his former adversary Donald Trump.",
    "A lot of people are watching this race and Trump’s endorsement will likely do a lot for Vance.",
    "Vance secures Trump endorsement in hotly contested Ohio Senate race\nAuthor J.D.",
    "In the Republican race for U.S. Senate in Ohio, Donald Trump has endorsed J.D.",
    "Vance sounds pretty pleased to have Trump’s endorsement.",
    "It’s important for Republicans to do well in Ohio.",
    "Donald Trump Jr. is certainly on board.",
    "“It is all about winning!” he added.",
    "The New York Post reports:\nJ.D.",
    "This was the right decision.",
    "Vance."
  ]
}