{
  "id": 26136,
  "mediaId": 2676,
  "date": "2022-04-06",
  "headline": "Ohio GOP Senate candidate J.D. Vance launches new ad asking fans if they \"hate Mexicans\"",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2018/01/jd-vance.jpg",
  "link": "https://www.salon.com/2022/04/06/ohio-senate-candidate-jd-vance-launches-new-ad-asking-fans-if-they-hate-mexicans_partner/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.salon.com/writer/timothy_evans",
  "termIds": [
    13702,
    13764,
    13283,
    13312,
    13372,
    14264,
    14299,
    14317
  ],
  "sentences": [
    "Just last week the Republican laid the foundation of his views on race when he defended Georgia Rep. Marjorie Taylor Greene's speaking role at the White nationalist gathering America First Political Action Conference, organized by Nick Fuentes.",
    "According to Fox, the message in the 30-second spot largely fits with the central, nationalistic message of Vance's campaign, which includes closing the border and focusing on domestic U.S. issues rather than foreign entanglements.",
    "Vance is spending $1 million throughout the state to air the ad in which he attacks President Joe Biden for not completing former President Donald Trump's ineffective border wall with Mexico, according to a Fox News report.",
    "A Fox News Poll conducted early last month showed Vance in third place in the race, trailing investment banker Mike Gibbons (with 22%) and former state Treasurer Josh Mandel, (20%).",
    "Joe Biden's open border is killing Ohioans with more illegal drugs and more Democrat voters pouring into this country.\"",
    "In the ad, Vance says, \"The media calls us racist for wanting to build Trump's wall.",
    "Republican U.S. Senate candidate and \"Hillbilly Elegy\" author J.D.",
    "In a new 30-second TV spot he asks: \"Are you a racist?",
    "\"She did nothing wrong,\" Vance said of her appearance.",
    "Vance is competing in a crowded May 3 GOP primary.",
    "They censor us, but it doesn't change the truth.",
    "Vance has some choice words for Ohio voters.",
    "Vance came in third at just 11%.",
    "The TV spot cements that image.",
    "Do you hate Mexicans?\""
  ]
}