{
  "id": 26187,
  "mediaId": 2672,
  "date": "2022-02-20",
  "headline": "MAGA Chuds to Ukraine: Drop Dead",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/GettyImages-1310195862.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/trump-allies-ukraine-drop-dead-1310330/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Wade",
  "authorUrl": "",
  "termIds": [
    13405,
    13626,
    13690,
    13811,
    13939,
    13990,
    14192,
    14332,
    14355,
    14357
  ],
  "sentences": [
    "“I gotta be honest with you, I don’t really care what happens to Ukraine…I do care about the fact that in my community right now the leading cause of death among 18-45 year olds is Mexican fentanyl that’s coming across the southern border.” – @JDVance1 #OHSen pic.twitter.com/nf6MUzdWM5\n— JD Vance for U.S. Senate Press (@JDVancePress) February 19, 2022\nRetired Army Lieutenant Colonel Alexander Vindman reacted to MAGAworld’s diversionary tactics — specifically, a clip of Rep. Marjorie Taylor Greene falsely claiming that “Ukraine was the number one donor to Hillary Clinton when she was running for president” — and said the former president’s pals are only emboldening Putin.",
    "“We have a crisis at the southern border, a fascist up north literally reenacting empower Palpatine’s speech, and instead of *that*, we are supposed to care about a turf war over some street corners in the Far East,” far-right personality Mike Cernovich tweeted on Sunday, comparing Trudeau to an evil Star Wars emperor for invoking emergency powers, including cutting off funding sources, to get the truckers to leave.",
    "Vance said he doesn’t “really care what happens to Ukraine one way or another.”\n“At the end of the day, we served to defend our own country and I think it’s ridiculous that we’re focused on this border in Ukraine,” he said, claiming that the administration’s focus should be on stopping fentanyl coming across the U.S. border with Mexico, as though the two issues were mutually exclusive.",
    "Right-wing firebrand Candace Owens on Friday went even further, suggesting that the U.S. should send troops into an ally nation to stop the “tyrannical reign of Justin Trudeau,” comparing him to deceased Cuban dictator Fidel Castro.",
    "The Ukraine-Russia conflict is complicated and dangerous, so the intellectually bankrupt Trump movement has decided that their time is best spend demanding President Biden address the “tyranny” taking place in [checks notes] Canada.",
    "Vindman is a former National Security Council director for European affairs who gave testimony to Congress regarding Trump’s call with Ukraine’s president during the first round of impeachment hearings.",
    "Far-right commentators have claimed that Prime Minister Justin Trudeau’s actions to remove anti-vax truckers from occupying Ottawa pose a greater threat than Putin preparing to go to war with Ukraine.",
    "https://t.co/OCmnjFadQb\n— Alexander S. Vindman (@AVindman) February 20, 2022\n“These people and a great deal of the GOP leadership will have blood on their hands,” Vindman tweeted on Sunday.",
    "The blockade, a protest against Covid vaccine mandates, had occupied Ottawa for weeks and impeded traffic on the Ambassador Bridge, a key trade route, for six days.",
    "— Candace Owens (@RealCandaceO) February 19, 2022\nDuring an appearance on Steve Bannon’s podcast this weekend, conservative senate candidate and veteran J.D.",
    "He has fundamentally declared himself dictator and is waging war on innocent Canadian protesters and those who have supported them financially.",
    "Putin and his regime perceive opportunities because such fools suggest the U.S. is weak, divided, and distracted.”",
    "As Russian troops surround Ukraine’s borders, prominent members of the MAGA crowd reacted with a collective shrug.",
    "Putin and his regime perceive opportunities because such fools suggest the U.S. is weak, divided, and distracted.",
    "Send American troops to Canada to deal with the tyrannical reign of Justin Trudeau Castro.",
    "These people and a great deal of the GOP leadership will have blood on their hands.",
    "“They’re fanning flames, encouraging Putin to attack Ukraine.",
    "They’re fanning flames, encouraging Putin to attack Ukraine.",
    "STOP talking about Russia."
  ]
}