{
  "id": 26181,
  "mediaId": 2886,
  "date": "2022-03-05",
  "headline": "Dispatch from the Anti-CPAC",
  "image": "https://www.theamericanconservative.com/wp-content/uploads/2022/03/GettyImages-1234240323-scaled.jpg",
  "link": "https://www.theamericanconservative.com/articles/dispatch-from-the-anti-cpac/",
  "mediaOutlet": "The American Conservative",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13388,
    13451,
    13780,
    13785,
    13933,
    13377,
    14330,
    14357
  ],
  "sentences": [
    "People there are “taking up arms: women, families, standing in recruitment lines to get guns.” This, apparently, should inspire rather than disgust us, because these women and children are going to their deaths for the sake of “ideas that our country has espoused.” The connection goes deeper than that, though, because Volodymyr Zelensky, long before winning global admiration for standing up to the Russian invaders in Keev, “stood down a tyrant in our own country, first of all.” So it is that our struggle becomes one with the Ukrainians’: Whether against Trump or against Putin, to stand for Principles First “at risk of your own life.”\nBut Principles First conservatives cannot be content just to risk their lives at home: “We as a country are going to have to start making tough choices, sacrifices, to continue leading the world as we have in the 21st century.” If we do not stick our necks out for the sake of U.S. global hegemony, “if the United States does not lead in the world, that vacuum will be filled by those who do not share our values.” The prospect that, say, Donetsk may be governed by people who do not ascribe religious status to the Declaration of Independence seems to worry these people as much as the prospect that the presidency of our own country might be handed back to the Orange Man.",
    "Introducing the panelists, Longwell says, “So I have known Walter [Olson] since the gay-marriage fight days, back when I was the head of the Log Cabin Republicans—first female board chair, had to resign because they really wanted to endorse Donald Trump, and I didn’t.”\nLongwell poses an interesting question to Mindy Finn, a panelist and CEO of something called Citizen Data:\nOne of the things that happens if you’re watching a lot of these, like Newsmax, you know Bannon’s War Room or whatever, there is a, the line that they use over and over again is, “We need to take back the Republican Party, take over the Republican Party from these RINO globalist cucks,” by which they mean like Mitch McConnell, Lindsay Graham—like, okay.",
    "We even live in an age when a majority of conservatives tell pollsters that what Charen calls the “assault on democracy” was “not that big a deal.”\nThe solution is not to consider the priorities of voters, but to tell everybody, “We’re for liberty, we’re for democracy, we’re for human rights, and they are on the other side.” What’s more, Joe Biden has to take the opportunity to go global, to announce that “it is about defending democracy for ourselves and for the free world.” Charen declares, “Our challenge going forward is to unmask the deceivers.”\nShe closes with a Lincoln quote: “The dogmas of the quiet past, are inadequate to the stormy present.",
    "“After the attack on Pearl Harbor,” she points out, “the America First movement…just faded away,” concluding that it’s “feasible to imagine, in the wake of Putin’s naked aggression, a similar rethinking will take place.”\nShe ties the Republican realignment together with Putin’s hyper-nationalism, presenting both as indicative of a “drift toward authoritarianism.” Lest you forget, “We live in the age of the Big Lie.” We live in a time when conservatives believe “that Democrats are not just the opposition but a mortal threat to their way of life.” (Surely they have not been given any good reasons to think so.)",
    "He has no time for those who criticized his gay wedding antics, and denounces them all as “a bunch of mouth-breathers.”\n***\nNext is a panel on “The Future of Faith in the Public Square.” It’s 2022, so naturally a discussion of the subject begins with some fretting about “violent white-supremacist extremism.”\nElizabeth Neumann, an alumna of the U.S. Department of Homeland Security, has a confession to make: “I had believed the political narratives that the country would never be the same if Obama was elected for a second term.” How exactly does she think things have been going in the decade since 2012?",
    "Kori Schake, foreign-policy guru of the American Enterprise Institute, expresses early on a hope that Putin’s invasion “shocks us into a renewed seriousness about foreign policy.”\nAt a summit where I’ve spotted more than a little Bush-Cheney memorabilia, the Atlantic‘s Tom Nichols draws a surprisingly critical comparison: “As an American it pains me to say, [Putin]’s not the first guy to make the ‘we will be greeted as liberators’ mistake.”\nBut Schake has the solution: “Civil society is the superpower of freedom.” Extra-governmental entities just need to take up the mantle of democracy.",
    "The faithful themselves must simply “get comfortable with the fact that we live in a post-Christian culture.”\nNapp Nazworth, who left the Christian Post after the site published a pro-Trump editorial, likewise sees the chief concern of Christians in the public square as a kind of self-flagellation: “The MAGA right…is not treating immigrants and refugees as people with dignity and worth.… Racism is such a problem on the MAGA right today.… If you find yourself in a coalition with white supremacists, it’s time to leave that coalition.” He is met with roaring applause.",
    "I get back just in time to hear Barbara Comstock—who served two terms representing Virginia’s 10th district in the House—proudly announce, “Obviously I’m very active and involved with making sure that Liz Cheney is reelected.” She denounces the post-Comstock GOP as a “cult” overtaken by a “cancer.” But she is not willing to leave it behind for one simple reason: “I was here first.” Comstock says the party needs to move away from “old, 70-something-year-old white guys,” apparently missing the irony of this coming from a 62-year-old white woman.",
    "And make no mistake: American obligations to Afghanistan are as real as those to Ukraine, and Taiwan, and the Democratic Republic of Timor-Leste, because “the truths we hold to be self-evident are universal.” That’s why un-Americans like Xi Jinping and Vladimir Putin are “working to prevent our ability to give people a choice.”\nThat, says Nichols, is “why they’re so afraid.” He warns that our Americanism cannot be “disembodied,” though I struggle to think of anything less embodied than such globalized abstraction.",
    "Neumann, the former DHS staffer, has some thoughts on polls that showed American conservatives believed that “Islam and democracy were in conflict” and that new arrivals “threatened traditional American customs and values.” When asked “To what extent are these attitudes a threat to national security?” Neumann answers: “They are extremely dangerous.”\nAgain, though, it gets worse: “There are between 10 million to 30 million Americans who believe that violence is justified at times to achieve political ends.",
    "Cathy, you might be on to something…\nCharlie Sykes, also of the Bulwark, claims the crisis in Europe is somehow about “whether or not the West has lost its self-confidence.” He denounces Canadian truckers who protested government overreach in their own country, who “imagined that they were taking this bold stand against tyranny and oppression,” as “completely ridiculous and absurd.” He does not explain why, except to suggest that their attention might have been better focused on Keev instead of Ottawa.",
    "Yet Kinzinger makes some concessions to the mob: “If I truly believed that the election system in this country was rigged by Satan-worshipping pedophiles who drink babies’ blood, I don’t think I’d go gently into the night either.” Well…\nHe makes some political promises, too: “We will not be the first generation in American history that leaves our kids a country that is worse off than the one we inherited.” This is likely to be true, if only because they’re going to be the second.",
    "Because I’ve got a bunch of roommates in various things and places, and these people are totally functioning, as the American people are accused of functioning, and worrying about their economy, their next quarter profits, their this, their that—but they are the drivers or have been historically the drivers in this party, and we need to get back to them.”\nThis guy must be well into his 60s, so I really hope for his sake that “former” is implicit in his mention of his roommates.",
    "And it’s disturbing, frankly, I mean, this idea that big business is bad, we should dictate to big tech, or big oil, or big whatever, how they should run, that’s even more fascist than it is a free democracy focusing on business.”\nHeath Mayo heads back to the stage to say the best thing I’ve heard from that podium all weekend: “We’re going to take the full hour for lunch.”\n***\nThere’s a bar across the street, and it’s just barely noon which means they’re going to be open.",
    "And that’s what this is about.”\nVillalba is very proud of a 2016 op-ed in which he “called Donald Trump, who had just been nominated to be president of the United States, ‘an orange, buffoonish ape, not worthy of our consideration, a misogynist, and somebody who should be eradicated from the American conversation.’” I wonder if Villalba—who cuts, shall we say, a rather imposing figure—sees any irony in attaching such importance to another man’s physical appearance.",
    "Kristol says he’s heartened by the amount of “fresh thinking going on on the center left,” then concedes after a moment’s pause, “…and the center right.” In a Bill Kristol moment that couldn’t be made up, the ever-eager neocon observes that after Putin’s invasion there are “more dangers perhaps, but also more opportunities than two weeks ago.”\nThe Bulwark’s Mona Charen is likewise hopeful that all those civilian deaths will turn things back toward hawkishness.",
    "She adds that “this means putting aside our differences and committing to ourselves and to one another, that we’re not going to sit idly by while dictators like Putin, or his admirers like Donald Trump, trash the very principles this beautiful land was founded upon.”\nCircling back to the pity party, Shah, who has made a career out of being anti-Trump, complains: “I feel that this fight has aged me sometimes, I have to be honest.",
    "The Principles First founder recently took a trip with his wife to Rome, and says he was shocked to find that the ruins left behind by its ancient inhabitants were “humongous.” The realization of Rome’s remarkable scale led Mayo to conclude: “It looks and feels like a civilization like the United States at its height.” He understands, at least, that something like that doesn’t die without a reason.",
    "Kinzinger starts to wind things down by citing “the Old Testament story about…” here the congressman stumbles, realizing that he doesn’t quite know the point he’s trying to make, “…the guy that was alone and then there were thousands with him.” Honestly, I’m not sure what he was going for either, but it might be 2 Kings 6:17: And Eliseus prayed, and said: Lord, open his eyes, that he may see.",
    "On China, Nichols believes it’s “a good thing” that the Chinese have managed to surpass the U.S. on the geoeconomic stage, because “the Chinese are so woven into the global economy now that they have a much higher stake in the status quo.” (Schake, who “still believe[s] Hegel is right and that as people grow more prosperous they become more demanding political consumers,” seems to agree.)",
    "It should be 35 billion for reconstruction.” Nor should there be any limit to the weaponry we send: “Any capability they want we give it to them…’cause they’re fighting for our freedom.” (Though the people suffering under Putin’s invasion have my sympathy and even admiration, it has not been explained to me here or elsewhere what exactly they’re doing on behalf of my freedom in America.)",
    "Dunn mentions Tucker Carlson’s criticism of him the night before he testified before the 1/6 committee, in which the Fox host called the cop “an angry left-wing activist.” Dunn breaks that down, admitting that he is, in fact, angry, left-wing, and an activist—making him “an angry left-wing activist.” This declaration is met with roaring applause and some good-natured laughter.",
    "The key question, as he sees it, is simply “how to fight the fight for liberal democracy more broadly.” If Republicans won’t help us in that fight, then maybe it’s time to back “a centrist Democrat who is in favor of—willing to stand up for the people of Ukraine.” Oddly enough, a candidate’s willingness to stand up for the people of the United States is not brought up at all.",
    "Cathy Young, meanwhile, accuses those who are not prepared for nuclear winter of “bucking the general, massive pro-Ukraine public opinion which rejects the naked aggression from Russia.” She calls the move away from Russia-hawkishness “mind-boggling to anyone who was stuck in a time-warp from 20 years ago,” which in my estimation is Young and just about everyone in the room.",
    "says “you do them because at some level you believe in the system.” I wonder what he thinks would happen if you didn’t do them for long enough; subpoena literally means “under penalty.”\nHe doesn’t understand why everybody is so hard on his buddy Merrick Garland, who has “brought more than 700 cases against 1/6 participants and conspirators.” What more could he possibly do?",
    "He denounces this latter diverse group of thinkers as “post-liberal nationalists, ‘blood-and-soil’ conservatives.” He ascribes to them the claim that “free government leads to weakness” and issues the very Principles First rebuke: “Let them say that to the Ukrainian military.” Each word helps explain why Wood left his Texas primary with just 3.2 percent of the vote.",
    "Doing his best Fox Mulder impression, the congressman promises, “The truth is out there.” He speculates that “if these people knew the plans better it would have been a very different day,” though that claim is hardly borne out by the evidence, which shows on the part of the rioters only low-level vandalism, some minor brawling, and a lot of selfie action.",
    "Taylor, the Homeland Security chief of staff who, as “Anonymous,” pretended to be a much more senior internal dissident in the Trump administration than he was, self-diagnoses with “clinical Trump derangement syndrome like you wouldn’t believe.” (This mere weeks after his complaints about “Havana syndrome,” from which Olivia Troye also claimed to suffer.)",
    "By magic?”\nAs to whether an America First economic strategy is appealing to American voters, Nichols says simply: “I don’t know, I’m not a political pollster about the Midwest and battleground states, but I can say that it’s losing us Asia.” And how could Americans even think about such things when “there’s a war raging in the middle of Europe.",
    "He wasn’t just this person that was behind this horrible thing that happened to me in 2016—and the Google can tell you about it, you know, few keystrokes with my name, find out I was ousted as a delegate, in 2016, I was the first delegate elected to the Republican National Convention to criticize Donald Trump, and I lost everything for it.",
    "The gist of it: “The essence of America…is an idea.”\nWhen the clip is over, Mayo accidentally disses his own agenda: “Something about what this room says is, you know, there’s a lot of—there’s a lot of doubt out there about whether there’s a lot of hunger for a message like this…” The room’s capacity is 525; it’s not particularly full.",
    "Vindman gets visibly uncomfortable, but strings together an answer: “Unfortunately Israel has a very deep relationship with Russia, and there’s a large Jewish population, and Russia is holding Israel over a barrel.”\nVindman is followed by another hero of the Trump-haters: Harry Dunn, an officer with the United States Capitol Police.",
    "And as a member of the intelligence community, a former national security professional, I can’t tell you how deeply troubling that is, to hear people, a leader of our country, basically still remains as a leader of Republican movement to a certain extent—a very big extent, I would say—call me the enemy, that I’m the enemy of state.",
    "A panel on Big Tech casts Silicon Valley’s megacorporations as “the crown jewels of our American economy,” according to AEI’s James Pethokoukis, who cites “the jobs they create and the money they spend on investment.” NetChoice’s Jennifer Huddleston likewise dismisses criticisms: “There’s no actual harm being committed.",
    "A special shout-out is given to The American Conservative, which Young says (with disgust) “is very much in the anti-NATO camp.”\nAt the end of it all, Young worries that neoconservatives and neoliberals will be blamed for destabilizing the world, for decades of ill-conceived policy that led inevitably to this point.",
    "Finally, Kinzinger—who must read David French—takes the plunge into sentimentalist nonsense: “We’re all Ukrainians today.” I think this is as bad as it’s going to get, but a few minutes later this dribble comes out: “But if we can all be Ukrainians, maybe we can all be Americans too.” What the hell does that mean?",
    "He’s angry about the “crisis of confidence” on the American right with respect to laissez faire capitalism, exemplified by institutions like Oren Cass’s American Compass and leaders like Senator Josh “Howley.” He pitches a libertarian absolutism: “I don’t just want to devolve to the state or the local government.",
    "Wood, the ninth-place finisher in a special election last year, closes things out with the observation that “the politicians are always downstream of the intellectuals.” He looks back fondly on a time when those intellectuals included men like Irving Kristol, Milton Friedman, Friedrich Hayek, and George Will.",
    "Shay Khatiri of the Renew Democracy Initiative is supposed to be the moderator, but he jumps on the mic for some editorializing about the Ukrainian people: “They are our brothers in arms, our sisters in arms, and they are the front line of democracy right now.” That’s a wrap on national security.",
    "And the same way as we compare this group of patriots, public-spirited people to the gathering of crooks, creeps, and crackpots taking place…\nApplause drowns out what Frum is saying, then: “I think you can say in the spirit of that Russian joke…” (Oh no, I think to myself, he’s going to say it.)",
    "He’s not happy with the panelists, explaining that those who object to Silicon Valley’s iron grip on the narrative do so because they believe in “the marketplace of ideas.” He then raises the problem of data privacy, arguing that users own their own data and so should have control over its use.",
    "They’re not where I am.” Having ridden the Tea Party wave to Congress a dozen years ago, Walsh now says, “Talking to these people, these Tea Party people every day still, the vast majority of them worship Trump.” He wishes they were more like him and his companions: “I love all of us up here.",
    "Mangu-Ward, the moderator, asserts that “fiscally conservative and socially liberal” people like her make up the “big round middle” of the American political horseshoe, apparently unaware that this is by far the least popular combination on the traditional four-quadrant political compass.",
    "They’re not you.”\nThe moderator, failed Texas congressional candidate Michael Wood, says the purpose of the movement is to “keep Donald Trump from ever being in control of nuclear weapons,” which is an odd point of concern regarding the most dovish president at least since Jimmy Carter.",
    "“That’s how Moses inspired, that’s how Heath [Mayo] inspires, and that’s how each of you will take back what is so rightfully ours, and that is the leadership of this wonderful nation, to become one of the best countries.” He catches himself: “It always has been the best country.",
    "Lest her bona fides be doubted she adds: “I’ve already donated to Congresswoman Cheney.”\nNext up at the podium is Denver Riggleman, a one-term former congressman who lost a primary after officiating a same-sex wedding; he is now a senior staff member for the House 1/6 committee.",
    "Smarick, who functions as the panel’s right-limit, asserts without explanation that “the freest people end up being the most tradition-bound people.” He goes on to explain that the standard GOP view on free-marketeerism is that making a pie grow makes all the pieces bigger.",
    "Villalba seems a little sanctimonious:\nOver the last several years, I think many of us have felt like Moses coming back from the hill, and he’s literally speaking to God about what the people of Israel are going to have for their guiding principles going forward.",
    "Discussing how he wants to punch people, Villalba (a fourth-generation Texan from Grand Prairie) says, “You can take the Latino out of the barrio, but you can’t take the barrio out of the Latino.” (An accent appears inexplicably for this line and this line only.)",
    "“We know for a fact, based on data, and I can’t tell you how right now, that that is absolutely false.” He voices sympathy for Ray Epps and all others who have been subject to harassment by “digital bullies and physical bullies” in these long and painful months.",
    "But it’s not okay to back down from a bar fight.” After the desecration of the Temple of Our Sacred Democracy, we all need to be more like Liz Cheney (who delivered a snoozer of a speech this morning) and Adam Kinzinger (who’s set to close things out tomorrow).",
    "When asked what a renewed Republican agenda might look like, Comstock answers: “Free markets, free minds…having international relationships…a strong relationship with Israel…”\nJoe Walsh, likewise briefly a U.S. representative, is much more willing to cut bait.",
    "I don’t think any of you are being hurt by Amazon Prime.” It quickly becomes apparent that the only standard these people are even capable of considering is “consumer welfare,” as if an American could not possibly exist as, say, a worker or a business owner.",
    "Explaining how he works in the same building as politicians whose views he does not like, Dunn says, “That one person, I’m not gonna let them speak out for the million people they represent.” I wonder what he thinks the point of representative government is.",
    "Taylor calls himself a “libertarian-conservative, small-l” and a “classical liberal,” casting Trump in contrast as an “authoritarian.” He paints his penning of a New York Times op-ed and subsequent book as some kind of heroic sacrifice: “I paid every price.",
    "Then a deep-voiced woman in jeans and a sports coat sidles up to the podium: “Man, there’s nothing like some David Frum first thing in the morning.” It makes sense in a second: “I’m Sarah Longwell; I’m the publisher of the Bulwark.” But wait; it gets worse.",
    "Shah shows less machismo, explaining that these conferences have felt to her like a kind of “group therapy.” Without a hint of irony, she trots out a well-worn meme by ascribing her own political sensibilities to her inconceivably mature kindergartener.",
    "Troye, whose last job in government was as an advisor to Mike Pence, has thoughts on the state of the media too:\nThe former president, once again, attacked the media, he attacked the intelligence community, all in an effort to undermine these entities.",
    "He also has a lot to say about QAnon, which he seems to take seriously as a political force, and the “far-right MAGA movement.” Of course, he does not believe in the substance of either one, but “the thing is, horseshit sells.” (The going rate is $35.)",
    "There are three easel whiteboards in the atrium of the National Press Club with “Principles First means…” written in dry-erase marker at the top, Post-it notes and ballpoint pens piled beside on little tables for every attendee to put his two cents in.",
    "“What free societies have is accountability,” Schake continues, “and authoritarian societies don’t.”\nShe adds that “we should be supporting Alexei Navalny,” a Russian politician whose domestic support tends to hover in the single digits.",
    "And I didn’t know what was going on, and then I was pretty excited.”\nHe reminds America that “had we forgotten our mission in the world” at any point in the last few decades the global situation would have turned out very differently.",
    "Yes.”\n***\n“Defending Democracy” is followed by a panel on “Building a Principled Coalition,” manned by former Texas state legislator Jason Villalba, former RNC delegate Rina Shah, and former national security official Olivia Troye.",
    "Huddleston disagrees, explaining that user data has no inherent value, and “what makes the data valuable is what they are able to do with that data.” I wonder where she thinks the value of, well, all other property comes from.",
    "I make my way back just in time to hear Wrong Bathroom Girl introduce herself to Tom Nichols as “another member of the adoring public.”\nI settle back into my seat to hear Kinzinger speak for (now) the second time in public.",
    "He closes by paying his respects to “Officer Sicknick, who lost his life,” neglecting to mention that Brian Sicknick died naturally of stroke (according to the D.C. chief medical examiner) the day after the riot.",
    "I enter the event room just in time to hear some guy tell Heath Mayo, “You’re good at that microphone,” with another shooting back: “Yeah, when’s he going to declare?” I shudder at the thought, and take my seat.",
    "I paid every price, and guess what: I’d do it again and again.” Taylor is either unaware or unwilling to admit that his public profile is now infinitely higher than it was before his publicity-stunt dissidence.",
    "There’s an opportunity here, though: “I believe the last time a president made the case for the American role in the world was the first term of the George W. Bush administration.” And that went swimmingly.",
    "And when it began, there began to be some hope that the Israelis might win, might survive and not be annihilated by the surrounding armies, the joke went around Moscow: our Jews are beating their Arabs.",
    "Of course, the Soviet Union had massively backed the Arab armies that surrounded Israel, and Soviet propaganda had denounced the Israelis as pasty-faced runaways from Russia and the empire of the tsar.",
    "A WAR raging in the middle of EUROPE.”\nThis is to be expected, though, after—as Schake says—the U.S. under Biden “abandon[ed] the people of Afghanistan.” (Read: Ended a disastrous two-decade war.)",
    "“How do we build a coalition where we fight for common-sense Republicans like Congresswoman Cheney and Evan McMullin and the Lisa Murkowskis of the world?” A very strange thing, the human brain.",
    "I wonder if it has occurred to her that these people are, in fact, being very kind by showing pride in her for getting on TV despite the fact that she used that chance to say very stupid things.",
    "His voice carefully breaking, Kinzinger ends with a classic rhetorical flourish: “I think they’re going to write history books about what we did.”\nI am reminded of Heath Mayo’s opening remarks.",
    "Young—the second person to do so at the conference—mentions TAC contributing editor Sohrab Ahmari as someone who has committed the cardinal sin of rejecting her preferred liberal consensus.",
    "I catch bits of conversation as I pass: “I love to read National Review, even though I’ve always voted as a Democrat.” It’s not yet 9 on a Saturday morning but there’s not even any coffee.",
    "He has a great deal to say about the things you are required to do by law even though “no one is showing up at your house with a firearm to make you do” them, like answering subpoenas.",
    "Following the Florentine, Wallner observes that a key factor in Rome’s success and longevity was the constant fighting: between classes, between factions, between aspirants for power.",
    "I want to get rid of my HOA, there’s too much community where I live.”\nNowrasteh really won’t let up: “We send our kids to Catholic school; we’re not religious, but…”\nI’ve had enough.",
    "Mayo (Brown ’13, Yale Law ’18) did two stints at Bain & Company before settling at Wachtell, Lipton, Rosen & Katz, his current employer and the most profitable law firm in the world.",
    "Historically, that’s been one of the fundamental pillars of what it means to be a conservative Republican: support lower regulation, lower taxes that benefit the business community.",
    "He leads on principles, issues, and says to the people, “We must inspire.” We must find ideas that resonate with the people that we are working with, and that we are families with.",
    "And he assures us that we have them, telling the audience that he’s been “inspired by the young people who have reached out to [him].” I guess we’ll have to take his word for it.",
    "By the way, that meets the definition of terrorism.” I wonder if there is anyone in the world who does not believe that violence is justified at times to achieve political ends.",
    "This anecdote is taken as a launching board for a sort of Principles First Manifesto:\nMy children have taught me that the 45th president of the United States was a wake up call.",
    "The next panel has Katherine Mangu-Ward of Reason, Alex Nowrasteh of the Cato Institute, and Andy Smarick of the Manhattan Institute discussing libertarianism and conservatism.",
    "I feel that it’s become incumbent on me to always be the adult in the room, and I just want to be a kid sometimes.” Ms. Shah, by my reckoning, is either 38 or 39 years old.",
    "Listen,” Nichols says, “Joe Biden and the rest of us are up to our necks in a battle to restore democracy here in the United States.” Somehow, this is an applause line.",
    "***\nWhile Mayo was speaking a middle-aged guy in a goofy bomber jacket sat down in the row in front of me; he’s been sipping water more loudly than I knew was possible.",
    "Promotional material for the summit boasted that it was only $35, while other conferences charge people hundreds to attend; I’m left wondering what the $35 was for.",
    "We’re all vaxed and boosted—boosted, vaxed, and masked.” Day 2 is off to a hell of a start as a gent with a comorbidity or two coaxes me into a crowded elevator.",
    "I’ve ordered a burger and a Budweiser, and just when I crack the book open I see a man sit down in one of the big leather chairs against the wall in front of me.",
    "Dunn is a massive man, and as he begins he says over and over: “This is the biggest crowd I’ve ever seen.” Total attendance at the summit is roughly 300 people.",
    "As I read a nasal voice drones beside me: “I listen to Jooonah Goooldberg.” She quickly adds—maybe to parry a dirty look—how happy she is that he left Fox News.",
    "He’s confused by recent changes: “Sometimes Democrats sound like they’re more free market than Republicans, and that’s something I never would have expected.",
    "He says the standard is still ours to bear: “If we don’t get it right they’re going to say every democracy fails.” (The man is not doing himself any favors.)",
    "And they are recruiting actively, as Steve Bannon calls them, “shock troops.” And when you say, “Okay, well, this is a takeover of our elections.” Is it?",
    "At the panel’s conclusion, an audience member asks: “What are you doing with regard to the traditional Republican establishment, the business community?",
    "I’ve told myself I’m not going to smoke, but there’s a cigar on the menu called the Hemingway Short Story and I figure this must be some kind of sign.",
    "Guy 2 asks him how parenthood is going, and as their conversation continues and deepens I come to the conclusion that these guys must know each other.",
    "With the showmanship of a one-term politician he asks, “Am I forgetting one?” repeatedly, and a woman somewhere in back of me is screaming “Air Force!",
    "The guy is vague: “I live in the D.C. area.” The old folks are equally elusive: “Uhhh, we live in…Northern Virginia.” I think I know what that means.",
    "As the officer closes, a sincere old fellow pops up with a bright idea: There are plenty of American-made Patriot missile defense systems in Israel.",
    "I worry for a second things are worse here than I thought, but she realizes her error and quickly rushes past me, head drooped in embarrassment.",
    "“When you stand in those ruins,” Mayo said at the summit’s start, “you think to yourself: how can that possibly have happened?”\nabout the author",
    "And the Lord opened the eyes of the servant, and he saw: and behold the mountain was full of horses, and chariots of fire round about Eliseus.",
    "I don’t mean to be glib, but I know of at least one other political rally at which Harry Dunn was present that was orders of magnitude bigger.",
    "***\nKhatiri has a friend in Alex Vindman, the disgraced former Army lieutenant colonel who has become a darling of the Never Trump movement.",
    "opines on the president’s relationship to “the Department of Justice that sits under he or she,” I weep, silently, for the English language.",
    "A third guy bursts in and greets us with enthusiasm: “What’s up, guys?” The other guy meets his energy, and they start to chat it up.",
    "Now, they are “at best downstream of Patrick Deneen, Sohrab Ahmari, and Yoram Hazony,” and at worst, Tucker Carlson and Steve Bannon.",
    "In a minute someone shuffles past me in the first nice suit I’ve seen all weekend—a grey windowpane pattern, and obviously tailored.",
    "A questioner with a ponytail introduces himself as a former head of ads privacy at Google who’s running for Congress in California.",
    "Yes, we’re recruiting people who think the election was stolen; yes, we’re recruiting people who say they’ll not certify elections.",
    "He also thinks the Biden administration must be cut some slack for so little success after “a year of restoring global democracy.",
    "The first post-lunch panel, “Principled Leadership & National Security in the 21st Century,” is unlikely to offer me an answer.",
    "Descending further into unreality, Miles Taylor seems very worried that Bernie Sanders will be the Democratic nominee in 2024.",
    "She extends her condemnation to all those who attempt an “outrageous moral equivalency” between Russia and the United States.",
    "“By the way,” he tells us, “as I was driving in here, there was convoys of people with Ukrainian flags honking their horns.",
    "Riggleman is an Air Force vet, and he calls on the veterans in the room branch by branch: Army, Marines, Navy, Coast Guard.",
    "He kicks the morning off with an “old Soviet joke”:\nThere was a joke that went around Moscow during the 1967 Six Day War.",
    "Though $3.5 million taken from the American people had been pledged to Ukraine, Vindman felt, “It should be 3.5 billion.",
    "I have very strong opinions on bathroom etiquette, so I keep my eyes straight forward and stay out of the conversation.",
    "He pulls out three cigars of his own, and without his even ordering a waitress brings over a bottle of Miller Lite.",
    "I know that the very people that I grew up around, just saw me on Fox News a number of times back in 2017 and 2016.",
    "Riggleman spends the first few minutes of his address emphatically assuring us that he does not watch Bigfoot porn.",
    "On the panel with him are Gregg Nunziata of Rock Spring Public Policy and James Wallner of the R Street Institute.",
    "And I’m not going to browbeat her with facts and circumstances and statistics and data, which is my business now.",
    "You heard it here first, folks: Adam Kinzinger is the kind of guy who makes small talk with strangers at urinals.",
    "Russia’s invasion of Ukraine, he says, has “drawn into stark relief the importance of ideas” over the past week.",
    "Vindman’s chief concern right now is that the United States is not doing enough for the country he was born in.",
    "I spot two young people—a man and a woman, though judging by his bouffant hair I don’t think they’re a couple.",
    "And now after I’ve come back, you’re worshiping an orange, golden calf.” Does that sound familiar to you guys?",
    "I mean, Steve Bannon makes the point, and it’s not a bad one, he said, “We’re just participating in democracy.",
    "She points to “the hackers’ group Anonymous,” which has conducted anti-Russian cyber attacks, as an exemplar.",
    "Mayo introduces a video that opens with a voiceover of Martin Luther King and ends with one of John McCain.",
    "But Wallner later adds the caveat that such fighting must be respectful and more or less limited to words.",
    "***\nThe next panel is moderated by Bill Kristol, and one woman gives him a vigorous solo standing ovation.",
    "Returning to another constant theme—the menace of Fox News—Shah laments:\nI’m from Southern West Virginia.",
    "His name is Michael Neary, a former John Kasich staffer; he’s running as a Democrat in a six-way primary.",
    "They’re sitting right in front of me, chatting with two older folks who’ve asked them where they’re from.",
    "We must disenthrall ourselves, and then we shall save our country.” Has Mona Charen ever heard of irony?",
    "An attendee is commended for handing out pocket Constitutions before the panel kicked off this morning.",
    "Principles First means if Americans can be Ukrainians, maybe they can be Americans, too, or something.",
    "She’s thin as a rail with short silver hair, and for a moment I worry that she’s going to fall over.",
    "A few moments later, though, Guy 3 and I are washing our hands at the two sinks next to each other.",
    "“Ah man,” he exclaims, “I guess I have to pee at a sit toilet.” His animation is a little absurd.",
    "It’s about defending the very idea of democracy, of freedom—the freedom my parents came here for.",
    "But I am a man at a urinal, so I keep my eyes straight forward and stay out of the conversation.",
    "And they were just happy that I was on TV, but they weren’t listening to what I had to say that.",
    "A few rows behind me one guy tells another that he’s running for U.S. Congress in Rhode Island.",
    "Things are kicking off now, and Heath Mayo, founder of Principles First, heads up to the stage.",
    "Nunziata chimes in: “We gave them out at my wedding.” That must have been one hell of a bash.",
    "It’s been a while since Keev came up: “If Ukraine falls, soon, we’ll all be paying the price.",
    "But the way that they do it is to say, that’s why you’ve got to go run through your precinct.",
    "I wonder if Smarick knows that pies, being pies and all, are not actually capable of growth.",
    "I’ve also told myself—have been telling myself for years—that I don’t actually like cigars.",
    "I glance to my right, carefully and quickly, to get an idea of what this weirdo’s deal is.",
    "We need to build a worldwide coalition to push back against tyranny, and defend democracy.",
    "But, like, isn’t that just participatory democracy?”\nFinn hesitates a moment, then: “Uh.",
    "It’s David Frum, the Canadian-born George W. speechwriter who now works at the Atlantic.",
    "And I don’t say that to be an alarmist.” Here Shah grins wildly but does not elaborate.",
    "I got called ‘the deep state’ multiple times while working in the Trump administration.",
    "But the basic idea of judo is that you use your enemies’ momentum against them.” Okay?",
    "We ought to be paying close attention, Mayo instructs us, to what’s going on in Keev.",
    "Speaking of overpaying: “Do you know what Staples charge you for a color copy?” What?",
    "I’ve seen four here so far (myself included) and it seems all of us are journalists.",
    "She follows this with a potshot at “those horrible candidates in Ohio,” lumping J.D.",
    "He walks down the hill, and they’re all, well, they’re all worshiping a golden calf.",
    "Villalba’s answer is better than I could have hoped: “I think you’re exactly right.",
    "There’s a recent animus against business that we’re seeing eke into the narrative.",
    "I’m reading In Our Time, for no other reason than that it fit in my back pocket.",
    "Now, she realizes that faith and the public square must be completely separated.",
    "And I don’t know anything about judo other than watching Vladimir Putin do judo.",
    "“Does anybody know about the FBI false flag conspiracy theory?” Riggleman asks.",
    "The occasion is piled high with difficulty, and we must rise with the occasion.",
    "Her hero, never much of a right-winger, has lurched noticeably leftward still.",
    "“G-d I hope she wins!” But she “doesn’t have a prayer” in the GOP after Trump.",
    "He has little faith in the base: “You talk to Republican voters on the ground.",
    "(A Principles First classic: mispronouncing words to own imaginary Russians.)",
    "Bomber Jacket (who is famous for his Lawfare blog) is similarly pollyannish.",
    "It’s my sanity or the whiteboards, so I resolve to leave the latter behind.",
    "But it’s very good, and before I know it the hour has passed and then some.",
    "***\nI had a beer or four at lunch, so I have some business to take care of.",
    "That’s why we need to focus on leading by example and kitchen-table issues.",
    "With three divas like this, it’s the weekend’s unofficial girlboss panel.",
    "2016 moments, he asks us ahead of time to clap for the summit’s speakers.",
    "What if our allies loaned them to the Ukrainians just for a little while?",
    "There are only two urinals; I’m at one and some dude is at the other.",
    "“We need young people especially,” Mayo says as he draws to a close.",
    "A lanyard around her neck suggests she works for the Las Vegas Sun.",
    "Imagine how he must have felt, thinking, “I led you out of slavery.",
    "“Oh, I saw you on Fox News.’ ‘Did you listen to what I had to say?",
    "Our only hope to match Rome’s lifespan is to follow the same path.",
    "“A dollar!” I suspect this crowd wouldn’t dare to blame Joe Biden.",
    "Air Force!” like a hyperactive toddler helping Dora find the Map.",
    "Besides: “The average American home has 3 televisions in it now.",
    "He’s introduced as Benjamin Wittes of the Brookings Institution.",
    "And that’s a wake up call about the dangers of global democracy.",
    "So naturally, the Soviet population took quite a different view.",
    "It is, on average, the oldest crowd I’ve seen in quite a while.",
    "It doesn’t take long before Mayo turns his attention overseas.",
    "Patrick Chovanec chimes in: “Putin is, you know, he does judo.",
    "It’s no longer enough to build a coalition in any one country.",
    "He was a wake up call about the dangers to American democracy.",
    "A young woman in front of me walks into the men’s restroom.",
    "A very midwestern woman, maybe early 30s, jumps up eagerly.",
    "Please get out of politics.” But it goes beyond even that.",
    "Right, they are my friends.” Okay, Denver, I believe you.",
    "Then—we all knew it was coming—he turns his eyes to Keev.",
    "As our case is new, so we must think anew, and act anew.",
    "It’s Russia’s brutal and horrific invasion into Ukraine.",
    "He’s taller than I expected, and not a shabby speaker.",
    "Wallner brings up Machiavelli’s Discourses on Livy.",
    "Defending Ukraine isn’t just about Ukraine anymore.",
    "“…our Ukrainians are beating their Russians.” Whew.",
    "When I go back there, I know what I’m up against.",
    "I wonder how long it’s been since he’s read Livy.",
    "“For pastors: I esteem your very important role.",
    "He leads like what David Frum was talking about.",
    "Lo and behold, it’s Congressman Adam Kinzinger.",
    "I’ve never known anyone who had to say as much.",
    "Riggleman assures us: “I am friends with them.",
    "A lone whoooo rings out somewhere in the back.",
    "But hey, what’s more American than rebuilding?",
    "And that, to me, is a really dangerous thing.",
    "What’s happening?”\nNowrasteh is less patient.",
    "I was criticizing your guy.” Uh, yeah, okay.",
    "I’m taking you across to the Promised Land.",
    "You know who he’s not friends with, though?",
    "How did you think that was going to happen?",
    "You know what is a wake up call right now?",
    "I said, this president was a wake up call.",
    "Guy 3 has slid into the stall behind me.",
    "I wouldn’t dare to argue with him there.",
    "Bomber Jacket heads up to the stage now.",
    "That could have been a whole lot worse.",
    "That’s a really hard thing to swallow.",
    "I’m very moderate.” All clap politely.",
    "“You’re a good person,” he assures us.",
    "I want to devolve to the individual….",
    "He has been doing this for years now.",
    "So in the confusion, what does he do?",
    "Twenty-six minutes of nothing ensue.",
    "They’re not where Miles [Taylor] is.",
    "“Liz Cheney—wonderful,” Walsh says.",
    "I take a table on the smoking side.",
    "But that is what we’re doing today.",
    "The woman says she lives in Vegas.",
    "It’s time for audience questions.",
    "/ You have a compass in the fog.",
    "You got to go run to be a judge.",
    "Vance together with Josh Mandel.",
    "A hard thing to swallow indeed.",
    "That’s what we’re fighting for.",
    "/ NON-NEANDERTHAL conservatism.",
    "“It’s okay to be a good person.",
    "It should be bigger than that.",
    "A few catch my eye: NO TUCKER.",
    "/ Stop trumpism, save America.",
    "So again, I thought about it.",
    "The people are not listening.",
    "My mother’s Trump, oh my G-d.",
    "But this is about the voters.",
    "They’re not where Barbara is.",
    "I love all of you out there.",
    "I’m speaking to God Himself.",
    "Presumably to avoid any Jeb!",
    "He leads like Geoff Duncan.",
    "“I’m a lifelong Democrat.",
    "Actually think about it.",
    "He focuses on January 6.",
    "We just judge people.",
    "That was really hard.",
    "Social conservatives.",
    "What does Moses do?",
    "That’s really sad.",
    "So what do we do?",
    "What’s happening?",
    "I’m not far left.",
    "/ Bipartisanship.",
    "/ ED MUND BURKE.",
    "***\n“Come on in.",
    "I’m going home.",
    "But I love her.",
    "It’s just not.",
    "That was hard.",
    "It's an idea.",
    "/ Democracy.",
    "I envy him.",
    "Air Force!",
    "He leads.",
    "/ Peace.",
    "As B.J.",
    "Truth.",
    "B.J."
  ]
}