{
  "id": 26194,
  "mediaId": 2672,
  "date": "2022-03-29",
  "headline": "J.D. Vance Says Marjorie Taylor Greene ‘Did Nothing Wrong’ by Speaking at White Nationalist Rally",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/jd-vance-mtg.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/jd-vance-marjorie-taylor-greene-white-nationalist-event-1329338/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "https://www.rollingstone.com/author/willcv/",
  "termIds": [
    13425,
    13435,
    13542,
    13667,
    13702,
    13978,
    14192,
    13372
  ],
  "sentences": [
    "“And I asked, ‘Did she say something bad at the conference?’ I actually watched her remarks and I agreed with nearly every word that she said.”\nGreene lamented how those in attendance at the white nationalist event were “canceled Americans,” called Democrats the “communist party,” and claimed they had destroyed “gender” and “pronouns.”\nGreene was followed by speakers who pushed the “great replacement” theory and called for Dr. Anthony Fauci’s hanging, HuffPost reported.",
    "It may be politically expedient for Vance to not speak ill of Greene, as he’s in the middle of a GOP primary filled with a bunch of MAGA devotees trying to give the reddest of red meat to the electorate — or, as one source close to former President Donald Trump told The Daily Beast, “trying to suck [Trump’s] dick.” (Trump himself has not made an endorsement in the race.)",
    "At the OH Senate debate tonight, JD Vance is asked if he will condemn Marge Greene speaking at a Nazi rally: “She is my friend, and she did nothing wrong .. and I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.” pic.twitter.com/fipwlONqc4\n— Ron Filipkowski ????",
    "“She said nothing wrong, and I’m absolutely not going to throw her under the bus, or anybody else who’s a friend of mine.”\nGreene, the bigoted conspiracy theorist whose endorsement Vance gladly accepted in January, was a guest of America First PAC organizer and white nationalist Nick Fuentes.",
    "It’s been quite a transformation for Vance who was fiercely critical of Trump ahead of the 2016 election, calling the future president “reprehensible” and an “idiot.”\n“I happen to say stupid things very pubicly,” Vance said earlier this month of his past criticism of Trump.",
    "Fuentes during his speech at the event bashed the idea of diversity, claimed “white men” are America’s “secret sauce,” called for the audience to cheer Vladimir Putin, and even offered some coded praise for Adolf Hilter.",
    "“They play this guilt by association game where they get us to stab our friends in the back, and then we wonder why the left always wins,” Vance complained during a debate on Monday night.",
    "(@RonFilipkowski) March 29, 2022\n“The accusation against Marjorie is pretty simple: that she appeared at a conference where somebody said something bad,” Vance framed it.",
    "Greene later attempted to distance herself from Fuentes by claiming she didn’t know him, never heard him speak, and didn’t even know what his views are.",
    "Vance didn’t have a bad word to say about Rep. Marjorie Taylor Greene (R-Ga.)’s participating in a white nationalist event last month.",
    "It was this type of questioning that Vance claimed “the media does” to Republicans but “never” to Democrats.",
    "“She is my friend, and she did nothing wrong,” Vance said of Greene’s participating in the event.",
    "Ohio Senate candidate J.D."
  ]
}