{
  "id": 26191,
  "mediaId": 2621,
  "date": "2022-04-14",
  "headline": "Ohio Republicans Try to Stop Trump Endorsement of J.D. Vance: ‘Self-Proclaimed Never Trumper’",
  "image": "https://www.mediaite.com/wp-content/uploads/2020/09/Donald-Trump-GettyImages-1272876239.jpg",
  "link": "https://www.mediaite.com/politics/ohio-republicans-try-to-stop-trump-endorsement-of-j-d-vance-self-proclaimed-never-trumper/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    13521,
    13592,
    13702,
    13724,
    13803,
    14187,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "Vance is widely known by Republican primary voters for his Never Trumper comments and previously calling Trump supporters ‘racists.’ Since he is already known to Ohioans as a self-proclaimed ‘Never Trumper’ and voters will forcefully be reminded of that, Vance will still lose even with President Trump’s endorsement.”\nAdditionally, three-dozen County Republican Party chairs and other high-ranking party members wrote a letter in which they reminded Trump Vance had “referred to your supporters as ‘racists’ and proudly voted for Evan McMullin in 2016.”\nOne person who recently had Trump’s ear also attempted to dissuade him from supporting Vance.",
    "In recent days, Trump has begun calling donors and advisers to get their opinions on endorsing the “Hillbilly Elegy” author, but he held off under intense pressure from the rival Republican campaigns of Josh Mandel and Jane Timken, sources said.",
    "Trump invoked Mandel’s behavior at a debate in March in which he called candidate Mike Gibbons a “pussy.” The country’s 45th president reportedly called the behavior “embarrassing.”\nOhio voters head to the polls on May 3.",
    "Club for Growth President David McIntosh, who POLITICO reported supports Mandel, asked the former president to refrain from issuing a Vance endorsement in-person at the Trump rally in North Carolina last weekend.",
    "On Thursday, NBC News reported Trump was prepared to weigh-in on the crucial race:\nFormer President Donald Trump plans to endorse J.D.",
    "A polling firm connected to candidate Josh Mandel circulated a memo in which it argued Trump’s endorsement would not help Vance.",
    "Other Mandel supporters attempted to get Trump to endorse the former Iraq War veteran last month, according to the report.",
    "Vance will still lose even with President Trump’s endorsement,” said Remington Research Group president Titus Bond.",
    "Vance in Ohio’s crowded Senate GOP primary, according to three sources with knowledge of his decision.",
    "According to POLITICO, Ohio Republicans are attempting to keep him out of the crowded primary.",
    "Republicans in Ohio are working to prevent former President Donald Trump from endorsing J.D.",
    "As of Thursday evening, Trump had yet to issue one of his inbox endorsements in the race.",
    "Vance in the state’s upcoming GOP Senate primary.",
    "Have a tip we should know?",
    "tips@mediaite.com",
    "“J.D.",
    "“J.D."
  ]
}