{
  "id": 26209,
  "mediaId": 2911,
  "date": "2022-02-28",
  "headline": "Where Ohio Republicans’ Attacks On Dr. Fauci Came From",
  "image": "https://fivethirtyeight.com/wp-content/uploads/2022/02/GettyImages-1238574595-16x9-1.jpg?w=700",
  "link": "https://fivethirtyeight.com/features/where-ohio-republicans-attacks-on-dr-fauci-came-from/",
  "mediaOutlet": "FiveThirtyEight",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaleigh Rogers",
  "authorUrl": "https://fivethirtyeight.com/contributors/kaleigh-rogers/",
  "termIds": [
    13425,
    13592,
    13702,
    13724,
    13803,
    13942,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "“So the Satanic forces in OUR Government is responsible for MILLIONS of deaths.”\n“[F]auci created AIDS to kill the homosexual community he created the MRNA vaccine to depopulate the world steal our children and get his adrenonachrome,” another user posted in the same Telegram chat, on Feb. 1, referring to the conspiracy theory that elites torture children to elicit a fear response in the children’s bodies, thus creating a chemical called adrenochrome, which the elites then harvest and consume to become immortal.",
    "Take, for example, Vance’s claims that Fauci perjured himself when he told Congress the National Institutes of Health does not fund gain-of-function research — research where an organism, such as a virus, is altered to give it a new property or to enhance an existing one — at the Wuhan Institute of Virology.1\nSuch a claim taps into a layered conspiracy theory that COVID-19 was intentionally created at the WIV.",
    "Josh Mandel, a former state treasurer, tweeted last year that the founding fathers would have “tarred and feathered Dr. Fauci.” Former Ohio GOP chair Jane Timken rolled out a six-figure ad campaign where she proposed to “fire Fauci.” Mike Gibbons, an investment banker, has called Fauci a “liar” whose “credibility is shot.” And “Hillbilly Elegy” author J.D.",
    "On top of that, some conspiracy theorists believe it was intentionally created by the NIH, under Fauci’s direction, to facilitate the need for vaccines, which the conspiracists believe either kill you, give you AIDS, are the mark of the beast or play into various other colorful fantasies.",
    "Some background …\nThe COVID-19 pandemic thrust Fauci into the spotlight in an unprecedented way, and amid the partisan conflict over how best to handle the pandemic, he became a target for right-wing critics who blamed him for both the Trump and Biden administrations’ pandemic responses.",
    "And while the Republican pile-on of Fauci goes beyond Ohio — in fact, there was a series of speeches under the title “Fire Fauci” at the Conservative Political Action Conference on Feb. 26 — it’s a recent case study that shows just how popular the hate for Fauci is on the right.",
    "The more vague and overarching the criticism of Fauci — such as calling him a “liar” or calling for him to be fired without specifying why he deserves to lose his job — the more easily they can be transposed onto the wildest conspiracy theories the internet has to offer.",
    "Who said what …\nThe race for the Republican nomination for Senate in Ohio is hotly contested, closely watched and full of candidates who more or less believe the same things — including that Dr. Anthony Fauci, the White House’s chief medical adviser, is a bad dude.",
    "In April 2021, the Annenberg Public Policy Center at the University of Pennsylvania found that 71 percent of Americans said they were confident Fauci was providing trustworthy advice on COVID-19, with 47 percent of Republicans saying so.",
    "“Trump learned about this and changed the vax to kill the population of the elite everyone who dies of covid after having the vax is of satanic bloodlines everyone else will get sick from it but should survive[.",
    "Where the comment came from …\nThe most obvious source of the attacks on Fauci is the soured relationship between him and former President Donald Trump, who have a long, well-documented history of conflict.",
    "]”\nTo be clear, neither Vance nor the other Ohio candidates have explicitly advanced these specific conspiracy theories, but the attacks on Fauci are red meat for individuals who believe them.",
    "“IF we ever get the truth (bahahahahaha) we’ll find Fauci gave us AIDS, HEP C, certain CANCERS and other diseases,” wrote a user in a QAnon chat group on the messaging app Telegram, on Feb. 3.",
    "Being anti-Fauci is an easy proxy for politicians and candidates to convey that they are pro-Trump and anti-mandates (vaccine, mask or otherwise).",
    "These conspiracy theorists believe Fauci is a satanist, a member of the “deep state” and a pedophile who is responsible for the entire pandemic.",
    "While the possibility of an accidental lab leak is still being investigated, there is so far no evidence the virus was created on purpose.",
    "We explain what their claims are referring to, the evidence (or lack thereof) behind them and where they sprang from in the first place.",
    "Vance has called Fauci a tyrant, pledged to reduce Fauci’s salary to zero dollars and accused him of committing perjury.",
    "By January 2022, 65 percent of Americans said they were confident in Fauci, while just 36 percent of Republicans did.",
    "But whether or not they realize it, they’re also taking advantage of simmering conspiracy theories on the far right.",
    "Each of the leading Republican candidates in Ohio’s Senate race have piled on the top doc throughout the campaign.",
    "This is the latest edition of our column that excavates the origins of public figures’ extreme comments.",
    "And given GOP voters’ waning trust in the doctor, dunking on Fauci is an easy win for Republicans.",
    "These attacks preceded a change in public trust of Fauci.",
    "(The theory, so far as we can tell, is false.)"
  ]
}