{
  "id": 26201,
  "mediaId": 2819,
  "date": "2022-02-07",
  "headline": "Thiel-Backed Video Platform Rumble Offers Joe Rogan $100 Million to Switch From Spotify",
  "image": "https://api.time.com/wp-content/uploads/2022/02/Joe-Rogan-Podcast-1.jpg?quality=85&w=1024&h=628&crop=1",
  "link": "https://time.com/6145835/joe-rogan-rumble-podcast-offer/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan McCluskey",
  "authorUrl": "",
  "termIds": [
    13517,
    13768,
    14008,
    14173,
    13317,
    13328,
    13355
  ],
  "sentences": [
    "The streaming service has responded to the ongoing controversy—which has prompted artists like Neil Young, Joni Mitchell, India Arie, and Crosby, Stills & Nash to pull their music from the platform in protest—by announcing it will add content warnings to podcasts that address COVID-19 and entering into discussions with Rogan that resulted in the removal of as many as 70 episodes of “The Joe Rogan Experience.”\n“Not only are some of Joe Rogan’s comments incredibly hurtful—I want to make clear that they do not represent the values of this company,” Spotify CEO Daniel Ek wrote in a Feb. 6 memo to staff before reasserting that he doesn’t believe that “silencing Joe is the answer.”\n“We should have clear lines around content and take action when they are crossed, but canceling voices is a slippery slope,” he said.",
    "Chinese Parents Protest Child Separation for COVID-19\nHow the Company Behind TikTok's Viral 3D-Printed Houses Wants to Help Solve the Affordable Housing Crisis\nEverything Everywhere All At Once May Be Too Trippy for Its Own Good—But Michelle Yeoh Still Dazzles\nRepublican States Crack Down on Access to Abortion Pills as Supreme Court Decision Looms\nSHARE THIS STORY",
    "More Must-Read Stories From TIME\nA Visit to the Crime Scene Russian Troops Left Behind at a Summer Camp in Bucha\nWhen the Future of Work Means Always Looking For Your Next Job\nPlanet Earth's Future Now Rests in the Hands of Big Business\n'My Daughter Was Alone in the Hospital for 5 Days.'",
    "Play\nRemaining Time -0:00\nLoaded: 0%\nProgress: 0%\nCurrent Time 0:00\n/\nDuration Time 0:00\nStream TypeLIVE\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\nCaptions\nAudio Track\nUnmute\nFullscreen\nReserve now\nThis is a modal window.",
    "See the note from our CEO @chrispavlovski... pic.twitter.com/G7ahfNNjtP\n— Rumble (@rumblevideo) February 7, 2022\nSince launching in 2013, Rumble, a Canadian video-sharing platform that presents itself as an alternative to YouTube, has become a right-wing haven.",
    "After Rumble announced on Dec. 1 that it was planning to go public at an initial enterprise value of $2.1 billion, Trump Media and Technology Group shared on Dec. 14 that Donald Trump’s proposed social media platform, TRUTH Social, had partnered with Rumble.",
    "“Rumble was designed to be immune to cancel culture, and we are at the forefront of a movement that believes everyone benefits from access to a neutral platform that hosts diverse ideas and opinions,” Pavlovski said of the partnership in a press release.",
    "Text Color White Transparency Opaque Background Color Black Transparency Opaque Window Color Black Transparency Transparent\n Font Size 100%\n Text Edge Style None\n Font Family Proportional Sans-Serif\n Defaults Done\nYour video will begin shortly.",
    "Rumble CEO Chris Pavlovski wrote in an open letter posted to Twitter on Monday that he stands with Rogan, who has recently come under fire for spreading COVID-19 vaccine misinformation and using racial slurs on the massively popular podcast.",
    "As the controversy surrounding Spotify’s relationship with podcast host Joe Rogan continues, Rumble has offered Rogan $100 million to bring his show, “The Joe Rogan Experience,” over to the free-speech-centric video platform.",
    "Reserve now\nThe First-Ever All-Electric Chevy Silverado\nReserve now\n Reserve now\nPaid Partner Content\n The First-Ever All-Electric Chevy Silverado\nBy Chevrolet\nHey @joerogan, we are ready to fight alongside you.",
    "The site saw significant growth following the start of the COVID-19 pandemic, with monthly viewership surging from 1.6 million users in fall 2020 to 31.9 million by the end of 2021’s first quarter.",
    "Rumble has previously struck content deals with popular right-wing personalities like journalist Glenn Greenwald and former U.S. congresswoman Tulsi Gabbard.",
    "It has since received backing from a group of prominent conservative venture capitalists including Peter Thiel and Hillbilly Elegy author J.D.",
    "The only EV truck that combines 4-Wheel Steer, a Multi-Flex Midgate, and up to a GM-estimated 400-mile range on a full charge.",
    "How about you bring all your shows to Rumble, both old and new, with no censorship, for 100 million bucks over four years?",
    "The media could not be loaded, either because the server or network failed or because the format is not supported.",
    "As things currently stand, Rogan signed a $100 million deal giving Spotify exclusive rights to his show in 2020.",
    "And yes, this is totally legit.”\nNeither Rumble nor Rogan immediately responded to TIME’s request for comment.",
    "“We stand with you, your guests, and your legion of fans in desire for real conversation,” Pavlovski wrote.",
    "Reserve now\nThe First-Ever All-Electric Chevy Silverado\nIntroducing the All-Electric Chevy Silverado RST.",
    "“So we’d like to offer you 100 million reasons to make the world a better place.",
    "Captions Settings Dialog\nBeginning of dialog window.",
    "And the only way to reserve it is at Chevy.com.",
    "Escape will cancel and close the window.",
    "This is our chance to save the world.",
    "Vance."
  ]
}