{
  "id": 26212,
  "mediaId": 2592,
  "date": "2022-04-05",
  "headline": "Early Voting In Ohio Begins Despite Ongoing Fight Over U.S. Congressional Map",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/04/05/ohio-governor-mike-dewine-speaking-in-dayton.jpg",
  "link": "https://www.ibtimes.com/early-voting-ohio-begins-despite-ongoing-fight-over-us-congressional-map-3462813?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Ax",
  "authorUrl": "",
  "termIds": [
    13901,
    13940,
    14049,
    14153,
    13312,
    13334,
    13364,
    14252,
    14317
  ],
  "sentences": [
    "The state Supreme Court in January threw out a previous iteration of the map, ruling that it violated a state constitutional provision barring congressional districts drawn to benefit one party over another, a practice known as gerrymandering.",
    "Early voting began in Ohio on Tuesday for the May 3 primary elections, all but ensuring that voters will pick their candidates for the U.S. Congress using a Republican-backed congressional map despite ongoing litigation over its legality.",
    "\"The Republicans have been stalling, making excuses, and passing unconstitutional maps since day one, knowing that time was on their side,\" the American Civil Liberties Union of Ohio said in a statement after suing over the revised map.",
    "Daniel Tierney, a DeWine spokesperson, said the commission addressed the court's concerns about specific counties while following the constitution's requirements to preserve local communities and use compact boundaries.",
    "The revised plan created 10 safe Republican seats, two safe Democratic seats and three competitive districts in a Midwestern state where Republicans have received about 54% of the vote statewide over the last decade.",
    "The state will hold a second primary, likely in August, for state legislative races, after the Ohio Supreme Court invalidated three successive maps advanced by Republicans on the redistricting commission.",
    "In response, the Republican-controlled state redistricting commission, including Republican Governor Mike DeWine, approved a second map last month that made some changes but still gave the party an edge.",
    "Voting rights advocates and Democrats filed another lawsuit challenging the second map, but the state Supreme Court has set out a schedule that will delay any decision until after the primary.",
    "A panel of three federal judges overseeing separate litigation had weighed whether to postpone the election but had not done so as of Tuesday, when voters began casting ballots.",
    "The campaign has turned increasingly negative as most candidates have sought to ally themselves with former President Donald Trump, who has not endorsed anyone.",
    "DeWine is facing three Republican challengers: former U.S. Representative Jim Renacci, former state legislator Rod Hood and Joe Blystone, a farmer.",
    "The candidates selected in the May 3 primary will represent their parties in the Nov. 8 midterm elections that will determine control of Congress.",
    "Vance, former state Treasurer Josh Mandel, former state Republican Chair Jane Timken, financier Mike Gibbons and state lawmaker Matt Dolan.",
    "In addition to U.S. House of Representatives races, the ballot includes nominating contests for a U.S. Senate seat and governor.",
    "Under the U.S. Constitution, all states must reallocate House districts every 10 years following the census.",
    "The winner will likely face U.S. Representative Tim Ryan, who is expected to win the Democratic nomination.",
    "Former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley are vying for the Democratic nod.",
    "The crowded Republican Senate primary includes author J.D."
  ]
}