{
  "id": 26214,
  "mediaId": 2668,
  "date": "2022-04-09",
  "headline": "Establishment Favorite in Ohio Decides to Burn His Campaign to the Ground",
  "image": "https://media.townhall.com/townhall/reu/o/2017/182/1cdfaa49-1d92-4ead-b35f-abc560ecbfcb-1110x740.jpg",
  "link": "https://redstate.com/bonchie/2022/04/09/establishment-favorite-in-ohio-decides-to-burn-his-campaign-to-the-ground-n547813",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bonchie",
  "authorUrl": "https://redstate.com/author/bonchie",
  "termIds": [
    13702,
    13803,
    13953,
    13283,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "Ohio GOP Senate candidate Mike Gibbons on a Crain’s Cleveland Business podcast:\n“The top 20% of earners in the U.S. pay 82% of federal income tax — and, you do the math, and 45% to 50% don’t pay any income tax… The middle class is not really paying any kind of a fair share.” pic.twitter.com/VUYzPTlqmX\n— Heartland Signal (@HeartlandSignal) April 8, 2022\nIt’s the weekend, so I’m going weapons-free on gif usage.",
    "Right now, the middle class is getting absolutely toasted by inflation, and a leading GOP candidate for the Senate thinks now is a good time to riff on the unfairness of our tax system to millionaires and billionaires?",
    "That means that when you consider everything the wealthy bring in compared to their effective tax rate, the rich pay about the same percentage of their money into the system as the middle class.",
    "Even if Gibbons, because of early voting, ends up winning the primary, he’s now made himself a liability not just in his own race, but to other Republican candidates around the country.",
    "During a recent debate, things got so heated that Mike Gibbons, the establishment’s favorite, and Josh Mandel, who is often seen as more populist, had to be physically separated.",
    "Yet, despite his lead, Gibbons decided to burn his campaign to the ground recently by saying something that might as well have taken from Romney’s 2012 presidential campaign.",
    "I’m sure most people reading this are middle-class and owe money, or that their refund doesn’t fully offset what they paid to the government throughout the year.",
    "Heck, I’m middle-class and I’m about to write a $15,000 check to the IRS — despite paying a hefty amount into the system every month (i.e.",
    "Now, I’m not suggesting the capital gains tax should be increased, and I understand how important spurning investment is to the economy.",
    "Lastly, putting all the technical arguments aside, going after the middle-class in the current environment is just politically inept.",
    "But I am suggesting the assertion that the rich are deeply abused when it comes to the overall tax structure just isn’t true.",
    "Secondly, the statistics say that the middle-class pay, on average, around 8 percent of their earnings in federal income tax.",
    "Gibbons himself is, of course, a very wealthy man, which explains why he’d be stupid enough to even get into this topic.",
    "Thirdly, Gibbons’ statement makes does not account for the differences in capital gains tax rates and income tax rates.",
    "Vance and Mandel have split one lane of voters while Gibbons leads overall (via polling) by a few points.",
    "Most of the richest Americans make most of their money through investments after a certain threshold.",
    "Stop obsessing over tax rates and start talking about issues that Americans actually care about.",
    "How, in this day and age, can a Republican candidate still be unaware of what year it is?",
    "Still, any GOP candidate needs to have enough of a filter to not set themselves on fire.",
    "I don’t know who else besides Gibbons needs to hear this, but it’s not 2012 anymore.",
    "Early voting has begun, and the actual primary election will be held on May 3rd.",
    "It is true that the highest wage earners pay most of the federal income taxes.",
    "Insinuating they aren’t “paying their fair share” is misleading at best.",
    "The GOP’s Senate primary in Ohio has been lively, to say the least.",
    "And look, I get that he’s kind of half-right in a technical sense.",
    "Mitt Romney’s vision of the GOP is never coming back.",
    "They pay the gas tax every time they fill up.",
    "my overall bill is even bigger than that).",
    "That is not zero, as Gibbons insinuates.",
    "Yet, the middle-class pays FICA taxes.",
    "In a story as old as time, J.D.",
    "Here’s what that sounded like.",
    "They pay state income tax.",
    "They pay sales taxes."
  ]
}