{
  "id": 26219,
  "mediaId": 2664,
  "date": "2022-02-21",
  "headline": "Putin’s ‘shills’ in the GOP are making Russia’s invasion of Ukraine more likely: conservative",
  "image": "https://www.rawstory.com/media-library/j-d-vance-marjorie-taylor-greene-paul-gosar.jpg?id=29395831&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/republicans-putin-2656756682/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    13493,
    13511,
    13802,
    13880,
    14172,
    14192,
    13312,
    14332,
    14355
  ],
  "sentences": [
    "Their efforts to undermine U.S. support for Ukraine are much appreciated in Moscow.\\nhttps://twitter.com/JuliaDavisNews/status/1491473877507219456?s=20&t=KHBjZR86xgHNvURQ5vMYWQ\\u00a0\\u2026pic.twitter.com/GQf77PP3Db\n— Julia Davis (@Julia Davis) 1644774630\n\"Tucker is not the only voice on Fox News arguing that the focus on Ukraine-Russia is all a big distraction.",
    "And Putin very much has the measure of the man, who has lavished him with praise, tried to weaken NATO, sided with him over his own government’s intelligence agencies, and actually held up military aid as part of his pressure campaign to get Ukraine's president to dig up dirt on Biden,\" Sykes wrote.",
    "\"Fiona Hill, the former senior director for Europe and Russia at the National Security Council, calls them \"the ultimate stooges,\" but at least for now, these right wing voices do not speak for most congressional Republicans, who have tended to take a far more hawkish stance.",
    "Marge Greene yesterday told a complete lie that \\u201cUkraine was the number one donor to Hillary Clinton when she was running for president.\\u201dpic.twitter.com/UvJ7Hep3JE\n— Ron Filipkowski (@Ron Filipkowski) 1645366828\nHe also noted comments by Ohio Senate hopeful J.D.",
    "The conspiracy maven formerly known as the 'money honey,' Maria Bartiromo, insists that the whole Ukraine-Russia threat has been fabricated to distract from (checks notes) Hillary Clinton,\" he wrote.",
    "By now the cast of Putin’s useful idiots is familiar, ranging from Tucker Carlson and Josh Hawley to Candace Owens, MTG, and Maria Bartiromo,\" The Bulwark editor-at-large wrote.",
    "What we can know, however, is that Putin is fully aware that he faces a divided U.S., and that influential voices on the right have been channeling much of his own propaganda.",
    "But Putin can be forgiven if he thinks his 'conservative' allies represent the sentiment of MAGAWorld, coming as they do from some of Trump’s most loyal acolytes.",
    "\"Ben Shapiro’s Candace Owens has not only defended Putin’s position, she has also suggested that we should be be invading Canada instead.\"",
    "Will Vladimir Putin care more about what is considered the position of the Republican Party or the assumed position of the MAGA movement?",
    "Republicans and Fox News personalities were called out by conservative Charlie Sykes as \"Putin's right-wing shills\" on Monday.",
    "And he may be especially emboldened if he believes that Trump himself may actually return to the Oval Office,\" he explained.",
    "\"President Biden has agreed “in principle” to a summit with Putin, which may or may not avert a catastrophic war.",
    "I think it’s reasonable to assume that he thinks these are the authentic echoes of the Once and Future MAGA king.",
    "#Russia's favorites, Tucker Carlson and Josh Hawley, are again being featured on state TV.",
    "Sykes noted Russia state-TV praise for Tucker Carlson and Josh Hawley.",
    "\"What is Putin making of all of this?",
    "\"So these right-wing shills matter.\"",
    "Vance and Rep. Paul Gosar (R-AZ).",
    "We don’t know."
  ]
}