{
  "id": 26220,
  "mediaId": 6461,
  "date": "2022-02-25",
  "headline": "Democrats and Republicans are sort of united over Ukraine",
  "image": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20220226_USP503.jpg",
  "link": "https://www.economist.com/united-states/2022/02/25/democrats-and-republicans-are-sort-of-united-over-ukraine",
  "mediaOutlet": "Economist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13461,
    13592,
    13606,
    13764,
    14116,
    14192,
    13197,
    13312,
    14355,
    14357
  ],
  "sentences": [
    "“Biden is weak and Trump was strong.” Mr Graham was among the 52 Republican senators who voted to acquit Mr Trump on impeachment charges in 2020, after the former president was shown to have denied Ukraine military aid in an effort to shake down its president, Volodymyr Zelensky, for a political favour.",
    "It’s a kind of a concept…It’s just a corrupt area that the Clintons turned into a colony where they can steal money out of.” Such figures remain hugely popular with conservative activists, whose influence in Republican primaries gives them a weight far beyond their numbers.",
    "Every single available tough sanction should be deployed, and should be deployed now.” Senate Democrats and Republicans recently failed to agree on a sanctions package of their own, which ceded responsibility for the issue to Mr Biden.",
    "The famous dictum of Senator Arthur Vandenberg, one of the architects of the NATO alliance, that “politics stops at the water’s edge” was for this reason prescriptive as well as descriptive.",
    "Democrats strongly approve of the administration’s efforts to levy sanctions and rally NATO against Mr Putin, even as Mr Biden promises that no American forces will be deployed to Ukraine.",
    "Yet the fact that most Americans do not have strong opinions about overseas issues is precisely why the elite consensus that has traditionally governed foreign policy was so prized.",
    "Under Donald Trump, Republican voters adopted a more positive view of Mr Putin, whom the former president often praised, and a negative view of Ukraine, which he denigrated.",
    "A recent poll from YouGov and The Economist (conducted shortly before the invasion) found that 63% of Democrats and 60% of Republicans backed sanctions on Russia.",
    "The country’s feuding parties are presenting a more united front against Vladimir Putin’s aggression than they have on any other issue of Joe Biden’s presidency.",
    "As Russia and China look on, pondering whether Americans can still pull themselves together in a great national endeavour, they may not be too discouraged.",
    "“If Donald Trump were president, none of this crap would be going on,” said Senator Lindsey Graham, a veteran Republican hawk, on the eve of the invasion.",
    "And some, including Mitch McConnell, the Republicans’ Senate leader, have gone so far as to offer lukewarm praise of Mr Biden’s management of the crisis.",
    "Those announced on February 24th include curbs on five Russian banks—taking the total sanctioned to seven—and on Russia’s access to technology imports.",
    "“We’re all together at this point and we need to be together about what should be done,” said Mr McConnell on February 24th, the day of the invasion.",
    "Even though most Republican lawmakers have endorsed Mr Biden’s position on Ukraine, they are therefore straining to find reasons to criticise him.",
    "“After just one year of a weak, feckless and unfit President of the United States and commander-in-chief, the world is less safe,” she bloviated.",
    "Bush reflected in 1992, was that, “by the grace of God, America won the Cold War.” It was not only wonderful that the Soviet Union was no more.",
    "Vance, a venture capitalist who is running for a Republican Senate ticket in Ohio, told a pro-Trump podcast hosted by Steve Bannon last week.",
    "The then president also considered that its demise represented a complete validation of America’s economic and democratic values.",
    "That is especially so when it comes to war, a costly business, against which voters are especially vulnerable to rabble-rousing.",
    "The former president lauded the Russian leader’s machinations towards Ukraine this week as “genius”, “very savvy” and “smart”.",
    "Though she condemned Mr Putin as a “war criminal” and “deranged thug”, Ms Stefanik mostly blamed Mr Biden for the war.",
    "It is a shame that the unity America has mustered in this circumstance, welcome though it is, is not more impressive.",
    "A statement on February 24th from the third-ranking House Republican, Elise Stefanik of New York, illustrates this.",
    "America’s most popular anchor, Tucker Carlson of Fox News, a weathervane of Trumpist sentiment, echoes their views.",
    "Whatever most Republican lawmakers may think on the issue, their party’s foremost leader remains Mr Trump.",
    "The gratuitous Republican snarking at Mr Biden over Ukraine exemplifies how little of that spirit remains.",
    "At the height of the cold war America had over 400,000 troops in Europe, ready to face a Soviet onslaught.",
    "Even Republicans who were once taken seriously on national-security issues are adopting the same tactic.",
    "The popular claim on the left that the Republicans have been captured by Mr Putin is an exaggeration.",
    "This week he described Ukraine as a sham democracy “essentially managed by the State Department”.",
    "Some of that moral certainty is evident in America’s political response to the Ukraine crisis.",
    "Even if few mainstream conservatives approve of such populist nonsense, few will balk at it.",
    "Nonetheless, almost all approve of his latest measures, unveiled in two tranches this week.",
    "America’s politicians are responding to public opinion as well as cold-war muscle memory.",
    "Yet it would be wrong to make too much of this bipartisan moment—or expect it to last.",
    "And this is especially true on foreign policy, a low-priority issue for most voters.",
    "Opposing the left matters more to most Republicans than the specifics of any issue.",
    "A few days later he called Russia’s invasion of Ukraine “unquestionably a tragedy”.",
    "But surveys suggest Republicans and Democrats now hold much the same views on them.",
    "And his disregard for European security and admiration for Mr Putin are unchanged.",
    "Some Republicans who aped Mr Trump’s pro-Putin views are therefore reconsidering.",
    "“I don’t really care what happens to Ukraine one way or the other,” J.D.",
    "According to Mr Bannon himself this week: “Ukraine’s not even a country.",
    "And most voters, tuning out the political noise, will hardly notice it.",
    "“The world trusts us with power, and the world is right,” he said.",
    "By contrast, it stands to lose no lives to the Ukraine conflict.",
    "Our recent coverage of the Ukraine crisis can be found here",
    "THE MOST important global event of his life, George H.W.",
    "And this, mind, is despite the modesty of his policy.",
    "That was the main political lesson of the Trump era.",
    "It is tempting to shrug off such grandstanding.",
    "Most Republicans also back that approach.",
    "Hardcore Trumpist activists go further.",
    "“Ratchet the sanctions all the way up.",
    "It has not hampered Mr Biden.",
    "Don’t hold any back."
  ]
}