{
  "id": 26243,
  "mediaId": 2707,
  "date": "2022-03-21",
  "headline": "Pro-Trump Ohio candidates realize endorsement may never come",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/03/Election_2022_Ohio_Republicans_85087-1.jpg?w=1024&h=683",
  "link": "https://www.ocregister.com/2022/03/21/pro-trump-ohio-candidates-realize-endorsement-may-never-come-2/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.ocregister.com/author/associated-press/",
  "termIds": [
    13436,
    13702,
    13724,
    13803,
    13942,
    14045,
    13312,
    14294,
    14317
  ],
  "sentences": [
    "It’s about America First and the ideas and the things that he accomplished.”\nNonetheless, the wealthy investment banker who is running as “a pro-Trump businessman” ticked through his Trump bona fides, telling his audience at the Stark Country GOP headquarters that he’d served as Trump’s state finance co-chair in 2016, launched a Trump-aligned super PAC and even served as a pro-Trump commentator on Norwegian TV.",
    "But I think he knows I never criticized him or was an anti-Trumper.”\nHe also said he understood Trump’s reluctance: “He doesn’t want to be embarrassed and pick the wrong person.”\nMandel, the far-right candidate who has been using Trump’s playbook of attention-by-controversy, had no qualms about acknowledging his efforts.",
    "Trump crowed last week after the first 2022 midterm election contests that “All 33 Trump-Endorsed candidates won last night in Texas, or are substantially leading.” But many of the candidates he endorsed there were running uncontested or had limited opposition.",
    "Former state Treasurer Josh Mandel is running with the slogan “pro-GOD, pro-GUN, pro-TRUMP.” And former Ohio GOP chair Jane Timken’s website opens with an ad titled “Incredible Leader” that features footage of Trump praising her at his rallies and by tweet.",
    "Gibbons, who told The Associated Press last week that he had never courted Trump’s endorsement, met with the former president Tuesday, according to two people familiar with the sit-down who spoke on the condition of anonymity to discuss a private meeting.",
    "Unless a clear front-runner emerges, allies say Trump may choose to sit out the race entirely, may endorse more than one candidate or may wait to weigh in until the last minute, when many voters will have already made up their minds.",
    "“There’s no candidate in this race that embodies the Trump America First spirit and agenda like I do.”\nTimken spokesperson Mandi Merritt, meanwhile, said Timken “of course would be honored” to receive Trump’s backing.",
    "After being burned when his original pick for Pennsylvania’s open Senate seat dropped out amid allegations of abuse by his ex-wife, Trump has yet to weigh in again in that race or in primaries in Missouri and Arizona.",
    "At his last event in the state, her campaign hired a plane to pull a banner that read “Ohio is Trump Country” and distributed a flyer that called her “The Only True Pro-Trump, America First Candidate” in the race.",
    "But Trump has remained on the sidelines, unable to settle on a pick, even as some current and former aides — a long list of whom are working for competing candidates — have tried to nudge him their way.",
    "Star Clark, 75, an Elyria resident who plans to vote for Mandel, said she she doesn’t care about Trump’s endorsement — as long as the person seeking her vote supports the former president.",
    "Meanwhile in Alabama, Trump’s Senate candidate, Rep. Mo Brooks, has been struggling so badly that Trump told the Washington Examiner this week that he may pull his endorsement.",
    "I love Donald Trump.”\nWhile the former president’s endorsement is coveted by candidates across the country, it remains unclear how valuable it will be in this year’s races.",
    "The final major GOP candidate in the race, state Sen. Matt Dolan, whose family owns the Cleveland Guardians, has not aligned himself with Trump, seeking an alternate lane.",
    "Dorine Garbash, 57, a lifelong Republican who lives in Uniontown, said she’s turned off by candidates who constantly talk up their ties to Trump, whom she voted for twice.",
    "“You know, in this campaign, everybody’s saying they’re all the Trumpiest candidates,” Mike Gibbons, one of the race’s front-runners, said at a campaign event last week.",
    "Rep. Tim Ryan, the leading Democrat in the Ohio Senate contest, sees an opportunity as the Republicans in the race jockey to be the Trumpiest of the bunch.",
    "Adding to the uncertainty: the possibility the election may be delayed after the Ohio Supreme Court this week again rejected proposed legislative maps.",
    "Rob Portman, some of the leading candidates have accepted that, despite their best efforts, the former president’s coveted endorsement may never come.",
    "The candidates’ past criticisms of Trump have also dominated the millions of dollars in negative advertising that has flooded the state’s airwaves.",
    "And I’m confident I’m going to earn it,” he told the AP, noting that he was the first statewide official in Ohio to support Trump in 2016.",
    "Perhaps no race in the nation better represents the transformation of the Republican Party over the last six years than the one in Ohio.",
    "The state that voted twice for former President Barack Obama and elected a long succession of moderate Republicans, from former Gov.",
    "And in Georgia’s governor race, former Sen. David Perdue, whom Trump lobbied to run, has been badly outraised by Republican Gov.",
    "And Attorney General Ken Paxton, a strong Trump ally, was forced into a runoff against Texas Land Commissioner George P. Bush.",
    "And the leading candidates in the race have been working to out-Trump one another as they try to woo both him and his voters.",
    "In addition to Ohio, Trump has yet to endorse in several other high-profile Senate races where his support has been courted.",
    "By JILL COLVIN\nMANSFIELD, Ohio (AP) — Ohio’s crowded Republican Senate race has been all about one man: Donald Trump.",
    "President Trump is watching it closely and will decide at the right time,” said Trump spokesperson Taylor Budowich.",
    "A recent Fox News poll found that about a quarter of Republican primary voters in the state say they are undecided.",
    "But we also have to make our pitch to voters because I think there’s a chance he stays out of it,” said J.D.",
    "“But every day, Jane is focused on earning the endorsement and support of the voters of Ohio,” she said.",
    "“I think a lot of Republicans are afraid of what the Republican primary’s turned into,” he told the AP.",
    "His surprise pick in North Carolina’s Senate race, Rep. Ted Budd, is locked in a competitive primary.",
    "And even majorities of Gibbons, Mandel and Vance supporters said they may well change their minds.",
    "And I really feel that there’s a lot of them out there riding on his coattails,” she said.",
    "But with less than two months until the state’s May 3 primary to succeed retiring Sen.",
    "“I completely respect the president’s decision-making process on the endorsement.",
    "And voters here said in interviews that a Trump endorsement might not matter.",
    "John Kasich to the establishment-minded Portman, has swung decisively right.",
    "Vance notes at his town hall events that he speaks with Trump regularly.",
    "“They need to stick with him if they want to go on and to be something.",
    "“It’s one of those ‘I didn’t leave them, they left me’ kind of things.”",
    "“If they go against Donald Trump, it’s to their detriment,” she said.",
    "“I don’t like people riding on other people’s coattails.",
    "Vance, one of the candidates eagerly courting Trump.",
    "That’s left the candidates trying other tactics.",
    "I’m doing everything I can to earn his support.",
    "“You know I never have,” Gibbons told the AP.",
    "I continue to make my pitch to the president.",
    "“I don’t have to prove my Trump credentials.",
    "“I’ve made my pitch to the president.",
    "“I mean, (Trump) knows who I am.",
    "For now, the race remains fluid.",
    "He doesn’t know a lot about me.",
    "And it’s not about Trump.",
    "“Ohio is a critical race.",
    "Brian Kemp.",
    "That’s it."
  ]
}