{
  "id": 26249,
  "mediaId": 2716,
  "date": "2022-02-08",
  "headline": "J.D. Vance's spineless 'common good conservatism'",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1644340811/jd joel.jpg",
  "link": "https://theweek.com/republicans/1009935/jd-vances-spineless-common-good-conservatism",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joel Mathis",
  "authorUrl": "https://theweek.com/authors/joel-mathis",
  "termIds": [
    13702,
    13312
  ],
  "sentences": [
    "\"Because for the past 20 or 30 years, we've had booms and busts, we've had recessions and good times in the business cycle, but the very consistent trend is that people in the middle of the country have not done well economically, and more importantly, they haven't done well socially either.\"",
    "On Monday, his campaign's internal polling leaked to the media — a brutal 98-page PowerPoint presentation that showed Vance (despite running a relentlessly \"own the libs\" campaign) is losing ground in the GOP primary because voters don't perceive him as being Trumpy enough.",
    "\"If your American dream is to be a good dad or to be a good husband, a good mom or a good wife, that is the American dream that seems to be disappearing even in the wake of a solid economy,\" Vance said.",
    "Conservatives should stop slavishly serving big corporations, he suggested, and focus on making it easier for Americans to get a decent job, have kids, and live rewarding lives.",
    "Vance gave a speech describing his hopes that the GOP would turn away from economic libertarianism and small-government orthodoxy to become a \"pro-worker, pro-family\" party.",
    "Of the 18 proposals listed, only one — making healthcare expenses tax deductible for middle-class families — was directly aimed at making life easier for U.S. workers.",
    "On Tuesday morning he tweeted a video, apparently of an immigrant in mental distress, claiming that \"border patrol needs to hire an exorcist.\"",
    "Once you get past the high-minded, worker-friendly rhetoric, the new conservatism is often just the same old right-wingism.",
    "Three years later, though, Vance is a Republican candidate for one of Ohio's U.S. Senate seats — those details matter now.",
    "The pollster's recommendation: Vance should come out strong with a lot of anti-immigrant, anti-foreigner proposals.",
    "But there's nothing remotely fresh or different about blaming immigrants and cities for America's problems.",
    "Ban Chinese nationals from getting visas that let them work in American universities.",
    "Raise taxes on immigrants who send money back to families in their home countries.",
    "Vance's polling is any indication, that's exactly what Republican voters want.",
    "(I wrote favorably about reviving \"blue laws\" just a few weeks ago.)",
    "The emerging \"common good conservatism\" has some appealing aspects.",
    "But Vance deliberately left the policy particulars out of his talk.",
    "Make those city officials liable for harms created by migrants.",
    "\"We still need to figure out a lot of the details,\" he said.",
    "So how's his high-minded rhetoric working out in practice?",
    "It didn't poll particularly well with Ohio GOP voters.",
    "Some progressives might approve of that diagnosis.",
    "Back in 2019, Hillbilly Elegy author J.D.",
    "Cut federal aid for \"sanctuary cities.\"",
    "Vance appears to be listening.",
    "Complete Trump's border wall.",
    "Not so great.",
    "If J.D."
  ]
}