{
  "id": 26242,
  "mediaId": 2745,
  "date": "2022-04-08",
  "headline": "Opinion: GOP ‘built on fraud, fear and fascism’? If the jackboot fits ...",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TG5RTSVUFEI6ZA2YECVBMNK7WQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/08/jamie-harrison-gop-republicans-fraud-fear-fascism/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13592,
    13711,
    13830,
    13989,
    14044,
    14162,
    13312,
    14260
  ],
  "sentences": [
    "The “big lie” about a rigged election, accepted by two-thirds of Republican voters, has spawned new frauds about the dangers of coronavirus vaccines (leading to sharply higher death rates in heavily Republican counties) and the promise, touted by Sen. Ron Johnson (R-Wis.), of the deworming drug ivermectin to treat covid-19; an exhaustive new study finds the drug useless.",
    "This Judge Jackson might have gone there to defend them.”\nRepublican senators used the Jackson confirmation to stir fear of minorities and vulnerable groups with manufactured crises about transgender athletes (of the 200,000 participants in women’s collegiate sports, perhaps 50 are transgender) and “critical race theory” (which isn’t taught in public schools).",
    "The newly revealed text messages of Justice Clarence Thomas’s activist wife, Ginni, show her sharing with the Trump White House her “hope” that the “Biden crime family” as well as elected officials, bureaucrats and journalists would be taken to “barges off GITMO to face military tribunals for sedition.”\nIs the GOP “a party built on fraud, fear and fascism”?",
    "Vance released an ad saying “Biden’s open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country.”\nRep. Paul A. Gosar (R-Ariz.), in his latest dalliance with white nationalists, was listed as a “featured guest” at an event on April 20 (Adolf Hitler’s birthday) of a white-nationalist-tied group.",
    "Just days after Rep. Madison Cawthorn (R-N.C.) told the world that his colleagues engage in coke-fueled orgies, Rep. Lisa McClain (R-Mich.) declared at a Trump rally that it was Trump who “caught Osama bin Laden,” record-low unemployment is at a “40-year high” and there weren’t “any wars” during Trump’s presidency.",
    "A Republican National Committee resolution, never rescinded, refers to the Capitol insurrection not as an authoritarian attempt to overthrow democracy and keep the defeated Trump in power but as “legitimate political discourse.” And Trump expresses regret he didn’t march to the Capitol with the insurrectionists.",
    "Republican-run states are racing to follow Florida’s “don’t say gay” legislation that bans teaching about sexual orientation or gender identity, which follows similar efforts to ban certain teaching about race and history, and widespread efforts to ban books about race, sexuality, gender and police brutality.",
    "Harrison went on to censure the Republican Party as a whole: “It is a party built on fraud, fear and fascism.” Interestingly, a statement from the Republican National Committee taking offense at the “maggot-infested” charge did not dispute the “fraud, fear and fascism” formulation.",
    "said people like Ketanji Brown Jackson become public defenders because “their heart is with the murderers.” Cotton said Justice Robert H. Jackson “left the Supreme Court to go to Nuremberg and prosecute the case against the Nazis.",
    "At a Trump-hosted screening at Mar-a-Lago this week of “Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump,” a poster showed Mark Zuckerberg “devilishly grabbing cash,” The Post’s Josh Dawsey reported.",
    "After Cotton implied that Supreme Court Justice-designate Ketanji Brown Jackson is a Nazi sympathizer, Harrison referred to Cotton as a “little maggot-infested man” on MSNBC’s “Morning Joe.”\nFake news!",
    "The film repeatedly describes the Jewish billionaire’s money as “Zuckerbucks” — even though the Anti-Defamation League objected to the term as an antisemitic trope about wealthy Jewish control.",
    "But too many others are subverting democracy, cavorting with white nationalists, spreading racist fears and fantasizing about extrajudicial punishment for political opponents and the media.",
    "Sixty-three House Republicans — 30 percent of the caucus — voted against a resolution this week affirming unequivocal support for NATO as authoritarian Russia attacks democratic Ukraine.",
    "Ron DeSantis (R), with the potential to intimidate voters, while various GOP-led states move forward with new provisions providing residents with incentives to inform on each other.",
    "And former Trump State Department official Matt Mowers, a current congressional candidate, voted twice during the 2016 primaries, in New Hampshire and New Jersey.",
    "Sixteen months after President Donald Trump’s claims of election fraud failed in some 60 court cases, we have finally found evidence of potential voter fraud.",
    "Trump’s White House chief of staff, Mark Meadows, reportedly registered to vote in 2020 using the address of a mobile home he never lived in.",
    "His office denies he’ll participate, but Gosar shared details of the event on Instagram, the Arizona Mirror reports.",
    "Also, maggots typically feed on dead things, and Cotton, though stiff, is not currently deceased.",
    "As your self-appointed fact checker, I have therefore examined the merits of the accusation.",
    "A rabid fox at the Capitol bit at least nine people, including Rep. Ami Bera (D-Calif.).",
    "And Democratic National Committee Chair Jaime Harrison attacked Sen. Tom Cotton (R-Ark.)",
    "The Florida legislature approved an “election crimes” police force for Gov.",
    "There were even more vermin than usual in Washington this week.",
    "Cotton might go low, but, at 6-foot-5, he is not little.",
    "The man likes to carry on, but he is not carrion.",
    "Certainly, not all Republicans think this way.",
    "Then there are the little everyday frauds.",
    "Ohio Republican Senate candidate J.D.",
    "with an insult most entomological.",
    "Never mind Syria and Afghanistan.",
    "For them, the jackboot fits.",
    "Sen. Ted Cruz (R-Tex.)"
  ]
}