{
  "id": 26250,
  "mediaId": 2685,
  "date": "2022-03-18",
  "headline": "Minnesota Republicans enlist new speaker for annual dinner after Ohio Senate candidate J.D. Vance bows out",
  "image": "https://chorus.stimg.co/23328438/merlin_66922132.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/state-gop-enlists-new-speaker-for-annual-dinner-after-ohio-senate-candidate-bows-out/600157404/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Van Berkel",
  "authorUrl": "https://www.startribune.com/jessie-van-berkel/6370530/",
  "termIds": [
    13702,
    14116,
    13285,
    13312,
    13314,
    13372,
    14305,
    14317,
    14355
  ],
  "sentences": [
    "The Minnesota GOP posted on social media Wednesday that Matt Schlapp, chair of the American Conservative Union — the organization behind the Conservative Political Action Conference — will be the keynote speaker at the party's April 1 fundraiser.",
    "Vance's cancellation comes after he received criticism both inside and outside the party over a recent comment he made that seemed dismissive of Ukraine in its war with Russia.",
    "Days later he issued a statement saying Russia's assault on Ukraine \"is unquestionably a tragedy,\" but some Minnesota Republicans expressed concern with his previous remarks.",
    "Vance will no longer speak at the Minnesota Republican Party's annual Lincoln Reagan Dinner, with a state party official citing a scheduling conflict.",
    "\"We are excited to have CPAC Chairman and author of 'The Desecrators' Matt Schlapp as our speaker and looking forward to a successful event!\"",
    "Vance said last month on an episode of Steve Bannon's \"War Room\": \"I don't really care what happens to Ukraine one way or another.\"",
    "Vance, a venture capitalist and author of the bestselling memoir \"Hillbilly Elegy,\" is running for the Ohio seat opened by GOP Sen.",
    "His stop in Minnesota was planned while traveling around Ohio holding town hall events for his \"No B.S.",
    "Minnesota Republican Party Executive Director Mike Lonergan said in a statement.",
    "He added: \"We look forward to hosting J.D.",
    "U.S. Senate candidate and author J.D.",
    "Vance when the schedule permits.\"",
    "Rob Portman's retirement.",
    "Tour.\""
  ]
}