{
  "id": 26271,
  "mediaId": 2716,
  "date": "2022-02-13",
  "headline": "It's time for libertarians and their skeptics on the right to team up against the hawks",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1644603107/gop peace.jpg",
  "link": "https://theweek.com/foreign-policy/1010010/its-time-for-libertarians-and-their-skeptics-on-the-right-to-team-up-against",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "W. James Antle III",
  "authorUrl": "https://theweek.com/authors/w-james-antle-iii",
  "termIds": [
    13543,
    13592,
    13658,
    13702,
    13808,
    13902,
    13994,
    13312
  ],
  "sentences": [
    "I've written previously about how two ascendant factions within the major political parties — the progressive Democrats and populist Republicans — are mostly anti-war, but may have difficulty cooperating on foreign policy because they disagree about former President Donald Trump and other issues.",
    "Three leading lights of national conservatism — Sohrab Ahmari, Patrick Deneen, and Gladden Pappin — came together to write a New York Times op-ed (recently discussed by my colleague Damon Linker) arguing that hawks are a major impediment to a better Republican Party.",
    "On issues like the COVID rules, libertarians and the libertarian-skeptical right have often been aligned despite underlying philosophical differences.",
    "But many of the newfangled conservatives of the Trump era consciously reject classical and procedural liberalism, much less libertarianism.",
    "Another part of this dilemma is that populists have gotten further in Republican politics, at least for now, than libertarians ever have.",
    "But libertarians have been much more consistent on foreign policy, making hawks eager to co-opt the newest incarnation of the right.",
    "Fox host Tucker Carlson is a far more important figure to national conservatism than former National Security Adviser John Bolton.",
    "Vance and Justin Amash may agree about the Iraq war, but they have radically different views about libertarianism.",
    "This was also a major theme of the libertarian moment that preceded the right's current nationalist-populist one.",
    "In the intellectual realm, Deneen and Ahmari have a record of working with libertarians — even the Koch brothers!",
    "Rep. Matt Gaetz (R-Fla.), a more natural Trump acolyte, attaches the libertarian modifier to his populism.",
    "Sensing the natcons' desire to cast them out of the big tent, libertarians are quick to return the favor.",
    "If both sides can fight the urge to purge, perhaps a similar outcome could be achieved on war and peace.",
    "The same can be said of the two most anti-war groups in the GOP: the populists and the libertarians.",
    "Sen. Rand Paul (Ky.) the top libertarian Republican, embraced Trump as a foreign policy ally.",
    "The non-Never Trump neocon migration to national conservatism was entirely predictable.",
    "Still, there are significant exceptions that may prove collaboration is possible.",
    "And only one of them remains a member of the Republican Party.",
    "— at a magazine with which I have some familiarity.",
    "J.D."
  ]
}