{
  "id": 26274,
  "mediaId": 2641,
  "date": "2022-03-19",
  "headline": "JD Vance to Newsmax: Biden 'Crime Family' Has 'Blundered Us' Into Crises",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=c7fa1830-69b2-4ce2-9d20-d70fae9ca060&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/jd-vance-hunter-biden-laptop-big-tech/2022/03/19/id/1061994/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    13494,
    13592,
    13696,
    13702,
    13764,
    13274,
    13372,
    14317
  ],
  "sentences": [
    "\"It doesn't justify Russia invading the country in the first place, but you know, frankly, if The New York Times and other media outlets had told the honest truth about Biden's corruption, we may not be in this crisis to begin with, because Donald Trump would still be president if Big Tech hadn't effectively been trying to steal the election from the guy,\" Vance said.",
    "The corruption extends beyond even the president, his son Hunter Biden, and the Big Tech censorship to suppress it in a 2020 presidential election meddling campaign, Vance added to co-host Carl Higbie, noting the media was complicit and biased, too.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nRelated Stories:\n© 2022 Newsmax.",
    "It is beyond ironical to have the corruption of the Biden \"crime family\" with Ukraine and Russia and now to be living on the edge of world war due to those same countries, Ohio Senate Republican primary candidate J.D.",
    "\"We cannot fall behind China and Russia technologically because you've got people like [White House Joint Chiefs of Staff] Mark Milley focusing on white rage instead of building the highest tech military in the world.",
    "\"Can you imagine if Don [Trump] Jr. had taken a half a million dollars from a foreign government and then his dad had gotten us into a major foreign policy crisis involving that very same government?\"",
    "\"Why is it that the very government that got involved with the Biden administration is now involved in a major world, a historic, crisis that [President Joe] Biden has blundered us into?\"",
    "Ohio is a bellwether state for the 2024 presidential election and remains a key battleground for the 2022 midterms as control of the House and Senate is up for grabs this November.",
    "Former President \"Donald Trump would still be president\" if Big Tech did not censor the Biden corruption during the 2020 presidential election campaign, according to Vance.",
    "\"This should be a massive wake-up call to those of us in the Senate, those of us running for the Senate, those of us who want to serve this country.",
    "\"It's effectively a crime family that we've allowed to plunder the country, to turn our country into a total disaster area,\" Vance said.",
    "And, finally, Biden has left the U.S. military unprepared for the World War III it is perpetuating, Vance concluded.",
    "Vance is running in a hotly contested Ohio Senate GOP primary where Trump has yet to officially endorse a candidate.",
    "\"The other thing that's crazy about this is the media and social media, Big Tech engaged in this massive cover-up.",
    "We'd be hearing calls for congressional investigation, which is exactly what we should be doing right now.\"",
    "If you were talking about this 12, 18 months ago, you were engaged in Russian disinformation, right.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"Our leaders have allowed our military to fall behind technologically,\" Vance said.",
    "\"That's unfortunately [why] we're living with the consequences today.",
    "Biden has a number of crises he and his administration has caused.",
    "Also, Vance noted, it is not just the Russia-Ukraine war either.",
    "The tech companies would censor you for even discussing it.\"",
    "\"I suspect we'd be hearing howls of protest from the media.",
    "Vance told Saturday's \"Wake Up America.\"",
    "It's time to wake up to that fact.\"",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "Vance lamented on Newsmax.",
    "We are falling behind.",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "Vance continued.",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}