{
  "id": 26288,
  "mediaId": 2522,
  "date": "2022-02-26",
  "headline": "Mandel sets CPAC ablaze with speech, blasts ‘traitors’ Cheney and Kinzinger: ‘Abolish the Jan 6th Commission’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-Josh-Mandel.jpg",
  "link": "https://www.bizpacreview.com/2022/02/26/mandel-sets-cpac-ablaze-with-speech-blasts-traitors-cheney-and-kinzinger-abolish-the-jan-6th-commission-1206135/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    13388,
    13592,
    13607,
    13803,
    13940,
    13963,
    13159,
    13192
  ],
  "sentences": [
    "Mandel declared that he is “pro-God, pro-Gun, pro-Trump,” and will “make decisions with the Bible in one hand and the Constitution in the other.”\n— Josh Mandel (@JoshMandelOhio) February 24, 2022\nThe young conservative and Marine Corps veteran is running in a crowded field in Ohio for the GOP nomination vying for the seat of retiring Sen.",
    "There is no evidence of any widespread election cheating by ‘the left.’ And there is zero indication that Trump’s official margin of victory in Ohio — which was run in 2020 by a Republican governor, Mike DeWine, and a Republican elections chief, Secretary of State Frank LaRose — is incorrect in any significant way,” the outlet charged.",
    "— Josh Mandel (@JoshMandelOhio) February 25, 2022\nTypical of that rhetoric, KEYT in Santa Barbara, California attempted a smear against the up-and-coming Republican: “Josh Mandel, a Senate candidate in Ohio, used his speech to repeat his usual inaccurate campaign rhetoric about the 2020 election.”\n“This is all nonsense.",
    "SIGN UP HERE\nSenate candidate Josh Mandel (R-OH) set CPAC on fire Saturday declaring that the 2020 presidential election was stolen from former President Donald Trump and he bluntly branded Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL) as “traitors” while calling for the abolition of the Jan. 6th committee.",
    "@cpac @mschlapp @mercedesschlapp @ddale8 pic.twitter.com/aqn7ij2s6v\n— Josh Mandel (@JoshMandelOhio) February 25, 2022\n“One of the problems we have in America is that we have Democrats and leftists who think it’s OK to cheat in elections,” he remarked according to The Independent.",
    "The Independent is reporting that the unapologetic Republican reportedly wants photo ID for voting, the elimination of all electronic voting machines and of mail-in voting, and for voting to be restricted to just one day.",
    "Mandel argued that one of the most critical fights we face today as conservatives is “to stop the cheating from the left.”\nAbolish the January 6th commission and replace it with a November 3rd commission!",
    "We should abolish the January 6th commission and replace it with the November 3rd commission,” Mandel urged alluding to an investigation of alleged voter fraud in the 2020 election.",
    "But I want to say it very clearly and very directly: I believe this election was stolen from Donald J. Trump,” the former Ohio treasurer and state representative asserted.",
    "And I want to say it to all you very clearly, and every time I say it, the liberal media gets up in arms, and the squishy RINO Republicans get up in arms.",
    "Cheney and Kinzinger are the only two Republicans on the current Jan. 6 House committee and were hand-picked by Democrat House Speaker Nancy Pelosi.",
    "He then called for an audit of the 2020 election in every state, including Ohio where Trump beat Biden by more than 8 percentage points.",
    "He is currently leading in the race for the nomination, according to a recent GOP poll that shows him beating Republican J.D.",
    "“I want to say something to everyone here, and I’m the only candidate in Ohio who’s willing to say this.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "“I guarantee you: Trump actually won by a higher margin than was even reported,” he claimed.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Mandel’s proclamations were met with loud cheers and applause that rocked the forum.",
    "Liberal media outlets are already pouncing on Mandel for his fiery CPAC speech.",
    "No higher compliment than getting bashed by a fake news reporter from @CNN.",
    "“You know, the Liz Cheneys, the Adam Kinzingers, these are traitors.",
    "As equally telling were the raucous boos for Cheney and Kinzinger.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "The 2020 election wasn’t stolen from Trump.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Rob Portman (R-OH).",
    "These are traitors.",
    "Vance."
  ]
}