{
  "id": 26327,
  "mediaId": 2621,
  "date": "2022-04-16",
  "headline": "Former Trump Spox Says Best Way to Beat Trump is Attack His ‘Dumb Endorsements’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/03/GettyImages-1229388313-scaled-e1650116506740.jpg",
  "link": "https://www.mediaite.com/news/former-trump-spox-says-best-way-to-beat-trump-is-attack-his-dumb-endorsements/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tommy Christopher",
  "authorUrl": "https://www.mediaite.com/author/tommy-christopher/",
  "termIds": [
    13411,
    13592,
    13702,
    13801,
    13935,
    13954,
    14085,
    13155,
    13312
  ],
  "sentences": [
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.”\nA new report from The Washington Post‘s Josh Dawsey and Michael Scherer suggests that Trump’s riskier endorsements could become a deep liability to the former president’s political fortunes\nDawsey and Scherer interviewed many Republican and Trumpworld figures for the piece, including spox-turned-critic Griffin, who sees the erratic endorsement strategy as an Achilles heel for Trump:\n“The biggest way to defeat him is to electorally chip away at the notion he is the most powerful endorsement in the country.",
    "In at least one high-profile case, Trump has shown caution, dropping Alabama Senate candidate Mo Brooks as an endorsee when Brooks faded in the polls, after watching his first Pennsylvania endorsement, Sean Parnell, withdraw from the race.",
    "He still is, but smart operatives need to play against him in races where he’s made dumb endorsements,” said Alyssa Farah Griffin, a former White House communications director under Trump, who has become a critic.",
    "Former Trump White House spokesperson Alyssa Farah Griffin says the best way to beat former President Donald Trump is to focus on the “dumb endorsements” he has been making.",
    "He is likely to endorse candidates in several more competitive primaries, even as some people around him say he is willing to take risks they would not.",
    "That sentiment, that Trump’s endorsement strategy risks weakening his standing as a presidential candidate, was echoed throughout the piece.",
    "But he also fails to garner more than 50 percent in most, showing a potential opening if non-Trump voters were to coalesce around one rival.",
    "Trump has made hundreds of endorsements since leaving office, including recent boosts of controversial candidates like Dr. Oz and J.D.",
    "Trump continues to dominate early Republican primary polls, more than doubling his closest competitor in many of them.",
    "Advisers say he wants to hold rallies in almost every key state where he has made an endorsement.",
    "As 2016 demonstrated, that’s a big “if.”\nHave a tip we should know?",
    "In endorsing Vance, Trump acknowledged ” J.D.",
    "But in other races, he continues to lean in.",
    "tips@mediaite.com",
    "Vance."
  ]
}