{
  "id": 26321,
  "mediaId": 2680,
  "date": "2022-04-08",
  "headline": "Ohio GOP Senate hopeful: Middle class doesn't pay fair share",
  "image": "https://s.hdnux.com/photos/01/25/10/23/22316240/3/rawImage.jpg",
  "link": "https://www.sfgate.com/news/article/Ohio-GOP-Senate-hopeful-Middle-class-doesn-t-pay-17068118.php",
  "mediaOutlet": "sfchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "",
  "termIds": [
    13942,
    14037,
    13283,
    13312,
    13372,
    14243,
    14246,
    14317,
    14357
  ],
  "sentences": [
    "Vance said the GOP needs to stand for “middle-class people being able to raise a family and do it on a single income.”\nIn the video, Gibbons is pictured before a campaign backdrop and criticizes Democrats for advancing an “absolutely false” narrative that “the middle class is getting screwed and the wealthy, the elite, are cheating everybody” because they \"need the middle class to win an election.” He says he doesn't have a problem with a \"progressive tax system structure\" but notes that the wealthy already pay a lot in taxes.",
    "One opponent, Republican Mark Pukita, has had it posted on his YouTube page for the last three weeks with the caption \"Tax Hike Mike Gibbons.”\nAsked about the Scott plan during a Republican Senate debate last week, former Ohio Republican chair Jane Timken said she opposes his proposal to raise taxes on the middle class, while “Hillbilly Elegy” author J.D.",
    "But they could take on new resonance after Republican Sen. Rick Scott of Florida, a potential 2024 presidential candidate, introduced a governing plan in February that has divided the party over its call to raise taxes on millions of Americans who don’t earn enough to pay federal income taxes.",
    "“The top 20% of earners in the United States pay 82% of federal income tax — and, if you do the math, and 45% to 50% don’t pay any income tax, you can see the middle class is not really paying any kind of a fair share, depending on how you want to define it,” Gibbons said.",
    "“Mike is a businessman, not a career politician and he understands economics and how to implement smart ideas and strategies that will benefit all Americans.”\nYet, ahead of the May 3 primary, Republican rivals are looking to use the comments against Gibbons.",
    "The Center on Budget and Policy Priorities, a left-leaning think tank, argues that such figures do not reflect considerable amounts of wealth among high-income Americans that are shielded from taxation or are taxed at lower rates than wage earners.",
    "Other leading Republicans, including Senate Minority Leader Mitch McConnell, have distanced themselves from Scott's proposal, worried that the prospect of raising taxes on lower-income Americans could prompt election-year attacks from Democrats.",
    "According an analysis of 2019 Internal Revenue Service data, the most recent available, by the fiscally conservative Tax Foundation, the top 10% of Americans earn 47.3% of reported income and pay 70.9% of the income taxes.",
    "Scott, who leads the Senate Republicans’ campaign arm, has said that paying even a small tax would give poor people “skin in the game” to boost their interest and involvement in how tax dollars are spent.",
    "COLUMBUS, Ohio (AP) — Mike Gibbons, a leading Republican Senate candidate from Ohio, said at a media event last fall that middle-class Americans don't pay “any kind of a fair share” of income taxes.",
    "The comments by Gibbons, a millionaire investment banker from Cleveland, were made in a September episode of “The Landscape” podcast by Crain's Cleveland Business.",
    "In announcing the tax proposal, the Democrat asserted that “a firefighter and a teacher pay more than double” the tax rate that a billionaire pays.",
    "Democrats have spent the better part of a decade pushing for higher taxes on top earners and will likely do so again this year.",
    "Campaign spokesperson Samantha Cotten said Friday that Gibbons has pledged not to raise taxes on individuals or businesses.",
    "Gibbons asks: “How much of the total tax bill can a very small percentage of the nation pay and still be a democracy?\"",
    "That leaves the middle 40% of Americans earning 41.2% of the income and paying 26.1% of the income taxes.",
    "“Mike Gibbons does not support tax increases on any American — and never has,” she said in a statement.",
    "The bottom 50% of American wage earners report 11.5% of the income and pay 3.1% of the taxes.",
    "President Joe Biden included a “Billionaire Minimum Income Tax” in his 2023 budget proposal."
  ]
}