{
  "id": 26339,
  "mediaId": 2748,
  "date": "2022-03-16",
  "headline": "J.D. Vance Snubs Chamber of Commerce as Other Senate GOP Candidates Vie for Support",
  "image": "https://www.cracknewz.com/favicon.ico",
  "link": "https://www.cracknewz.com/2022/03/jd-vance-snubs-chamber-of-commerce-as.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    13702,
    13724,
    13803,
    13901,
    14153,
    13197,
    13312,
    13363,
    13372
  ],
  "sentences": [
    "Currently, the Chamber is lobbying lawmakers in Washington, D.C. and President Joe Biden’s administration to artificially inflate the U.S. labor market by doubling legal immigration levels — providing big business with a never-ending flow of cheaper, foreign workers to hire rather than pulling millions of jobless Americans off the sidelines.",
    "Such flooded labor markets from mass legal immigration to the U.S. have had a devastating impact on the nation’s working and middle class, while redistributing billions in wealth to the highest earners, big businesses, real estate investors, and Wall Street, as well as driving capital out of small communities to the coasts.",
    "The Chamber, as Breitbart News has chronicled for years, backs huge increases to legal immigration levels, amnesty for illegal aliens, U.S. free trade with China, and outsourcing American manufacturing to foreign countries.",
    "Vance is campaigning on reducing legal immigration levels to boost U.S. wages and job opportunities for Americans, cracking down on illegal immigration at the U.S.-Mexico border, and opposing amnesty for illegal aliens.",
    "Vance, the New York Times best-selling author running for Senate in Ohio, is openly snubbing the United States Chamber of Commerce as his GOP primary opponents compete for the group’s support.",
    "The Ohio Chamber of Commerce, an affiliate of the U.S. Chamber of Commerce, invited all of the state’s Senate candidates to join them for interviews about business-related issues.",
    "Vance remains a fierce proponent of tariffs on foreign imports to punish U.S. companies that outsource American working and middle class jobs to China, India, and other nations.",
    "Timken has accepted about $1,000 in campaign donations from local Chamber of Commerce groups, while the Ohio Chamber has previously backed Dolan in his state Senate races.",
    "The Chamber, like other corporate special interest groups, has long opposed tariffs on foreign imports and has lobbied against decoupling the American economy from China.",
    "From 2001 t0 2018, for instance, the U.S.-China trade deficit — which the Chamber has called a “sign of economic good health” — has eliminated 3.7 million American jobs.",
    "Most recently, the Chamber is celebrating the U.S.-South Korea free trade agreement known as KORUS that has eliminated at least 95,000 American jobs from 2012 to 2016.",
    "Republican candidates Josh Mandel, Jane Timken, Mike Gibbons, and Matt Dolan took the Chamber up on the offer as well as likely Democrat nominee Rep. Tim Ryan (D-OH).",
    "Vance, on the other hand, snubbed the Ohio Chamber and did not sit down with executives for a candidate interview.",
    "Instead, the Chamber has lobbied Biden to return the U.S. to the job-killing free trade consensus.",
    "The Ohio Republican Senate primary is set for May 3.",
    "Republican J.D."
  ]
}