{
  "id": 26346,
  "mediaId": 2701,
  "date": "2022-03-25",
  "headline": "If Congress Doesn’t Rein In Big Tech, Censors Will Eliminate The Right From Public Discourse",
  "image": "https://thefederalist.com/wp-content/uploads/2022/03/Levine.jpg",
  "link": "https://thefederalist.com/2022/03/25/if-congress-doesnt-rein-in-big-tech-censors-will-eliminate-the-right-from-public-discourse/?utm_source=rss&utm_medium=rss&utm_campaign=if-congress-doesnt-rein-in-big-tech-censors-will-eliminate-the-right-from-public-discourse",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Daniel Davidson",
  "authorUrl": "https://thefederalist.com/author/jddavidson/",
  "termIds": [
    13508,
    13721,
    13830,
    13895,
    13209,
    13355,
    13364,
    13379,
    14265
  ],
  "sentences": [
    "There seemed to be no rhyme or reason to the handful of articles that were blocked, but it started with an article by Libby Emmons published Wednesday morning entitled, “Everybody Knows Rachel Levine Is Truly A Man, Including Rachel Levine.”\nWhen my colleague Tristan Justice asked Twitter about it, a spokesperson told him, “the URLs referenced were mistakenly marked under our unsafe links policy — this action has been reversed.” Nothing to see here, it was all just a big mistake!",
    "In such an environment, the only way to ensure the censors don’t come after you is to follow the extraordinary example of U.S. Supreme Court nominee Judge Ketanji Brown Jackson, who was asked by Sen. Marsha Blackburn, R-Tenn., on Tuesday during the confirmation hearing to define the word “woman.” Jackson replied, infamously, “I’m not a biologist.”\nJohn Daniel Davidson is a senior editor at The Federalist.",
    "After Twitter locked out the Bee, which is a satirical publication, its Editor in Chief Kyle Mann tweeted, “Maybe they’ll let us back into our @TheBabylonBee Twitter account if we throw a few thousand Uighurs in a concentration camp,” which prompted Twitter to lock Mann’s account for “hatful conduct.” Later, the Bee’s founder Adam Ford was locked out of Twitter for retweeting Mann.",
    "This kind of behavior from social media companies has become all too common for anyone to believe that getting locked out of your account or getting an article taken down is ever a mistake, and certainly not when the tweet or article in question is asserting the plain truth that a man does not become a woman simply by growing his hair out and putting on a skirt.",
    "On Wednesday evening, around the time Twitter began censoring Federalist articles by appending a warning they “may be unsafe” and their contents could be “violent or misleading,” I got a notice from Twitter support letting me know that someone had complained about a tweet of mine noting that Rachel Levine, the U.S. assistant secretary for health, is a man.",
    "Twitter locked Kirk’s account after it locked the account of The Babylon Bee earlier this week for posting an article headlined, “The Babylon Bee’s Man of the Year is Rachel Levine,” riffing on an actual USA Today piece naming Levine as one of its 2022 women of the year, despite the fact that Levine is a man.",
    "Banning Kirk made no sense, I wrote, because Levine “is obviously a man — a man who dresses like a woman, but a man nonetheless.”\nTo be clear, Levine is a 64-year-old man who spent the first 54 years of his life “presenting” or living publicly as a man.",
    "Something both convoluted and disturbing happened on Twitter this week that illustrates why it’s not enough for lawmakers in Washington to haul Big Tech executives before congressional committees every now and then and give them a good talking to.",
    "Before long, you won’t be able to say, for example, that abortion is the taking of a human life, that gay marriage is not the same as marriage between a man and a woman, or that children should not be taught that America is systemically racist.",
    "Vance and a panel discussion with Federalist CEO Sean Davis, Rachel Bovard, and Sen. James Lankford, R-Okla. — a panel discussion that happened to be about the harms of Big Tech and how federal law protects them from liability.",
    "Regulating social media giants like Twitter and Facebook as common carriers, prohibiting them from censoring under the absurd pretext that speech they don’t like is “harmful” or “abusive,” would be a good place to start.",
    "As a result, my tweet would be banned, but only in Germany, where, according to Twitter’s explanation of what it calls, “country withheld content,” an “authorized entity” issued a “valid legal demand” to block my tweet.",
    "If that doesn’t happen, Twitter will eventually ban every conservative voice and every media outlet that dares to challenge left-wing pieties about race, gender, and a host of other issues.",
    "If you say that Rachel Levine is a man, or that Lia Thomas, the University of Pennsylvania swimmer who just won an NCAA Division I national championship, is a man, they will come after you.",
    "So until Congress — under what would have to be a Republican majority, given Democrats’ enthusiasm for online censorship — acts to put an end to this, it will continue.",
    "In 2011, he decided to “transition” and began dressing and presenting as a woman, changing his name to Rachel Levine (previously, he went by Richard, his given name).",
    "It was no more a mistake than my tweet getting flagged in Germany, of all places, or Kirk and Mann and Ford and the Bee all getting locked out of their accounts.",
    "His story is a sad one, and far from mocking or berating him, conservatives should pray for him and hope that he gets the help he obviously needs.",
    "I had written the tweet in response to news this week that Twitter locked the account of Charlie Kirk for saying Levine is a man.",
    "This week, YouTube removed a bunch of videos from the recent Conservative Political Action Conference, including a speech by J.D.",
    "His writing has appeared in the Wall Street Journal, the Claremont Review of Books, The New York Post, and elsewhere.",
    "It’s obvious that these firms will eventually silence everyone who dissents from their woke ideology.",
    "While all this was going on, articles at The Federalist suddenly started getting blocked by Twitter.",
    "When you’re account is locked over that, it’s on purpose, and the point is to shut you up.",
    "This week Twitter revealed it will not tolerate dissent from trans ideology.",
    "It doesn’t matter that Levine and Thomas are in fact men.",
    "Truth is no defense against censorship by Big Tech.",
    "Congress actually has to do something about this.",
    "And the list of things you can’t say will grow.",
    "They’re not even trying to hide it anymore.",
    "He divorced his wife of 25 years in 2013.",
    "He was married and fathered two children.",
    "But none of this is really about Levine.",
    "Follow him on Twitter, @johnddavidson.",
    "But that will be just the beginning.",
    "Levine is and will always be a man.",
    "But we all know it wasn’t.",
    "And it’s not just Twitter.",
    "Here’s what happened.",
    "It’s about Twitter."
  ]
}