{
  "id": 26355,
  "mediaId": 2548,
  "date": "2022-04-15",
  "headline": "Trump Endorses JD Vance With Ohio Senate Primary Weeks Away",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/jd-vance-e1649968464604.jpg",
  "link": "https://dailycaller.com/2022/04/15/trump-endorses-jd-vance/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    13592,
    13702,
    13942,
    14153,
    14169,
    13285,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "(RELATED: Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary)\n“This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race — they’ve said great things about ‘Trump’ and, like me, they love Ohio and love our Country.",
    "BREAKING: Donald Trump officially endorsed @JDVance1 for Senate in Ohio pic.twitter.com/eHPiaP8F5n\n— Daily Caller (@DailyCaller) April 15, 2022\nVance has struggled in some polls, which adviser Tony Fabrizio chalked up to voters’ impression that he is a more liberal candidate.",
    "The polling firm Remington Research, which is supporting Mandel, released a memo on April 14 claiming that Vance would still lose even with Trump’s endorsement, Politico reported.",
    "Vance, the author of the best-selling memoir Hillbilly Elegy, is currently in third place in the RealClearPolitics polling average, behind Mike Gibbons and Josh Mandel.",
    "During his campaign, Vance has promoted direct payments to parents, completing the southern border wall, and raising taxes on wealthier Americans and corporations.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,” Trump said in a statement.",
    "Vance has previously garnered endorsements from Missouri Sen. Josh Hawley, Georgia Rep. Marjorie Taylor Greene, and Indiana Rep. Jim Banks.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend.",
    "A group of Ohio Republican Party county chairs sent a letter to Trump highlighting Vance’s previous criticism of the president.",
    "Both Mandel and Gibbons have highlighted Vance’s previous opposition to Trump, as well as his work as a contributor at CNN.",
    "The Ohio primary has become a battleground for various GOP factions, with Kentucky Sen. Rand Paul endorsing Gibbons, Sens.",
    "Mike Lee of Utah and Cynthia Lummis of Wyoming endorsing Mandel, and New York Rep. Elise Stefanik and South Dakota Gov.",
    "The winner of the GOP primary will likely face Democratic Rep. Tim Ryan in the race to succeed retiring Republican Sen.",
    "Early reports of Trump’s endorsement set off attempts by the other candidates to discourage him from supporting Vance.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate,” Trump said.",
    "Former President Donald Trump announced his endorsement of author and venture capitalist J.D.",
    "Vance in the crowded Ohio Republican Senate primary on Friday.",
    "Kristi Noem endorsing former Ohio GOP chairwoman Jane Timken.",
    "I’ve studied this race closely and I think J.D.",
    "“Like some others, J.D.",
    "However, J.D.",
    "Rob Portman."
  ]
}