{
  "id": 26360,
  "mediaId": 2637,
  "date": "2022-02-26",
  "headline": "Trump condemns Russia invasion, again hints at 2024 presidential run",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.2.2/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/news-pmn/trump-condemns-russia-invasion-again-hints-at-2024-presidential-run",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Ulmer",
  "authorUrl": "",
  "termIds": [
    13592,
    13764,
    14193,
    14260,
    14286,
    14321,
    14332,
    14355
  ],
  "sentences": [
    "nL1N2UB34U]\nTRUMP BLAMES BIDEN, WORLD LEADERS\nTrump also cited Russia’s invasion of Georgia under George W. Bush and Crimea under Barack Obama before declaring: “I stand as the only president of the 21st century on whose watch Russia did not invade another country.”\nTrump did address his past praise of Putin, saying he was correct that Putin was smart because he was outfoxing world leaders and institutions.",
    "Article content\nDuring the CPAC conference in Orlando, Florida, which closes on Sunday, conservatives have repeated the line that Putin decided to invade Ukraine because he knew Biden was “weak.” Republican politicians have broadly steered clear of lauding Putin, however, and hot-button domestic issues, like mask mandates, have featured far more heavily than foreign policy.",
    "Earlier this week, Trump irked some Republican party members by describing Putin’s actions in Ukraine, where cities have been pounded by Russian artillery and cruise missiles, as “genius” and “pretty savvy.”\nTrump expressed empathy for Ukrainians and this time praised Ukrainian President Volodymyr Zelenskiy, calling him “brave” as he stays in Kyiv, the capital.",
    "“As everyone understands, this horrific disaster would never have happened if our election was not rigged and if I was the president,” he said, to which a woman in the packed audience responded: “You are the president!”\nTrump has not confirmed whether he will run for president again in 2024, but has hinted at it heavily recently and did so again on Saturday.",
    "Trump delivered his remarks at the CPAC conservative gathering in Florida a few hours after the United States and allies announced sweeping new sanctions that would kick some Russian banks off the main global payments systems and limit the ability of Russia’s central bank to support the rouble.",
    "Democratic lawyer Marc Elias tweeted that Trump’s words should trigger a “series of legal requirements related to his spend and disclosures.”\nArticle content\nTrump’s main fundraising committee, known as Save America, has a cash pile of more than $100 million.",
    "Article content\nORLANDO — Former President Donald Trump on Saturday condemned Russia’s invasion of Ukraine and said he was praying for Ukrainians, marking a shift of tone from earlier this week when he praised Russian President Vladimir Putin.",
    "Article content\nAddressing an adoring crowd at an event that touts itself as the world’s largest conservative gathering, Trump used his speech to bash Democratic President Joe Biden and again hint at a possible run for president in 2024.",
    "“I’m sick of being told that we have to care more about people 6,000 miles away than we do people like my mom, and my grandparents, and all the kids who are affected by this crisis,” said Vance, a venture capitalist and author.",
    "Vance, a Republican candidate for an Ohio U.S. Senate seat, said the American political class was fixated on the Ukraine conflict at the detriment of problems closer to home, such as record crossings at the Mexican border.",
    "In an interview released earlier on Saturday, Biden mocked Trump’s comment that Putin is a “genius.”\n“I put as much stock in Trump saying that Putin is a genius than when he called himself a stable genius,” Biden said.",
    "Article content\nTrump linked the invasion to the U.S. 2020 presidential election, a fixation of his, again falsely saying that fraud was to blame for Biden’s victory.",
    "(Reporting by Alexandra Ulmer; Additional reporting by Steve Holland and Susan Heavey in Washington, D.C.; Writing by David Morgan Editing by Leslie Adler)",
    "Trump said that Putin took advantage of Democratic President Joe Biden’s being “weak” to attack Ukraine.",
    "“On November 2024, they (Democrats) will find out like never before.",
    "We’re going to be doing it again, a third time,” Trump said.",
    "“The real problem is that our leaders are dumb, dumb.",
    "We are praying for the proud people of Ukraine.",
    "“The Russian attack on Ukraine is appalling.",
    "We did it twice, and we’ll do it again.",
    "God bless them all,” Trump said.",
    "Earlier on Saturday, J.D.",
    "So dumb,” he said."
  ]
}