{
  "id": 26395,
  "mediaId": 3987,
  "date": "2022-03-23",
  "headline": "Immigration Reform News March 23, 2022 / Qué Pasa En Inmigración",
  "image": "http://americasvoice.org/wp-content/uploads/2018/09/Immigration_News.jpg",
  "link": "https://americasvoice.org/blog/immigration-reform-news-march-23-2022/?utm_source=rss&utm_medium=rss&utm_campaign=immigration-reform-news-march-23-2022",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agencia EFE",
  "authorUrl": "",
  "termIds": [
    13496,
    13702,
    13830,
    13890,
    14017,
    14053,
    14172,
    13305
  ],
  "sentences": [
    "Vance, a revolt against the GOP unfolds\nBy Greg Sargent\nMarch 22, 2022\nHispanicLA Dilema demócrata ante el Título 42\nBy Maribel Hastings y David Torres\nMarch 22, 2022\nLa Conexión USA (NC) La jueza de Biden para el supremo defiende derechos de presos de Guantánamo\nBy Agencia EFE\nMarch 22, 2022\nEl Diario-La Prensa (NY) Duras posturas de republicanos ante jueza Jackson la ayudan a perfilar su forma de impartir justicia\nBy Jesús García\nMarch 22, 2022\nNoticias Telemundo La jueza Ketanji Brown Jackson responde a cuestionamientos durante el segundo día de audiencia en el Senado (Video)\nBy Javier vega\nMarch 22, 2022\nUnivision Pornografía infantil, aborto y Guantánamo: Ketanji Brown explica al Senado decisiones que ha tomado\nMarch 22, 2022\nUnivision La tensa espera de Margaryta Kret por el texto de su mamá “de que está viva todavía” en Ucrania\nMarch 22, 2022\nYahoo Noticias Juez de Ohio falla contra prioridades de Biden para arrestos y deportaciones\nBy Agencia EFE\nMarch 22, 2022\nUnivision Seguridad en la frontera y trabajos mejor pagados: los senadores Sinema y Kelly aseguran fondos para Arizona\nMarch 22, 2022\nTelemundo Arizona Procurador de Arizona gana demanda para frenar política de inmigración de Biden\nMarch 22, 2022\nEl Nuevo Herald (FL) El racismo no pudo hacerlo invisible.",
    "By Adrian Carrasquillo\nMarch 22, 2022\nWashington Post Federal court partially blocks Biden ‘priority’ system for immigration enforcement\nBy Nick Miroff and Maria Sacchetti\nMarch 22, 2022\nAxios Report: Abbott’s Texas border security effort fudges crime numbers\nBy Tasha Tsiaperas\nMarch 22, 2022\nPBS Newshour Northern U.S. border experiences alarming influx of refugee crossings\nBy Simeon Lancaster and Fred de Sam Lazaro\nMarch 22, 2022\nThe Hill Judge blocks DHS memo narrowing ICE deportation focus\nBy Rebecca Beitsch\nMarch 22, 2022\nRoll Call ICE claims ‘unabated’ legal access in detention during pandemic\nBy Suzanne Monyak\nMarch 22, 2022\nCBS News Judge rules against Biden administration rules for ICE deportation agents\nBy Camilo Montoya-Galvez\nMarch 22, 2022\nReuters U.S. lawyers line up to aid Ukrainians with immigration relief\nBy David Thomas\nMarch 22, 2022\nWashington Post How Europe Is Responding to Ukrainian Refugees\nBy Caroline Alexander and Andrea Dudik\nMarch 22, 2022\nNBC News Biden admin to expedite resettlement of some vulnerable Ukrainian refugees in U.S.\nBy Julia Ainsley\nMarch 22, 2022\nThe Hill Mexican president knocks US for focusing on Ukraine aid while Central American projects stall\nBy Rafael Bernal\nMarch 22, 2022\nWashington Post Behind Tucker Carlson and J.D.",
    "Ahora pelea para que haya más afrolatinos en televisión\nBy Sarah Moreno\nMarch 22, 2022\nEl Diario-La Prensa (NY) Qué sigue para el movimiento “un día sin inmigrantes” y la reforma migratoria\nBy Jesús García\nMarch 22, 2022\nHola News José Andrés: World Central Kitchen es más grande que Naciones Unidas\nBy Agencia EFE\nMarch 22, 2022\nLa Conexión USA (NC) Supremo de Colorado permite demanda a alguacil por detener a indocumentado\nBy Agencia EFE\nMarch 22, 2022\nEl Diario-La Prensa (NY) Juez bloquea reglas de ICE sobre detención de inmigrantes sólo por ser indocumentados\nBy Jesús García\nMarch 22, 2022\nTelemundo 47 NJ dará asesoramiento jurídico gratuito a menores inmigrantes en riesgo de deportación\nMarch 22, 2022\nHola News Llegada de miles de migrantes “no afecta” la vida diaria en Del Río, Texas\nMarch 22, 2022\nNoticias Telemundo Un juez federal limita la nueva regla de Biden sobre qué inmigrantes deben ser deportados: ¿a quiénes afecta?",
    "(Video)\nBy Belén Zapata\nMarch 22, 2022\nLa Opinión (CA) Dilema demócrata ante Título 42: con Dios o con el Diablo\nBy Maribel Hastings y David Torres\nMarch 22, 2022\nLa Opinión (CA) Ciertos cónyuges de extranjeros con visas de empresario y ejecutivos ya pueden solicitar permiso de trabajo\nBy Marlyn Montilla\nMarch 22, 2022\nLa Opinión (CA) Fiscales de 18 estados presionan a Corte Suprema para terminar programa Permanecer en México contra inmigrantes\nMarch 22, 2022\nLa Opinión (CA) Golpe a inmigrantes: juez bloquea reglas que impedían a ‘La Migra’ detención de extranjeros sólo por ser indocumentados\nMarch 22, 2022\nUnivision Juez suspende prioridades de deportación y ordena al gobierno ejecutar las expulsiones pendientes\nBy Jorge Cancino\nMarch 22, 2022\nRadio Bilingüe Dilema demócrata ante Título 42: con Dios o con el Diablo\nBy Maribel Hastings y David Torres\nMarch 22, 2022",
    "CNN Youth turnout could save, or sink, Democrats in 2022\nBy Ronald Brownstein\nMarch 22, 2022\nRoll Call Democrats emphasize border security as midterms loom\nBy Caroline Simon\nMarch 22, 2022\nNewsweek As Immigration Stalls, Will Arizona Activists Work to Re-elect Mark Kelly?",
    "By Pamela Subizar\nMarch 22, 2022\nDiario Las Américas “Parole in place” por vínculos con militares, un camino a la “green card”\nMarch 22, 2022\nCNN en Español Amor en la frontera: las parejas que casan en un puente que une a México con EE.UU."
  ]
}