{
  "id": 26416,
  "mediaId": 2707,
  "date": "2022-02-25",
  "headline": "We’re anti-war, but coddling Putin is wrong",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/02/Russia_Putin_93507.jpg?w=1024&h=657",
  "link": "https://www.ocregister.com/2022/02/25/were-anti-war-but-coddling-putin-is-wrong/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.ocregister.com/author/the-editorial-board/",
  "termIds": [
    13592,
    13702,
    14172,
    14192,
    14317,
    14332,
    14355,
    14357,
    14365
  ],
  "sentences": [
    "There’s no need to rehash Trump’s narcissistic fixation on false election-fraud claims, but it’s wrong to praise a despot for an unprovoked attack on another country, especially one that is democratic and allied with the West.",
    "Some foreign-policy analysts, for instance, blame the current quagmire on the North Atlantic Treaty Organization’s eastward expansion and the West’s treatment of Russia after the fall of the Soviet Union.",
    "Vance recently said, “I don’t really care what happens to Ukraine” – although he issued a responsible statement after perhaps realizing that Ohio has 80,000 residents of Ukrainian descent.",
    "Frankly, it’s hard to follow GOP thinking at this point, as the party’s leaders vacillate between giving comfort to Putin and blaming Democrats because of their supposed weakness.",
    "These conservatives claim to be nationalists, who should therefore understand why it’s wrong for an imperial power to crush the nationalistic aspirations of a sovereign nation.",
    "“The Russian invasion of Ukraine that the world is witnessing today is a blatant violation of international law and of basic human decency,” he said in a statement.",
    "As Vladimir Putin prepared his invasion of Ukraine, former President Donald Trump offered some of the most appalling remarks we’ve heard from an American leader.",
    "It’s one thing to be against U.S. military involvement – and no one really has called for such action in Ukraine so far – and another thing to excuse brutality.",
    "The United States should be an active participant in diplomatic affairs, although our government often meddles in ways that go far beyond diplomatic wrangling.",
    "This Editorial Board has a storied history of opposing U.S. intervention in military conflicts that do not involve the security of the United States.",
    "“I mean, he’s taking over a country for $2 worth of sanctions, I’d say that’s pretty smart.” He blamed the situation on a stolen U.S. election.",
    "Putin’s cronies have looted the country and need to pay a price, although we oppose broad sanctions that impose hardships on ordinary citizens.",
    "Conservatives have questioned U.S. Sen. Bernie Sanders’ patriotism over the years, but even the Vermont socialist understands the basics here.",
    "For now, Americans need to stand beside the Ukrainians’ desire to be a free and independent people, while avoiding military entanglements.",
    "Republican officials expressed disgust at the Russian assault, but their refusal to rebuke Trump’s words undermined their outrage.",
    "At the very least, they ought to knock off the partisan nonsense and try to offer a constructive way forward.",
    "Western nations will soon hash out a proper response, and we’ll be sure to opine on the specific proposals.",
    "The U.S. must tread carefully here given the perils of direct hostilities with nuclear-armed Russia.",
    "We remain as committed as ever to that philosophy and view military responses as a last resort.",
    "We generally agree with the Biden administration’s imposition of sanctions on Russia’s leaders.",
    "“It may be worth asking yourself… why do I hate Putin,” asked Fox News’ Tucker Carlson.",
    "No one should take seriously any politician or commentator who coddles Putin.",
    "“Has Putin ever called me a racist?” Ohio GOP Senate candidate J.D.",
    "Our country clearly faces serious challenges going forward.",
    "Trump-supporting commentators and politicians were worse.",
    "“Putin’s smart,” he said at a Mar-a-Lago fundraiser.",
    "Those points raise legitimate policy questions.",
    "Can we please agree on that?"
  ]
}