{
  "id": 26429,
  "mediaId": 5308,
  "date": "2022-02-24",
  "headline": "Donald Trump Is Blaming Russia’s Ukraine Invasion on His 2020 Election Defeat",
  "image": "https://video-images.vice.com/articles/62175ed7a15766009c4f6586/lede/1645703820952-gettyimages-1000209212.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDI1eGg7MHh3LDAuMDIzNXhoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/jgmaqy/donald-trump-ukraine-russia-invasion",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Gilbert",
  "authorUrl": "https://www.vice.com/en/contributor/david-gilbert",
  "termIds": [
    13592,
    13702,
    13764,
    13802,
    13846,
    14192,
    14286,
    14332,
    14355
  ],
  "sentences": [
    "On Wednesday night, as the invasion of Ukraine was underway, right-wing commentator Candace Owens joined the group, using her platform of 3 million Twitter followers to make false allegations that the bombs exploding in Kyiv were not part of a Russian attack, before calling Biden “a dementia patient.”\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "A great piece of land with a lot of people, and just walking right in.”\nTrump’s comments referred to criticism for an interview he did with conservative talk radio hosts Clay Travis and Buck Sexton on Tuesday in which he called Russian President Vladimir Putin “charming.”\n“I went in yesterday and there was a television screen, and I said, ‘This is genius,’” Trump said in the interview.",
    "As bombs fell on the cities of Kyiv and Kharkiv Wednesday night, columns of Russian troops poured across the Ukrainian border, and millions of Ukrainian citizens sat terrified in their homes watching it play out on live television, Donald Trump made it all about him and his incessant Big Lie.",
    "Ingraham did at one point cut Trump off to tell him about fresh reports of Russian troops landing by sea in the city of Odessa, but it appears the former president didn’t fully grasp what was happening and accused Ingraham of sharing top-secret intelligence.",
    "Oh, that’s wonderful.”\nDespite Trump’s claim that Putin’s decision to invade Ukraine was linked in any way to what is happening in the White House, the Russian leader made his reasoning for the invasion very clear in a speech on Monday.",
    "“Ukraine actually never had stable traditions of real statehood,” Putin said in a speech that reiterated his long-held belief that Ukraine is an illegitimate country that exists on land that’s rightfully Russia’s.",
    "This would have never happened.”\nIngraham didn’t push back on Trump’s “rigged election” claims, but there has been no evidence produced to show any widespread or coordinated election fraud in the 2020 election.",
    "“He (Putin) was going to be satisfied with a peace, and now he sees the weakness and the incompetence and the stupidity of this administration, and as an American, I'm angry about it, and I'm saddened by it.",
    "Many within the Republican Party back the Biden administration’s sanctions against Russia, such as GOP leaders Mitch McConnell and Lindsey Graham.",
    "Trump made the remarks while speaking to Fox News host Laura Ingraham, who primed the former president to attack the Biden administration.",
    "During his speech, he mentioned criticism he was receiving in the press for calling Putin “a genius” for invading Ukraine.",
    "Central figures promoting this viewpoint include Missouri Sen. Josh Hawley, Fox News host Tucker Carlson, and J.D.",
    "Trump was speaking to Ingraham from his Mar-a-Lago resort in Florida, where he also addressed a GOP fundraiser.",
    "But there is also a vocal group within the party who back Trump’s claim that Putin has done nothing wrong.",
    "She claimed that Russia decided to attack Ukraine because of perceived weakness in the U.S. government.",
    "“I mean, he’s taking over a country for $2 worth of sanctions,” Trump told the audience.",
    "“Putin declares a big portion of Ukraine, Putin declares it as independent.",
    "Vance, author of “Hillbilly Elegy” and currently an Ohio Senate candidate.",
    "You shouldn't be saying that, they should do that secretly,” Trump said.",
    "“It all happened because of a rigged election,” Trump declared.",
    "He’s taking over a country, literally a vast, vast location.",
    "“You told me about the amphibious attack by Americans.",
    "\"I think you are exactly right,” Trump responded.",
    "And it all happened because of a rigged election.",
    "That was the Russians,” Ingraham said.",
    "“I’d say that’s pretty smart.",
    "“No."
  ]
}