{
  "id": 26426,
  "mediaId": 2803,
  "date": "2022-02-16",
  "headline": "The Fauci Boogeyman",
  "image": "https://compote.slate.com/images/5ed97174-c8ac-4301-b420-02faa5169844.jpeg?width=780&height=520&rect=1560x1040&offset=0x0",
  "link": "https://slate.com/news-and-politics/2022/02/fauci-gain-of-function-wuhan.html?via=rss",
  "mediaOutlet": "Slate.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Molly Olmstead",
  "authorUrl": "https://slate.com/author/molly-olmstead",
  "termIds": [
    13425,
    13702,
    13724,
    13928,
    14054,
    13355,
    13372,
    14260,
    14357,
    14368
  ],
  "sentences": [
    "This is the trendy new gesture conservatives are making to cash in on the anger of red America: To date, more than a dozen congressional candidates have signed this pledge, which was authored by the Daily Wire’s Michael Knowles—presumably because these candidates believe that Fauci is, as the pledge puts it, lying to the American people “regarding the virus, its origin, and the efficacy of public health measures to fight it.”\nMany signees, including Vance, upped the ante by alluding vaguely to some kind of secret maliciousness on the public health official’s part.",
    "Vance, the Hillbilly Elegy author who is now running for Senate from Ohio, tweeted out his support for something called the “Public Health Protection Pledge.”\nStyled to look like an official certificate of completion, the pledge asserts that whoever signs it promises to “subpoena Dr. Anthony Fauci in order to investigate any corrupt activities to which he may be party regarding the COVID-19 pandemic.”\nIt also promises to “sponsor and vote for legislation” that reduces Fauci’s salary “to $0.00.”\nVance signed his name with a flourish and the date.",
    "Last year, in a May Senate hearing dedicated to the federal response to the pandemic, Sen. Rand Paul referenced the incident to accuse the Wuhan Institute of Virology of “juicing up superviruses.” He accused Fauci of complicity when it came to “the NIH funding of the lab in Wuhan” and lambasted “gain-of-function research”—a technical term for a kind of research that modifies existing pathogens, often to make them more threatening to humans in order to study them and prevent illness.",
    "(It was referenced directly in the pledge tweet of Alabama Senate candidate Katie Britt, and other candidates alluded to it in questions about “the truth about the origins of Covid-19.”)\nLast week alone, there was a 90 percent spike in searches for “gain of function research Wuhan,” according to data from Google.",
    "The reasoning, which the NIH later laid out in a letter, was that EcoHealth scientists involved in the experiment didn’t immediately report the results for secondary review—violating the rules of the grant, which was predicated on a second layer of scrutiny for the experiment due to its sensitive nature.",
    "Ron DeSantis telling Fauci to “pound sand.”\nIt’s a political strategy, yes, but the Fauci ads and the anti-Fauci pledge are also tapping into real, widespread hatred of the scientist, fed by Facebook pages peddling conspiracy theories as well as by conservative media channels.",
    "But it’s hard to easily and quickly disabuse people of belief in the “gain-of-function” conspiracy theory because Fauci did grow testy with the grilling at the Senate hearing, and he did sidestep bigger picture questions by relying on technicalities in his answers.",
    "As Andrew Jewett, a historian who wrote a book on cultural battles over science and scientific authority, put it: Fauci has become an ideal representation of the powerful and out-of-touch “unelected bureaucrat,” a character deemed suspect multiple times over.",
    "In 2018 and 2019, an experiment was conducted at the Wuhan Institute of Virology in which a modified coronavirus—not shown to be infectious in humans and only very distantly related to the COVID-19 virus—proved unexpectedly infectious among the test mice.",
    "The longer answer goes like this:\nIn 2014, the National Institutes of Health awarded a grant to a nonprofit called EcoHealth Alliance to fund research into how bat coronaviruses might mutate to infect humans, in hopes of preventing future pandemics.",
    "Crucially, for the xenophobic elements of the conspiracy theories to come, EcoHealth Alliance collaborated with scientists at the Wuhan Institute of Virology, which, as an institution, had been studying these coronaviruses for years.",
    "The short answer is that it is an idea that incorrectly connects U.S. funding that was used by the Wuhan Institute of Virology to study bat coronaviruses to a theory (also incorrect) that the institute created—and leaked—COVID-19.",
    "Fauci-focused Republican attack ads include a “Fire Fauci” ad by Ohio Senate candidate Jane Timken; a Twitter ad by Dr. Oz, who is running for Senate in Pennsylvania, which calls on Fauci to debate him; and an ad by Florida Gov.",
    "That’s risen dramatically in the last decades and, I assume, the last few years.”\nThe anger directed at scientists who tell us bad news, ironically, may have something to do with wanting to protect the concept of science itself.",
    "Or as Tucker Carlson so incorrectly and ridiculously put it on Fox News in May: “The guy in charge of America’s response to COVID turns out to be the guy who funded the creation of COVID.”\nAgain, I must repeat: This is untrue.",
    "One conspiracy theory, known as the “gain-of-function” theory—which blames the U.S. scientific establishment and Fauci for actually creating or at least strengthening the virus, albeit indirectly—is among those gaining ground.",
    "It doesn’t need to: Fauci has become an effective boogeyman for the right—invoked to whip up anger against the bureaucratic establishment and blamed for both the pandemic and the measures that were put in place to curb it.",
    "Right-wing commentators seized on the technical argument over a scientific definition to reach an absurd conclusion: that the NIH had directly funded the source of the pandemic, and that Fauci lied to the American public.",
    "At the Senate hearing, Fauci responded to Paul with what the NIH has maintained is a technically correct answer: that the institute never funded gain-of-function research in the Wuhan Institute of Virology.",
    "Maybe Fauci could have been more transparent about some of the politics of public health, or maybe he could have summoned more patience in his dealings with antagonistic Republican lawmakers.",
    "On top of it all, there is legitimate scientific debate over the merits of conducting such experiments on viruses because of their potential to spread disease or start pandemics.",
    "“As we go through the world and encounter scientific theories or techniques we don’t like, instead of indicting science as a whole, we try to find bad apples,” Jewett said.",
    "“We want to believe that somebody made the choice, so we can undo that choice by going after that person.”\nFauci is just the most powerful scapegoat for pandemic anguish.",
    "Yet another, also from Florida, declared: “we MUST throw Fauci’s corrupt ass in jail!”\nTo be clear, the pledge itself makes no specific accusations of wrongdoing.",
    "It’s the vitriol and conspiratorial thinking around the pandemic—and whom to blame for it—that have ballooned as months have turned into years.",
    "(EcoHealth has disagreed with the NIH assessment and has said there was a communication issue with the agency over the reporting process.)",
    "But as Jewett noted, Fauci, a man who has spent his career grappling with politically charged health crises, “seems prepared for that.”",
    "According to data from Media Matters, his appearances on cable news have remained constant, apart from a dip in summer and fall 2020.",
    "The experiment that was indirectly funded could actually have been classified as gain-of-function, according to several experts.",
    "According to Jewett, the historian and author of Science Under Fire, a conspiracy theory in this vein may have been inevitable.",
    "There’s a rampant belief that scientists are corrupt, that they’re falsifying data, that there are no mechanisms to catch that.",
    "Indeed, the New York Times reported that verbal attacks against Fauci have intensified ahead of looming midterm elections.",
    "Fauci himself hasn’t been doing anything particularly different in terms of his visibility on the topic of the pandemic.",
    "“We struggle to understand impersonal forces, large structural patterns, so we tend to personify them,” Jewett said.",
    "“He’s the biggest representation of science enmeshed with government that we’ve potentially ever had,” Jewett said.",
    "“Fauci should spend the rest of his life rotting away in a federal prison,” quipped another, running in Florida.",
    "This was not necessarily an alarming outcome, but soon afterward the NIH pulled the funding for the project.",
    "Given the stubbornness of the vocal anti-vaxxers, it seems unlikely that that would have done any good.",
    "That doesn’t imply that the research was bad or that EcoHealth experiments were necessarily too risky.",
    "Then, this series of events, routine in scientific research, got politicized.",
    "Still, Fauci did not fund research that led to the COVID-19 pandemic.",
    "“Trust in science is about as high as any institution,” Jewett said.",
    "(He has appeared less often on Fox News since Joe Biden’s election.)",
    "Thus, indirectly, the institute received support from the NIH grant.",
    "A similar phrase saw 2½ times more searches than the week before.",
    "“Time to end the tyranny of Dr. Fauci,” Vance wrote on Twitter.",
    "Fauci is corrupt to the core,” tweeted one, from Texas.",
    "So what is the “gain-of-function” conspiracy theory?",
    "“Higher than churches, and as high as the military.",
    "But the flames of a conspiracy theory were fanned.",
    "The document included a witness signature, too.",
    "But there remained one big sticking point.",
    "It was a disagreement about terminology.",
    "But views of scientists are very poor.",
    "And that is a potent blend.",
    "In early February, J.D.",
    "“Dr."
  ]
}