{
  "id": 26439,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "'She did nothing wrong': Ohio's JD Vance defends Marjorie Taylor Greene's speech to white nationalists",
  "image": "https://www.rawstory.com/media-library/j-d-vance.png?id=29607260&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/jd-vance-marjorie-taylor-greene/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    13392,
    13702,
    13803,
    13886,
    14192,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "“With the horrible Subway Shootings and Violent Crime in New York being at an all-time high, where people are afraid to walk the streets, the racist and highly partisan Attorney General of New York State, failed Gubernatorial candidate Letitia James, should focus her efforts on saving the State of New York and ending its reputation as a Crime Capital of the World,\" Trump said, \"instead of spending millions of dollars and utilizing a large portion of her office in going after Donald J. Trump and the Trump Organization (for many years!",
    "At the OH Senate debate tonight, JD Vance is asked if he will condemn Marge Greene speaking at a Nazi rally: \\u201cShe is my friend, and she did nothing wrong .. and I\\u2019m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.\\u201dpic.twitter.com/fipwlONqc4\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1648516079\nShould Donald Trump be charged?",
    "“She is my friend, and she did nothing wrong,\" Vance said, \"and I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.”\nGreene, who has campaigned with Vance in Ohio, drew widespread criticism for her appearance at the event, where participants approvingly compared Russian president Vladimir Putin to Adolf Hitler.",
    "In mid-February — prior to the invasion that Russia forces launched on February 24 — Vance told “War Room” host Steve Bannon, “I got to be honest with you, I don’t really care what happens to Ukraine one way or the other.” Since then, thousands of people have been killed in that war; millions of Ukrainians have fled their country.",
    "The \"Hillbilly Elegy\" author complained Monday night during an Ohio GOP Senate debate that the media had used \"guilt by association\" to smear Greene, who spoke in person at the America First Political Action Conference organized by white nationalist Nick Fuentes, reported HuffPo.",
    "Vance has been drawing a great deal of criticism for his comments about Ukraine, and journalist Joshua Jamerson — in an article published by the Wall Street Journal on April 16 — reports that Russia’s invasion of Ukraine continues to be a topic in the Ohio U.S. Senate race.",
    "Vance, Mandel, former Ohio GOP Chair Jane Timken and businessman Mike Gibbons have been engaged in a bitter, mudslinging battle to show who is the most MAGA, and the tensions between Vance and Mandel have been especially ugly.",
    "Former President Donald Trump on Monday issued a new statement attacking New York state Attorney General Letitia James, who is conducting a civil inquiry into alleged financial misconduct at the Trump Organization.",
    "), who have probably done more for New York than virtually any other person or group, including employing many wonderful people and paying millions and millions of dollars in taxes.\"",
    "Vance in Ohio’s 2022 GOP U.S. primary — much to the chagrin of former State Treasurer Josh Mandel and his supporters, who had been imploring Trump not to make that endorsement.",
    "And Vance, according to Jamerson, has tweaked his messaging on Ukraine a bit by trying to sound more sympathetic to Ukrainians while maintaining an “America First” tone.",
    "The operators of the telegraphs reported receiving electrical shocks, telegraph paper catching fire, and being able to operate equipment with batteries disconnected.",
    "These storms occur when a large bubble of superheated gas called plasma is ejected from the surface of the sun and hits the Earth.",
    "She was joined at the Florida conference by Rep. Paul Gosar (R-AZ), who has maintained ties to white nationalist groups for years.",
    "During the evenings, the aurora borealis, more commonly known as the northern lights, could be seen as far south as Colombia.",
    "Typically, these lights are only visible at higher latitudes, in northern Canada, Scandinavia and Siberia.",
    "What the world experienced that day, now known as the Carrington Event, was a massive geomagnetic storm.",
    "In the statement, he referenced the April 12 shooting in Brooklyn that left 30 people injured.",
    "Vance defended Rep. Marjorie Taylor Greene's appearance before a white nationalist conference.",
    "On Friday, April 15, former President Donald Trump endorsed “Hillbilly Elegy” author J.D.",
    "On Sept. 1 and 2, 1859, telegraph systems around the world failed catastrophically.",
    "This bubble is known as a coronal mass ejection.",
    "Republican Senate candidate J.D."
  ]
}