{
  "id": 26445,
  "mediaId": 2532,
  "date": "2022-02-27",
  "headline": "Full transcript of \"Face the Nation\" on February 27, 2022",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/02/27/c255a5cc-ce4f-4eb9-98d7-38ea5fe5fd1f/thumbnail/1200x630/37695b068c036a1ae3d032f29d0ef866/0227-ftn-page2-906852-640x360.jpg",
  "link": "https://www.cbsnews.com/news/full-transcript-face-the-nation-02-27-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13569,
    13607,
    13677,
    13754,
    13858,
    14192,
    13369,
    14286,
    14341
  ],
  "sentences": [
    "So this- this can work, there can be it- the G7 is meeting finance ministers on Tuesday morning, so I'll meet with them and they're in the central banks of the G7 and they can decide a lot of how much aid goes into- into Ukraine there- The IMF also has- we're working with them closely to assess the needs and to think about instruments.",
    "And anyone who thinks that U.S. freedom and security is going to be maintained if we take a step back and don't lead, you simply need to look at what's happening in Ukraine to recognize that- that those who fill the void when the U.S. steps away are people like the Russians, like the Chinese, like the Iranians.",
    "I think that it's very important, you'll see with the January six committee, we have a very aggressive litigation strategy, and I think that there were a number of instances in the first impeachment where it would have been important and decisive to have witnesses testify who did not come in and testify.",
    "GEN. MCMASTER: He's not going to reign in Putin, and what he's- what he's doing, I think, is creating the facade of maybe being an advocate for peace, just like he's- he's always been remember –\nMARGARET BRENNAN: –because the White House would say, 'Oh, look, China is afraid of secondary sanctions.",
    "We're engaging closely with the U.N. agencies on the ground to ensure that we provide them with the resources that they need and the support that they need to ensure that every single refugee crossing into neighboring countries are received equally and with the same amount of protection.",
    "REP. CHENEY: I don't regret my vote, I think any impeachment vote has got to be one that is based very clearly on- on the evidence, and I think that we certainly have learned a lot from that first impeachment trial that we are using as we move forward in the January six committee.",
    "You know, and it's really easy to look good crossing the border at the beginning of an offensive, but you begin to reach the culminating point where you run out logistics supplies, and your force gets more diffuse, and then your supply lines are open to interdiction and so forth.",
    "MARGARET BRENNAN: The first- first impeachment trial of President Trump was triggered from a complaint by U.S. intelligence official, who said that the president was withholding aid or threatening to- to Ukraine, to President Zelensky, in order to win political favors.",
    "One thing that President Trump got right was increased spending for the military, and it's very important for us, especially as we look at the challenges now, as we look at Putin's nuclear threat, we cannot adopt policies like a no-first-use nuclear policy.",
    "MARGARET BRENNAN: But on the issue of sanctions, which have been the prime tool here -- and they've ramped up tremendously over the past 72 to 48 hours -- the president said earlier in the week we'd have to wait a month to see what the impact would be.",
    "It is wonderful to see them welcomed, but there seems to be a contradiction here, because, if you look at the border of Poland, as you know, there are detention camps for some refugees who had come from Syria, from Afghanistan, from other countries.",
    "It's very difficult to reposition forces, to meet this multiple pronged offensive with what you call interior lines, the ability to move across one and then defeat them in detail, which is what you would want to do when the Russians control the air.",
    "I think though, it's very clear, if you- if you look at some of the challenges that we're dealing with now, President Trump spent a large part of his presidency, for example, attacking NATO, saying that NATO was obsolete, attacking our allies.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: I'm just hearing this from -- from you, Margaret, but I'm not surprised at this -- at this information, because Putin has tried every means possible to actually put fear in the world, in terms of his action.",
    "And as- as you look at things like Vladimir Putin's threat, for example, this morning about his nuclear forces, you know, that's something that we need to take seriously, but we also need to be clear that we're not going to be intimidated.",
    "And one of our former U.S. ambassadors to Ukraine, John Herbst, has pointed out that it cost Putin nothing to make that threat, but it would cost him everything were he to follow through, certainly with any- any use of nuclear force.",
    "We ought to be sanctioning not just Putin, not just Lavrov, not just the oligarchs, but all of their families that this- this behavior, this aggression against Ukraine is something that- that the- the world simply cannot tolerate.",
    "MARGARET BRENNAN: But do you agree with President Biden's strategy here that rather than go nose to nose with the Russian military, U.S. force should be completely off the table and that it should all be dependent on sanctions.",
    "Lt. Gen. Ben Hodges on \"Face the Nation\"\n Full transcript: World Food Programme chief David Beasley on \"Face the Nation\"\n Transcript: Sen. Chris Coons on \"Face the Nation\"\n Full transcript of \"Face the Nation\" on April 17, 2022",
    "What- what Russia, and David will be able to talk more about this than I can, but they've been trying to insulate themselves right, from- from economic sanctions and and they're doing it in cooperation with one another, right?",
    "But then you look at the international system, you served in the Trump administration, there's a lot of criticism of the international system, and parts of it, while it may be revitalized, it does look a little bit creaky.",
    "Markets look forward so they can look at the five-year time horizon and realize that there's a lot of energy available if it's mobilized, there are alternatives to the Russian dominance of the gas market, for example.",
    "It's also a concern, as I said earlier, when you have an opportunity to make an appointment like you just had, and he made an African-American appointment, I guarantee you, you will see some of that move up.",
    "I'd like to see very clear that- you know- the United States ought to be looking at ourselves, frankly, as an arsenal of energy for the world in a way that in World War Two, we were an arsenal of democracy.",
    "MARGARET BRENNAN: Congressman, the president will deliver his State of the Union address this coming week, and we know that his approval ratings have fallen among virtually every group over the past year.",
    "You know what that means, Margaret, that means rewriting the rules in a way that cuts against our interests and benefits the two authoritarian regimes that are trying to dominate the Eurasian landmass.",
    "In Ukraine's second city of Kharkiv...\n(MAN SPEAKING IN FOREIGN LANGUAGE)\nCHARLIE D'AGATA: ... street battles are underway, as Ukrainian soldiers and civilians struggle to keep control of the city.",
    "So the fact that the Russians are bogged down may be good news for the defense of Ukraine, but it's bad news for the citizens of Kyiv, because it puts them in even greater danger of being harmed.",
    "It's- that we are doing everything we can to support the people of Ukraine, the people of the region and also thinking about this tragedy for the Russian people that they- they didn't choose war.",
    "MARGARET BRENNAN: There was a sensitivity to disrupting the oil markets and also exposure to some of the European countries, which is why they're weaving those sanctions sort of carefully there.",
    "To give you an idea of how tense it is, the mayor has ordered everyone off the streets until at least tomorrow at 8:00 a.m., saying anyone caught outside will be considered an enemy -- Margaret.",
    "Madam Ambassador, I mean, big picture here, I understand your role at the United Nations, but it is just the entire purpose of the U.N. to prevent something like this from ever happening again.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: U.S. combat troops in Ukraine are off the table, but U.S. troops in our NATO countries, bolstering our support for NATO, has never been taken off the table.",
    "And then also, I think, to open up commercial traffic again, to alleviate humanitarian suffering in Ukraine, as well as to keep open the land routes coming out of Poland, Moldova and Romania.",
    "MARGARET BRENNAN: Congressman, two prominent Democrats came out this week with some words of advice to the Democratic Party, Michael Bloomberg and former Secretary of State Hillary Clinton.",
    "MALPASS: Right in the short run, there's-there is upward pressure, including on LNG liquefied natural gas that the U.S. ships to Europe and Europe will need a lot more, but it's available.",
    "You know, it's pretty easy for that force to become dissipated and become absorbed into the vast territory of Ukraine, a country of 40 million people that occupies a space of Texas, right?",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: What is happening now is that the Russian government has shown its disrespect for the U.N. Charter and for all of the principles that we believe in.",
    "REP. CHENEY: I think there are several things we need to be doing, we need to certainly be increasing the sanctions, as I've said, and I would have sequenced the sanctions differently.",
    "We will also look at potential financial fallout from the crisis with the president of the World Bank, David Malpass, and explore how a crisis 5,000 miles away is impacting Americans.",
    "MARGARET BRENNAN: But we heard our own David Martin lay out why that may sound reassuring, but it is also actually scary for civilians because Russia may use less precise weapons.",
    "Vladimir Putin has been speaking on state TV with his top officials and said he was ordering Russia's nuclear deterrent forces to be on alert for a special regime of combat duty.",
    "MARK STRASSMANN: Thousands of those innocents could become war refugees, a Ukrainian diaspora that could reach America, joining Ukrainian communities in New York and California.",
    "But the problem is, if just one low-yield nuclear weapon goes off, even if he just does a demonstration shot out in Siberia, there's just no experience for what happens next.",
    "And I think, when you look at not just her background and the family life, but also her profession -- she was a public defender -- that adds a new perspective to the court.",
    "MARGARET BRENNAN: Congressman, you spoke very passionately the last time you were on this program about your first choice, the South Carolina native, Judge Michelle Childs.",
    "MARGARET BRENNAN: Madam Ambassador, there was already a refugee crisis in Eastern Europe, and now we have about 400,000 refugees spilling into the surrounding countries.",
    "This train from Lviv to Poland was overrun by panicked passengers, on, and on the road, it's mostly women and children dragging what they can carry past gridlocked cars.",
    "McMaster, former national security adviser and retired lieutenant general\nWorld Bank President David Malpass\nClick here to browse full transcripts of \"Face the Nation.\"",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: The Polish government and other governments have indicated that they're opening their borders for all who are crossing from Ukraine.",
    "And this is clearly an effort to sort of shock the rest of the world into realizing how important Ukraine is to him and the -- what he is willing to do to take Ukraine.",
    "And so I think this multi-pronged attack that you show in the graphic, you know, it looks good on the map, on- on a chart, but it's actually quite difficult to execute.",
    "(MAN SPEAKING IN FOREIGN LANGUAGE)\nCHARLIE D'AGATA: The Russian military says, \"This is not one of ours,\" instead blaming Ukrainian air defenses for going off-target.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: For more on the potential global financial impact of the war in Ukraine, we turn to the President of the World Bank, David Malpass.",
    "The cold walk to Poland can take more than 20 hours, but, once they cross, aid agencies offer warm soup, free rides, and even fresh shoes for tired, worn-out soles.",
    "Russia sets off a small low-yield nuclear weapon just to shock everybody into staying in place and stepping back for a moment and considering what's going on here.",
    "(Begin VT)\nCHARLIE D'AGATA (voice-over): The Russian military expanded its aerial onslaught overnight, taking aim at oil and gas facilities in a wave of attacks.",
    "REP. CHENEY: Look, we've- we've been down that road before, we've seen isolationism in both parties, and it's always been wrong and it's always been dangerous.",
    "And- and I think it's- it's indefensible for people to abandon those or suggest that we are- we have no- no view as between Russia and Ukraine in this battle.",
    "They don't want us revealing this location because they don't want it to be a target for the Russian military, but we have seen a steady stream of volunteers.",
    "Russia's initial aims have been frustrated that the military problem gets harder and harder for them as they extend their lines of communication supply lines.",
    "(End VT)\nMARK STRASSMANN: The Ukraine crisis also complicates a critical decision coming up for the Fed, whether to blunt inflation by raising interest rates.",
    "Russia is a leading producer of oil and gas and rare earth minerals, titanium used in airplanes, palladium for semiconductors, like the chips that cars need.",
    "But it's worth noting, Margaret, you know, there are more people in Russia's internal security service than there are in the Russian military at this moment.",
    "MARK STRASSMANN: But all Americans feel something vaguely unsettling, within this Russian blitzkrieg, potentially, ominously, the rise of a second Cold War.",
    "And so the president has a job here of trying to do what is necessary to get people back to work, to get incomes in people's homes, to get people in homes.",
    "David, the reporting is that the Ukrainian resistance is putting up a fierce fight, and that Russia isn't moving as quickly as they had thought they would.",
    "MARGARET BRENNAN: But, to be clear, is this just loose talk about nuclear weapons or is there some kind of heightened readiness and reason to be concerned?",
    "Ukraine's soldiers and reservists now man checkpoints in the city streets, on the hunt for plainclothes Russians trying to in fill infiltrate the capital.",
    "We will have the latest from Kyiv, the capital city under siege, plus reports on the hundreds of thousands of Ukrainians desperate to escape the violence.",
    "We will talk with Ambassador to the United Nations Linda Thomas-Greenfield, Republican Congresswoman Liz Cheney, and former National Security Adviser H.R.",
    "One thing is the- you know, the arc of history is for Russia to be closer to Europe- there's all this talk about China, but that's not a natural alliance.",
    "We haven't seen the details of the sanctions, but they also yesterday talked about it and announced that they would be hitting the central Bank of Russia.",
    "And so when you have a group such as African-Americans that have little in the first place, inflation comes, it depresses their family incomes even more.",
    "Right now, we have an instrument that is able to move quickly in the next few days if it's-- if it's needed and- and the- the circumstances go that way.",
    "The Ukrainian president has accused Russia of intentionally targeting civilian areas in another night of artillery and airstrikes here in the capital.",
    "MARGARET BRENNAN: Well, let me ask you about the Biden administration's strategy here, because sanctions have really been at the heart of the policy.",
    "MARGARET BRENNAN:So do you- how do you interpret Xi Jinping, the president of China's call to Vladimir Putin, to urge him to negotiate a settlement?",
    "But- but I think Europe, Germany in particular has to realize they made a big, big mistake when they gave Russia coercive power over their economy.",
    "Secretary Clinton also said: \"We can't get distracted, whether it's the latest culture war nonsense or some new right wing lie on FOX or Facebook.\"",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: CBS News coverage of the State of the Union address kicks off Tuesday 8:00 p.m. Eastern on our streaming network.",
    "And I think anything we can do, obviously, financially, going after his international criminal enterprise with sanctions and so forth is important.",
    "And the sanctions could potentially also make companies feel very vulnerable at a time when everyone's nerves are frayed after the last two years.",
    "It's- it's more so in 1989, I was on the border of China and Russia, and people were wondering, are they going to get together and work together?",
    "So I think that this is an impossible military problem for him if his aim is to not only remove Zelensky from power, but then to control Ukraine.",
    "Ambassador Linda Thomas-Greenfield\nRepresentative Liz Cheney, Republican of Wyoming\nRepresentative James Clyburn, Democrat of South Carolina\nH.R.",
    "And, again, we have to continue, as the president has indicated, to hold him accountable, and that is exactly what we're doing here in New York.",
    "It may not move up with the people who are having income problems, but it will move up to those who have other reservations about the president.",
    "MARGARET BRENNAN: Does that mean when Kiev falls, the United States should fund and arm an insurgency in kind of a Cold War style proxy battle?",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: The war in Ukraine is being fought 5,000 miles away, but its impact is being felt here in the United States.",
    "But you have to look at it and say, they have still got 50,000 there on the border ready to commit and lots more troops back in mother Russia.",
    "Ambassador to the United Nations): It means that President Putin is continuing to escalate this war in a manner that is totally unacceptable.",
    "In the U.S., the assault's other front line is economic, its impact on inflation, with consumers already squeezed by rates at a 40-year high.",
    "But if they go, if they're able to stop the central Bank of Russia from operating, that would really have an effect on Russia and the people.",
    "GEN. MCMASTER: –I really think that Margaret–\nMARGARET BRENNAN: Why do you think that there's actually a real threat to him staying in power?",
    "The Ukrainian people are fighting for their freedom, they're fighting for democracy, they're fighting for one another and their sovereignty.",
    "MARGARET BRENNAN: So the president has made clear he does not want to put the United States in a position of going head to head with Russia.",
    "America cannot defend and maintain our own freedom and security if we think that we're going to simply withdraw from the world and not lead.",
    "And so the idea that- that the world will be safe and that America will be able to be safe and free with an isolationist approach is wrong.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: We're continuing to support Ukraine, not just with the sanctions that we have imposed on the Russians.",
    "And this is going to jeopardize his ability to stay in power, you know, real wages in Russia–\nMARGARET BRENNAN: –Do you really think that?",
    "But, according to our CBS polling, the drop has been especially steep among black Americans, down from 87 percent to 66 percent approval.",
    "MARGARET BRENNAN: You know, how important is it for President Biden to have this vote, for this particular historic choice be bipartisan?",
    "I think the fact that we've had the European countries and NATO united with the United States as we go forward is a very positive thing.",
    "The commander told us it is not hundreds, but thousands, very few with any military experience, every single one of them ready to fight.",
    "But, in the final analysis, let's have a strong bipartisan support to demonstrate that both parties are still in pursuit of perfection.",
    "I- I briefed our board on Thursday and it can be added to by- by other countries that want to- countries that want to support Ukraine.",
    "MARK STRASSMANN: Our global economy faces a double whammy, the ripples from new sanctions on Russia and worsening supply disruptions.",
    "MARGARET BRENNAN: You know, I think a lot of people like to hear the optimism here, and it's kind of refreshing to hear in that way.",
    "Vance, an Ohio candidate for Senate, said on a podcast recently, 'I don't really care what happens to Ukraine one way or the other.'",
    "MARGARET BRENNAN: You know I'm talking about Poland building a wall against the border with Belarus to block refugees in the past.",
    "There is other support that is going to the Ukrainian government and other pressure that is being put on Russia across the world.",
    "KAMALA HARRIS (Vice President of the United States): The purpose of the sanctions has always been and continues to be deterrence.",
    "And it's inflation, time and again, that shows up over every single group as one of the biggest things weighing on the president.",
    "And so we have to-we have to work hard, I think, to maintain the international order that has benefited people across the world.",
    "And it was already at a point of fragility because inflation really hits the poor and this is going to drive up energy and food.",
    "So, how do we understand what he said this morning on TV, when he said he was increasing the nuclear deterrence readiness level?",
    "I think we need to make sure that we get the Supplemental Assistance Package that should be on the floor of the House this week.",
    "I think it's really important to look at that- at the, you know, at the joint statement that was made just before the Olympics.",
    "We will continue to isolate them and to push for them to respect the charter and cease this aggressive action against Ukraine.",
    "So while we were using sanctions, which we hoped the Russians...\nMARGARET BRENNAN: Well, he said U.S. force was off the table.",
    "So, they're -- they may be suffering an embarrassment of arms, but I think most people still expect a breakthrough will come.",
    "And, in fact, they are starting to use rockets, which are much less precise than missiles, using rockets to bombard the city.",
    "And one of the reasons you argued it was important to have someone like her, you said, was because she went to state schools.",
    "I don't want to scare people with the thought that Russia is somehow getting prepared to launch nuclear missiles at the U.S.",
    "Senator Josh Hawley of Missouri told CBS the U.S. should not send troops to any NATO country since the U.S. can't afford it.",
    "So there is this non-interventionist, isolationist movement that President Trump himself really endorsed with America First.",
    "So I think there are a number of things we need to be doing that make very clear that the United States stands with Ukraine.",
    "In Kyiv, a missile tears through an apartment block, where we found dazed and displaced residents dragging belongings away.",
    "If there's any good news, it's the overwhelming international show of support for Ukraine and President Volodymyr Zelensky.",
    "Coverage continues on our broadcast network at 9:00 p.m.\n(ANNOUNCEMENTS)\nMARGARET BRENNAN: Welcome back to Face the Nation.",
    "Two years ago, South Carolina Congressman Jim Clyburn urged President Biden to nominate a black woman to the Supreme Court.",
    "And when people are taking books of black authors out of the schools, that, to me, cannot be allowed to stand unchallenged.",
    "I believe in Munich--\nMALPASS: --That's right--\nMARGARET BRENNAN: --So what are you doing to help the Ukrainian government?",
    "One of the other things you have been working on is you met personally with the Ukrainian president just about a week ago.",
    "CHRISTINA RUFFINI: And 10,000 to Slovakia, where the government is offering financial aid to anyone who shelters refugees.",
    "But Russian troops have run into fierce resistance, as Ukrainian forces hold ground, and no major city has been captured.",
    "And I think what we have to do next, we have to figure this out, Margaret, is we have to sanction the hydrocarbon sector.",
    "So I think these totalitarian leaders, they can look, you know, they can look strong, but they're actually very brittle.",
    "And it appears as if some refugees are treated differently based on their country of origin, if they're European or not.",
    "(End VT)\nMARGARET BRENNAN: If the sanctions weren't meant to prevent anything from happening, then what was the purpose?",
    "(Begin VT)\nJAKE SULLIVAN (U.S. National Security Adviser): The president believes that sanctions are intended to deter.",
    "And it just means that we have to ramp up our efforts here at the United Nations and elsewhere to hold him accountable.",
    "You know, we are watching today the brutality of Vladimir Putin as he attempts to invade a democratic sovereign nation.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We now return to the war raging in Ukraine with former national security adviser H.R.",
    "It is just as important to me for my grandchildren to learn about Lewis Latimer as it is to learn about Thomas Edison.",
    "We have to make sure that we are recognizing here at home, what's- what's important and necessary to defend ourselves.",
    "So as you think about the sanctions, it-it hits the-the banks and Russia, but apparently not the oil and gas industry.",
    "We ought to be an arsenal of energy, so we ought to be unleashing our own energy resources, our own energy production.",
    "(End VT)\nCHRISTINA RUFFINI: Now, despite the exodus, we have actually seen intermittent lines going back into Ukraine.",
    "She says, if NATO and the U.S. don't do more to stop Russian President Vladimir Putin, other countries could be next.",
    "Plus, we will talk about President Biden's historic Supreme Court pick with South Carolina Congressman James Clyburn.",
    "I was very pleased to see that Germany has announced that they will be raising their defense spending to two percent.",
    "It was a choice that brings onto the court a background and some experiences that nobody else on the court will have.",
    "And I don't think, I don't think seizing Kiev is in the cards in the immediate future–\nMARGARET BRENNAN: –You don't?",
    "Right now, China's buying more from Russia and allowing the sanctions to be- to be eroded or- or circumvented a bit.",
    "He's trying to reduce his vulnerability to the restrictions on- on his access to the dollar economy by buying yuan.",
    "But the fact of the matter is, it is more of a problem for those people who have very little or nothing to inflate.",
    "The situation is getting more dire by the hour, as the Russian military noose surrounding most of Ukraine tightens.",
    "And today on Face the Nation: The world watches in horror, as Vladimir Putin continues his rampage through Ukraine.",
    "CHARLIE D'AGATA: The government has called on men 18 to 60 to step up and fight, handing out around 18,000 weapons.",
    "MARGARET BRENNAN: This morning, the United Kingdom's foreign minister said the conflict will get very, very bloody.",
    "Russia has now committed about two-thirds of those 150,000 troops it had massed around the border, 100,000 troops.",
    "The reality of a European capital city being bombed by Russia as the war in Ukraine rages is still hard to fathom.",
    "I think that's a sign when- when he had to humiliate his intelligence director on television, what does that mean?",
    "MARGARET BRENNAN: Well, I think that picture looks a lot different now that we see a city being bombed by Russia.",
    "Russia wants to use China with its- the- the SWIFT- they have a mere system that can connect payments with China.",
    "MAN #2: How is it possible in the 21st century that you have an invasion of 200,000 men on an innocent country?",
    "Bloomberg said: \"The party is headed for a wipeout in November up and down the ballot because it's distracted.",
    "I know Ukraine has also raised concerns about Russia handing out gas masks in the eastern part of the country.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We go now to Representative Liz Cheney of Wyoming, who joins us from Casper.",
    "JOE BIDEN (President of the United States): No one expected the sanctions to prevent anything from happening.",
    "He said, anybody who tries to interfere will suffer consequences like they have never seen before in history.",
    "So I think there's probably a military option there to tell the Russians, 'Hey, you don't own the Black Sea.'",
    "And we are certainly seeing today how crucially important NATO is, how crucially important our allies are.",
    "You know, this is a tragedy right now for Ukrainians, for the neighbors of Ukraine, but also for Russians.",
    "I think we need to make sure that we're rushing additional javelin and stinger missiles to the Ukrainians.",
    "In the past 24 hours, the U.S. and allies ratcheted up financial pressure on Putin with massive sanctions.",
    "And national security correspondent David Martin is here now with more on the troop movements in Ukraine.",
    "ANTONY BLINKEN (U.S. Secretary of State): Once you trigger the sanctions, you lose the deterrent effect.",
    "This is some of the debris and rubble that rained down from this apartment block after a missile strike.",
    "The problem is that any- any of these, you know, the protests that we see, they're immediately put down.",
    "We have programs in those countries that can be added to that to- to support the- the- the refugee flow.",
    "GEN. MCMASTER: Well, there might be afraid of secondary sanctions, and they might- they might get them.",
    "REPRESENTATIVE JAMES CLYBURN: Well, culture wars are a problem, but it's not coming from the Democrats.",
    "And I think what- what Putin didn't understand is that this isn't an autocratic regime like his, right?",
    "(End VT)\n CHARLIE D'AGATA: Now, explosions have continued overnight and really throughout the day here.",
    "MARK STRASSMANN (voice-over): Unease now invades America, from a thuggish land grab a half world away.",
    "And in return for those tougher sanctions, Putin has put his nuclear deterrence forces on high alert.",
    "Now he's putting his troops -- or says he's putting his troops or his nuclear forces on higher alert.",
    "MARGARET BRENNAN: I want to ask you about where the conservative movement is these days with Russia.",
    "Isn't what's happening now, though, showing that that global order is failing the people of Ukraine?",
    "GEN. MCMASTER: Well, there is, and that's continued support for the Ukrainians to defend themselves.",
    "REP. CHENEY: We certainly haven't reached the limit, I think that we have seen impressive progress.",
    "But Ukrainians are literally fighting in the streets to defend the key cities of Kyiv and Kharkiv.",
    "The United Nations estimates that up to five million Ukrainians may flee to neighboring countries.",
    "And I don't know exactly what... (CROSSTALK)\nMARGARET BRENNAN: But the focus by Democrats on that.",
    "But how about the relationship with Russia and China, how they're aiding and abetting one another?",
    "MARGARET BRENNAN: It- is one of the decisions to be made, what to do after the government falls?",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: We're working to support the government as much as possible.",
    "And we have to continue to condemn his actions in the most strong -- the strongest possible way.",
    "AKSONIA (Ukrainian Living in Poland): This guy doesn't care about (EXPLETIVE DELETED) sanctions.",
    "And the Pentagon war-games stuff like this: A Russian invasion of a country in Europe bogs down.",
    "CHRISTINA RUFFINI (voice-over): For Ukrainians trying to leave, there are no more good options.",
    "There are more political prisoners in Russia than there were during the height of the Cold War?",
    "You have Ukraine's president begging for a no fly zone for some kind of military intervention.",
    "How quickly is it going for nuclear weapons because it's a source of oil in the world as well.",
    "And the president of Ukraine has indicated that they are going to be fighting back constantly.",
    "Trending News\n Ukraine's top diplomat says Mariupol \"doesn't exist anymore\"\n Transcript: Ret.",
    "But as you mentioned just in the question, the problem is Russia's control of the air, right?",
    "We can't let people just take black history out of the schools' agenda and call it a theory.",
    "If you look at the numbers of forces, you know, it looks like a lot, you know, 160 thousand.",
    "But there is also the possibility- Ukraine has a lot of borders with Romania, with Moldova.",
    "He's threatening to potentially lean into nuclear by saying he's raising his threat level.",
    "MARGARET BRENNAN: Have we reached the limit of what is possible to do here with sanctions?",
    "We are going to see higher prices, not quite as high as the pumps, in the grocery store.",
    "Last week, the president fulfilled that promise and picked Judge Ketanji Brown Jackson.",
    "MARGARET BRENNAN: So should Volodymyr Zelensky do anything to negotiate at this point?",
    "And, you know, democracy as we've been, you know, self-flagellation for several years.",
    "Ambassador to the United Nations, Linda Thomas-Greenfield, who joins us from New York.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: Certainly, nothing is off the table with this guy.",
    "We need to make sure that we are moving to deploy forces as we are in Eastern Europe.",
    "GEN. MCMASTER: I don't think he's- he's a rational actor because he's fearful, right?",
    "What do you think the impact will be if you hear of sanctions on petroleum products?",
    "(Begin VT)\nWOMAN #1: We say we're -- help, help, help, helpless, because we're here.",
    "Tomorrow morning, when they wake up in Moscow, do you expect to see a run on banks?",
    "MARGARET BRENNAN: –because those negotiations diplomatically are at a key decision.",
    "McMaster, he's now at the Hoover Institution at Stanford and with us this morning.",
    "We need to make sure that we're continuing to encourage our allies to do the same.",
    "We are pushing here at the U.N. to continue to call out their aggressive actions.",
    "He's willing to use whatever tools he can to intimidate Ukrainians and the world.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: We always had a two-pronged approach to this.",
    "When you're talking about Critical Race Theory, we aren't putting that out there.",
    "REPRESENTATIVE JAMES CLYBURN: Well, I don't think any of us are focused on that.",
    "I mean, as ugly as democracy is, democracies are actually pretty darn resilient.",
    "And I hope the Ukrainians inspire confidence in all of us across the free world.",
    "They are vetoing–\nGEN. MCMASTER: – absolutely–\nMARGARET BRENNAN: –moral outrage.",
    "I would like to see us move with respect to the Russian central bank completely.",
    "And, as you know, the president has approved additional troops to support NATO.",
    "Many of the people in those lines are young Ukrainian men from all over Europe.",
    "And they are starting to experience shortages of fuel, shortages of ammunition.",
    "Christina Ruffini has been following refugees crossing that border into Poland.",
    "More than 100,000 Ukrainians have now fled to Poland, 25,000 to nearby Romania.",
    "And so we have to make major adjustments to the energy infrastructure globally.",
    "So much has happened in the past few days with even bigger sanctions on Russia.",
    "You know, as we- as you heard earlier, that big flow going right now to Poland.",
    "Get it wrong, and there's the specter of a new threat, a recession -- Margaret.",
    "What he wants to do more than anything is restore Russia to national greatness.",
    "We can't accept defense spending that is insufficient to defend our interests.",
    "MARGARET BRENNAN: He did say U.S. force, U.S. combat troops are off the table.",
    "I mean, how do you explain to voters why that view- Republican view- is wrong?",
    "But the support for Ukraine's ability to defend themselves is also important.",
    "MALPASS: Okay\nMARGARET BRENNAN: David Malpass, thank you for your time today.",
    "MARGARET BRENNAN: Congressman Clyburn, thank you for your time this morning.",
    "GEN. MCMASTER: The next 72 hours, I think, are going to be really critical.",
    "And I would hope that all my Republican friends will look upon it that way.",
    "What will happen if this is a government in exile or this is an insurgency?",
    "So one thing to watch is the ruble that really affects the Russian people.",
    "GEN. MCMASTER: Well, I think the Russian people could stand up to him now.",
    "But for Lewis Latimer, Thomas Edison's light bulb would never have worked.",
    "REPRESENTATIVE JAMES CLYBURN: Well, inflation is a problem for everybody.",
    "MARGARET BRENNAN: Madam Ambassador, thank you for your time this morning.",
    "moved here from Crimea after the Russian military invaded there in 2014.",
    "When you look at the map, it's important to look at the scale, Margaret.",
    "China has- has pledged to buy even more and more oil and gas from Putin.",
    "MARGARET BRENNAN: Big picture, what's the impact for the global economy?",
    "MARK STRASSMANN: Especially for roughly one million Ukrainian Americans.",
    "We have to do everything we can maybe to- to buffer the effect of that.",
    "He's living in a bubble\nMARGARET BRENNAN: So who could stand up to him?",
    "Many have sought shelter deep underground in the city's subway network.",
    "On this \"Face the Nation\" broadcast moderated by Margaret Brennan:\nU.N.",
    "MARGARET BRENNAN: Vladimir Putin is known for having a very heavy hand.",
    "So, it is a dangerous moment, not just for Ukraine, but for the world.",
    "A big thing is the US can supply a lot more if it puts its mind to it.",
    "MARGARET BRENNAN: Right--\nMALPASS: --No sign of that for the long run.",
    "Ukraine, the breadbasket of Europe, grows wheat and other food crops.",
    "MARGARET BRENNAN: So I spoke to Kurt Volker, former envoy to Ukraine.",
    "MARGARET BRENNAN: But can the government in Kiev hold on for a month?",
    "He said to me, when you have a balance of forces, you have strength.",
    "That Russia, the Russian military, doesn't look very good right now.",
    "Is there any military option short of going to World War Three here?",
    "But we cannot allow these kinds of things to float around out there.",
    "It means everybody around him is telling him what he wants to hear.",
    "I think again, this next 72 hours are going to be really important.",
    "And we also have instruments moving that can help the refugee flow.",
    "They told us they're going back home to join the fight -- Margaret.",
    "Thank you very much, David, for giving us the bottom line on that.",
    "But we're also engaging very, very closely with these governments.",
    "MARGARET BRENNAN: No, that is a good thing to have on the horizon.",
    "You know, the phrase in Russia is 'net voyne,' which is no to war.",
    "I think they deserve them actually for aiding and abetting Russia.",
    "JILL SCHLESINGER: We are going to see higher prices at the pumps.",
    "He's also driven by a desire to remain in power to at least 2036.",
    "Face the Nation will be back in a minute, so please stay with us.",
    "We ought to stop the imports of Russian oil to the United States.",
    "I'd like to see swift sanctions that don't leave any carve outs.",
    "Is there a threat of chemical and biological weapons being used?",
    "REPRESENTATIVE JAMES CLYBURN: Thank you very much for having me.",
    "So we were not trying to look at hypotheticals or contingencies.",
    "GEN. MCMASTER: Well, I think the Ukrainians are going to fight.",
    "And so I think now he knows that all of that is at risk, right?",
    "And I am one, as you can see, that's not so much for tradition.",
    "This is about the country, our pursuit of a more perfect union.",
    "DAVID MARTIN: Well, he started before the invasion threatening.",
    "So the United States has got to be absolutely clear about that.",
    "It's why it was created after World War II in the first place.",
    "REPRESENTATIVE JAMES CLYBURN (D-South Carolina): Good morning.",
    "I mean, he humiliated his intelligence director on television.",
    "We can- we can wait and see what Russia does, what China does.",
    "JILL SCHLESINGER: The sanctions will weigh on economic growth.",
    "Even China is now afraid of the world standing up to Russia.'",
    "I mean, Russia is baked into the UN Security Council charter.",
    "Let's talk to her about her rulings and about her philosophy.",
    "Congressman Clyburn joins us now from Santee, South Carolina.",
    "Or is there something more you think would make a difference?",
    "But, first, we begin with Charlie D'Agata in Kyiv -- Charlie.",
    "He didn't say nuclear, but that's what he was talking about.",
    "But, having said that, we all have our personal preferences.",
    "I think- I think Putin got a lot more than he bargained for.",
    "You heard the U.N. ambassador say that's not off the table.",
    "We have seen what Vladimir Putin is willing to do in Syria.",
    "But, in the final analysis, I think this was a good choice.",
    "And it's at risk now because obviously what Russia's doing.",
    "Until next week, for Face the Nation, I'm Margaret Brennan.",
    "MARGARET BRENNAN: Our Mark Strassmann reporting in Atlanta.",
    "Judge Brown Jackson went to Harvard, an elite institution.",
    "And this is demonstrative of another step in that pursuit.",
    "ANGELINA (Resident of Ukraine): You don't know what to do.",
    "America was founded on fundamental principles of freedom.",
    "And that just doesn't go away if he's able to seize Kyiv.",
    "GEN. MCMASTER: Yeah well, that's that's a sign, isn't it?",
    "Europe's impact will be more direct, but we will feel it.",
    "They can use the international system to their advantage.",
    "And is Xi Jinping the only person who can rein in Putin?",
    "PRESIDENT, WORLD BANK GROUP DAVID MALPASS: Hi, Margaret.",
    "And so whether those changes are made will be important.",
    "And so it's not clear how this is all going to play out.",
    "Listen, we have a critical race problem in this country.",
    "But we've seen an evolution in explaining their purpose.",
    "The president indicated that nothing was off the table.",
    "They are still about 20 miles from the capital of Kyiv.",
    "And those are facts that should stay in our classrooms.",
    "Voters perceive the party too focused on culture wars.\"",
    "And the call for a new type of international relations.",
    "And both said that Democrats need a course correction.",
    "I want to see us break as much new ground as possible.",
    "REPRESENTATIVE JAMES CLYBURN: This is beyond politics.",
    "We're going to talk about some of that ahead with H.R.",
    "Both sides have a reason to settle through diplomacy.",
    "So- doesn't that well, fundamentally cause a problem?",
    "And it has not been able to take a single major city.",
    "Do you think Ukrainians have a month to wait and see?",
    "Does that say he thinks maybe this is going too far?",
    "Their per capita income is has fallen below China's.",
    "MAN #3: This region is really open for the refugees.",
    "REPRESENTATIVE JAMES CLYBURN: It's more traditional.",
    "But you can't stand idly by and allow that to exist.",
    "When it's only one side imposing its will by force.",
    "OK, what about one third of that is combat troops.",
    "To resupply, I think, the Ukrainians with weapons.",
    "And I think that's- that's very important as well.",
    "He backs a war criminal who used chemical weapons.",
    "The U.S. and NATO starts to come to their defense.",
    "Is Vladimir Putin a rational actor at this point?",
    "GEN. MCMASTER: I mean, freedom's not easy, right?",
    "I mean, Iran's oil industry has been sanctioned.",
    "Do we see a spike in food prices and oil prices?",
    "This means that we will continue that tradition.",
    "And she raised the prospect of unsavory weapons.",
    "MARGARET BRENNAN: Christina Ruffini, thank you.",
    "Do you view what happened then differently now?",
    "MALPASS: --And Russia is a full player of that.",
    "So how are you going to negotiate within that?",
    "What does that tell you about how security is?",
    "What does that tell you about how security is?",
    "And they're doing a tremendous job, obviously.",
    "And now Ukrainians are fighting for all of us.",
    "AMBASSADOR LINDA THOMAS-GREENFIELD: I'm sorry?",
    "We will fight, even if Europe doesn't help us.",
    "What will it take to stop Russia's aggression?",
    "Good morning, and welcome to Face the Nation.",
    "MARGARET BRENNAN: Charlie D'Agata, stay safe.",
    "So there's- there's certainly more we can do.",
    "GEN. MCMASTER: Hey, good to see you Margaret.",
    "So-- and we're in a good position to do that.",
    "Now you divide it across four different axes.",
    "GEN. MCMASTER: Well, I don't think he has to.",
    "Thank you so much Liz Cheney for joining us.",
    "Do you agree that these things are problems?",
    "They're isolated here in the United Nations.",
    "and it is our plan to support their efforts.",
    "Twenty-five-year-old volunteer Aksonia (sp?)",
    "CBS' David Martin is here for more on that.",
    "As I said, we've made good progress so far.",
    "Where it's- it's conducive to decapitation.",
    "We'll have to see where that goes as well.",
    "I'd like to see the oil industry affected.",
    "MARGARET BRENNAN: A very dangerous moment.",
    "Military-aged men aren't allowed to leave.",
    "CHARLIE D'AGATA: Good morning, Margaret.",
    "It is all just ahead on Face the Nation.",
    "DAVID MARTIN: Well, it seems to be true.",
    "The Russians have basically bogged down.",
    "REP. LIZ CHENEY: Good morning, Margaret.",
    "And they are isolated in that approach.",
    "MARGARET BRENNAN: We go now to the U.S.",
    "MARGARET BRENNAN: I'm Margaret Brennan.",
    "Does help to Ukrainian people continue?",
    "MALPASS: We're doing everything we can.",
    "MARGARET BRENNAN: We'll watch for that.",
    "MALPASS: I'm not at all at that point.",
    "MARGARET BRENNAN: Thank you very much.",
    "MARGARET BRENNAN: We'll be right back.",
    "Good morning to you, Madam Ambassador.",
    "That sounds like a threat to the West.",
    "So the sanctions ought to go further.",
    "You know, America stands for freedom.",
    "GEN. MCMASTER: It's absolutely right.",
    "He won't be able to control Ukraine.",
    "McMaster, we'll be back in a moment.",
    "Is it less powerful because of that?",
    "I think what we have to look at it.",
    "I'm not sure this will go very far.",
    "Good morning to you, Congresswoman.",
    "My country is dying for all of us.",
    "He's in a very difficult position.",
    "We all have our reasonable biases.",
    "Thank you very much for having me.",
    "Does that affect how you see this?",
    "We did not enforce the subpoenas.",
    "Good morning to you, Congressman.",
    "(Begin VT)\nPROTESTER: Stop Putin!",
    "And you see that with Ukrainians.",
    "They've been having a hard time.",
    "We'll see what happens tomorrow.",
    "All of this adds to his problem.",
    "Can you tell us what that means?",
    "Do you regret your no vote then?",
    "I would have done more early on.",
    "is a Ukrainian living in Poland.",
    "There's no question about that.",
    "I think also important is Iran.",
    "And then also the sea as well.",
    "He doesn't look very powerful.",
    "I do think we need to do more.",
    "And it's turning into a siege.",
    "I don't think that is likely.",
    "LINDA THOMAS-GREENFIELD (U.S.",
    "And we got to stand up to it.",
    "MAN #1: You can't look away.",
    "Another reason for concern.",
    "We need to get that moving.",
    "My husband is still there.",
    "But now I know what to do.",
    "MALPASS: Yes, big concern.",
    "Diplomacy is capitulation.",
    "Good to see you in person.",
    "I mean, we have to do it.",
    "They have a vote in this.",
    "It's deeply traumatizing.",
    "WOMAN #2: We are afraid.",
    "It's also wrong morally.",
    "How do you explain that?",
    "Here's Mark Strassmann.",
    "That's it for us today.",
    "Thank you for watching.",
    "These are racial facts.",
    "So that is a concern.",
    "Let's have a debate.",
    "We'll be right back.",
    "He's driven by that.",
    "We'll be right back.",
    "Good morning to you.",
    "Good to be with you.",
    "So we're alone here.",
    "You are just scared.",
    "Here's her report.",
    "DAVID MARTIN: Yes.",
    "And that's all.",
    "And we know it.",
    "We don't know.",
    "Angelina (sp?)",
    "Take a listen.",
    "Stop the war!",
    "We're here.",
    "McMaster.",
    "McMaster.",
    "H.R.",
    "J.D."
  ]
}