{
  "id": 26459,
  "mediaId": 2603,
  "date": "2022-01-21",
  "headline": "I Killed My Southern Accent and a Piece of Myself With It",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cdda32af1bf37be5fb3f5dfeff1d5e5b.jpg",
  "link": "https://jezebel.com/getting-rid-of-southern-accent-1848387732",
  "mediaOutlet": "Jezebel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Becca Andrews",
  "authorUrl": "",
  "termIds": [
    13253,
    14310,
    14342,
    14349
  ],
  "sentences": [
    "I was also, in the way that a lot of disaffected teenagers are, ready to leave behind my tiny town in West Tennessee and start a new life in some far-off metropolis, in the sort of place that doesn’t require the name of the state to follow it for you to know its location.",
    "She describes her homecoming, her hopes “to close the distance between the me of now and the me of then.” I read that line on a bus that carried me across concrete bridges and toward ambitious structures of iron and glass, and yearned for similar catharsis.",
    "I was country enough to belong to Future Farmers of America, where I had a knack for judging cows, but I didn’t live on a proper farm—my parents settled us into a small house in a neighborhood behind the highway.",
    "I became a kind of homesick that led me to play old Friday Night Lights episodes in the background while folding laundry, put on the Highwomen record and dance around, singing with all the twang I’ve got left.",
    "After an episode ended, I stood before my bathroom mirror, practicing the characters’ spitfire cadence in an effort to speak like a “normal” white upper-middle-class girl with the world at her fingertips.",
    "On visits to West Tennessee, I would spend hours behind the wheel of their car, pushing my luck on the country roads where I learned to drive, staring at the cotton packed up and waiting in the fields.",
    "I swallowed pangs of sadness for having missed the days just before harvest when endless rows of fragile, browning stems balance their fluffy burdens, waiting to be relieved by gigantic cotton pickers.",
    "My grandmother, Carolyn, used to tell me, “Girl, don’t you forget where you come from.” Memories are corrupted by time and emotion, but this one remained etched in my mind with uncomfortable clarity.",
    "I dreamed of raising Black Angus cattle, like my Uncle Ted, scratching out a big vegetable bed, making a home on an acre or two of grass for barefoot children to run across until their soles itched.",
    "In that awkward space between teenager and adult, I decided that I hated my Southern accent, and the only thing to do was to rip my voice from my throat and replace it with something unremarkable.",
    "I tell you all of this because lineage is important in Southern families—it forms the base of our identities, and it is the context for the stories we tell ourselves and each other through time.",
    "Even in the West Tennessee classrooms of my youth, there was a sense that to succeed—whatever that means—it was important to speak with perfect grammar and without too much country inflection.",
    "When the phone rang, she answered with a throaty “mmmyyehllo?” My own voice reflected my family’s past and present—part Northern Mississippi, part Tennessee delta, all Southern as hell.",
    "These days, I feel like a radio operated by someone clumsily twisting the knob this way, then that, searching for a clear signal between who I sound like and the girl I used to be.",
    "When I visited UC Berkeley to decide whether to go to graduate school there, I let slip that I was from a small town in the South, and a girl asked me if anyone wears shoes there.",
    "I advised her to be more like me, and exorcise her signature Manchester, Tennessee accent, to shove it down far into herself and be molded by forces like capitalism and whiteness.",
    "The quick, unconscious retreat to the safety of the unaccent makes me feel like a fraud, someone who bends to accommodate the power structures she’s supposed to be challenging.",
    "My elongation of final consonants gave away my public school education, a rough-around-the-edges nature that I feared would disqualify me from being a lauded magazine writer.",
    "As my childhood receded, I began to realize that outside of our region, Southerners were often dismissed as uncultured and uneducated, ignorant and narrow-minded.",
    "I wanted to be someone worth hearing, and I thought I needed to shed my Southern-ness, the dead giveaway that I was unqualified for the life I desperately wanted.",
    "We are both fortunate that my effort to excise Emily’s accent was thwarted by her certainty in herself, but I was much more effective at weeding it out of myself.",
    "I’m trying to shrink back, not seem like the odd one in my tower of privilege, for fear I may be ejected from it much faster than I was able to climb up to it.",
    "And every time I spoke up in class or extended a fake-confident hand toward someone more cosmopolitan, I did it with the clearest enunciation I could muster.",
    "She was born and raised in the half-pony town of Pontotoc, Mississippi, the daughter of sharecroppers, known to me in family lore as Big Mama and Big Daddy.",
    "She was determined to work for the student newspaper, which is where I spent most of my waking hours, and she decided we should be friends, and so we were.",
    "The summer before I left for college, I lost weight and swapped my ratty pop-punk band T-shirts and worn jeans for the cheap fast-fashion at Forever 21.",
    "Over the years, my career started to fall into place—I moved up to be editor-in-chief of the student paper, and I got an internship with The Tennessean.",
    "I knew she cared about my opinion, and her admiration soothed my simmering insecurities, though not enough to prevent me from foisting them upon her.",
    "She studied me with her clear blue eyes while she let her appeal hang in the air, sometimes wrapping her gnarled, arthritic fingers around my hands.",
    "I lightened the eyeliner, wore twee jewelry that turned my skin green, pierced my nose, went to a beauty school to get a better haircut on a budget.",
    "It was advice that I lobbed at her throughout our college years, sometimes earnestly, more often by poking fun at her doubled-down vowel sounds.",
    "In Sarah Broom’s The Yellow House, she writes about her home, a New Orleans that is unseen by the tourists who mill about the French Quarter.",
    "If I was asked where I was from, I would say “near Memphis,” or if I was feeling bold, I would make a derisive jab at my country background.",
    "Slower, fuller vowels roll off my tongue when encouraged by an extra glass of whiskey, some great indignation, the sound of another’s drawl.",
    "I’m still searching for what it means to be Southern, but now I’m doing it with all the “y’alls” and the “reckons” I withheld for so long.",
    "Her first book, No Choice, about declining abortion access in the United States, is due out from Hachette Public Affairs in January 2023.",
    "Vance certainly did us no favors with his bestselling book, Hillbilly Elegy, and his bless-their-poor-lazy-racist-uneducated-hearts tone.",
    "I carefully studied the speech patterns of Emily, Lorelai, Rory, and Paris, trying to memorize the quips and the pop culture references.",
    "I belligerently declared often and loudly that I didn’t care about any of it, that I would soon be gone, and I would never look back.",
    "His parents fancied themselves city folks and did not approve of their son’s marriage to a country girl, but she never told me this.",
    "She survived the Depression, but for the rest of her adult life, she seemed haunted by the memories of what it was like to be poor.",
    "Early in our friendship, her mother asked where I was from, assuming it was somewhere up north; I beamed with pride at the mistake.",
    "I credited it to the hard work of draining all the blood from my former self and filling her instead with tasteless, benign water.",
    "I met Emily in college at Middle Tennessee State University, a school known for its affordability and its proximity to Nashville.",
    "In a photo I took that night, she’s frozen in time, her brow furrowed, literally clutching the string of pearls around her neck.",
    "After she married my granddaddy, David, a boy from 20 minutes away in Houlka, they settled in Tupelo to have their own family.",
    "Five months after I tried to mold Emily into Eliza, I left Tennessee for the Bay Area and declared myself done with the South.",
    "In mainstream popular culture, white Southerners of a lower class were reduced to hicks, to the delight of elite tastemakers.",
    "I called my folks more often to demand that they promise that I will never be lost to them, no matter my liberal politics.",
    "She was—and still is—always good for a tube of lipstick or a Steel Magnolias reference or a vat of homemade mac n’ cheese.",
    "When we talk, I cannot imagine anything that fits her more perfectly than the sound of her voice as it has always been.",
    "No “y’alls,” no “ain’ts.” Our teachers were reacting to a very real judgement that came from a “professional” ideal.",
    "During my senior year, I took it upon myself to “help” Emily prepare for a broadcast she had to deliver for a class.",
    "“You did have a fuck-it, two-tears-in-a-bucket attitude,” Emily recalled later, a bemused expression on her face.",
    "The Dukes of Hazzard, The Beverly Hillbillies, Forrest Gump, Kenneth from 30 Rock, Duck Dynasty, Honey Boo Boo.",
    "I told her I was sorry, and I’ve told her that many times since, and I suspect I will tell her many times more.",
    "It was a bit, it was our bit, I insisted to myself, taking that pained look on her face as part of the schtick.",
    "I became less enamored with my roots, growing into one of those adolescents who didn’t quite fit anywhere.",
    "But if my old self escapes from my lips in my new life, those syllables flatten back out minutes later.",
    "I told her that it took me too long to realize that she was right to hold onto her Southern identity.",
    "There was no sound I loved more than my grandmother’s accent; thick, sweet, warm, unencumbered.",
    "My voice screamed out my class status and everything I was trying to leave behind, I thought.",
    "I would be the Henry Higgins to her Eliza Doolittle, never mind that I, too, was an Eliza.",
    "She tries to bite off the extra syllable, but it lingers, a thready pull of thick caramel.",
    "Like a girl who refused to heed her grandmother’s warning and forgot where she comes from.",
    "My accent was a symbol of everything I thought I hated about my life in the rural South.",
    "Once, every step I walked from the BART station to the office seemed victorious to me.",
    "But in recent years, I gradually began to realize that I no longer wanted to pretend.",
    "I learned of it after she died, and now I wonder if that’s the origin of her command.",
    "I am ashamed of it, but I am more ashamed I tried to kill that part of someone else.",
    "Her work has been featured in Mother Jones, Slate, and Marie Claire, among others.",
    "My voice screamed out my class status—there was enough; there was not any extra.",
    "Now that I am grown, now that I have left the South, it is important to me, too.",
    "My grandmother is the foundation for what I understand a Southern Woman to be.",
    "The process of eliminating my accent began in high school with Gilmore Girls.",
    "To have more than just enough, I thought I would have to talk less country.",
    "Eventually, I was successful at breaking down my tongue and rebuilding it.",
    "I had developed a new voice, and the ability to code switch along with it.",
    "Now, I see that it was more about justifying what I had done to myself.",
    "She said exactly what she meant, always at a slow, deliberate cadence.",
    "I started to hope that I could reclaim and resurrect a part of myself.",
    "I told myself I was helping her achieve her dream of working for NPR.",
    "I never gave a shit about cotton when I lived in Crockett County.",
    "My dad has said you can feel the call to home deep in your bones.",
    "This was before Dolly Parton had been anointed to sainthood.",
    "Becca Andrews is a writer living in Nashville, Tennessee.",
    "It wasn’t just my voice that needed to be recorded over.",
    "(Which, statistically speaking, is not normal at all.)",
    "Before that, as a child, I found pride in my identity.",
    "I forced a laugh, but embarrassment soured my stomach.",
    "Her lips are pursed, concentrating on pronunciation.",
    "It was not fun for her, and deep down, I knew it.",
    "Then, it became impossible to stop looking back.",
    "I couldn’t tell her that I wanted to forget.",
    "My conflation of vowels connoted ignorance.",
    "I wonder what it would be like to be whole.",
    "Exasperated, she tosses aside her glasses.",
    "“Ahye,” Emily responds, helplessly.",
    "She, unlike me, embraced her roots.",
    "It went on like this for an hour.",
    "There was reason to why I did it.",
    "So, I killed a piece of myself.",
    "I know exactly what he means.",
    "So, I decided to move back.",
    "Emily is two years younger.",
    "“Lahyke,” Emily responds.",
    "It bleeds into real life.",
    "I often laughed her off.",
    "Now I want it all back.",
    "It’s a protective move.",
    "“I,” I say, firmly.",
    "“Like,” I say.",
    "She grimaces.",
    "Don’t forget.",
    "J.D."
  ]
}