{
  "id": 26450,
  "mediaId": 2716,
  "date": "2022-01-28",
  "headline": "Can populist conservatives and liberals form an uneasy alliance over Ukraine?",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1643331942/right left ukraine.jpg",
  "link": "https://theweek.com/politics/1009505/can-liberals-ally-with-tucker-carlson-in-a-post-jan-6-world",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "W. James Antle III",
  "authorUrl": "https://theweek.com/authors/w-james-antle-iii",
  "termIds": [
    13757,
    13893,
    13997,
    14172,
    13312,
    14332,
    14355
  ],
  "sentences": [
    "When Sen. Rand Paul (R-Ky.), the type of libertarian-leaning conservative one can usually count on to balk at foreign military adventures, wrote that \"Ukraine should not and cannot be our problem to solve,\" Rep. Matt Gaetz (R-Fla.) tweeted simply, \"Agree!\"",
    "Trump vetoed it, but top allies like Rep. Jim Jordan (R-Ohio) and then-Rep. Mark Meadows (R-N.C.), his final White House chief of staff, voted with Congress' leading progressives to advance the measure.",
    "Vance tweeted, \"Billions spent on the Kennedy School, grand strategies seminars, and the Georgetown School of Foreign Service has bought us an elite that's about to blunder us into a Ukraine war.\"",
    "But that could also make it harder to have the kind of left-right coalition that existed at the margins of the Iraq war debate and passed a resolution to stop U.S. involvement in the war in Yemen.",
    "Liberal attitudes about Russia hardened after the Kremlin's election interference in 2016, though the most extreme reactions to this meddling were practically in \"stop the steal\" territory.",
    "They may, for that reason, be able to reach the GOP rank-and-file in a way the party's intervention skeptics have sometimes struggled to do in the past.",
    "Not one American soldier should die there, and not one American bullet should be fired there,\" said Rep. Paul Gosar, a controversial Arizona Republican.",
    "On his nightly Fox News show, Tucker Carlson regularly demands an explanation of what vital U.S. interest is served by intervening in the conflict.",
    "These Republicans and their allies tend to be close to former President Trump, or at least his attempted redefinition of the party's priorities.",
    "Progressives never liked Trump, and they like Republicans who continue to defend \"the former guy\" after the Jan. 6 Capitol riot even less.",
    "The loudest voices warning against American military involvement if Russia invades Ukraine belong to populist conservatives.",
    "The U.S. probably won't end up at war over Russia-Ukraine this time around, though escalation begets more escalation.",
    "\"We need to stop calling this 'isolationism,'\" liberal Washington Post blogger Greg Sargent wrote.",
    "Could populists and progressives work together to stop it?",
    "Hillbilly Elegy author and Ohio GOP Senate candidate J.D.",
    "\"Tucker is pulling the GOP base toward Putinism.\"",
    "If Ukraine joined NATO, the risk would increase.",
    "\"We have no dog in the Ukraine fight.",
    "Early results aren't encouraging."
  ]
}