{
  "id": 26468,
  "mediaId": 2694,
  "date": "2022-01-28",
  "headline": "Smart Men Acting Stupid",
  "image": "https://cdn.theatlantic.com/thumbor/oCJACdrCIVkpolsBEVFMz9tPoLs=/0x43:2000x1085/1200x625/media/img/mt/2022/01/Atl_sm_d_v2/original.png",
  "link": "https://www.theatlantic.com/ideas/archive/2022/01/republican-party-trump-vance-greitens-jindal/621388/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David A. Graham",
  "authorUrl": "https://www.theatlantic.com/author/david-a-graham/",
  "termIds": [
    13476,
    13564,
    13592,
    13615,
    13702,
    13746,
    14054,
    13212,
    13311,
    13312
  ],
  "sentences": [
    "We have to stop dumbing down our ideas and stop reducing everything to mindless slogans and taglines for 30-second ads.”\nEven in the pre-Trump GOP, this was a bracing message, but Jindal was the person to make it: Known for his wonkish mien, Jindal had graduated from Brown at 20, scored a Rhodes Scholarship, become the youngest president of the University of Louisiana system, and then won the governorship.",
    "The more likely scenario is the one that the conservative journalist Jonathan V. Last lays out: “You’re not supposed to remember this, but DeSantis is a smarty-pants, Ivy League elite lawyer who is playacting as a populist crusader … DeSantis almost certainly got the booster.” In short, he wants to claim the anti-vax mantle without foolishly endangering himself.",
    "Jindal’s speech is unthinkable today, not only because the Republican Party has moved in an even more decisively anti-intellectual direction, but also because the kinds of politicians who resemble Jindal—brainy, ambitious ones with Ivy League résumés—are pursuing the opposite course of action.",
    "The prime offenders include Florida Governor Ron DeSantis (Yale College, magna cum laude; Harvard Law, cum laude), U.S. Senate hopeful Eric Greitens of Missouri (Duke, full scholarship; Rhodes Scholar), and U.S. Senate candidate J. D. Vance of Ohio (Ohio State, summa cum laude; Yale Law).",
    "What these politicians have in common is that though they’ve given every indication they’re smart in the past, now—in their best attempt to succeed in the Trump-era Republican Party—they are masquerading as what they imagine voters want, with results that ring almost comically false.",
    "In 2013, Bobby Jindal, then the governor of Louisiana and a presidential hopeful, delivered some tough love to the Republican National Committee: “We must stop being the stupid party.” Specifically, he continued, “we must stop insulting the intelligence of voters.",
    "We’re going to win this thing and take the country back from the scumbags.” (Vance’s leading GOP rival, Cleveland-raised Josh Mandel, delivers plenty of cringe himself, including adopting the worst faux-southern drawl since Hillary Clinton left the trail.)",
    "Vance has a kindred spirit in Missouri, where Eric Greitens is seeking a political comeback after being forced to resign in a bizarre scandal in which (among other violations) he allegedly blackmailed a woman with whom he was having an affair.",
    "He gave talks with titles such as “The Culture of Character: Building Strength Through Study and Service.”\nIt’s hard to maintain that image when you’ve resigned in a sordid sex scandal, so Greitens is now campaigning as a Trump acolyte.",
    "To see a different vision of how an academically inclined Republican tries to make a way in the post-Trump party, look to Greitens’s fellow Missourian Senator Josh Hawley (Stanford; Yale Law; Supreme Court clerkship under John Roberts).",
    "DeSantis is apparently going through these contortions because he is positioning himself for a 2024 presidential run—which would put him in conflict with former President Donald Trump, who sees the GOP nomination as rightfully his own.",
    "A second is that he has no personal objection to the vaccine but has decided to forgo the booster nonetheless, because he understands the anti-vax mood in the noisiest parts of the Republican base, and he wants to claim that mantle.",
    "When J. D. Vance became nationally famous, it was as the brainy and accomplished author of Hillbilly Elegy, an up-by-the-bootstraps critique of rural white America that was decidedly conservative, analytical, and thoughtful.",
    "One possibility is that since getting his first shot, DeSantis has become fervently, genuinely anti-vaccine, which would be pretty silly, because evidence is only mounting that the vaccines are both effective and safe.",
    "“Because they had the vaccine and they’re answering like—in other words, the answer is ‘yes,’ but they don’t want to say it, because they’re gutless.”\nThis is a classic Trump attack: petty, entertaining, and authentic.",
    "He’s become a regular on Steve Bannon’s podcast, pals around with Rudy Giuliani and Michael Flynn, endorsed the sham Arizona election “audit,” and claims to subscribe to other debunked theories about the 2020 election.",
    "We need Alec Baldwin tweets.” He referred to LeBron James, perhaps the greatest living Ohioan, as “one of the most vile public figures in our country.” He gives mealy half answers about anthropogenic climate change.",
    "These days, as a candidate for an open Senate seat, Vance has moved closer to Trump’s politics and is more likely to blame rural decay on China and free trade than on the decline of family values and hard work.",
    "He drew heavy criticism in October, when, after the actor Alec Baldwin accidentally shot and killed a cinematographer on a film set, Vance tweeted to then–Twitter CEO Jack Dorsey, “Dear @jack let Trump back on.",
    "His most loyal supporters back him because of, not despite, his brash behavior.”\nAnd though Trump is incorrigibly dishonest, he doesn’t have to pretend to be something other than what he is to win over voters.",
    "“If you guys want a gun show, maybe we can do it, but probably better off not”) but he did disclose that he’d gotten it, and then criticized the FDA for pausing distribution of J&J later that month.",
    "(Vance can be surprisingly unguarded about what he’s doing: “If I actually care about these people and the things I say I care about, I need to just suck it up and support him,” he added.)",
    "“I just thought that this guy was not serious and was not going to be able to really make progress on the issues I cared about.” So Vance has set out to make himself equally unserious.",
    "In a March 2021 interview with Hugh Hewitt, who was skeptical of his Senate candidacy, Greitens repeated the same flimsy phrases over and over, coming off as a Missouri Miliband.",
    "He refuses to reject Trumpian stolen-election claims and offers red herrings about donors who stepped up when states wouldn’t fund boards of elections to adapt to the pandemic.",
    "Last April, when vaccines were new and not nearly so politically polarized, the governor got the Johnson & Johnson shot, reportedly because he preferred a single shot to two.",
    "In attempting to succeed in the Trump-era Republican Party, some politicians are masquerading as what they imagine voters want, with results that ring almost comically false.",
    "On Tuesday, after nabbing an endorsement from Representative Marjorie Taylor Greene of Georgia and infamy, Vance tweeted, “Honored to have Marjorie’s endorsement.",
    "His résumé—not just the Ivy League, but the Marine Corps and stints in a white-shoe law firm and venture capital—made him seem like the opposite of Donald Trump.",
    "But in his haste to run away from his past critiques of Trump, Vance has become a knee-jerk caricature of the kind of know-nothing bumpkin he once skewered.",
    "Trump, who has taken a pro-vaccine stance (the shots were mostly developed under his administration), quickly fired a shot across DeSantis’s bow.",
    "He doesn’t have to cater to voters, because his voters like both what he says and the way he says it—those are, in a sense, one and the same.",
    "In addition to his formal education, he’d been awarded a Purple Heart in the Navy, written several books, and served as a White House fellow.",
    "Vaccines are one of the few issues on which Trump and his base have serious differences, and Trump has stuck to his stance despite backlash.",
    "If they had come sincerely to the positions they’ve taken, they would be wrong, but because they seem disingenuous, they are also pathetic.",
    "I think it's important for us to be real people.”\nOhioans have to choose whether this is the sort of attitude they want in a U.S. senator.",
    "Smart people make bad calls all the time, moreover, as David Halberstam indelibly noted, and stupid ones stumble into good decisions.",
    "Of course attending fancy schools does not necessarily make someone smart, nor do the well educated have a monopoly on intelligence.",
    "That’s a valid ideological shift, and it may even be sincere: Many people have rethought their politics over the past half decade.",
    "Last week, in an interview with Spectrum News, he dismissed concerns about his coarse remarks, including the Alec Baldwin tweet.",
    "“I watched a couple politicians be interviewed, and one of the questions was ‘Did you get a booster?’” he said.",
    "Hawley doesn’t lack for cynicism, as his embrace of Trump’s effort to overturn the 2020 election demonstrated.",
    "He didn’t get jabbed in public (“I’m not sure we’re going to do it on camera; we’ll see,” he told reporters.",
    "When Trump said in 2016, “I love the poorly educated,” he was perhaps overly blunt, but he wasn’t fibbing.",
    "“Unfortunately, our country’s kind of a joke, and we should be able to tell jokes about it,” he said.",
    "For most of his life, he was a Democrat, before switching parties just ahead of running in Missouri.",
    "But Hawley has tried to use his intellectual reputation to forge a sort of thinking man’s Trumpism.",
    "That’s almost certainly a contradiction in terms, but the attempt at least fits his personality.",
    "“So that’s something that I think people should make their own decisions on,” he said last week.",
    "And indeed, when Trump came to prominence, Vance was among his harshest conservative critics.",
    "The other prominent offenders are not rivals to Trump but those seeking his affection.",
    "The imitators, however, do not have his common touch, so instead they try to ape it.",
    "Admirers likened him to a Boy Scout, and even his critics agreed he was very smart.",
    "As for Vance, he has to choose whether he wants to be a real person—or a joke.",
    "“I sort of got Trump’s issues from the beginning,” Vance told Time last year.",
    "Now, however, DeSantis won’t even say whether he’s received a booster shot.",
    "“I think it’s important for our politicians to have a sense of humor.",
    "Like Vance, Greitens built his appeal on his impressive background.",
    "“I’m not gonna let that be a weapon for people to be able to use.",
    "But most of the time, Trump and his supporters are in lockstep.",
    "This is the age of smart politicians pretending to be stupid.",
    "Some of his former mentors are appalled by his actions.",
    "I think it’s a private matter.”\nWhat’s going on here?",
    "We need to trust the smarts of the American people.",
    "Their pantomime comes across as condescending.",
    "Trump’s style is part of his substance.",
    "As Jindal himself wrote in 2018, “Mr.",
    "Contrast that with Vance.",
    "Start with DeSantis."
  ]
}