{
  "id": 26478,
  "mediaId": 2658,
  "date": "2022-01-10",
  "headline": "Johnson, Thune fill out Senate puzzle",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/01/10/johnson-thune-fill-out-senate-puzzle-799776",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Johnson",
  "authorUrl": "https://www.politico.com/staff/stephanie-murray",
  "termIds": [
    13579,
    13598,
    13790,
    13803,
    13890,
    13897,
    14057,
    14168,
    13372
  ],
  "sentences": [
    "“Arizona GOP Senate candidate Blake Masters last month raised $550,000 in 36 hours when he auctioned off digital tokens depicting the cover of a book he wrote with tech investor and GOP megadonor Peter Thiel,” Sam noted, and tech executive Shrina Kurani, a Democrat running against GOP Rep. Ken Calvert in CA-41, “raised $6,600 in 72 hours late last year by selling 21 NFTs containing her crypto policy agenda.”\nTHE PROCESS — The founder of the Cyber Ninjas firm that ran an “audit” of Arizona’s 2020 election intends to close the firm and launch a new one with some of the same employees, The Associated Press’ Jonathan Cooper reported.",
    "Johnson said in November that he wanted lawmakers to “take over elections and tell local officials to ignore the work of the elections commission.”\nTHE MAP LINES — The Southern Poverty Law Center is challenging Georgia’s new congressional map in court, along with Georgia voters and voting rights groups.",
    "Days until the FL-20 special election: 1\nDays until the Texas primary: 50\nDays until the CA-22 special election primary: 87\nDays until the Indiana and Ohio primaries: 113\nDays until the general election: 302\nDays until the 2024 election: 1,030\nWant to receive this newsletter every weekday?",
    "The state Democratic party claimed to the FEC that Oz, the celebrity surgeon, is “overtly capitalizing off commercial brands and resources to obtain an unfair advantage” by using his TV show logo, the show’s website and business social media accounts for his campaign.",
    "The lawsuit claims claims GA-06, GA-13 and GA-14 “violate the Constitution and unlawfully diminish the voting power of voters of color.” The case alleges that the new map violates the 14th Amendment by intentionally denying representation to Black voters.",
    "The senator’s job approval rating rose over the course of 2021 — 67 percent of South Dakota Republicans approved of Thune in the first quarter of the year, and 80 percent approved in the fourth quarter, according to Morning Consult’s Eli Yokley.",
    "Down the Ballot\nFIRST IN SCORE: POLL POSITION — Mandel had 26 percent of support from likely GOP Senate primary voters, according to a new WPA Intelligence poll commissioned by the Club for Growth PAC (the Club endorsed Mandel last year).",
    "— When President Joe Biden speaks in Georgia on Tuesday, he will “expand on his endorsement of a filibuster carveout to pass voting rights legislation in the Senate,” POLITICO’s Laura Barrón-López and Christopher Cadelago reported.",
    "BALLOT BATTLE — Wisconsin state Assembly Speaker Robin Vos, a Republican, said there is “zero chance” the state legislature will take over awarding presidential elector votes in 2024, The Associated Press’ Scott Bauer wrote.",
    "THE KEYSTONE STATE — Pennsylvania Democrats filed complaints against GOP Senate hopefuls Mehmet Oz and David McCormick, alleging the candidates are violating election laws, City & State Pennsylvania’s Justin Sweitzer wrote.",
    "The new poll comes days after Timken’s campaign released an internal poll showing her with 16 percent of support, two percentage points behind Mandel who had 18 percent of support among GOP primary voters.",
    "The party also questioned whether McCormick, a former hedge fund executive, should have to register as a candidate after spending $2 million on TV ads as part of his exploratory Senate campaign.",
    "Speaking of Democrats, the DSCC quickly released a new digital ad highlighting “how Johnson is looking out for himself and his rich political donors” at the expense of his constituents.",
    "Thune, the Senate minority whip and a key ally of Senate Minority Leader Mitch McConnell, drew Trump’s ire in the wake of the 2020 election because he refused to object to the results.",
    "If you’re a Weekly Score subscriber, this quick programming note: We’ll next be in your inbox on Tuesday, Jan. 18 — one day later than usual due to Martin Luther King, Jr. Day.",
    "Johnson, Thune fill out Senate puzzle\nBy STEPHANIE MURRAY\n01/10/2022 10:00 AM EST\nQuick Fix\n— This year’s Senate landscape became more defined over the weekend, when Sens.",
    "— New York Democrat Josh Riley raised over $416,000 in the first two months of his campaign against Rep. Claudia Tenney (R-N.Y.), The Post-Standard’s Mark Weiner wrote.",
    "Cyber Ninjas was recently held in contempt of court for failing to produce documents related to its partisan election review, and ordered to pay $50,000 a day in fines.",
    "— Washington Republican Tiffany Smiley raised nearly $925,000 in the fourth quarter for her bid against Sen. Patty Murray (D-Wash.), Fox News’ Paul Steinhauser wrote.",
    "GETTING IN — Pennsylvania state Sen. Doug Mastriano launched his Republican primary campaign for governor, the Pittsburgh Post-Gazette’s Charles Thompson reported.",
    "“It was clear to me that they were not going to move, ever, and so at that point, let's move onto the court and not waste everybody's time,” DeWine said.",
    "Follow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "— Rep. Tom Malinowski (D-N.J.) raised $900,000 in the fourth quarter and had $2.7 million in cash on hand, the New Jersey Globe’s David Wildstein wrote.",
    "— Sen. Maggie Hassan (D-N.H.) raised $3.1 million in the fourth quarter of the year and had $5.3 million in cash on hand, WMUR’s John DiStaso reported.",
    "DeWine was a member of the state’s redistricting commission, and said negotiations between Democrats and Republicans came to a standstill in September.",
    "CRYPTO, CURRENTLY — Congressional candidates and political PACs are auctioning off NFTs, capitalizing on the crypto boom, POLITICO’s Sam Sutton wrote.",
    "— Former Ohio state Treasurer Josh Mandel is still leading the race for the GOP Senate nomination, according to a new poll shared with Morning Score.",
    "Mandela Barnes, state Treasurer Sarah Godlewski, Outagamie County Executive Tom Nelson and Alex Lasry, senior vice president of the Milwaukee Bucks.",
    "THE CASH DASH — Kelly raised nearly $9 million and had $18.5 million in cash on hand at the end of the fourth quarter, according to his campaign.",
    "— Minnesota Republican Kendall Qualls launched a campaign for governor on “Fox & Friends Weekend” on Sunday, Fox News’ Bailee Hill wrote.",
    "The survey found Jane Timken, the former state GOP chair, with 15 percent of support and investment banker Mike Gibbons with 14 percent.",
    "Meanwhile in South Dakota, Thune said he will seek a fourth term, the Sioux Falls Argus Leader’s Jonathan Ellis and Joe Sneve reported.",
    "Rep. Lee Zeldin (R-N.Y.), Andrew Giuliani and former Westchester County Executive Rob Astorino are already running in the GOP primary.",
    "NOTABLE FLOATABLES — New York Republican Harry Wilson is considering running for governor, the New York Post’s Carl Campanile wrote.",
    "Abbott held his event in McAllen, while Democratic challenger former Rep. Beto O’Rourke (D-Texas) held a campaign stop in El Paso.",
    "Much as I’d like to ease into a quiet retirement, I don’t feel I should,” Johnson wrote in a Wall Street Journal op-ed on Sunday.",
    "— Sen. Mark Kelly (D-Ariz.) raised nearly $9 million for his reelection bid, plus more fourth-quarter campaign fundraising hauls.",
    "Vance was in fourth place with 10 percent, according to the poll, which surveyed 513 likely GOP primary voters from Jan. 3-6.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Republican Don Bolduc is also running against Hassan, and a number of other candidates are considering entering the race.",
    "Rebecca Kleefisch raised $3.3 million since she launched her gubernatorial campaign, The Hill’s Julia Manchester wrote.",
    "The state Supreme Court recently heard arguments for and against the new maps and is expected to reach decisions soon.",
    "Johnson’s decision to run in Wisconsin is a reversal from his 2016 pledge to retire, rather than seek a third term.",
    "Top Line\nRETIREMENT WATCH — Barring any unexpected exits, this cycle’s Senate retirement watch is officially over.",
    "Johnson is expected to have the backing of former President Donald Trump, who encouraged him to run last April.",
    "Vos said he is against dissolving the state elections commission, or changing how the bipartisan body operates.",
    "Vice President Kamala Harris will also visit the state, where Republicans have passed new voting restrictions.",
    "Morse, a Republican, plans to file with the FEC on Wednesday and formally launch a campaign later this month.",
    "— Ohio’s new political maps are in court because partisanship derailed the redistricting process, GOP Gov.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "— New Hampshire state Senate President Chuck Morse will run against Hassan, WMUR’s John DiStaso wrote.",
    "The poll from Timken’s campaign showed Gibbons with 14 percent of support and Vance with 8 percent.",
    "Greg Abbott officially launched his reelection campaign, Texas Tribune’s Patrick Svitek wrote.",
    "Johnson of Wisconsin and Thune of South Dakota, both Republicans, will each seek another term.",
    "It’s not clear if founder Doug Logan plans to perform the same type of work with a new firm.",
    "Thune is “uniquely positioned” to serve South Dakota, he said in a statement on Saturday.",
    "Wilson is chair and CEO of the MAEVA Group, and lost a 2010 race for state comptroller.",
    "The chamber’s final holdouts announced they would run for reelection over the weekend.",
    "A dozen Democrats are running in a crowded primary for the chance to take on Johnson.",
    "Phil Murphy, on whether he’ll run for president, via the Newark Star-Ledger.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Email me at smurray@politico.com and follow me on Twitter @stephanie_murr.",
    "Qualls is the president of the nonprofit TakeCharge and an Army veteran.",
    "So far, no prominent GOP primary challenger has emerged against Thune.",
    "The Moore Information Group poll conducted 1,000 interviews on Jan. 3.",
    "Their decisions come as the GOP heads into a favorable midterm cycle.",
    "The pair were the final lawmakers to announce their 2022 intentions.",
    "Johnson beat Democrat Russ Feingold by 3 percentage points in 2016.",
    "Qualls jumped into a crowded GOP primary to take on Democratic Gov.",
    "Morse hired GOP operative Dave Carney as general consultant.",
    "Mastriano joins a crowded field to replace term-limited Gov.",
    "Kleefisch, a Republican, is running against Democratic Gov.",
    "Mike DeWine told The Cincinnati Enquirer’s Jessie Balmert.",
    "Qualls lost to Rep. Dean Phillips (D-Minn.) in 2020.",
    "and Ron Johnson (R-Wis.) will run for reelection.",
    "Year-end reports are due to the FEC on Jan. 31.",
    "The fourth quarter encompasses Oct. 1-Dec. 31.",
    "EVERYTHING’S BIGGER IN TEXAS — Texas GOP Gov.",
    "CODA — QUOTE OF THE DAY — “I’m not running.",
    "Jesus, lord, help me.” — New Jersey Gov.",
    "Smiley had $1.7 million in cash on hand.",
    "Author and venture capitalist J.D.",
    "“I believe America is in peril.",
    "The field includes Lt. Gov.",
    "— Former Wisconsin Lt. Gov.",
    "Subscribe to POLITICO Pro.",
    "LANDMARK LEGISLATION?",
    "Good Monday morning.",
    "John Thune (R-S.D.)",
    "I’m not running.",
    "Tony Evers.",
    "Tom Wolf.",
    "Tim Walz."
  ]
}