{
  "id": 26488,
  "mediaId": 2590,
  "date": "2022-02-03",
  "headline": "Josh Mandel May Be Trolling The GOP. He Could Be Ohio's Next Senator.",
  "image": "https://img.huffingtonpost.com/asset/61fae3ac270000bf034573a1.jpg?cache=uG4dbOxF0m&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/josh-mandel-ohio-senate-race-gop_n_61f56119e4b0061af25f7206",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    13728,
    13764,
    14045,
    13197,
    13312,
    13372,
    14243,
    14308,
    14317,
    14352
  ],
  "sentences": [
    "In a speech delivered at dozens of evangelical churches, Mandel describes himself as being the descendent of Holocaust survivors who were saved during the war by “courageous Christians.” It’s usually at this point when Mandel — who was once accused of running a subtly racist attack ad against a Black opponent that linked him to a mosque — declares that “Judeo-Christian” values are the nation’s bedrock and pledges to go to Washington with the “Constitution in one hand, the Bible in the other.”\nAs a Senate candidate in 2012, Josh Mandel campaigned in Ohio with then-presidential candidate Mitt Romney.",
    "but “worse.” A longtime GOP operative thinks “the ambition has consumed” Mandel and said watching Ohio’s GOP primary unfold makes him “want to vomit.” Another Republican, who has known Mandel for decades and is secretly rooting for one of his opponents, said it’s “mind blowing” that Mandel has somehow managed to get support from both the Jewish and evangelical Christian communities, which tend to both support Israel.",
    "He’s an embarrassment to his family and his community.”\nIn 2012, during his first Senate run against Sherrod Brown — the only Democrat besides judges who has won statewide in Ohio since President Barack Obama — members of the prominent and (and liberal) Jewish family that Mandel married into published an open letter in The Washington Post after Mandel said in a debate he didn’t support marriage equality.",
    "While Mandel’s critics say he didn’t get much done as a state lawmaker, Mandel said he fought Common Core education standards that “ended up setting the table for all this critical race theory and transgender baloney.”\nIt was also as a state representative that Mandel said he got to know Christian pastors during the introduction of the first anti-abortion fetal heartbeat bill.",
    "Ted Cruz (R-Texas) and Hawley in the far-right corner of the Senate, alongside lawmakers who objected to certifying the 2020 election and who could do it again in 2024.\nPepper said the man who, as a young city councilman and state treasurer, boasted about wearing out his shoes campaigning door-to-door would have no problem now objecting in Congress to a fair election.",
    "Advertisement\nI kept hearing the same things: that Mandel, a former golden child of the GOP, used to be perceived as more moderate before evolving into a staunch conservative and then veering hard right as a Trump acolyte; that he’s obsessively hardworking and ambitious; that he scares and embarrasses some members of his own party.",
    "To better understand Mandel’s political evolution, I interviewed more than a dozen political insiders and personal contacts of Mandel’s, going back to when he was student government president at Ohio State University in the late 1990s through his last campaign for Senate in 2018, which was cut short after he abruptly dropped out.",
    "“I am scared as a woman, as a Black person, as a daughter who has a mother who lives off of a monthly pension, of getting this guy anywhere near a seat of power in the United States Senate,” Harper said during a recent debate with Mandel, who that same night had argued there should be no separation of church and state.",
    "Mandel apparently took issue with me, a local newspaper reporter with all of 3,000 Twitter followers, tweeting the observation that DeWine’s vaccine lottery was a good political move in light of the fact that Ohio had one of the lowest vaccination rates in the country at that point.",
    "Advertisement\nEverything that followed Mandel’s OSU graduation seemed designed to propel a political career: earning a law degree from Case Western University, joining the Marines and serving two tours in Iraq, and running for a seat on the Lyndhurst City Council in his 20s.",
    "But they are oftentimes a reflection of the candidate’s value set.”\n- Kevin Boyce, who lost his job as Ohio treasurer to Josh Mandel\nMandel wasn’t able to pull off the same feat when he ran against Sherrod Brown, the rumpled union-boosting Democratic senator, in 2012.",
    "Among his challengers — which include a famous author, an investment banker, a luxury car dealer, a former state GOP chair and a state senator — Mandel is the only candidate who has won statewide, which is assumed to be what’s giving him an edge.",
    "Bibles over Biden.”\nLast year, Mandel filmed himself lighting up a face mask with the caption “Freedom.” Then he posted a photo with a waitress whom he praised for reportedly showing up to work sick, and he doubled down after massive blowback.",
    "When Mandel, facing a likely rematch against Brown in 2018, suddenly dropped out of the race, rumors swirled that Mandel was trying to head off another big loss — or that he was trying to hide something that was potentially career-endangering.",
    "All immigrants are “illegals,” all Black Lives Matter activists are “thugs,” all non-Trump-loving Republicans are “RINOs” (Republican in Name Only, the worst GOP-on-GOP burn), all Democrats are “socialists” trying to destroy the country.",
    "Even in an age when experience isn’t considered a political qualification, Mandel still talks about how he launched an online portal for financial transparency and was the first treasurer in the nation to accept tax payments in Bitcoin.",
    "Mandel’s campaign launched an attack ad that Democrats blasted as fearmongering toward a Black opponent, using language that attempted to connect Boyce, a Christian, with a mosque where one of his deputies reportedly advertised a job.",
    "“He did not come up through the ranks being a bomb-throwing, provocative divider.”\nMorgan Harper, a progressive underdog running for the Democratic nomination opposite Mandel, summed up the impression he tends to leave on Democrats.",
    "Repeatedly during the debate, Mandel argued the Democratic Party “condescends” to people of color like Harper and insisted, puzzlingly, that her opponent, Rep. Tim Ryan, would have been happy to debate her if she were a white male.",
    "He did not come up through the ranks being a bomb-throwing, provocative divider.”\n- A former county Republican Party chair in Ohio\nDemocrats especially have good reason to be worried — because whatever Mandel is doing is working.",
    "I had probably had a total of three one-on-one conversations with Mandel when he stunned me at a GOP convention in Strongsville, Ohio, last May by singling me out in front of a crowd of at least 500 die-hard Republicans.",
    "After the announcement, Mandel slid out of public view for the remainder of his treasurer’s term, joined some corporate boards and got quietly divorced, then reemerged as the first Republican to jump in the Senate race.",
    "Boyce told HuffPost that Mandel later called to apologize about the ad (I talked to a few people who had been burned by Mandel who said he later reached out seeking to make amends) and they had a smooth transition.",
    "“I’ve watched his performance over the past few years, and it’s a very different guy than the guy I briefly met over the phone,” said Kander, who was Missouri secretary of state when Mandel was Ohio treasurer.",
    "In the same conversation, Mandel said Ryan, the likely Democratic nominee, has “small hands like marshmallows.” When I asked Mandel how he came up with that, he said Ryan “is the antithesis of a fighter.",
    "And in what’s looking more and more like a red wave election year, whoever wins the GOP nomination is well-positioned to win the general election in a state Trump carried twice by 8 percentage points.",
    "“Many of these people who have been involved [in politics] a long time, they’re realizing that Josh is a phony,” said Ralph King, a former “tea party” organizer and Trump delegate from northeast Ohio.",
    "Born into a Jewish family from suburban Cleveland, the son of an attorney and a preschool teacher, Mandel grew up in Beachwood, home of the second-largest per capita Jewish population in the country.",
    "That’s what Tim Ryan is — soggy.”\n* * *\nWhat can sometimes get overlooked in the attacks on Mandel is that he served for nearly a decade in one of the most unsexy, bureaucratic positions imaginable.",
    "He offered another story about how, as a state representative a few years later, he objected to the Ohio House speaker asking a preacher to tone down overtly sectarian prayers on the House floor.",
    "“And he does work hard, I’ll give him credit.”\nPepper said he finds it most troubling that Mandel is capable of changing up his political persona so dramatically based on political expediency.",
    "Hey, Liz, why don’t you take a look at how many hands are up right now.”\nI understood that turning me into a political prop was Mandel’s Trumpy way of trying to curry favor with the audience.",
    "The city’s then-mayor, Joe Cicero, later described Mandel as a “wolf in sheep’s clothing.” Cicero told a Cleveland Plain Dealer columnist in 2017 that Mandel “fooled everyone in the city.",
    "Josh Mandel is inadequate as a human being.” This was after Mandel had condemned the Anti-Defamation League’s decision to publish the names of key members of extremist hate groups.",
    "That Mandel, a practicing Jew, is running his campaign through Ohio’s evangelical churches, feels to some like a move calculated for strategic political exposure to the MAGA base.",
    "I was brought up in a conservative household that believed in freedom — freedom of religion, freedom for atheists — and not centralizing power in the federal government,” he said.",
    "After two other attempts at the Senate, Mandel has been heavily courting the evangelical “Make America Great Again” vote in this pivotal primary to replace Republican Rob Portman.",
    "Kamrass said he can’t stomach how Mandel is representing the Jewish community, especially since he could become the first Jewish GOP senator elected in more than a decade.",
    "Matt Dolan, a state senator whose family owns the Cleveland Guardians baseball team, is running as a moderate, testing whether Trump’s base cares for another Rob Portman.",
    "(Mandel’s spokesperson confirms that had Mandel been in Congress in 2021 he would have voted with the senators who objected to certifying some electoral college votes.)",
    "Mandel has since divorced his first wife, Ilana Shafran Mandel, with whom he has three children, and has begun dating his campaign fundraising director, Rachel Wilson.",
    "The law has not gone into effect while the Supreme Court prepares to rule on a case that could overturn Roe v. Wade, an outcome that Mandel said he very much supports.",
    "Ask any of my opponents to show up at a church and try to get 500 people there,” Mandel told me in a church where there had not been 500 people, that night at least.",
    "“He’s a really disturbing person,” said David Pepper, the former chair of the Ohio Democratic Party, who added that Mandel is like far-right Sen. Josh Hawley (R-Mo.)",
    "“Oh, here’s another thing she said — it’s a ‘morale booster.’ Raise your hand if you think DeWine giving away your tax money for a sweepstakes is a morale booster.",
    "Mack said it’s crazy how Republicans can knock BLM for isolated incidents of property damage but not denounce the Trump supporters who ransacked the U.S. Capitol.",
    "He says he wants the House select committee that’s investigating the Jan. 6, 2021, attack on the U.S. Capitol by extremist Trump supporters replaced with a “Nov.",
    "Mike Gibbons, an investment banker, and Bernie Moreno, a luxury car dealer and entrepreneur, are also using their personal fortunes to prop up their campaigns.",
    "Julian Mack, a 37-year-old racial justice organizer from Toledo, asked Mandel to stop using what he considers a racist dog-whistle to describe demonstrators.",
    "The latter initiative, celebrated at its onset, was ended by his successor over concerns the contract with a payment processor hadn’t been properly awarded.",
    "Advertisement\nA 54-year-old trucker, Ensminger appeared to be one of the few people at the Mandel-Harper debate who wasn’t affiliated with either campaign.",
    "A source I had been talking to for most of the day asked whether Mandel had been referring to me, and I when I said yes, he shook his head and walked away.",
    "That’s Mandel.”\n* * *\nAdvertisement\nIt wasn’t easy to get a minute with Mandel after his debate last month with Harper, the Senate race’s lone progressive.",
    "“Josh kind of built his career on being a practical, center-right Republican,” said a former county GOP chair who has known Mandel since he was in college.",
    "But Vance is having a hard time distancing himself from his past remarks bashing Trump (he even brought his father on the campaign trail to vouch for him).",
    "To boost his MAGA cred, Vance sought the endorsement of Marjorie Taylor Greene, the radical Georgia congresswoman, who campaigned with him last weekend.",
    "Afterward, one of them approached Mandel to confront him about calling BLM activists “thugs,” the line that seemed to get the most attention that night.",
    "That relationship was the subject of reporting in The Columbus Dispatch for allegedly creating a “toxic” work environment in the campaign organization.",
    "To which Mandel responded, “Black Lives Matter bashed my friend Paul’s home.”\nAfter a few more seconds of back and forth, they ended with a handshake.",
    "If that strikes you as Mandel doing his best to channel Trump, I’ve been unwillingly included in Mandel’s Trump act in the course of reporting on him.",
    "To the degree it’s possible to discern anyone’s true political motivations, people following Mandel don’t completely buy that any of this is genuine.",
    "And in fairness to Mandel, nearly all of his opponents are trying to squeeze into the same lane — Mandel is just taking up the most space for now.",
    "But the tech entrepreneur had a controversial breakout moment when a radio ad he ran pointing out that Mandel was Jewish was deemed anti-Semitic.",
    "Held at a Baptist church in Columbus, the meeting was conceived as a publicity stunt for both candidates — low stakes and good headline fodder.",
    "When I was in the Marine Corps, we had this term, it was ‘soup and sandwich.’ The way we described some guys, Iraqis we came across, was soft.",
    "As Ohio treasurer, Mandel oversaw the department that collected taxes, moved money around state government, and managed debt and investments.",
    "Mandel told Kander he wanted to collaborate on something like a cable news segment or show, as opposing “moderates” from the Heartland.",
    "He insists that he was just trying to get across how Mandel is an “ever-morphing, tell you anything that you want to hear” politician.",
    "Mandel also has the support of the anti-tax Club for Growth, a major fundraising booster, and Ohio Value Voters, a faith-based group.",
    "He told me how he spearheaded the passage of a property tax rebate over what sounded like the universal objections of his colleagues.",
    "“It’s beyond me that the descendent of Holocaust survivors can actively voice the feeling that there’s one true religion in America.",
    "I took on the establishment,” he said — the “establishment” being the government in a village of 13,000 in suburban northeast Ohio.",
    "“Your discriminatory stance violates the core values of this family,” nine members of Cleveland’s Ratner real estate dynasty wrote.",
    "Kander, who has his own Midwestern drawl, was referring to clips of Mandel, a Cleveland native, adopting a fake Southern accent.",
    "The first story that Mandel told me after the debate, when I asked him about his authenticity, was about his city council days.",
    "Chris Maddaloni/Getty Images\nMandel’s Judaism would shape his time at Ohio State, where he arrived as a freshman in 1996.",
    "Among his rivals, Mandel is the loudest proponent of the “big lie” that Donald Trump won the 2020 presidential election.",
    "“To me, the people who are truly dangerous are the ones who will do or say anything, depending on the moment,” he said.",
    "It was at an all-day event that featured hard-right candidates like Mandel and headliners Matt Gaetz and Candace Owens.",
    "Mandel attributed the move to his wife’s health and an unspecified condition that required him to be with her at home.",
    "He joined the Jewish fraternity Alpha Epsilon Pi and was twice elected president of the undergraduate student council.",
    "That’s all it is, is bullshit.”\nIt’s not hard to find people in Ohio politics who are completely horrified by Mandel.",
    "He believes that ever since the controversy with the radio ad, Mandel has been toning it down a bit during debates.",
    "Dec. 15: “In Joe Biden’s America, you’ll be arrested for trying to enter a Cheesecake Factory without your papers.",
    "No position is too extreme — Mandel edges right up to the line of open racism and radicalizing against democracy.",
    "Mandel did the same thing — run away, through a back door — when I tried to talk to him about it after the event.",
    "(Never mind that not only is DeWine not his opponent, but they could possibly be sharing the same GOP ticket.)",
    "The limited polling that’s been done on the race has shown Mandel with a steady lead in a six-way GOP primary.",
    "I was finally able to reach Mandel to ask him what he makes of the critics who think this is all a big troll.",
    "“She’s in this room somewhere,” Mandel said, prompting the crowd to pan around looking for me as they booed.",
    "“I don’t know who that’s for, but it’s so strange.”\nAdvertisement\nMandel seems to know exactly who it’s for.",
    "But our upbringing was essentially the same,” said Kamrass, who knows members of Mandel’s ex-wife’s family.",
    "“His big source of pride was not right-wing anything; it was mainly about how hard he worked,” Pepper said.",
    "Republicans requested anonymity to discuss Mandel for fear of alienating the party’s future Senate nominee.",
    "“The first thing you have to do when you deal with evangelicals is you have to at least believe in Christ.",
    "“No one has the right to speak on my behalf,” said Mandel, 44 and baby-faced (he jokes about looking 25).",
    "This is not a free country.”\nJan. 10: “Separation of money and state, not separation of church and state.",
    "“I’ve seen clips of him where he sounds like he’s running in a Republican primary in southwest Missouri.",
    "But I began covering him closely as a Senate candidate for The Blade, Toledo’s daily newspaper, in 2021.",
    "“I think it’s horrid that there’s a narrative that Trump supporters are cuckoos following a cult leader.",
    "This is the definition ... she’s supposed to, like, write stories about DeWine, not be on his campaign.",
    "When it was his turn on stage, Mandel pulled out his phone and read aloud some of my tweets about Gov.",
    "The bill was finally sent to the governor’s desk in 2019, well after Mandel had left the legislature.",
    "It was later reported that fewer than 10 businesses had actually opted to pay their taxes in Bitcoin.",
    "“What we don’t need is Josh Mandel speaking for the Black community,” Harper eventually snapped back.",
    "It was just more evidence of the measures he’s willing to take to ingratiate himself with the base.",
    "Mandel’s campaign defended the spot as attempting to highlight cronyism in the treasurer’s office.",
    "After Mandel became a state treasurer, Kamrass graduated and went to work in Democratic politics.",
    "In Kander’s telling, Mandel called him up out of the blue a decade or so ago to pitch a project.",
    "Josh Mandel, a hard-right Republican, debated progressive Morgan Harper in Columbus this month.",
    "Kamrass graduated more than a decade after Mandel but was also in AEPi and student government.",
    "He was opportunistic from the start, one of the worst things that ever happened to Lyndhurst.",
    "Having moved to Ohio in mid-2018, I only caught the tail end of Mandel’s tenure as treasurer.",
    "Ensminger told me, and Mandel, and anyone else who would listen, that he’s all-in for Mandel.",
    "It was a pro-MAGA, anti-establishment crowd, and I was there to try to take its temperature.",
    "Mandel is still known in certain graduate circles for his involvement in both organizations.",
    "Mark Pukita isn’t often mentioned in the top tier of candidates alongside Mandel and Vance.",
    "“The minute you expose his act, he stops it,” he said, “or significantly ratchets it back.”",
    "Rising stars in their respective parties — Kander as a Democrat and Mandel as a Republican.",
    "I never tried to raise it with him again, and Mandel has been cordial with me ever since.",
    "“Are we really supposed to believe the most Christian-values Senate candidate is Jewish?",
    "But now we are.”\nPukita said he’s picked up on something interesting lately with Mandel.",
    "Since then, he “hasn’t kept in touch with the guy at all,” he told HuffPost in December.",
    "She’s supposed to write stories about me, not be on my opponent’s campaign,” he said.",
    "But for many it was obvious the Islamophobic message the campaign was trying to send.",
    "To win that office in 2010, Mandel needed to beat an incumbent Democrat, Kevin Boyce.",
    "“I’ve been a constitutional conservative and fighter since Day One.”\nWhat is Day One?",
    "He had no problem going after me at a pseudo-MAGA rally with hundreds of Republicans.",
    "I’m so sick of these phony caricatures,” the narrator says in the now-canceled spot.",
    "Now Kander can hardly believe the Josh Mandel who’s running for U.S. Senate in Ohio.",
    "TOLEDO, Ohio — Jason Kander says he met Josh Mandel back when he wasn’t Josh Mandel.",
    "Jane Timken, the former Ohio GOP chair, posted a weak fundraising number this week.",
    "3 commission” to probe what was, by all expert accounts, a free and fair election.",
    "“That’s what I was trying to point out, and I could have done a better job of it.",
    "“What I can say is campaigns can often get out of the candidate’s control easily.",
    "“What I can say is campaigns can often get out of the candidate’s control easily.",
    "An incumbent running for a second term, Brown beat Mandel by 6 percentage points.",
    "I’ve believed all the things that Trump believes since it was 1977 and I was 10.",
    "“He will say and do anything and pander to anyone to get elected,” Pukita said.",
    "But they are oftentimes a reflection of the candidate’s value set,” Boyce said.",
    "“Stop bashing people’s homes and I’ll stop calling you thugs,” Mandel told him.",
    "“Josh kind of built his career on being a practical, center-right Republican.",
    "Pukita was asked about it during a debate in November, and the story blew up.",
    "The two men had similar profiles: Jewish combat veterans in their early 30s.",
    "And even when they pulled the ad after, the damage had been done,” he said.",
    "Boyce, now a county commissioner, said he doesn’t harbor any bad feelings.",
    "We were polling much higher, and then it was just like an immediate drop.",
    "Mike DeWine, a Republican who ran afoul of his base during the pandemic.",
    "“They’re not about anything in the end except their own quest for power.",
    "Like, that’s sort of what it takes to get in the door,” the person said.",
    "Kamrass encouraged me to write that he believes Mandel is a sociopath.",
    "It was in Lyndhurst where Mandel made his earliest political enemies.",
    "(A bunch of states went on to copy DeWine’s idea with mixed results.)",
    "“The entire city council, Democrats and Republicans, were against it.",
    "Mandel’s tweets can read like a deranged bot trying to imitate Trump.",
    "A circle formed around Mack and Mandel, bracing for an escalation.",
    "“The new people, they like him because they believe his bullshit.",
    "It is not hard to see how Mandel wins over voters like Ensminger.",
    "Advertisement\nDoes he think the ad ultimately cost him the race?",
    "Vance, the “Hillbilly Elegy” memoirist and venture capitalist.",
    "(Ryan, the front-runner, has so far dodged debating Harper.)",
    "You know, you dip your sandwich and soup and it gets soggy?",
    "Mandel’s support for the “Trump agenda” is what sold him.",
    "“Think about it and have a nice day,” Mack finally said.",
    "“You speak to the things I want to hear,” he told him.",
    "And he’s willing to pretty much do anything to win it.",
    "It’s subtle, but Pukita swears there’s been a change.",
    "I’ve actually been in the foxhole with these pastors.",
    "“Like, you can’t make this stuff up,” he continued.",
    "But Harper’s team came armed with more supporters.",
    "I know that’s not what it sounds like,” he said.",
    "“I didn’t bash anybody’s home, man,” Mack said.",
    "“It was never about property damage,” he said.",
    "Jared Kamrass had a similar trajectory at OSU.",
    "Kander ultimately wasn’t into it and passed.",
    "New statewide officeholders in the Midwest.",
    "Mandel’s actual Day One was Sept. 27, 1977.",
    "After all, they still want to win the seat.",
    "Gaelen Morse/Reuters\nA close second is J.D.",
    "#bitcoin.”\nJan. 11: “Freedom over Fauci.",
    "That means Mandel could soon join Sens.",
    "Mandel smoked Boyce in the election.",
    "The rest of the field can’t keep up.",
    "But there were still consequences.",
    "Advertisement\nThat was the pitch.",
    "Vance also has Hawley’s backing.",
    "“Think about this for a second.",
    "* * *\nWho is Josh Mandel for?",
    "Pukita admits the ad was bad.",
    "“For me, these aren’t words.",
    "“It did have a real impact.",
    "“I’m a Jew from Cincinnati.",
    "He’s a Jew from Cleveland.",
    "The rumors were just that.",
    "I’ve actually got scars.",
    "It’s not clear they do.",
    "Meet David Ensminger.",
    "He just showed up.",
    "It made sense why.",
    "I’ve been to Ohio.",
    "And it worked.",
    "He bristled."
  ]
}