{
  "id": 26487,
  "mediaId": 2716,
  "date": "2022-01-24",
  "headline": "How Joe Biden will determine Republican foreign policy",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1643055836/bidens ukraine flag.jpg",
  "link": "https://theweek.com/talking-points/1009342/how-joe-biden-will-determine-republican-foreign-policy",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "W. James Antle III",
  "authorUrl": "https://theweek.com/authors/w-james-antle-iii",
  "termIds": [
    13436,
    13508,
    13592,
    13764,
    14172,
    13312,
    14214,
    14332,
    14355
  ],
  "sentences": [
    "Under former President Trump, it became easier to make antiwar arguments to conventional Republicans because his instincts — if not always his policies or personnel choices — were against foreign intervention in most cases.",
    "When Biden did pull out of Afghanistan in a particularly messy fashion, conservatives who wanted to keep the 20-year-old war going regained some of the ground they lost with the base.",
    "Republicans are still divided on whether \"great nations do not fight endless wars\" or whether a conservative foreign policy should seek benevolent global hegemony.",
    "When former President Barack Obama pursued a disastrous regime-change war in Libya, Sen. Rand Paul (Ky.) was able to rally rank-and-file Republicans against it.",
    "\"Worth repeating: Our leaders care more about Ukraine's border than they do our own,\" tweeted Hillbilly Elegy author and Ohio Republican Senate candidate J.D.",
    "If he talks about sending troops abroad, conservatives questioning what vital national interest is at stake will find it easy to get a hearing.",
    "Russia's possible incursion into Ukraine will have repercussions here at home, not least in the intraconservative debate over foreign policy.",
    "When Trump wanted to pull out of Afghanistan, conservatives who agreed were supporting the Republican administration's position.",
    "Tucker Carlson has been beating the drums against an active U.S. role, including letting Ukraine in NATO, on his nightly show.",
    "Principled skeptics of George W. Bush's approach to these questions and partisans found themselves aligned.",
    "It is just as easy to imagine conservatives panning inaction and portraying Biden as dovish and weak.",
    "\"You should be against going to war with Russia,\" tweeted Charlie Kirk of Turning Point USA.",
    "When Obama struck a nuclear deal with Iran, the more hawkish Sen. Tom Cotton (R-Ark.)",
    "The default Republican position will be to disagree with the Democratic president.",
    "Biden's response to a Russian invasion of Ukraine will be similarly clarifying.",
    "There are plenty of conservative influencers warning against intervention.",
    "But for now, it will be shaped by a Democratic president's decisions.",
    "It will be litigated during the 2024 primaries.",
    "That has gotten harder under President Biden.",
    "But a lot will depend on what Biden does.",
    "had the upper hand.",
    "Vance."
  ]
}