{
  "id": 26493,
  "mediaId": 2658,
  "date": "2022-01-21",
  "headline": "‘Crypto bros,’ UFOs and NFTs: Inside Peter Thiel’s Senate fundraising tour",
  "image": "https://static.politico.com/35/49/c297c48f4ac7a1ef2cca1ae8f22c/220120-peter-thiel-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/01/21/crypto-bros-ufos-nfts-thiel-527536",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13470,
    14008,
    13372,
    14260,
    14300,
    14317
  ],
  "sentences": [
    "After Vance promoted a dinner with him and Thiel for donors who gave $10,800, primary opponent Josh Mandel wrote on Twitter that “for $10.80 anyone can join me eating fries off the hood of the car from a gas station Denny’s at midnight.”\nMandel has also ripped Vance for his support from “Silicon Valley” and called Vance a hypocrite for criticizing big tech companies while he has “a guy who is on the board of Facebook as his biggest political funder,” an implicit reference to Thiel.",
    "Thiel has headlined six such dinners for Masters, as well as two for Vance, a venture capitalist and the author of “Hillbilly Elegy.” Vance has brought in $200,000 through the dinners, and he will be the beneficiary of another one this month that is expected to raise in the six-figures, according to a person close to his campaign.",
    "They would create a non-fungible token — better known as an NFT, an exclusive, one-of-a-kind digital reproduction of a collectible item — of “Zero to One,” the bestselling business book the two published in 2014, and sell it off on Twitter to the first 99 donors who sent Masters a maximum $5,800 campaign donation.",
    "Donors “want to get to know [Thiel], they want to understand what makes him tick, they want to understand who he is and spend time with him,” said Lanhee Chen, a candidate for state controller in California who has met with Thiel and, like the tech investor, has taught at Stanford.",
    "“And so I think all three of those [groups of] people are just interested in what he has to say, and I think that makes his support very helpful.”\nLast month’s “Zero to One” sell-off was part of a broader, Thiel-led effort to fill the war chests of his two favored candidates.",
    "Thiel, the reclusive PayPal co-founder and early Facebook investor, is capitalizing on his mystique and rising prominence to attract donors to the pair of first-time candidates, and he has taken a major behind-the-scenes role in helping to orchestrate their fundraising.",
    "Separately, Thiel has hosted a series of fundraising dinners in Ohio, Florida, Los Angeles and Northern California, where donors have bid thousands of dollars through Twitter sell-offs held by Masters and Vance for a chance to sit across the table from the investor.",
    "Those who’ve tracked Thiel’s career say his engagement follows the aggressive, hard-charging approach he’s embraced throughout his career — perhaps most memorably when he financed a lawsuit targeting the gossip website Gawker after it outed him as gay.",
    "Masters, who used to serve as Thiel’s de facto chief of staff, hinted that more was on the way when he tweeted last month that he “can’t wait to show you guys what we’ve got planned next.”\nThiel’s fundraising power extends beyond Arizona and Ohio.",
    "To sweeten the pot, Masters offered “exclusive access to parties with me and Peter.”\nIt paid off: The NFT sold out in less than 36 hours, netting Masters more than a half-million dollars — a sizable fraction of his total fundraising so far.",
    "Later this month, the billionaire is joining with Donald Trump Jr. to co-host a donor event for Wyoming Values PAC, a super PAC supporting Wyoming Republican Harriet Hageman, who is waging a primary challenge against Rep. Liz Cheney.",
    "“He understands the power of human liberty better than anyone I know and our country is fortunate to have him as a leader.”\nThe 54-year-old, German-born Thiel keeps up to date on the Arizona and Ohio races, those close to him say.",
    "Thiel has brought in a wave of apolitical, idiosyncratic contributors — a group that includes everyone from Silicon Valley types to “crypto-bros,” as one person described them — who do not typically give to Republican campaigns.",
    "The Arizona candidate has since received outreach from supporters asking if he could mint more copies of the “Zero to One” NFT, though he has opted against it, wanting to avoid diluting the value of the 99 that were produced.",
    "After launching the project on Dec. 27, just before the end-of-year fundraising deadline, Masters whipped up interest in the NFT by providing a series of real-time updates on Twitter detailing how many copies had sold.",
    "Masters had for a few weeks pondered the idea of selling off a unique digital representation of “Zero to One,” which is based on notes Masters took at a Stanford class on business startups Thiel taught in 2012.",
    "The libertarian-minded Thiel has given twin $10 million donations to a pair of super PACs bolstering the two candidates, but he has not been content to simply write big checks and sit on the sidelines.",
    "The connection to Thiel has helped Masters and Vance raise large sums from first-time donors, and those in California’s tech community, which is typically reluctant to get behind Republican candidates.",
    "There have even been discussions about “deepfakes” — the manipulation of digital media — and Jeffrey Epstein, the financer and convicted sex offender who in 2019 was found dead in his jail cell.",
    "“He’s a well-known business leader, a well-known thought leader for political conservatives, and he’s also I think a very influential person in the crypto community,” Vance said.",
    "According to his campaign’s financial records, Masters drew $371,000 in contributions from California contributors during the third quarter of 2021, more than any other state.",
    "Late last year, tech billionaire Peter Thiel and his protégé, Arizona Senate candidate Blake Masters, together devised a new way to raise big bucks for the 2022 campaign.",
    "With primary season approaching, he is expected to continue his involvement in the contests, and the two campaigns are considering what other ways he could be helpful.",
    "Masters’ fundraising organizers have reserved private rooms at upscale restaurants and capped the attendance at six donors apiece, giving them an air of exclusivity.",
    "Before Vance announced his candidacy, Mandel reached out to Thiel by text message to praise him and ask for a meeting, two people briefed on the exchange confirmed.",
    "While the 2016 and 2020 elections and policy toward China have been discussed, a range of other topics have arisen — including cryptocurrency, robotics and UFOs.",
    "Thiel has become such a draw that candidates in other races have begun reaching out to those in the investor’s orbit in the hope that Thiel could help them, too.",
    "Thiel has held three closed-door fundraisers for Masters — including one in late December at his Miami home — each of which has brought in around $100,000.",
    "“Over the years Peter has hosted events for me and against me and through it all I consider him a friend and a force for good,” Mandel said in a statement.",
    "The billionaire donated to Mandel’s 2012 Senate campaign and hosted a fundraiser for him in December 2011, according to a person familiar with the event.",
    "Thiel had already cut a huge check funding a pro-Masters super PAC, but they came up with an unusual plan to put money directly into Masters’ campaign.",
    "It seems only fitting that, years later, my U.S. Senate campaign was the first to fundraise in this new way,” Masters said in a statement.",
    "“Peter and I wrote ‘Zero to One,’ a book about the importance of doing new things, not just in business but also society and in politics.",
    "While the billionaire’s heavy involvement has been a boon to the two candidates, it has also become an issue of debate in the Ohio race.",
    "According to a person familiar with the event, organizers have decided to expand the number of seats to accommodate the demand.",
    "More than that, the episode illustrated how central a player Thiel is in the campaigns of Masters and Ohio Republican J.D.",
    "The cash influx has helped propel Masters and Vance as they compete in crowded primaries.",
    "Masters’ NFT gambit provided the clearest illustration yet of Thiel’s fundraising power.",
    "The conversations are unlike those that typically take place at political fundraisers.",
    "The suit ultimately bankrupted the outlet and forced it out of business.",
    "Those familiar with the dinners describe them as intimate affairs.",
    "“Here’s a guy who comes along and doesn’t just play,” Chen said.",
    "Mandel, however, hasn’t always been critical of Thiel.",
    "The text messages were first reported by Axios.",
    "Vance, another Thiel ally running for Senate.",
    "“He plays seriously and plays to win.”"
  ]
}