{
  "id": 26498,
  "mediaId": 2919,
  "date": "2022-01-31",
  "headline": "Rep. Tim Ryan submits signatures to appear on ballot for US Senate race",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/0cc65cd/2147483647/strip/true/crop/3000x1575+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F98%2F8b%2F76c1d3674208ae0c8083c14b22e0%2Fap21286686905365.jpg",
  "link": "https://www.news5cleveland.com/news/democracy-2020/ohio-politics/rep-tim-ryan-submits-signatures-to-appear-on-ballot-for-us-senate-race",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camryn Justice",
  "authorUrl": "https://www.news5cleveland.com/camryn-justice",
  "termIds": [
    13583,
    13901,
    13958,
    14097,
    14153,
    13372,
    14243,
    14246,
    14317,
    14360
  ],
  "sentences": [
    "From now through November, this team is going to keep building the momentum we need to bring home a victory for Ohio workers in this race.”\nRyan joins a field of four Democrats that have announced their intent to run for the Senate seat, which currently includes consumer protection attorney and Columbus native Morgan Harper, Demar Sheffey, a Cleveland native and Treasurer of the Cuyahoga Soil & Water Conservation District, and Westlake resident \"working-class citizen\" Rick Taylor.",
    "“This campaign is about the working people in every corner of our state, who are working hard, doing everything right, and deserve two senators who will show up and work hard every day to cut them in on the deal,” said Tim Ryan in a press release.",
    "The only nonjudicial Ohio Democrat to win statewide since 2006 has been Sherrod Brown, but Ryan believes he's the Democrat that can win the Senate seat back from Republican hold and in turn, turn the Senate seat blue in '22.",
    "COLUMBUS, Ohio — Northeast Ohio congressman Tim Ryan, who in April 2021 announced his plans to run for United States Senate, submitted signatures Monday in order to appear on the ballot for Ohio's Senate race this year.",
    "“I’m proud to be filing for the ballot with signatures from voters in all 88 counties—from Williams to Washington County, and Ashtabula to Lawrence to Hamilton County.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Whichever Democrat wins the Democratic Primary on May 3 will face a crowded field of Republicans in the General Election on Nov. 8.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Vance, Josh Mandel, Matt Dolan, Mike Gibbons, Bernie Moreno and Jane Timken.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Ryan submitted 3,000 signatures from voters in all of Ohio's 88 counties.",
    "Current candidates include well-known conservative voices such as J.D.",
    "Download now on your Apple device here, and your Android device here.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices."
  ]
}