{
  "id": 26502,
  "mediaId": 2658,
  "date": "2022-01-05",
  "headline": "POLITICO Playbook: Republicans dodge and deflect ahead of Jan. 6",
  "image": "https://static.politico.com/f8/8c/64e13f924903a03fb33a5074e39b/gettyimages-1236984106.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/05/republicans-dodge-and-deflect-ahead-of-jan-6-495599",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13525,
    13592,
    13607,
    13846,
    13869,
    13947,
    14071,
    13301,
    13312,
    14221
  ],
  "sentences": [
    "The immediate task at hand is “a triage operation focused on containing the reverberations of the surge well enough to avert breakdowns in essential services, mass school closures and overrun hospitals.”\nBut beyond that, there’s not much more the federal government can do, and now a weary West Wing’s broad goal is simply “to blunt Omicron’s impact on everyday life and the economy rather than to completely contain it.”\nMEDIAWATCH\nKEEPING UP WITH THE SMITHS — NYT’s David Gelles broke some major home news Tuesday: “Ben Smith, the media columnist for The New York Times, is leaving the media outlet to start a new global news organization with Justin Smith, who is stepping down as chief executive of Bloomberg Media.”\n— In an interview with Puck News’ Dylan Byers, Justin Smith provided some insight into what the company is looking to do: “I don’t think the newspaper article has changed in a long time, and I think readers’ consumption habits have changed radically.",
    "He said “there were over 100 congressmen — both the House of Representatives and Senators — that were lined up to execute” the plan administration officials came up with, where “contested states would revoke their certifications, deprive either candidate of the required 270 Electoral College votes, and give Trump one last shot [at] victory — with the House of Representatives ultimately voting to decide the outcome of the 2020 election, using an arcane protocol that favored Trump.” More from Rolling Stone’s Tim Dickinson\nLAWSUITS TARGET TRUMP — Lawsuits from police officers who responded to the Jan. 6 attack against Trump are adding up, our Kyle Cheney notes: “A Capitol Police officer who defended lawmakers in the House chamber during the violent Capitol assault filed the first of two new lawsuits against Trump on Tuesday, asking a court to hold the former president responsible for the mob of his supporters who conducted the attack.",
    "Mike DeWine … Allison Price … WSJ’s Nick Timiraos … Nick Lanyi … Gautam Raghavan of the White House … Ally Flinn of the Cook Political Report … John Solomon … Mimi Mager … DOT’s Jessie Torres Perkins … Jeff Hauser … former Reps. Tom Davis (R-Va.), Nancy Johnson (R-Conn.) and Carolyn McCarthy (D-N.Y.) … Alexis Bataillon … Allison Biasotti of Senate Majority Leader Chuck Schumer’s office … Mandi Merritt of Jane Timken’s Ohio Senate campaign … Caroline Anderegg … Competitive Enterprise Institute’s Christine Hall … Danielle Melfi … Niskanen Center’s Matthew La Corte … Walter Ludwig of Indigo Strategies … Josh Galper (5-0) … Kristen Grimm of Spitfire Strategies … former CIA Director George Tenet … former Pennsylvania Gov.",
    "Those included false claims that software glitches interfered with the count, that fake ballots were used, and that voting machines run by Dominion Voting Systems were rigged to help Democrats.” NYT’s Stuart Thompson notes that the new research sheds light on “the extent to which podcasts have spread misinformation using platforms operated by Apple, Google, Spotify and others, often with little content moderation.”\nPLAYBOOKERS\nTim Kaine (and countless others) spent 27 hours stuck in traffic on I-95.",
    "What we’re going to unleash at this new company is an innovation hothouse for journalism that is consumer-centric, that will push the envelope on new journalistic innovations to deliver quality content.”\nPODCAST MISINFORMATION — A study of 1,500 episodes from 20 of the most popular political podcasts by the Brookings Institution found that “among episodes released between the election and the Jan. 6 riot, about half contained election misinformation.",
    "CONGRESS\nMCCARTHY THREATENS TWITTER (ON TWITTER) — House Minority Leader KEVIN MCCARTHY sent a warning shot to social media companies Tuesday afternoon, writing in a tweet that if Twitter — or any big tech company — “shut[s] down constitutionally protected speech (not lewd and obscene) you should lose 230 protection.”\nMcCarthy was referring to legal protections that bar social media platforms from getting sued for content their users publish.",
    "Wasserman writes that the House map is now on track to have more Biden-won districts, “producing a congressional map slightly less biased in the GOP’s favor than in the last decade’s.” One explanation: “[M]any GOP-controlled states are already gerrymandered, limiting Republicans' ability to wring them for additional gains.”\nWhen it comes to this year’s midterms, though, take this with a grain of salt.",
    "POLITICO Playbook: Republicans dodge and deflect ahead of Jan. 6\nBy RACHAEL BADE, EUGENE DANIELS and RYAN LIZZA\n01/05/2022 06:15 AM EST\nPresented by\nDRIVING THE DAY\nHOT JOB: “The Virginia Department of Transportation seeks a Communications Manager to handle emergency response and crisis communications duties as needed.”\nTHE LEAD-UP TO ONE YEAR — Republicans don’t want to talk about Jan. 6.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "U.S. Capitol Police Chief THOMAS MANGER will testify before the Rules Committee for a Jan. 6 oversight hearing at 10 a.m. Manger will tell the committee how his department is implementing more than 100 recommendations for improvement as he attempts to address the deficiencies that were exposed by the attack, per the NYT’s Luke Broadwater.",
    "What to watch: In order to defang Schumer’s rules change threat, does a bipartisan group come forward with a proposal that includes ECA reform as well as the core election subversion policies of the Freedom to Vote Act — but excludes longtime partisan policies that have no hope of garnering 60 votes, such as campaign finance reform?",
    "More: A left-right group of four well-known election law experts calls for ECA reform in a new WaPo op-ed … The Dispatch’s David French writes, “Stop Screwing Around and Reform the Electoral Count Act”\nBIDEN’S WEDNESDAY: The president and VP KAMALA HARRIS will receive the President’s Daily Brief at 10:10 a.m.",
    "Jayapal: “It was probably one of the most intense things I’ve ever been through.”\nTHE PANDEMIC\nCDC NOT GIVING IN — Despite criticism of the CDC’s move not to recommend that people with the coronavirus test negative before ending their shorter quarantines, the agency doubled down Tuesday.",
    "STATE OF THE UNION — The DNC staff unionized Tuesday as two-thirds of eligible employees signed onto the effort, in what Insider’s Kayla Epstein calls “perhaps the most significant organizing effort in politics yet.” The drive could set an example throughout the Democratic Party.",
    "GOP WARMS TO ECA REFORM — As we reported Tuesday, there is growing support on the right to reform the Electoral Count Act, the arcane 19th-century law governing how Electoral College votes are certified and tabulated that Trump tried to exploit to overturn the 2020 election.",
    "The other lawsuit was filed by two officers with the Metropolitan Police Department who were called in to help the Capitol Police during the insurrection.”\nLOOK WHO’S BACK — SEB GORKA sued the Jan. 6 committee Tuesday to prevent Verizon from turning over his phone records.",
    "“Given all the emotion and lies about what happened and what did happen criminally — some things were horrific that happened and shouldn’t have happened that day — is it smart for President Trump to do a rally on that particular day?” she asked Rep. JIM BANKS (R-Ind.)",
    "Perhaps they’ll offer tenure next.”)\nJAN. 6 AND ITS AFTERMATH\nNAVARRO SPEAKS — In a Rolling Stone interview, former Trump trade adviser PETER NAVARRO discussed the behind-the-scenes effort to thwart the certification of the 2020 election results.",
    "Ed Rendell … Pedro Ribeiro … David Bauder … Andrew Mills … Bush alum Carrie Underwood … Mercury’s Jake Dilemani … Veronica Vaquer … Patrick Ottenhoff … David Simas of the Obama Foundation\nDid someone forward this email to you?",
    "The upshot: With redistricting more than halfway over, Democrats are doing much better than many thought they would — particularly given that Republicans oversaw the redrawing of 187 districts while Democrats had only 75.",
    "It’s just the latest escalation in the GOP leader’s rhetoric against tech and social media firms, coming after Twitter suspended Rep. MARJORIE TAYLOR GREENE (R-Ga.) over the weekend for tweeting Covid-19 misinformation.",
    "Marjorie Taylor Greene calls on all GOP lawmakers to leave Twitter,” Washington Times\nALL POLITICS\nANOTHER ONE BITES THE DUST — Michigan Democratic Rep. BRENDA LAWRENCE is the latest to announce that she’s retiring.",
    "“We can’t lose the entire WH counsels office,” he wrote to JIM JORDAN and MARK MEADOWS on Dec. 31, 2020, likely referring to PAT CIPOLLONE’s opposition to pressuring MIKE PENCE to throw the Electoral College count.",
    "— Walmart and Kroger are increasing the prices of BinaxNOW rapid at-home coronavirus test kits, after a deal with the White House to sell them at a certain price expired in December, WSJ’s Sharon Terlep reports.",
    "ABOUT THOSE HANNITY TEXTS — The Trump retreat came about an hour after the Jan. 6 committee released text messages showing that SEAN HANNITY privately objected to Trump’s plans to try to overturn the election.",
    "Critics said the refusal to add a testing recommendation was due to the nation’s test shortage; public health officials defended their decision as the best they could make facing a complex set of pressures.",
    "THE VIEW FROM 1600 PENN — Amid the Omicron onslaught, the White House is moving quickly from a mindset of trying to end the pandemic to one of trying to live with it, report Adam Cancryn and Chris Cadelago.",
    "Updated guidance “said people who have recovered from the virus and have isolated for at least five days can take a rapid test if they want, but they don’t have to,” per CNBC’s Spencer Kimball.",
    "THE GOP DID GET SOME GOOD JAN. 6 NEWS TUESDAY NIGHT: Trump’s decision to cancel his Mar-a-Lago press conference, where he was expected to defend the rioters and spew election falsehoods.",
    "They made the case that the news conference would “be playing into the media’s hands.”\n“No matter what he said, it would be reported as more egregious than it was,” one person told us.",
    "… Putnam Partners is adding or promoting Jenna Kruse as SVP, Cristina González and Bryan “Boo” Yuen as VPs, Isaac Walker as senior associate and Syeda “Hubbul” Rizvi as an associate.",
    "ENGAGED — Amy Hasenberg, deputy comms director for Sen. Pat Toomey (R-Pa.), and Joshua Elliott, an associate at Stein Mitchell Beato & Missner LLP, got engaged Thursday in Chicago.",
    "On a private call Tuesday, House GOP leaders encouraged their members to stick to attacking President JOE BIDEN — or, at most, talk about ongoing security concerns at the Capitol.",
    "Vince Evans, the deputy director of public engagement and intergovernmental affairs for Kamala Harris, is moving to become executive director of the Congressional Black Caucus.",
    "The White House Covid-19 response team and public health officials will brief at 11 a.m. Press secretary JEN PSAKI will brief at 12:15 p.m. with port envoy JOHN PORCARI.",
    "WASSERMAN: REDISTRICTING ‘LOOKS LIKE A WASH’ — The Cook Political Report’s David Wasserman is out with a new midterms analysis that everyone should read this morning.",
    "FIRST IN PLAYBOOK — Nina Schwalbe is returning to Spark Street Advisors after her detail as director of USAID’s Vaccine Access and Delivery Initiative ends today.",
    "Donald Trump sent a fundraising email Tuesday with the subject line, “I have something BIG to show you.”\nJeff Bezos’ recent fashion choices are … turning heads.",
    "He doesn’t want a narrow ECA bill to supplant the much broader reforms Democrats are pushing in the Freedom to Vote Act and the John Lewis Voting Rights Act.",
    "Congressional Republicans were privately dreading it, knowing reporters would once again demand their responses to whatever the former president said.",
    "THE BACKSTORY: A Trump confidant told Playbook that a small group of his close allies confronted the former president and got him to change his mind.",
    "Ideas?”\nThe panel is asking Hannity to voluntarily speak with them, stopping short of a subpoena that would likely raise First Amendment objections.",
    "A Walmart spokeswoman said the BinaxNOW tests are more readily available in physical stores.” The White House did not respond to WSJ for the story.",
    "More from Nicholas Wu and Kyle Cheney … The lawsuit\nFIRST IN PLAYBOOK — Teen Vogue’s editor-in-chief Versha Sharma talks to Reps. CORI BUSH (D-Mo.",
    "Hannity’s lawyer JAY SEKULOW still raised the First Amendment in a statement Tuesday night, though he declined to detail Hannity’s next move.",
    "Instead of selling the kits at $14 per the White House’s agreement, Walmart is now selling the kits for $18.99 a box and Kroger for $23.99.",
    "McCarthy also warned the social media companies that Republicans “will not forget” if they comply with subpoenas from the Jan. 6 committee.",
    "“I do NOT see January 6 happening the way he is being told… He should announce will lead the nationwide effort to reform voting integrity.",
    "When he speaks people will listen.”\nAfter Jan. 6, Hannity expressed frustration that Trump still didn’t seem to understand that he lost.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "But the more they avoid the subject, the more the GOP base shrugs at what happened that day — and the stronger DONALD TRUMP becomes.",
    "— John Perrino is now a policy analyst at the Stanford Internet Observatory, working on internet trust, safety and security issues.",
    "While kind people passing by took their photo, Josh surprised Amy by getting down on one knee on the Adler Planetarium Skywalk.",
    "Factor in the political climate with Biden’s low job approval reading, and Democrats still don’t have much to be excited about.",
    "He previously was deputy federal affairs director for Florida Agriculture Commissioner Nikki Fried, and is an Evan Bayh alum.",
    "…\n… Julia Jackson Bellinger is now director of government affairs at the Society of Nuclear Medicine and Molecular Imaging.",
    "This is still a midterm election following one-party rule, and historically that means Democrats will lose dozens of seats.",
    "VANCE, “Hillbilly Elegy” author and Ohio Senate candidate, and explores whether Vance’s more radicalized persona is an act.",
    "Most of them are relieved they have an excuse to be out of town: attending former Sen. JOHNNY ISAKSON’s funeral in Atlanta.",
    "The threats matter because McCarthy is likely to be the next speaker and he appears to be outlining a future GOP policy.",
    "Schumer said Tuesday it “makes no sense” to pass ECA reform absent a package of voting rights and election law changes.",
    "2 Senate Republican, told Axios’ Sophia Cai that there’s “some interest” among his GOP colleagues in rewriting the law.",
    "She most recently was at the International Hearing Society, and is a Smithbucklin, YMCA of the USA and Tim Penny alum.",
    "The SENATE will meet at 11 a.m. to take up ANNE WITKOWSKY’s State Department nomination, with a cloture vote at noon.",
    "She previously had an independent public affairs consulting practice and founded a civic empowerment app, 1000 MORE.",
    "He previously was a director at the Glen Echo Group, leading cybersecurity policy and public sector comms work.",
    "As we noted, the potential counteroffer presents a political problem for Senate Majority Leader CHUCK SCHUMER.",
    "… Amanda Munger is now a partner at Melwood Global, leading the D.C. public affairs and strategic comms work.",
    "“In some weeks, 60 percent of episodes mentioned the election fraud conspiracy theories tracked by Brookings.",
    "And worse, I’m not sure what is left to do or say, and I don’t like not knowing if it’s truly understood.",
    "It’s not surprising given how hard the GOP has worked to pivot from all things Jan. 6 over the past year.",
    "NYT’s Maggie Haberman tweeted that Trump was told his event wouldn’t get the live TV coverage he wanted.",
    "Win McNamee of Getty Images won the White House News Photographers annual fantasy football championship.",
    "His survival strategy: turn the engine on briefly to warm up the car, then turn it off to conserve gas.",
    "Next up are contract negotiations with management, which has been supportive of the unionization push.",
    "Just before Trump’s decision was announced, LAURA INGRAHAM seemed to question the wisdom of his event.",
    "He most recently was COO at the American Council on Renewable Energy, and is a Chris Van Hollen alum.",
    "Though our Meridith McGraw says his team was expecting a large contingent of reporters to attend.",
    "— Bill Parsons is now VP for federal and state affairs at the American Clean Power Association.",
    "(Said the RNC’s chief of staff: “We applaud the DNC for rendering themselves even more useless.",
    "“I would nap for 15 or 20 minutes — usually I’d wake up because I got too cold,” he told WaPo.",
    "Indeed, it’s becoming increasingly clear that — with the exception of Rep. LIZ CHENEY (R-Wyo.)",
    "The couple were originally set up by friends Maria Giannopoulos and Brittany Psyhogios-Smith.",
    "“BinaxNOW is sold out on many major retailers’ websites or takes more than a week to arrive.",
    "and perhaps a few others — the day of remembrance will be a nearly all-Democratic affair.",
    "), JAMAAL BOWMAN (D-N.Y.) and PRAMILA JAYAPAL (D-Wash.) about the anniversary of Jan. 6.",
    "… Anthony Pardal is now VP for strategic engagement at the American Bankers Association.",
    "TRANSITIONS — Keegan Goudiss is joining Trilogy Interactive as executive media director.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nTHE WHITE HOUSE\nANOTHER TESTING BLACK EYE FOR THE W.H.",
    "ALSO: Check out POLITICO’s redistricting tracker for a user-friendly state of play.",
    "… Miranda Green is joining Floodlight as deputy editor and investigative reporter.",
    "Republican senators, meanwhile, dodged questions about the Thursday anniversary.",
    "(Banks didn’t get her hint and said he was “looking forward” to Trump’s event.)",
    "Melania Trump is doing the fancy person’s version of a garage sale online.",
    "Spencer Elden’s lawsuit against Nirvana was dismissed by a federal judge.",
    "For Republicans who want him gone, silence has only served as an enabler.",
    "Hannity did not address the committee request on his show Tuesday night.",
    "Pic … Another pic\nHAPPY BIRTHDAY: Rep. Rodney Davis (R-Ill.) … Ohio Gov.",
    "“Even at the higher prices, tests are difficult to find,” Terlep notes.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "He currently is a White House correspondent for the Los Angeles Times.",
    "“Guys, we have a clear path to land the plane in 9 days,” he wrote.",
    "MEDIA MOVES — Chris Megerian will join the AP’s White House team.",
    "(His departure from the VP’s office was reported in November.)",
    "Michael Wolff sent an off-the-record tweet to Brian Stelter.",
    "PLEASE STAND UP — WaPo’s Simon van Zuylen-Wood profiles J.D.",
    "… D’Seantè Parks is now an SVP in SKDK’s New York office.",
    "The Detroit News’ Melissa Nann Burke has the story.",
    "She most recently was doing freelance reporting.",
    "Send Playbookers tips to playbook@politico.com.",
    "She’s an Obama DHS, DOI and Rick Larsen alum.",
    "Go to [Florida] and watch Joe mess up daily.",
    "I did not have a good call with him today.",
    "He previously ran Revolution Messaging.",
    "“He can’t mention the election again.",
    "Thanks for reading Playbook.",
    "Wasserman certainly does.",
    "That makes her the 25th.",
    "Good Wednesday morning.",
    "Sen. JOHN THUNE (S.D.",
    "WILL THE REAL J.D.",
    "The HOUSE is out.",
    "Stay engaged.",
    "End of story.",
    "Sign up here.",
    "on her show.",
    "More: “Rep.",
    "), the No.",
    "Period.",
    "Ever."
  ]
}