{
  "id": 26507,
  "mediaId": 2663,
  "date": "2022-01-20",
  "headline": "Dumbass Josh Mandel is having a panic attack over a satirical article he insists isn’t satire",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/01/Josh-Mandel-YouTube-Screenshot-122.png?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/dumbass-josh-mandel-panic-attack-satirical-article-insists-isnt-satire-20220120",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    13702,
    13803,
    14045,
    13326,
    13355,
    14233,
    14357
  ],
  "sentences": [
    "If that wasn’t already obvious by the headline (“California should abolish parenthood, in the name of equity”), then surely this line makes it abundantly clear:\nMy solution — making raising your own children illegal — is simple, and while we wait for the legislation to pass, we can act now: the rich and poor should trade kids, and homeowners might swap children with their homeless neighbors.",
    "— Josh Mandel (@JoshMandelOhio) January 18, 2022\nA December poll conducted by the Trafalgar Group found that Mandel was leading the field of candidates running in the Ohio Republican primary by nearly 10 points, with 21% of likely voters saying they’d cast their ballots for him.",
    "Related: Photo of Josh Mandel in stuffed bra and wig resurfaces after he tweets transphobic slur\nEarlier this week, the 43-year-old Republican shared a satirical op-ed written by Joe Mathews about abolishing parenthood to make the state of California a more equal place.",
    "— Lancelot Drink (@gergletweets) January 17, 2022\ntHiS sAtIrIcAl WoRk Is NoT sAtIRe\n— THEE Saucy Stacey (@DrSCubed) January 17, 2022\nJosh, I need you to comb through The Onion articles to let us know which ones are satire since you seem to be an expert.",
    "Because shortly after expressing his outrage over an obviously satirical article that he claimed wasn’t satire, Mandel then took to Twitter to advocate for dismantling the U.S. Department of Education.",
    "— Castille (@panda_worries) January 18, 2022\nJosh wants to stop teaching critical thinking skills in school so your kids can be as stupid and unable to pick up on satire as he is\n— cheerwine ??",
    "Vance posts racist video but all anyone’s talking about are his erect nipples and bad eyeliner\nNext on the list was investment banker Mike Gibbons, polling at 12%.",
    "— daz™ (@artofdaz) January 17, 2022\n— Chuck Todd’s shamble bangs (@Drea_got_rage) January 17, 2022\nSodom actually sounded like a really fun place from what I read!",
    "But then it occurred to me – maybe Josh Mandel and campaign is a whole satire performance piece and *I* am the fool taking it literally!",
    "(@Zsusk) January 17, 2022\nYou just wanted to write the word sodom because you add a “y” and it’s all you think about all day.",
    "Either Mandel didn’t actually read the article before sharing it with his 66,000 followers, or he’s just really that dumb.",
    "Noted homophobe and former Ohio state treasurer Josh Mandel, who is currently running to replace outgoing Sen.",
    "— SteelJake (@SteelJake2) January 17, 2022\nI wanted to laugh at Josh Mandel for taking satire seriously.",
    "Rob Portman in the U.S. Senate, has once again made a complete ass of himself on Twitter.",
    "“They are trying to turn America into Sodom.”\nTo be clear, the article is satire.",
    "— Guapo (@hotdawg74) January 17, 2022\nI mean, it is literally satire.",
    "(@cheer_wine) January 17, 2022\nThat last comment is actually spot on.",
    "“America does not need a federal Department of Education,” he wrote.",
    "Graham Gremore is the Features Editor and a Staff Writer at Queerty.",
    "America does not need a federal Department of Education.",
    "And behind him was homophobe/Hillbilly Elegy author J.D.",
    "Now, the responses…\nActually, it’s satire.",
    "Follow him on Twitter @grahamgremore.",
    "“This is not satire,” he raged.",
    "Possibly both.",
    "— ZsusK ??????",
    "Related: J.D.",
    "Vance.",
    "??"
  ]
}