{
  "id": 26503,
  "mediaId": 2919,
  "date": "2022-01-22",
  "headline": "Ohio’s pandemic politics cast long shadow over omicron surge",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/9f1fea3/2147483647/strip/true/crop/1000x525+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9a%2F16%2F225d6936492fbcefc4620e54e687%2Fap21298527428865.jpg",
  "link": "https://www.news5cleveland.com/news/state/ohios-pandemic-politics-cast-long-shadow-over-omicron-surge",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.news5cleveland.com/jake-zuckerman",
  "termIds": [
    13556,
    13610,
    13764,
    13768,
    13940,
    13378,
    14262,
    14317
  ],
  "sentences": [
    "“They’re effective, they work, they’re the best tool we have to keep kids in person, five days a week.”\n“The data we’ve had to counteract in the overall vaccine debate in the General Assembly has been really mindboggling over the last year, year and a half.”\nOver the last year, a pattern emerged in news reports, medical journals and health policy analyses: the higher the percentage for which a county voted for President Donald Trump, the lower its vaccination rate.",
    "Like several other health policy officials and physicians interviewed for this report, he said he and his colleagues regularly battle a steady downpour of vaccine misinformation, coming from the political system, to social media, to UFC commentator-turned comedian-turned COVID contrarian Joe Rogan’s podcasts.",
    "Vance called for “massive civil disobedience” in relation President Joe Biden's vaccine mandate for large employers; Rivaling candidate Josh Mandel, on the day Biden imposed a vaccine mandate on federal employees, compared the action to the \"Gestapo\" — the secret police of Nazi Germany.",
    "“You don’t deploy the National Guard just to deploy the National Guard.”\nDespite the recent surge in deaths and hospitalizations (about 5,700 Ohioans are currently hospitalized with COVID-19, down from a record 6,750 last week), vaccination has descended into political controversy.",
    "“People have different values and different ways of understanding things.”\nVaccines and kids\nVaccination rates for Ohio children against COVID-19 remain low — only 16% of 5 to 11-year-olds are vaccinated, according to a Kaiser Health News analysis of federal data.",
    "Miller said he’d hope that any such high-risk students would be vaccinated, or that students in the class would still choose to wear a mask to protect them, or that their parents establish a remote-learning or other alternative option with the school.",
    "Despite a wealth of available evidence about their safety and efficacy, vaccines are proving to be a hard sell to the roughly 39% of Ohioans who have yet to receive their first dose of a vaccine — compared to the national refusal rate of about 25%.",
    "Given the political environment, however, don’t expect any COVID-19 vaccines, regardless of their regulatory status, to join the list any time soon, said Kevin Miller, a lobbyist for the Buckeye Association of School Administrators.",
    "Watts, the chief medical officer for community and public health at MetroHealth hospital network in Cleveland, said in the big and small picture, everyone should remember that every pandemic in human history has ended.",
    "Some of it is expectations management: a “breakthrough infection” that yields cold-like symptoms as opposed to a trip to the hospital or death is a show that vaccines work, despite naysayers claiming the opposite.",
    "A salient data point: On a given day, he said, anywhere from 75% to 100% of patients in hospitals he oversees are unvaccinated — the few who are vaccinated usually have one or more underlying health complication.",
    "“The state of Ohio is really on fire when it comes to COVID-19,” said Joe Mazzola, the Franklin County health commissioner and former head of the association representing his county-level peers, in an interview.",
    "“That’s the situation that superintendents and boards have been put in.”\n'A patchwork'\nAs state lawmakers consider tinkering with vaccination laws, health policy observers recall the last big pandemic clash.",
    "“It’s physically hard to take care of this many critically ill patients.”\nIn December, more than 90 Ohioans per day died of COVID-19 on average, according to data from the Ohio Department of Health.",
    "In late December of 2021, CEOs of nine general and children’s hospitals issued a letter to school superintendents and school board members urging them to consider a mask mandate as omicron surges.",
    "A May 2021 report from the Network for Public Health Law found Ohio was one of 15 states to pass or consider legislation to limit the authority of public health departments during the pandemic.",
    "The traditional method to ensure sufficiently high vaccination rates in the U.S. to attain herd immunity and protect the immunocompromised is to require vaccinations to attend public schools.",
    "The latter effort grew more complicated given about half of guardsmen are unvaccinated, rendering them unfit to assist the hospitals, as was first reported by the Statehouse News Bureau.",
    "In an interview, Amin recounted how it took the recent omicron surge and this patient’s own experience to get him asking questions about whether vaccination made sense for him.",
    "As such, the state is experiencing the 6th highest rate of COVID-19 deaths per capita over the last seven days, according to state-by-state data from The New York Times.",
    "GOP Ohio Attorney General Dave Yost led a multistate coalition successfully overturning President Joe Biden’s vaccine mandate for large employers in the Supreme Court.",
    "After a severe bout of COVID-19 put him in the ICU and left him with significant respiratory systems, Dr. Emily Amin’s patient had questions about getting vaccinated.",
    "However, some with immune-compromising conditions putting them at high risk like cancer or diabetes face increased likelihood of severe outcomes like hospitalization.",
    "He emphasized that no one should be given up on, and more reasonable minds will prevail when they get the right information, transmitted with empathy and respect.",
    "It also blocked DeWine, his appointed director of the Ohio Department of Health, or local health departments from issuing blanket lockdown or masking orders.",
    "However, he has said he didn’t want to do so, as lawmakers could strike it down and demolish every mask mandate imposed at the local level in the same swipe.",
    "Watts, while hedging her optimism in uncertainty and caution, said in an interview last week she’s seeing early indications of an omicron peak in Cleveland.",
    "Most of the COVID-19 patients Amin treats at the Wexner Medical Center are either vaccinated but manage an immune-compromising condition, or unvaccinated.",
    "The legislation passed with support from anti-vaccine activists and grassroots supporters and over near-unanimous objections from the medical community.",
    "“2022 is going to be, for us and our country, a transitional year, where we have more tools to deal with this virus that is not going away,” he said.",
    "Dr. Joe Gastaldo works as the system medical director of infectious diseases for OhioHealth, which operates 12 hospitals around north-central Ohio.",
    "But the law forced the decision from health experts to people without medical literacy who are subject to political pressure on the heated issue.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "Where once the goal was to convince the governor, now they must lobby non-health experts all around the state to get more students wearing masks.",
    "“We have not had one kid show up in our hospitals since the start of vaccines for kids with a vaccine injury or any adverse reaction,” he said.",
    "“It’s hard to believe a guy who went through the critical illness and still has a lot of symptoms still has significant hesitancy,” Amin said.",
    "The legislation gave lawmakers the ability to nix statewide health orders with a simple majority vote — previous law required a supermajority.",
    "\"I’m optimistic that with time, this virus will look more like flu does or some of the other viruses we all live with,\" said Amin, from WMC.",
    "Mazzola, from Franklin County’s health department, said the law blocked him and other local health departments from imposing mask mandates.",
    "Ohio is, however, one of about a dozen states to allow nonmedical exemptions to vaccinations for religious or philosophical reasons.",
    "Gastaldo, from OhioHealth, said omicron is here now, but people should expect more variants and more corresponding Greek letters.",
    "Republicans in the Ohio House, after months of effort, passed legislation in November banning various forms of vaccine mandates.",
    "Ohio Department of Health Director Dr. Bruce Vanderhoff, speaking to reporters Thursday, offered similarly cautious optimism.",
    "About 13 months into a vaccination campaign, more than 7.1 million Ohioans have received at least one dose of a vaccine.",
    "“In conservative areas and communities, there’s more skepticism of big government and being told what to do,” he said.",
    "The upshot, he said, is some places like Columbus decided through their elected officials to reinstate mask mandates.",
    "Nick Lashutka, CEO of the Ohio Children's Hospital Association, called the August hearing a \"dark day\" for the state.",
    "In 2021, state lawmakers invited testimony from an osteopathic physician who claimed vaccines magnetize their hosts.",
    "Proponents, including Yost and the legislative sponsors, say their issue is with mandates — not vaccines themselves.",
    "Miller, the superintendents' lobbyist, noted the local politics and health conditions scramble calculations.",
    "GOP Rep. Tom Young, of Montgomery County, claimed during an August hearing that vaccines “killed children.\"",
    "“In my opinion, I don’t think, in the foreseeable future, you’ll see the COVID vaccine mandated,” he said.",
    "COVID-19 vaccines are new, he said, and parents don’t (and can’t) have any long-term safety data on them.",
    "Several medical experts were reticent to comment on the combustible mixture of politics and vaccination.",
    "Only about 5% of all COVID-19 deaths in Ohio over the last 13 months occurred among vaccinated people.",
    "“It’s uncharted territory for a health issue like this that has been politically divisive,” he said.",
    "The upside is we now have vaccines, natural immunity, treatments, and knowhow to weather the storms.",
    "Republicans in the House and Senate overruled DeWine’s gubernatorial veto to pass Senate Bill 22.",
    "Mazzola said politics doesn’t and shouldn’t enter analysis on how to boost vaccination rates.",
    "Lashutka said the CHA tries to be “radical centrists for kids” and not take political sides.",
    "Mike DeWine deployed the National Guard late last year to staff testing sites and hospitals.",
    "But politics and philosophy, he said, has certainly shaped some attitudes on vaccination.",
    "Some parents don’t want people in Columbus deciding what happens in their local district.",
    "“That’s the frustration.”\nDeWine still has the power to issue a statewide mask mandate.",
    "About 46% of Ohio students go to schools with no mask mandate, according to state data.",
    "However, anti-vaccine activism and vaccine misinformation have dogged the efforts.",
    "After two years of pandemic plot twists, experts are leery of making predictions.",
    "Some won’t have to face blowback for the decision the way school boards will.",
    "But still, Ohio remains the 8th least vaccine-started state in the nation.",
    "In Ohio, students must provide proof of receipt of six vaccines to enroll.",
    "Cases are surging and hospital rolls are swelling to the point that Gov.",
    "Some say it’s not the government’s role to force children into masks.",
    "Until then, you control what you can and accept that which you can’t.",
    "The vast majority who contract COVID-19 will quickly recover.",
    "Dr. Brook Watts wants you to know that pandemics always end.",
    "\"What’s less clear to me is how we’re going to get there.\"",
    "In the GOP primary for a vacant U.S. Senate seat, J.D.",
    "If masks keep schools open, then keep kids in masks.",
    "“People are exhausted,” Amin said of staff.",
    "“There are no perfect answers,” he said.",
    "For Lashutka, the issue is a no-brainer.",
    "He approached the issue more bluntly.",
    "(About two in three districts have).",
    "It creates inconsistency,” he said.",
    "What does it mean in practice?",
    "Stay home if you feel sick.",
    "It creates mixed messaging.",
    "“It creates a patchwork.",
    "History tells us so.",
    "What comes next?",
    "Lashutka agreed.",
    "Get vaccinated.",
    "Wear a mask."
  ]
}