{
  "id": 26516,
  "mediaId": 2738,
  "date": "2022-01-29",
  "headline": "A Rally For ‘Hillbilly Elegy’ Author J.D. Vance Got Booted From Its Venue Because It Included Marjorie Taylor Greene",
  "image": "https://uproxx.com/wp-content/uploads/2021/02/jd-vance-hillbilly.jpg?w=1024",
  "link": "https://uproxx.com/viral/jd-vance-rally-marjorie-taylor-green-booted/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Prigge",
  "authorUrl": "https://uproxx.com/author/matt-prigge/",
  "termIds": [
    13702,
    13916,
    14056,
    13340,
    14264,
    14290
  ],
  "sentences": [
    "So if you’re planning to hold a public event featuring the politician who had to go to a museum to learn not to trivialize the Holocaust in her late 40s, make sure you make those who run the venue aware of those things, lest you make their lives preventably hellish.",
    "As the Examiner reports, venue brass had no idea:\n“The management at the Landing Event Center in Loveland didn’t know much about the event that was scheduled for Sunday, the general manager told The Enquirer.",
    "Then they discovered he had a guest they didn’t know about: Marjorie Taylor Greene, the controversial Georgia representative who keep blowing her congressional salary on mask fines.",
    "After discussing the matter, the agreed they were not “in a position to hold the event.” Suddenly they had been unwittingly thrown into a political hot powder keg.",
    "Vance, whose debut memoir Hillbilly Elegy was turned into a star-studded Ron Howard movie, up and decided to run for an Ohio senate seat as a Republican.",
    "As per Cincinnati Examiner (as caught by Raw Story), the Landing Event Center in Loveland had agreed to play host to a Vance rally this weekend.",
    "His campaign has struggled to gain traction, despite him saying offensive things and courting all the right far right stars.",
    "Just that a client asked to rent the space for an event that involved ‘Hillbilly Elegy’ author and Senate candidate J.D.",
    "Dr. Oz isn’t the only Oprah-launched celebrity who’s unaccountably reinvented himself as a rightwing politician.",
    "And calls started coming in.”\nTo make matters worse, management hadn’t even been told it was a public event.",
    "A flood of messages on social media and emails greeted her from people angry about the event.",
    "Vance,” adding “Then on Thursday, General Manager Jodi Taylor logged on to her computer.",
    "Now it looks like one of the latter may have lost him a venue for an upcoming rally.",
    "We have both sides upset.” The event has since been moved to a local Marriott.",
    "“It doesn’t matter what we do.",
    "Last year J.D."
  ]
}