{
  "id": 26519,
  "mediaId": 2664,
  "date": "2022-01-28",
  "headline": "The 'very worst forms of gutter Trumpism' on full display in Ohio’s GOP Senate primary: columnist",
  "image": "https://www.rawstory.com/media-library/josh-mandel-and-j-d-vance.jpg?id=29187985&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/the-very-worst-forms-of-gutter-trumpism-on-full-display-in-ohios-gop-senate-primary-analysis/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    13702,
    13724,
    13283,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "— Morgan Harper (@Morgan Harper) 1643386108\nIN OTHER NEWS: Florida Republicans effectively 'nullified' Black state rep's election by refusing to send certification letter\nFlorida Republicans effectively 'nullified' Black state rep's election by refusing to send certifica",
    "\"But you cannot listen to Vance talk about Trump, our elections and our institutions without marveling at how easily elements of this populism, in the hands of someone like Vance, bleed into the very worst pathologies that Trumpism has to offer,\" he wrote.",
    "\"Here’s an unsettling thought: In GOP primaries, declaring unshakable fealty to the mythology that the 2020 election was stolen from Donald Trump is becoming a bedrock condition of political survival,\" Greg Sargent wrote.",
    "While Mandel, Timken, and Vance compete for the GOP nomination, the battle to be the Democratic Party nominee is between Rep. Tim Ryan (D-OH) and former Consumer Financial Protection Bureau senior advisor Morgan Harper.",
    "The race has featured a kind of loyalty competition, in which displays of fealty to Trump’s 2020 lies, pushed relentlessly by Mandel, have kept escalating to comic levels of groveling.\"",
    "\"Mandel also described the coronavirus as a 'bioweapon manufactured by the Chinese Communist Party,' and even declared this had been created to punish Trump for confronting China.\"",
    "Mandel infused the word 'stolen' (as well as Trump’s middle initial) with grandly inflated umbrage, suggesting he has carefully rehearsed this display,\" Sargent wrote.",
    "But Sargent said the Mandel vs. Vance battle illustrates \"how effortlessly those populist tendencies feed into the very worst forms of gutter Trumpism.\"",
    "Rob Portman (R-OH) has descended into the \"very worst forms of gutter Trumpism\" according to a new analysis published by The Washington Post.",
    "\"At this point, even the very worst of this stuff is seen as so unremarkable that it barely merits national media attention anymore.",
    "That’s too bad, because this is coming at exactly the moment that it’s growing more widespread — and dangerous.\"",
    "Jane Timken, the former chair of the Ohio Republican Party, is also seeking the GOP nomination.",
    "At a candidate forum, Mandel declared: 'I believe the 2020 election was stolen from Donald J.",
    "The battle to be the GOP nominee for the Ohio Senate seat being vacated by retiring Sen.",
    "\"That’s the takeaway from the latest news out of the Senate primary in Ohio, where J.D.",
    "Vance is facing former state treasurer Josh Mandel and several other candidates.",
    "He explained Vance has been \"atoning\" after his harsh criticism of Donald Trump.",
    "\"On Thursday night, Mandel upped the ante on the Trump-worship again.",
    "Trump.'"
  ]
}