{
  "id": 26531,
  "mediaId": 2658,
  "date": "2022-01-05",
  "headline": "The ‘mystery’ of the missing Ukraine ambassador",
  "image": "https://static.politico.com/66/e4/e40dcd2944b69e5f6939d999f2cc/gettyimages-1178542331-1.jpg",
  "link": "https://www.politico.com/newsletters/national-security-daily/2022/01/05/the-mystery-of-the-missing-ukraine-ambassador-495609",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13566,
    13743,
    13764,
    13884,
    14138,
    14202,
    14286,
    14355
  ],
  "sentences": [
    "— with WESLEY CLARK, OLEKSANDR DANYLIUK, EVELYN FARKAS, MELINDA HARING, JOHN HERBST and HARLAN ULLMAN”\n— The Middle East Institute, 11 a.m.: “The Future of Maritime Security in the Gulf and the Red Sea — with CINZIA BIANCO, KEVIN DONEGAN, SASKIA M. VAN GENUGTEN, MIRETTE F. MABROUK and BILAL Y. SAAB”\n— The Jewish Democratic Council of America, 12 p.m.: “One Year Later: Reflecting on Trump’s Insurrection and the State of Our Democracy — with SHARON BROUS, BEN CARDIN, MIKE LEVIN, KATHY MANNING, BRAD SCHNEIDER, DEBBIE WASSERMAN SCHULTZ and SUSAN WILD”\n— New America, 12 p.m.: “Mapping the Capitol Attack and Its Aftermath: Tech, Extremism and Jan. 6 — with BEN DALTON, RYAN GOODMAN, JUSTIN HENDRIX, SHANNON HILLER, JARED HOLT, MARY MCCORD, CANDACE RONDEAUX, SHAWN WALKER and ERIC WARD”\n— CNN, 8 p.m.: “Live from the Capitol: January 6th, One Year Later — with LIZ CHENEY, JASON CROW, HARRY DUNN, VERONICA ESCOBAR, MICHAEL FANONE, RUBEN GALLEGO, AQUILINO GONELL, DANIEL HODGES, DAN KILDEE, NANCY PELOSI, JAMIE RASKIN, LISA BLUNT ROCHESTER, BENNIE THOMPSON and SUSAN WILD”\nHave a natsec-centric event coming up?",
    "First is “the issue of intelligence collection to inform kinetic operations.” Human sources, they argue, “minimize the risk of flawed information if managed correctly.” Furthermore, the errant drone attack in Kabul last August will likely prompt the Pentagon “to be more hesitant in ordering similar strikes in the future” — resulting in “a reticence to strike terrorist networks as they reconstitute, ceding the advantage to violent extremists as they seek to recruit, recuperate, and rearm.”\nSecond, Hamming and Clarke highlight the dubious effectiveness of “leadership decapitation,” or the targeting of principal figures in militant Islamic networks during the past two decades.",
    "KATIE PUTZ, a managing editor at The Diplomat and an expert on Central Asia, tweeted that the demonstrations were long in the making: “The current protests in Kazakhstan definitely qualify as unprecedented in scale & timing [but] the protests in 2016 and 2019 in KZ were precursors and, for the authorities, missed off-ramps.”\nFRANCE OPENS TERROR PROBE AFTER SAUDI ARABIA BLAST: Prosecutors in France are opening a terrorism investigation into the explosion last week at the Dakar Rally race in Saudi Arabia that wounded PHILIPPE BOUTRON, the French driver of a support vehicle for the Sodicars Racing team, per BBC News.",
    "In Japan, Prime Minister KISHIDA FUMIO said it is “truly regrettable that North Korea has continued to fire missiles since last year.” And as for China, Foreign Ministry spokesperson WANG WENBIN said “all parties concerned should keep in mind the big picture [and] be cautious with their words and actions.”\nISRAEL’S MIL INTEL CHIEF FAVORS IRAN DEAL: Axios’ BARAK RAVID reports that Israel’s military intelligence chief, Maj. Gen. AHARON HALIVA, told the country’s Security Cabinet Sunday that Jerusalem would be better off if the Iran deal remained intact.",
    "The source said Satterfield will provide continued U.S. focus, necessary because of ongoing instability and inter-connected challenges in the region.”\nU.S. SANCTIONS BALKAN LEADER: The Treasury Department’s Office of Foreign Assets Control has designated MILORAD DODIK, one of the three members of the presidency of Bosnia and Herzegovina, and a media platform under his control “in response to Dodik’s corrupt activities and continued threats to the stability and territorial integrity” of the southern European nation.",
    "“USAGM and OCB leadership continue to explore all options for cost reductions without compromising the ability to achieve its mission, including personnel reductions, to operate within the funding levels set by the Congress in recent years and to meet the President’s 2022 budget request for OCB of $13m.”\nThe budget for OCB has seen a steady decline in recent years, with the office spending nearly $29 million in fiscal year 2019, then almost $25 million in 2020 and nearly $20 million in 2021.",
    "What to Read\n— DAVID FRUM, The Atlantic: “How to Disable Putin’s Energy Weapon”\n— TOM O’CONNOR and NAVEED JAMALI, Newsweek: “A Year After 1/6, Ukraine's War Draws U.S. Far-Right to Fight Russia, Train for Violence at Home”\n— KEJAL VYAS, The Wall Street Journal: “Venezuela’s U.S.-Backed Opposition Frays as Nicolás Maduro Tightens Grip”\nTomorrow Today\n— The president and the vice president will deliver remarks to mark one year since the Jan. 6 Capitol insurrection, per the White House.",
    "“Cumulatively, these actions threaten the stability, sovereignty, and territorial integrity of [Bosnia and Herzegovina] and undermine the Dayton Peace Accords, thereby risking wider regional instability.”\nMOST OHIO GOP CANDIDATES AGAINST 2SS: Five of the six candidates vying for the Ohio Republican Senate nomination refused to endorse a two-state solution for Israelis and Palestinians should they eventually get the job, Jewish Insider’s MATTHEW KASSEL reports.",
    "In a news release, the department accused Dodik of undermining his country’s institutions “by calling for the seizure of state competencies,” as well as by using his official position “to accumulate personal wealth through graft, bribery, and other forms of corruption.”\nDodik’s “divisive ethno-nationalistic rhetoric reflects his efforts to advance these political goals and distract attention from his corrupt activities,” the department charged.",
    "“While losing a leader or a key network hub may represent a setback for a group,” they write, “history shows that those individuals over time are replaced.” The strategy also “runs the very real risk of helping militants to recruit and mobilize, using collateral damage to further their cause and rally the population to their side.”\nTransitions\n— NATHAN SALES has joined the Soufan Group as a senior adviser.",
    "Broadsides\nEXPERTS SLAM OVER-THE-HORIZON PLAN: The Biden administration’s over-the-horizon capabilities in Afghanistan and elsewhere around the globe are “unlikely to yield any strategic victory in combating terrorism in the long term,” TORE HAMMING and COLIN P. CLARKE write in Foreign Policy — savaging the president’s preferred tactic for exerting American military force in the Middle East.",
    "“I will ensure that any restructuring and staffing decisions don’t undermine the work of Radio and TV Marti, or the new technologies and internet freedom tools from the Office of Cuba Broadcasting.”\n“It’s outrageous that the Biden administration wants to cut funds for Radio and TV Martí, a critical and independent source of information in support of democracy and Cubans on the island.",
    "Psaki responded that the president “absolutely plans” to offer a name, but “[j]ust like any position, he’s always looking to find the right person to nominate to fill the role — an important one.”\nStill, our contacts remain puzzled and frustrated about why it’s taking so long, especially as Russian President VLADIMIR PUTIN threatens a renewed invasion of its neighbor.",
    "“Putin’s persistent provocations along the Ukraine border and increasing belligerence underscore the importance of having a U.S. ambassador seated in Kyiv to support our Ukrainian partners at this critical moment.”\n“It is a mystery” why no one has been named, said WILLIAM TAYLOR, a former U.S. ambassador to Ukraine now at the U.S. Institute of Peace.",
    "The “fastest option” to fix that problem, according to the report, involves contracting private security officers in posts where a Capitol Police officer might not be necessary or where the department needs a “tactical advantage.”\nIn addition, the report states that Capitol Police are close to completing a nationwide search for an intelligence chief.",
    "The ‘mystery’ of the missing Ukraine ambassador\nBy ALEXANDER WARD and QUINT FORGEY\n01/05/2022 04:03 PM EST\nWith help from Daniel Lippman\nSend tips | Subscribe here | Email Alex | Email Quint\nNearly a full year into JOE BIDEN’s presidency, the U.S. ambassador’s chair in Kyiv remains empty — and WTF-laden whispers are swirling around Washington.",
    "— The Intelligence and National Security Alliance, 9 a.m.: “Coffee and Conversation With MARK ANDRESS”\n— The Brookings Institution, 10 a.m.: “The January 6 Insurrection: One Year Later — with KATIE BENNER, SEAMUS HUGHES, QUINTA JURECIC, ROGER PARLOFF and BENJAMIN WITTES”\n— The Atlantic Council, 11 a.m.: “What Is Russia’s Endgame in Ukraine?",
    "Flashpoints\nKAZAKHSTAN IN CHAOS: Kazakhstani President KASSYM-JOMART TOKAYEV threatened “to act as toughly as possible” to quash protests across the Central Asian nation, shortly after accepting the government’s resignation and introducing a state of emergency in several provinces, report The Guardian’s SHAUN WALKER and NAUBET BISENOV.",
    "“Haliva, who was appointed as the head of military intelligence in October, told the Cabinet that a deal in Vienna would serve Israel’s interests by providing increased certainty about the limitations on Iran's nuclear program, and it would buy more time for Israel to prepare for escalation scenarios,” Ravid reported.",
    "And in a call with lawmakers Tuesday, Capitol Police Chief J. THOMAS MANGER and House Sergeant at Arms WILLIAM WALKER detailed some other proposals under consideration — such as enhanced screening for Capitol visitors, similar to the White House’s system, as well as plans to beef up security at entrance checkpoints.",
    "On the Hill\nCAPITOL SECURITY OFFICIALS REVEAL POST-INSURRECTION REFORMS: The Capitol Police Board has laid out a lengthy list of reforms that it says have changed the way law enforcement will protect congressional lawmakers in the aftermath of last year’s violence on Jan. 6, per our own NICHOLAS WU and KYLE CHENEY.",
    "“Capable of being hosted from littoral combat ships (LCS), operated from shore, or vessels of opportunity, UISS provides acoustic and magnetic minesweeping coupled with the unmanned, semi-autonomous, diesel-powered, aluminum-hulled mine countermeasures unmanned surface vehicle (MCM USV),” the release continued.",
    "Despite the drastic and escalating efforts by different [cyber] attackers, we succeeded at blocking thousands of cyber attacks in time –– and before they caused broad damage to the civilian sector.”\nThere is currently no planned successor for Unna, so his deputy will lead the agency for the time being.",
    "French anti-terrorism prosecutors have announced a preliminary investigation into “multiple attempted killings in connection with a terrorist group,” and the French foreign ministry has warned its citizens in Saudi Arabia to exercise “maximum vigilance” following the explosion.",
    "NORTH KOREA LAUNCHES MISSILE: The U.S. Indo-Pacific Command has confirmed North Korea’s firing of a ballistic missile Wednesday, a launch which comes after leader KIM JONG UN pledged at a ruling party conference last week to further strengthen Pyongyang’s military capability.",
    "Kazakhstan is part of an economic union with Russia and the two countries share a long border.” Tokayev has reportedly asked Putin for military assistance to squash the protests, but the troops that might be called upon to assist currently are busy just outside Ukraine.",
    "“While we have assessed that this event does not pose an immediate threat to U.S. personnel or territory, or to our allies, the ballistic missile launch highlights the destabilizing impact of the DPRK’s illicit weapons program,” U.S. INDOPACOM said in a statement.",
    "The Inbox\nFIRST IN NATSEC DAILY –– USAGM CONSIDERING CUBA BROADCASTING DOWNSIZE: The U.S. Agency for Global Media is looking into a potential downsizing of its Office of Cuba Broadcasting, per our own DANIEL LIPPMAN, its hands forced by an ever-shrinking budget.",
    "“I’ve continuously raised to State Department officials the urgent need for this post to be filled in Ukraine,” Sen. JEANNE SHAHEEN (D-N.H.), chair of the Senate Foreign Relations Subcommittee on Europe and Regional Security Cooperation, told NatSec Daily.",
    "Meanwhile, the White House concluded that a lack of high-level intelligence sharing and imagination of how bad the protest could be led to the horrific scenes last January, per The Washington Post’s DEVLIN BARRETT, ASHLEY PARKER and AARON DAVIS.",
    "SECRET AFGHANISTAN BRIEFING: Defense Secretary LLOYD AUSTIN and Secretary of State ANTONY BLINKEN will privately brief members of the Senate Foreign Relations Committee next week on the administration’s Afghanistan policy, the panel announced.",
    "Others, including State Sen. MATT DOLAN and Cleveland businessmen BERNIE MORENO and MIKE GIBBONS, suggested favoring the approach in theory but were pessimistic about the possibility or desirability of pursuing negotiations at present.",
    "Also on Wednesday, Kazakhtelecom, the country’s largest telecommunications company, shut off the internet as protesters — first mobilized last weekend after a sharp increase in fuel prices — continued to clash with law enforcement.",
    "“As OCB undergoes reforms, now is not the time to cut critical services supporting the free flow of information into and out of the island,” Sen. BOB MENENDEZ (D-N.J.), chair of the Senate Foreign Relations Committee, told Lippman.",
    "“Sullivan said in the U.S.-Israel meeting that if no agreement is reached in Vienna within weeks and the Iranians aren't negotiating in good faith, the U.S. should walk away from the talks, the Israeli officials said,” Ravid added.",
    "“Yesterday USAGM notified Congress of its intention to evaluate a potential Reduction-in-Force (RIF) within the OCB through consultation with experts within the Office of Personnel Management,” UASGM said in a statement to Lippman.",
    "The Axios reporter also wrote that national security adviser JAKE SULLIVAN told his Israeli counterparts on Dec. 22 in Jerusalem that the threat of snapback sanctions should be used if Iran pushes toward weapons-grade uranium.",
    "And STEVEN PIFER, a former U.S. ambassador in Ukraine, told us that the current chargé d’affaires in Kyiv, KRISTINA KVIEN, “is doing a superb job.… Why not nominate her?” (Taylor enthusiastically agreed with this suggestion.)",
    "While you’re at it, follow the rest of POLITICO’s national security team: @nahaltoosi, @woodruffbets, @politicoryan, @PhelimKine, @BryanDBender, @laraseligman, @connorobrienNH, @paulmccleary, @leehudson, and @AndrewDesiderio.",
    "Feltman’s decision to resign after more than nine months on the job comes as the veteran diplomat remains engulfed in U.S. efforts to resolve Ethiopia’s civil war; he is scheduled to travel to the country yet again Thursday.",
    "South Korean Defense Minister SUH WOOK “said the launch is seen as part of North Korea’s military buildup, but that South Korea is analyzing whether it had any political intention,” per The Associated Press’ HYUNG-JIN KIM.",
    "HORN OF AFRICA ENVOY TO RESIGN: JEFFREY FELTMAN will step down as U.S. Special Envoy for the Horn of Africa and be replaced by DAVID SATTERFIELD, the outgoing U.S. ambassador to Turkey, according to Reuters’ HUMEYRA PAMUK.",
    "The Complex\nNAVY COMPLETES UNMANNED MINESWEEPER TRIAL: Naval Sea Systems Command successfully completed a shock test of its new unmanned minesweeper, moving the surface vessel one step closer to full use this year.",
    "She previously was an assistant professor at the Air Command and Staff College, Air University, where she also served as a course director for war theory and the director of instruction in international security.",
    "Keystrokes\nISRAEL’S CYBER CHIEF STEPS DOWN: YIGAL UNNA, head of the Israel National Cyber Directorate, will step down from his role after four years in charge, The Jerusalem Post’s YONAH JEREMY BOB reports.",
    "One is that the administration didn’t want a pick to languish during a historic block of nominees by Republican Senators, potentially giving GOP lawmakers leverage in the standoff over Nord Stream 2 policy.",
    "Walker and Bisenov note that the images of Kazakhstani police “being overpowered by protesters are likely to cause alarm in the Kremlin, as another country neighbouring Russia succumbs to political unrest.",
    "During the Trump administration, Sales was the acting undersecretary of State for civilian security, democracy, and human rights as well as the ambassador-at-large and coordinator for counterterrorism.",
    "Another is that Biden's team has struggled to find a career diplomat capable enough to handle a tough portfolio but still wants to keep their promise of minimizing political appointees in key posts.",
    "After all, it’s been more than two years since the U.S. last had a Senate-confirmed ambassador in Ukraine when President DONALD TRUMP removed MARIE YOVANOVITCH over … umm … policy disagreements.",
    "The survey results are yet another sign of the Republican Party’s turn away from a long-standing and bipartisan American policy, stemming largely from the Trump administration’s rejection of it.",
    "Former Ohio State Treasurer JOSH MANDEL went a step further than his opponents, rejecting the idea entirely — a position that few Republicans have been willing to adopt publicly,” Kassel wrote.",
    "“Out of six candidates who submitted answers to a range of questions, just one, former GOP state party chair JANE TIMKEN, directly endorsed a two-state solution, even as she put forth caveats.",
    "“The U.S. commitment to the defense of the Republic of Korea and Japan remains ironclad.”\nOther Indo-Pacific powers also weighed in on the launch — North Korea’s first in roughly two months.",
    "Furthermore, two Cabinet members — including Foreign Minister YAIR LAPID — said Israel shouldn’t criticize the Biden administration openly should a deal be reached in the coming weeks.",
    "This space is reserved for the top U.S. and foreign officials, the lawmakers, the lobbyists, the experts and the people like you who care about how the natsec sausage gets made.",
    "The move is likely to face stiff bipartisan resistance by some on the Hill, even though OCB has provided some taxpayer-funded embarassments, such as an anti-Semitic segment.",
    "My office is in contact with USAGM and I will do everything I can to prevent this unjustified cut,” said Sen. MARCO RUBIO (R-Fla.), a longtime critic of the Cuba regime.",
    "The briefing, which will be conducted in a secret Senate facility, will touch upon continuing evacuation efforts, terrorist gains in the country and the Taliban’s rule.",
    "”[I]n this case the Biden administration has only itself to blame,” former top U.S. diplomats DAVID KRAMER and JOHN HERBST wrote in a Tuesday Washington Post op-ed.",
    "The presidential residence in Almaty, Kazakhstan’s largest city, was engulfed in flames, while armed demonstrators stormed another government building, per the AP.",
    "It also indicates the administration’s disrespect — however unintentional — for Ukraine.”\nAsked for comment, the State Department referred us to the White House.",
    "— KELLY GRIECO has joined the Atlantic Council’s Scowcroft Center for Strategy and Security as a senior fellow within the New American Engagement Initiative.",
    "But the board’s 10-page report also addressed what it described as the Capitol Police’s “biggest challenge”: a staffing shortage of roughly 447 officers.",
    "“It’s inexplicable,” and his high-level contacts in the administration “cannot give me an answer.”\n“I asked as recently as Monday,” he told NatSec Daily.",
    "The name most often floated for the role is BRIDGET BRINK, a seasoned veteran of the Foreign Service who’s currently the U.S. ambassador to Slovakia.",
    "A senior administration official said nothing nefarious is going on here: the delay simply stems from the Biden team’s careful, deliberative process.",
    "Boutron’s vehicle was damaged by the blast as it left a hotel near Jeddah’s international airport just two days before the start of the race.",
    "Even some of the most Ukraine-focused lawmakers are in the dark about the nomination, a sign that the “right person” hasn’t been found yet.",
    "Unna was the third leader of Israel’s cyber agency, but the first with defensive and other broad powers previously held by the Shin Bet.",
    "Aim your tips and comments at award@politico.com and qforgey@politico.com, and follow us on Twitter at @alexbward and @QuintForgey.",
    "Since assuming the special envoy post last April, Feltman also has dealt with the fallout from Sudan’s military coup last October.",
    "Whatever the reason, no one disputes that taking a year to name an ambassador to Ukraine is “exceedingly long,” in Taylor’s words.",
    "VANCE, the Hillbilly Elegy author and venture capitalist, was largely ambivalent and said he would defer to Israel on the matter.",
    "Per Reuters, “Feltman took the role with an intention to serve for less than a year, a source familiar with the matter said.",
    "A less-mentioned option is GEOFFREY PYATT, now America’s ambassador in Greece who led the Ukraine mission from 2013 to 2016.",
    "The test “demonstrates the survivability” of the Unmanned Influence Sweep System, LCS Mission Modules Program Manager Capt.",
    "The UISS is projected to replace the Navy’s aging Avenger-class minesweeping ships and MH-53Es Sea Dragon helicopters.",
    "Shoot us an email at award@politico.com or qforgey@politico.com to be featured in the next edition of the newsletter.",
    "Boutron suffered serious leg injuries and was placed in a medically-induced coma after being repatriated to France.",
    "\"It will be a big surprise if some kind of deal doesn’t emerge from Vienna,\" a senior Israeli official told Ravid.",
    "This is an oversight the administration should correct as soon as possible,” Pifer continued in an email.",
    "“It has been a great and rare honor to serve the State of Israel and to protect its security,” Unna said.",
    "On Tuesday, a reporter asked White House press secretary JEN PSAKI why Biden had yet to tap someone.",
    "“I can think of several other career Foreign Service officers who would make excellent nominees.",
    "And thanks to our editor, Ben Pauker, who’s upset he’s not on the Ukraine ambassador shortlist.",
    "“Failing to arrange for an ambassador in Kyiv is not just a bad way to conduct foreign policy.",
    "Hamming and Clarke pinpoint “two key analytic flaws” in the over-the-horizon strategy.",
    "It’s shameful and embarrassing, especially following last year’s historic protests.",
    "(Sen. TED CRUZ, however, has called on Biden to fast-track a Ukraine ambassador.)",
    "“Our fundamental mission of defending critical infrastructure was fully realized.",
    "In other words (not theirs), it’s either indecision or the pains of bureaucracy.",
    "As a result, USAGM’s acting CEO, KELU CHAO, informed Sen. CHRIS COONS (D-Del.)",
    "Follow us on Twitter\nAlex Ward @alexbward\nQuint Forgey @QuintForgey\nFollow Us",
    "Another five French citizens who also were in the vehicle were unharmed.",
    "Transitioning to a new defense-adjacent or foreign policy-focused gig?",
    "of the push for “workforce shaping services” in a Tuesday letter.",
    "IT'S WEDNESDAY: Thanks for tuning in to NatSec Daily.",
    "GODFREY “GUS” WEEKES said in a news release.",
    "The NSC pointed us to Psaki’s remarks.",
    "Others have their own theories.",
    "J.D."
  ]
}