{
  "id": 26557,
  "mediaId": 2532,
  "date": "2022-02-23",
  "headline": "Trump's response to Putin's invasion of Ukraine reveals divisions among Republicans",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/03/03/23fda673-2a17-47c4-ba9a-b074c782df27/thumbnail/1200x630g3/1d9ca3752e21543f449330f1a67f6fa8/gettyimages-1304610267.jpg",
  "link": "https://www.cbsnews.com/news/russia-ukraine-republican-response/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caitlin Huey-Burns, Caitlin Huey-Burns Is A Political Reporter For Cbs News., Robert Costa",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican lawmakers and candidates are largely united in their belief that President Biden's response to Russia's invasion of Ukraine has fallen short — in fact, it's former President Donald Trump's remarks on Vladimir Putin and Ukraine that are revealing fissures in the Republican Party over the scope of U.S. involvement in foreign conflicts.",
    "Vance, one of her rivals, made a non-interventionist case, arguing that the invasion \"has nothing to do with our national security\" and it is \"distracting our idiot 'leaders' from focusing on the things that actually do matter to our national security, like securing the border & stopping the flow of Fentanyl that's killing American kids.",
    "The varied and at times conflicting Republican reactions, both on the campaign trail and on Capitol Hill, underscore how the party remains deeply influenced by Trump, who praised Vladimir Putin as \"savvy\" after the Russian president recognized the independence of two Russian separatist-controlled areas in Eastern Ukraine.",
    "The foreign policy debates, and the way in which once long-held Republican beliefs on America's role in the world dramatically evolved in the Trump era, will be on display at the Conservative Political Action Conference, an annual activist gathering that opened Thursday in Orlando, Florida.",
    "While most Republicans have balked at Putin's moves in Ukraine and called for swift and steep sanctions, others aligned with Trump have echoed the former president and adopted a far less hostile view of the Russian leader and been more circumspect about any U.S. military action in Europe.",
    "At CPAC, Texas Senator Ted Cruz declined to comment directly on Trump's recent remarks, though he did say in an interview that \"with some regularity,\" he disagrees with the former president's rhetoric but thinks that on Russia-related policy, Trump was superior to Mr. Biden.",
    "Speaking in Iowa on Wednesday hours before the invasion began, Pompeo stepped up his criticism of Putin, calling him \"evil\" and an autocrat who has \"wanted to recreate this notion of the greater Russia or the Soviet Union for a long time.\"",
    "Republicans have largely been united, however, on hitting Biden for the conflict in Eastern Europe without having to be accountable for a congressional vote, with key figures across the party criticizing the president's leadership.",
    "With the invasion well underway on Thursday, House Republican Leader Kevin McCarthy, a close ally of Trump, issued a statement that was notable for not mentioning the current administration or the previous one.",
    "Trump called Putin \"smart\" in a radio interview with \"The Clay Travis & Buck Sexton Show\" on Tuesday, after the Russian president gave a speech that laid out his justification for Russia's move into Ukraine.",
    "Senate Majority Leader Mitch McConnell also called for faster and more sweeping sanctions, and urged the halt of the construction of the Nord Stream 2 gas pipeline between Russia and Germany.",
    "She has focused her comments on the Biden administration, while giving a nod to Trump, tweeting, \"Vladimir Putin is on the verge of recreating the Russian Empire, if not the Soviet Union.",
    "A CBS News poll earlier this month found that Republicans would rather the U.S. stay out of the conflict, and they overwhelmingly disapprove of how he is handling Russia more broadly.",
    "That sentiment has been bolstered by Trump allies on prominent media platforms, many of whom been framing Washington's alarm about Russia as an establishment, even elitist, concern.",
    "And the only way to do that is impose the sanctions, and Joe Biden just did that, finally, but now the problem is Putin doesn't believe those sanctions will stay,\" Cruz said.",
    "Throughout his first presidential campaign and his presidency, Trump criticized NATO and allied countries for not paying their fair share when it comes to joint defense.",
    "Mike Pompeo, who served as secretary of state and CIA director in the Trump administration, told Fox News Sunday last month that Putin is a \"very talented statesman.",
    "The comments were reminiscent of Trump's notorious 2018 summit with Putin in Helsinki, in which he took the Russian president's word over U.S. intelligence agencies.",
    "In the primary for retiring Senator Rob Portman's seat in Ohio, for example, GOP candidate Jane Timken joined other Republicans in calling for harsher sanctions.",
    "At a Mar-a-Lago fundraiser Wednesday evening, he continued his praise of Putin, calling him \"pretty smart\" in \"taking over a country for $2 worth of sanctions.\"",
    "Former Ambassador to the U.N. Nikki Haley, who is a possible 2024 presidential contender, has shown an eagerness to engage in the conversation about Russia.",
    "Years later, Republicans with ambitions for higher office have praised Trump's handling of Russia, with some appearing to offer similar views of Putin.",
    "\"The way to stop the invasion is for Russia to believe that they will not be able to get their gas to Europe if they continue this invasion.",
    "Still, the GOP's own muddled foreign policy stance has different blocs competing for political capital and sway with core party voters.",
    "Timken, who released an ad last week tying herself to Trump, fired back at Vance by noting Ohio is home to 80,000 Ukrainian-Americans.",
    "As Russia began its full-scale invasion later Wednesday, Trump told Fox News that \"This all happened because of a rigged election.\"",
    "Arkansas Senator Tom Cotton has criticized the administration for waiting to impose sanctions until after Russia invaded Ukraine.",
    "Both Vladimir Putin and President Xi of China took the wrong message out of our precipitous withdrawal from Afghanistan.",
    "\"And so they are pushing the limits everywhere in reaction to the perception of American weakness and loss of resolve.\"",
    "It looked not only chaotic, but it looked weak,\" McConnell said in a talk with Kentucky business leaders this week.",
    "But in television interviews and on Twitter, Pompeo has argued that Trump's approach to Russia was successful.",
    "President Trump proved for four years that we can have a secure Southern Border AND stand up to our enemies.\"",
    "On Capitol Hill, Republicans have taken a more hawkish approach and pushed Biden to issue tough sanctions.",
    "The United States stands with the people of Ukraine and prays for their safety and resolve,\" he said.",
    "(Video of the remarks was circulated on Twitter by American Bridge, a national Democratic super PAC.)",
    "Earlier this week, Pompeo took a less laudatory approach tweeting, \"Vladimir Putin is the aggressor.",
    "(The Biden administration issued sanctions against the company building the pipeline on Wednesday.)",
    "She invoked both Reagan and Trump, saying \"America First means peace through strength.",
    "It wasn't so long ago that the leader of the free world prevented that from happening.",
    "Trump is scheduled to speak, along with some more traditional GOP voices.",
    "So Putin is now saying it's independent, a large section of Ukraine.",
    "\"Vladimir Putin is the same person he was during our administration.",
    "\"There is not a minute to lose,\" Cotton tweeted earlier this week.",
    "The only thing that has changed is American leadership,\" he said.",
    "Today, under Biden, our weakness is teasing Russian aggression.\"",
    "\"Vladimir Putin's invasion of Ukraine is reckless and evil.",
    "\"I think this is the moment to indicate American strength.",
    "Putin declares a big portion of the Ukraine of Ukraine.",
    "The fissures are also evident on the campaign trail.",
    "He accused Timken of being a \"Cheney Republican.\"",
    "\"Putin must be held accountable for his actions.\"",
    "And he's going to go in and be a peacekeeper.\"",
    "Aaron Navarro contributed to this report.",
    "He was a KGB agent for goodness sakes.",
    "Putin declares it as independent.",
    "The Ukrainians are the victims.\"",
    "And we should respect that.\"",
    "I said, 'How smart is that?'",
    "\"I said, 'This is genius.'",
    "He knows how to use power.",
    "He has lots of gifts.",
    "Oh, that's wonderful.",
    "J.D."
  ]
}