{
  "id": 26553,
  "mediaId": 2612,
  "date": "2022-02-28",
  "headline": "Clinton says Republicans are supporting Putin because he’s anti-gay & anti-freedom",
  "image": "https://abuwjaawap.cloudimg.io/v7/_lgbtqnation-assets_/assets/2019/11/hillary-clinton-1.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=40",
  "link": "https://www.lgbtqnation.com/2022/02/clinton-says-republicans-supporting-putin-hes-anti-gay-anti-freedom/",
  "mediaOutlet": "lgbtqnation.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bil Browning",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance said on an episode of Steve Bannon’s “War Room” show, “I gotta be honest with you, I don’t really care what happens to Ukraine one way or another.”\n\n“I do care,” he continued, “about the fact that in my community right now the leading cause of death among 18-45-year-olds is Mexican fentanyl that’s coming across the southern border.”\n\nMissouri Senator Josh Hawley (R) took an isolationist stance regarding Ukraine on Tucker Carlson’s Fox Network broadcast, “And right now, we’ve got to put American security interests first.",
    "Hillary Clinton attends the Clinton Global Initiative Annual Meeting at The Shertaon New York Hotel on September 25, 2013 in New York City Photo: Shutterstock\n\nHillary Clinton attends the Clinton Global Initiative Annual Meeting at The Shertaon New York Hotel on September 25, 2013 in New York City Photo: Shutterstock\n\nFormer Secretary of State and presidential candidate Hillary Clinton ripped into Republicans and conservative pundits who have given cover to Russian President Vladimir Putin.",
    "The GOP and their followers are enrapt with the Russian strongman because he is “anti-gay, anti-freedom, and anti-democracy.”\n\nRelated: The GOP is bragging on Twitter about reaching out to minority voters & it’s not going over well\n\nThe religious right idolized Putin because he targeted LGBTQ people.",
    "They somehow believe that because Putin presents himself as a strong leader on behalf of certain values that are anti-gay, that are anti, you know, freedom and democracy that’s so messy, that somehow that corresponds with the views of certain members and elements of the Republican Party.",
    "Scott Lively, who fueled the homophobia that led to Uganda’s law to make homosexuality a crime punishable by death, regularly visited Russia and once described it as a “beacon of freedom.”\n\nThe appearance of Donald Trump as the GOP standard-bearer only solidified that love of Russia.",
    "There has been, sadly, a total loss of spine and conscience among too many Republicans who at first saw no harm in echoing and kind of parroting the kind of crazy stuff that Trump would say totally against history, totally against common sense as you know so well.",
    "And now they’re kinda caught in a kind of downward spiral where they’re afraid to stand against even the most outrageous comments.”\n\n“There’s also another element, which is these people are naive in such a dangerous way.",
    "Russia’s anti-LGBTQ laws were a “good thing” that “most of the people in the United States” would support, Austin Ruse of the Catholic Family and Human Rights Institute (C-FAM), insisted.",
    "In the days leading up the invasion, the Fox News commentator said he had nothing against Putin since Putin had never tried to get him fired, unlike the demonic libs.",
    "GOP members of Congress, Fox host Tucker Carlson, and former president Donald Trump (R) have all praised Putin or downplayed the dictator’s aggression.",
    "Trump favored Putin’s word over his own intelligence officers, despite all the evidence of Russia’s interference in the 2016 presidential election.",
    "There’s always Tucker Carlson, who seems to be auditioning for a primetime spot on Russian television (which he’s already getting).",
    "We need to ask our European allies to do more.”\n\nClinton explained to Joe Scarborough how American politics has come to this.",
    "… I said, ‘How smart is that?’ And he’s going to go in and be a peacekeeper….We could use that on our southern border.",
    "“I said, ‘This is genius,’” Trump said on a right-wing podcast after the dictator invaded.",
    "And that means we’ve got to focus on China, and we’ve got to focus on our own borders.",
    "Very, very well.”\n\nTrump is still lauding Putin, but he’s not alone.",
    "“Putin declared a big portion of … Ukraine … as independent.",
    "“I think it happened starting with the ascent of Trump.",
    "Here’s a guy who’s very savvy … I know him very well.",
    "That’s the strongest peace force I’ve ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "They’re going to keep the peace all right.",
    "GOP Senate candidate from Ohio, J.D.",
    "They could not be more mistaken.”",
    "Oh, that’s wonderful."
  ]
}