{
  "id": 26558,
  "mediaId": 2819,
  "date": "2022-03-29",
  "headline": "To Understand the Republican Party, Look at Ohio’s Senate Primary",
  "image": "https://api.time.com/wp-content/uploads/2022/03/Ohio-Senate-debate.jpg?quality=85&w=1200&h=628&crop=1",
  "link": "https://time.com/6162390/republican-ohio-senate-primary/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Elliott",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Not to be outdone, one-time front-runner and three-time Senate candidate Josh Mandel bordered close to screaming when it came time for his fealty test: “For all the RINOs out there and all the media elites out there, the 2020 election was stolen from Donald J. Trump.”\n\nFormer Ohio Republican Party Chairwoman Jane Timken—installed by Trump in 2017—continued with her best effort to balance her MAGA credentials with the support of retiring Sen.",
    "Some wiley operatives game the system to give an advantage to their least threatening rival on the other side, as Democratic Sen. Claire McCaskill did in securing the Republican nomination for Todd Akin, who would go on to tank his campaign in 2012 when describing “legitimate rape.”\n\nThis sort of strategic mis-pick is what is keeping Republicans in Washington worried, not just for the Senate but other races, too.",
    "And by the time the question made its way to businessman Mark Pukita, who had planned to primary Portman even before he decided to retire, the candidates had all seemed exhausted by the moderator’s fact-checking that none of what they were saying was true.",
    "From the very first minutes of the debate last night, it seemed like a parody of pandering as the seven candidates looked for a blessing from Trump, who despite aggressive courtship has remained publicly neutral so far ahead of the state’s May 3 primary.",
    "The roads to majorities are littered with bad choices, from Republican Christine “I Am Not A Witch” O’Donnell in 2010 to Democrat Chris Janicek’s candidacy a decade later that continued even after a sexting scandal with a campaign staffer.",
    "If Republicans retake the majority after this fall’s elections, it’s widely and credibly expected that he would reclaim the gavels—and the power to check President Joe Biden’s agenda for the balance of his first term.",
    "That concern for that one vote doesn’t end on Election Day,” said Dolan, a member of one of the wealthiest families in America and a part-owner of the baseball team now known as the Cleveland Guardians.",
    "For instance, expected Democratic nominees Tim Ryan for Senate and Nan Whaley for Governor might be able to find a symbiosis on the Ohio ticket that could overcome numerical problems for their party.",
    "Just take Ohio, where the Senate primary has devolved in large part into an attempt for the candidates to present themselves as the best avatar for Trump’s America First rhetoric.",
    "Democrats, by contrast, need to hold those current seats or offset tough races with pick-up chances in places like Pennsylvania, Wisconsin, North Carolina, or perhaps even Ohio.",
    "Republicans are eyeing a map that has many routes to reclaim the gavel in early 2023, including pick-up opportunities in Georgia, Nevada, Arizona, and maybe even New Hampshire.",
    "With that in the backdrop and the specter of an endorsement in the mix, each contender took turns coddling Trump’s—and many Republicans’—false views of the real result in 2020.",
    "Doug Ducey both opted to forgo Senate runs because of the dance they’d have to do with Trump; both can be critical of the ex-President, a toxic trait in Republican primaries.",
    "With one notable exception, the candidates all seemed to endorse Trump’s belief that the 2020 election was stolen and he remains the rightful President of the United States.",
    "(Just look at what happened last week when Rep. Mo Brooks of Alabama didn’t heel to Trump’s Big Lie: Brooks, about as Trumpy as they come, saw his endorsement withdrawn.)",
    "But sometimes the garish hues render the winners unpalatable for a general election— a risk that often gets far too little strategic discernment from primary voters.",
    "Vance mocked the moderator’s “fact-check wand”—to dangerous, like when rival Neil Patel asserted Georgia, Arizona, and Pennsylvania were illegitimate counts in 2020.",
    "Let’s return to the stage outside of Dayton last night, where state Sen. Mike Dolan made the lone argument against the Trumpward drift of his Republican Party.",
    "This pursuit of Trump’s blessing during the primaries may leave Republicans’ bid for Senate resurgence heading into the fall with less-than-ideal candidates.",
    "Banker Mike Gibbons, who has enjoyed a late surge in the polls as he has spent heavily, asserted that 5 million more ballots were cast than there are voters.",
    "In addition to his apparent misfire in Alabama with Brooks, Trump backed a Senate candidate in Pennsylvania who has quit the race amid abuse allegations.",
    "It was the greatest hits of conservative fantasy last night onstage in Wilberforce, Ohio, as the Republican Senate candidates clashed in another debate.",
    "Political primaries tend to reward the loudest shades along the spectrum; just look at Trump’s unexpected capture of the Republican nomination in 2016.",
    "He persuaded his close adviser Sen. John Thune to seek a fourth term rather than risk South Dakota Republicans sending another Trumpist to the Senate.",
    "It was a needless flinch from someone who has already spent more than $10 million of his own cash on the race but remains parked in the overflow lot.",
    "“There’s no doubt in my mind that there were irregularities and fraud,” said Timken, before noting Ohio broke for Trump by eight percentage points.",
    "It’s way too early to responsibly assess odds this far from Election Day, but the declared contenders do offer hints as to each party’s strategy.",
    "Polling to this point has been thin, but it’s a good bet that the closer candidates stand to Trump’s spotlight, the hotter they are politically.",
    "And a hiccup in Missouri could wind up with Trump backing a disgraced former Governor who faces new abuse allegations as he runs for Senate.",
    "A total deportation of immigrants in the country illegally and the restoration of Donald Trump to the White House as quickly as possible.",
    "At the start of his answer, Pukita acknowledged that in 90 seconds the moderator would call everything he was about to say into question.",
    "Democrats are defending the narrowest 50-50 majority coalition in the Senate, with Vice President Kamala Harris able to break the tie.",
    "And, as is clear in the Senate race, the Republican primaries have the potential to leave even the most deft survivors banged-up, too.",
    "In Alaska, where Trump is backing an effort to deny Republican Sen. Lisa Murkowski another term, it seems the quest is coming up dry.",
    "Elsewhere, McConnell is trying to steady a raft of potential successors to some of his closest allies, such as Portman and Sens.",
    "Elsewhere, Trump’s power has actually hurt Republicans’ efforts to draw recruits who would be formidable in a general election.",
    "McConnell isn’t just sitting back and bracing for incoming colleagues trying to out-Trump each other in their quest for power.",
    "He’s already proven an effective candidate slayer, forcing scores of candidates to just go home rather than face his torment.",
    "“The January 6 Commission should be investigating that instead of some false accusations of … insurrection,” Gibbons said.",
    "But Trump’s wide spray of endorsements has carried a level of risk exposure that leaves Republican insiders worrying.",
    "Mike DeWine, popular with moderates and Democrats, badly bruised, that helps the odds of Democrats at all levels.",
    "Such is the scene in the Republican Party, unfolding in states around the country but under a microscope in Ohio.",
    "Of course, behind all of this is Senate Minority Leader Mitch McConnell, as sharp a tactician as any in the GOP.",
    "Then there’s the Trump factor, possibly the most potent but unpredictable component in politics right now.",
    "Rob Portman, a level-headed Establishment figure who decided to call it quits at the end of this term.",
    "It was the perfect tableau of just how much Trump has colored the identity of the Republican Party.",
    "McConnell declined to pick up when Trump called on Jan. 6 and the two last spoke on Dec. 15, 2020.",
    "And such moves may be what keep Chuck Schumer as the Majority Leader in spite of a dicey map.",
    "After all, Trump has made clear that Dolan is not in the mix for a blessing from Mar a Lago.",
    "His pick in North Carolina hasn’t really gained the traction needed to win the Senate nod.",
    "Trump has positioned himself as the GOP kingmaker of 2022, and he may earn that title.",
    "Trump is huge in the Republican Party right now, but he’s not an unchecked autocrat.",
    "But when asked if he’d support McConnell’s return as Majority Leader, Dolan dodged.",
    "And that fever may be what costs Republicans their shot at a majority this fall.",
    "McConnell has been working for years to curb Trump’s influence on the party.",
    "“There are people up on this stage who are literally fighting for one vote.",
    "Which just proves the point: Trump’s power is immense but often mercurial.",
    "At first, it was stealthy; after Jan. 6, McConnell abandoned that ruse.",
    "It’s why, while Democrats are on the defense, they’re not defeated.",
    "His family changed the name of the team from the Cleveland Indians.",
    "This article is part of The D.C. Brief, TIME’s politics newsletter.",
    "A defense of Reps. Marjorie Taylor Greene and Madison Cawthorn.",
    "Hunter Biden’s laptop and Joe Biden’s family crime syndicate.",
    "Republicans’ display ranged from glib—as when candidate J.D.",
    "Sign up here to get stories like this sent to your inbox.",
    "Instead, McConnell kept his focus in his own backyard.",
    "Massive ballot-harvesting operations in urban areas.",
    "Write to Philip Elliott at philip.elliott@time.com.",
    "Here, it’s important to add one crucial caveat.",
    "Personality bests strategy almost every time.",
    "And that person doesn’t even vote in Ohio.",
    "Make sense of what matters in Washington.",
    "If the GOP primary leaves incumbent Gov.",
    "Sign up for the D.C. Brief newsletter.",
    "“I don’t know who’s running,” he said.",
    "Jail time for Dr. Anthony Fauci.",
    "Roy Blunt and Richard Shelby.",
    "Larry Hogan and Arizona Gov.",
    "Topics of discussion?",
    "Maryland Gov.",
    "His sin?"
  ]
}