{
  "id": 26554,
  "mediaId": 2612,
  "date": "2022-02-28",
  "headline": "American right wing isolationism & left wing whataboutism are fueling the Ukrainian war",
  "image": "https://abuwjaawap.cloudimg.io/v7/_lgbtqnation-assets_/assets/2022/02/group-hands.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=40",
  "link": "https://www.lgbtqnation.com/2022/02/american-right-wing-isolationism-left-wing-whataboutism-fueling-ukrainian-war/",
  "mediaOutlet": "lgbtqnation.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dr. Warren J. Blumenfeld",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Because I am!” And he dismissed what he considered the hyperbole over Putin’s intention to gobble up more territory stating: “Whatever [Putin’s] many faults, [he] has no intention of invading Western Europe.”\n\nIsolationism on the matter of Ukrainian sovereignty, unfortunately, can also be found on the left side of the political spectrum in the U.S. Rather than challenging Putin, supported by his tight circle of oligarchs and kleptocrats’ patently illegal and immoral incursion into Ukraine, some on the left in the U.S. are playing the dangerous game of “Whataboutism”:\n\n“It is time to rally together and root out the evils of the American oligarchical system, the atrocity that is American imperialist foreign policy, the inherent racism engrained in American institutions and the corruption of American government.” -Name withheld, Real Progressives Facebook Group\n\nOn the Real Progressives Facebook Group, I posted a picture of the Ukrainian flag I painted on a poster board and placed in a stake on my front lawn.",
    "Vance said on an episode of Steve Bannon’s “War Room” show, “I gotta be honest with you, I don’t really care what happens to Ukraine one way or another.”\n\n“I do care,” he continued, “about the fact that in my community right now the leading cause of death among 18-45-year-olds is Mexican fentanyl that’s coming across the southern border.”\n\nMissouri Senator Josh Hawley (R) took an isolationist stance regarding Ukraine on Tucker Carlson’s Fox Network broadcast, “And right now, we’ve got to put American security interests first.",
    "Though I do not personalize the force of the fury directed against my plea for the Ukrainian people, I do, however, have deep fears in what appeared to be this Facebook participants’ challenges, or more likely, their list of conditions for taking concerted actions against the Russian and Belarusian regimes.",
    "Related: The GOP is bragging on Twitter about reaching out to minority voters & it’s not going over well\n\nFor example, the twice impeached and disgraced former President of the United States, Donald Trump, continues to heap praise on his alleged friend and fellow narcissistic sociopath in the Kremlin.",
    "!”\n\nWithin an hour, several participants wrote messages challenging my assumption that most if not all progressives would welcome my posting and that they were concerned with suffering around the globe and would come to the aid of innocents in Ukraine and the sovereignty of their nation.",
    "This point is in line with another participant who challenged my posting about Ukraine who argued that the world only takes notice when white people are terrorized, but forgets and turns away its gaze when people of color need aid, like the massive number of refuges from Syria.",
    "This has caused extreme hardships and deaths as a direct result of war with ensuing famine and malnutrition upon civilian populations, which we have been calling out for years with little response on the part of the proxy governments supporting the war efforts.",
    "Basically, they were at least implying that when the world begins to take notice of suffering in areas of the world in addition to Europe, then and only then will they join in efforts to bring down oppressive regimes and mitigate suffering in Europe.",
    "Debates rage across the political landscape in the United States and around the globe concerning what steps each nation should take to protect the people in Eastern Europe and their own national economic and security self-interests.",
    "Yes, the United States has sided with the Saudis and Emirates and against the Iranians in the multilateral Yemeni Civil War since 2014 between the Abdrabbuh Mansur Hadi-led government and the Houthi armed insurgency.",
    "Though I have been a member of the group for many years, regarding my latest posting, one participant wrote that it was not appropriate for me to place it on that Facebook group.",
    "Another referred to President Joe Biden as a “war criminal” and an anti-humanitarian by supporting continuing wars and oppressive governments in places like Yemen and Guatemala.",
    "On the far right of the Republican Party in the U.S., many have taken an isolationist stance, with some coming out in support of the autocratic Russian dictator, Vladimir Putin.",
    "Concern must never depend on skin color, or gender, or sexual identity, or socioeconomic background, or ethnicity, or ability, or age, or any another other identifying factors.",
    "In the days leading up the invasion, the Fox News commentator said he had nothing against Putin since Putin had never tried to get him fired, unlike the demonic libs.",
    "Russia and its ally Belarus marched into Ukraine, its sovereign neighbor, bombing cities and townships and killing brave Ukrainian troops and frightened civilians.",
    "And yes, most likely because the people highest at risk are black and brown people, the world has turned its gaze elsewhere allowing the horrors to continue.",
    "We must perceive injustice as intersectional, and that when any group based on their social identities are targets of oppression, then no group is free.",
    "We need to ask our European allies to do more.”\n\nCarlson on his own show considered Putin a member of his home team: “Why shouldn’t I root for Russia?",
    "And this is how the far left and far right come together in hand-held closed circles of inaction (isolationism) in times of impending genocide.",
    "Lobby legislators and executives to impose THE most severe sanctions possible on Belarusian and Russian oligarchs and Putin himself.",
    "There’s always Tucker Carlson, who seems to be auditioning for a primetime spot on Russian television (which he’s already getting).",
    "… I said, ‘How smart is that?’ And he’s going to go in and be a peacekeeper….We could use that on our southern border.",
    "Hopefully, others will do the same, as well as support the brave people in Eastern Europe any and every way you can.",
    "It inhibits chances for coalitions and alliances to improve all the many troubled spots around the world.",
    "In the end, “Whataboutism” is a form of isolationism used to justify inaction in the face of oppression.",
    "To be clear, I fully appreciate and agree with these participants’ concerns, which I too share.",
    "“I said, ‘This is genius,’” Trump said on a right-wing podcast after the dictator invaded.",
    "Above the posted picture, I wrote on Facebook:\n\n“I painted a Ukrainian Flag for my home.",
    "And that means we’ve got to focus on China, and we’ve got to focus on our own borders.",
    "Call out conservative Republicans in the U.S. who are siding with fascist autocrats.",
    "Very, very well.”\n\nTrump is still lauding Putin, but he’s not alone.",
    "Regarding Putin’s actions, Trump was downright giddy with praise.",
    "This is not only self-defeating, but it is anti-humanitarian.",
    "“Putin declared a big portion of … Ukraine … as independent.",
    "Donate to Ukraine through reputable relief organizations.",
    "Here’s a guy who’s very savvy … I know him very well.",
    "That’s the strongest peace force I’ve ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "They’re going to keep the peace all right.",
    "Boycott all goods from Russia and Belarus.",
    "GOP Senate candidate from Ohio, J.D.",
    "Write letters to the editor.",
    "Open your homes to refugees.",
    "Protest in the streets.",
    "Oh, that’s wonderful.",
    "Inform yourselves.",
    "STUDY HISTORY!!!",
    "Keep vigilant."
  ]
}