{
  "id": 26566,
  "mediaId": 2575,
  "date": "2022-02-16",
  "headline": "Sen. Portman backs Timken as successor in Ohio",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4038810/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "by 18 posted onby kiryandil (China Joe and Paycheck Hunter - the Chink in America's defenses)\n\nTo: Buckeye Battle Cry; JonPreston; brownsfan\n\n\"...ensuring that this Senate seat remains Republican with a 50-50 Senate, and so much at stake.” Isn't it just AMAZING that the Brandonton DC Senate Kabuki theater has got this 50-50 thing going on virtually all the time now?",
    "“I am confident in her ability to win both the primary and the general elections, ensuring that this Seante seat remains Republican with a 50-50 Senate, and so much at stake.”\n\nPortman’s move will elevate Timken as she vies with better-known and better-funded contenders, some of whom have already spent millions on their own campaigns.",
    "by 8 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: mmichaels1970\n\nThe powerful Club for Growth backs Mandel\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ That’s a red flag, properly known as the Club for Importing Foreign Workers.",
    "To: RandFan\n\nBush League Republican endorses Bush League Republican, big surprise..../s\n\n\n\nby 7 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nshe's a RAT, a RAT I tell ya!!!!!",
    "by 15 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: RandFan; All\n\nSo...not Timken...\n\n\n\nTo: RandFan\n\nRob Porthole can blow it out his porthole!",
    "TOPICS:\n\nNews/Current Events\n\nPolitics/Elections\n\nUS: Ohio\n\nKEYWORDS:\n\nassistantdemocrat\n\nclubforgrowth\n\njanetimken\n\njoshmandel\n\nkellyanneconway\n\nporthole\n\nrobportman\n\ntimken\n\nNow you can cross her OFF your list... (LOL).",
    "by 9 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: RandFan\n\n“Now you can cross her OFF your list... (LOL).” EXACTLY what I thought.",
    "A suspicious person would say it's not coincidental...\n\n\n\nby 19 posted onby kiryandil (China Joe and Paycheck Hunter - the Chink in America's defenses)\n\nTo: cotton1706\n\nTimken was a dead letter when she announced.",
    "A survey conducted earlier this month by the Trafalgar Group, a Republican polling firm, found former state Treasurer Josh Mandel (R) leading the field with 21 percent of the vote.",
    "Rob Portman (R-Ohio) will back former Ohio Republican Party chairwoman Jane Timken as his chosen successor in an attempt to boost her through a crowded GOP field later this year.",
    "To: brownsfan\n\nSince Rand Paul joined the Bush League Republicans in calling for more visas for people to replace Americans, I won’t be taking his endorsements seriously.",
    "by 5 posted onby ConservativeInPA (Scratch a leftist and you'll find a fascist )\n\nTo: RandFan\n\nSo now we know Timkin is a deep-state Bushite RINO in the mold of Portman.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "In a statement released Wednesday, Portman said Timken would be the candidate best positioned to keep his seat in Republican hands in the midterm elections.",
    "by 12 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: RandFan\n\nIf there was any doubt about Timkin, Portman just erased it.",
    "Vance is benefitting from support of Peter Thiel, the libertarian venture capitalist who has put $10 million into a super PAC supporting his race.",
    "To: All\n\nfound former state Treasurer Josh Mandel (R) leading the field\n\n\n\nBased on name recognition, it is HIGHLY likely to stay that way.",
    "Sen. Portman backs Timken as successor in Ohio\n\nThe Hill ^ | 02/16/22 10:44 AM EST | BY REID WILSON\n\nPosted on by RandFan\n\nSen.",
    "by 17 posted onby PghBaldy (12/14 - 930am -rampage begins... 12/15 - 1030am - Obama's advance team sco uts photo-op locations.)",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "To: cotton1706\n\nI haven’t trusted Kellyanne Conway since she showed up at Trump’s inauguration looking like Paddington Bear.",
    "“I believe Jane Timken is the best candidate to advance conservative Republican policies to help Ohio workers and families.",
    "by 2 posted onby alstewartfan (\"She looks like she's 19 years old, sitting there like a lady with her legs crossed.\"",
    "To: RandFan\n\nAssistant Democrat Portman has identified Jane Timken as the chosen Assistant Democrat to suckceed him.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "by 11 posted onby brownsfan (It's going to take real, serious, hard times to wake the American public.)",
    "by 10 posted onby brownsfan (It's going to take real, serious, hard times to wake the American public.)",
    "Gibbons and Dolan have contributed more than $10 million apiece to their respective campaigns.",
    "The powerful Club for Growth backs Mandel, who ran for and lost a U.S. Senate race in 2012.",
    "The poll showed state Sen. Matt Dolan (R) and Timken tied at about 10 percent apiece.",
    "Businessman Mike Gibbons (R) took 16 percent, and author and venture capitalist J.D.",
    "Jane is smart and hard working, and understand the needs of Ohioans,” Portman said.",
    "Creepy Joe)\n\nTo: RandFan\n\nUnfortunately, Kellyanne Conway also endorsed her.",
    "A quarter of Republican voters surveyed had not yet made up their mind.",
    "Recent polls have shown Timken trailing those other candidates.",
    "To: cotton1706\n\n“Mike Gibbons seems to be the best.",
    "“ I saw Rand Paul endorsing him in an ad.",
    "To: pnut22\n\nGibbons seems a good choice.",
    "To: RandFan\n\nWe know who to reject now.",
    "(Excerpt) Read more at thehill.com ...",
    "A fresh face/outsider with experience.",
    "Hopefully, she’ll be down the list.",
    "Mike Gibbons seems to be the best.",
    "To: RandFan\n\nKiss of death.",
    "Vance took 14 percent.",
    "Skip to comments.",
    "That sways me.",
    "Good to know!",
    "Thanks Rob.",
    "Go Gibbons.",
    "Go Josh!"
  ]
}