{
  "id": 26563,
  "mediaId": 2575,
  "date": "2022-02-05",
  "headline": "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4035850/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. Liz Cheney (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and Jim Jordan (R-OH), among others.",
    "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades\n\nBreitbart ^ | Feb 2022 | JOHN BINDER5\n\nPosted on by E. Pluribus Unum\n\nThe “modern Republican” Party is scrapping its old-guard corporate ties and business special interests, an Axios report details, as Breitbart News and small-dollar donors to former President Trump steer the party’s future.",
    "Fourteen of the top GOP consultants and operatives detail how the Republican Party has shifted away from the Chamber of Commerce, the Koch brothers’ network of donor class organizations, National Review, and economic libertarian groups toward Trump’s small-dollar donors, populist-nationalist outlets like Breitbart News, and Tucker Carlson.",
    "Whereas Republicans once vied for campaign cash from the Kochs, major backers of mass immigration and job-killing free trade, candidates try to steer clear of the network while running against open borders and in support of industrial policy to reshore America’s manufacturing base.",
    "These days, it is Trump’s voters, Breitbart News readers, and Carlson viewers that Republicans hope to win over in elections rather than seeking out corporate campaign contributions through endorsements from the Heritage Foundation, FreedomWorks, and the Senate Conservatives Fund.",
    "by 14 posted onby Vaden (First they came for the Confederates... Next they came for Washington... Then they came...)\n\nDisclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "“We all owe Donald Trump a great deal for singlehandedly destroying the corrupt globalist and corporatist orthodoxies that previously defined the Republican Party, in favor of a new Republican Party, that is pro-worker and always puts America first,” Vance told Breitbart News.",
    "Those “small donors” raised $10 million for Canadian truckers in less than a week.” And they just caused GoFundMe to lose half of their customer base...supplanted by the America-loving GiveSendGo site, now at $2M for the truckers in less than 24 hours.",
    "Chuck Grassley (R-IA), Todd Young (R-IN), John Thune (R-SD), and Mike Lee (R-UT), as well as to Reps. Vern Buchanan (R-FL), Ashley Hinson (R-IA), Dan Crenshaw (R-TX), Maria Salazar (R-FL), and Don Bacon (R-NE), among others.",
    "To: E. Pluribus Unum\n\nSeems to me that’s a good thing\n\n\n\nby 9 posted onby Nifster (I’m see puppy dogs in the clouds)\n\nTo: E. Pluribus Unum\n\nThe big keys for this year: 1) Hunt down and destroy RINOs - as many as possible.",
    "Vance, the New York Times best-selling author now running for Senate in Ohio, said the party’s shift comes as beltway conservative orthodoxy has been busted through by the likes of Trump, Breitbart News, and Carlson.",
    "To: E. Pluribus Unum\n\n“If the U.S. Chamber of Commerce calls you and says ‘We want to endorse,’ You’re like, ‘Please don’t,'” a high-profile GOP political consultant told Axios.",
    "Most recently, the Chamber urged President Joe Biden and Congress to double legal immigration levels and provide amnesty to the nation’s 11 to 22 million illegal aliens.",
    "TOPICS:\n\nFront Page News\n\nGovernment\n\nNews/Current Events\n\nPolitics/Elections\n\nKEYWORDS:\n\ndonors\n\nelections\n\ngop\n\ntrump\n\n\n\n\n\nTo: E. Pluribus Unum\n\nThe parties evolve.",
    "Start impeachment hearings if he doesn't sign bills put on his desk in January, and make sure he has significant legislation on his desk in January.",
    "Getting rid of hardcore Leftists in red states like Warnock in Georgia and gun grabbing China Sellout Mark Kelly in Arizona is critical.",
    "2) Get real populist/nationalist MAGA Republicans in the governor’s mansions in Georgia, Arizona, Wisconsin, Pennsylvania and Michigan.",
    "I think a big reason for that is because the corporations/Wall Street have moved to the left, and become highly entangled with China.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "To: FLT-bird\n\nThe big keys for this year: And when you have Majorities in both houses, take the fight to Biden's handlers.",
    "https://www.givesendgo.com/FreedomConvoy2022\n\n\n\nby 5 posted onby BobL (Money is the most important thing in my life.)",
    "“… none of the operatives we interviewed considered Koch support to be important in 2022,” the Axios report notes.",
    "by 2 posted onby jimfree (My 19 y/o granddaughter continues to have more quality exec experience than Joe Biden.)",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "The governors in those 5 key states are all that stands in the way of real election integrity laws with teeth.",
    "Get those passed and Republicans have an excellent shot at winning all 5 of those states going forward.",
    "To: BobL\n\nI had never heard of GiveSendGo until the brouhaha over the Canadian truckers and GoFundMe.",
    "They’re not for the proletariat, but for ethnic socialism, one shade removed from national socialism.",
    "That is especially so for key RINOs who stabbed us in the back and who were complicit in the Steal.",
    "Just wait until TruthSocial, Rumble, and the entire new MAGA tech infrustructure gets rolling.",
    "Last year, the Chamber’s political action committee (PAC) donated thousands to Sens.",
    "To: jimfree\n\nThe GOP had evolved before Trump came along - in the wrong direction.",
    "Those “small donors” raised $10 million for Canadian truckers in less than a week.",
    "To: E. Pluribus Unum\n\nTrump showed the back shelf Republicans that you CAN win.",
    "To: FLT-bird\n\n“Hunt down and destroy the RINO’s” I like the way you think!",
    "And the so called regular Deplorables are not afraid anymore to speak up.",
    "“You don’t want Breitbart on your ass,” a GOP operative told Axios.",
    "To: E. Pluribus Unum\n\nThis is the BEST thing I’ve ever read.",
    "The typical Republican insider has moved along with them.",
    "Hence the DNC is controlled by communists.",
    "(Excerpt) Read more at breitbart.com ...",
    "Kemp, Ratburger, the 10, Murkowski, etc.",
    "The same goes for the Koch network.",
    "3) take back the House and Senate.",
    "To: jimfree\n\nCorporate communists.",
    "(Back to School 1986 film).",
    "To: E. Pluribus Unum\n\nLOL.",
    "I’ll be watching you!",
    "To: montag813\n\n“LOL.",
    "Or maybe fascists.",
    "Skip to comments.",
    "J.D."
  ]
}