{
  "id": 26567,
  "mediaId": 2575,
  "date": "2022-02-22",
  "headline": "Three senators endorse Timken in Ohio GOP Senate primary (senators pick their own colleague)",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4040436/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Three senators endorse Timken in Ohio GOP Senate primary (senators pick their own colleague)\n\nPosted on by cotton1706\n\nOhio Republican Senate candidate Jane Timken on Tuesday received three Senate endorsements that followed retiring Sen.",
    "https://thehill.com/homenews/campaign/594968-all-eyes-on-trump-as-timken-gains-momentum-in-ohio\n\n\n\nby 16 posted onby Linda Frances (Woe to those who call evil good and good evil, who put darkness for light and light for darkness. )",
    "Ohio’s primary is May 3, so she still has time to mount a campaign, but Mike Gibbons, a “Trump-tough” businessman, has a strong media campaign already in progress, including opposition to Timken as a DeWine wimp.",
    "“As a fellow Midwesterner, Jane understands the challenges our farmers and small businesses face, and I look forward to working alongside another powerful mom and female in the U.S. Senate,\" Ernst said.",
    "TOPICS:\n\nConstitution/Conservatism\n\nPolitics/Elections\n\nUS: Ohio\n\nKEYWORDS:\n\nelections\n\nSenators like to pick who they'd like to work with, then manipulate to get that person nominated and elected.",
    "by 5 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: cotton1706\n\nTimken is endorsed by RINO’s.",
    "by 4 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: Vigilanteman\n\nHow did that work in GA?",
    "To: cotton1706\n\nNo more RINO chix...\n\n\n\nTo: Vigilanteman\n\nAs an Ohio GOP Precinct Committeeman, I will be bucking Trump on this endorsement and will be supporting JD Vance.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "In her endorsement, Conway referred to Timken as a “true MAGA champion,” using the acronym for “make America great again,” one of Trump’s main political slogans.",
    "Not much name recognition except for the Timken steel company, which once was a big deal (originally Timken Bearings).. No real media campaign as yet.",
    "Kellyanne Conway, a longtime adviser to Trump, announced this week that she was endorsing Timken and joining her campaign as a senior strategist.",
    "To: cotton1706\n\nThe same goes for the other side: The other GOP contenders have also received notable Senate endorsements in the race.",
    "To: cotton1706\n\nWell she does have one major qualification— enough of her own money so the GOP doesn’t have to finance her campaign.",
    "Prior to them in on the car wheel axles were sleeve bearings which had to be oiled all the time and could get hot (”hot boxes”).",
    "by 11 posted onby Vigilanteman (The politicized state destroys aspects of civil society, human kindness and private charity.)",
    "by 3 posted onby Vigilanteman (The politicized state destroys aspects of civil society, human kindness and private charity.)",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "I’d say she has her work cut out for her, especially since the establishment GOP is not well regarded in this red state.",
    "all backed Timken, citing what they said were her conservative credentials in a statement first seen by The Hill.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "These female senators seem to be more into a “mom and woman” caucus than they are in promoting sound policy.",
    "To: cotton1706\n\n“Timken” always reminds me of the Timken roller bearings, which revolutionized railroading.",
    "by 19 posted onby brownsfan (It's going to take real, serious, hard times to wake the American public.)",
    "She is a DeWine republican who first said she espoused Trump programs but later abandoned that stance.",
    "She pretty much blows with the wind, first endorsing John Kasich, eg, then thrashing him recently.",
    "by 10 posted onby americas.best.days... ( Donald John Trump has pulled the sword from the stone.)",
    "To: cotton1706\n\nTimken is a Cincinnati born lawyer who married the president of Timken steel Co.",
    "But nobody ever accused the GOP of being intelligent and actually learning from their mistakes.",
    "Her only experience has been as a party chair, first for Stark County (Canton) then for Ohio.",
    "To: Lurkinanloomin\n\nAnd don’t you just love how all the women flock to the female candidate!",
    "To: cotton1706\n\nThat should be all you need to know that Timken is a Bush League Republican.",
    "With the Timken bearings trains could be longer because that friction was no longer present.",
    "Various figures from Trump World have fanned out across the state’s Senate campaigns.",
    "by 13 posted onby Does so (Americans had no desire for war between 1939 and 1941.",
    "Joni Ernst (R-Iowa), Shelley Moore Capito (R-W.Va.) and Deb Fischer (R-Neb.)",
    "To: cotton1706\n\nAlso Marjorie Taylor Greene and I have endorsed JD Vance.",
    "The people choosing their own representative, well that's just uncouth!",
    "To: Linda Frances\n\nI thought Kellyanne Conway is a big time pro Trump?",
    "Rob Portman (R-Ohio) picking her as his desired successor last week.",
    "To: cotton1706\n\nI thought Kellyanne Conway is a big time pro Trump?",
    "), while Mike Gibbons has the backing of Sen. Rand Paul (R-Ky.).",
    "She does have the support of party insiders and a lot of money.",
    "Also, the sleeve bearings need extra pull to get them rolling.",
    "“No more RINO chix...” Timken bearing—down on conservatives?",
    "by 8 posted onby Bshaw (A nefarious deceit is upon us all!)",
    "And we are not invited to join unless we go to Pedo Island.",
    "To: cotton1706\n\nWell...This is probably not a good choice.",
    "To: cotton1706\n\nAren’t all three ‘backers’ RINO’s?",
    "To: cotton1706\n\nHer commercial is over the top.",
    "Is it discriminatory to endorse someone else?",
    "Mike Lee (R-Utah) and Cynthia Lummis (R-Wyo.",
    "If she wins anything it will be due to that.",
    "She repeats “I’m a Trump tough woman!”.",
    "To: cotton1706\n\nIt’s all a little club.",
    "Josh Mandel has been endorsed by Sens.",
    "(Excerpt) Read more at thehill.com ...",
    "That concept doesn’t exist for them.",
    "That is all that we need to know.",
    "To: Lurkinanloomin\n\nWe all know.",
    "Political operatives are whores.",
    "Sometimes War Finds YOU!)",
    "To: who knows what evil?",
    "Sen. Josh Hawley (R-Mo.)",
    "It’s not about loyalty.",
    "They follow the money.",
    "I don’t trust her.",
    "Skip to comments.",
    "has backed J.D.",
    "From the hill.",
    "Anyone know?",
    "Anyone know?",
    "Rheinland?",
    "Have they?",
    "Vance.",
    "Sens."
  ]
}