{
  "id": 26579,
  "mediaId": 2575,
  "date": "2022-04-06",
  "headline": "Poll: JD Vance Gains in Ohio Senate Race, Tied with Gibbons and Mandel for Lead (Portman preferred Timken drops lower)",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4052921/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance from Opponents’ ‘Lies’: ‘JD is 100% America First’ https://www.breitbart.com/politics/2022/03/22/donald-trump-jr-backs-up-j-d-vance-from-opponents-lies-jd-is-100-america-first/\n\n\n\nTo: conservative98\n\nI’m going to be honest, I’ve been extremely skeptical of @JDVance1.",
    "To: conservative98\n\nyour right to be skeptical but we should whenever able, vote for the “new blood” and being from Middletown I think JD Vance brings that experience with him to help break through to the undecideds in the forgotten middle and lower class.",
    "Most significant, though, is that the poll shows Gibbons stagnating with 18 percent after having failed to gain any traction since February, whereas Vance and Mandel have each risen to the top of the pack among the five leading candidates.",
    "The poll had voters watch the PAC’s latest ad for Vance where he outlines a fierce immigration agenda that includes fully funding Trump’s border wall, ending welfare benefits for illegal aliens, and defunding sanctuary jurisdictions.",
    "The Protect Ohio Values PAC poll, released on Wednesday, finds that Vance has gained four points since February — running at 18 percent and tied with fellow Republicans Mike Gibbons and Josh Mandel, who are also at 18 percent.",
    "“JD Vance is the conservative warrior that the entire America First movement needs fighting for us in the U.S. Senate, and that’s why I’m proud to endorse him,” said Greene, in a statement released by the Vance campaign.",
    "TOPICS:\n\nConstitution/Conservatism\n\nPolitics/Elections\n\nUS: Ohio\n\nKEYWORDS:\n\nelections\n\njdvance\n\njoshmandel\n\nohio\n\npolls\n\ntrump\n\nThe silly fight between Gibbons and Mandel likely moved people to Vance.",
    "Meanwhile, Jane Timken, the former chairwoman of the Ohio Republican Party, has dropped in the polls from 12 percent in February to just nine percent in March among primary voters.",
    "However, after carefully observing all of his debate performances and media appearances, I am wholeheartedly convinced that he is one of the best Senate candidates this cycle.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "by 7 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: Ann Archy\n\nI agree.",
    "Gibbons and Mandel got into an unattractive spat during a debate, instigated by the dishonest Mandel but tarring both, leaving Gibbons appearing shallow.",
    "Poll: JD Vance Gains in Ohio Senate Race, Tied with Gibbons and Mandel for Lead (Portman preferred Timken drops lower)\n\nPosted on by cotton1706\n\nJ.D.",
    "by 11 posted onby fieldmarshaldj (Plugs the Pedo - The Shart Heard 'Round The World)\n\nTo: cotton1706\n\nMaybe the biggest RINO in the country.",
    "To: hinckley buzzard\n\nWhat Trump’s initial run showed us was that 95% of all these guys are just place-seekers at the troughs.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "Vance, a New York Times best-selling author, is tied for first place in the Ohio GOP Senate primary race, a new poll shows.",
    "After voters watched the ad, Vance’s support shot up to 30 percent against Gibbons’ 18 percent and Mandel’s 16 percent.",
    "by 9 posted onby griswold3 (When chaos serves the State, the State will encourage chaos)\n\nTo: delapaz\n\nRemember Kasich?",
    "To: conservative98\n\nJosh Mandel endorsed by Mark Levin, Rafael Edward “Ted” Cruz, Chris Christie and Micro Rubio.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "Now the mealy mouth crowd will say, “Oh, he’s unseemly!” as they lift their pinkies in the air sipping lattes.",
    "Get out and vote for him, Ohio.— Catharine O’Neill (@cathponeill) April 6, 2022\n\n\n\nTo: cotton1706\n\nExcellent!",
    "by 6 posted onby KC Burke (If all the world is a stage, I would like to request my lighting be adjusted.)",
    "Timken has begun her tv ads, and may appeal more to independents but that won’t help her in the primary.",
    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Thanks for that info, I see plenty wrong with that.",
    "by 15 posted onby Basket_of_Deplorables (Putin is behaving rationally.The war is on Biden and Obama. )",
    "Josh Mandel endorsed by Mark Levin, Rafael Edward “Ted” Cruz, Chris Christie and Micro Rubio.",
    "In this scenario, Dolan trails with 12 percent, while Timken stumbles behind with 10 percent.",
    "To: dalight\n\nJD Vance is establishment somehow despite being a 100% outsider to the OH GOP.",
    "Money manipulator like Romney who tore up American companies and sent the jobs to China.",
    "To: delapaz\n\nJD’s a national-level/intel insider (e.g., at Thiel’s investment company).",
    "To: cotton1706\n\nJD Vance endorsed by Marjorie Taylor Greene, Tucker, Trumpbart and C98.",
    "Matt Dolan, a longtime critic of former President Trump, has similarly flatlined.",
    "Fancy talking con man who will become a Chamber of Commerce Senator if elected.",
    "To: Ann Archy\n\nI don’t trust him, but he appears to be the best option.",
    "dont believe the anti-trump smears, he could be as potent as Rand Paul.",
    "Kasich was an insider, JDV is an outsider, dont even compare the two.",
    "He is establishment.. don’t be surprised if he isn’t another Romney.",
    "Vance has begun more TV ads, which has raised his name recognition.",
    "To: cotton1706\n\nThe Trump Sr. endorsement should be coming soon.",
    "To: cotton1706\n\nThis is a function of the various ad campaigns.",
    "To: delapaz\n\nI’m looking for a common sense civil libertarian.",
    "Is a conservative lead in any Republican race in the country?",
    "He said the right things.. but was a wooden nickel.",
    "The HUMAN Sacrifice to the god of Convenience.)",
    "To: fieldmarshaldj\n\nGibbons is the only choice.",
    "Dolan has gained one percent since February.",
    "by 2 posted onby Ann Archy (Abortion.......",
    "Not that there is anything wrong with that.",
    "To: cotton1706\n\nGibbons is the only choice.",
    "Mandel, Timken and Vance are all phonies.",
    "Mandel, Timken and Vance are all phonies.",
    "(Excerpt) Read more at breitbart.com ...",
    "To: hinckley buzzard\n\nJDV is my pick.",
    "I think he’s changed for the better!",
    "To: cotton1706\n\nI’m rooting for JD!",
    "As long as Timken is rejected!",
    "He’ll tip over the table.",
    "Gibbons is the phoney.",
    "Like a young Trump.",
    "Skip to comments.",
    "I love that guy!",
    "Donald Trump Jr.",
    "From both sides.",
    "Its no contest.",
    "Mark my words.",
    "Backs Up J.D.",
    "SO is Vance.",
    "Ditto Vance.",
    "Nice spin."
  ]
}