{
  "id": 26576,
  "mediaId": 6555,
  "date": "2022-04-02",
  "headline": "Washington Post: Too Many Conservatives Oppose Support for Ukraine. What’s Their Alternative? – Occidental Dissent",
  "image": "https://i2.wp.com/occidentaldissent.com/wp-content/uploads/2022/03/bidenwithtroops.jpg?fit=645%2C363&ssl=1",
  "link": "https://occidentaldissent.com/2022/04/02/washington-post-too-many-conservatives-oppose-support-for-ukraine-whats-their-alternative/",
  "mediaOutlet": "occidentaldissent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter Wallace, Vicarious Immorality, Not Sure, Your Movement Sucks, You Should All Be Ashamed Of Yourselves, Robert Browning",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Abolish the “intelligence community”\n\nGut the Deep State bureaucracy\n\nCut the military budget by hundreds of billions of dollars\n\nReorient the military to securing our own borders\n\nStop destroying foreign countries and creating endless refugee crises\n\nPerhaps the corruption in Washington that has built up around being in a permanent state of war since World War II could have been dealt with using a scalpel at some point in the past.",
    "I sought out this minority perspective at a conference on Thursday titled “Up from Chaos,” featuring prominent Republicans such as Sen. Rand Paul (Ky.), Rep. Thomas Massie (Ky.) and Ohio Senate candidate J.D.",
    "We’re set to take in 100,000 Ukrainian refugees although that number will doubtlessly rise\n\nJoe Biden and congressional Republicans are poised to sign off on a significantly larger defense budget.",
    "The exact same people who were responsible for our previous foreign policy disasters – Serbia, Iraq, Syria, Libya and Afghanistan – have guided us into our current disaster in Ukraine.",
    "Wealth is sucked away from the “Homeland” and redistributed to the Beltway\n\nOh … yet another conflict in a far flung part of Eurasia where we have a moral duty to intervene.",
    "Instead of making a compelling argument for their views, most speakers instead provided a good explanation for why they have found little support in Congress or the country.",
    "And so, we live in Groundhog Day where the same pattern repeats itself over and over again while our cities decay and fill up with refugees while the Beltway flourishes.",
    "Virtually every speaker echoed this “blame America” attitude, attacking the U.S. wars in Iraq and Afghanistan and interventions in Syria and Libya as misguided failures.",
    "Withdraw from NATO\n\nEnd the American Empire by withdrawing American troops from this spiderweb of bases which have been set up all over the world\n\nEnd the Pentagon.",
    "We are cursed by a globalist elite which is bent on world domination and is incapable of minding its own business and tending to its own affairs at home.",
    "It hasn’t been six months since we left Afghanistan\n\nOh … yet another color revolution which has destabilized another foreign country in Eurasia.",
    "“Russia has invaded Ukraine, the world in chaos, and Washington’s decades-long, failed bipartisan foreign policy is to blame,” it proclaimed.",
    "If this sounds familiar, it is because the “Homeland” has been a dumping ground for refugees from all our previous adventures for decades.",
    "It is always meddling in some distant part of the world, destabilizing foreign countries, creating crises and feeding off those crises.",
    "They rightfully contend that these acts squandered American power, damaged American prestige and emboldened America’s adversaries.",
    "Washington Post:\n\n“Far too many conservatives remain critical of U.S. support for Ukraine, despite Russia’s obvious aggression.",
    "Every single time it happens the same elites ask incredulously why they should be held accountable for their own behavior.",
    "The United States is pouring weapons into a country to cosign a proxy war which is killing Russian soldiers.",
    "We have to sacrifice as a show of solidarity with the corrupt elites who provoked this unnecessary crisis.",
    "If this sounds familiar, it is because the top line of the defense budget only trends in one direction.",
    "We can’t address our massive domestic problems because we are distracted by a foreign policy crisis.",
    "What you won’t hear is a coherent approach to the Ukraine crisis or even future U.S. foreign policy.",
    "But they wrongly use those errors as justification to ignore the perilous situation before us.",
    "Turn on your television and Sean Hannity and Mark Levin are cheerleaders for yet another war.",
    "Ask them why, and you’ll likely hear much criticism of past American misadventures abroad.",
    "He is even rambling on about regime change and wars to spread “democracy” there again.",
    "More extreme measures are needed to retake control of our military and foreign policy.",
    "In reality, it keeps happening because we have some bad habits we are unable to shake.",
    "Yes, America is like a drunk that keeps waking up in a pool of his own vomit.",
    "Uncle Sam needs to get sober, go on a strict diet and check into rehab.",
    "This crisis in Ukraine illustrates why an intervention is needed.",
    "The conference’s opening video set the day’s context.",
    "Millions of refugees have poured out of Ukraine.",
    "We are cursed by militarism and imperialism.",
    "Have we ever gone down that road before?",
    "That has never happened before either.",
    "Are we the Blame America First crowd?",
    "He is addicted to wars in Eurasia.",
    "Have you ever seen that before?",
    "Have you ever seen that before?",
    "Have you heard that one before?",
    "Has that ever happened before?",
    "…”\n\nWhat’s your alternative?",
    "This is no longer the case.",
    "He is out of control.",
    "He won’t stop.",
    "Just axe it.",
    "Vance."
  ]
}