{
  "id": 26577,
  "mediaId": 6555,
  "date": "2022-04-02",
  "headline": "Politico: Trumpian Conservatives Hold An Emergency Meeting Over Russia-Ukraine War",
  "image": "https://i1.wp.com/occidentaldissent.com/wp-content/uploads/2022/04/d7ac2993099ea3ca594bcbf8fec4f0bbc13de10d.png?fit=976%2C548&ssl=1",
  "link": "https://occidentaldissent.com/2022/04/02/politico-trumpian-conservatives-hold-an-emergency-meeting-over-ukraine/",
  "mediaOutlet": "occidentaldissent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter Wallace, Vicarious Immorality, Not Sure, Your Movement Sucks, You Should All Be Ashamed Of Yourselves, Robert Browning",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Inflation\n\nHigh gas prices\n\nThe war in Ukraine\n\nThe threat of World War III\n\nCivil liberties\n\nCensorship\n\nDefense spending / Military industrial complex\n\nSurveillance state\n\nIllegal immigration\n\nCOVID fatigue\n\nAssuming he can navigate populist concerns about illegal immigration and censorship (libertarianism isn’t Jeffersonianism), the moment seems tailor made for Rand Paul.",
    "But Vladimir Putin’s war of aggression wasn’t what confounded them most; for these conservatives, a mix of D.C. professionals and college students leavened with a handful of older cranks, the hawkish response to Russian aggression by most elected Republicans was the real problem.",
    "Instead, the phrase of the day seemed to be “Putin is bad, but …” The attendees, who included paleocons, libertarians, and hard-core MAGA acolytes, offered variations on that tune according to their policy preferences: Putin is bad, but we don’t want a nuclear war.",
    "The organizers were The American Conservative, the paleoconservative publication founded by Pat Buchanan; and American Moment, a newer organization that tries to sell the next generation of the right on its version of national conservatism.",
    "The audience consisted of over one hundred mostly younger conservatives, and he was sounding the alarm about not just foreign intervention, but about other conservatives — the worrisome resurgence of the Republican establishment.",
    "The young men, almost all of them soberly dressed in dark suits, and women, almost uniformly wearing dresses, listened attentively as one speaker after another warned about the perils of intervention for their very own lives.",
    "The event was the “Up From Chaos” conference, a self-described “emergency” meeting organized by the Trumpian wing of the GOP to grapple with the political fallout from Russian President Vladimir Putin’s invasion of Ukraine.",
    "“We were acutely worried that the seven years of foreign-policy gains that we made [since Donald Trump launched his campaign] were going to go away,” Saurabh Sharma, one of the conference’s organizers, told me.",
    "I need you to be some of them.” Vance wasn’t speaking at a campaign stop in Ohio, where he is running for the U.S. Senate, but at the Marriott Marquis hotel in downtown Washington.",
    "“Using American power to do the dirty work of Europe is a pretty bad idea,” he told a crowd on Thursday, warning against the U.S. getting more involved in Ukraine.",
    "…”\n\nThe Atlantic:\n\n“On Thursday, in a dim conference room in the bowels of a Washington, D.C., hotel, about 150 conservatives gathered for a day of group therapy.",
    "The conference, Up From Chaos, was a summit of all the wings of the right that would prefer a more hands-off American response to Russia’s invasion of Ukraine.",
    "A return to the thinking that led to Iraq and Afghanistan could result in nothing less than World War III over Ukraine, they were warned.",
    "They had all been traumatized by the Russian invasion of Ukraine, which had left them questioning their assumptions about the world.",
    "Putin is bad, but why should we trust the American foreign-policy establishment?",
    "The event wasn’t a Putin apologia like those found in some corners of the right.",
    "Putin is bad, but the media is in thrall to the U.S. intelligence apparatus.",
    "The broad consensus: Putin is bad, but why is that our problem?",
    "“We don’t have that many non-insane people in Washington.",
    "Are we on the cusp of another libertarian moment?",
    "…”\n\nWhat are the top issues right now?",
    "Vance was on the warpath.",
    "Politico:\n\n“J.D."
  ]
}