{
  "id": 26578,
  "mediaId": 2575,
  "date": "2022-04-04",
  "headline": "Trumpian Conservatives Hold an ‘Emergency’ Meeting Over Russia",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4052220/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "by 18 posted onby McGruff (Biden - There's going to be a new world order out there and we've got to lead it)\n\nTo: Mariner\n\n“And Free Republic is thick with them.” It seems to me like there are a lot more, either real or trolls, in the last 6 months.",
    "The audience consisted of over one hundred mostly younger conservatives, and he was sounding the alarm about not just foreign intervention, but about other conservatives — the worrisome resurgence of the Republican establishment.",
    "The young men, almost all of them soberly dressed in dark suits, and women, almost uniformly wearing dresses, listened attentively as one speaker after another warned about the perils of intervention for their very own lives.",
    "To: JonPreston\n\nThe last thing the US needs is to get involved in a client war in Europe... or anywhere for that matter\n\n\n\nby 13 posted onby SMARTY (Republics decline into democracies & democracies degenerate into despotisms.",
    "The event was the “Up From Chaos” conference, a self-described “emergency” meeting organized by the Trumpian wing of the GOP to grapple with the political fallout from Russian President Vladimir Putin’s invasion of Ukraine.",
    "I need you to be some of them.”\n\nVance wasn’t speaking at a campaign stop in Ohio, where he is running for the U.S. Senate, but at the Marriott Marquis hotel in downtown Washington.",
    "TOPICS:\n\nForeign Affairs\n\nNews/Current Events\n\nPhilosophy\n\nKEYWORDS:\n\nputinsbuttboys\n\nI simply detest neocons and will always vote for their opponent in any/every election.",
    "“Using American power to do the dirty work of Europe is a pretty bad idea,” he told a crowd on Thursday, warning against the U.S. getting more involved in Ukraine.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "by 10 posted onby SoConPubbie (Mitt and Obama: They're the same poison, just a different potency)\n\nTo: bert\n\nAnd so do emotional reactionary turncoats.",
    "by 5 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: Mariner\n\nwarning against the U.S. getting more involved in Ukraine.",
    "To: Mariner\n\nYou know them because they always believe we have some kind of righteous role in involving the US in other countries business and wars.",
    "Trumpian Conservatives Hold an ‘Emergency’ Meeting Over Russia\n\nPolitico va Yahoo ^ | April 2nd, 2022 | Jacob Heilbrunn\n\nPosted on by Mariner\n\nJ.D.",
    "by 8 posted onby BobL (Putin isn't sending gays into our schools to recruit children, but anti-Putin people are)\n\nTo: Fury\n\nPowell a failure.",
    "A return to the thinking that led to Iraq and Afghanistan could result in nothing less than World War III over Ukraine, they were warned.",
    "Aristotle)\n\nTo: brownsfan\n\n“You can trust JD Vance about as far as you can throw Stacey Abrams.” Nobody is being asked to trust JD Vance.",
    "To: Mariner\n\nHard to see an upside to exchanging nuclear weapons with Russia, but then I’m not a neoconservative (or a Democrat) either.",
    "Prep if you want to live and live like you are prepping for eternal life)\n\nTo: Sirius Lee\n\nThis article really must have hit a nerve.",
    "To: Mariner\n\nThere’s now a couple of FReepers that won’t even consider the Powell Doctrine, as they consider Powell a failure.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "“Oh, the poor....blah blah blah, they need our form of democracy ruling over them, we must save them and then boss them”.",
    "To: JonPreston\n\n“DJT needs to restate his anti-interventionist position of the 2016 campaign.” Unfortunately, he’s not.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "They always start with kindling emotions making Americans feel it is their job to engage in foreign wars.",
    "And so, as Putin’s deadly and unprovoked assault drags on, the GOP is also going to war — against itself.",
    "by 7 posted onby brownsfan (It's going to take real, serious, hard times to wake the American public.)",
    "N.C. +12) Promoting Afro Heritage diversity will destroy the democrats)\n\nTo: Mariner\n\nGood for J.D.",
    "They disgust me and are responsible for many deaths and maimed bodies for absolutely nothing.",
    "To: SoConPubbie\n\n“It brought out the FR Neocons in force!” It’s one war they do not relish.",
    "To: Mariner\n\nYou can trust JD Vance about as far as you can throw Stacey Abrams.",
    "DJT needs to restate his anti-interventionist position of the 2016 campaign.",
    "To: Sirius Lee\n\nRe: 9 - Does not mean that the Powell Doctrine is not sound.",
    "But you can spot them by their words and actions...if you're not a neocon.",
    "It’s starting to look like he has abandoned America first foreign policy.",
    "There is never a place where the neocon won’t find a need for a war.",
    "by 19 posted onby jdsteel (\"A Republic, Madam, if you can keep it.\"",
    "When in office the people were war weary to he reflected that.",
    "To: Mariner\n\n#AmericaFirst has been replaced by #UkraineFirst.",
    "In other words, these FReepers have a lack of discernment.",
    "“We don’t have that many non-insane people in Washington.",
    "Now there is sympathy for Ukraine he also reflects that.",
    "by 9 posted onby Sirius Lee (They intend to murder us.",
    "To: Mariner\n\nIsolationists come in all sorts of garbs.",
    "Of note, almost all neocons will deny being such.",
    "It’s a concern but he will do what’s popular IMO.",
    "I’m disappointed as I thought we made progress.",
    "It brought out the FR Neocons in force!",
    "He would “do more” to support Ukraine.",
    "And Free Republic is thick with them.",
    "(Excerpt) Read more at yahoo.com ...",
    "Guy was a globalist never-Trumper.",
    "Sorry Ben, looks like we blew it.)",
    "To: Mariner\n\nTrump is a populist.",
    "by 4 posted onby bert ( (KE.",
    "Vance was on the warpath.",
    "I still think we have.",
    "To: All\n\nUnprovoked?",
    "Skip to comments.",
    "Good for him.",
    "Vance.",
    "NP."
  ]
}