{
  "id": 26574,
  "mediaId": 6555,
  "date": "2022-03-29",
  "headline": "Mitt Romney: Second Trump Term Would Force NATO To “Rethink” Reliance On U.S.",
  "image": "https://i1.wp.com/occidentaldissent.com/wp-content/uploads/2019/04/romney-trump-2020-e1555811337509.jpg?fit=700%2C466&ssl=1",
  "link": "https://occidentaldissent.com/2022/03/29/mitt-romney-second-trump-term-would-force-nato-to-rethink-reliance-on-u-s/",
  "mediaOutlet": "occidentaldissent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "About Hunter Wallace, Founder, Editor-In-Chief Of Occidental Dissent, Hunter Wallace, Vicarious Immorality, Not Sure, Your Movement Sucks, You Should All Be Ashamed Of Yourselves, Robert Browning",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "NEWS: @MittRomney tells me NATO would be permanently damaged if Trump is elected president again\n\n\n\nOur allies “would rethink whether they can count on the United States to lead NATO and defend other nations.” @CNNplus @NewDay (1/x) pic.twitter.com/Ia4dxRVIJK — Kasie Hunt (@kasie) March 29, 2022\n\nIf Donald Trump had withdrawn the United States from NATO, I would have probably voted for him in the 2020 election.",
    "Seriously though, the fundamental reason why America First never went anywhere on foreign policy under Donald Trump was largely because of Trump’s two impeachment trials and his reliance on Republican senators.",
    "Instead, he presided over its expansion, deferred to Lindsey Graham and flooded Ukraine with weapons and spent most of his time agitating for increases in European defense spending.",
    "Vance and Blake Masters who might make a small difference in the Senate, but I couldn’t care less about whether or not Mitch McConnell has a Senate majority in 2023.",
    "As for the 2022 midterms, I will probably endorse a few candidates like Mo Brooks, J.D.",
    "In the end, treacherous people like Mitt Romney voted to impeach him anyway.",
    "It is the same people except they are 10 years closer to the Rapture.",
    "Just add a few minor changes and updates.",
    "Note: Still applies today."
  ]
}