{
  "id": 26583,
  "mediaId": 2720,
  "date": "2022-04-15",
  "headline": "Trump Planning to Weigh in on Red-Hot Ohio Republican Primary with Game-Changing Endorsement: Report",
  "image": "https://thefederalistpapers.org/wp-content/uploads/2021/03/Donald-Trump.jpg",
  "link": "https://thefederalistpapers.org/us/trump-planning-weigh-red-hot-ohio-republican-primary-game-changing-endorsement-report",
  "mediaOutlet": "thefederalistpapers.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Moorhead, The Western Journal, Jack Davis, Elizabeth Stauffer, Randy Desoto, Warner Todd Huston, Jack Gist, C. Douglas Golden",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/OFrupEiz94 — Jonathan Swan (@jonathanvswan) April 4, 2022\n\nReal Clear Politics’ aggregation of polling in the primary shows Gibbons with a thin lead over Mandel, with Vance trailing in third place.",
    "According to the NBC report, one Republican familiar with the situation said Mandel launched a lobbying drive to prevent Trump from endorsing Vance after learning of the development.",
    "A Fox News poll indicated that 24% of Republican voters were undecided in the race as of last month, providing any candidate room to grow their support enough for victory.",
    "Michael Caputo, a political consultant close to the former president, claimed that reports of a Trump endorsement for Vance aligned with his own conversations with Trump.",
    "Former President Donald Trump has decided to endorse a candidate in one of the most competitive Republican primaries in the country, according to a report Thursday.",
    "Mandel and Gibbons nearly came to blows in a tense exchange during a debate last month, with Vance suggesting their behavior was an embarrassment to conservatives.",
    "— Not a biologist (@MichaelRCaputo) April 14, 2022\n\nThe primary election will take place on May 3, with the winner advancing to the general election in November.",
    "A pro-Vance Super PAC published a poll showing the ‘Hillbilly Elegy’ author tied with Gibbons and Mandel for the lead, according to the Washington Examiner.",
    "Vance is competing with former Ohio Treasurer Josh Mandel and investor Mike Gibbons in the Republican primary for U.S. senator in Ohio.",
    "?per source familiar – @DonaldJTrumpJr made a surprise appearance at a @JDVance1 fundraiser in Palm Beach last night.",
    "Donald Trump Jr. has appeared at fundraisers supporting Vance, suggesting the family is amenable to his candidacy.",
    "Mandel grew heated with Gibbons after the investment banker criticized his lack of private-sector job experience.",
    "@JDVance1 and I disagree on Russia-Ukraine but I was encouraged by his thoughtful approach to our discussion.",
    "However, the major candidates in the race have pushed internal polling showing themselves at the top.",
    "Two other candidates, Jane Timken and Matt Dolan, poll with less support than the top three.",
    "NBC cited three sources close to the 45th president who are aware of Trump’s decision.",
    "“The Mandel people hit the roof,” the Trump confidante said of the development.",
    "NBC News reported that Trump plans to endorse entrepreneur and author J.D.",
    "I encouraged all my family in Ohio to support JD in the primary.",
    "Vance has been described as a populist on economic policy.",
    "This article appeared originally on The Western Journal.",
    "I don’t have to agree 100% with any candidate.",
    "Trump is planning a rally in Ohio on April 23.",
    "This is consistent with my conversations.",
    "Vance for U.S. senator in Ohio.",
    "He’s the guy.",
    "?"
  ]
}