{
  "id": 5541,
  "mediaId": 323,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Kathy Barnette Scrambles Pennsylvania GOP Senate Primary, Drawing Trump Ire",
  "image": "https://images.wsj.net/im-544208/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/kathy-barnette-scrambles-pennsylvania-gop-senate-primary-drawing-trump-ire-11652533200",
  "sentiment": "0.511",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormick",
  "authorUrl": "https://www.wsj.com/news/author/john-mccormick-1",
  "termIds": [
    943,
    1147,
    1653,
    2491,
    3102,
    3103,
    428,
    571,
    2992,
    2862
  ],
  "sentences": [
    "All three of the top Republican candidates for Senate have pledged loyalty to Mr. Trump, and some of the former presidents followers have expressed disappointment in his endorsement of Mr. Oz, including some who booed or turned their backs when the surgeon spoke at a recent Trump rally.",
    "Limited polling suggests a tight GOP race, with Ms. Barnette, Mr. Oz and former hedge fund executive David McCormick all potentially within striking distance of a win on Tuesday, when the Pennsylvania race will be the highest-profile among primaries in five states from coast to coast.",
    "She has been a commentator on Fox Corp.s Fox News cable channel, which shares common ownership with The Wall Street Journal parent News Corp.\nA Fox News poll released this past week showed Ms. Barnette with a late surge in a race that had focused primarily on Messrs. Oz and McCormick.",
    "Mr. Mastriano, who participated in the Jan. 6, 2021, march to the Capitol to protest the 2020 results, has made unsupported claims of widespread election fraud a central tenet of his bid to lead a state won by President Biden in 2020 by just over 1 percentage point.",
    "A vote for anyone else in the primary is a vote against victory in the fall.?\nPennsylvanias contest offers the latest test of Mr. Trumps grip on the GOP base during a nominating season in which he has mostly scored victories in the opening weeks.",
    "In the closing days of Pennsylvanias Republican primary for U.S. Senate, a candidate who has had a tiny fraction of the resources of the two front-runners is suddenly a contender, triggering attacks against her from different directions.",
    "She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Partyand I will be behind her all the way.?\nMr. Trump continued: Dr.",
    "Kathy Barnette, an Army Reserve veteran and commentator, is surging in part because of a rise from poverty that includes being the product of sexual assault, something she has said helped forge her fierce opposition to abortion.",
    "The spending by the outside group, which called her a principled conservative and a fighter who will take on the socialists,? is more than 10 times what Ms. Barnettes campaign has spent on ads on its own.",
    "My phone is blowing up with people who never call who are asking who they should vote for,? said Doug McLinko, a Bradford County commissioner and local Republican Party official in northern Pennsylvania.",
    "Club for Growth Action, a conservative super PAC, rushed in during the closing days of the campaign to endorse Ms. Barnette and placed an order for $2 million in advertising in support of her.",
    "The former president, who is backing celebrity surgeon Mehmet Oz, has said Ms. Barnette is certain to fail in the fall if she is the nominee to succeed retiring Republican Sen. Pat Toomey.",
    "His prolific candidate endorsements have helped keep him deeply involved in the U.S. political dialogue ahead of what he has suggested is likely another White House campaign in 2024.",
    "Before the final weekend of the campaign, more than $51 million had been spent on advertising on the primarys Republican side alone, data from the ad-tracking firm AdImpact show.",
    "Damage to her rivals from all the negative advertising was evident, with roughly a quarter holding a negative view of Mr. McCormick and almost half feeling that way about Mr. Oz.",
    "In a state with narrowly divided politics, he added that there is great skepticism among some Republicans that either of those two candidates could win in a general election.",
    "Pennsylvania marks the second high-profile Senate primary in which the super PAC, one of the biggest spenders in GOP politics, isnt supporting Mr. Trumps endorsed candidate.",
    "Mr. Trump, who endorsed Mr. Mastriano for governor Saturday, sounded like one of those establishment Republicans when he issued a statement Thursday about the Senate race.",
    "Jeff Becker, a GOP strategist unaffiliated with any of the Senate campaigns, said Mr. Mastrianos backing has especially helped Ms. Barnette in the states rural areas.",
    "John Fetterman, polling and fundraising suggestin a November contest that is one of about a half- dozen nationally most likely to determine control of the chamber.",
    "Honor Pennsylvania, a group heavily financed by hedge-fund billionaire Ken Griffin, is using the spot to try to raise questions about her conservative credentials.",
    "The Fox survey showed almost half of GOP voters said they had never heard of her or couldnt offer an opinion on whether they viewed her favorably or unfavorably.",
    "On the Democratic side in the race to succeed Mr. Toomey, polling has shown Mr. Fetterman with a sizable lead over U.S. Rep. Conor Lamb and a handful of others.",
    "The two have used their own wealth and the fortunes of others to pummel each other with negative ads, while Ms. Barnette has campaigned in relative obscurity.",
    "Mr. Fetterman comes from the partys progressive wing, while Mr. Lamb is a former prosecutor with union support and a reputation as a political moderate.",
    "There are a lot of nervous establishment Republicans with the thought of Mastriano and Kathy Barnette at the top of the ticket,? Mr. Becker said.",
    "Ive never seen such a mess.?\nOn Friday, a super political-action committee supporting Mr. McCormick launched an attack ad against Ms. Barnette.",
    "As she has campaigned, she has questioned the commitment of her better-funded rivals on opposition to abortion and other conservative causes.",
    "She has a history of incendiary statements, including falsely claiming then-President Barack Obama is a Muslim and expressing antigay views.",
    "Ms. Barnette, who unsuccessfully ran for the U.S. House in 2020, also won the late backing of the antiabortion group Susan B. Anthony List.",
    "I was not just a lump of cells.?\nMs. Barnette says she had a hardscrabble upbringing on a pig farm in Alabama that lacked running water.",
    "Voting records show Ms. Barnette, who is in her early 50s and lives outside Philadelphia, has been a Republican since at least 2015.",
    "Her rise has brought with it a new intensity of criticism from her rivals and even the partys biggest national figure, Donald Trump.",
    "Pennsylvanias seven-candidate GOP Senate field is likely to mean that the winner wont need to secure anywhere close to a majority.",
    "Ms. Barnette has the support of state Sen. Doug Mastriano, the front-runner in the crowded Republican primary for governor.",
    "She supported the George Floyd protest and opposed Trump.?\nMs. Barnettes campaign didnt respond to a request for comment.",
    "She is also benefiting from endorsements in the final week of the primary campaign from two powerful conservative groups.",
    "I am the byproduct of a rape,? she said in one debate, as she criticized Mr. Oz for past abortion-related statements.",
    "Mr. McLinko said he has rarely seen as much confusion and indecision among conservatives as he is witnessing now.",
    "Kathy Barnette will never be able to win the general election against the radical left Democrats,? he said.",
    "Spending all this money to attack each other isnt helpful because it has confused the voters,? he said.",
    "Oz is the only one who will be able to easily defeat the crazed, lunatic Democrat in Pennsylvania.",
    "If successful, Ms. Barnette would be the first Republican Black woman elected to the U.S. Senate.",
    "Close to four in 10 of the airings were categorized as negative in tone.",
    "In Ohio, the group backed a candidate who lost to Mr. Trumps pick, J.D.",
    "The victor will face the Democratic nomineemost likely to be Lt. Gov.",
    "What do we really know about Kathy Barnette?? the ad asks.",
    "My mother was 11 years old when I was conceived.",
    "My father was 21.",
    "Vance."
  ]
}