{
  "id": 5573,
  "mediaId": 129,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Club for Growth Starts Ad Blitz for Kathy Barnette in Pennsylvania Senate Primary",
  "image": "https://static01.nyt.com/images/2022/05/10/multimedia/10midterm-briefing-barnette-photo/10midterm-briefing-barnette-photo-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/11/us/politics/kathy-barnette-pennsylvania-senate.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    943,
    946,
    1147,
    1653,
    2491,
    3102,
    3103,
    105,
    571,
    2862
  ],
  "sentences": [
    "Ms. Barnette has the backing of State Senator Doug Mastriano, who has been the front-runner in the Republican primary for governor, and she has run an unabashedly hard-right campaign, attacking her better-funded rivals as globalists? on the debate stage and questioning their commitment to gun rights and the anti-abortion movement.",
    "After months of a bruising television ad war between Dr. Mehmet Oz and David McCormick and their allies, the relatively shoestring campaign of Kathy Barnette, a conservative commentator showing surprising strength in the polls, will receive a late boost in the Republican primary for Senate in Pennsylvania.",
    "Despite that disparity, Ms. Barnette, author of the book Nothing to Lose, Everything to Gain: Being Black and Conservative in America,? is running neck and neck with Dr. Oz and Mr. McCormick after strong debate performances turned heads.",
    "The new ad has Ms. Barnette narrating her impoverished upbringing on a pig farm in Alabama? and saying how this country allowed a little Black girl to claw her way from underneath a rock,? while warning of a disappearing American dream.",
    "The Club for Growth, the pro-business and anti-tax group, began booking television ads on Tuesday on behalf of Ms. Barnette worth $2 million, according to AdImpact, the ad-tracking firm.",
    "I was not just a lump of cells.?\nThe Club for Growth has not formally endorsed Ms. Barnette, which makes the groups late intervention all the more politically intriguing.",
    "And Mr. Vance made clear he was still bitter about all the attacks, calling out the Club by name in his victory speech even as he praised his rivals for their efforts.",
    "The Club for Growth and Mr. Trump are allied in another Senate race next Tuesday, in North Carolina, where both are backing Representative Ted Budd against former Gov.",
    "That sum is more than 10 times what Ms. Barnettes campaign had spent in total on television to date, and the total pro-Barnette reservations could continue to grow.",
    "Its continued assault on Mr. Vance angered both Mr. Trump and his son, Donald Trump Jr., who attacked the Club for Growth on the campaign trail.",
    "A Fox News Poll on Tuesday showed her at 19 percent, behind Mr. McCormick at 20 percent and Dr. Oz at 22 percent  within the margin of error.",
    "Super PACs backing Mr. McCormick, Dr. Oz and their campaigns have already spent or reserved $40 million in the primary.",
    "I am the byproduct of a rape,? she said in one debate, challenging Dr. Oz about his past positions on abortion.",
    "Dont know anything about it,? Bob Gillies, Ms. Barnettes campaign manager, said of it on Tuesday.",
    "The group noisily sparred with former President Donald J. Trump in the Ohio Senate primary.",
    "Vance, the eventual winner, even after Mr. Vance won Mr. Trumps endorsement.",
    "The Club for Growth, which backed Josh Mandel, continued to attack J.D.",
    "The group did not respond to requests for comment.",
    "My mother was 11 years old when I was conceived.",
    "The ad buy took the Barnette team by surprise.",
    "My father was 21.",
    "Pat McCrory."
  ]
}