{
  "id": 6527,
  "mediaId": 21,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Pennsylvania's Republican Senate primary is likely headed for a recount with Trump adding to the chaos",
  "image": "https://i.insider.com/62866af30fdb180018cc3273?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/pennsylvania-senate-results-recount-oz-mccormick-primary-trump-vote-count-2022-5",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    1147,
    1896,
    2491,
    3102,
    4019,
    428,
    571,
    2597,
    2862,
    3060,
    4965,
    5034
  ],
  "sentences": [
    "Adams\nAllegheny\nArmstrong\nBeaver\nBedford\nBerks\nBlair\nBradford\nBucks\nButler\nCambria\nCameron\nCarbon\nCentre\nChester\nClarion\nClearfield\nClinton\nColumbia\nCrawford\nPennsylvania US Senate Republican Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n Mehmet Oz\n 417,594\n 31.16%\n David McCormick\n 416,515\n 31.08%\n Kathy Barnette\n 330,021\n 24.62%\n Carla Sands\n 72,804\n 5.43%\n Jeff Bartos\n 66,362\n 4.95%\n Show More Candidates\n* = Incumbent\n 1,340,340 votes.",
    "Both Oz and McCormick projected confidence and predicted they will win when all the votes are counted on election night, but they've otherwise ignored Trump's meddling and have not gone as far as the former president in questioning the validity of the mail-in ballots that could secure either of them a victory.",
    "But looking towards November, a drawn-out, highly-watched recount in the Senate primary will force the winner to concede that Pennsylvania can indeed run a clean, close election and recount after all  especially if Oz prevails with the \"ballots they just happened to find.\"",
    "The margin between celebrity TV doctor Mehmet Oz and former hedge fund CEO David McCormick has been razor-thin, sitting at just 1,206 votes with more than 95% of ballots counted by Thursday afternoon, according to Insider's partners at Decision Desk HQ.",
    "Echoing his previous false statements baselessly alleging fraud, Trump told Oz in a TRUTH Social post that declaring victory before the vote is finalized \"makes it much harder for them to cheat with the ballots that they 'just happened to find.'\"",
    "Making matters even more chaotic, President Donald Trump has been publicly pressuring Oz  his endorsed candidate who struggled to consolidate the MAGA vote  to preemptively declare victory, as the former president did in 2020.",
    "Republican Pennsylvania Senate candidates Mehmet Oz and David McCormick Stephanie Keith, Tom Williams/CQ-Roll Call Inc via Getty Images\nThe GOP primary for Sen. Pat Toomey's seat in Pennsylvania won't be decided any time soon.",
    "In 31 precincts in Allegheny County, flash drives containing election data were left at polling sites instead of taken to central counting locations and can't be retrieved for tabulation until Monday, county officials said.",
    "Oz and McCormick, who are both independently wealthy, have spent $12 million and $11 million on their own campaigns, respectively, and could soon find themselves paying even more for election lawyers across the state.",
    "A narrow margin of just 0.09 percentage points currently separates Oz and McCormick, all but guaranteeing a statewide recount under Pennsylvania's 0.5-percentage point automatic recount threshold.",
    "And the delay in resolving the Republican primary could take up precious time that ultimately advantages the Democratic Senate nominee in one of the nation's most competitive 2022 Senate races.",
    "Pennsylvania has been a ground-zero of highly-scrutinized election processes, legal battles over voting laws, and aggressive efforts by Republicans to overturn Trump's 2020 election loss.",
    "McCormick in particular has benefited from the mail-in and absentee votes relative to Oz, though it remains unclear how large a share of the remaining ballots fall into those categories.",
    "Acting Secretary of State Leigh Chapman says she'll \"have a very good sense\" of whether she'll be calling for a recount by Tuesday when counties are due to send her unofficial returns.",
    "The outstanding votes include 51,000 total absentee ballots, including 17,000 Republican primary ballots, yet to be counted, the secretary of state's office announced Thursday morning.",
    "Those efforts culminated in 2020 election denier and January 6 rally attendee state Sen. Doug Mastriano with Trump's backing, easily securing the Republican nomination for governor.",
    "Some Election Day votes in Allegheny County, a McCormick stronghold, and Philadelphia are also still yet to be counted, NBC's Steve Kornacki explained in a Thursday Twitter thread.",
    "John Fetterman, who easily cleared the field for the Democratic nomination on Tuesday, raised an eye-popping $1.6 million the day after winning the race, his campaign said.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The law requires the secretary of state to call for a recount by the end of the day on the Thursday after the election, or May 26, according to the Philadelphia Inquirer.",
    "Most of the uncounted ballots are in Philadelphia, where Oz currently leads, Delaware County, where McCormick narrowly leads, and Lancaster County.",
    "Election workers are currently in the process of manually duplicating and scanning 16,000 ballots, a process they expect to wrap up by Friday.",
    "Pennsylvania's Republican Senate primary is likely headed to an automatic recount with the Senate majority hanging in the balance.",
    "The looming  possibly weeks-long  recount will extend an already expensive, tumultuous, and high-stakes primary election.",
    "A smaller pool of overseas and military votes and provisional ballots will also add to the count over the next few days.",
    "And in Lancaster County, a printing error of the county's absentee ballots made them unable to be read by scanners.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Updated 5/19/2022, 1:10:54 PM\nWe're sorry but embeds doesn't work properly without JavaScript enabled.",
    "Meanwhile, former President Donald Trump has been encouraging Oz to pre-emptively declare victory.",
    "Mehmet Oz and David McCormick are so close that they'll likely trigger an automatic recount.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Ballot counting hiccups in two counties have further delayed counting.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Please enable it to continue.",
    "Loading Something is loading.",
    "Estimated > 95% in.",
    "Lt. Gov."
  ]
}