{
  "id": 6566,
  "mediaId": 238,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Post Politics Now Senate primary in Pa. still unresolved as other tests of Trumps influence loom",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/20/trump-oz-mccormick-biden-asia/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mariana Alfaro",
  "authorUrl": "https://www.washingtonpost.com/people/mariana-alfaro/",
  "termIds": [
    1147,
    1916,
    2087,
    2095,
    2203,
    2305,
    3102,
    571,
    2904,
    2912
  ],
  "sentences": [
    "Circuit initiated the survey last year to better understand our employees workplace experiences, and employees who completed the survey did so on the understanding that their responses would be used only for that purpose and kept confidential.?\nReturn to menu\nThe mass shooting in Buffalo has brought new attention to the great replacement? conspiracy theory, embraced by some GOP lawmakers, that claims Democrats are plotting to reduce the influence of Whites in the United States.",
    "Cleve R. Wootson Jr.: Biden tries to put focus on ties to U.S. allies in Asia  Biden started his first trip to Asia as president at a semiconductor plant in Pyeongtaek, South Korea, near Seoul  but the trip comes at a time when the focus of the world, and the region, seems to be on everything else.North Korea is preparing to test a long-range ballistic missile that could easily reach the United States, or even a nuclear weapon, according to intelligence reports.",
    "Return to menu\nHouse Majority Whip James E. Clyburn (D-S.C.) warned in a new interview that the country is in danger of imploding? and democracy is in danger of disintegrating.?\nThe dire view, expressed in an interview with The Posts Leigh Ann Caldwell and Theodoric Meyer, was expressed during a discussion that touched on the mass killing at the Tops grocery store in Buffalo, which police say was motivated by the shooters racist beliefs.",
    "The Democratic National Committee also weighed in Scotts visit, with spokesman Ammar Moussa saying in a statement that the New Hampshire GOP is rolling out the red carpet for Senator Rick Scott as he pushes an extreme and devastating agenda.?\nReturn to menu\nWith the landscape on reproductive rights rapidly shifting, Republican-led states are increasingly looking at the prospect of restricting access to abortion pills.",
    "But Trumps questioning of the legitimacy of mail-in ballots as the lead of Oz, his endorsed candidate, has narrowed, is not without consequences, The Posts Colby Itkowitz and Rosalind S. Helderman write:\nThe dynamic reflects how, following the precedent set in 2020, close elections may face scrutiny and doubt even when there is no evidence to support wrongdoing or error.",
    "Return to menu\nPresident Biden, near the outset of his first trip to Asia of his presidency, touted a top domestic priority for the administration, calling in a speech in Pyeongtaek, South Korea, for final passage of a sweeping bill in Congress meant to boost U.S. competitiveness against China that House and Senate negotiators are scrambling to finalize.",
    "Writing in The Fact Checker, The Posts Glenn Kessler and Adriana Usero explore that question and Johnsons recent claim that all hes ever done is parroted exactly what Democrats have said about this.? Glenn writes:\nSeen in full context, our review of Johnsons comments show he often seems to walk up to the line but does not appear to embrace the theory.",
    "The Posts Greg Jaffe reports that the thesis, written in 2001 when Mastriano was a major at the Air Forces Air Command and Staff College, is highly unusual for its doomsaying and often fearful point of view  and its prediction that only the U.S. military could save the country from the depredations of its morally debauched civilian leaders.",
    "Writing in The Early 202, Leigh Ann Caldwell and Theodoric Meyer assess whats at stake and some of the fallout from drafts of what will be finalized:\nDemocrats are already heading into a challenging midterm season where they could lose control of the House with voters sour about soaring inflation and down on Bidens job performance.",
    "Aaron writes:\nA trend you might notice if you peruse the data is that most of the states with significant over counts were blue states like Hawaii (e.g., Delaware, Rhode Island, New York and Massachusetts), while most with undercounts were red, Southern states like Arkansas (e.g., Tennessee, Florida, Mississippi and Texas).",
    "Return to menu\nSen. Rick Scott (R-Fla.), who has become a favorite punching bag for President Biden and other Democrats of late, is scheduled to be in New Hampshire, traditionally the first presidential primary state, on Friday night to deliver a speech at a fundraising dinner for the Sullivan County Republican Committee.",
    "Return to menu\nTwo decades before he was the Republican nominee for Pennsylvania governor, Doug Mastriano warned in a masters thesis that the United States was vulnerable to a left-wing Hitlerian Putsch? that would begin with the dismantling of the U.S. military and end with the destruction of the countrys democracy.",
    "Circuit Chief Judge Sri Srinivasan informed colleagues of the planned investigation after The Washington Post on Monday published a report about the surveys findings and the reluctance among courthouse employees to file workplace misconduct complaints against their superiors for fear of reprisal.",
    "Return to menu\nThe Trump administration put a lot of effort into an ultimately unsuccessful attempt to exclude undocumented immigrants from census counts with the apparent aim of allowing Republicans to draw more favorable maps in redistricting and gain more ground in the House.",
    "She writes:\nA growing number of lawmakers, along with teachers, students, parents and business leaders, aim to head off these attacks partly by teaching children that the Asian American community is American, too  and that Asian American history is also American history.",
    "South Koreas Chosun Ilbo newspaper, which first reported the case on Friday citing an unnamed source, said the suspect is alleged to have been drunk and fighting with a South Korean citizen over a taxi near the Grand Hyatt hotel in Seoul, where Bidens team is staying.",
    "Bidens speech comes as his administration is struggling with the economic and political impact of rising inflation in the United States, with Biden making the case that the legislation will ultimately strengthen supply chains and lower costs for consumers.",
    "Amy writes:\nSquaring off against an ardent Trump acolyte, Raffensperger has chosen the path of political pragmatism, courting the former presidents base while not completely abandoning his image as the rare Republican willing to take Trump on.",
    "Today, celebrity physician Mehmet Oz, the Republican Senate candidate in Pennsylvania backed by Donald Trump, continues to wait to see if he will prevail over David McCormick in a much tighter primary race than the former president hoped for.",
    "Clyburn said the incident reminded him of a similar tragedy in 2015 in his home state when nine people were shot at a Bible study at the Mother Emanuel AME Church in Charleston, S.C.\nIve never gotten over Charleston and I dont think I will.",
    "Return to menu\nA New York congressional map drawn by a court-appointed special master, Jonathan R. Cervas, is expected to be finalized Friday, setting off a scramble among the states incumbent House members to choose where they will run.",
    "Return to menu\nFormer president Donald Trumps evidence-free suggestions that Pennsylvanias too-close-to-call Republican Senate primary was somehow rigged have not been embraced by the leading candidates, Mehmet Oz and David McCormick.",
    "The Posts Min Joo Kim reports that the person was detained early Thursday, according to an official at Seouls Yongsan district police, who spoke on the condition of anonymity because he was unauthorized to speak about the incident.",
    "The Posts Amy Gardner reports on the delicate balance Raffensperger is trying to strike as he campaigns in a GOP primary in a state where most Republicans still love Trump and believe his false narrative about the 2020 election.",
    "Return to menu\nA confidential employee survey detailed accusations that some federal court judges in D.C. subjected staff members to gender discrimination, bullying and racial insensitivity, The Post reported earlier this week.",
    "And the Russian invasion of Ukraine is in its third month.The alliance between the Republic of Korea and the United States of America is a linchpin of peace, stability and prosperity for this region of the world,? he said.",
    "Return to menu\nGeorgia Secretary of State Brad Raffensperger (R), an official who famously resisted then-President Donald Trumps pressure to find? votes in the 2020 presidential election, is on the ballot this year.",
    "Return to menu\nOne of President Bidens security personnel was arrested after allegedly assaulting a South Korean citizen in Seoul a day before the presidential trip to the country, according to police on Friday.",
    "What that means: When it comes to the post-census awarding of seats  a process known as apportionment  those red states might have been at a deficit, because they werent given credit for their full populations.",
    "The legislation, one of the few notable bipartisan bills expected to clear Congress this midterm year, will funnel significant investment into research and development projects in the United States, Biden said.",
    "Return to menu\nAs anti-Asian attacks surge nationwide, a movement is hoping to combat hate with history, pushing states to require lessons on Asian Americans and Pacific Islanders in public schools.",
    "Other tests of Trumps influence loom next week, including in Georgia, where polls show his preferred choice for governor, David Perdue, badly trailing incumbent Brian Kemp in the GOP primary.",
    "The Posts Aaron Blake notes that a new report from the U.S. Census Bureau finds that 14 states were significantly miscounted in the 2020 Census, including six by 4 percentage points or more.",
    "Pennsylvania Republican Patrick J. Toomey, whose retirement created the open Senate seat, said he had been impressed with both McCormick and Oz, neither of whom have questioned the results.",
    "We wont let them.? It features the faces of Scott, Senate Minority Leader Mitch McConnell (R-Ky.) and the three top GOP contenders to take on Sen. Maggie Hassan (D-N.H.) in the fall.",
    "Election officials in Pennsylvania are girding for similar complaints in November, but fear there are few ways to combat deliberate misinformation and rising political toxicity.",
    "Greg writes:\nThe paper is posted on an official Defense Department website and lists Mastriano as the author at a time when he said he received a masters degree from the school.",
    "Writing in The Health 202, The Posts Rachel Roubein says the efforts so far have focused on regulations around the pills, such as banning them from being shipped or prescribed.",
    "The Posts Marian Chia-Ming Liu reports that Illinois and New Jersey require such classes, and Connecticuts governor is expected to sign legislation soon on the issue.",
    "Also on the ballot on Tuesday: Brad Raffensperger, the Georgia secretary of state who resisted Trumps urging to find? votes in the 2020 presidential election.",
    "Biden has been on the attack against Scott for a plan the senator released earlier this year that would require all Americans to pay federal income taxes.",
    "He frames his questions around his outrage about the surge of migrants at the U.S. border and his belief that Biden is deliberating tolerating the surge.",
    "China, South Koreas biggest trading partner, will undoubtedly have a response to the American president trying to strengthen alliances so close to home.",
    "Blue states, on the other hand, might have been given more seats because the Census Bureau thought they contained more people than they actually did.",
    "DHS oversees the Secret Service, whose agents in the past have been involved in scandals while being detailed overseas.",
    "Some argue states may be hard-pressed to ban the federally approved medication, though antiabortion advocates disagree.",
    "Federal court officials are now planning to investigate how the report was disclosed, The Posts Ann E. Marimow reports.",
    "The White House referred questions to the Secret Service, which did not immediately respond to a request for comment.",
    "But can states ban the actual abortion pill itself, even though the Food and Drug Administration has approved it?",
    "The suspect works for the U.S. Department of Homeland Security and is in their 30s, according to the newspaper.",
    "The short answer comes down to this: The issue isnt settled law and will likely be litigated in the courts.",
    "You wonder whether or not people just decided that the pursuit of a more perfect union has come to an end.",
    "Srinivasan said Thursday that leaders of the U.S. District Court and U.S. Court of Appeals for the D.C.",
    "The contest could be headed to a runoff after the thousands of remaining mail-in ballots are counted.",
    "He then suggests it appears to be a policy to enhance the future election prospects for Democrats.",
    "It seems as if they were just supposed to happen then you go and wait for the next one to happen.",
    "And you know its just a mystery to me that weve become so tolerable of these kinds of incidents.",
    "But Democrats are highlighting another issue  abortion  in conjunction with Scotts visit.",
    "A new billboard in Manchester reads, Republicans want to criminalize abortion.",
    "He was critical of Trumps evidence-free assertions of malfeasance.",
    "The prices of gas and consumer goods are up at home.",
    "But look at where we are [in] the country.",
    "It seems to be its coming from all sides.",
    "The official declined to comment further.",
    "And theyre going to keep happening.",
    "Trump is backing a challenger.",
    "Ann writes:\nD.C."
  ]
}