{
  "id": 6589,
  "mediaId": 409,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Republicans Can Still Blow the 2022 Midterms",
  "image": "https://www.nationalreview.com/wp-content/uploads/2010/10/Christine-ODonnell-1.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/republicans-can-still-blow-the-2022-midterms/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charles C. W. Cooke",
  "authorUrl": "https://www.nationalreview.com/author/charles-c-w-cooke/",
  "termIds": [
    1606,
    2087,
    2164,
    3102,
    5277,
    5387,
    428
  ],
  "sentences": [
    "I suspect that there is nothing that Republicans can do at this point to fail to win the House, and, because Joe Biden will be president until at least 2024, the size of their potential majority isnt as important it might otherwise be.",
    "The mere existence of a Good Republican Year will not be enough to offset Bad Republican Choices, and, in Pennsylvania at least, Republicans seem to have made a series of bad choices.",
    "A political wave? will help to blunt any sharp edges, but even the largest waves cannot carry everyone who rides them to the shore.",
    "The Doug Mastriano win should remind us that the Republican Party is still capable of blowing the coming midterms.",
    "Senate majorities are built over time, which makes it imperative for parties to build them up when the sun shines.",
    "But Republicans can certainly fail to take full advantage of the opportunity with which they have been presented.",
    "If the GOP had chosen someone other than Sharron Angle that year, it would have deposed Harry Reid in Nevada.",
    "Had it chosen someone other than Christine ODonnell, it would have taken a Senate seat in Delaware.",
    "President Biden and his party are far too unpopular and far too incompetent to allow for that.",
    "Had it chosen someone other than Ken Buck, it would have beaten Michael Bennet in Colorado.",
    "These decisions may have profound effects on the future.",
    "Those six-year-terms make every race crucial.",
    "Could this pattern repeat itself this year?",
    "Youre damn straight it could.",
    "Not completely, of course.",
    "2010 is instructive here.",
    "Sometimes, people drown.",
    "The jury is still out.",
    "But the Senate?",
    "Will the GOP?"
  ]
}