{
  "id": 6608,
  "mediaId": 234,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out",
  "image": "https://media.vanityfair.com/photos/6286749c04663672575dd9db/master/w_2240,c_limit/1240733893",
  "link": "https://www.vanityfair.com/news/2022/05/donald-trump-georgia-brian-kemp-david-perdue",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    1147,
    1434,
    1951,
    2087,
    2095,
    2303,
    2491,
    3102,
    3103,
    4325,
    428,
    571,
    2672
  ],
  "sentences": [
    "With fewer backing Perdue than saying Trumps endorsement made them more supportive, this race is clearly more about the candidates themselves than Trumps preferences.? One candidate consumed by scandals, North Carolina Rep Madison Cawthorn, lost his primary race earlier this week despite getting a last-minute endorsement from Trump.",
    "He did absolutely nothing? to help Trump steal the 2020 election, the former president whined on Fox News that year, and certified the Georgia results, despite unhinged attacks against himincluding a call from lawyer Lin Wood for Kemp and Secretary of State Brad Raffensberger to be jailed, which was promoted by the former president.",
    "So, too, has Kemp, who was about as Trumpy a politician as there was until the 2020 election: As secretary of state in Georgia during his gubernatorial campaign in 2018, he purged voters from the rolls and put tens of thousands of registrations from Black voters on hold on his way to victory over Stacey Abrams.",
    "With many of the signature ingredients of Trumpismdisdain for democratic norms; incessant culture war rancor; unabashed griftnow baked right into the Republican party platform, right-wing radicals may have less need for Trump himself to add his own seasoning to their campaigns.",
    "Trump has been desperately trying to lift David Perdue, his preferred candidate in Georgias governor race, over incumbent Brian Kempa right-wing governor who provoked his ire by not doing more to overturn Joe Bidens 2020 election win.",
    "Trump has cut an ad for Perdue, held one of his trademark rallies for him in the state, and issued nutty statements attacking Kemp as the worst election integrity Governor in the country? and a RINO.?\nNone of it has seemed to matter.",
    "MAGA does not belong to President Trump,? said Barnette, who enjoyed a late surge in that primary race as she positioned herself as the true MAGA candidate in the raceeven though she did not receive his endorsement.",
    "As governor, hes been about as right-wing as it getssigning draconian abortion restrictions, supporting attacks on the Affordable Care Act, and ignoring public health recommendations during the COVID-19 pandemic.",
    "According to a Fox News poll out Wednesday, Kemp now leads the Trump-backed rival by 32 points among Republican votersthree times the margin he enjoyed back in March, the month Trump held a rally in the state.",
    "But it would also represent his movements ultimate victory: the petty grievances and all-consuming prejudices and underhanded schemes of one man systematized by one of the two major parties in America.",
    "(Perhaps it is no accident that Kemps highest-profile supporter is Mike Pence, who was also threatened by Trumpworld for certifying the 2020 results.)",
    "In this race in particular, Trump doesnt seem to have the juice to oust a popular incumbent,? the Republican pollster, Daron Shaw, told the network.",
    "Perdue, who represented Georgia in the Senate at the time, echoed Trumps wild criticisms of his states leaders, and earned his support as a result.",
    "But one high profile race is proving that the former presidents complete and total endorsement? is not necessarily an easy ticket to MAGA victory.",
    "But it has also grown beyond the man himself, as the radical right Pennsylvania Senate candidate Kathy Barnette suggested in a debate last month.",
    "She and David McCormick, who remains neck and neck with Dr. Oz, essentially ran as Trumpist candidates without the support of Trump himself.",
    "And it may help Mehmet Oz edge out his primary rivals in a still too-close-to-call race to replace retiring Pennsylvania Senator Pat Toomey.",
    "On the contrary, it would seem to underscore the extent to which Trumpism has been absorbed into the fabric of the GOP.",
    "Its a good ticket, but its not a golden ticket,? Republican strategist Doug Heye told the Hill of a Trump endorsement.",
    "It helped Pennsylvanias Doug Mastriano claim a double-digit victory in his Republican gubernatorial race.",
    "The party is more broadly turning Trumpier, whether its with or without Trump.?",
    "Kemp has not only maintained a lead over Perduehes appeared to expand it.",
    "Such a prospect would surely be an unsavory one to Trump, of course.",
    "This isnt to suggest Trumps influence on the party is waning.",
    "Vance secure a win in Ohios GOP Senate primary.",
    "The sin that cast him from Trumps good graces?",
    "The movement remains a cult of personality.",
    "Donald Trumps support helped J.D.",
    "Little good its done him."
  ]
}