{
  "id": 6621,
  "mediaId": 943,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Pennsylvania Lt. Gov. John Fetterman, who suffered a stroke days before primary, wins Democratic nomination for US Senate",
  "image": "https://www.chicagotribune.com/resizer/QCIE1eNLRJ9sEWlWBdpG3D1OPJA=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/YR45ZGNYMD7BRCTOSE46PGH3WY.jpg",
  "link": "https://www.chicagotribune.com/nation-world/ct-aud-nw-election-2022-20220518-jpuogwg25rcjvco5ii7e4qilb4-story.html",
  "sentiment": "0.19",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WILL WEISSERT",
  "authorUrl": "",
  "termIds": [
    729,
    1404,
    1770,
    2491,
    3102,
    146,
    571,
    2834,
    2862
  ],
  "sentences": [
    "She said she chose Mastriano because he was sticking by President Trump and saying that everything was fraudulent.?\nEverything he was talking about was making sense,? said Steinly, who wore a black T-shirt that said Biden is not my president (or anyone elses) based on legal votes.?\nAssociated Press writer Michael Rubinkam contributed from Hamburg, Pennsylvania.",
    "Mastriano made Trumps lies about widespread electoral fraud costing him the presidency a centerpiece of his campaign  and has been subpoenaed by the House committee investigating the Capitol riot following his efforts to name a slate of alternate Electoral College electors in Trumps favor.",
    "Robert Sweeney, a 59-year-old resident of Hamburg, Pennsylvania, said he voted for Fetterman because he seemed like a decent guy and knows what hes doing.?\nFetterman, who is Pennsylvanias lt. governor, could enter the general election campaign facing questions about his health.",
    "State Sen. Doug Mastriano  who secured a late endorsement from Trump and has trumpeted the former presidents lies about nonexistent, widespread fraud costing him the 2020 election  won the Republican nomination for Pennsylvanias open governors office.",
    "This should be a wake up call to the entire Democratic Party establishment to fight harder against the fascists and those who obstruct a popular agenda,? Stephanie Taylor, co-founder of the Progressive Change Campaign Committee, said in a statement.",
    "But it also raises immediate questions about whether Mastriano, who was outside the U.S. Capitol in January 2021 when a mob overran it in a deadly insurrection, can attract enough moderate swing voters to prevail in Novembers general election.",
    "He has pledged to take the extraordinary step of requiring voters to re-register? to vote  even though thats barred by the National Voter Registration Act and likely violates significant protections under federal, and possibly state, law.",
    "We need to put the brakes on this agenda for the sake of hardworking North Carolinians.?\nBudd will face Democratic former state supreme court justice Cheri Beasley, who is aiming to become North Carolinas first Black senator.",
    "That, combined with his support of top progressive causes such as universal, government funded health care, helped him easily dispatch with Democratic rival U.S. Rep. Conor Lamb, a moderate in the mold of President Joe Biden.",
    "He said he was on track for a full recovery.?\nAnd Fetterman will likely face scrutiny over a 2013 incident when, shotgun in hand, he confronted a Black man because he suspected the man was involved in gunfire nearby.",
    "Pennsylvanias GOP Senate contest was too early to call, with celebrity heart surgeon Mehmet Oz, former hedge fund CEO David McCormick and commentator Kathy Barnette all vying for the partys nomination.",
    "Despite Trumps backing, some conservative voters have been suspicious of the ideological leanings of Oz, the celebrity heart surgeon who gained fame as a frequent guest on Oprah Winfreys talk show.",
    "HARRISBURG, Pa.  Days after a stroke sent him to the hospital, John Fetterman easily won Pennsylvanias Democratic Senate primary, notching a major victory Tuesday for his partys left flank.",
    "In this moment, we have the power to protect our rights.?\nTuesday marked the busiest night of the nascent primary season, with contests also being waged in Kentucky, Oregon and Idaho.",
    "The man, Christopher Miyares, was unarmed and said in a TV interview that he had been jogging when Fetterman, who is white, pulled up in his pickup and pointed the shotgun at him.",
    "Trump used the races final weekend to ack Doug Mastriano, but the state senator is seen as too extreme to woo moderates who are often decisive in general elections.",
    "Both parties are choosing candidates to enter the fall general election, when control of Congress, governors mansions and key elections posts are up for grabs.",
    "Oz is the preferred candidate of former President Donald Trump, who has sought to wield the power of his endorsement to lift his loyalists and reshape the GOP.",
    "Then theres Mastriano, who was also outside the Capitol during the mob attack and would appoint Pennsylvanias chief elections official if he becomes governor.",
    "Following his stroke, he cast an emergency ballot from the hospital and tweeted on Tuesday that hed successfully undergone surgery to install a pacemaker.",
    "Barnette is running even further to the right than Oz and participated in the January 2021 rally that turned into an insurrection at the U.S. Capitol.",
    "The 52-year-old Fetterman is known for his hulking, 6-foot-8 stature frame, and tattoos that helped him build a political persona as an outsider.",
    "Trump, who has held campaign-style rallies with Oz, insists he is the best candidate to keep the Senate seat in Republican hands in the fall.",
    "Stacy Steinly, a 51-year-old school bus assistant, cast her ballot in the town of Hamburg, Pennsylvania, about 30 miles west of Allentown.",
    "Thats allowed commentator Barnette to emerge in the final days of the primary as a conservative alternative to both Oz and McCormick.",
    "Trumps surprise endorsement last year lifted Budd, a little known congressman, over better-known rivals, including a former governor.",
    "Trump scored an easy victory early in the night when U.S. Rep. Ted Budd clinched the GOP nomination for Senate in North Carolina.",
    "Should she win the primary and general election, Barnette would be the first Black Republican woman elected to the U.S. Senate.",
    "She told supporters this is our moment.?\nWe have the power to restore our values to our government in Washington,? she said.",
    "The big question is which Republican he will face in what will likely be one of the most competitive Senate races this year.",
    "Much of the attention was on Pennsylvania, a perennial political battleground that could decide control of the Senate.",
    "Theres definitely some concern in large factions of the party,? said Pennsylvania Republican strategist Vince Galko.",
    "Given his level of involvement in the race, a loss would be a notable setback for the former president.",
    "He quickly pivoted to a general election message focused on breaking Democratic control of Washington.",
    "Mastrianos victory extends Trumps winning streak in major Republican primaries around the country.",
    "More fundamentally, Tuesdays primaries could test voters commitment to democratic principles.",
    "Fetterman has denied pointing the shotgun at Miyares and said it wasnt loaded.",
    "Under Joe Biden, America is woke and broke,? he said at a victory rally.",
    "Oz has spent much of the campaign in a heated fight with McCormick.",
    "Fettermans victory shows that voters are fed up and want fighters.",
    "The Republican Senate campaign has proven far more divisive.",
    "Whom Shapiro will face was also unclear."
  ]
}