{
  "id": 6626,
  "mediaId": 409,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "In Pennsylvania, Will the 2022 Gubernatorial Election Just Be about the 2020 Presidential Election?",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/01/pennsylvania-electoral-college-ballot.jpg?w=1200",
  "link": "https://www.nationalreview.com/corner/in-pennsylvania-will-the-2022-gubernatorial-election-just-be-about-the-2020-presidential-election/",
  "sentiment": "-0.488",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arjun Singh",
  "authorUrl": "",
  "termIds": [
    1147,
    1713,
    3102,
    428,
    556,
    2862,
    2934
  ],
  "sentences": [
    "Not only did he claim the election was stolen, but he was also in the vanguard  organizing a meeting of the state party to legitimize the falsehood, leading delegations to Trumps White House to strategize, and sponsoring a bill in the state legislature to replace lawful electors.",
    "Instead of real debates on current issues facing Pennsylvanians  about education and parental rights, energy and fracking, abortion and the future after Roe v. Wade  the 2022 election agenda is likely to be hijacked in the Keystone State by disputes about the 2020 election.",
    "After spending December of that year doing back-to-back TV talk-show appearances attacking Trump and Mastrianos efforts, Shapiro gained a national profile for his advocacy, which has been the basis for his unopposed gubernatorial primary run and soaring fundraising.",
    "The Pennsylvania governors race this election cycle will probably minimize genuine concerns as Mastriano and Shapiro relitigate whether Donald Trump really won the state in 2020 (he didnt) and what election integrity? measures should come next.",
    "Of all questionable aspects of Mastrianos character  also including indulging the QAnon conspiracy theory and past anxieties about Muslims running for public office  his role in the 2020 election dispute is the most notable and egregious.",
    "Emblazoned on Shapiros website, in boldface text, is JOSH DEFENDS PENNSYLVANIA VOTERS AND THE RESULTS OF THE 2020 ELECTION,? against extremist Republicans.? Shapiros record is hardly comparable to Mastrianos.",
    "As Pennsylvania attorney general during the election dispute, Shapiro was the lead defendant in Texas v. Pennsylvania, the major Supreme Court case contesting the election in the state.",
    "He even sent a busload of supporters to the U.S. Capitol on January 6 and breached the perimeter as other Trump supporters stormed the building (he claims that he didnt enter).",
    "With candidates like these, whose claim to fame is the 2020 election, voters can expect less discussion on the future of the state, and more broadsides regarding that past.",
    "But their weird symbiosis causes Shapiro to require and elevate Mastriano as a threat, hence his perversely strategic support of Mastrianos primary campaign.",
    "Two years after that saga, as Pennsylvanias voters wish to move on, both parties nominees for governor are looking backwards to whip up their bases.",
    "Yesterdays gubernatorial primary elections  won by Doug Mastriano for the GOP and Josh Shapiro for the Democrats  only made this clearer.",
    "Already, the attack ads are rolling in; messaging about election audits? and vote by mail? is getting more airtime than anything else.",
    "Mastriano, a state senator, tried to overturn Pennsylvanias Electoral College votes in 2020.",
    "In 15 months, hes raised nearly $20 million, more than all Republican candidates combined.",
    "The future of the Commonwealth looks very bleak  unless Pennsylvania voters demand better.",
    "And now, nearly two years later, he is still running on these achievements.",
    "Democratic nominee Josh Shapiro did not indulge Trumps lies.",
    "NR Daily is delivered right to you every afternoon.",
    "Just look at the candidates.",
    "No charge."
  ]
}