{
  "id": 6655,
  "mediaId": 169,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Cawthorns loss highlights Trumps waning influence but election deniers win big in GOP primaries",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/03/madison-cawthorn-0304221.jpg",
  "link": "https://www.salon.com/2022/05/18/cawthorns-loss-highlights-trumps-waning-influence-but-deniers-win-big-in-primaries/",
  "sentiment": "0.0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    821,
    1147,
    1404,
    1878,
    2087,
    2213,
    2303,
    3102,
    428
  ],
  "sentences": [
    "Cawthorn faced a growing number of personal scandals amid attacks from both the left and Republicans in his own party, including Sen. Thom Tillis, R-N.C. Trump begged voters to give Cawthorn a \"second chance\" despite \"some foolish mistakes\" but Cawthorn ultimately narrowly lost the race, trailing Edwards by just over 1,300 votes with 95% of ballots counted.",
    "Budd voted against certifying Trump's election loss after the Jan. 6 riot and later texted then-White House chief of staff Mark Meadows to push a repeatedly discredited claim that Dominion voting machines, which Trump allies falsely claimed flipped votes from Trump to President Joe Biden, were linked to Democratic billionaire George Soros.",
    "Mastriano \"has appeal to base Republicans, but I fear the Democrats will destroy him with swing voters,\" Republican state Senate Majority Leader Kim Ward wrote last week, adding that \"winning the primary and losing the general because the candidate is unable to get the voters in the middle, isn't a win.\"",
    "While the contests showed Trump's waning influence among the party's base, particularly following the loss of Trump-backed Nebraska Republican gubernatorial candidate Charles Herbster amid sexual assault allegations, election deniers had a big night whether they were backed by Trump or not.",
    "Rep. Kurt Schrader, D-Ore., a centrist Democrat backed by Biden despite helping to kill his plan to lower prescription drug costs, also appears to be headed for a loss against progressive challenger Jamie McLeod-Skinner, who leads by more than 20 points with more than half of the vote in.",
    "House Speaker Nancy Pelosi's PAC also backed newcomer Carrick Flynn, whose bid was backed by millions in donations from a crypto billionaire, but Flynn conceded the race as progressive state Rep. Andra Salinas led by nearly 20 points with more than 70% of the vote in.",
    "Mastriano has been one of the most avid backers of Trump's Big Lie and \"there is almost certainly no chance that a Democratic presidential candidate's victory in Pennsylvania in 2024 will be certified\" if he wins, Washington Post columnist Greg Sargent warned.",
    "Centrist Democrats also spent big to elect attorney and activist Steve Irwin in Pennsylvania's 12th District but the newcomer appears to have lost to progressive state Rep. Summer Lee, who led by several hundred votes with 93% of precincts reporting.",
    "Oz led McCormick by just 0.2% with 95% of precincts reporting, but McCormick's camp said they are \"confident\" that a large number of outstanding absentee ballots  which Trump world has long decried  would ultimately put him back in the lead.",
    "And despite Cawthorn's loss, Trump scored a big win in North Carolina's 13th District, where 26-year-old Bo Hines, a right-wing Big Lie promoter who has been likened to Cawthorn, won his primary in a safe Republican district.",
    "In perhaps the most-watched contest of the night, Trump-backed celebrity doctor Mehmet Oz is locked in a too-close-to-call race with hedge fund manager David McCormick, who also worked in the George W. Bush administration.",
    "\"Tuesday's results suggest Democratic voters  at least those in Pennsylvania and Oregon  would prefer that Democrats do more rather than less, delivering a stinging rebuke to the Kyrsten Sinema-Manchin wing of the party.\"",
    "They'll join Trump-backed gubernatorial candidate Doug Mastriano, a state senator who attended the Jan. 6 rally ahead of the Capitol riot and served as a phony Trump elector in an effort to overturn his loss.",
    "\"The stunning wins come as the party debates who is to blame for President Biden's sinking approval rating and increasingly dire forecasts of upcoming midterm losses,\" wrote The Intercept's Ryan Grim.",
    "Mastriano won his primary on Tuesday in a landslide after Trump endorsed him despite pleading from the state GOP that it could cripple their chances of winning the governor's mansion in November.",
    "Republican candidates backed by former President Donald Trump had a mixed night on Tuesday but election deniers dominated contested primary contests.",
    "The winner of the Oz-McCormick race, which is likely headed for a recount if the final margin is less than 0.5%, will face off against Lt. Gov.",
    "The rise of election deniers, particularly in races for governor and secretary of state, could pose a significant threat to future elections.",
    "Neither Oz nor McCormick has acknowledged Trump's 2020 loss, meaning the party's nominee will be an election denier regardless who wins.",
    "Rep. Madison Cawthorn, R-N.C., conceded his race to three-term state Sen. Chuck Edwards before the election was even called on Tuesday.",
    "The Pennsylvania GOP panicked after Trump's endorsed the conspiracy theorist over concerns that he would cost them a winnable seat.",
    "Kathy Barnette, a surging Republican who sought to out-MAGA Trump's pick, ultimately fizzled and came in third.",
    "Brad Little after repeatedly trying to usurp his powers, lost her race to the incumbent by more than 20 points.",
    "Mastriano will face state Attorney General Josh Shapiro, who ran unopposed in the Democratic primary.",
    "John Fetterman, who easily defeated centrist Rep. Conor Lamb, D-Pa., in the Democratic primary.",
    "Several prominent candidates backed by Trump went down in defeat as five states held primaries.",
    "Lamb's defeat signaled a tough night for the centrist wing of the Democratic Party.",
    "But Mastriano's extremism also poses a risk for Republicans in the purple state.",
    "Even on Tuesday, Budd refused to acknowledge Biden as the legitimate winner.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Trump-backed Rep. Ted Budd, R-N.C., trounced former Gov.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Janice McGeachin, who ran a MAGA challenge to Gov.",
    "Pat McCrory by more than 30 points.",
    "Trump-backed Idaho Lt. Gov.",
    "Read more:"
  ]
}