{
  "id": 6706,
  "mediaId": 188,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Pennsylvania GOP Senate race appears to be headed for a recount",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTgyMjc5OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMzkyOTA3Mn0.jsXd6tkz4WSj2xFJhZG64a8CObIvUwlXsBGxmPbo6RI/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C107&height=700",
  "link": "https://www.theblaze.com/news/pennsylvania-senate-race-oz-mccormick",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    943,
    1147,
    1770,
    2491,
    3102,
    428,
    517,
    539,
    571,
    2992,
    2862
  ],
  "sentences": [
    "TV celebrity Dr. Mehmet Oz and former hedge fund CEO David McCormick are separated by fewer than 2,000 votes with more than 1.3 million ballots cast in the highly contested campaign to succeed retiring Sen. Pat Toomey (R-Pa.).",
    "Oz, who is supported by former President Donald Trump, holds a small lead over McCormick as several counties have yet to finish counting mail-in ballots, as well as provisional, overseas, and military absentee ballots.",
    "Though a winner has yet to be declared, Trump urged Oz to claim victory on Truth Social, the social media platform he founded to compete with the \"liberal media consortium\" of Facebook, Twitter, and other websites.",
    "More than 37% of registered Republican voters turned out for the primary election, the highest midterm primary turnout recorded in at least two decades, according to the Associated Press.",
    "Kathy Barnette, a firebrand Trump-supporter who made a surprising surge in the polls during the final weeks of the campaign, finished in a distant third with 24.7% of the vote.",
    "John Fetterman overwhelmingly won the Democratic Senate primary hours after being hospitalized to have a pacemaker implanted after he suffered from a stroke on Friday.",
    "Pennsylvania state law prevents counties from beginning to count mail ballots until 7 a.m. on Election Day, which could delay the final tally for several days.",
    "Neither the Oz nor McCormick campaigns have conceded, and each candidate has expressed confidence in their victory once the remaining ballots are tallied.",
    "The results may be delayed even further by another law that mandates an automatic recount if the margin between Oz and McCormick is less than 0.5%.",
    "The Pennsylvania Republican primary for U.S. Senate remains too close to call as votes are still being counted Wednesday afternoon.",
    "According to the New York Times, Oz has earned 31.3% of the vote with 413,784 ballots, and McCormick has 31.1% with 411,833 votes.",
    "In the state's gubernatorial contest, Democratic Attorney General Josh Shapiro will face Republican State Sen. Doug Mastriano.",
    "The Keystone State is one of only a handful of states with vote by mail that does not allow pre-canvassing of mail ballots.",
    "He accused the McCormick campaign of using mail-in votes to cheat but did not provide any evidence supporting his claim.",
    "It makes it much harder for them to cheat with the ballots that they just happened to find,? Trump said.",
    "Thousands of votes remain to be counted before the race will be called.",
    "On the Democratic side, Pennsylvania Lt. Gov.",
    "Oz should declare victory.",
    "Dr."
  ]
}