{
  "id": 6725,
  "mediaId": 558,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
  "image": "https://s.yimg.com/ny/api/res/1.2/Ar07CH0RJiOlXNLUPcf0Eg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ3MztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/hmWJJtku9VPf1oRp5W3z2w--~B/aD0zNjQ1O3c9NTQzNDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/d08ef15f142200c13c109f97018619ff",
  "link": "https://news.yahoo.com/takeaways-election-denier-wins-bad-035611859.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    1147,
    1404,
    1801,
    2226,
    3102,
    571,
    2738,
    2834,
    2845,
    2862
  ],
  "sentences": [
    "Takeaways from Tuesday's primaries in Pennsylvania, North Carolina, Kentucky, Idaho and Oregon:\nTRUMP WINS SOME, LOSES SOME\nThe former president entered the primary season on a high after JD Vance, his endorsed candidate in Ohio's hypercompetitive GOP Senate contest, shot from third to first.",
    "And in the Pennsylvania governor's race, a Trump-backed candidate who has spread lies about the 2020 vote count won the GOP nomination, putting an election denier within striking distance of running a presidential battleground state in 2024.",
    "WASHINGTON (AP)  Former President Donald Trump's support was enough to elevate his Senate candidate to victory in North Carolina on Tuesday, while his pick in Pennsylvania remained in a tough fight in that state's Senate primary.",
    "And in Pennsylvanias GOP race for governor, Trump's endorsed candidate, the far-right Doug Mastriano, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "Trump had shocked party faithful in North Carolina when he endorsed U.S. Rep. Ted Budd, a little-known congressman, last June for the Senate seat being vacated by retiring Republican Richard Burr.",
    "His nod was widely seen as an effort to hedge his bets and guarantee a victory in the state in case his endorsed candidate for Senate, celebrity heart surgeon Mehmet Oz, loses his race.",
    "The young congressman, who uses a wheelchair after a car accident, became a media sensation when he first won a House seat at age 25, but he may have gotten singed under the spotlight.",
    "But after a rocky start, Budd easily captured his partys nomination, passing a crowded field of GOP rivals that included the state's former governor, Pat McCrory.",
    "Rep. Cawthorn, the youngest member of Congress, was on Tuesday by state Sen. Chuck Edwards after a rocky first term filled with salacious headlines and scandals.",
    "But in Idaho, with incumbency on his side, the sitting governor weathered a primary challenge from his far-right lieutenant governor.",
    "Oz and former hedge fund CEO David McCormick were virtually tied early Wednesday, with more votes left to be counted.",
    "In a key congressional race, a Republican congressman's bad behavior finally caught up with him.",
    "But Trump's tally Tuesday night included wins, losses and a marquee race too close to call.",
    "Follow AP for full coverage of the midterms at and on Twitter at ."
  ]
}