{
  "id": 6744,
  "mediaId": 65,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Trump's GOP clout on the line in high profile Republican primaries in Pennsylvania, North Carolina, Idaho",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/0e0c3679-78ed-49d2-aec7-f594ce2614ec/726b85ff-4ee8-4036-b63d-982030d2b4bf/1280x720/match/931/524/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/trumps-gop-clout-on-the-line-in-high-profile-republican-primaries-in-pennsylvania-north-carolina-idaho",
  "sentiment": "0.755",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1078,
    1147,
    1747,
    2087,
    3102,
    428,
    571,
    3550,
    2834,
    2862
  ],
  "sentences": [
    "WHAT THE FINAL FOX NEWS POLL IN PENNSYLVANIA'S GOP SENATE BATTLE SHOWS\nSince her surge in the polls, Barnette has faced constant incoming fire from her rivals and other Republicans concerned over her lack of vetting and past controversial comments and worries that shes too extreme to win a statewide general election in a purple state like Pennsylvania.",
    "Oz, who until the launch of his Senate campaign late last year was host of TVs popular \"Dr. Oz Show,\" has been one of the two polling front-runners for a couple of months in the GOP showdown to succeed retiring Republican Sen. Pat Toomey, in a race that may decide whether the GOP wins back the Senate majority in Novembers midterm elections.",
    "LAST MINUTE SHOCKER: BARNETTE SOARS IN FINAL PENNSYLVANIA SENATE PRIMARY POLLS\nOz has been one of the two combatants in a slugfest with co-front-runner Dave McCormick, a former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official in former President George W. Bush's administration.",
    "The field of major candidates also includes two other wealthy contenders - Jeff Bartos, a real estate developer, philanthropist and 2018 Republican nominee for lieutenant governor, and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark during the Trump administration.",
    "THREE-WAY OZ, BARNETTE, MCCORMICK CLASH FOR GOP SENATE NOMINATION IN PENNSYLVANIA\nAnd Trump called into the cardiac surgeon, author and well-known celebrity physicians final campaign event and accompanying tele-rally ahead of the primary, stressing that Oz is \"never, ever going to let you down.",
    "The Oz and McCormick campaigns and outside super PACs backing the two contenders since the beginning of the year have spent tens of millions of dollars to run TV, digital and radio ads attacking each other over their conservative credentials and over key issues since the beginning of the year.",
    "The Club for Growth, the pro-business and anti-tax group that is a major spender in Republican primaries, recently endorsed Barnette and last week announced that it has dished out $2 million to run an ad statewide in Pennsylvania that highlights the candidates biography.",
    "The former president, 16 months removed from the White House, remains the most popular and influential politician in the Republican Party, as he endorses scores of candidates up and down the ballot and repeatedly flirts with making another presidential run in 2024.",
    "Mastriano aimed to try and help overturn Trump's 2020 loss to now-President Biden, and was outside the U.S. Capitol when it was stormed on Jan. 6, 2021, by right-wing extremists aiming to disrupt congressional certification of Biden's Electoral College victory.",
    "And both Mastriano and Barnette, whove campaigned together, continue to support Trump's unproven claims that the 2020 election was \"stolen\" due to \"massive voter fraud\" and agree with the former president's efforts to repeatedly re-litigate his election loss.",
    "But the same night, Charles Herbster - the candidate Trump endorsed and held a rally on his behalf in Nebraskas GOP gubernatorial primary  lost, becoming the first of the candidates backed by the former president this year to go down to defeat.",
    "Trump scored a big victory two weeks ago in Ohios jam-packed and combustible Republican Senate primary, when the candidate he endorsed  former hedge fund executive and best-selling author JD Vance  edged the rest of the field.",
    "Through the end of last week, $63 million had been spent by the candidates and outside groups such as super PACs in Pennsylvania's Republican primary, according to data from AdImpact, a nationally known ad tracking firm.",
    "Fetterman emphasized that hes \"well on my way to a full recovery\" and added that his \"campaign isnt slowing down one bit, and we are still on track to win this primary on Tuesday, and flip this Senate seat in November.\"",
    "Trump held a rally in North Carolina for Budd in early April, and in recent weeks the congressman surged to front-runner status in the increasingly contentious primary showdown that also includes former Gov.",
    "And pointing to her 2020 congressional loss, Oz emphasized that \"this is a candidate who lost by 20 points when she ran for Congress 18 months ago, so shes not going to do well in the general election.\"",
    "BLUE BELL, PA  Former President Donald Trump, put in a last-minute pitch in for Mehmet Oz, the Senate candidate he endorsed in Pennsylvanias crowded, combative, and extremely expensive GOP Senate race.",
    "\"This is Donald Trump urging you to vote for Dr. Oz on Tuesday,\" the former president said in an automated call on behalf of Oz on the eve of Tuesday's primary in the key battleground state.",
    "Trump has his best shot of victory in a heavily contested GOP primary on May 17 in North Carolina, where last summer he endorsed Rep. Ted Budd in the states open GOP-held Senate seat race.",
    "Oz has repeatedly taken aim at Barnette over the past week, saying on Fox News \"Special Report\" on Thursday that \"shes raised questions in her own candidacy that shes refused to answer.\"",
    "The Democratic Senate primary, a much less crowded and combustible showdown than the GOP race, grabbed plenty of attention over the weekend when the overwhelming front-runner  Lt. Gov.",
    "While Trump did little to help McGeachin, he traveled to the Keystone State to headline a rally with Oz, held two tele-rallies in the final stretch, and recorded the robo-calls.",
    "Trump isn't on the ballot, but the strength of his grip over the GOP is being tested in Pennsylvania and a handful of other states holding primaries on Tuesday.",
    "And a week later, Trump-backed Rep. Alex Mooney of West Virginia topped fellow Republican Rep. David McKinley in a primary battle between two incumbents.",
    "And in recent weeks veteran and conservative commentator Kathy Barnettes soared in the surveys, making the Republican primary a three-way face-off.",
    "And that is noticed in Trump world,\" an adviser to the former president, who asked to remain anonymous to speak more freely, told Fox News.",
    "For months, Budd was unable to leverage the former presidents endorsement to boost his poll numbers and fundraising figures.",
    "Without the resources available to Oz and McCormick, Barnette by comparison has spent a miniscule amount to run commercials.",
    "McCormick, in an interview Monday morning with Fox News Digital, emphasized, \"I believe I can win the general [election].",
    "WATCH: TED BUDD MAKES HIS CLOSING CASE TO VOTERS IN FOX NEWS INTERVIEW\nBut In Idaho, Trump is backing far-right Lt. Gov.",
    "Pennsylvania is one of five states to hold primaries on Tuesday, joining North Carolina, Kentucky, Idaho, and Oregon.",
    "And Barnette also recently landed the endorsement of the Susan B. Anthony List, a leading pro-life outside group.",
    "And most of that spending has come from the Oz and McCormick campaigns, and the super PACs backing them.",
    "SBA List told Fox News on Friday it was spending six-figures to run digital ads in support of Barnette.",
    "Trump made a late game endorsement on Saturday of state Sen. Doug Mastriano, the polling front-runner.",
    "Janice McGeachin, who is one of seven primary challengers running against incumbent Republican Gov.",
    "But Barnettes bare-bones campaign received some last-minute help from a group with deep pockets.",
    "Trumps sway with Republicans is also on the line in Pennsylvanias GOP gubernatorial primary.",
    "John Fetterman  announced on Sunday that he was hospitalized after suffering a stroke.",
    "Now, the possibility of Oz losing on the same night has some in Trump world nervous.",
    "For Trump, the Republican Senate primary is another test of his clout with the GOP.",
    "\"This race in Pennsylvania is much closer than Trump ever thought it would be.",
    "I think she [Barnette] would have a much tougher time winning the general.\"",
    "He's a strong guy, smart gentlemanhe's going to be a great senator.\"",
    "And Tuesday is going to be a major blow if Oz isn't the nominee.",
    "Brad Little, whom polling suggests is the clear front-runner.",
    "Pat McCrory, and former Rep. Mark Walker."
  ]
}