{
  "id": 6807,
  "mediaId": 195,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "The Memo: Barnette roils Pennsylvania Senate race",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/barnettekathy_051122ap-matt-rourke_memo.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/the-memo/3488084-the-memo-barnette-roils-pennsylvania-senate-race/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage/",
  "termIds": [
    1765,
    2491,
    3102,
    3710,
    5315,
    5332,
    428,
    571,
    5207,
    2537,
    2862
  ],
  "sentences": [
    "We had that experience in 2010 and 2012.?\nMcConnell was referring to past election cycles in which Republicans lost winnable Senate elections with nominees including Delawares Christine ODonnell, who had to emphasize in one campaign ad I am not a witch,? and Missouris Todd Akin, who mused that women would usually not become pregnant in instances of legitimate rape.?\nIn the past, Republicans have left too many Senate seats on the table,? said Doug Heye, a former communications director of the Republican National Committee.",
    "For Dr. Oz and McCormick, any rational observer would agree they are outside their comfort level and pandering to the far-right,? said former Rep. Jason Altmire (D-Pa.), who served three terms as a moderate congressman and later wrote a book lamenting the erosion of the political middle ground.",
    "She has risen because she has picked up the Mastriano base of very loyal Trump supporters.?\nSome Republicans fear that a win for Barnette could give Democrats a fighting chance of gaining a Senate seat, which could be vital given the current 50-50 make-up of the upper chamber.",
    "A Thursday report from CNNs K-File? team unearthed old comments from Barnette in which she described gay men as not normal,? suggested same-sex marriage would ultimately lead to widespread acceptance of pedophilia, and falsely asserted that former President Obama is a Muslim.",
    "Her polling climb concerns moderate Republicans who fear she is unelectable in a general election; prominent backers of former President Trump who think she might thwart Oz; and centrists who fret she is another emblem of the nations accelerating polarization.",
    "A Trump statement asserted that she will never be able to win the General Election against the Radical Left Democrats.?\nBut Barnette has risen fast by stoking some of the same passions as Trump around inflammatory social issues.",
    "Expressing concern about her tweets, he added, I just dont know how much is there because its so new.?\nHe also noted that there were other concerning races for the GOP, including the Missouri Senate primary in which former Gov.",
    "It is completely in her wheelhouse.?\nMadonna, the academic expert, added that Barnette has benefitted from a close, if informal, alliance with gubernatorial candidate Doug Mastriano, who is cut from similar cloth.",
    "The only two camps that are happy are Barnette and her backers, now including the well-financed Club for Growth; and Democrats, who think she might be the most beatable of the three leading Republican candidates.",
    "Barnette, a conservative commentator, is gaining fast on two candidates who have vastly outspent her: TV personality Mehmet Oz, who is backed by former President Trump, and businessman David McCormick.",
    "Its nip and tuck right now,? said Terry Madonna, a senior fellow in residence for political affairs at Millersville University, and a longtime expert on polling and Pennsylvania politics.",
    "Hard-right candidate Kathy Barnette has come from nowhere to make the Republican Senate primary in Pennsylvania one of the tightest and most interesting races in the country.",
    "In an interview with NBC News, reporter Dasha Burns confronted Barnette with an old tweet in which the candidate said pedophilia was a cornerstone? of Islam.",
    "In her case, that rhetoric is allied with a personal story of growing up in poverty in Alabama and empathy with voters who are feeling financially pinched.",
    "Mastriano, a state senator, pushes false claims of fraud in the 2020 election and was present near the U.S. Capitol on the day of the Jan. 6 insurrection.",
    "John Fetterman, a progressive Democrat and Pennsylvanias current lieutenant governor, is the strong favorite to win his partys primary.",
    "By contrast, Pennsylvania GOP voters will deliver their verdict on Tuesday  and the political world will take note of what they say.",
    "Barnette looks to be exactly the kind of candidate Senate Minority Leader Mitch McConnell (R-Ky.) was warning about last month.",
    "Its a real three-way race.?\nBarnettes rise has set alarm bells ringing across a swath of the political spectrum, however.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "You cant nominate somebody who is just sort of unacceptable to a broader group of people and win,? McConnell said.",
    "Heye added that Barnette had come up so fast? that she had apparently evaded vetting until the last moment.",
    "Barnette was in fifth place and in single digits in the RealClearPolitics poling average just last month.",
    "Greitens is the only one who could lose.?\nThere are months to go before the Missouri primary, however.",
    "Shes now polling around 20 percent in the multicandidate race, on a near-par with Oz and McCormick.",
    "More generally, the candidate complained that its very unfair to take a snippet? of old comments.",
    "That has opened the door for this third candidate, Kathy Barnette  and she is a true believer.",
    "Greitens has been accused of abuse by his ex-wife and of sexual misconduct by a former lover.",
    "McCormick, for example, noted that she had lost a House election in 2020 by almost 20 points.",
    "Barnette is getting pushback from her GOP opponents in the final days before the primary.",
    "Its not necessarily that Greitens is unelectable, but he certainly could be,? said Heye.",
    "Even observers who share none of her politics see why she has climbed in the polls.",
    "Oz, McCormick and Barnette are seeking to replace retiring Sen. Pat Toomey (R).",
    "They even have their campaign signs attached side-by-side,? said Madonna.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "A Barnette victory in Tuesdays primary is very plausible.",
    "I would never have said that,? Barnette replied.",
    "The Memo is a reported column by Niall Stanage.",
    "She is in no way outside her comfort level.",
    "Eric Greitens has a polling lead.",
    "He denies those allegations.",
    "I dont think thats me."
  ]
}