{
  "id": 6809,
  "mediaId": 409,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Throwing Away Pennsylvania",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/05/Oz-and-Trump.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/05/throwing-away-pennsylvania/",
  "sentiment": "0.941",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editors",
  "authorUrl": "https://www.nationalreview.com/author/the-editors/",
  "termIds": [
    943,
    1147,
    1606,
    3102,
    5277,
    146,
    428,
    489,
    571,
    2862
  ],
  "sentences": [
    "Top Stories\nKathy Barnette, a little-known right-wing commentator running what had been a long-shot Senate campaign, has surged near the top of the multi-candidate field, pulling basically even with Mehmet Oz, the TV doctor endorsed by Trump.",
    "Thats a valid concern, but the Republican Senate primary in Pennsylvania is a showcase for a different dynamic  a flawed Trump-endorsed candidate potentially getting surpassed by a perhaps even more flawed non-endorsed MAGA Republican.",
    "Either of the two Republicans currently running behind Mastriano, former representative Lou Barletta or former U.S. attorney Bill McSwain, would be better candidates, but they have to be rated long shots at this point.",
    "Shes made statements over the years that will readily be used against her in a general-election campaign, and shes been cagey about aspects of her past, including when she first moved to and voted in Pennsylvania.",
    "He happened to win the contest for Trumps endorsement, largely because of his celebrity, but his record of liberal statements on issues like abortion and guns has provided fodder for his Republican opponents.",
    "But shed be an enormous risk as the GOPs Pennsylvania Senate candidate, reminiscent of the partys picks who lost winnable Senate races in the Tea Party era, such as Christine ODonnell and Sharron Angle.",
    "Its going to be a Republican year in the midterms, the kind of year that often sweeps in unlikely and unworthy candidates  and the Pennsylvania Republican Party is acting like its banking on it.",
    "The other major GOP candidate, Dave McCormick, is a former hedge-fund executive and an establishment Republican from central casting, although hes been running as an America First? candidate.",
    "Besides having demonstrated his unsuitability for major office, hes the candidate Democrats hope to run against in November, and theyve made their preference known by subtly promoting him.",
    "Hed probably be a more reliable conservative vote in the Senate than Oz, but has run a lackluster campaign and isnt a natural fit for working-class Pennsylvania.",
    "The conventional wisdom has been that Donald Trump might hurt Republican prospects in the midterms by endorsing and boosting flawed candidates.",
    "Endorsed by Trump on Saturday, Mastriano is a full-blown conspiracy theorist about the 2020 election and was outside the Capitol on January 6.",
    "The party shouldnt be putting itself in the position to find out more about all of this and fully vet Barnette after next Tuesdays primary.",
    "The more people can hear this moving story the better, and the pro-life movement would be well-served to put her on the speaking circuit.",
    "She has spoken powerfully about her mother being raped when she was eleven years old and delivering Barnette when she was just twelve.",
    "Dr. Oz is a shrewd man and talented communicator with a successful TV show under his belt to prove it, but hes not a conservative.",
    "More onPennsylvania\nIt is perhaps understandable that primary voters have been interested in Barnette, given the alternatives.",
    "Nominating train-wreck candidates at the state level could also be a drag on close House and state legislative races.",
    "More fromThe Editors\nIf the Senate race isnt tremendously encouraging, the gubernatorial race has been even worse.",
    "State senator Doug Mastriano has a solid lead in the latest polling.",
    "Barnette, an African American, has a compelling personal story."
  ]
}