{
  "id": 6830,
  "mediaId": 151,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump endorses Mastriano for Pennsylvania governor",
  "image": "https://www.politico.com/dims4/default/888247c/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F5c%2Fa1%2Ff6666ce04fd9aa043cce4eff6784%2Felection-2022-pennsylvania-governor-74377.jpg",
  "link": "https://www.politico.com/news/2022/05/14/trump-endorses-mastriano-pennsylvania-governor-00032538",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    943,
    1147,
    1148,
    1713,
    1997,
    3102,
    5294,
    393,
    2862
  ],
  "sentences": [
    "The prospect of Trumps endorsement of Mastriano, a leading voice in the movement to overturn the 2020 election results and who was present at the Capitol during the Jan. 6 insurrection, had alarmed local and national Republicans concerned about his ability to win a general election.",
    "| Matt Rourke/AP Photo\nBy Zach Montellaro, Meridith McGraw and Holly Otterbein\n 05/14/2022 09:57 AM EDT\nPennsylvania state Sen. Doug Mastriano on Saturday landed the coveted endorsement of former President Donald Trump with days to go before the gubernatorial primary.",
    "Its for the millions of hard-working Pennsylvanians who want their individual liberties restored, power returned to the people, and for their elected leaders to fulfill the America First  and Pennsylvania First  agenda,? Mastriano said in a statement.",
    "Mastriano  who also has ties to the QAnon conspiracy theory  was already leading in the polls in the fractured primary, despite being well outspent on TV by candidates like former U.S. Attorney Bill McSwain and businessman David White.",
    "Presumptive Democratic nominee for governor Josh Shapiro has been encouraging Mastrianos candidacy in ads, believing he is the easiest Republican to beat in a general election.",
    "Former President Donald Trump called Pennsylvania state Sen. Doug Mastriano on Friday to inform him of his decision to endorse, according to a person familiar with the call.",
    "Some now-former candidates polling in the single digits have dropped out and endorsed former Rep. Lou Barletta in recent days, including state Senate President Jake Corman.",
    "A point or two could be all the difference for a candidate coming down the stretch,? Brian Nutt, a Republican strategist in Pennsylvania, said earlier this month.",
    "People have been telling the president for a while, and hes not protecting his Oz investment? in the governors race, another Republican close to Trump said.",
    "There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,? Trump wrote in a statement.",
    "Trump had been skeptical of Mastriano, according to another person familiar, but was impressed by his lead in the polls and focus on the 2020 election.",
    "He will also Fight Violent Crime, Strengthen our Borders, Protect Life, Defend our under-siege Second Amendment, and Help our Military and our Vets.",
    "He is a fighter like few others, and has been with me right from the beginning, and now I have an obligation to be with him,? Trump continued.",
    "But the decision came following pushback from some of Trumps closest advisers and allies, among them Fox News host Sean Hannity.",
    "Top Republicans this week mounted a last-ditch effort to stop Mastriano from winning the party nomination in the May 17 primary.",
    "He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it.",
    "At the end of the day, a Trump endorsement could get you a few points and that might be all you need [in a crowded primary].",
    "But Mastriano has aligned himself with Kathy Barnette, another far right candidate who has similarly surged in the polls.",
    "But the split at the top of the field, combined with Mastrianos new endorsement from Trump, will likely doom that effort.",
    "Trump called Mastriano on Friday to inform him of his decision to endorse, according to a person familiar with the call.",
    "Barnette, Oz and hedge-funder Dave McCormick have been locked atop recent polls in the Senate primary, while Lt. Gov.",
    "Some Republicans close to the former president have argued that Trump backing Mastriano could backfire by hurting Oz.",
    "Shapiro just became the next governor and I dont mean that hyperbolically,? one top Pennsylvania GOP aide said.",
    "John Fetterman seems to be on a glide path to beating Rep. Conor Lamb and others in the Democratic primary.",
    "Trumps endorsement of Mastriano could also complicate the Senate primary in the state as well.",
    "Barnette and Mastriano often campaign together, and have endorsed each other.",
    "Im honored to receive the endorsement from President Trump, today.",
    "Trump has thrown his support behind Mehmet Oz, known as Dr.",
    "But those efforts have seemingly failed.",
    "Craig Howie contributed to this report.",
    "Oz,? in another crowded field.",
    "But the honor is not for me."
  ]
}