{
  "id": 6899,
  "mediaId": 151,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Pennsylvania Republicans to Trump: Notice me",
  "image": "https://www.politico.com/dims4/default/1b95118/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F1c%2F31%2Feaa6f59c489981ff4bcf1f8a05b2%2F220506-donald-trump-ap.jpg",
  "link": "https://www.politico.com/news/2022/05/06/pennsylvania-republican-rally-trump-00030802",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1282,
    1653,
    3019,
    3102,
    428,
    571,
    2682,
    2862
  ],
  "sentences": [
    "Prior to showing up at the rally, those aspiring to be Pennsylvanias next governor have traveled to Mar-a-Lago, hired Trumpworld consultants, and claimed the mantle of America First.?\nAt the end of the day, a Trump endorsement could get you a few points and that might be all you need [in a crowded primary].",
    "Recently, the current Pennsylvania Attorney General Josh Shapiro, who is running unopposed in the Democratic gubernatorial primary, launched an ad that appeared aimed at boosting Mastriano in the GOP primary  a sign that he sees him as the weakest potential Republican opponent.",
    "Former Rep. Lou Barletta, state Senate President Pro Tempore Jake Corman, and businessman David White are all expected to be in attendance despite none having been listed on the lineup of speakers in the pre-rally program, they and their camps confirmed.",
    "It becomes a distraction.?\nWhile Trump has not endorsed in the gubernatorial race, he has made clear he is no fan of Republican gubernatorial candidate Bill McSwain, who he has called a coward? for failing to act on his false claims of election fraud.",
    "But its also the latest in a series of steps each has taken to be endorsed by Trump  a process that has underscored just how instrumental his backing remains, and how much candidates are willing to endure in order to secure it.",
    "Some conservatives in the state said Trump should make a move sooner rather than later, as there are increasing concerns that if the frontrunner Mastriano wins, then the GOP will sacrifice a shot at the governors mansion.",
    "If they decide to do that, theyre going to put a whole media push behind it, but I certainly dont see it tonight.?\nA spokesperson for Trump said there was nothing to announce or share about a gubernatorial endorsement.",
    "In the most recent poll from Franklin and Marshall College, Mastriano leads among Republican voters with 20 percent support, followed by McSwain with 12 percent, Barletta with 11 percent, and White with 8 percent.",
    "A group of Republicans running in the Pennsylvania primary for governor are heading to the town of Greensburg on Friday with hopes that former President Donald Trump will give them the final rose.",
    "Doug Mastriano winning would make it more challenging for Republicans to pick up an open seat given the controversial nature of some of his comments,? said a Republican familiar with the race.",
    "But one person close to Trump said they do not expect that to happen as it would overshadow his boost for Oz, who is head-to-head in polls with former hedge fund CEO Dave McCormick.",
    "The former congressman recently held a fundraiser at Trumps club, at which, he said, Trump shared nice words about him with the crowd and brought his wife a hat.",
    "But so far, no clear favorite has emerged among other Republicans running for governor even though theyre all eager to show ties to the former president.",
    "| Kenneth Ferriera/Lincoln Journal Star via AP\nBy Holly Otterbein and Meridith McGraw\n 05/06/2022 05:21 PM EDT\nIts The Bachelor meets the campaign trail.",
    "It doesnt appear he did anything wrong, but in politics and in life, a picture is worth a thousand words and those images will be used against him.",
    "Mastriano is best known for his work on efforts to overturn the 2020 election and recently appeared at an event promoting Q-Anon conspiracies.",
    "A point or two could be all the difference for a candidate coming down the stretch,? said Brian Nutt, a Republican strategist in Pennsylvania.",
    "Tonights rally in western Pennsylvania is meant to drum up support for Trumps endorsed candidate for Senate, celebrity doctor Mehmet Oz.",
    "Its a chance for the gubernatorial candidates to meet conservative voters and celebrate the MAGA movement they have all embraced.",
    "There is speculation over whether or not Trump will make a surprise endorsement on stage in the Republican primary for governor.",
    "Trump has made endorsements in races across the country, and his pick of Oz has been controversial within Trumpworld.",
    "State Sen. Doug Mastriano was reportedly invited, but attempts to reach his team were unsuccessful.",
    "That was echoed by radio host John Fredericks, who said he does not expect any surprises tonight.",
    "Theres a belief that his attendance in Washington on Jan. 6 will derail his campaign,? said Nutt.",
    "We should be talking about gas prices, the cost of goods, and people who are out of work.",
    "But so far he has not weighed in on the crowded Republican primary field for governor.",
    "But hes certainly not going to do this on the fly, its too big,? Fredericks said.",
    "Still, a large percentage of Republican voters  34 percent  say theyre undecided.",
    "Former President Donald Trump speaks during a campaign rally in Greenwood, Neb.",
    "White, Barletta, and Corman have all been spotted recently at Mar-a-Lago.",
    "So I dont need to make my case to him,? Barletta said in an interview.",
    "Hes just not going to get up and endorse somebody cold.",
    "He wants to see that you have a chance to win.",
    "He wants to see you working hard.",
    "Look, it could happen next week.",
    "Some candidates bother him.",
    "I know what he expects.",
    "He knows me.",
    "I know him."
  ]
}