{
  "id": 6949,
  "mediaId": 237,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Pennsylvania GOP gubernatorial candidates vie to show strongest fealty to Trump",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/1fd21ac/2147483647/strip/true/crop/2520x1323+235+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fb1%2F2f%2F479f28f1469f8102a82a3657fcd3%2Fap22091699697700.jpg",
  "link": "https://www.washingtonexaminer.com/news/pennsylvania-gop-gubernatorial-candidates-vie-to-show-strongest-fealty-to-trump",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    1147,
    1282,
    1625,
    1997,
    3102,
    428,
    2992,
    5479
  ],
  "sentences": [
    "Shapiro is seen as an up-and-coming Democratic politician, whom conservative commentator Hugh Hewitt recently described as a formidable challenger to Republicans given his center-left rather than progressive record.",
    "\"Do not vote for Bill McSwain, a coward, who let our country down,\" Trump said in a statement blasting his former appointee for U.S. attorney for failing to back his unfounded claims of a stolen election.",
    "Barletta, a former mayor of Hazleton and a House member from 2003-11, ran an unsuccessful campaign in 2018 as the Republican nominee for Senate in a race in which he was endorsed by Trump.",
    "Other candidates in the race include former Rep. Melissa Hart, conservative activist Charlie Gerow, Montgomery County Commissioner Joseph Gale, Dr. Nche Zama, and businessman Dave White.",
    "Many of the nine Republicans in the race are still vying for the endorsement of former President Donald Trump as a means to set themselves apart from their competition.",
    "A recent poll from Franklin and Marshall College showed Mastriano leading the Republican field, closely followed by McSwain and former Rep. Lou Barletta.",
    "Other Republican candidates in the race include state Sen. Doug Mastriano, a combat veteran who has sought to campaign as a supporter of Trump.",
    "The winner of the primary will likely face Democratic Attorney General Josh Shapiro, who is running unopposed in his partys May 17 primary.",
    "Pennsylvania Senate President Pro Tempore Jake Corman recently moved to exit the race but reportedly stayed in with Trumps encouragement.",
    "Wolf, the Democratic incumbent, is term-limited and thus unable under state law to seek a third consecutive term.",
    "WHTM noted Mastriano has faced questions about sponsoring buses to the Capitol on Jan. 6, 2021.",
    "The race to replace him has been ranked a toss-up by the Cook Political Report.",
    "A crowded Republican primary field has emerged in the race to succeed Gov.",
    "But Trump has only indicated whom he will not endorse: William McSwain.",
    "McSwain had been campaigning on his ties to Trump.",
    "Tom Wolf, who will leave office next year.",
    "But 40% of voters remained undecided."
  ]
}