{
  "id": 6966,
  "mediaId": 558,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "State Senate leader Jake Corman to stay in PA governors race, citing Trumps encouragement",
  "image": "https://s.yimg.com/ny/api/res/1.2/mJCiRxOCw2M152GeT6h0Yg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYzMTtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/NizQVkv9i3lLcX9OO70V7Q--~B/aD03NDk7dz0xMTQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/state_college_centre_daily_times_mcclatchy_articles_878/6723b14d53461efc1fef7c9b7131e9ad",
  "link": "https://ca.news.yahoo.com/reports-state-sen-jake-corman-181026467.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Halie Kines",
  "authorUrl": "",
  "termIds": [
    1147,
    1997,
    3019,
    3102,
    571,
    5186,
    2862
  ],
  "sentences": [
    "Just before 5 p.m., he released a statement noting that two developments Tuesday led him to decide to continue his campaign: President Trumps statement on the race and my conversation directly with the president.",
    "After filing paperwork to drop out of the race for Pennsylvania governor, Senate President Pro Tempore Jake Corman, R-Benner Township, announced late Tuesday afternoon that hell stay in the race.",
    "Trump on Tuesday called Republican governor candidate former U.S. attorney Bill McSwain a coward? who did absolutely nothing? to investigate claims of fraud in the 2020 election.",
    "He said in December that he would not seek reelection to the 34th District, a seat hes held for more than 20 years, to instead focus on his campaign for governor.",
    "Corman filed a petition Tuesday afternoon in Commonwealth Court to get his name removed from the ballot for the May 17 primary election.",
    "(Trump) encouraged me to keep fighting, and thats what Im going to do  keep fighting for the people of Pennsylvania,? he wrote.",
    "His campaign declined to comment on what Trump told Corman that encouraged him to stay in the race.",
    "Rep. Lou Barletta, state Sen. Doug Mastriano and former Delaware County Councilman Dave White.",
    "Attorney General Josh Shapiro is the only Democrat running for governor.",
    "A notice of discontinuance was filed in Commonwealth Court.",
    "The Republican ticket for governor also includesU.S.",
    "Corman announced his governor campaign in November."
  ]
}