{
  "id": 6967,
  "mediaId": 239,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Trump slams GOP candidate in Pa. governors race for not going after 2020 election fraud",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/12/election_2022_pennsylvania_governor_93803_c0-251-6000-3749_s885x516.jpg?bfee798b140155ee7106e1a89845758c6071a6da",
  "link": "https://www.washingtontimes.com/news/2022/apr/12/trump-slams-gop-candidate-pa-governors-race-not-go/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boyer",
  "authorUrl": "https://www.washingtontimes.com/staff/dave-boyer/",
  "termIds": [
    1147,
    1282,
    1997,
    2087,
    3102,
    146,
    428
  ],
  "sentences": [
    "Former President Donald Trump blasted Pennsylvania GOP gubernatorial candidate Bill McSwain on Tuesday, saying the former federal prosecutor did absolutely nothing? to investigate Mr. Trumps claims of election fraud in 2020.\nDo not vote for Bill McSwain, a coward, who let our country down,? Mr. Trump said in a statement.",
    "The blow to Mr. McSwains campaign, coupled with the expected decision by state Senate President Pro Tempore Jake Corman to quit the race, leaves former U.S. Rep. Lou Barletta and state Sen. Doug Mastriano as the two most prominent GOP candidates for governor.",
    "Last summer, Mr. McSwain sent a letter to Mr. Trump saying that Mr. Barr had ordered him not to pursue voter fraud allegations, and as a Marine infantry officer, I was trained  to respect the orders of my superiors.?",
    "Mr. Trump said Mr. McSwain, on the other hand, did absolutely nothing on the massive Election Fraud that took place in Philadelphia and throughout the commonwealth.?\nThe McSwain campaign did not immediately comment.",
    "He knew what was happening and let it go.?\nMr. McSwain served three years as the top federal prosecutor in Philadelphia under Mr. Trump and had been seeking the former presidents endorsement.",
    "He has said former Attorney General Bill Barr ordered him not to pursue any election-fraud investigation in Pennsylvania, which was captured by President Biden.",
    "Mr. Mastriano was actively involved in pushing Mr. Trumps claims of a stolen election in 2020.",
    "State Attorney General Josh Shapiro is the leading Democratic candidate for governor.",
    "Mr. Barletta, former mayor of Hazleton, is a longtime Trump ally.",
    "The primary is on May 17."
  ]
}