{
  "id": 7043,
  "mediaId": 25,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Pennsylvania court strikes down no-excuse mail voting law",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/01/28/447d8b02-9963-496b-a6be-34af3b78c57e/thumbnail/620x413/7c6d59a2c2285207565df523b8a8c289/ap22028585353062.jpg",
  "link": "https://www.cbsnews.com/news/mail-in-voting-ballots-struck-down-pennsylvania/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster",
  "authorUrl": "",
  "termIds": [
    3102,
    5334,
    393,
    5186,
    5220,
    5233,
    5244,
    2862
  ],
  "sentences": [
    "America's Right To Vote\n More\n Arizona Senators who cheered 2020 election review advance voting-related legislation\n Senate Democrats charge forward with debate on voting rights bills\n Remembering MLK Jr.'s fight for voting rights\n Douglas Brinkley on voting rights and the \"new Jim Crow\"\n Biden makes push for voting bills and says there is \"no option\" but to kill the filibuster\n More\n Adam Brewster\nCBS News political reporter.",
    "In this November 4, 2020, file photo, Chester County election workers process mail-in and absentee ballots for the 2020 general election in the United States at West Chester University in West Chester, Pennsylvania.",
    "In addition to establishing no-excuse mail voting, the law also created a permanent mail voting list, gave Pennsylvanians an extra 15 days to register to vote and extended the deadline for returning mail ballots.",
    "Matt Slocum / AP\n\"No-excuse mail-in voting makes the exercise of the franchise more convenient and has been used four times in the history of Pennsylvania,\" wrote Judge Mary Hannah Leavitt, a Republican.",
    "But a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can 'be placed upon our statute books.'\"",
    "Republican State Senator Doug Mastriano, who voted for Act 77 in 2019, introduced a bill in November 2021 to repeal certain provisions of the law, including eliminating no-excuse mail voting.",
    "Some conservatives in the state turned against the law after President Joe Biden won Pennsylvania, claiming the expanded access to mail ballots cost former President Donald Trump the state.",
    "In its decision, the court noted that the law has expanded access to the ballot, but the majority said that any changes to mail voting laws would require a constitutional amendment.",
    "In a statement, the Pennsylvania Department of State said it \"disagrees with today's ruling and is working to file an immediate appeal to the Pennsylvania Supreme Court.\"",
    "\"I do not believe that mail in voting is unconstitutional, and there were not constitutional concerns brought up when the bill passed nearly unanimously in '19.\"",
    "A Pennsylvania court on Friday struck down Act 77, the law that established no-excuse mail voting in Pennsylvania, saying it violated the state Constitution.",
    "The Pennsylvania Commonwealth Court said the state's constitution requires votes to be cast in-person unless voters meet certain requirements.",
    "Republicans have blasted previous court decisions about the law and criticized the Pennsylvania executive branch's implementation of the law.",
    "Pennsylvania Senate minority leader Jay Costa, a Democrat, said he is hopeful that the Pennsylvania Supreme Court will reverse the decision.",
    "Fourteen Republicans in the Pennsylvania House of Representatives sued last year, arguing that the law was unconstitutional.",
    "In 2020, the first general election in which the law was in effect, 2.6 million Pennsylvanians voted by mail.",
    "The court's three Republicans ruled that the law was unconstitutional, while the two Democrats dissented.",
    "\"Act 77 was a bipartisan, bicameral achievement that protected & improved access to the ballot box.",
    "\"Approximately 1.38 million voters have expressed their interest in voting by mail permanently.",
    "The ruling will likely be appealed to the Pennsylvania Supreme Court, which leans Democratic.",
    "Act 77 was passed in 2019 with bipartisan support, including leading Republicans.",
    "If presented to the people, a constitutional amendmentis likely to be adopted.",
    "Eleven of those GOP lawmakers voted for Act 77 in 2019.",
    "Mastriano is also running for governor in Pennsylvania.",
    "It must be protected,\" Costa tweeted.",
    "Twitter"
  ]
}