{
  "id": 7207,
  "mediaId": 157,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "GOP governors hatched a plan to undercut Trump's interference in elections: report",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29837180&width=1200&coordinates=0%2C7%2C0%2C85&height=600",
  "link": "https://www.rawstory.com/donald-trump-gop-war/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1434,
    2095,
    2303,
    3102,
    5520,
    146,
    425,
    428,
    2672
  ],
  "sentences": [
    "The report states \"...the Republican Governors Association decided to spend millions of dollars in primaries, an unusual step for an organization that typically reserves its cash for general election matchups against Democrats,\" before adding that the primary election to be held on Tuesday in Georgia involving Trump nemesis Gov.",
    "While there is not a preponderance of evidence that Republican governors are making efforts to stop their colleagues in the legislatures from tampering with election returns, the Washington Post is reporting they did meet in November to hatch a plan to keep Donald Trump from coming after their own jobs with primary challengers.",
    "But it was made necessary because Donald Trump decided on the vendetta tour this year and so we need to make sure we protect these folks who are the objects of his vengeance.\n\"The clash has brought into focus an extraordinary battle over the future direction of the GOP that extends well beyond Georgia.",
    "With the former president currently enduring a mixed bag of his endorsees both winning (Pennsylvania's Doug Mastriano) and losing (Rep. Madison Cawthorn (R-NC) their primary bids, the report states GOP governors met back in November to make plans to protect their own.",
    "According to the WaPo's Annie Linskey, Josh Dawsey, Michael Scherer and Matthew Brown, the meeting involved agreeing to set aside funds to push back at what was termed Trump's \"vendetta tour\" stemming from his anger over his loss of the 2020 presidential election.",
    "And former vice president Mike Pence, who once served as governor of Indiana, will appear with Kemp on Monday  setting the stage for Pence's most direct confrontation yet against Trump in the midterms,\" the WaPo is reporting.",
    "RGA Co-Chairman Doug Ducey, now serving as Arizona's governor, was blunt about the group's plans to put Trump's obsession with his 2020 loss in the past, explaining, \"The focus is on 2022.",
    "On the other, conservative governors who align with Trump on many issues but have grown tired of his election claims, which post-election audits have shown to be false,\" the report adds.",
    "\"The RGA invested some $5 million in Georgia, according to a person familiar with the group's outlays, who like others spoke on the condition of anonymity to describe sensitive details.",
    "Chris Christie (R), who serves as co-chair of the RGA 2022 fundraising arm, added, \"This is just not the best use of our money.",
    "On one side is an aggrieved former president who retains widespread loyalty in the party from voters.",
    "I don't believe we should spend one more moment talking about 2020.\nFormer New Jersey Gov.",
    "A parade of Republican governors and luminaries have lined up to protect Kemp.",
    "We would much rather use it just in races against Democrats.",
    "Brian Kemp was central to their efforts."
  ]
}