{
  "id": 8670,
  "mediaId": 157,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Michigan 'quality guru' Perry Johnson remains off August primary ballot after unanimous court ruling",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29916467&width=1200&coordinates=0%2C0%2C0%2C341&height=600",
  "link": "https://www.rawstory.com/perry-johnson/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon King",
  "authorUrl": "https://www.rawstory.com/u/jonking-michiganadvance",
  "termIds": [
    651,
    1682,
    1844,
    2002,
    2171,
    2298,
    3075,
    3095,
    3099,
    5546,
    307,
    311,
    428,
    6118,
    6293
  ],
  "sentences": [
    "Johnson had sought the decision after the Board of State Canvassers deadlocked last week along party lines on a recommendation by state election officials that he, along with former Detroit Police Chief James Craig, Michigan State Police Capt.",
    "Currently, there are five Republican candidates for governor on the August ballot: businessman Kevin Rinke, right-wing media personality Tudor Dixon, chiropractor Garrett Soldano, far-right activist Ryan Kelley and the Rev.",
    "While there is no evidence the candidates were aware that signatures were being obtained fraudulently, there also appears to be no dispute that they did not meet legal requirements.",
    "But in a 3-0 opinion, the court ruled that the bureau did not have a clear legal duty to conduct a comparison of each fraudulent signature against the qualified voter file.",
    "Michael Brown, financial adviser Michael Markey and businesswoman Donna Brandenburg, had failed to meet the 15,000-signature threshold because of fraudulent signatures.",
    "One of the five Republican gubernatorial candidates who were tossed off the August primary ballot last week has lost a key court decision to rescind that decision.",
    "While the decision was based on Johnson's appeal, it could also apply to the other disqualified candidates, although separate legal challenges remain pending.",
    "Attorney Mark Brewer, a former Michigan Democratic Party chair, previously told the Michigan Advance that he was dubious any legal challenges would succeed.",
    "Michigan Advance is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Johnson, a self-described quality guru, asked the appeals court to order the Michigan Bureau of Elections to examine each petition line by line.",
    "The Michigan Court of Appeals unanimously denied a request from businessman Perry Johnson to provide him a path back onto the ballot.",
    "These candidates have massive amounts of forged signatures, and they are not qualified for the ballot, Brewer said.",
    "Contact Editor Susan Demas for questions: info@michiganadvance.com.",
    "Johnson could appeal to the Michigan Supreme Court.",
    "Michigan Advance maintains editorial independence.",
    "The winner will square off against Democratic Gov.",
    "Follow Michigan Advance on Facebook and Twitter.",
    "Brown has since dropped out of the race.",
    "Gretchen Whitmer on Nov. 8.",
    "Ralph Rebandt."
  ]
}