{
  "id": 1033,
  "mediaId": 8449,
  "date": "2022-02-15",
  "headline": "Cuatro estados emergen como prioridad para los demócratas",
  "image": "https://media.telemundo62.com/2021/07/AP_21135455337140.jpeg?quality=85&strip=all&crop=0px%2C0px%2C5568px%2C3132px&resize=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/cuatro-estados-emergen-como-prioridad-para-los-democratas/2193682/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "En Wisconsin, Evers tiene planes para el superávit presupuestario más grande del estado, $ 3 mil millones, incluidos créditos fiscales para el cuidado de niños para familias trabajadoras y créditos similares para cuidadores voluntarios de tiempo completo para ancianos y confinados en el hogar, movimientos que él ve como un uso inteligente del dinero extra en un tiempo de necesidad.",
    "Jugar un papel en las elecciones presidenciales\nDecisión Local\nEn Wisconsin, por ejemplo, la Legislatura está acelerando una serie de proyectos de ley que cambian la administración electoral y las reglas de votación, todos los cuales se espera que Evers vete, pero que otros candidatos republicanos a gobernador apoyan.",
    "Esos demócratas tienen algunas ventajas que podrían ayudarlos políticamente este año, incluidos sólidos superávits presupuestarios, ingresos estatales que superaron los terribles pronósticos de pandemia de coronavirus y miles de millones en ayuda federal por COVID-19 y dinero entrante para infraestructura.",
    "“La incapacidad de trabajar de manera efectiva con su legislatura, independientemente del control del partido, en última instancia será vista por los votantes como una falla de liderazgo”, dijo Phil Cox, estratega republicano y ex director ejecutivo de la Asociación de Gobernadores Republicanos.",
    "Bloqueo de restricciones de votación\nUna medida habría agregado requisitos de identificación adicionales para las solicitudes de boletas en ausencia y habría impedido que el principal funcionario electoral del estado enviara ampliamente solicitudes de voto por correo.",
    "En Wisconsin, la semana pasada, el representante estatal Timothy Ramthun, un teórico de la conspiración que fue disciplinado por el liderazgo republicano por afirmaciones electorales falsas, presentó documentos para postularse para gobernador.",
    "Los cuatro titulares —Evers, la gobernadora de Kansas Laura Kelly, la gobernadora de Michigan Gretchen Whitmer y el gobernador de Pensilvania Tom Wolf— han vetado más de una docena de proyectos de ley destinados a restringir la votación.",
    "El gobernador de Wisconsin, Tony Evers, se encontraba en un lugar familiar a principios de este mes cuando los legisladores republicanos le enviaron un proyecto de ley que habría prohibido las enseñanzas antirracistas en las escuelas.",
    "El gobernador Roy Cooper de Carolina del Norte, jefe de la Asociación de Gobernadores Demócratas, dijo que los cuatro gobernadores están “contrarrestando los ataques de las legislaturas estatales republicanas al derecho al voto”.",
    "Aumento de la oposición a la investigación\nLos republicanos argumentan que los demócratas están siendo obstruccionistas y simplemente se niegan a trabajar con el partido que controla las legislaturas de sus estados.",
    "A fines de 2021, Evers tenía alrededor de $10 millones, mientras que Josh Shapiro, el probable candidato demócrata a gobernador en Pensilvania, tenía $13 millones, según los registros de campaña estatales.",
    "En esos estados, Kansas, Michigan, Pensilvania y Wisconsin, los republicanos controlan las legislaturas estatales y las gobernaciones en poder de los demócratas están en la boleta electoral en el otoño.",
    "Son el único respaldo contra una ola de legislación respaldada por el Partido Republicano que se enfoca en todo, desde el derecho al aborto y los planes de estudios escolares hasta el acceso al voto.",
    "En Pensilvania, Wolf bloqueó esfuerzos similares, vetando un proyecto de ley masivo que también habría reducido los días en que estarían abiertos los buzones para las boletas en ausencia.",
    "Esos movimientos fueron particularmente importantes en Wisconsin, Pensilvania y Michigan, todos estados estrechamente divididos que podrían decidir las elecciones presidenciales de 2024.",
    "Wisconsin es uno de los cuatro estados que emergen como máximas prioridades para los demócratas en un año electoral en el que el partido enfrenta feroces vientos políticos en contra.",
    "Si los republicanos ganan la carrera por la gobernación en cualquiera de esos estados, es casi seguro que aprobarán las restricciones al voto que hasta ahora han sido rechazadas.",
    "El rechazo fue el último recordatorio del papel crucial que juegan Evers y un grupo selecto de gobernadores demócratas en algunos de los estados políticamente más divididos.",
    "Los funcionarios electorales federales y estatales y el propio fiscal general de Trump han dicho que no hay evidencia creíble de que las elecciones hayan sido contaminadas.",
    "Un grupo de gasto independiente afiliado a la DGA también publicó un anuncio a favor de Whitmer en Michigan por un valor aproximado de $200,000 durante diciembre y enero.",
    "Los republicanos se han visto obligados a tratar de acabar con Whitmer al intentar una iniciativa electoral, una que el grupo de Schuh espera contrarrestar con la suya.",
    "Muchos candidatos republicanos que se postulan para gobernador este año han expresado su apoyo a la alegación de Trump de que se robaron las últimas elecciones.",
    "Con la monotonía de las bajas expectativas, el apacible exsuperintendente de escuelas estatales dijo que espera que los republicanos “le echen un vistazo”.",
    "Pero la DGA está intensificando sus esfuerzos de investigación de la oposición sobre candidatos republicanos en Kansas, Michigan, Pensilvania y Wisconsin.",
    "Si las gobernaciones cambian de partido, es probable que una avalancha de legislación republicana que hasta ahora ha sido bloqueada se convierta en ley.",
    "Cooper, quien también se enfrenta a una legislatura republicana, dijo que los gobernadores están “protegiendo los cimientos de nuestra democracia”.",
    "Las acusaciones de fraude del expresidente también fueron rechazadas rotundamente por los tribunales, incluidos los jueces designados por Trump.",
    "En Kansas, se espera que Kelly tenga una candidatura a la reelección más difícil que en 2018, cuando ganó en una contienda a tres bandas.",
    "Whitmer ha vetado varios proyectos de ley que dificultarían la votación y rechazó nueve de esas medidas solo en octubre.",
    "Los demócratas no están limitando su trabajo este año a proteger su posición en los cuatro estados en cuestión.",
    "También esperan obtener escaños ocupados por republicanos en estados como Georgia, Massachusetts y Maryland.",
    "Wolf, que termina su segundo mandato de cuatro años, no busca la reelección, pero Shapiro apoya sus vetos.",
    "“Cualquiera que sea el número que he vetado, es insignificante en comparación con el número al que voy”.",
    "Eso es especialmente preocupante para los demócratas cuando se trata de los derechos de voto.",
    "“Tengo que evitar que sucedan cosas realmente malas”, dijo Evers en una entrevista.",
    "“Es un poco solitario, pero sé que estoy representando a la gente de Wisconsin”.",
    "Por ocasión número 66 desde que asumió el cargo en 2019, sacó su pluma de veto.",
    "Y los propios candidatos demócratas tienen importantes cuentas de campaña.",
    "“Creo que los republicanos tendrán dificultades para decir que no a esto.",
    "Ella tenía dos millones a fines del año pasado.",
    "Y en Michigan, Whitmer tenía $10 millones.",
    "Pero lo han hecho antes”, dijo Evers."
  ]
}