{
  "id": 10763,
  "mediaId": 2526,
  "date": "2022-03-12",
  "headline": "Exclusive — Gubernatorial Candidate Lou Barletta: Illegal Immigration ‘Ends When I’m Governor of Pennsylvania’",
  "image": "https://media.breitbart.com/media/2022/03/Lou-Barletta-podium-ap-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/12/gubernatorial-candidate-lou-barletta-illegal-immigration-ends-im-governor-pennsylvania/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    4539,
    2911,
    1489,
    392,
    1126,
    6506
  ],
  "sentences": [
    "“I’ll go after the buses or anybody that helps relocate people who are illegally being brought into Pennsylvania.”\nBarletta also said he will go after every sanctuary city “with every resource that [he has] in [his] power to protect the citizens of Pennsylvania.”\nThe former congressman also vowed to unleash energy in Pennsylvania as governor, noting that the Russian invasion of Ukraine “highlights Biden’s failure on our energy policy” — a major national security issue, he said.",
    "He “begged them for help” but realized “no one there was going to help, either.” Ultimately, Barletta took matters into his own hands and moved to suspend the license of “any business that knowingly hired an illegal alien because it is illegal to hire unlawful workers.” He added, “I would also suspend the license of any landlord who knowingly harbored or rented to illegal aliens.”\nAs a result, illegals represented by ACLU sued him, and he fought it to the Supreme Court.",
    "LISTEN:\n“Unfortunately for us, I found out that even on our own side, people don’t like to talk about it, but they didn’t have the backbone or courage to do something about it, and look at the mess we have today,” he said, explaining that most politicians do not want to tackle issues regarding immigration because they will be called a racist or bigot.",
    "Former congressman and leading Republican gubernatorial candidate Lou Barletta (R-PA) told Breitbart News Saturday that as governor, he will use all powers available to him to stop illegal immigration, noting that many in the GOP do not have the backbone to stand against the radical left’s illegal immigration policies.",
    "They saw me on the national stage as a mayor of a small town and do something that nobody else in the country had the courage to do, and I really do believe that’s part of why we’re in front.”\nAs mayor, he prioritized fighting sanctuary city policies and the drugs pouring into his city.",
    "I actually did something about it,” he said, noting that he was elected in 2000 and watched as the town was “overcome by illegal immigrants.”\n“Our population grew by 50 percent, but our tax revenue stayed the same,” he said, describing gangs moving in and recruiting children.",
    "Many remember the actions he took as the mayor of Hazleton, where he was essentially the first mayor to “stand up and fight against illegal immigration,” and he believes that is the kind of fighter they are looking for again.",
    "He also noted that fentanyl deaths have hit a record high and “we know the fentanyl is coming from the southern border.” Yet Pennsylvania officials are continuing to allow Biden to dump illegal aliens in the Keystone State.",
    "Recent polls, Barletta said, are a “reflection on what we’re seeing on the ground,” as he has a “huge grassroots campaign.”\n“People know who I am,” he said, noting that they can look at his record.",
    "Tom Wolf (D), and State Attorney General Josh Shapiro over the “ghost flights” of illegals coming in the dead of the night, “dumping them all over Pennsylvania” without any knowledge.",
    "I will go after anyone who aids — what I think is human trafficking here into Pennsylvania — dumping people without our knowledge into our communities,” he said.",
    "“I couldn’t find an elected official anywhere in Pennsylvania,” he said, ultimately going to Washington, DC, and meeting with the Department of Justice in 2005.",
    "We can be a global leader, and we will be when I become governor,” Barletta said, vowing to drop the state out of the Regional Greenhouse Gas Initiative.",
    "“We see so many politicians making campaign promises, and they get in and become part of the problem and disappoint people,” Barletta said.",
    "We’re going to reform DEP [Department of Environmental Protection],” which, he said, they used as a weapon to stop natural gas companies.",
    "“Pennsylvania is the answer to our national security issues, and when I’m governor, we’ll be a global leader again,” he promised.",
    "Recent polls show the Republican primary race as very much a two-man battle between himself and State Sen. Doug Mastriano.",
    "But many cities across the country followed what he did in Hazleton, and he battled for it in Congress as well.",
    "Emergency times also increased as illegal aliens used emergency rooms as primary health care.",
    "Tom Wolf (D) leaving office, Republicans have a clear chance to flip the governor’s mansion.",
    "We have more energy in Pennsylvania than countries around the world, in the Middle East.",
    "But he said as governor, he will have a lot more power to do something about the issue.",
    "Barletta added that he recently called out President Joe Biden, Gov.",
    "Barletta, at the time, asked for help as violent crime went up.",
    "“We’re going to greenlight pipelines when I’m governor.",
    "“That ends when I’m governor of Pennsylvania.",
    "“And Pennsylvania is the answer to that.",
    "“I didn’t talk about it.",
    "But with Democrat Gov.",
    "“They want a fighter."
  ]
}