{
  "id": 12009,
  "mediaId": 8483,
  "date": "2022-03-24",
  "headline": "Pennsylvania governor candidate Josh Shapiro touts plan to give financial relief to residents",
  "image": "https://kubrick.htvapps.com/vidthumb/images/josh-shapiro-1648139772.jpg?crop=1xw:1xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/governor-candidate-josh-shapiro-touts-plan-to-give-financial-relief-to-pennsylvanians/39528461",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Lehman",
  "authorUrl": "https://www.wgal.com/news-team/f2045d51-727e-451e-b547-f5dfa705624f",
  "termIds": [
    3926,
    6095,
    6506
  ],
  "sentences": [
    "CUMBERLAND COUNTY, Pa. —\nPennsylvania gubernatorial candidate Josh Shapiro was in Cumberland County on Thursday touting a plan he says would give financial relief to households in the commonwealth.",
    "News 8 asked him why he thinks he can get this plan approved amid partisan gridlock we've seen at times in recent years.",
    "Shapiro, the only Democrat in the race for governor, spoke about a plan he said could be implemented now.",
    "It generates more than $300 million each year, but Shapiro said it's onerous to families and households.",
    "In addition, he's calling for giving Pennsylvania drivers a $250 gas tax refund per personal vehicle.",
    "And most importantly, this is what the good people of Pennsylvania want right now,\" he said.",
    "He also said his plan would pass legal muster, unlike plans floated by Republican rivals.",
    "Shapiro said the gas tax refund would come from American Rescue Plan Act funds.",
    "This is one piece of many plans we'll be putting out throughout this campaign.",
    "Shapiro also wants to expand the property tax and rent rebate program.",
    "Shapiro said he wants to eliminate an 11% sales tax on cellphones.",
    "\"I've got a long track record of getting things done.",
    "This is achievable.",
    "It's bipartisan.",
    "It's doable."
  ]
}