{
  "id": 12136,
  "mediaId": 8436,
  "date": "2022-03-22",
  "headline": "Franconia joins county and state for opioid settlement",
  "image": "https://www.thereporteronline.com/wp-content/uploads/migration/2017/09/afa26a84cfde8398b9628250ce792a7d.jpg?w=1024&h=670",
  "link": "https://www.thereporteronline.com/2022/03/22/franconia-joins-county-and-state-for-opioid-settlement/",
  "mediaOutlet": "Souderton Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Keeler",
  "authorUrl": "https://www.thereporteronline.com/author/bob-keeler/",
  "termIds": [
    0
  ],
  "sentences": [
    "In answer to a question by board member Robert Nice at the Franconia meeting about whether there are restrictions on how the municipality can use the money received from the settlement, Wert said the money has to be used in ways that directly relate to the opioid epidemic’s impact, such as for treatment services or ways to keep people from becoming addicted.",
    "“What we’re being asked to do is join in with the county with regard to their participation in the opioid settlement process,” Eric Wert, the township’s solicitor, said at the Franconia Township Board of Supervisors March 21 meeting during which three agreements to join the settlement were approved.",
    "FRANCONIA — The township is signing on to get a piece of the settlement reached with major opioid manufacturers and marketers following lawsuits that led to negotiations by several states, including Pennsylvania, and the settlement.",
    "“The bigger the participation the county has, the bigger piece of the total settlement pie in Pennsylvania Montgomery County will have.”\nWert said he does not know the dollar amount Franconia will receive from the settlement.",
    "Steven Cronin said in May the department will be going through the re-accreditation process for the Pennsylvania Law Enforcement Accreditation Program of the Pennsylvania Chiefs of Police Association.",
    "In December of 2021, Pennsylvania Attorney General Josh Shapiro announced that the settlement will bring more than $1 billion to Pennsylvania from the $26 billion global settlement.",
    "Participating administrators then conduct a thorough analysis to determine how existing operations can be adapted to meet these objectives,” the web page says.",
    "“When the procedures are in place, a team of independent professionals is assigned to verify that all applicable standards have been successfully implemented.",
    "“Essentially what this does is it creates a situation where the more municipalities participate, the bigger the participation the county has,” he said.",
    "There are currently 142 accredited law enforcement agencies in the state, according to program information on the pachiefs.org web page.",
    "The cornerstone of this strategy lies in the promulgation of standards containing a clear statement of professional objectives.",
    "“Accreditation is a progressive and time-proven way of helping institutions evaluate and improve their overall performance.",
    "The process culminates with a decision by an authoritative body that the institution is worthy of accreditation.”",
    "Up to $232 million of the Pennsylvania money could be received in 2022, he said at the time.",
    "In another matter at the meeting, Franconia Township Police Department Sgt.",
    "Each accreditation lasts for three years, he said.",
    "“This is going to be our fourth one,” Cronin said."
  ]
}