{
  "id": 12249,
  "mediaId": 8380,
  "date": "2022-03-23",
  "headline": "Pa. Candidates Scramble to Get on May Ballots After Delays",
  "image": "https://media.nbcphiladelphia.com/2019/09/Pa-State-House.jpg?quality=85&strip=all&fit=640%2C480",
  "link": "https://www.nbcphiladelphia.com/decision-2022/pa-candidates-scramble-to-get-on-may-ballots-after-delay/3185620/",
  "mediaOutlet": "nbcphiladelphia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Scolforo",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans have a 113-90 majority in the House, although three of those seats are vacant from resignations and will be filled in an April 5 special election: Allegheny County Democratic seats that became open when Rep. Ed Gainey was elected mayor and named Rep. Jake Wheatley a top staffer, and a Luzerne County seat available since Republican Rep. Tarah Toohil won a judicial race.",
    "Trevor Southerland, executive director of the House Democratic Campaign Committee, figures more than two dozen House GOP members currently represent districts in which at least 45% of voters supported either Joe Biden or Josh Shapiro, the Democratic attorney general who is unopposed for his party's gubernatorial nomination this year.",
    "“I’ve heard a lot of folks say it’s likely to narrow, which is just the way it goes — I've seen it ebb and flow.”\nAlthough all five retirements among the 25 Senate seats up this year are Republicans, Senate GOP campaign chair Sen. David Argall of Schuylkill County said he's encouraged by the crop of candidates that has emerged.",
    "“People are afraid they're signing a fraudulent something-or-the-other.”\nThe launch of petition gathering has been accompanied by a new wave of retirement announcements — at least 22 Republicans and seven Democrats in the House are not seeking another term.",
    "Stephens had to cancel plans to watch college basketball last weekend for a petition effort he described as “more of a sprint than a marathon.”\nLike many others, he predicts Democrats will pick up seats this year but not enough to regain the majority.",
    "“To be perfectly honest, this is a tough time,” said seven-term Rep. Sheryl Delozier, R-Cumberland, after spending several days knocking on doors in a suburban Harrisburg district that underwent significant changes in reapportionment.",
    "A mad dash by Pennsylvania state-level candidates to collect enough signatures to qualify for the primary ballot began over the weekend, kicking off what is certain to be a year of political change in the Pennsylvania Legislature.",
    "The fifth and tie-breaking member of the Legislative Reapportionment Commission was a Democrat chosen by the Democratic-majority state Supreme Court, and population growth has been concentrated in the Democratic southeast.",
    "Which, in a swing state, is what we ought to have.”\nSoutherland sees a path for two additional Democratic seats in the Harrisburg area and potential pickups in the Philadelphia suburbs, Poconos and the State College area.",
    "But in both 2016 and 2020 the state was evenly divided in presidential contests, and this year state House Democrats will be playing defense in at least four swing districts where long-serving incumbents are retiring.",
    "Reps. Mike Carroll and Gerald Mullery in Luzerne County, Rep. Pam Snyder in Greene County and Rep. Mark Longietti in Mercer County are all leaving areas with solid Republican vote performance.",
    "“So it's not just the national issues.”\nPennsylvania has had a Democratic governor and Republican Legislature for 16 of the past 20 years, and voters may well split power between them again.",
    "One of Southerland's top targets, six-term Montgomery County Republican Rep. Todd Stephens, has been in Democratic crosshairs for election cycle after election cycle and keeps winning.",
    "The justices left in place the May 17 primary date but gave candidates until March 28 to get the signatures required to make the ballot — 500 for state Senate and 300 for the House.",
    "“If we’re in the majority it’s going to be a narrow margin, and depending on who wins governor, we’re going to try to govern and try to get compromise,” Briggs said.",
    "“In all reality, it's because I've analyzed every precinct of that district and statistically, I think it's impossible for a Republican to win there,” Lewis said.",
    "“I think there's also a serious case of Tom Wolf fatigue,” Argall said, referring to the state's two-term Democratic governor, now in his final year in office.",
    "Rep. Tim Briggs of Montgomery County, a senior House Democrat, said there is a feeling among his caucus that Republicans have not run the chamber fairly.",
    "The state Supreme Court cut in half the normal three-week petition-gathering period last week, when the court approved new General Assembly maps.",
    "Rep. Andrew Lewis, a second-term Republican from Dauphin County, got drawn into a district with a fellow Republican, Rep. Sue Helm.",
    "It's a large number of departures to hit the 203-member House with a couple of months to go before the first votes are cast.",
    "After several redistricting cycles in which Republicans had control, this year the process was more favorable to Democrats.",
    "The pandemic and general wariness about disclosing personal information are not making the the process any easier.",
    "“The new maps don’t guarantee us a majority by any means, but what they do is they give us an opportunity.",
    "Along with the slew of Republican retirements, he believes Democrats have an array of potential targets.",
    "Five state senators, four Republicans and an independent who caucuses with the GOP, are also bowing out.",
    "Decision 2022\nHe is counting on anger over gas prices and other national political trends to help.",
    "“It's going to be a challenge in itself, because there are going to be folks who want payback.",
    "“I haven’t heard too much concern about losing the majority,” Stephens said.",
    "Neither are seeking reelection in the newly Democratic-leaning district.",
    "“It puts the chamber in play,” Southerland said.",
    "We’ve got to do what’s best for Pennsylvania.”",
    "Candidates have just one and a half weeks."
  ]
}