{
  "id": 12254,
  "mediaId": 8380,
  "date": "2022-03-26",
  "headline": "Abortion to Elections: Republican Candidates on the Issues",
  "image": "https://media.nbcphiladelphia.com/2022/03/pa-gov-race.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.nbcphiladelphia.com/news/national-international/abortion-to-elections-republican-candidates-on-the-issues/3189047/",
  "mediaOutlet": "nbcphiladelphia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In other states, Republican governors and legislatures are passing measures to, for instance, ban “divisive concepts” in Alabamaand Georgiaor, in Florida, limiting the way race can be discussed in classrooms and prohibit discussions of sexual orientation and gender identity with students up through 3rd grade.",
    "Asked if they would use their power to override a local mandate put in place against their wishes, five of the seven candidates on stage at Thursday's forum raised a hand — although the questioner then suggested that perhaps the question was confusing.",
    "Candidates in the nine-person field — bigger than any seen by Republicans in at least decades — are largely monolithic on the issues, tending instead to try to distinguish themselves by emphasizing the depth of their commitment to those stances.",
    "Critical race theory, an academic framework that centers on the idea that racism is systemic in the nation’s institutions and that those institutions maintain the dominance of white people, is not taught in secondary schools, school boards say.",
    "With Pennsylvania's ballot seemingly set, Republican candidates for governor are hitting the forum circuit in earnest, working to set themselves apart from a huge primary field with just eight weeks to go in the campaign.",
    "TRANSGENDER ATHLETES\nThe candidates broadly oppose allowing transgender females to play girls' or women's sports, an exceedingly rare phenomenon but a dominant theme in Republican politics nonetheless.",
    "Some Republican governors moved during the pandemic to block local governments from imposing mandates, such as masks, despite research showing that masks helped slow the spread of the virus.",
    "ENERGY\nThe candidates are pledging to be an ally of Pennsylvania's booming natural gas industry, and to take steps to speed up the permitting of gas drilling and other industrial projects.",
    "Questions about energy, schools and other national political themes have dominated recent forums held by local party organizations, business advocacy groups and other conservative groups.",
    "“Parents should have the right to have their children educated free of political indoctrination, whether that’s critical race theory or anything like that,” Bill McSwain said Thursday.",
    "“Any bill that comes to my desk that would not protect life I would veto,” Lou Barletta said at a Thursday forum sponsored by the Pennsylvania Family Institute and other groups.",
    "Republicans soured on mail-in voting after former President Donald Trump began baselessly attacking it as rife with fraud in his unsuccessful 2020 reelection campaign.",
    "They also vow to pull Pennsylvania out of the Regional Greenhouse Gas Initiative, should it enter before 2023 as a key part of Wolf's strategy to fight climate change.",
    "Candidates roundly call themselves “pro-life,” and suggested — if not outright said — that they would sign legislation that effectively bans abortion in Pennsylvania.",
    "Here is a look at how the Republican candidates are answering questions:\nABORTION\nU.S. & World\nStories that affect your life across the U.S. and around the world.",
    "SCHOOLS\nCandidates are in favor of “school choice,” shorthand for sending more taxpayer money to pay for tuition at charter, parochial and private schools.",
    "A growing number of Republican-controlled states are banning transgender athletes from participating in sports consistent with their gender identity.",
    "“We’ve been working on school choice for 25 years now,” Dave White said at a March 17 forum sponsored by the Washington County Republican Party.",
    "EXECUTIVE AUTHORITY\nCandidates are pledging to avoid “mandates,” a hot topic since Wolf's broad use of executive authority during the pandemic.",
    "In the meantime, the nation's high court is expected to rule on whether to uphold Mississippi’s ban on abortions after 15 weeks of pregnancy.",
    "The question comes after the U.S. Supreme Court twice declined to stop a ban on abortions in Texas after roughly six weeks of pregnancy.",
    "The NCAA has adopted a sport-by-sport approach for transgender athletes to document testosterone levels before championship selections.",
    "Candidates often use the word “indoctrination” to describe how the science of gender or the history of slavery and race is taught.",
    "That echoes complaints from industry groups that state environmental permitting offices take far too long to render a decision.",
    "It will happen, I will sign it in the first year, that I can assure you.”\nCurriculum in public schools is also a hot topic.",
    "Pennsylvania's two-time elected state Attorney General Josh Shapiro has a clear path to the Democratic Party's nomination.",
    "ELECTIONS\nThe candidates say they would repeal the 2019 state law that allowed no-excuse mail-in voting in Pennsylvania.",
    "No guessing what I would do.”\nPennsylvania's ban on abortions after 24 weeks is in line with prior high court rulings.",
    "A state court ruled in January that the law violates the state constitution, agreeing with Republican challengers.",
    "In Pennsylvania, the Pennsylvania Interscholastic Athletic Association has left the decision to principals.",
    "The case is pending in the state Supreme Court, which has allowed the law to stand while it considers it.",
    "“And any bill that comes to my desk that would protect life I would sign.",
    "They are also vowing to toughen Pennsylvania's voter identification law.",
    "Tom Wolf, a Democrat, is term-limited and has endorsed Shapiro.",
    "States have a hodgepodge of policies for high school sports.",
    "Follow Marc Levy on Twitter at www.twitter.com/timelywriter",
    "“Every year we promise it's going to happen.",
    "The primary election is May 17.",
    "Gov."
  ]
}