{
  "id": 13413,
  "mediaId": 8504,
  "date": "2022-03-18",
  "headline": "Attorney General Josh Shapiro makes campaign stop in Erie",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/03/josh-shapiro-for-web.jpg?w=1280",
  "link": "https://www.yourerie.com/news/local-news/your-local-election-hq/attorney-general-josh-shapiro-makes-campaign-stop-in-erie-2/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Wilk",
  "authorUrl": "https://www.yourerie.com/author/brian-wilk/",
  "termIds": [
    2211,
    1022,
    6144,
    6506,
    6678
  ],
  "sentences": [
    "For news delivered right to you, subscribe to JET 24/FOX 66/YourErie.com’s breaking, daily news & severe weather email lists\n“I think that working families and, especially, places that have working moms working a lot, a lot of driving around and taking care of our community then taking care of our kids need a break.",
    "Supply chain issues, the war in Ukraine and how that’s disrupted global marketplaces, including the oil and gas marketplace,” said Josh Shapiro, Pennsylvania Attorney General.",
    "“He wanted to get his message out in a middle class neighborhood and I said there’s no better place to do that than my house,” said Pat Harkins (D) PA State Representative.",
    "He said we are being forced to stretch our paychecks further and that’s why we need to take real action to cut taxes, protect consumers and put money back in our pockets.",
    "These are three concrete ways that are paid for that can help reduce cost for people at the pump, in their daily lives, and in their homes,” Shapiro said.",
    "Eliminating Pennsylvania’s Cell Phone Tax\nExpanding the property tax and rent rebate program\nSending a gas tax refund to Pennsylvania drivers.",
    "Pennsylvania Attorney General Josh Shapiro made a pit stop in Erie on Friday as he looked to become the state’s next governor.",
    "“The effect that the pandemic has had on economies around the world, including here in the United States.",
    "Any direct break that legislation can give them is great,” said Lindsey Scott, Meadville resident.",
    "He highlighted his plan that he said would put money back in the pockets of Pennsylvanians.",
    "Shapiro’s campaign stop was actually in the front yard of State Rep. Pat Harkins.",
    "Shapiro said Pennsylvanians are being crushed under a mountain of rising prices.",
    "“These rising costs are really hurting and they are looking for some relief.",
    "He said there are a number of issues that are causing these rising prices.",
    "She said Shapiro’s new plan is a big help for mothers like her.",
    "Meadville resident Lindsey Scott spoke at the campaign stop.",
    "Shapiro has a three-part plan to do just that.",
    "Some of them are global issues."
  ]
}