{
  "id": 13568,
  "mediaId": 8254,
  "date": "2022-03-18",
  "headline": "Woman falls victim to ‘romance scam’",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/romance-scam3.png?w=1280",
  "link": "https://www.abc27.com/news/consumer/scams/woman-falls-victim-to-romance-scam/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Foreback",
  "authorUrl": "https://www.pahomepage.com/?post_type=profile&p=634677",
  "termIds": [
    0
  ],
  "sentences": [
    "Eventually, he told Jane he was getting a job transfer to the U.S. Jane says the man told her his parents died and he was to inherit about $1M, but the trust was set up in the U.S.",
    "The Netflix documentary ‘Tinder Swindler’ has a lot of people talking and a hardworking, intelligent, single mom found herself in the middle of a similar nightmare.",
    "“Around December he was like, he wanted to make the decision to come be with me and settle down and have a family and stuff like that,” Jane said.",
    "He told her he was adding her as ‘next of kin’ to be a beneficiary of this trust, but she had to make a deposit of several thousand dollars.",
    "EYEWITNESS NEWS (WBRE/WYOU) — A northeast Pa. woman says she’s left with debt and disappointment after falling victim to a romance scam.",
    "He also said his bank account was locked and convinced her to cover some ‘expenses’ until he was able to access the trust.",
    "He tweeted, If you think you’ve been the victim of a romance scammer:\nStop communicating with the person immediately.",
    "“I go to church, I donate things, I’m just a good person like why did this happen to me you know?,” Jane questioned.",
    "She reported him to local police who referred her to the Pennsylvania Attorney General’s (AG) Office.",
    "She suspects scams like these are part of a bigger, organized scheme involving multiple people.",
    "Jane says in September of 2020 a man reached out to her on the dating website, Plenty of Fish.",
    "She realized he had no intention of paying her back, and the passport he showed her was fake.",
    "Jane says he sent flowers, they shared pictures, they talked on the phone and Facetime.",
    "Eyewitness News spoke to her Wednesday about how she fell victim to a romance scam.",
    "Jane says the situation wrecked her finances and left her severely depressed.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "He told her he was a chiropractor and sometimes worked with the military.",
    "She thinks the man lives a double life, and worries he has more victims.",
    "She wishes to remain anonymous so she will be referred to as Jane Doe.",
    "Jane Doe has set up a GoFundMe account to recoup her finances.",
    "The man said he was in the U.K., but traveled a lot for work.",
    "AG Josh Shapiro recently addressed these types of scams.",
    "Notify the website or app where you met the scammer.",
    "Report the scammer to police and his office.",
    "Now she’s sharing her story to help others.",
    "Sign up for the abc27 newsletters here.",
    "The two formed a long-distance romance.",
    "She says he even told her he loved her.",
    "Contact your financial institution.",
    "Jane said she was going into debt."
  ]
}