{
  "id": 13894,
  "mediaId": 8271,
  "date": "2022-03-21",
  "headline": "State troopers and another person killed on I-95 in Philly, driver charged with murder and DUI",
  "image": "https://billypenn.com/wp-content/uploads/2017/05/traffic-flickr-25422136442_d39ccd4e01_k-1200x630.jpg",
  "link": "https://billypenn.com/2022/03/21/pennsylvania-state-trooper-crash-interstate-95-south-philadelphia/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Asha Prihar",
  "authorUrl": "https://billypenn.com/about/asha-prihar/",
  "termIds": [
    0
  ],
  "sentences": [
    "According to a PSP press release, she has been charged with:\nmurder of the third degree, three counts\nhomicide by vehicle while DUI, three counts\nhomicide by vehicle, three counts\nmanslaughter of a law enforcement officer in the second degree, two counts\ninvoluntary manslaughter, three counts\nrecklessly endangering another person, three counts\ndriving under the influence\nother traffic violations, including failing to drive at a safe speed, careless driving, and reckless driving\nOfficials express condolences\nGov.",
    "Tom Wolf said he was “deeply saddened” by the loss of the troopers and the man they were helping, and called the incident “a reminder that our law enforcement officers put their lives on the line every day.”\nTo honor the two troopers, Wolf ordered all Pennsylvania flags at commonwealth facilities, public buildings, and grounds to be flown at half-staff until Friday at sunset.",
    "Around 12:45 a.m., a different driver tried to use the shoulder to get around the scene, but ended up striking the two troopers and the civilian with the vehicle “at a high rate of speed,” according to Captain James Kemm, the state police commander for Troop K – Philadelphia.",
    "Mack, who was 33, had served on the state police force since November 2014, and Sisca, who was 29, enlisted in the state police in February 2021 and recently graduated from the academy, said Lieutenant Adam Reed, director of communications for the PSP.",
    "Heads up: Be careful if you get a call to donate to the troopers’ memory, there’s a scam going around\nTwo state troopers and one civilian were hit by a driver and killed on Interstate 95 in South Philly in the early hours of Monday morning.",
    "How it happened\nA man was walking on the highway in the early morning hours of Monday when state troopers Martin F. Mack III and Branden T. Sisca tried to get him to their patrol vehicle, according to a statement from Gov.",
    "They then got a call to investigate a person walking on the highway, and had to leave the driver — who apparently got back into their car and proceeded their soon-to-turn deadly travel down the highway.",
    "Other elected officials, including Lieutenant Governor John Fetterman, Attorney General Josh Shapiro, and Mayor Jim Kenney, offered their condolences to the victims’ loved ones on social media.",
    "A police honor guard procession left the crash scene and headed toward the medical examiner’s office at Broad and Spring Garden Streets later in the morning, CBS3 reported.",
    "Traffic delays followed, and all lanes of I-95 shut down in both directions from Broad Street to the Walt Whitman Bridge following the crash, NBC reported.",
    "On Tuesday afternoon, officials charged a resident of Eagleville, Pa., with murder, DUI homicide, and reckless endangerment, among other counts.",
    "What happened afterward\nLocal police arrived at the scene first, followed by the Philadelphia Fire Department and state police, 6ABC reported.",
    "In a horrible twist, the two troopers who died had reportedly pulled over the driver a little earlier on suspicion of driving while drunk.",
    "Pa. State Police filed felony and misdemeanor charges against Jayana Tanae Webb, 21, of Eagleville, for her role.",
    "Sign up for the free Billy Penn newsletter to get everything you need to know about Philadelphia, every day.",
    "Witnesses tried to do CPR on the victims, Kemm said, but the three men were pronounced dead on scene.",
    "The suspect had a blood alcohol content level twice the legal limit, according to law enforcement.",
    "It all happened on I-95 South near the Broad Street exit, right by the sports complex.",
    "The civilian was identified Tuesday as Reyes Rivera Oliveras, 28, of Allentown, Pa.",
    "The collision threw the troopers into the northbound lanes, per Kemm.",
    "Shuttle service to the Philadelphia Navy Yard was detoured.",
    "The highway reopened a little after 9 a.m.\nWho was charged?",
    "The collision killed all three.",
    "The driver stayed on the scene.",
    "Tom Wolf’s office.",
    "Love Philly?"
  ]
}