{
  "id": 13934,
  "mediaId": 2608,
  "date": "2022-03-15",
  "headline": "Jury Convicts Ex-Police Chief of Sex Crimes Against Friend’s Niece Who Was Raped ‘Several Times a Month’ Over Six-Year Span",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/03/My-project-2022-03-14T161805.383.jpg",
  "link": "https://lawandcrime.com/crime/brent-getz-police-chief-rape-child/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Spargo",
  "authorUrl": "https://lawandcrime.com/author/chris-spargo/",
  "termIds": [
    0
  ],
  "sentences": [
    "She was then examined by a nurse, who later wrote: “Given her detailed disclosure of inappropriate sexual activity with this adult male occurring over the past several years, it is consistent with sexual abuse.”\nThat same nurse also noted: “Many of the symptoms that [redacted] experienced after this inappropriate touching is also consistent with inappropriate sexual contact and penetration of the vagina.”\nThe Franklin Township Police Department interviewed the victim’s uncle in 2012, but when he asked for a lawyer, authorities did not interview him again for over a year.",
    "My office will always stand up for our children and our most vulnerable, and hold bad actors accountable to the fullest extent of the law.”\nThe victim had to share her story countless times for seven years and provide video evidence of her uncle’s sexual abuse before any arrests were made in the case.",
    "According to Pennsylvania’s attorney general, Wagner agreed to a deal that saw him enter a guilty plea to charges of rape of a child and sexual exploitation of children while also agreeing to testify against Getz at his trial.",
    "“This verdict holds Brent Getz accountable for his horrific crimes against a child and brought justice to a brave survivor who had the courage to come forward,” said Pennsylvania Attorney General Josh Shapiro (D).",
    "Things changed in 2018, however, when a member of the police force took an active interest in the investigation, and the victim, then 17, provided him with new details and that video she took six years prior.",
    "These charges include rape of a child, involuntary deviate sexual intercourse with a child, aggravated indecent assault of a child, and indecent assault of a child under 13.",
    "The complainant stated that Wagner began his assaults when she was approximately four years old, and Wagner would come to her bedroom and take her to his bedroom.",
    "The complainant stated that at approximately age six, Wagner began having vaginal and anal sex with her as well as Getz becoming a participant in the rapes.",
    "She noted that it happened several times a week from approximately age four (4) through age eleven (11), ending shortly before the report in May 2012.",
    "The complainant stated that she had been repeatedly raped orally, vaginally, and anally by both her uncle Greg Wagner and a co-defendant Brent Getz.",
    "The complaint details the depraved nature of the allegations and the horrific physical and sexual abuse endured by the victim for years in silence.",
    "Children and Youth Services informed the Franklin Township police, who set up an interview for the girl with the Children’s Advocacy Center (CAC).",
    "According to the complaint, she said that her uncle would rub his groin on her genitals, offer her money for sex, and make her watch pornography.",
    "According to the criminal complaint, the girl’s uncle, Gregory Wagner, had been Getz’s best friend at the time of the abuse.",
    "The complaint also details the countless hurdles and setbacks the victim experienced before finally getting justice.",
    "Then, in 2015, a complaint was dismissed by a district judge due to what the judge claimed was a paperwork error.",
    "Since no one believed her, she took a video at one point and sent it to another family member for safekeeping.",
    "The Pennsylvania police chief who lost his job amid horrifying allegations of child rape is heading to prison.",
    "“As a police chief and public servant, Getz’s abhorrent actions betrayed the public’s trust and safety.",
    "A year later, an affidavit of probable cause was filed in the case charging both Getz and Wagner.",
    "Getz was a friend of Wagner’s who participated in the assaults when he was at Wagner‘s home.",
    "Complainant stated that during the assaults, Wagner would have pornography on in his room.",
    "The victim was 11 when she first told a substitute teacher that her uncle was raping her.",
    "That teacher, in turn, contacted ChildLine, Children and Youth Services, Carbon County.",
    "A jury convicted Brent Getz, 30, on all possible counts last week, court records show.",
    "According to the complaint, the two men continued to abuse the victim in the interim.",
    "Wagner would touch the complainant’s vagina and had her perform oral sex on him.",
    "He will never again be able to use a position in law enforcement to hurt people.",
    "The girl sat for a lengthy discussion with a forensic interviewer at CAC.",
    "No charges were filed after an investigation, according to prosecutors.",
    "The rapes took place several times a month for approximately six years.",
    "Getz now waits to learn what his sentence will be for those crimes.",
    "By this time, Getz was the Weissport Chief of Police.",
    "Sentencing for both men will take place next week.",
    "Charges weren’t refiled after that error.",
    "She was just 11 at the time."
  ]
}