{
  "id": 13949,
  "mediaId": 8448,
  "date": "2022-03-16",
  "headline": "What Happened Today: March 16, 2022",
  "image": "https://cdn.substack.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F76696f1a-f8c5-4c6e-9a59-a55ee81c557f_6240x4160.jpeg",
  "link": "https://thedailyscroll.substack.com/p/what-happened-today-march-16-2022?s=r",
  "mediaOutlet": "Tablet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Siegel",
  "authorUrl": "https://substack.com/profile/73092463-jacob-siegel",
  "termIds": [
    0
  ],
  "sentences": [
    "According to The Washington Post, the briefing left influencers feeling “more empowered to debunk misinformation and communicate effectively about the crisis.” The article went on to note that “TikTok has been overrun with false and misleading news since the war broke out, and, on Thursday, the company said it finally would begin labeling state-controlled media on its platform.” This label doesn’t apply, it appears, to states distributing talking points to teenage TikTokers.",
    "And yet, despite all of that, Northern Liberties continues its own kind of transformation, blissfully unaware of its surroundings, or so it seems, as new fitness studios, cooking class kitchens, and boutique storefronts have arrived to cater to the more than 1,500 new luxury housing units built across several immense, amenity-rich complexes with the highest standards of living.",
    "Investigations are classified as “sensitive” if they may affect constitutional rights; the investigations under review, which were focused on domestic politicians, religious organizations, and members of the media, were rife with errors, including failures to have investigations approved by bureau leadership and failures to keep prosecutors informed.",
    "Towering over the small two- and three-story row homes, which had once been the tallest thing in the neighborhood besides the modest manufacturing warehouses that employed thousands of blue-collar residents, the premium housing structure will cover more than 60,000 square feet of retail space to accommodate an Amazon Fresh grocery.",
    "Scroll editor Sean Cooper takes a stroll through his old neighborhood in Philadelphia where the cherry blossoms are blooming, and people are dying in the street\nIt was a rather beautiful afternoon in Philadelphia yesterday, the cherry blossoms budding, as is their ancient habit, the air warm in Washington Square Park.",
    "One station in Kensington got so bad the city simply closed up its gates, the Inquirer reported, to try to catch up on the “damage caused by urination, human waste, discarded needles, and other debris.”\nAt the bottom of the steel steps at the El stop, I saw five people counting the change out of a white styrofoam cup.",
    "You are welcome to read the full version of the letter at the link below, but for your convenience, here is The Scroll executive summary:\nDear Amnesty, we call on you to please consider upgrading Israel from an antichrist that must be destroyed to a marginally more respectable level of moral leprosy.",
    "In response to a statement from Amnesty International’s U.S. Director Paul O’Brien saying that Israel should not exist as a Jewish state and that his “gut” tells him most American Jews agree with this sentiment, a group of 11 Democratic Senators wrote a critical letter to the organization.",
    "Violence and shootings are creeping closer into Northern Liberties from the impoverished areas to its west, while the neighborhood of Kensington, home to the largest open-air drug market in the United States, and a festering wound in the national opioid epidemic, sits several blocks north.",
    "In some months, Cuomo’s administration underreported nursing home deaths by as much as 50%, as the governor sought to sell himself as a model of pandemic-era leadership—going so far as to pen American Crisis: Leadership Lessons from the Covid-19 Pandemic, which fetched a $5 million deal.",
    "He was especially welcome on CNN, appearing alongside his brother, Chris Cuomo, then a lead anchor at the network where the top executives, it was later revealed in a different scandal, included an ex-Cuomo aide who was coordinating positive coverage for the then-governor.",
    "“The positions during negotiations already sound more realistic,” Ukrainian President Volodymyr Zelensky said Wednesday morning, a sentiment shared by Russia’s Foreign Minister Sergei Lavrov, who echoed the “realistic assessment.”\nYet the devil remains in the details.",
    "Since he has already been made a global villain and cut off from the financial system, there is little incentive for Putin to end the war prematurely rather than press his advantage to secure terms that can justify the invasion for the domestic audience inside Russia.",
    "At Fifth and Spring Garden, a couple of blocks south of my old apartment, where I’d once take my two-year-old for challah French toast at the breakfast spot around the corner, the strip of restaurants, as well as my old gym, had been razed and surrounded by fences.",
    "While President Biden publicly declares that “Putin will be a pariah on the international stage,” his administration is relying on Russia to secure the Iran deal, including by offering written guarantees that sanctions on Russia won’t apply to its trade with Iran.",
    "The plan, which was introduced in negotiations Monday and made public for the first time on Wednesday, outlines terms for both a cease-fire and the withdrawal of Russian troops from Ukraine and helps explain the tentative optimism heading into Wednesday’s talks.",
    "Last year, the Pennsylvania Attorney General Josh Shapiro estimated the neighborhood’s drug market is “approaching a billion-dollar enterprise,” with drug corners worth $60,000 a day and some premium blocks earning the dealers a cool million per week …",
    "The besieged leader, whose speeches have proven effective in coaxing Western allies to action short of military intervention, once again requested that NATO impose a no-fly zone over Ukraine or otherwise empower the country to protect its own skies.",
    "This Housing Equity Fund initiative is framed as a way of giving back to the community, but affordable housing has grown into a highly lucrative industry, with Amazon joining the likes of mega asset manager Blackstone in the investment sector.",
    "Ukraine has already given up its ambitions of joining NATO and will likely acknowledge Russia’s annexation of Crimea, a considerable concession but one that aligns with the reality on the ground since Russia’s 2014 invasion of Crimea.",
    "Last week, 30 stars from the popular Zoomer social media platform TikTok gathered on a Zoom call with Jen Psaki, the White House press secretary, and staff from the National Security Council to be briefed on the war in Ukraine.",
    "Amazon is now looking to move people again, as the company announces plans to build more than 1,000 affordable-housing units near its main headquarters in Seattle and the D.C. Metro area, pledging $124 million to the project.",
    "A block up, a woman walked past me, and I overheard her say to her companion, “He was 13 months sober, what else could I have done?” To describe what has happened to Kensington is to speak in terms of the apocalyptic.",
    "A former client, Xiaoning Zhang, who was arrested for the killing, had apparently confessed to Li last friday that she had fabricated her asylum application, at which point Li said he could no longer represent her.",
    "The construction on a 105,000-square-foot development was well underway, with the machines pushing dirt underneath the giant crane carrying the pieces of what will become 382 high-end units in a 13-story building.",
    "That essentially requires Kyiv to foreswear outside support at the very moment it has maximum leverage over Europe, has proved its mettle in a ground war, and is most acutely aware of its vulnerability to Moscow.",
    "Their clothes were ragged, one was barefoot, and their movements as they thumbed the coins in their hands were exaggerated and slow, in the way of opioid users who have to lug around the weight of their habits.",
    "Police labor shortages, high law enforcement resignation rates, and the rapid uptick in violent crime had made it increasingly difficult for the public transportation authority, SEPTA, to police the trains.",
    "Amazon increasingly faces a shortage of workers; the company has a 150% employee turnover rate among hourly workers, losing roughly 3% of its warehouse workers weekly—nearly double the rate of competitors.",
    "He had expected a quick victory and regime change and is now looking at a protracted occupation against a capable enemy while his country suffers from the worst slate of economic sanctions in history.",
    "The Federal Reserve raised interest rates today by a quarter-point and projected six more incremental increases for this year in an effort to combat inflation, which now sits at a 40-year high.",
    "Former New York Governor Andrew Cuomo misled the public by not reporting the COVID-19 deaths of 4,100 nursing home residents, a newly released audit from the state comptroller found.",
    "At this point it appears that neither Putin nor Zelensky wants to see the war progress to a drawn-out siege of Kyiv, which would be incredibly bloody and costly for both sides.",
    "I went north to Girard Avenue, the wide boulevard that served as the neighborhood border with Kensington and its drug-filled streets, and walked east toward the El train stop.",
    "“We are in crisis mode,” the SEPTA Assistant General Manager Kim Scott Heinle wrote last year to city officials, with stations overtaken by drug users, dealers, and violence.",
    "Read More: https://news.gallup.com/poll/390734/sleep-struggles-common-among-younger-adults-women.aspx\nTablet’s David Sugarman contributed reporting to today’s Scroll.",
    "Read it here: https://www.ft.com/content/7b341e46-d375-4817-be67-802b7fa77ef1\nIn The Back Pages: Circles of Hell in an American City, Philadelphia Edition\nThe Rest\n?",
    "These affordable units are exclusively reserved for those earning 30% to 80% of area median income and are intended to attract low-wage workers to these regions.",
    "The audit, which the FBI conducted internally, reviewed half of the “sensitive” investigations that were conducted between Jan. 1, 2018, and June 31, 2019.",
    "“Nearly 84 million people in this country are tossing and turning.” That’s the conclusion of a new survey conducted by Gallup and mattress company Casper.",
    "Read it here: https://jewishinsider.nyc3.digitaloceanspaces.com/wp-content/uploads/2022/03/15194641/2022.03.15-Amnesty-International-With-Watermark.pdf\n?",
    "After delivering his remarks in Ukrainian, he concluded his speech in English: “To be the leader of the world means to be the leader of peace,” he said.",
    "The FBI averaged more than two “compliance errors” per “sensitive” investigation, an audit found, amounting to 747 violations in an 18-month period.",
    "The United States and NATO have thus far rejected the no-fly zone request, which would draw them into a direct military confrontation with Russia.",
    "The rate increase comes at a complicated moment, though, with the war in Ukraine creating global instability and driving inflation even higher.",
    "In yesterday’s Scroll we noted that Amazon was relocating employees from a workspace in downtown Seattle amid concerns about increasing crime.",
    "Li joined the protests and became a legal adviser to an important pro-democracy union before he was arrested and jailed for nearly two years.",
    "In the survey, two-thirds of Americans reported sleeping difficulties, and a third said their poor rest is negatively impacting their mood.",
    "The survey also found that young women are faring the worst, reporting the highest levels of stress and the worst sleep of any demographic.",
    "Li was born in China and was a doctoral student in constitutional law when pro-democracy protests broke out in Tiananmen Square in 1989.",
    "The Big Story\nUkraine and Russia have made “significant progress” toward a 15-point plan, according to officials involved in the talks.",
    "Governor Cuomo was a fixture on cable news, where he rose to national prominence by touting the state’s manipulated death count.",
    "Here is a brochure to consider about how Golda Meir was a kickass feminist who leaned way in, which may inform your perspective.",
    "More difficult will be the requirement that Ukraine not host any foreign military bases or accept weapons from outside nations.",
    "“I call on you to do more,” President Volodymyr Zelensky said in his address to the U.S. Congress Wednesday morning from Kyiv.",
    "By building affordable housing near factories, the company is creating a ready supply of low-wage workers to burn through.",
    "These increases will make borrowing harder and discourage spending, hopefully bringing down costs and inflation in turn.",
    "Upon his release from prison, Li emigrated to the United States and became an immigration lawyer in New York City.",
    "Up Fifth Street, I headed to Northern Liberties, where I once lived, to see what’s become of the old neighborhood.",
    "Jim Li, an immigration lawyer and pro-democracy activist from China, was murdered on Monday in Queens, New York.",
    "Russia’s invasion has led to not only a global energy crisis but also an increase in commodity and food prices.",
    "Stress is singled out as the main cause: A stressful day had a 96% chance of leading to low-quality sleep.",
    "The TikTokers posted videos laying out the administration’s talking points to their millions of followers.",
    "She threatened him, and the police broke up the dispute, but Li asked them not to arrest her.",
    "The embattled Zelensky appealed to America’s self-image as the anchor of world order.",
    "Signed, your pals in the Senate (We’re not angry, we’re disappointed.)",
    "Nearly 30% of the world’s wheat comes from Russia and Ukraine.",
    "Further, Putin has taken the measure of the West’s resolve.",
    "You’d be forgiven for thinking this was an SNL sketch.",
    "She returned on Monday and murdered him in his office.",
    "See you at the next human rights awards dinner party.",
    "More aid; more military support; more sanctions.",
    "Yet that leaves Putin with few good options.",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}