{
  "id": 14088,
  "mediaId": 2740,
  "date": "2022-03-18",
  "headline": "Cut taxes to make gas cheaper? Maryland and Georgia try it temporarily — and other states might too.",
  "image": "https://www.gannett-cdn.com/presto/2022/03/12/USAT/56fc25aa-0331-4271-8701-218035a762ca-News-_Gas_prices_at_all-time_high_009.JPG?crop=4799,2699,x1,y193&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/nation/2022/03/18/states-propose-pause-gas-taxes-counter-high-costs-russian-invasion/7098830001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeanine Santucci",
  "authorUrl": "https://www.usatoday.com/staff/2647342001/jeanine-santucci/",
  "termIds": [
    0
  ],
  "sentences": [
    "U.S. inflation hit a 40-year high in February, with gas prices accounting for about one-third of it; gas prices were already rising as much of the country eased back COVID-19 sanctions and more drivers got back out onto the roads, causing higher demand on suppliers.",
    "\"A short-term pause is a fiscally-responsible action we can take that will provide drivers relief at the pump right now — not next year — while also protecting funding for road repairs and save tens of thousands of good-paying construction jobs,\" Whitmer said.",
    "\"While some of the more recent price hikes are due to Russia's invasion of Ukraine, Georgians also know that Washington DC policies and politics were driving inflation to record highs, well before Putin's despicable actions,\" Kemp, the Georgia governor, said.",
    "Democratic Pennsylvania candidate Josh Shapiro said Friday he wants to give $250 per vehicle to households to come out of pandemic relief funds, and Republican candidates including Bill McSwain and Jake Corman said they would reduce gas taxes.",
    "This week President Joe Biden criticized companies who \"pad their pockets at the expense of hardworking Americans\" because the cost of a oil per barrel has gone back down since the start of Russia's invasion, but gas prices have remained high.",
    "President Joe Biden announced sanctions on Russia as part of a robust international response, including a ban on the U.S. import of all Russian energy products, warning that the effects would be felt at home in the form of higher gas prices.",
    "The national average for a gallon of regular gasoline is about $4.27, according to AAA, easing back slightly after hitting a record high of $4.33 a week ago, but still above the previous record set in July 2008 of $4.11.",
    "\"We simply can’t afford not to let more Marylanders keep more of their own hard-earned tax dollars in their own pockets, particularly our seniors on fixed incomes,” Hogan said of tax-cut proposals, including on gas.",
    "As prices spiral upward and cause many to cut back on driving after the U.S. ended Russian oil imports, lawmakers in at least three states and two U.S. senators have indicated plans to put a pause on gas taxes.",
    "Mark Kelly, D-Ariz., and Maggie Hassan, D.-N.H., previously introduced legislation that would suspend federal gas taxes of 18.4 cents per gallon and 24.4 cents per gallon for diesel fuel until 2023.",
    "In California, where gas is typically the highest in the nation, a group of lawmakers proposed offering a $400 rebate to every taxpayer to help offset the current high costs on Thursday.",
    "And earlier in the week, Republican lawmakers in the California Assembly moved a bill to temporarily suspend the state's gas tax, but the proposal was rejected by Democratic members.",
    "And though not much of its crude oil is exported to the U.S. — about 700,000 barrels a day in 2021 — gas prices had been rising since the start of Russia's invasion.",
    "Contributing: The Detroit Free Press; The Palm Springs Desert Sun; The Arizona Republic; The Montgomery Advertiser; The Associated Press",
    "“There’s an urgent need right now with the high costs across the board, not just gas, but all of our daily living costs have increased.",
    "The topic is heating up in gubernatorial races, too, with candidates in other states pledging to do something about gas prices.",
    "Several states are looking for ways to give Americans a break – or at least a discount – from sky-high prices at the gas pumps.",
    "Alabama gubernatorial candidate Tim James, a Republican, said this week he would repeal gas tax increases in the state.",
    "\"We can't fix everything that Washington has broken, but we are doing our part to lessen the impact on your wallet.\"",
    "In Pennsylvania and Alabama, governor's candidates have rolled out their own plans to address high gas prices.",
    "Some state leaders are using the gas price hikes as a way to levy political criticism on the White House.",
    "In some cases they're offering incentives for Americans to fuel up, with more states sure to follow suit.",
    "Their bill would require cuts to go to consumers paying at the pump, not to oil and gas companies.",
    "People need relief now,” Assembly Republican Leader James Gallagher told the Los Angeles Times.",
    "Gretchen Whitmer called for a suspension on the state's 6% tax on gas and diesel on Friday.",
    "Maryland's state gas tax adds 36 cents per gallon, and Georgia's is 29.1 cents per gallon.",
    "Brian Kemp signed a similar law Friday that would last through the end of May.",
    "A measure to suspend state gas taxes for 30 days was sent to Maryland Gov.",
    "Russia's oil and gas production makes up about 40% of its revenue.",
    "A month ago, the average was about $3.53, according to AAA.",
    "Can I switch to regular gas to save on high gas prices?",
    "That tax is primarily used for the Highway Trust Fund.",
    "Then, Russia began its assault on neighboring Ukraine.",
    "Larry Hogan's desk Friday, while Georgia Gov.",
    "SAVING MONEY:My car requires premium gas.",
    "Michigan Gov.",
    "Sens."
  ]
}