{
  "id": 14193,
  "mediaId": 8449,
  "date": "2022-03-16",
  "headline": "Estampida de candidatos se presenta para las primarias",
  "image": "https://media.telemundo62.com/2019/09/GettyImages-1216006088.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/estampida-de-candidatos-se-presenta-para-las-primarias/2200432/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4081,
    1489,
    1080,
    6506,
    6520
  ],
  "sentences": [
    "Ellos son: John Brown, un exejecutivo electo del condado de Northampton y candidato del partido a auditor general en 2016; Jeff Coleman, ex legislador estatal y consultor político y de marketing; Teddy Daniels, un ex oficial de policía y veterano de combate del Ejército que está alineado con Trump y dice que estaba afuera del Capitolio de los Estados Unidos la tarde de la insurrección del seis de enero; Carrie DelRosso, legisladora estatal novata de los suburbios de Pittsburgh; Russ Diamond, un legislador estatal de Lebanon County que se destacó en la resistencia a las medidas gubernamentales de la era de la pandemia; Christopher Frye, alcalde de New Castle; James Jones, que dirige una empresa de comercio de petróleo y productos derivados del petróleo; Rick Saccone, un exlegislador estatal del área de Pittsburgh que también estuvo afuera del Capitolio de los Estados Unidos el seis de enero; y Clarice Schillinger, una residente de Bucks County que se involucró políticamente en las carreras de la junta escolar el año pasado en un impulso contra las medidas de la era de la pandemia.",
    "Ellos son: Lou Barletta, el candidato del Partido Republicano para el Senado de los Estados Unidos en 2018 y excongresista conocido por su cruzada contra la inmigración ilegal; Jake Corman, el senador estatal de mayor rango; Joe Gale, comisionado del condado de Montgomery; Charlie Gerow, consultor de marketing y activista conservador desde hace mucho tiempo; Melissa Hart, abogada y excongresista; el senador estatal Doug Mastriano, una fuerza en la política de derecha de Pensilvania que se alineó con Trump y presionó para anular las elecciones presidenciales de 2020; Bill McSwain, un abogado que fue el fiscal federal designado por Trump en Filadelfia; Jason Richey, un abogado de Pittsburgh que se especializa en litigios comerciales y contractuales; Dave White, quien dirige una gran empresa de plomería y HVAC y fue concejal del condado de Delaware; y Nche Zama, un cirujano cardíaco que ha dirigido unidades en varios hospitales de Pensilvania.",
    "Ellos son: la activista conservadora Kathy Barnette, quien se ha alineado con figuras destacadas en el impulso liderado por Trump para anular las elecciones presidenciales de 2020; el inversionista inmobiliario Jeff Bartos, quien fue el candidato del partido para vicegobernador en 2018; el abogado George Bochetto; el abogado Sean Gale; el ex director ejecutivo de fondos de cobertura, David McCormick; Mehmet Oz, el autodenominado gurú de la salud y el bienestar y autor mejor conocido como presentador del programa de televisión diurno \"The Dr. Oz Show\"; y Carla Sands, exembajadora de Trump en Dinamarca que dirigía el imperio inmobiliario comercial de su difunto esposo en California.",
    "Una estampida de candidatos llegó antes de la fecha límite del martes para presentar el papeleo para ingresar a las boletas primarias de Pensilvania, mientras se forman grandes campos para la oficina abierta del gobernador, la oficina del vicegobernador y el escaño en el Senado de los Estados Unidos.",
    "Ellos son: el médico de la sala de emergencias Kevin Baumlin; Fetterman; el representante estatal de segundo mandato Malcolm Kenyatta de Filadelfia; el activista liberal Alex Khalil; y el representante estadounidense de tercer mandato Conor Lamb de los suburbios de Pittsburgh.",
    "Excepto por la nominación casi segura del demócrata Josh Shapiro para gobernador, los partidos nacionales y estatales no se han metido en las contiendas por gobernador y Senado de los Estados Unidos, y tampoco lo ha hecho el expresidente Donald Trump.",
    "Cincuenta y seis candidatos se presentaron para postularse, y todos los titulares, excepto el representante republicano por segundo mandato Guy Reschenthaler en el suroeste de Pensilvania, tendrán un desafío en las elecciones primarias o generales.",
    "Ellos son el representante del área de Pittsburgh de segundo mandato Austin Davis, el representante de cinco mandatos Brian Sims de Filadelfia y Raymond Sosa, un planificador financiero que se postuló sin éxito para vicegobernador en 2018.",
    "A las 5:00 p.m. será el momento límite de cierre de operaciones para presentar suficientes firmas de votantes para que la boleta primaria del 17 de mayo de Pensilvania también se aplique a las carreras para el Congreso.",
    "El gobernador demócrata Tom Wolf tiene prohibido constitucionalmente postularse para un tercer mandato consecutivo, mientras que el senador Pat Toomey, un republicano por segundo mandato, no se postula nuevamente.",
    "El estado permite una semana para presentar impugnaciones judiciales a la documentación de un candidato, y los tribunales tienen una semana más después de eso, hasta el 29 de marzo, para tomar una decisión.",
    "La elección de este año es la primera vez en décadas que Pensilvania tiene su oficina de gobernador y un escaño en el Senado de los Estados Unidos en la misma boleta electoral sin un candidato titular.",
    "Decisión Local\nAquí damos un vistazo a quién se ha presentado, según información de los funcionarios electorales estatales:\nSENADO DE LOS ESTADOS UNIDOS\nAmbos partidos tendrán primarias disputadas.",
    "GOBERNADOR\nEl presunto candidato del Partido Demócrata, Shapiro, presentó su candidatura a gobernador en medio de su segundo mandato como fiscal general electo de Pensilvania.",
    "Doce de cada uno se postularon para el Senado de los Estados Unidos y vicegobernador, mientras que 11 se postularon para gobernador, la mayoría de ellos republicanos.",
    "Seis se presentaron para postularse en el distrito con sede en Pittsburgh, mientras que cinco se presentaron en el distrito justo al oeste.",
    "CONGRESO\nQuince titulares se postulan para la reelección de los 17 escaños del Congreso de Pensilvania en distritos recién trazados.",
    "El vicegobernador John Fetterman, un demócrata, se postula para el Senado de los Estados Unidos, en lugar de buscar otro mandato.",
    "Eso ha despertado un gran interés por parte de los posibles candidatos en concursos que se consideran abiertos de par en par.",
    "TENIENTE GOBERNADOR\nAmbos partidos tienen carreras por el puesto vacante con Fetterman buscando un cargo más alto.",
    "Dos distritos del área de Pittsburgh carecen de un titular y brindarán una oportunidad para los recién llegados.",
    "Del lado demócrata, tres se presentaron, incluidos dos legisladores estatales.",
    "Tiene un camino claro hacia la nominación del partido sin oposición.",
    "Diez candidatos se presentaron para postularse del lado republicano.",
    "Cinco se presentaron para la nominación del Partido Demócrata.",
    "Del lado republicano, se presentaron nueve candidatos.",
    "Del lado republicano hay siete candidatos.",
    "Davis está compitiendo con Shapiro."
  ]
}