{
  "id": 1490,
  "mediaId": 8282,
  "date": "2022-02-15",
  "headline": "Local agencies bracing for impact of U.S. Supreme Court ruling on Roe v. Wade",
  "image": "",
  "link": "https://www.chestercounty.com/2022/02/15/390438/local-agencies-bracing-for-impact-of-u-s-supreme-court-ruling-on-roe-v-wade",
  "mediaOutlet": "chestercounty.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Gaw",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The drumbeat of abortion bills over the past few months has been constant in Pennsylvania and a Republican governor’s election would be absolutely detrimental to an individual’s ability to access reproductive healthcare in the state.”\n‘The big truth is that abortion is the taking of a human life’\nTom Stevens, the president and CEO of the Pro-Life Union of Greater Philadelphia, said that an overturn of Roe v. Wade will signal the end to what he called a bad law that has been on the nation’s books for the past 50 years, and one that will slowly lead to a unified and common judgment.",
    "They come here because they rely on us and to receive our care.”\nThe continuing argument\nWhile the future of Roe v. Wade hangs in the balance, what will always remain at the center of this more than 50-year argument between the Pro-Life and Pro-Choice movements is the fundamental question, “When does life begin?”\nTo support the conviction of the Pro-Life movement, Eck pointed to Micheline Matthews-Roth of Harvard University’s 1981 appearance before the before the U.S. Senate Judiciary Subcommittee, when she said, “It is incorrect to say that biological data cannot be decisive.",
    "“As a physician devoted to the protection and preservation of human life, I urge our legislatures and fellow citizens to recommit to defending the right of all babies to have the opportunity to experience the wonder of life.”\nStevens said that while he remains firm in his belief that the debate between Pro-Life and Pro-Choice – in the U.S. Supreme Court, in Harrisburg, in places of faith and in agency-led protests – is a long way from being over, he sees a conclusion.",
    "That was true 50 years ago and will be so in the future, and until laws in every state say that the taking of a human life is not acceptable, then the fight won’t be done.”\nDr. Gordon R. Eck, a board member with Chester County Women’s Services, said that if Roe v. Wade is overturned, the legality of abortion will be returned to the states where most experts in constitutional law believe the decision should be made.",
    "Most recently, Sen. Judy Ward (R-Blair County) submitted Senate Bill 956 in January that proposes an amendment to the state’s constitution that if passed would add language stating that “there is no right to abortion” in the commonwealth and that nothing in the state’s constitution “requires taxpayer funding for abortion.”\nAlong party lines, the Senate Health and Human Services Committee voted to approve the bill.",
    "This legislation provides an additional layer of regulations in the state that began in 1982 with the passage of the Pennsylvania Abortion Control Act that enacted five provisions: Informed consent, parental consent, spousal notice, exceptions for “medical emergencies,” and “other reporting requirements,” an act that required certain reporting requirements of facilities that performed abortions.",
    "“There they will be able to see the miracle, via ultrasound, of what ‘it’ is that they are nourishing and safeguarding.”\n‘Our patients are not coming to us for political reasons’\nIn a recent survey conducted by Operation Rescue, the number of abortion facilities in the U.S. increased in 2021 to a total of 740, a rise of 14 from 2020 – with 41 new facilities opening or resuming abortions in 2021.",
    "While agencies like Planned Parenthood of Southeastern Pennsylvania wait out the U.S. Supreme Court ruling on Roe v. Wade, they tussle with another challenge: continuing to provide Pennsylvanians with access not just to abortions but to the other side of their continuum of care, such as birth control emergency contraception, health services, pregnancy and testing, and education.",
    "They actually hurt people’s ability to access healthcare and their decision as to when they want to start a family.”\nFor pro-choice agencies like Planned Parenthood Southeastern Pennsylvania, every meeting, protest, posting and initiative is being waged against the backdrop of continued state legislation that moves the goalposts farther from access to abortion services.",
    "While a final ruling is not expected to come before summer to affirm a ban on abortions after 15 weeks’ gestation for pregnant women in Mississippi, the vote will likely create major implications for the future of a woman’s right to choose within the framework of federal law and give state legislatures the legal authority to ban abortions.",
    "“When we overturn a policy like this -- and add to that the criminalization of providers who perform abortion care -- not only does it make abortion illegal, it creates a political line in the sand that is not about caring for people and their health care, but about making a political statement,” Mauldin said.",
    "Since 2016, Pro-Life Republicans in both the House and the Senate have introduced six anti-choice bills into the Pennsylvania General Assembly, but three of the six have been vetoed by Democratic and pro-choice governor Tom Wolf, who vows to strike down the other three before he leaves office in 2023.",
    "The [U.S.] Supreme Court ruling could put necessary reproductive health care, including abortions, in jeopardy and we all need to sound the alarm.”\nThe Republican legislature in Pennsylvania, however, refuses to yield in its ambition to eliminate the legal right to abortion services in the state.",
    "‘A political line in the sand’\nA major component of Planned Parenthood Southeastern Pennsylvania’s mission is to serve as an advocate for the protection and advancement of health equity and access to care throughout Philadelphia and several neighboring counties, including Chester County.",
    "The U.S. Supreme Court seems poised to uphold a Mississippi abortion law, with members of the court’s conservative six-to-three majority signaling that sweeping changes are soon to come that will further limit abortion rights, beginning with the possible overturning of Roe v. Wade.",
    "On Jan. 1, the following restrictions on abortion in Pennsylvania went into effect:\n· A patient must receive state-directed counseling that includes information designed to discourage the patient from having an abortion, and then wait 24 hours before the procedure is provided.",
    "If a Republican wins the gubernatorial election, it could mean that the GOP would control both the governor’s office and hold a majority of seats in both the state House of Representatives and the state Senate – a clear pathway to further pass laws restricting abortion access.",
    "“Abortion is a safe procedure, and when we see rates of maternal mortality at an all-time high – particularly in southeastern Pennsylvania and specifically for Black and Latino women – we know that access to services is something that we should not be taking away.",
    "“One in four women – which includes the transgender population -- will have an abortion in their lifetime, and that’s a part of the conversation that we cannot ignore, because it is a service that many people access and will continue to access in the future.”",
    "It is scientifically correct to say that an individual human life begins at conception.”\n“As a practicing physician of over 40 years, I know of no medical embryology textbook that states a new human life begins at any time other than conception,” he said.",
    "By Richard L. Gaw\nStaff Writer\nIn the middle of the juxtapositions, debate and ever-changing course of legislation that continues to inform the conversation of abortion in America, it is a universally acknowledged truth that six is greater than three.",
    "I believe that this will be over, and it will be the right to life side who will be the voice of reason.”\nOn the other side of the argument, Mauldin said that what truly lies in the balance will be the ability to provide safe access to healthcare.",
    "· Health plans offered in the state’s health exchange under the Affordable Care Act can only cover abortion in cases of life endangerment, or in cases of rape or incest, unless individuals purchase an optional rider at an additional cost.",
    "While the national argument between Pro-Life and Pro-Choice coalitions will continue to rage on -- leading up to and after the U.S. Supreme Court’s decision -- the echo of these opposite convictions is already being heard in Harrisburg.",
    "During the time of The Civil War, southerners asked why northerners should have any say about what is happening in the south, but the fact was that the northerners were saying ‘Slaves are human.’\n“It’s the same thing going on here.",
    "Lindsey Mauldin, the agency’s vice president of advocacy and public policy, said that if Roe v. Wade is overturned by the U.S. Supreme Court, it will have dire consequences for those who now have legal access to these services.",
    "“Regardless of the outcome, life-affirming organizations like Chester County Women’s Services will continue to offer free care to those women contemplating the heart-rending decision to have an abortion,” he said.",
    "“Beyond the abortion debate, Planned Parenthood of Southeastern Pennsylvania is a trusted provider, and we are here to stay, and as long as we can continue to provide those services we will continue to do so.",
    "Further, the issue has become increasingly exacerbated by the rising tenor on both sides of the argument and elevated in volume by the state agencies whose mission it is to share their belief systems.",
    "“It is important to note that in southeastern Pennsylvania these issues that people face when they can’t get access to abortion care often contributes to food and financial security,” Mauldin said.",
    "However, Wolf’s tenure as governor will end in 2023, and while Shapiro is the early Democratic frontrunner to replace Wolf in Harrisburg, he is running against 14 Republican candidates.",
    "“Republican politicians have spent decades trying to dismantle the right to abortion and reproductive health care by passing restrictive abortion bans, including here in Pennsylvania.",
    "“With slavery, we needed to have minds changed in the country, but we also needed to have laws change, and until slavery became illegal, it wasn’t done with,” he said.",
    "“Those Republican candidates for governor who say that they will be the pro-life governor are political stances that are not helpful to Pennsylvanians,” Mauldin said.",
    "“Many people accessing abortion already face barriers and already have to jump through hoops, including a number of barriers to abortion that still exist.",
    "In contrast, the number of abortion clinics in the commonwealth has declined over the years, from 114 in 1982 to 81 in 1992, 20 in 2014, and 18 in 2017.",
    "While the number represents the largest increase in abortion facilities in the U.S. since 2016, the same upward trend is not occurring in Pennsylvania.",
    "Senate Bill 956 is just the latest indicator that the floor on which legal abortion in Pennsylvania has stood for decades has become a shaky one.",
    "· The state requires abortion clinics to meet unnecessary and burdensome standards related to their physical plant, equipment and staffing.",
    "Planned Parenthood of Southeastern Pennsylvania CEO Dayle Steinberg has stated that the agency will continue to support the efforts of Gov.",
    "“We realize that these issues are connected and that people can’t live a full life if they do not have autonomy over their own bodies.",
    "· An abortion may be performed at 24 or more weeks after the last menstrual period only in cases of life or health endangerment.",
    "Wolf and Attorney General Josh Shapiro in their efforts to “protect and expand” existing abortion access in the state.",
    "A recent search of clinics in the state revealed that there are now only 11 – and none located west of State College.",
    "· Abortion is covered in insurance policies for public employees only in cases of life endangerment, rape or incest.",
    "He compared the public debate about abortion to the way Americans began to change their opinion on slavery.",
    "Taking away access will just further add to those barriers and add to people’s ability to access care.",
    "“Does anybody claim that there should be a right to slavery in the United States anymore?” he said.",
    "“The common thinking took a while to come along, and we need to see the same thing with abortion.",
    "· Public funding is available for abortion only in cases of life endangerment, rape or incest.",
    "“That conversation is over, even though people dug in on both sides for a long time.",
    "· The state prohibits abortions performed for the purpose of sex selection.",
    "· The parent of a minor must consent before an abortion is provided.",
    "“Abortion is health care and it must remain safe and legal,” Gov.",
    "The big truth is that abortion is the taking of a human life.",
    "Our patients are not coming to us for political reasons.",
    "“These policies don’t really help people.",
    "Wolf said."
  ]
}