{
  "id": 15238,
  "mediaId": 8254,
  "date": "2022-03-09",
  "headline": "As utility costs rise, Pa. resident’s bills fall due to special programs",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2018/05/ppl_electric_utilities_36770683_ver1.0.jpg?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/as-utility-costs-rise-pa-residents-bills-fall-due-to-special-programs/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Wesser",
  "authorUrl": "https://www.abc27.com/author/james-wesser/",
  "termIds": [
    984,
    6506
  ],
  "sentences": [
    "“I want Pennsylvanians to know that there is help available for everyone and that we are going to do all we can to make sure that these resources remain available to Pennsylvanians over the spring and summer.”\nGet daily news, weather, breaking news, and alerts straight to your inbox!",
    "HARRISBURG, Pa. (WHTM) — On Wednesday, March 9, Attorney General Josh Shapiro and Acting Consumer Advocate Patrick Cicero urged residents who are struggling to pay their utility bills to use programs that provide relief.",
    "The pair also urged the Department of Human Services to use unspent funds for an extension for the annual Low-Income House Energy Assistance Program (LIHEAP) Crisis Season.",
    "“Pennsylvania has hundreds of millions of dollars of LIHEAP funding left, and no eligible Pennsylvanian in need should have their utilities shut off.",
    "”\nThe Bureau of Labor Statistics has shown that the price of electricity in the state has gone up 9% and the price of natural gas is up 20%.",
    "LIHEAP has provided more than 322,000 cash grants and 53,000 crisis grants to residents who needed assistance heating their homes.",
    "On paper: You can download a paper application, print it, fill it out, and return it to your county assistance office.",
    "“I urge DHS to keep the LIHEAP program open for applications until August 31,” said Acting Consumer Advocate Cicero.",
    "However, AG Shapiro and Consumer Advocate Cicero have requested that this deadline be pushed to August 31, 2022.",
    "For more tips on how to save money on utility bills and for more information about LIHEAP, click here.",
    "There are two ways to apply for LIHEAP:\nOnline: Apply for benefits online using COMPASS.",
    "“Energy prices are up this year and will likely keep rising,” said AG Shapiro.",
    "Right now, the LIHEAP program is scheduled to close on May 6, 2022.",
    "Sign up for the abc27 newsletters here.",
    "There is help available."
  ]
}