{
  "id": 15585,
  "mediaId": 6571,
  "date": "2022-03-04",
  "headline": "Judge's Connection To Driller At Issue In Pennsylvania Pollution Case",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2016/01/06/b53fc32f-d8b5-4313-8742-48ed9ef3987c/thumbnail/1200x630/476b1e7e6819be1bcc7d04072e0b7a0c/judge.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/judges-connection-to-driller-at-issue-in-pennsylvania-pollution-case/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "(AP) -- The Pennsylvania attorney general's office indicated it might seek removal of a judge expected to preside over a criminal case in which he has ties to the defendant — the state's biggest gas driller, which is charged with polluting residential water supplies in a community where residents famously were able to light their tap water on fire.",
    "Cabot opposed Legg's recusal and tried to have Castille's report thrown out of court, calling the law firms' efforts to have the judge removed an \"appalling display of judge shopping\" and a \"desperate, last ditch effort\" to avoid having to turn over financial and tax records to Cabot.",
    "\"We are aware of Judge Legg's recusal in the other case and will not hesitate to make that motion at the appropriate time,\" Jacklin Rhoads, spokesperson for Attorney General Josh Shapiro, said in response to questions from The Associated Press.",
    "\"In fact, reasonable minds might even conclude that Cabot Oil is seeking a sympathetic judicial forum ... with a seemingly friendly judicial official (in Cabot's mind) to litigate its multimillion dollar damages claim,\" wrote Castille.",
    "\"Reasonable minds could infer that a board member of a charity (such as Judge Legg) would favor a major charitable donor (here, Cabot Oil) in order to sustain the donor's continuing financial support,\" Castille wrote.",
    "State prosecutors charged Cabot Oil & Gas in 2020 with allowing methane from the company's faulty gas wells to escape into drinking-water aquifers in the rural village of Dimock and nearby communities.",
    "Kemble's former lawyers also solicited a legal opinion from Ron Castille, the retired chief justice of the Pennsylvania Supreme Court, who wrote that Legg should take himself off the case.",
    "Susquehanna County Judge Jason Legg serves on the board of a charitable foundation that has received millions of dollars in corporate donations from Houston-based Cabot.",
    "Prosecutors have said they are seeking to settle with the driller, noting a settlement could yield more significant benefits for affected homeowners than a conviction.",
    "Legg removed himself from that case but, as Susquehanna County's only full-time judge, would normally be expected to preside over the state's criminal prosecution.",
    "Cabot claimed resident Ray Kemble and the law firms sought to attract media attention and \"poison\" the community by recycling \"stale, settled claims\" of pollution.",
    "Because the charity had asked him to quash the subpoena, \"I cannot perform my judicial function ... without creating an appearance of impropriety,\" Legg wrote.",
    "The Administrative Office of Pennsylvania Courts has assigned a retired judge from neighboring Luzerne County to hear the civil matter involving Cabot.",
    "Castille said it's up to the attorney general's office to ask for recusal, or Legg himself could \"evaluate his participation in the criminal case.\"",
    "In December, the law firms asked Legg to recuse himself, citing in part his service on the board of Community Foundation of the Endless Mountains.",
    "Legg's office referred comment to the administrative office overseeing Pennsylvania courts, which said the case has yet to come before the judge.",
    "Cabot, now known as Coterra Energy Inc. after a recent merger, has long denied responsibility for the contamination of Dimock's groundwater.",
    "Cabot recently waived its right to a preliminary hearing, moving the case to county court, but a judge has not been assigned.",
    "\"My expert opinion could be offered as supporting recusal, but it is NOT controlling in a different case,\" he said via email.",
    "Cabot had donated $6.4 million to the charity since 2010, according to records included with the law firms' recusal motion.",
    "In the civil case, Cabot asserts a Dimock resident and his former lawyers tried to extort it through frivolous litigation.",
    "Kemble and his former lawyers say Cabot is targeting them in order to deter residents from suing in the future.",
    "Castille declined comment to AP on whether he believes Legg should now recuse himself from the criminal case.",
    "He also noted that Cabot official George Stark serves on the Community Foundation board alongside Legg.",
    "In a Feb. 10 order, he wrote that Community Foundation had been subpoenaed as part of the civil suit.",
    "The judge's entanglements recently became an issue in an unrelated civil suit involving Cabot.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "The company faces nine felony and six misdemeanor charges.",
    "Legg is Susquehanna County's only full-time judge.",
    "A Cabot executive is also on the board.",
    "(Copyright 2022 The Associated Press.",
    "Legg nevertheless recused himself.",
    "In:\nPennsylvania\nPollution",
    "All rights reserved."
  ]
}