{
  "id": 15634,
  "mediaId": 8271,
  "date": "2022-03-13",
  "headline": "Missing anti-violence money; ‘The Automat’ recalls past dining glory; Meet school superintendent candidates | Sunday roundup",
  "image": "https://billypenn.com/wp-content/uploads/2022/03/sundayroundup-skyline-1200x630.jpg",
  "link": "https://billypenn.com/2022/03/13/sunday-roundup/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Billy Penn Staff",
  "authorUrl": "https://billypenn.com/about/billy-penn-staff/",
  "termIds": [
    4277,
    4492,
    3967,
    5505,
    2234,
    1684,
    3926
  ],
  "sentences": [
    "for Public Art/South Philly Review/phila.gov/Billy Penn]\n• ‘The Automat’ brings dining nostalgia to Philly theaters\nFeaturing interviews with famous fans like Mel Brooks, Ruth Bader Ginsburg, Carl Reiner, and Colin Powell, new documentary “The Automat” is a nostalgia-fueled trip through the rise and fall of former Philly icon Horn & Hardart.",
    "[City & State/NBC News/ABC27]\n• Sides ramp up for Kenyatta Johnson trial\nMore than two years after federal officials filed bribery charges against City Councilmember Kenyatta Johnson and his wife Dawn Chavous, a political consultant and nonprofit founder, the trial is scheduled to finally begin this month.",
    "[Billy Penn]\nVISION: Looking forward to the week ahead\n• Gov candidates face filing deadline\nPa. Attorney General Josh Shapiro is uncontested as the 2022 Democratic candidate for Pa. governor, but the Republican field is still crowded, with no clear leader.",
    "RECAP: Looking back on the week that was\n• Closing arguments in Pa. school funding trial\nClosing arguments wrapped in the monthslong trial over the giant spending gaps between Pa. school districts — some of the largest in the nation.",
    "[WFMZ/WHYY]\n• Trouble getting anti-violence grant money\nPhiladelphia’s homicide rate last year was 35 per 100k residents, outpacing all other large U.S. cities (the closest is Chicago, at 29; then Houston, 21).",
    "[Vital City/6ABC/Billy Penn/WHYY]\n• New Tubman statue will join few monuments to women\nYou can count on one hand the number of Philadelphia statues honoring real women in history, but new ones are on the way.",
    "A tribute to Marian Anderson is coming to the Avenue of the Arts, and last week the Kenney admin announced it commissioned a permanent version of the Harriett Tubman sculpture now visiting City Hall.",
    "[Billy Penn/Chalkbeat/Phila SD]\n• ‘Museum of Illusions’ opens in Philly\nOld City has a new destination as of this weekend: a permanent venue at 4th and Market called the Museum of Illusions.",
    "[KYW/Billy Penn/Billy Penn/Tribune$]\n• Meet the school superintendent candidates\nSuperintendent William Hite steps down in June after 10 years at the helm of Philly schools.",
    "The small space is filled with interactive exhibits made for mind-bending selfies, like pics that show you hanging off a building ledge, or floating in mid-air.",
    "Once the largest restaurant chain in the country, the brand ran dining rooms people recall as simultaneously luxurious and equalizing — like nothing else today.",
    "A moment that stood out to students: when a defense lawyer questioned why someone on the “McDonald’s career track” would need to learn algebra.",
    "Johnson, who’s been raising money for his defense, maintains his innocence and has declined to step back from his role as an elected official.",
    "It’ll likely get slimmed down this week, because March 15 is the deadline to file signature petitions to get on the official primary ballot.",
    "A big part of the city’s anti-violence plan is grants to community orgs, but several recipients say they’re still spending their own money.",
    "This week they introduce themselves to the public with a series of in-person town halls and smaller meetings livestreamed on Facebook.",
    "Three finalists for his replacement were announced Friday, all men with no previous ties to Philadelphia.",
    "A decision on whether the funding formula is unconstitutional isn’t expected until summer.",
    "Sign up for the free Billy Penn newsletter and it’ll land in your inbox.",
    "The crisis continues, as Philly notched its 100th killing last week.",
    "Timed tickets are $20 per adult and $15 per kid.",
    "The film is now showing throughout the region.",
    "Want this weekly digest emailed to you?",
    "[Metro/WHYY/MOI Philly]",
    "[Assoc."
  ]
}