{
  "id": 15890,
  "mediaId": 2564,
  "date": "2022-03-12",
  "headline": "Former Pennsylvania police chief, 30, is found guilty of raping a child HUNDREDS of times when she was six years old and continuing until she was 11 with help from a friend",
  "image": "https://i.dailymail.co.uk/1s/2022/03/12/06/55260679-0-image-a-3_1647066228077.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10604543/Ex-police-chief-guilty-child-rape-reported-2012.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Associated+Press",
  "termIds": [
    0
  ],
  "sentences": [
    "The victim recorded a brief cellphone video of Wagner having her watch pornography 'a few months after the initial complaint was made against Wagner, because nobody believed her and she wanted to show people proof,' Sean McGlinn, an agent with the Pennsylvania attorney general's office, wrote in Getz's arrest affidavit.",
    "Above, a police station in Lehighton, a nearby small town that operates, like Weissport, under Carbon County law enforcement\n+4\nView gallery\nThe victim, who has not been identified, was first abused by Gregory E. Wagner Jr., 31, when she was four and he was 14.",
    "Leslie Slingsby, executive director of Mission Kids Child Advocacy Center in East Norriton, an organization that helps respond when child abuse allegation are made, said the victim 'went through more than she or he ever needed to, absolutely.'",
    "Above, a police car for Lehighton, the nearby town where Getz lives\nA Franklin Township police officer spoke with Wagner in May 2012, but Wagner stopped the interview after a few minutes and obtained a lawyer, according to the affidavit.",
    "In addition to the rape count, the jury found Getz, of Lehighton, guilty Thursday of one count each of involuntary deviate sexual intercourse with a child, aggravated indecent assault of a child and indecent assault of a child under 12.",
    "Pennsylvania enacted drastic changes in handling of child sexual abuse cases in the wake of the Jerry Sandusky child molestation scandal, Slingsby said, 'but it seems like this should have certainly been resolved before that.'",
    "+4\nView gallery\n Brent Robert Getz, 30, was convicted of child rape and other crimes on Thursday\n+4\nView gallery\nGets was a police chief in Weissport, a town of 413 residents, until he was fired in 2019 after his arrest.",
    "In September 2018, the Carbon County district attorney's office referred the matter to the attorney general's office regarding Getz, and in January 2019 regarding Wagner, according to the charging affidavit.",
    "'These are cases that are heartbreaking because it has taken this child so long to get justice as well as for this child to ensure they were safe, for children in the community to be safe,' Slingsby said.",
    "A Franklin Township officer 'revisited' the case in 2018, at which time the victim revealed that Getz, a friend of Wagner's, also had sexually assaulted her, the attorney general's office has said.",
    "Three years later, in 2015, a criminal complaint was prepared against Wagner but was dismissed by a district judge because of what the attorney general's office has described as a paperwork error.",
    "+4\nView gallery\nAuthorities first interviewed Wagner, the first perpetrator, in 2012, but he didn't plead guilty until 2020 as the case languished during the investigation phase.",
    "A former small-town Pennsylvania police chief has been convicted of raping a child in a case that has languished for years after the victim first came forward in 2012.",
    "According to Getz's 2019 arrest affidavit, the victim told a substitute teacher at her elementary school in early 2012, when she was 11, that Wagner had raped her.",
    "'The defendants terrorized this young victim by assaulting her hundreds of times over seven years,' Attorney General Josh Shapiro said at the time.",
    "After his 2019 arrest, Getz was fired from his job as police chief in Weissport, a town of 413 residents about 77 miles northwest of Philadelphia.",
    "She said both men had sexually assaulted her hundreds of times, several times a week for about seven years, according to the arrest affidavit.",
    "The victim of former Weissport police chief Brent Robert Getz, 30, said that he began abusing her when she was six years old and he was 16.",
    "Getz joined in two years later, when he was 16 and the victim was 6\nA message seeking comment was left for his lawyer, Brian J. Collins.",
    "More than a year later, in June 2013, the same officer again questioned Wagner, this time with his lawyer present, the affidavit said.",
    "The Carbon County child welfare agency became involved, and the victim was interviewed by a child advocacy center in Scranton.",
    "At one point, she recorded a video of Wagner forcing her to her watch pornography because nobody believed her.",
    "The girl first told her elementary school substitute teacher that Gregory E. Wagner Jr., 31, had raped her.",
    "Co-defendant Wagner Jr. pleaded guilty to child rape in November 2020 and agreed to testify against Getz.",
    "Franklin Township Police Chief Jason Doll declined to comment, referring questions to state prosecutors.",
    "She said that two years after the assault began, when she was 6, Getz joined in, according to WFMZ.",
    "A nurse concluded the child's symptoms and accounts were consistent with sexual abuse.",
    "Getz and Wagner raped her in Wagner's room while pornography played, the victim said.",
    "Wagner confessed in March 2019 to sexual assault of the child and implicated Getz.",
    "That's when the victim revealed that Getz, Wagner's friend, had also participated.",
    "She said it happened hundreds of times, several times a week, until she was 11.",
    "Both men, who were adolescents when the abuse began, await sentencing.",
    "Authorities have not described the girl's relationship to Wagner.",
    "Wagner would also make her watch porn depicting teens with him.",
    "His bail was immediately revoked and he was taken to jail.",
    "That abuse began when she was four and Wagner was 14.",
    "Wagner denied allegations and no charges were filed.",
    "Getz would have been around 16 years old.",
    "Police revisited the case in 2018.",
    "He has not yet been sentenced.",
    "Wagner later implicated Getz."
  ]
}