{
  "id": 15958,
  "mediaId": 8483,
  "date": "2022-03-10",
  "headline": "As gas prices rise, drivers wonder: Is it price gouging?",
  "image": "https://kubrick.htvapps.com/vidthumb/images/gas-pump-1637619491.jpg?crop=1xw:1xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/as-gas-prices-rise-pennsylvania-drivers-wonder-is-it-price-gouging/39400418",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Roche",
  "authorUrl": "https://www.wgal.com/news-team/4f5c2ac9-974d-460c-8618-1fcbb388c0f8",
  "termIds": [
    0
  ],
  "sentences": [
    "\"I'm actually prohibited from looking into price gouging based on its legal definition in times where there is not an emergency declaration in place,\" he said.",
    "When an emergency declaration was in place during the height of the COVID-19 pandemic, Shapiro said his office was able to get money back for consumers.",
    "Attorney General Josh Shapiro said unless there's an emergency declaration in place – and right now, there's not – his hands are tied.",
    "\"It's a 20% increase based on the seven-day average prior to the announcement of a declaration of an emergency,\" Shapiro said.",
    "To be clear, there is no emergency declaration in effect in Pennsylvania, so price gouging complaints cannot be investigated.",
    "President Joe Biden has expressed concerns about oil companies using the war in Ukraine as an excuse to gouge consumers.",
    "I think the good people of Pennsylvania deserve to know that someone is looking out for that legally,\" Shapiro said.",
    "When that disaster declaration ended, the authority of his office to investigate price gouging also ended.",
    "Price gouging complaints are investigated by the Pennsylvania attorney general's office.",
    "With gas prices going so high so quickly, drivers may be wondering about price gouging.",
    "Tom Wolf, other state leaders call on Congress to suspend federal gas tax",
    "But if you'd still like to file a complaint, go to attorneygeneral.gov.",
    "And what's the definition of price gouging?",
    "\"I'd like to get that authority back.",
    "Gov."
  ]
}