{
  "id": 18689,
  "mediaId": 8446,
  "date": "2022-01-06",
  "headline": "Susquehanna County joins opioid settlement",
  "image": "http://www.greenstreetdata.com/PS/siw/files/2020/07/courthouse.jpg",
  "link": "http://www.susqcoindy.com/PS/2022/01/06/susquehanna-county-joins-opioid-settlement/",
  "mediaOutlet": "Susquehanna Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "In addition to Susquehanna County, the following counties have joined the settlement agreement: Adams, Allegheny, Armstrong, Beaver, Bedford, Berks, Bradford, Bucks, Butler, Cambria, Cameron, Carbon, Chester, Clarion, Clearfield, Clinton, Dauphin, Delaware, Elk, Erie, Fayette, Franklin, Greene, Huntingdon, Indiana, Jefferson, Juniata, Lackawanna, Lancaster, Lawrence, Lebanon, Luzerne, McKean, Mercer, Mifflin, Monroe, Montgomery, Montour, Perry, Potter, Schuylkill, Snyder, Tioga, Union, Warren, Washington, Wayne, Westmoreland, and York.",
    "These funds will be earmarked to offer and expand life-saving treatment options, prioritizing the areas that have been most affected by this crisis.”\n\nIt will be up to the county to decide where the settlement funds will be allocated, but the agreement stipulates that every dollar of the funding must be used to combat the opioid crisis.",
    "The $26 billion global settlement with Cardinal, McKesson, and AmerisourceBergen — the nation’s three major pharmaceutical distributors —and Johnson & Johnson requires significant industry changes that will help prevent this type of crisis from happening again in addition to the funds, stated Shapiro in a release issued last week.",
    "The board approved a memorandum of understanding with Teamsters Local 229, representing employees at the Susquehanna County Correctional Facility for a one-time redemption of unused personal time in 2021 to be paid in the first pay period of the current year.",
    "Abigail Cook, of Montrose, and Christopher Glinton, of Forest City, were appointed to serve as trustees to the Susquehanna County Historical Society & Free Library Association board of directors, effective Jan. 1 through Dec. 31.",
    "This settlement is going to provide resources to jumpstart programs that will change lives and impact families across our Commonwealth who are struggling to find treatment and help for those suffering with substance abuse.",
    "The salary board also set the 2022 Miscellaneous Compensation Schedule, which sets the allocated rate of pay for various expenses, including election officers, jurors, and row office solicitors.",
    "The commissioners approved a resolution authorizing the county to enter into settlement agreements in the Opioid Misuse and Addiction Abatement Trust at their Wednesday, Dec. 22, 2021 meeting.",
    "Susquehanna County is among 50 Pennsylvania counties to join an opioid settlement that will bring up to $232 million to the state this year and more than $1 billion over the next 18 years.",
    "The commissioners approved an amendment of the contract with Pictometry International Corp. to proceed with the scheduled fly-overs, pursuant to weather condition approval by the county.",
    "Ten Tax Claim Bureau exoneration requests – all located in Bridgewater Township and for mobile homes that had been removed or demolished – were approved by the commissioners.",
    "The salary board also convened, approving the extension of two part-time file clerk positions in the Clerk of Courts/Prothonotary’s office through Dec. 31.",
    "The commissioners capped off the year’s final meeting by approving several change orders for the public safety facility construction project.",
    "The street – located on the east side of the Green in Montrose – is one of the few roadways owned and maintained by the county.",
    "In July 2021, PA Attorney General Josh Shapiro announced the settlement that had been negotiated with pharmaceutical companies.",
    "Key strategies include funding for treatment and prevention detailed in the settlement’s list of opioid remediation uses.",
    "Shapiro said, “Pennsylvania lost 5,172 lives to overdoses in the last year alone, which is 14 Pennsylvanians a day.",
    "Pictometry International uses three-dimensional aerial photographs to obtain high resolution images of buildings.",
    "A change order, in the amount of $53,380.85, was also approved for pavement and drain tile on Monument Street."
  ]
}