{
  "id": 1876,
  "mediaId": 6571,
  "date": "2022-02-08",
  "headline": "Leak Leaves Manor Township With 1-Day Supply Of Water",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/02/08/9d1336d2-1e40-47e7-8704-cd28168bd2c4/thumbnail/1200x630/a770b15a11e0777149639d165ea5f941/manor-township-water-treatment-plant.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/leak-leaves-manor-township-with-1-day-supply-of-water/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3455,
    4764,
    690,
    6357
  ],
  "sentences": [
    "According to the Manor Township Joint Municipal Authority website, its water system serves approximately 7,731 people including residents in Manor, Bethel, Kittanning, Rayburn and Valley townships and Ford Cliff and Manorville boroughs.",
    "\"We had gotten a phone call that the water level was very critical and we had to conserve water and that they were not very sure where it's at,\" resident Kendra Moorehead said.",
    "MANOR TOWNSHIP, Pa. (KDKA) - A water conservation alert was sent out to residents in Manor Township, Armstrong County after a water main break earlier this week.",
    "Local fire departments have also been made aware that tankers would need to come in as the hydrants in the area would not be enough to support a large fire.",
    "We are prepared if we can't find the leak to isolate the area where we think it is and get the tank back in full capacity,\" Kanish said.",
    "Grant Kanish, the chairman on the Water Authority's board of directors said the water tank normally has a three-day supply of water.",
    "According to the Manor Township Water Authority, all residents still have water, but the supply is very low.",
    "In the meantime, some local car washes were told to temporarily shut down in order to save water.",
    "He said currently, it is one-third full, which is equivalent to enough water for one day.",
    "\"Like, if we have no water then that means no water is going into the fire hydrants.\"",
    "\"Yesterday, it lost 500,000 gallons of water,\" Kanish told KDKA over the phone.",
    "UPDATE: The Water Authority has found the leak but is still looking for more.",
    "The Water Authority hired a professional company to help look for the leak.",
    "Residents should continue to conserve water until the leak is fixed.",
    "Kanish said the township has 98 miles of water lines in its system.",
    "\"I would certainly be scared if there was a fire,\" Moorehead said.",
    "As of Wednesday, residents should still conserve water.",
    "\"The public does not have to panic.",
    "In:\nArmstrong County"
  ]
}