{
  "id": 2128,
  "mediaId": 8409,
  "date": "2022-02-05",
  "headline": "The Mercury’s Sound Off for Saturday, February 5",
  "image": "https://www.pottsmerc.com/wp-content/uploads/2021/09/mercfall.jpeg",
  "link": "https://www.pottsmerc.com/2022/02/05/the-mercurys-sound-off-for-saturday-february-5/",
  "mediaOutlet": "phoenixvillenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "For Medianews Group",
  "authorUrl": "https://www.pottsmerc.com/author/for-medianews-group/",
  "termIds": [
    0
  ],
  "sentences": [
    "Even though the questions he fielded were softballs from his apologist news corps, the consensus is Biden came across as confused, unable to maintain a steady stream of thought, and deliberately evasive in answering what should have been anticipated questions about everything from his obviously diminished cognitive health, inability to deliver on campaign promises, crisis-causing policies, partisan divisiveness, absentee leadership, etc.",
    "Confused Melissa\nTo the anonymous person that responded to my VAERS facts, searched all years for COVID 19 vaccines and came up with slightly over 9,000 deaths ad this disclaimer Note: Submitting a report to VAERS does not mean that healthcare personnel or the vaccine caused or contributed to the adverse event (possible side effect).",
    "S. Light\nAnti Vaxer: The Vaccine Adverse Event Reporting System (VAERS) Page 1 of their website: “Key considerations and limitations of VAERS data: Reports may include incomplete, inaccurate, coincidental and unverified information.”\nRecently, Biden did his first extended press conference.",
    "JB in Limerick\nAnthony Maida, a teacher in Eagleville, Pa. who is also a former Marine, says it’s clear to him that what happened that day wasn’t simply a protest or demonstration, but an insurrection, and he’s not afraid to say so in class.",
    "Most Popular\nEastern Berks township requiring residents to pay for tree removal on their properties\nMorning Briefing: 12-year old child dead in murder-suicide; Another community hospital may be closing; Bad signs for 76ers after loss",
    "Bob from Boyertown\nOh, Angry Guy, Angry Guy, I’m sure it is no fun not to be taken seriously, but faced with this “forum” that values intensity and crudity of opinion so much more than actual discussion, I just can’t help myself.",
    "Patriot45\nEven the liberal pundits at the Associated Press (forever masquerading as journalists) can no longer deny what a catastrophic mistake it was to help get Biden/Harris elected into the White House.",
    "I bet there are a few over AP‘s Conservative-Haters clubhouse that wishes they would have had the cajoles to buck the DNC and report on the Hunter Biden Laptop scandal leading up to the election.",
    "would be upset if Sound Off decided to print only the letters of race and sex opposite/different from theirs, like their hero is doing for nominees for the open seat on the Supreme Court.",
    "The disrespect for officers is a direct result of despicable politicians like Chrissy Houlahan, Madeleine Dean, Josh Shapiro, and Kamala Harris who take the side of criminals.",
    "The military can’t do anything right from the withdrawal from Afghanistan to the loss of our most advanced fighter plane (F35C Lightning II) in the South China Sea.",
    "It isn’t just the cops that are killed, it is the one’s sucker-punched, or hurt during a scuffle, or kicked, or hit by cars trying to flee a traffic stop.",
    "John Kerry and the Biden administration plan to use the UN to craft another Iranian Nuclear deal and to again bypass the United States Senate’s approval.",
    "Meanwhile, the USA is being invaded by hundreds of thousands of people from all over the world, and Chrissy and her fellow Democrats could care less.",
    "If I look at Jan. 6 and take an apolitical stance, that signals I’m OK with it … and I’m not.”\nPatriot54\nPrepare for the next right-wing meltdown.",
    "MendaciousD\nThe instinctive psychological defense against a looming catastrophe like a rapidly warming planet is first denial and then deflection.",
    "“It’s not true, and dark forces — like “liberal elites” are just making it up to vex and exploit us.” That’s OK. I’m not trying to convert anyone.",
    "Kristin Reams\nHow many people were conned by Pfizer’s Relative Risk Reduction (RRR) numbers of 95% into thinking that the 95% was 95% protection?",
    "Donald Trump announced on Saturday (1-29-22) that anyone convicted of the sedition conspiracy will be pardoned when he becomes president in 2024.",
    "When asked about the dismal polling, Jurassic Joe responded “I don’t believe in polls.” That may be true, but it’s a sure bet his handlers do.",
    "So while about 3,000 people died from Covid yesterday, Biden cut off monoclonal antibodies to patients, and inflation continued to rage.",
    "Jim Dandy\nMitch McConnell and the rest of the Republicans are saying the nominee for Supreme Court is not qualified no matter who it is.",
    "Good to know that Congresswoman Chrissy Houlahan is traveling to Eastern Europe to see how the USA can prevent the invasion of Ukraine.",
    "Butch\nThe Biden administration reportedly released $18 Million of frozen funds so Iran could pay their dues to the United Nations.",
    "Michael Stern\nYesterday we found out that busloads of male illegal immigrants were being followed to Federal offices in Texas.",
    "Freedom Fighter, please enlighten us as to the Biden family corruption that hasn’t already been investigated and debunked.",
    "Grant W.\nCanadian truckers and farmers have closed down the capital of Ottawa in protest of mandatory COVID vaccinations.",
    "If I were a betting man, I would bet he changes party affiliation if the GOP claims Senate control in the next election.",
    "Dan Fields\nI heard the gnashing of teeth when Rachel Maddow announced she would be taking a hiatus from her MSNBC show.",
    "One of the only differences is that Jimmy Carter was a nice, smart man while Joe Biden is a mean-spirited, dim bulb.",
    "We will forever be caught in this ridiculous back-and-forth until Congress passes a set of basic voting protections.",
    "Freddy\nOne thing the tiresome back-and-forth on Sound Off makes abundantly clear, we need national election laws.",
    "As to the Senate, while they have nominal control, I would posit Joe Manchin is a “DINO” (Democrat In Name Only).",
    "Where are Patriot54, Lefty, and David M., going to get their Sound Off talking points for the next month or two?",
    "We will not publish comments that are potentially libelous, slanderous, mean-spirited, vulgar or inappropriate.",
    "For “the good of the party,” they’ll disallow him to run again and possibly force him to resign prior to 2024.",
    "Robert Minninger\nSam Tasik, in 2016 I stood in line, in the cold, for over two hours to vote in person.",
    "Somehow ARR never appeared on all the gobbledegook that was pushed to enlist the suckers to get jabbed.",
    "Truth Be Told\nWe the people of … a phrase everyone should know, if not they do not belong in America.",
    "The Moderate\nDay after day my heart breaks for police officers hurt, maimed, or killed while on duty.",
    "Now he wants his supporters to bear arms and rally against any investigation against his sort.",
    "That’s right Joe Biden is sending you test kits for covid that are stamped with Made in China.",
    "But he is not so popular in Iowa, the south, or pretty much any place outside a major US city.",
    "From the look of things, ain’t too many people still “Ridin’ With Biden.” And for good reason.",
    "This is unconstitutional, but President Obama did it, so Biden plans to take the same route.",
    "I need a Real ID or a passport to get on a jet, but all illegals need is an arrest warrant.",
    "She will automatically be head and shoulders more qualified than the last three losers.",
    "He browsed through some women’s blouses and managed to buy a Kamala Harris coffee mug.",
    "Savonarola\nFifty-six percent disapprove of Sloppy Joe’s handling his job as president.",
    "Nathan\nMade in China is going to show up in your home courtesy of the US Government.",
    "Joe Biden is going to nominate a Black woman as a candidate for the Supreme Court.",
    "Actual protection was .84% (less than 1%) which is Absolute Risk Reduction (ARR).",
    "Sweater Boy\nPresident Biden promised that he would unite us Americans and he has.",
    "Jim Fitch\nSound Off is an opinion forum for readers to comment on today’s news.",
    "Publication of Sound Off submissions is at the sole discretion of the editor.",
    "There is still the question of whether the GOP is doing anything about Covid.",
    "Then there is the inflation which Jimmy Carter and Joe Biden brought about.",
    "MC923\nJoe Biden’s administration is reminiscent of the Jimmy Carter years.",
    "Towing companies have refused to tow them as requested by law enforcement.",
    "In 2020 I stood in line five seconds to put my legal ballot in a dropbox.",
    "Night Light\nPresident Joe Biden is making his big tech supporters happy.",
    "Submissions are subject to editing and must be under 75 words in length.",
    "Jay Miller\nI guess the expense for lawyers is getting high for con Don.",
    "Downtowner\nThe left screamed for four years that Trump was a dictator.",
    "Lefty, Patriot54 and David M probably don’t believe it’s happening.",
    "Butch, I show my ID every time I vote, but not my vax card, ever.",
    "Missy Miss\nJust wondering if Patriot 54, Jay Miller, Lefty, etc.",
    "It will be traumatic for our crazy patriots but that’s progress.",
    "China gave us this virus and now they are getting rich from it.",
    "Then those male illegals left with arrest warrants to airports.",
    "Why would Biden be so generous to a state sponsor of terrorism?",
    "Others will see it too and the two-party system will fall away.",
    "A majority of us agree that we don.t like him as our President!",
    "Yet, the Supreme Court just had to stop Biden from being one.",
    "I am not seeing this on any of the lamestream news agencies.",
    "The illegals used the arrest warrants as IDs to board jets.",
    "When will a GOP member of Congress stand up and say enough!",
    "It’s a dirty and thankless job, but someone has to do it.",
    "Two million-plus illegals plus entered the USA last year.",
    "With sagging ratings, perhaps a break is what she needs.",
    "No trips to Texas, Arizona, New Mexico, or California.",
    "The majority of democrats (62%) want him to step down.",
    "Must use “Sound Off” in the subject line of the email.",
    "Would you have fallen for .84 had you known the truth?",
    "I am a registered Republican just not a Trumpublican.",
    "Trump’s picks were terrible and that’s not debatable.",
    "They don’t control the Supreme Court or many states.",
    "Your fighting has made me drop my party affiliation.",
    "David M.\nYesterday, Joe Biden had a very busy day.",
    "The earth, like God, doesn’t care what we believe.",
    "But being apolitical is a political choice, right?",
    "It’s embarrassing to see the wasted energy here.",
    "The GOP needs to consider impeaching sleepy joe.",
    "Lefty\nTrue, the Dems control the WH and House.",
    "He went shopping at a Capitol Hill Gift Shop.",
    "Email your comment to letters@pottsmerc.com.",
    "Americans are suffering those consequences.",
    "72% don’t want him to run for re-election.",
    "It was certainly promoted 24 hours a day.",
    "Illegals have more rights than citizens.",
    "Conservatives be crying, right Stern?",
    "This failure is enough to impeach.",
    "Then he bought an ice cream cone.",
    "Joe is popular in Silicon Valley.",
    "“They want you to be apolitical.",
    "I preferred the 2020 method.",
    "Remember it’s we, not me.",
    "He is not up to the job.",
    "Read all of my letters.",
    "A sad sight to behold.",
    "But I am confused.",
    "What a great guy.",
    "81 million votes?",
    "Dems be tripp’n!",
    "Just ridiculous.",
    "Disgusting!",
    "A new low.",
    "Malarkey!",
    "Wow.",
    "Hmm."
  ]
}