{
  "id": 2241,
  "mediaId": 2693,
  "date": "2022-02-08",
  "headline": "The RNC Censures Cheney, Kinzinger",
  "image": "https://149366087.v2.pressablecdn.com/wp-content/themes/spectator/imgs/favicon.ico",
  "link": "https://spectator.org/the-rnc-censures-cheney-kinzinger/",
  "mediaOutlet": "The American Spectator",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeffrey Lord",
  "authorUrl": "https://spectator.org/author/jlord/",
  "termIds": [
    0
  ],
  "sentences": [
    "The censure resolution says that the two have deliberately signed on to the January 6 Committee’s “disregard for minority rights, traditional checks and balances, due process, and adherence to other precedent and rules of the U.S. House” and “are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse, and they are both utilizing their past professed political affiliation to mask Democrat abuse of prosecutorial power for partisan purposes.”\nOr, to put more bluntly, what Cheney and Kinzinger are about is participating in a decidedly partisan political lynch mob that is as anti-constitutional and thoroughly corrupt as it can get.",
    "Over there at the Wall Street Journal, our friends on the editorial board have not only praised the former vice president’s actions, they write this:\nThe Members [of Congress who want to rewrite the Electoral Count Act of 1887] want to make sure that no one can pull Mr. Trump’s stunt again and misread the Electoral Count Act to use Congress and the Vice President to overturn an election despite losing in November.",
    "As my colleague Melissa Mackenzie has said, the committee, aided and abetted by Cheney, has issued subpoenas to “100-plus citizens” that “have been named in subpoenas given to AT&T, Verizon, Sprint, T-Mobile.”\nMelissa writes:\nThe subpoenas include all individuals on the subscriber’s account and everyone those people messaged or spoke to.",
    "A mistake, and worse, a shame.”\nAs someone who had a literal front-row seat at the White House rally on January 6 but did not go to the Capitol, I saw firsthand that the protests were utterly peaceful, 110 percent peaceful, with my own video of attendees dancing and singing to the rock music blaring from the loud speakers.",
    "As Mollie Hemingway summarized in her book Rigged: How the Media, Big Tech and Democrats Seized Our Elections Republican poll watchers were prevented from watching the vote counting and some $35 million from Mark Zuckerberg’s “Zuck Bucks” flowed into the state to arrange early voting for the 2020 election.",
    "Laughably, Cheney and Kinzinger issued these statements:\nCheney: “I’m a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.”\nKinzinger: “I am now even more committed to fighting conspiracies and lies.”\nHello?",
    "There were tens of thousands of peaceful protestors, all urged directly by President Donald Trump to protest “peacefully and patriotically.” That a relative handful did not must not be allowed to tar the tens of thousands — say again tens of thousands — who did exactly that.",
    "Cheney and Kinzinger are hardly out to “seek truth.” They are out to conduct and participate in a political lynching of Donald Trump and his decidedly patriotic followers, seizing private phone records, squelching the First Amendment rights of media personalities, and more.",
    "Democratic Attorney General Josh Shapiro also said in October 2020 that observing ballot boxes was “voter intimidation.” Pennsylvania mail-in voters are required to “sign and date a declaration on the outside of the (mail-in ballot) envelope….",
    "And for Kinzinger to say he is “even more committed to fighting conspiracies and lies” — when he himself is out there pushing repeated conspiracies and lies — is as disturbing as it is despicable.",
    "This is tens of thousands of moms, children, clergy, reporters, and Republican and conservative influencers who were in touch with everyone from White House aides to prominent activists.",
    "The time frame the committee demands data on is far-reaching: any and all contact with the individual for two to three months prior to January 6 and all the way to January 31, 2021.",
    "Then there’s Utah’s “Republican” Sen. Mitt Romney, who said that “shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol….",
    "In a mind-boggling moment for a conservative journal, the magazine’s editors say this: “The RNC bought the entire party a bounty of bad headlines and easy attack ads.",
    "They are drunk on power and should not simply be censured but removed from Congress — the latter already on track to occur by their home constituents.",
    "As a result, Republican legislators in Pennsylvania are working to pass a bill that would make private funding of election operations illegal.",
    "So the news arrives that the Republican National Committee has censured Republican Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Nothing could be more anti-constitutional than this — and it is Cheney who is aiding and abetting this decidedly anti-constitutional rampage.",
    "Failure to do any of these things is supposed to cause a rejection…” And yet, ballots with mismatched signatures were accepted.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.”\nHello?",
    "It did so for no good purpose, and its action will only encourage those who see riots as legitimate political discourse.",
    "There is a need to point out that my home state of Pennsylvania has repeatedly had to deal with voter fraud.",
    "What they and the January 6 Committee are about is seriously anti-constitutional and decidedly corrupt.",
    "Then there’s the situation with former Vice President Mike Pence, who defends his actions on January 6.",
    "The political lynch mob that is the January 6 Committee is itself decidedly anti-constitutional.",
    "In short, the RNC did exactly the right thing in censuring Cheney and Kinzinger.",
    "Cheney and Kinzinger also insist that voter fraud be ignored.",
    "Then there’s our friends over there at National Review.",
    "On and on and on go these decidedly real episodes.",
    "Election integrity counts.",
    "Good for the RNC."
  ]
}