{
  "id": 2343,
  "mediaId": 2658,
  "date": "2022-02-05",
  "headline": "GOP takes mail voting to court in swing states Biden won",
  "image": "https://static.politico.com/4e/4f/9c716e59469ab9cfe00bfd9caa1c/mail-in-voting-pennsylvania-53062.jpg",
  "link": "https://www.politico.com/news/2022/02/05/mail-voting-on-trial-battleground-states-00005794",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Election administrators need certainty more than anything else, regardless of what the law is.”\nSchmidt, a Republican who was attacked in 2020 for defending the legitimacy of the election, said the fight over Act 77 was derailing efforts to make much-needed improvements to the law, like allowing pre-processing of ballots so they can be counted faster on election night.",
    "Schmidt said they were being held up by state lawmakers who are trying to tie what should be bipartisan improvements to ideas that “are significantly more controversial.”\nThe case in Wisconsin — brought by the conservative Wisconsin Institute for Law & Liberty challenging the legality of drop boxes in the state — is also progressing speedily ahead of spring elections.",
    "But the bulk of their jurisprudence over the past five years … has been to empower voters and give full effect to state constitutional protections regarding voting.”\nGreg Teufel, an attorney representing the Republican state lawmakers challenging Act 77, said the case was not seeking to overturn any past election.",
    "And the litigation highlights how state Republicans have attacked voting by mail from all angles since 2020, from high-profile state legislation in Georgia, Texas and other states to court fights that, if successful, would have more far-reaching consequences than GOP legislators achieved.",
    "| Matt Slocum/AP Photo\nBy Zach Montellaro\n 02/05/2022 07:00 AM EST\nA pair of looming state court cases could significantly curtail mail voting ahead of the midterms — one of Republicans’ major goals since former President Donald Trump went to war against the practice in 2020.",
    "And Esenberg contends that his organization’s case was not on the “merits of whether or not you should have drop boxes,” but that these are “quite clearly not provided for” in state law — which the state elections commission and other defendants dispute.",
    "But a final ruling overturning Pennsylvania’s new voting law would arguably be the biggest change in election law since the presidential election: More than 2.6 million people there — nearly two-thirds of them registered Democrats, according to the U.S.",
    "The state Supreme Court dismissed the case, citing the legal doctrine of “laches” — that the challenge was not brought in a timely manner — and arguing that a favorable ruling for Kelly and the others would disenfranchise millions of Pennsylvanians.",
    "“All this takes many weeks and months to prepare for,” said Al Schmidt, a former Philadelphia elections official who is now the president and CEO of the good governance group Committee of Seventy, which supports mail voting in the state.",
    "“That’ll be their discretion whether to accept this case or not, but we’re hopeful.”\nBonner was not among the group of lawmakers to previously vote for Act 77, having taken office in March of 2020 after winning a special election.",
    "“They also didn’t know that the Pennsylvania Supreme Court would reinterpret the law in various ways.”\nThe challengers are already signaling the state Supreme Court may not be their last stop if they get an unfavorable ruling.",
    "A lower court ruling last week agreed that it was unconstitutional — a decision immediately appealed by Wolf and state Attorney General Josh Shapiro, the likely Democratic nominee to succeed the term-limited Wolf as governor.",
    "“If widespread mail-in balloting is unconstitutional in Pennsylvania now, how could mail-in balloting have been constitutional in the RIGGED 2020 Presidential Election then?” Trump asked in a statement after the ruling.",
    "Teufel was also the attorney for a case brought shortly after the 2020 election by GOP Rep. Mike Kelly and Trump ally Sean Parnell, among others, arguing that mail-in voting in the state was unconstitutional.",
    "The litigation has created significant uncertainty for election officials in Pennsylvania, which already is looking at the potential of a delayed primary due to the battle over the state’s political lines.",
    "“Realistically, it may be a divided court and if it is, he is often the swing justice.”\nHagedorn and the three liberal-leaning judges voted to keep the stay in place through the upcoming primary.",
    "The case actually consolidated two suits against the law, one from a member of a county board of commissioners and one from state lawmakers — including some Republicans who voted for the bill.",
    "“We are anticipating — if we do lose — that we would request the [U.S.] Supreme Court to hear the case,” said Republican state Rep. Timothy Bonner, one of the lawmakers challenging the case.",
    "A court filing from the Wisconsin Elections Commission said that there were at least 570 drop boxes in use across the state during the spring 2021 election, in 66 of the state’s 72 counties.",
    "While the case progressed, some Republican lawmakers quietly began working on election law changes that would have included some level of explicit authorization for drop boxes in some form.",
    "But Trump’s celebration may be premature: The case now heads to a state Supreme Court with a 5-2 liberal majority, which has generally issued rulings upholding the state’s election laws.",
    "The attorneys bringing the suit have argued that provisions in the state constitution require people to vote in person except under a very specific set of enumerated circumstances.",
    "Trump has attacked mail voting both before and since his loss two years ago, turning the Republican Party sharply against a practice that previously had broad bipartisan usage.",
    "The Pennsylvania case is challenging against Act 77, a bipartisan law passed in 2019 that eliminated straight-ticket voting and allowed no-excuse mail balloting in the state.",
    "Trump cheered on the efforts in Pennsylvania, using the decision to advance his lies about widespread election fraud as well as his attempts to overturn the 2020 election.",
    "Defenders of the law say it is well within constitutional bounds, pointing at a different provision in the state constitution that they argue grants wider latitude.",
    "The state election commission deadlocked on repealing their guidance around drop boxes, which left them unchanged from the now-challenged order in the state.",
    "“Some RINO Republicans in Wisconsin are working hand in hand with others to have drop boxes again placed in Wisconsin,” Trump said in a statement last week.",
    "Since both Pennsylvania and Wisconsin have Democratic governors, lawsuits were the only option for Republicans seeking changes to mail voting procedures.",
    "Chester County election workers process mail-in and absentee ballots for the 2020 general election in the at West Chester University in Pennsylvania.",
    "Teufel called it an “interesting aside” that some of his Republican clients voted for Act 77, but he said it wasn’t “legally relevant” to the case.",
    "“We’ve tended to have 4-3 splits in cases like that,” said Rick Esenberg, the president and general counsel of WILL, which brought the challenge.",
    "In Pennsylvania, the legal challenge went bigger, throwing out the state’s relatively new law allowing anyone to vote by mail without an excuse.",
    "But a state appeals court quickly stayed the order, and the state Supreme Court agreed on a 4-3 basis to maintain that stay but hear the case.",
    "“We’re simply saying that the Pennsylvania Constitution requires in-person voting except under limited, specified circumstances,” he said.",
    "The state Supreme Courts in Pennsylvania and Wisconsin are both hearing major voting cases after conservative victories in lower courts.",
    "Conspiracy theories about mail voting have formed the basis of Trump’s efforts to cast doubt on his election defeat.",
    "He argued that such a significant change to state election laws needed to be made via constitutional amendment.",
    "Tom Wolf] would never” repeal mail voting, said Adam Bonin, a Democratic election attorney in Pennsylvania.",
    "In Wisconsin, a judge in January ruled in favor of banning drop boxes for the return of absentee ballots.",
    "There, a state trial court granted an order banning drop boxes with a mid-February local primary looming.",
    "Judge Brian Hagedorn, who was elected with GOP support in 2019, will likely be the key vote in the case.",
    "“They have not in every possible case ruled in favor of the voting rights side and against Republicans.",
    "The case tried to block the certification of the election for the presidency and other federal offices.",
    "It passed with overwhelming Republican support in the legislature at the time and was signed by Wolf.",
    "The turn happened just as voting by mail hit record highs amid the coronavirus pandemic.",
    "“I would hope that the Supreme Court is going to overturn this decision,” said Bonin.",
    "Both lower court rulings were put on hold during the state Supreme Court appeals.",
    "“Drop boxes are only good for Democrats and cheating, not good for Republicans.”",
    "Trump has involved himself in the battle over drop boxes in Wisconsin, as well.",
    "“They didn’t know it was unconstitutional when they voted on it,” he said.",
    "Drop boxes were in heavy use in the state over the last two elections.",
    "“It is significant and shouldn’t ever wait until the last minute.",
    "In the state, conservatives hold a 4-3 majority on the court.",
    "The U.S. Supreme Court also eventually turned that case away.",
    "“This is the only way it could play out, because [Gov.",
    "Elections Project — cast ballots by mail in 2020.",
    "In the interim, drop boxes will remain in use.",
    "That attempt was blown up by Trump from afar."
  ]
}