{
  "id": 2494,
  "mediaId": 8481,
  "date": "2022-02-06",
  "headline": "Philly, Pittsburgh DAs lose round in opioid settlement suit",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/02/fe690c5aaffa4f0f8eef3f0220349820.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/news/regional-news/philly-pittsburgh-das-lose-round-in-opioid-settlement-suit/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.wearecentralpa.com/author/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It is a fundamental sellout of places like Allegheny County, Philadelphia County, where we have an astronomical number people dying of fatal overdoses every single year.”\nShapiro, who has accused Krasner of misrepresenting the national settlement, said it would jump-start funding for treatment in communities ravaged by the epidemic.",
    "“Unless and until” the agreement is ratified and affects “the DAs’ rights in a substantial and concrete manner, any opinion that this court would issue at this stage of the proceedings would be an impermissible advisory opinion,” said the ruling by Judge Michael Wojcik.",
    "The district attorneys for Philadelphia and Allegheny County have lost a round in their legal challenge of the $26 billion national opioid settlement, with a Pennsylvania appeals court ruling Friday that their suit against the state attorney general was premature.",
    "If anyone tries to interfere with the decision each of Pennsylvania’s 67 counties made to join the settlement, including the decision by the City of Philadelphia and Allegheny County, we will not hesitate to respond,” Shapiro said in a written statement.",
    "The prosecutors want the right to continue with their own lawsuits against the drug industry, saying the national settlement would pay their communities only a fraction of the money needed to cover the epidemic’s financial toll.",
    "Last year, drugmaker Johnson & Johnson and the three largest U.S. drug distribution companies announced the $26 billion settlement with state and local governments to resolve thousands of state and local government lawsuits.",
    "Philadelphia District Attorney Larry Krasner, who is pursuing his own, potentially more lucrative, ligation against the opioid industry, vowed to continue the legal fight.",
    "A Commonwealth Court judge ruled Friday that because the national settlement has yet to be finalized, the prosecutors’ challenge cannot be heard.",
    "“These attorneys general have basically committed that they will work with Big Opioids against lawsuits to get more money,” Krasner said Friday.",
    "In Pennsylvania, Shapiro announced last week that as of the Jan. 26 deadline to sign on, all 67 counties had decided to join the settlement.",
    "They had asked the court to rule that Attorney General Josh Shapiro has no authority to bind them to the settlement.",
    "A message was sent to the office of Allegheny County DA Stephen Zappala Jr. seeking comment.",
    "The defendants have until Feb. 25 to back out before the agreement is finalized.",
    "“Misguided attempts to delay the help our communities need will fail.",
    "He said Pennsylvania is slated to receive about $1 billion.",
    "An overwhelming majority of governments have signed on."
  ]
}