{
  "id": 2499,
  "mediaId": 8461,
  "date": "2022-02-08",
  "headline": "Josh Shapiro’s open Pennsylvania primary lane",
  "image": "https://static.timesofisrael.com/jewishchronicle/uploads/2022/02/Josh-Shapiro-1024x640.jpg",
  "link": "https://jewishchronicle.timesofisrael.com/josh-shapiros-open-pennsylvania-primary-lane/",
  "mediaOutlet": "thejewishchronicle.net",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Deutch | JewishInsider",
  "authorUrl": "https://jewishchronicle.timesofisrael.com/writers/gabby-deutch-jewishinsider/",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans control the state House and Senate in Pennsylvania, and Shapiro pledges to work with them ”if the Republicans want to act in good faith to protect our democracy.” But in the event that they do not, Shapiro said, ”I will not hesitate to use my veto pen.”\n“But my goal,” he added, “is to work with others to get meaningful things done.”\nShapiro still lives in Abington, outside of Philadelphia, and moving to the governor’s mansion would be his first time living in the state capital full-time.",
    "He views Friday night dinners with his wife and four children as a way of “enjoying one another’s company and reflecting on our weeks and using Shabbat as a moment to pause and reflect and to talk and fill me up spiritually for the week ahead.”\nShapiro experienced a wave of antisemitism in his time as attorney general, following the release of a report from his office that found the Catholic Church in Pennsylvania engaged in a widespread cover-up of sexual abuse by priests.",
    "And we saw how Pennsylvania really was the bull’s-eye.”\nThe Republican candidates for governor include several state lawmakers who were involved with efforts to overturn the state’s election results in 2020, most notably state Sen. Doug Mastriano, who joined a Texas lawsuit filed against Pennsylvania seeking to invalidate the state’s results.",
    "And we lifted one another up.”\nShapiro blamed the recent increase in antisemitism in the United States on “leaders [who] are failing to speak and act with moral clarity, and allowing their words to be misappropriated by hate groups and others who wish to bring hate to our communities,” and pledged to speak against hate as governor.",
    "“If at the end of the day, your response to the grand jury report, which uncovered this type of horrific abuse and cover-up, is to attack me with an antisemitic slur, then frankly you’ve got the issue.”\nLater that year, a gunman entered the Tree of Life synagogue in Pittsburgh and killed 11 people during Shabbat morning services.",
    "Shapiro shies away from labels — when asked whether he identifies as a progressive or a moderate, he responded with “I’ll leave the punditry to you” — but pointed to his “proven track record of winning tough races.”\n“I don’t see Mr. Shapiro as being extreme left, no matter what the people on either side say about him.",
    "The most infamous was a comment from Virginia Democrat Terry McAuliffe, who at a gubernatorial debate with Youngkin, said, ”I don’t think parents should be telling schools what they should teach.” Youngkin ran with his opponent’s remark, arguing that Democrats don’t care about their children’s education.",
    "And as horrific as that was,” recalled Shapiro, “lots and lots of people gathered together that evening in a misting rain at the corner of Forbes and Murray, which is really the center of life in this neighborhood called Squirrel Hill, which is a wonderfully vibrant, diverse community.",
    "Jill Zipin, the group’s co-founder, told JI that ”the single most important issue in the governor’s race is protecting American democracy.”\nWhile the issue resonates with Democratic activists, the extent to which it will bring voters to the polls remains unclear.",
    "But his goal is ”educating and empowering the public, giving them facts, as opposed to dictates, [and] making sure that they understand the power of what a vaccine can do to save their lives, and in the case of schools, save children’s lives,” noted Shapiro.",
    "“I imagine if you were to go to a corner bar or a diner in Pennsylvania, people aren’t talking about these issues,” said Ari Mittleman, a Pennsylvania native who runs a government relations firm and hosts a podcast about Pennsylvania politics.",
    "Free Sign Up\nAs the results trickled in over those anxiety-inducing days, headlines and social media posts claiming that Republicans had won in the state, only to have their victories overturned by Democrats, began to proliferate online.",
    "They didn’t acknowledge that Joe Biden won the election, and they will appoint secretaries of state who I believe will undermine our democracy in the 2024 presidential election,” Shapiro told Jewish Insider in a recent interview.",
    "It wasn’t until two days later that Shapiro, 48, pulled ahead and ultimately won — similar to how Joe Biden was not declared the winner of the Keystone State, and the election, until four days after voters cast their ballots.",
    "He did not know about the investigation into the Church when he won his first race in 2016, but he saw it through, and found that the Church had covered up the abuse of more than 1,000 children over several decades.",
    "In a response brief he filed as attorney general, Shapiro called the suit ”legally indefensible” and “an afront to principles of constitutional democracy.” The Supreme Court dismissed the suit for lack of standing.",
    "As the only Democratic candidate for governor, he is letting the 15 Republican contenders attack each other ahead of the state’s June primary, while he attacks the “big lie.”\n“They’re beholden to the big lie.",
    "“I take my cues from Washington County, Pennsylvania, not Washington, D.C.,” Shapiro explained, repeating a line from his stump speech referencing the county in the western part of the state near Pittsburgh.",
    "“I am someone who, because of my faith, because of my teachings, believes that every person has a responsibility to get off the sidelines, get in the game and do their part,” Shapiro told JI.",
    "“We’ll have lots of Shabbat dinners at the governor’s residence that bring a lot of people from all different walks of life together for good food, good conversation and good challah.” PJC",
    "Tom Wolf term-limited and Sen. Pat Toomey (R-PA) opting not to run for a third term, the state has the rare combination of wide-open fields in both the Senate and gubernatorial races.",
    "”He led the statewide voting, and I think it’s because he was a very active attorney general who people of both parties sort of perceived as just kind of doing his job,” said Oxman.",
    "“We’re running a campaign that’s focused on meeting people where they are and meeting their needs.”\nThis philosophy is exemplified in Shapiro’s approach to the COVID-19 pandemic.",
    "And it taught me a lot about the importance of serving others and being grounded in your faith.”\nShapiro keeps up that Shabbat tradition even during a busy campaign schedule.",
    "A CNN poll from January found that a majority of Americans think democracy is under attack in this country, but more Republicans than Democrats agreed with that statement.",
    "Shapiro has held elected office since 2005, first as a state representative, then as a county commissioner in suburban Montgomery County and finally as attorney general.",
    "“We need to celebrate the fact that in really record time, the United States developed a vaccine that has literally saved millions and millions of lives,” Shapiro said.",
    "Rudy Giuliani, at the time Trump’s personal lawyer, flew to Philadelphia the day Biden was declared the victor and announced that Trump would be contesting the results.",
    "And we know, as a matter of fact, the best way to do that is by more people getting vaccinated,” Shapiro, whose platform does not include vaccine mandates, explained.",
    "One such group, Democratic Jewish Outreach Pennsylvania, honored Shapiro with a “Defender of Democracy” at the acclaimed Philadelphia restaurant Zahav in November.",
    "He later ran for student body president at Akiba Hebrew Academy (now Jack M. Barrack Hebrew Academy) in Merion Station, Pa. — the only election Shapiro ever lost.",
    "Robin Schatz, director of government affairs at the Jewish Federation of Greater Philadelphia, said Shapiro’s staff has always been responsive to community needs.",
    "”He’s doing wonderfully because so far he’s preempted a primary, which is very unusual,” said Neil Oxman, a Democratic political consultant based in Philadelphia.",
    "A December poll conducted by Morning Call/Muhlenberg College found that President Joe Biden had a 40% approval rating in the state, down from 55% last spring.",
    "Pennsylvania had become ground zero for, as Shapiro called it, “the big lie.” As the state’s top law enforcement officer, he was in charge of fighting back.",
    "(In reality, the vote-counting process was slowed by the large number of mail-in ballots, with votes in heavily Democratic urban areas being counted last.)",
    "”But at the end of the day, every member of every Chamber of Commerce across Pennsylvania, whether they’re an attorney or not, cares about the rule of law.",
    "“An attack against one based on what they look like or where they come from, who they love or who they pray to, it makes us all less safe,” added Shapiro.",
    "I don’t read a lot of my social media, but social media postings like that, that were just clearly antisemitic,” Shapiro told The New York Times in 2018.",
    "When Josh Shapiro went to bed on election night in 2020, it looked like he was going to lose his bid to be reelected as Pennsylvania’s attorney general.",
    "We grew up in a home where we spent Friday nights around the table having Shabbat dinner, talking about these issues, and Saturday mornings at shul.",
    "He’s behaved as a moderate across every dimension,” said David A. Harris, a law professor at the University of Pittsburgh and political observer.",
    "He seems uninterested in wading into thorny culture-war issues, but he has also clearly learned some lessons from Democrats’ faux pas in 2021.",
    "Still, that does not appear to have hindered early enthusiasm for Shapiro, who raised $6.3 million in the fourth quarter of last year alone.",
    "As a middle schooler, he launched an international pen-pal movement to connect young Americans with Jewish refuseniks in the Soviet Union.",
    "He also pointed out that as attorney general, he built up the state’s civil rights division to be able to better focus on hate crimes.",
    "“He took [what was] with many people a very unpopular stance, when he was dealing with the abuse by clerics in the Catholic Church.",
    "And in the swing state that Biden won by just 80,000 votes in 2020, Shapiro bested his Republican rival by more than 400,000 votes.",
    "Last month, Shapiro won the endorsement of the state Democratic Party, which opted not to make an endorsement in the Senate race.",
    "Shapiro, who is now running to be governor of Pennsylvania, says his state is the “epicenter” of the national battle over voting.",
    "Shapiro’s pen pal, Avi Goldstein, and his family left the USSR in time to make it to Shapiro’s bar mitzvah in Pennsylvania.",
    "I believe that parents play a critical role in their kids’ education and need to reinforce what’s learned in the classroom.",
    "At the University of Rochester, he became the first freshman in the school’s history to be elected student body president.",
    "“I think that is critical.”\nPennsylvania will be one of the most closely watched states in this year’s election cycle.",
    "That position puts him at odds with many Democrats, but it was a rallying cry of Republicans, like Virginia Gov.",
    "“Following the attack at Tree of Life in Pittsburgh, he’s always been out ahead of the game,” Schatz told JI.",
    "Shapiro, who has been an advocate for gun violence prevention reforms, immediately left for Pittsburgh.",
    "President Donald Trump and his allies publicly questioned the validity of Pennsylvania’s results.",
    "Shapiro did not want to weigh in on how Democrats fared in Virginia, but he is paying attention.",
    "I think just everything he does is very well considered and aligns closely with Jewish values.",
    "“I grew up in a home with parents who were activists in the Soviet Jewry movement.",
    "When it comes to vaccination, he emphasizes education and outreach over mandates.",
    "Praise for Shapiro’s “Jewish values” is a common refrain among his supporters.",
    "”There’s a strong and vibrant Jewish community,” said Shapiro of Harrisburg.",
    "“I believe parents should be integrally involved in their kids’ education.",
    "We might take these things for granted, but we saw how fragile it was.",
    "(The Republican Party is not endorsing candidates in either race.)",
    "People from all walks of life, Jewish, non-Jew, came together.",
    "Glenn Youngkin, who did well in 2021’s off-year elections.",
    "This article was first published on JewishInsider.com.",
    "2022 appears set to be a difficult year for Democrats.",
    "We prayed together, we sang together, we held hands.",
    "So that, to me, is a no-brainer,” said Shapiro.",
    "”There were a number of statements, emails.",
    "His passion for politics began early.",
    "They peddle the big lie every day.",
    "I want to keep businesses open.",
    "“I want to keep schools open.",
    "“I was at the crime scene.",
    "With Democratic Gov."
  ]
}