{
  "id": 2507,
  "mediaId": 8270,
  "date": "2022-02-04",
  "headline": "GOP’s election inquiry: Courts, conspiracies and more costs",
  "image": "https://www.readingeagle.com/wp-content/uploads/2022/02/Election_2020_Pennsylvania_Review_61216.jpg?w=1024&h=682",
  "link": "https://www.readingeagle.com/2022/02/04/gops-election-inquiry-courts-conspiracies-and-more-costs/",
  "mediaOutlet": "berksmontnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.readingeagle.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "By MARC LEVY\nHARRISBURG, Pa. (AP) — A Republican inquiry into Pennsylvania’s 2020 presidential election inspired by former President Donald Trump’s baseless claims of election fraud has spawned several court cases as it expands into multiple courses of inquiry, grows in cost and shows signs it will drag well into 2022.",
    "In brief interview last month, Dush said he wants access to Dominion’s equipment “because there have been reports that there are problems with it, and we’re going to take a look at it.”\nThe state had a responsibility to ensure the equipment was “properly investigated,” but did not, Dush said.",
    "That protected information, according to Shapiro’s office, includes voters’ partial Social Security numbers and driver’s license numbers and details about election systems that are barred from public disclosure by federal law governing critical infrastructure.",
    "As it drags on, it is looking more and more like the partisan and widely criticized “audit” that Arizona’s Senate Republicans carried out of heavily populated Maricopa County in a battleground state won — like Pennsylvania — by Democrat Joe Biden.",
    "Tom Wolf’s administration asked the court to get involved because it had tried fruitlessly to ensure that any access to the equipment is conducted under a specific set of rules to prevent the data and equipment from being damaged or altered.",
    "ELECTION FRAUD\nAn Associated Press investigation into potential cases of voter fraud in Pennsylvania and the five other battleground states where Trump disputed his loss to Biden in 2020 found a minuscule number of cases.",
    "A look at where everything stands:\nVOTING MACHINES\nThe state Supreme Court has, for now, held up the downloading of digital data from voting machines and election equipment in a heavily Republican county, Fulton County.",
    "The original contract between Senate Republicans and Envoy Sage is $270,250, but Dush’s office acknowledged the Fulton County undertaking was not covered under the original contract and requires an addendum.",
    "THE SUBPOENA\nThe statewide Commonwealth Court last month rejected Democrats’ efforts to block a subpoena issued by a Republican-controlled Senate committee for information from state election officials.",
    "When he voted for the subpoena, Dush said he wants the information because of questions “regarding the validity of people who have … voted, whether or not they exist.”\nHe did not give examples.",
    "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General Josh Shapiro that it is protected by privacy laws.",
    "In addition, lawyers are now representing both Republican and Democratic senators in two different court cases, one on the subpoena and one over Fulton County’s voting machines.",
    "Lawyers for Shapiro’s office and Senate Democrats want the court to order hearings so they can question Dush about why he thinks it is necessary to have the information.",
    "The Republican senator in charge, Sen. Cris Dush, R-Jefferson, is targeting Fulton County because it used equipment made by Dominion Voting Systems in 2020’s election.",
    "The undertaking comes after Trump and his supporters have pressured allies in battleground states he lost to seek out fraud to validate their conspiracy theories.",
    "Election officials in 11 of the state’s 67 counties identified a total of 26 possible cases of voter fraud, representing 0.03% of Biden’s margin of victory.",
    "Democrats have broadly opposed it and characterized it as an effort to discredit Biden’s win, damage confidence in elections and take away voting rights.",
    "Denver-based Dominion was the subject of some of the most feverish right-wing conspiracy theories about the election supposedly being stolen from Trump.",
    "Dominion’s equipment was also used in Maricopa County, where it was inspected twice by two different federally accredited voting system laboratories.",
    "Fulton County, which is cooperating with Dush, is Trump country, delivering more than 85% of its vote in 2020’s election to the former president.",
    "In Pennsylvania, Senate Republicans concluded it would be illegal to accept private donations for the task and they would use taxpayer dollars.",
    "Dush has advocated for overturning Biden’s victory in Pennsylvania and for bringing an Arizona-style election “investigation” to Pennsylvania.",
    "Senators in charge of it say they are simply looking for ways to improve the state’s elections, not overturn the 2020 presidential election.",
    "But instead, the court has ordered briefs due Feb. 15 on questions about the court’s legal jurisdiction over a legislative subpoena.",
    "On Friday, the state GOP scheduled an hourlong presentation on it at the party’s closed-press winter meeting in Lancaster.",
    "“We’re going to see if there is any evidence that causes further investigation and then we’ll go from there,” Dush said.",
    "The addendum, dated Jan. 20, adds another $187,865, according to a copy posted online by the state Treasury Department.",
    "Critics, including Republican senators, warn that its backers want nothing less than to overturn 2020's election.",
    "He defeated Trump in Pennsylvania by more than 80,000 votes, according to the state’s certified results.",
    "Fulton County said the state’s demands were unnecessary, and a lower court would not force it to agree.",
    "It has since filed a number of defamation lawsuits against Trump allies and right-wing broadcasters.",
    "Senators leading what they call an “investigation” in Pennsylvania have yet to report any findings.",
    "The Republican pursuit has received a broad embrace by GOP candidates on the campaign trail.",
    "In Arizona, millions of dollars were supplied by Trump supporters to underwrite the effort.",
    "It passed both times, according to reports of the inspections posted by Maricopa County.",
    "But he also suggested the inquiry would not necessarily stop at Fulton County.",
    "Follow Marc Levy on Twitter at https://www.twitter.com/timelywriter.",
    "Dush would not say exactly what problems he had in mind.",
    "THE COST\nIt’s going up.",
    "But Pennsylvania Gov."
  ]
}