{
  "id": 262,
  "mediaId": 2619,
  "date": "2022-02-25",
  "headline": "U.S. pending home sales slump for third straight month in January",
  "image": "https://images.mktw.net/im-492448/social",
  "link": "https://www.marketwatch.com/story/pending-home-sales-slump-for-third-straight-month-in-january-11645801451?siteid=bulletrss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Robb",
  "authorUrl": "https://www.marketwatch.com/topics/journalists/greg-robb",
  "termIds": [
    0
  ],
  "sentences": [
    "Looking ahead: “The clear signal from today’s report is that February is likely to see a substantially slower sales rate for existing homes than the 6.5 million unit pace reported for January,” said Josh Shapiro, chief U.S. economist at MFR Inc.\nMarket reaction: Stocks DJIA, -1.45% SPX, -1.68% were higher Friday on hopes that Russia might agree to talks that could end its invasion of Ukraine.",
    "Economic Report\nRising mortgage costs, low inventory, and home costs create toxic stew for housing sector\nThe numbers: U.S. pending home sales fell a sharp 5.7% in January, according to a monthly index released by the National Association of Realtors on Friday.",
    "This is the third straight monthly decline in the index for pending home sales, which captures transactions where a contract has been signed, but the home sale has not yet closed.",
    "The Federal Reserve’s sharp pivot towards a steady pace of interest rate hikes, higher inflation, and continuing lack of supply seem to be causing investors to pull back.",
    "Economists polled by the Wall Street Journal expected pending home sales to rise 1%.",
    "All of the regions posted declines in activity compared with 12 months ago levels.",
    "They didn’t expect the wheels to start shaking on the sector so early in the year.",
    "Big picture: In general, economists think 2022 will be a tough year for housing.",
    "On the other hand, existing home sales surprised to the upside this month.",
    "The West was the only region to see an increase in activity in January.",
    "Key details: Year over year, pending home sales were down 9.5%."
  ]
}