{
  "id": 2679,
  "mediaId": 2572,
  "date": "2022-01-28",
  "headline": "Pittsburgh bridge collapse causes massive gas leak leaving 4 hospitalized ahead of Biden's visit",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/AP22028512162072.jpg",
  "link": "https://www.foxnews.com/us/pittsburgh-bridge-collapse-gas-leak-3-hospitalized-bidens-visit",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emmett Jones",
  "authorUrl": "https://www.foxnews.com/person/j/emmett-jones",
  "termIds": [
    4560,
    4905,
    3926,
    1802,
    1053,
    392,
    6506,
    6520
  ],
  "sentences": [
    "President Biden, who is expected in Pittsburgh Friday to speak on infrastructure issues, will proceed with his trip as planned, according to a statement from the White House\n\"Our team is in touch with state and local officials on the ground as they continue to gather information about the cause of the collapse.",
    "Two of Pennsylvania's top Democrats, Josh Fetterman, the state’s lieutenant governor, who is running for Senate, and gubernatorial candidate Josh Shapiro, the state’s attorney general, will miss the president's visit because of scheduling conflicts.",
    "First responders reported to the scene and rappelled nearly 150 feet to help passengers from a dangling bus, while others formed a human chain to help rescuers with the effort.",
    "The President will proceed with trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.\"",
    "In Pittsburgh, the president looks to tout his $1 trillion infrastructure bill as well as his administration's economic progress in his first year.",
    "A Pittsburgh bridge collapse has left 4 hospitalized and 10 injured at Frick Park early Friday morning, according to the Pittsburgh Post-Gazette.",
    "Pittsburgh Fire Chief Darryl Jones said rescue units remained on the site to assure there were no victims under the bridge during the collapse.",
    "For him coming today to talk about why this funding is so important…this is critical we get this funding,\" Gainey told WITF.",
    "The President is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time.",
    "Correction: An earlier version of this story incorrectly reported that the gas leak caused the bridge collapse.",
    "Families who were told to evacuate during the leak have returned home and their gas has been restored.",
    "Pittsburgh Mayor Ed Gainey emphasized the importance of Biden's visit given the recent tragedy.",
    "The injured were transported to the hospital with non-life threatening injuries.",
    "Jones added that the gas leak caused by the collapse is now \"under control.\"",
    "Pittsburgh Public Safety reports that Frick Park is closed.",
    "\"We know we have bridges we need to take care of.",
    "It will advise once the park can be reopened."
  ]
}