{
  "id": 2681,
  "mediaId": 8322,
  "date": "2022-01-28",
  "headline": "Biden to tout 'remarkable economic progress' of his administration in Pittsburgh visit",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1768e1fb-f5c5-4020-ac1f-98d4395328e4/bbbe93a2-99d5-49a6-8c5b-aa36e84e432e/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/biden-to-tout-remarkable-economic-progress-of-his-administration-in-pittsburgh-visit",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    4905,
    4765,
    4080,
    3926,
    3780,
    2391,
    1375,
    6520
  ],
  "sentences": [
    "TOP PENNSYLVANIA DEMS CAN’T MEET BIDEN DUE TO SCHEDULING CONFLICT\nA White House official said the president will discuss the \"remarkable economic progress we’ve made over his first year in office,\" including the \"fastest single year of job growth in American history, the biggest unemployment drop on record,\" and the \"fastest economic growth in 2021 in almost four decades.\"",
    "\"We’re making the future in American again, with American workers,\" a White House official said in previewing the president’s trip, adding that he will \"underscore the vital role that the federal government plays in bringing workers and businesses together, and in catalyzing big investments in our industrial base.\"",
    "\"To make that a reality, the President will talk about how his Bipartisan Infrastructure Law is already strengthening in our supply chains and critical infrastructure – our roads, bridges, ports, airports, and more – giving us an edge in producing more in America and exporting it to the world,\" the official said.",
    "Biden is also expected to call on Congress to act on the \"competitiveness\" legislation that has been introduced in both the House of Representatives and the Senate, which invests in American innovation, R&D, manufacturing, and addressing supply chain bottlenecks, the official said.",
    "President Biden is set to travel to Pittsburgh on Friday and is expected to highlight the effects of the bipartisan infrastructure law, and tout the \"remarkable economic progress\" his administration has made during his first year as president, the White House said.",
    "Ben Williamson, an adviser for former Trump chief of staff Mark Meadows, tweeted, \"There’s bad, and then there’s ‘Gubernatorial candidate in a state you carried cancels on you’ bad.’\"\nFox News' Edmund DeMarche and The Associated Press contributed to this report.",
    "The official said that today, Mill 19, the home of Carnegie Mellon University’s Manufacturing Futures Institute, is beginning a \"new era\" of manufacturing, research and development, with a focus on \"artificial intelligence, automation and robotics.\"",
    "BIDEN ADMINISTRATION TOUTS 'HISTORIC INVESTMENT' IN BRIDGES THROUGH BIPARTISAN INFRASTRUCTURE LAW\nMeanwhile, two high-profile Pennsylvania Democrats said they will miss the president's visit due to scheduling conflicts.",
    "The official said, right now, the United States has \"a unique opportunity to position ourselves to out-innovate, our-build, and out-compete the rest of the world in the 21st century through those sorts of investments.\"",
    "The president, on Friday, is expected to deliver remarks in Pittsburgh, Pa., where he held his first presidential campaign event in 2019, and highlight his vision for rebuilding the American economy.",
    "Josh Fetterman, the state’s lieutenant governor, who is running for Senate, and gubernatorial candidate Josh Shapiro, the state’s current attorney general, will both miss Biden’s visit to Mill 19.",
    "The White House underscored the administration’s \"commitment to domestic industrial revitalization\" and support for domestic manufacturing in previewing the president’s remarks.",
    "Georgia gubernatorial candidate Stacey Abrams also cited a scheduling conflict earlier this month, when the president traveled to the state to deliver remarks on voting rights.",
    "The president’s trip will include a visit to Mill 19 in Pittsburgh, which was built in the 1940s and, at one point, produced more than one million tons of metal per year.",
    "The president is also expected to highlight the 367,000 manufacturing jobs created since he took office, which they say is the largest figure in \"nearly 30 years.\"",
    "An Associated Press report said leading Pennsylvania Democrats, who are not on the ballot this year, did not have the same scheduling conflicts.",
    "Fetterman and Shapiro are not the only Democrats running for office who have been unable to attend events with the president in recent weeks.",
    "Earlier this month, Fox News reported on how Abrams’ decision to skip Biden’s voting rights speech in Georgia was seized on by Republicans.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "All three had been invited to participate in a photo line with the president, the Associated Press reported.",
    "The offices for Fetterman and Shapiro did not immediately respond to after-hours emails from Fox News.",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "Brooke Singman is a Fox News Digital politics reporter."
  ]
}