{
  "id": 2682,
  "mediaId": 2573,
  "date": "2022-01-28",
  "headline": "GOP politicians slam Biden as he visits Pittsburgh to promote infrastructure package",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Sands-Biden-Reschenthaler.jpg",
  "link": "https://www.foxnews.com/politics/republicans-biden-pittsburgh-speech",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Dorman",
  "authorUrl": "https://www.foxnews.com/person/d/sam-dorman",
  "termIds": [
    4081,
    3989,
    3926,
    4905,
    5862,
    3780,
    1126,
    392,
    6520,
    6506
  ],
  "sentences": [
    "\"When we talk about investing in infrastructure, when we’re talking about how important it is, for him to say, ‘I want it come and see it myself,’ as the mayor of this city, it made me feel proud that the President of the United States had our back and said he would do whatever he can to help us restore that bridge,\" he said.",
    "PITTSBURGH BRIDGE COLLAPSE CAUSES MASSIVE GAS LEAK LEAVING 3 HOSPITALIZED AHEAD OF BIDEN'S VISIT\nRepublican U.S. Senate candidate and former Ambassador Carla Sands told Fox News Digital, \"This president is not delivering for the American people.",
    "Western Pennsylvanians feel unsafe in their neighborhoods thanks to rising crime and experience first-hand the perils of free-flowing fentanyl from record illegal border crossings due to Biden's refusal to secure the southern border.\"",
    "(Jeff Swensen/Getty Images)\n\"We are spending more at the pump and grocery store, and wages aren't keeping up with soaring inflation caused by Biden's reckless spending and his war on our domestic energy industry.",
    "(McCormick Senate campaign)\nSands said that she supported improving the nation's infrastructure but considered Biden's legislation to be full of \"socialist wish lists,\" \"Green New Deal\" proposals and \"cronyism.\"",
    "BIDEN VISITS PITTSBURGH BRIDGE COLLAPSE SITE, PROMISES US WILL ‘FIX THEM ALL’\n\"Democrat politicians and candidates in Pennsylvania hiding from Biden is the height of hypocrisy,\" said Rep.",
    "\"Biden’s speech today is indicative of how out-of-touch he is with the problems of working families across Pennsylvania I hear on the campaign trail everyday,\" he told Fox News Digital.",
    "\"His solution to these issues of simply spending more money is not only disconnected from reality but continues us on dangerous path for the Commonwealth and America.\"",
    "\"I'm thankful to @POTUS, @SenBobCasey, & Democrats in the Congressional delegation who fought for the Bipartisan Infrastructure Law,\" he said.",
    "A recent Fox News poll also showed that six in 10 voters would back someone other than Biden if the 2024 election were held today.",
    "Wolf praised Biden on Twitter and castigated Republicans for not supporting the president's Bipartisan Infrastructure Law.",
    "While speaking at Mill 19 in Hazelwood, Biden touted his infrastructure package and pledged to rebuild American bridges.",
    "He also pointed to reports that his presidency saw the fastest economic growth in decades in addition to added jobs.",
    "Pennsylvania Republicans panned President Biden as he promoted his infrastructure package in the state on Friday.",
    "\"Biden is unpopular because of his failed policies - the very same policies these Democrat politicians support.\"",
    "Republican U.S. Senate candidate Dave McCormick similarly criticized the president in a statement Friday.",
    "He sold himself as Joe Biden from Scranton, but what we're getting … is the Bernie Sanders, AOC agenda.\"",
    "Pittsburgh Mayor Ed Gainey said he was \"proud that the President of the United States had our back.\"",
    "\"These are life-changing investments in building and repairing our nation’s infrastructure.\"",
    "Biden spoke at Mill 19 in Pittsburgh just hours after a tragic bridge collapse in the area.",
    "Fetterman reportedly joined Biden earlier on Friday at the site of the bridge collapse.",
    "Their spokespeople cited scheduling conflicts, according to The Associated Press.",
    "But despite being invited, Democratic Attorney General Josh Shapiro and Lt. Gov.",
    "You can send tips on Twitter @DormanInDC or Facebook at SamDormanFoxNews.",
    "Biden found a warm welcome, however, from others in the state.",
    "Guy Reschenthaler, R-Pa., in a statement to Fox News Digital.",
    "Josh Fetterman caught headlines for bypassing the event.",
    "The Associated Press contributed to this report.",
    "Yet, he struggles with low approval ratings.",
    "Many politicians, including Democratic Gov.",
    "Sam Dorman is a reporter with Fox News.",
    "Tom Wolf, joined Biden at the event.",
    "Gov."
  ]
}