{
  "id": 2775,
  "mediaId": 2621,
  "date": "2022-01-28",
  "headline": "The Five Takes Glee in Democrats Not Appearing with Biden: ‘Entirely Ghosting the President’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-28-at-3.12.28-PM.jpg",
  "link": "https://www.mediaite.com/tv/the-five-takes-glee-in-democrats-not-appearing-with-biden-entirely-ghosting-the-president/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Luciano",
  "authorUrl": "https://www.mediaite.com/author/michael-luciano/",
  "termIds": [
    2596,
    1697,
    3989,
    3926,
    4765,
    4905,
    5920,
    392,
    5963
  ],
  "sentences": [
    "The way you get popular as a politician is you meet people where they are and try to answer their questions and concerns.”\nFord said Biden’s speeches need to be “tighter,” and that Biden’s “whispering probably should stop.” He added that Biden should devise plans to deal with supply chain issues, crime, and the border.",
    "This is happening at fundraisers, this is happening at his big signature events, it’s happening on social media.”\nJeanine Pirro asked fellow cohost and former Rep. Harold Ford (D-TN) if he would show up to a Biden event these days.",
    "“A lot of news outlets are reporting what’s going on here, as you know, these down-ballot Democrats are trying to create their own brand and separate themselves from the president on the issues,” said guest cohost Gillian Turner.",
    "Subscribe to\nCohosts of The Five appeared to relish in the fact some Democrats have been declining to appear at events with President Joe Biden, whose approval ratings are currently underwater.",
    "Another high-profile speech skipping came earlier this month when Stacey Abrams blamed her absence from Biden’s address on voting rights in Atlanta on a scheduling conflict.",
    "This is a blue state that he won.”\nTurner said Democratic politicians trying to distance themselves from Biden will find the strategy will fail.",
    "“It’s a human, it’s not a machine.” Watters said the measure of a successful president is whether people are willing to show up to his events.",
    "John Fetterman (D) and Attorney General Josh Shapiro (D) were scheduled to miss the event, though Fetterman ultimately attended.",
    "Jesse Watters then mocked the idea floated by many that Biden’s presidency needs a “reset.”\n“You can’t reset a guy,” he said.",
    "Biden spoke in Pittsburgh on Friday to tout the implementation of his bipartisan infrastructure bill.",
    "“It’s not going to work anyway because midterms are always a referendum on the president,” she said.",
    "“Politicians don’t always flock to the vulnerable, they flock to the popular.",
    "All you’ve gotta do is get popular again and they’ll come right back to him.",
    "The down-ballot candidates here are entirely ghosting the president.",
    "It doesn’t matter.”\nWatch above via Fox News.",
    "“They can distance themselves all they want.",
    "“But that’s not really what’s happening.",
    "“They’re not ghosting him in Texas.",
    "“This isn’t Texas,” he added.",
    "Have a tip we should know?",
    "Want to avoid video ads?",
    "Pennsylvania Lt. Gov.",
    "“Sure,” he responded.",
    "This is Pennsylvania.",
    "tips@mediaite.com"
  ]
}