{
  "id": 2796,
  "mediaId": 2641,
  "date": "2022-02-02",
  "headline": "Energy Transfer Charged With Environmental Crimes in Pennsylvania",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=47df0307-0f86-4213-a864-162e21dadecd&SiteName=Newsmax",
  "link": "https://www.newsmax.com/finance/streettalk/energy-transfer-pennsylvania-attorney-general-revolution-pipeline/2022/02/02/id/1055212/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3926,
    1030,
    5975,
    6099,
    6045,
    6506
  ],
  "sentences": [
    "Attorney General Josh Shapiro said in a release that his office charged Energy Transfer's ETC Northeast Pipeline LLC unit with two counts of discharging industrial waste, two counts of discharging other pollutants, two counts of potential pollution and three counts of unlawful conduct.",
    "The state stopped work several times and fined the company millions of dollars for spills and other problems related to construction of its Mariner East system, which moves natural gas liquids from Western Pennsylvania to Eastern Pennsylvania.",
    "The Pennsylvania attorney general's office on Wednesday charged a unit of Energy Transfer LP with nine counts of environmental crimes related to construction of the Revolution natural gas pipe in the western part of the state.",
    "\"These are not new or additional claims,\" a spokesperson at Energy Transfer said in an email, noting the company \"will continue to work with [the attorney general's office] and look forward to getting these issues resolved.\"",
    "The charges came a few months after the Pennsylvania Public Utility Commission approved a nearly $2 million settlement with Energy Transfer for the same explosion.",
    "A portion of the 24-inch (61-centimeter) pipe failed in an explosion after heavy rains caused a landslide in Center Township in Beaver County on Sept. 10, 2018.",
    "Despite this, Energy Transfer's contractors continued restoring the pipeline site without adding more erosion controls, Shapiro said.",
    "He said the lack of erosion control devices led to an initial landslide that deposited large amounts of sediment into a creek.",
    "The resulting fire destroyed a nearby home, damaged power lines and burned several acres of surrounding woodland.",
    "Pipelines owned by Dallas-based Energy Transfer have had multiple problems in recent years in Pennsylvania.",
    "Shapiro said inspectors visited the Revolution site multiple times and wrote violations.",
    "A second landslide caused the pipeline breach and explosion.",
    "© 2022 Thomson/Reuters.",
    "All rights reserved."
  ]
}