{
  "id": 2809,
  "mediaId": 2641,
  "date": "2022-01-28",
  "headline": "Dems Now Avoid Their Biggest Liability — Joe Biden",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=e71bd9bd-64d4-4f71-816e-c3e7ff82f3ae&SiteName=Newsmax",
  "link": "https://www.newsmax.com/michaeldorstewitz/abrams-klain-ppi/2022/01/28/id/1054458/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Dorstewitz",
  "authorUrl": "https://www.newsmax.com/insiders/michaeldorstewitz/id-498",
  "termIds": [
    4905,
    3926,
    4765,
    392,
    6175
  ],
  "sentences": [
    "With news like that, Democrats running for office this year will be coming out of the woodwork just to be seen with the president responsible for \"the strongest year for economic growth since 1984.\"",
    "\"I am not criticizing Stacey Abrams here, I am making a comment about the political standing of Joe Biden as seen from a woman who’s running for governor of Georgia and wants to win that election.\"",
    "The Associated Press (AP) reported Thursday that as a lead-up to the midterm elections, Biden will be making a big appearance today in Pittsburg to tout all of his administrations accomplishments.",
    "If it all sounds familiar, it’s because earlier this month Biden appeared in Georgia to make the case for two far-left election bills, which he called \"election reform.\"",
    "The only thing that projects the tiniest amount of competence upon Joe Biden is the fact that he surrounds himself with people who appear more inept than he is.",
    "The White House reported Thursday that \"We just learned that President Biden’s first year in office was the strongest year for economic growth since 1984.\"",
    "Politicians don’t show up with presidents when their approval ratings may be in the thirties in a state where they want to be elected governor.\"",
    "Another no-show will be state Attorney General Josh Shapiro, who’s expected to be the Democratic nominee in the state gubernatorial race.",
    "However, the Producer Price Index (PPI) — the price at which wholesalers pay for goods and services — jumped to 9.7% — an all-time high.",
    "When the economy gets back in business after a prolonged flat period due to a pandemic, of course the growth will appear high on paper.",
    "The AP reported that two of the state’s top Democratic leaders — both running for elective office this year — won’t be showing up.",
    "Biden would have you believe that \"big oil\" and \"big meat\" are responsible for the jump in consumer prices — it’s never his fault.",
    "Other Democrats — especially those not facing difficult elections this year — answered the call to prop up the president’s claim.",
    "Former President Barack Obama once allegedly said of his vice president, \"Never underestimate Joe’s ability to f**k things up.\"",
    "You can always judge how popular a politician is by the number of other politicians willing to stand alongside him on the dais.",
    "Merchant Marine officer and an enthusiastic Second Amendment supporter who can often be found honing his skills at the range.",
    "This means that the producers are carrying the brunt of the load in their attempt to keep prices at the consumer level down.",
    "He has a vice president that goes to Latin America to find the \"root cause\" of the accelerating crisis at our own border.",
    "Michael Dorstewitz is a retired lawyer and has been a frequent contributor to BizPac Review and Liberty Unyielding.",
    "It was in her state, and since the election she has repeatedly attributed her loss to voter fraud.",
    "The reason Americans aren’t buying that the economy is getting better is because it really isn’t.",
    "He has a treasury secretary who thinks we can fight inflation by spending trillions of dollars.",
    "And he has an attorney general who apparently takes his marching orders from teachers’ unions.",
    "He explained that \"Politicians show up with presidents when they have 52% approval ratings.",
    "He has a transportation secretary whose answer to highway deaths is to spend more money.",
    "\"She obviously doesn’t want to be on the same stage with Joe Biden,\" Scarborough said.",
    "MSNBC’s \"Morning Joe\" Scarborough saw through that nonsense, and he was fine with it.",
    "\"The Biden economy is on fire,\" announced Sen. Chris Murphy, a Connecticut Democrat.",
    "Meanwhile the Consumer Price Index rose to 7%, a 40-year high during 2021.",
    "His spokesperson cited a \"scheduling conflict\" preventing his attendance.",
    "Former Georgia gubernatorial candidate Stacey Abrams failed to attend.",
    "He also has a \"scheduling conflict,\" according to his spokesperson.",
    "The people know all this is poppycock — and so do fellow Democrats.",
    "The event would have appeared to have been tailor-made for her.",
    "They have graphs and spreadsheets and charts and everything!",
    "Especially in Pennsylvania — Joe Biden’s state of birth.",
    "He’s a leading candidate for the U.S. Senate this year.",
    "Using that standard President Biden is faltering badly.",
    "But what about the greatest U.S. economy in decades?",
    "White House Chief of Staff Ron Klain tweeted, \"The.",
    "The White House supplied the answer — the economy.",
    "And this year she plans to give it another go.",
    "Yeah, you know — a \"scheduling conflict.\"",
    "Read Dorstewitz's Reports — More Here.",
    "They include Pennsylvania Lt. Gov.",
    "What accomplishments, you may ask?",
    "Newsmax Blogs:\n© 2022 Newsmax.",
    "\"Fastest growth since 1984.\"",
    "The reason for her absence?",
    "He is also a former U.S.",
    "All rights reserved.",
    "No, stop laughing.",
    "They’re serious.",
    "John Fetterman.",
    "But maybe not.",
    "Special Links:",
    "38 Years.\"",
    "Strongest.",
    "Economic.",
    "Growth.",
    "In."
  ]
}