{
  "id": 2890,
  "mediaId": 2736,
  "date": "2022-01-29",
  "headline": "Donald Trump takes a victory lap after the Pennsylvania Commonwealth Court rules Act 77 unconstitutional",
  "image": "https://twitchy.com/wp-content/uploads/2020/11/trump-77b0a0fd-24ac-498d-ac18-a73095ead36f-2.jpg",
  "link": "https://twitchy.com/gregp-3534/2022/01/29/donald-trump-takes-a-victory-lap-after-the-pennsylvania-commonwealth-court-rules-act-77-unconstitutional/",
  "mediaOutlet": "Twitchy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg P.",
  "authorUrl": "https://twitchy.com/author/gregp-3534/",
  "termIds": [
    0
  ],
  "sentences": [
    "(@Elaijuh) January 28, 2022\nAct 77 itself was a compromise that allowed the mail-in voting in exchange for the removal of straight-party voting and if the state Supreme Court does rule the law unconstitutional, those other provisions would reportedly be dropped, too:\nSomething I didn’t think about initially: In declaring Act 77 unconstitutional, not just mail voting part (there’s also a non-severability provision), the court would roll back all the changes, which included extending voter reg deadline and removal of straight-party option.",
    "— AG Josh Shapiro (@PAAttorneyGen) January 28, 2022\nIn summary, the lower court is saying that the state constitution needs to be amended and these changes can’t be implemented with legislation alone:\nThe court notably isn’t saying mail voting is “bad” in some way — this is about the PA Constitution’s requirements for voting; how those requirements were interpreted in past cases; and how Act 77 changed election law.",
    "https://t.co/9LvBXyw29l\n— AG Josh Shapiro (@PAAttorneyGen) January 28, 2022\nAnd Attorney General Josh Shapiro predicted the law would be upheld:\nThe issue will now go before the Pennsylvania Supreme Court, and we are confident that Act 77 will ultimately be upheld as constitutional.",
    "A court in Pennsylvania just ruled that Act 77, which allowed no-excuse mail-in voting during the 2020 election, is unconstitutional:\nBREAKING: Pa. Commonwealth Court rules Act 77 of 2019, allowing no-excuse mail-in voting, is unconstitutional.",
    "@FOX43 https://t.co/6JStyPe7Xg\n— Matt Maisel (@Matt_Maisel) January 28, 2022\nFormer President Trump took a victory lap on the news:\nThis opinion is based on twisted logic and faulty reasoning, and is wrong on the law.",
    "Judge Mary Hannah Leavitt wrote, \"A constitutional amendment must be presented to the people and adopted into our fundamental law.\"",
    "It will be immediately appealed and therefore won’t have any immediate impact on Pennsylvania’s upcoming elections.",
    "(@Elaijuh) January 28, 2022\nRecommended Twitchy Video",
    "— Jonathan Lai ??",
    "— Jonathan Lai ??",
    "???",
    "???"
  ]
}