{
  "id": 2941,
  "mediaId": 8322,
  "date": "2022-01-28",
  "headline": "Top Pennsylvania Dems can’t meet Biden due to scheduling conflict",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/0a4751bd-Biden.jpg",
  "link": "https://www.foxnews.com/politics/top-pennsylvania-dems-biden-schedule-conflict",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Two top Democrats in Pennsylvania running for high office said they will miss President Biden during the president's stop in Pittsburgh on Friday due to scheduling conflicts – just weeks after Stacey Abrams, the Georgia gubernatorial candidate, cited the same reason.",
    "The AP report pointed out that their \"high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.\"",
    "Ben Williamson, an adviser for former Trump chief of staff Mark Meadows, tweeted, \"There’s bad, and then there’s ‘Gubernatorial candidate in a state you carried cancels on you’ bad.’\"\nThe Associated Press contributed to this report.",
    "John Fetterman, the state’s lieutenant governor, and Josh Shapiro, the attorney general, will both miss the president’s visit to Mill 19, a research and development center.",
    "Earlier this month, Fox News reported on how Abrams’ decision to skip Biden’s voting rights speech in Georgia was seized on by Republicans.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "The report said leading Pennsylvania Democrats, who are not on the ballot this year, did not have the same scheduling conflicts.",
    "Fetterman is running for Senate, and Shapiro is the likely Democratic nominee for governor, according to the Associated Press.",
    "The offices for Fetterman and Shapiro did not immediately respond to after-hours emails from Fox News.",
    "All three had been invited to participate in a photo line with the president, the AP reported.",
    "He is expected to discuss his infrastructure deal, WTAE reported."
  ]
}