{
  "id": 2943,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "Pennsylvania court declares state’s no-excuse absentee voting law unconstitutional",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220128114326-pa-ballots-file-restricted-2020.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/01/28/politics/pennsylvania-voting-law-unconstitutional/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dianne Gallagher",
  "authorUrl": "https://www.cnn.com/profiles/dianne-gallagher-profile",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump praised Friday’s decision, saying in a statement that “great patriotic spirit is developing at a level nobody thought possible.”\nState Senate President Tempore Jake Corman, a GOP gubernatorial candidate this year who voted for the 2019 mail-in voting expansion, said the ruling “should serve as a call to action to open up a serious conversation about the reforms necessary to make voting both accessible and secure for all Pennsylvanians.”\nHe said in a statement that he plans to introduce legislation that will include components such as “voter ID, elimination of straight party voting, an end to drop-boxes, a ban on outside money, and a provision for independent audits of elections by third parties.”\n“My plan will expand access, increase integrity, and prevent fraud and give Pennsylvanians an election system they can believe in,” he added.",
    "Wanda Murren, communications director for the Pennsylvania Department of State, told CNN in an email statement that the state is working on an appeal to the state Supreme Court and “disagrees with today’s ruling.”\nShe also said in a follow-up statement that the decision would have “no immediate effect” on the state’s May primary elections and encouraged voters to request mail-in ballots.",
    "“But a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation allowing no-excuse mail-in voting can be ‘placed upon our statute books.’”\nThe five-judge Commonwealth Court panel split along party lines, with the three Republican judges agreeing with the GOP petitioners and two Democrats dissenting.",
    "Pennsylvania Attorney General Josh Shapiro, a Democrat who is running for governor this fall, slammed the decision, saying it was “based on twisted logic and faulty reasoning and is wrong on the law.”\n“It will be immediately appealed and therefore won’t have any immediate impact on Pennsylvania’s upcoming elections.",
    "But in September, more than a dozen Republicans in the state House – most of whom voted for the law – filed suit, asserting that the changes made to absentee voting were unconstitutional and should have been pursued through a constitutional amendment placed before voters.",
    "“If presented to the people, a constitutional amendment to end Article VII, Section 1 requirement of in-person voting is likely to be adopted,” Judge Mary Hannah Leavitt wrote for the majority Friday.",
    "More than 2.6 million people cast mail or absentee ballots in the 2020 general election, according to the Pennsylvania Department of State, out of a total of some 6.9 million counted ballots.",
    "Republicans overwhelmingly supported the expansion of mail-in voting in 2019 but then began attacking the process following President Donald Trump’s loss to Joe Biden in 2020.",
    "The department “is notifying all county election boards that they should proceed with all primary election preparations as they were before today’s Commonwealth Court ruling.",
    "The issue will now go before the Pennsylvania Supreme Court, and we are confident that Act 77 will ultimately be upheld as constitutional,” Shapiro said in a statement.",
    "CNN —\nA Pennsylvania appellate court on Friday struck down a law that allows no-excuse absentee voting, saying it violates the state constitution.",
    "The state Supreme Court, where Democrats have a majority, has backed state’s expanded use of no-excuse absentee voting in previous rulings.",
    "The Trump campaign attempted to invalidate thousands of Pennsylvania ballots by filing several lawsuits, all of which were unsuccessful.",
    "By a 3-2 ruling, the Pennsylvania Commonwealth Court agreed with that reasoning Friday.",
    "The law, known as Act 77, was enacted in late 2019 with strong bipartisan support.",
    "There should be no change in their procedures,” Murren said."
  ]
}