{
  "id": 3030,
  "mediaId": 8438,
  "date": "2022-02-01",
  "headline": "Briefs: February 1st, 2022",
  "image": "https://cdn.centraljersey.com/wp-content/uploads/sites/25/2022/02/Library.jpg",
  "link": "https://southphillyreview.com/2022/02/01/briefs-february-1st-2022/",
  "mediaOutlet": "southphillyreview.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "South Philly Review -",
  "authorUrl": "https://southphillyreview.com/author/southphillyreview/",
  "termIds": [
    0
  ],
  "sentences": [
    "And we won’t teach them that they have no chance in life because of their skin color, either.”\nEligibility standards in sports\nLou Barletta, Republican candidate for governor, pledged that he will call for and sign legislation that requires eligibility standards for high school and college sports to include the biological sex of athletes as recorded on their birth certificates.",
    "“Our campaign created this website to help give citizens a voice who are fed up with Krasner.”\nBarletta wants end to flights of illegals to PA\nLou Barletta, Republican candidate for governor, called on the General Assembly to pass a resolution demanding that Attorney General Josh Shapiro file a lawsuit against the Biden administration for violations of the Refugee Act of 1980.",
    "Theatre Exile opens new play Thursday\nTheatre Exile at 1430 S. 13th St. will present The Motherf**ker with the Hat by Pulitzer Prize-winning playwright Stephen Adly Guirgis from Feb. 3-27 with Theatre Exile’s new theater limited-capacity audience of 60 guests, reduced from the usual 125-seat capacity.",
    "“All across Pennsylvania, parents are sick and tired of their tax dollars being used to fund anti-American indoctrination campaigns in K-12 classrooms that teach their children to hate their own country and each other through racist ideologies like Critical Race Theory,” Barletta said.",
    "That’s what we expect from elected leaders and it’s what Lou Barletta has always done.”\nEffort to impeach Krasner\nState Sen. Jake Corman, a Republican candidate for governor, unveiled a website to build support for the impeachment of District Attorney Larry Krasner.",
    "The University of Pennsylvania women’s swimming team has made international headlines because of transgender swimmer Lia Thomas – known as Will Thomas when he competed on the men’s team – who is shattering records, and who won one race by 38 seconds.",
    "Visitors can also fly a remotely operated vehicle over a model of the Titanic’s deck and, in another display, see how currents created by superheated water erupting from thermal vents carry nutrients that support life forms few ever dreamed existed.",
    "Tickets available for Southern Class of 1976 reunion\nThe South Philadelphia High School Class of 1976 will hold its 45th reunion on March 18 at the Lazaretto Ballroom, located at 99 Wanamaker Ave. in Essington, from 7-11 p.m. All are welcome.",
    "“Women fought for a level playing field in sports for a long time, and now the ‘woke’ crowd is taking it away from them again by forcing girls and women to compete against biological males who have physical advantages,” Barletta said.",
    "Here is the schedule through next summer: Hadestown (Feb. 9-20, Academy of Music); Beautiful – The Carole King Musical (Feb. 22-27, Academy of Music); Rent: 25th Anniversary Farewell Tour (March 4-6, Merriam Theater); Oklahoma!",
    "(March 8-20, Forrest Theatre); Waitress (March 29 to April 3, Academy of Music); Hairspray (May 16-22, Merriam Theater); To Kill A Mockingbird (July 12-24, Academy of Music); and Dear Evan Hansen (Aug. 16-28, Forrest Theatre).",
    "“Krasner’s decision to allow more and more criminals to walk free through plea deals and dismissed charges has created an environment in which Philadelphians are no longer safe in their own homes and communities,” Corman said.",
    "It is an opportunity to secure revenue to support education, social services, public safety and other critical needs.”\nAlthough the site is located in Center City, the city will seek input from stakeholders citywide.",
    "We want to hear from everyone.”\nThe RFP, its timeline and its requirements are at https://www.pidcphila.com/tools/property-development-rfps-rfqs/rfp-listing/community-engagement-a-new-vision-for-the-roundhouse.",
    "They can test their skill at manipulating a robotic arm of a replica of the submersible Alvin to pick up lava rocks and clams similar to what scientists do to gather samples of creatures from the ocean floor.",
    "“The recent spike in violent crime is a direct result of Krasner’s failed policies and his refusal to perform the duties of his office to hold criminals accountable for the crimes they commit,” Corman said.",
    "The pledge is sponsored by 1776 Action, an organization formed last year to combat anti-American indoctrination in K-12 schools with the assistance of Dr. Ben Carson and former House Speaker Newt Gingrich.",
    "Water exhibit opens\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is presenting Invisible World of Water, on view through May 1 and free with general admission.",
    "Explore ocean depths\nA new exhibition opening this spring at the Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, reveals the mysteries of the ocean’s greatest depths.",
    "Extreme Deep: Mission to the Abyss, opening April 2, invites museum visitors to explore newly discovered life forms, thermal vents, deep-sea research submersibles and shipwrecks including the Titanic.",
    "Upcoming cruises\nThe Bristol Cultural and Historical Foundation is sponsoring a cruise to Charleston and Bermuda, June 2-12, 2022, on the Celebrity Summit, sailing from Cape Liberty, in North Jersey.",
    "Museum visitors will observe firsthand the technology that only recently has allowed scientists to travel to the ocean floor and discover the creatures that thrive in total darkness.",
    "Recchi issued the following statement:\n“Having lived and played in Pennsylvania for a lot of years, I know that Lou Barletta will make a great governor and I am proud to endorse him.",
    "For more information, contact the Class of 1976 reunion coordinators Michele T. at impizazz143@gmail.com or 267-971-4386 or contact Maria S. at mshonesty747@aol.com or 215-463-3215.",
    "Hidden Works of Nature: The Microscopic World in the Library & Archives will be on exhibit on the following Fridays, hourly from 11 a.m. to 4 p.m.: Feb. 4 and 18 and March 4 and 18.",
    "The project is curated by David Scott Kessler, whose feature-length film The Pine Barrens will be shown at 5 p.m., accompanied by a live score by The Ruins of Friendship Orchestra.",
    "Whitman Library announces weekly activities\nFeet First is a weekly walking group held on Wednesdays at 11 a.m. Meet outside the Whitman Library, 200 Snyder Ave., for a 2-mile walk.",
    "Barletta signs education pledge\nLou Barletta, Republican candidate for governor, signed the “1776 Pledge to Save Our Schools,” a promise to return to honest, patriotic education.",
    "Activities at Academy of Natural Sciences\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is hosting several current and upcoming exhibits.",
    "The City of Philadelphia issued a Request for Proposals seeking a consulting team to lead community engagement around the redevelopment of the Police Administration Building.",
    "He’s working to overcome his addictions with the help of his sponsor, Ralph D, but is soon confronted by familiar demons when he discovers another man’s hat in his apartment.",
    "If he wants to be governor, Josh Shapiro should show that he’ll stand up and fight for Pennsylvania, because he hasn’t done that yet.”\nWhat will happen to Roundhouse?",
    "Biden has been sending secret charter flights of illegal immigrants to Pennsylvania without consulting with both the state and affected local governments beforehand.",
    "The exhibit coincides with “Water Year,” an initiative of the Academy of Natural Sciences and Drexel University aimed to increase public attention of the resource.",
    "According to the law, the federal government must consult with the state and localities before sending illegal immigrants here, and that clearly has not happened.",
    "We need a national, federal constitutional amendment to make it very clear that only United States citizens may vote in elections in the United States,” he said.",
    "“Many of you probably know that New York City now put into law, with the new mayor, legislation that allows 800,000 non-citizens to vote in municipal elections.",
    "The vision plan will recommend how best to incorporate community desires while also recognizing the city’s need to recapture much-needed financial resources.",
    "Distinguishing itself outside of utilitarian use, this show explores the materiality and form in the traditionally domestic media of ceramic and fiber art.",
    "The Pine Barrens Project will take place on Saturday, Feb. 12, from 3-9 p.m., featuring film and video that celebrate and reflect on the natural world.",
    "“This site has meaning to Philadelphians of all races, ethnicities, ages, gender, sexual orientations, gender identities and incomes,” Sharpe said.",
    "A junior scientist workshop titled Water Bugs, geared to kids in third to fifth grades, is scheduled for Saturday, March 19, from 10 a.m. to noon.",
    "The stitching helped Rebecca to recover her arm and hand strength, while the infinite range of beautifully colored yarns filled her with optimism.",
    "Lou believes in the freedom of people to make their own decisions and I know that he is the right man to get Pennsylvania back on track again.",
    "This collection will balance on the contrast of the physical nature of these two mediums and the similarities in their connotations to craft.",
    "“When I am governor, we will no longer teach children that they are either oppressed, or the oppressor, depending on the color of their skin.",
    "Weaving her life experience through the yarn, each tapestry became an homage to her life and the relationships she has formed along the way.",
    "No voting by non-citizens\nJeff Bartos, a Republican candidate for U.S. Senate, opposes allowing non-citizens to vote in American elections.",
    "Flea market on Saturday\nSt. Hubert, 7320 Torresdale Ave., will host an indoor flea market on Saturday, Feb. 5, from 7:30 a.m. to 12:30 p.m.",
    "Flower show tickets available\nThe Pennsylvania Horticultural Society announced that tickets are on sale for the Philadelphia Flower Show.",
    "As outlined in the state Constitution, impeachment of an elected official requires a majority vote in the state House of Representatives.",
    "Tom Wolf and Attorney General Josh Shapiro throw up their hands and claim they are powerless to do anything about it,” Barletta said.",
    "At the pit party, fans can see the massive 12,000-pound trucks up close, meet their favorite drivers and crews, and take pictures.",
    "The show will take place at Franklin Delano Roosevelt Park, 1500 Pattison Ave., from Saturday, June 11, through Sunday, June 19.",
    "Commonly known as the Roundhouse, the Police Administration Building at 7th and Race streets will become vacant later this year.",
    "The discussion Growing Art from Science will take place on Wednesday, Feb. 23, at 6:30 p.m. Register at https://bit.ly/3rRiQOe.",
    "The dramatic contrast of light and dark, the bold colors, the intricate patterns, all working together to tell Rebecca’s story.",
    "Even though he is more of a baseball fan, he’s tough enough and fights hard enough to have played hockey, and I respect that.",
    "Tickets for the virtual screening are $10 and can be purchased at: https://watch.showandtell.film/watch/thepinebarrens_ans.",
    "After his release from prison, Jackie moves in with his childhood sweetheart Veronica as he tries to start his life anew.",
    "A Mindful Meditation will take place on Fridays at 10 a.m. online Facebook Live https://www.facebook.com/WhitmanLibrary.",
    "At the same time, there will be a group exhibition on display called “Concentric Craft” that is juried by Ashley York.",
    "Meanwhile, a fully escorted Holy Lands & Aegean Majesty cruise will sail Oct. 6-17, 2023, featuring 10 ports-of-call.",
    "Da Vinci Art Alliance opens 2 exhibitions\nThe Da Vinci Art Alliance at 704 Catharine St. opened two new exhibitions.",
    "“Joe Biden’s border crisis is out of control, and he has been sending illegal immigrants to Pennsylvania, while Gov.",
    "Recchi backing Barletta\nFormer Flyers star Mark Recchi endorsed Lou Barletta, a Republican candidate for governor.",
    "In the 1992-93 season, his 123 points set the regular season record for the Flyers, a standard that holds today.",
    "“The Roundhouse is a complicated site,” said Eleanor Sharpe, executive director of the City Planning Commission.",
    "To reserve vendor space or for more information, email fleamarket@huberts.org or visit huberts.org/fleamarket/.",
    "For more information and to register, email Rebecca, Whitman Library assistant, at mccauslandr@freelibrary.org.",
    "A junior scientist workshop, How Do Plants Communicate?, is set for Saturday, Feb. 12, from 10 a.m. to noon.",
    "If impeached, a two-thirds majority is required in the Senate to convict Krasner and expel him from office.",
    "Apply for scholarship\nThe deadline is March 1 to apply for the Children’s Scholarship Fund Philadelphia.",
    "For more information, visit https://theatreexile.org/shows/the-mfer-with-the-hat/ or call 215-218-4022.",
    "Takes place all winter long, weather permitting, so wear comfortable shoes and appropriate outerwear.",
    "Carjackings have tripled since 2019, and there have already been 100 in less than a month this year.",
    "The Philadelphia Police Department headquarters is moving to 400 N. Broad St. in the coming months.",
    "Conviser began making needlepoint tapestries in order to process her battle with breast cancer.",
    "Monster Jam at the Linc\nMonster Jam returns to Lincoln Financial Field on Saturday, April 16.",
    "You will receive tips and tricks to relax and relieve anxiety during this brief body scan.",
    "Scholarships are available to income-eligible kids in kindergarten through eighth grade.",
    "Want to share what you’re making with other crafters from the comfort of your own home?",
    "Philadelphia just ended its deadliest year ever for shooting deaths with 562 homicides.",
    "Kimmel schedule\nThe Kimmel Cultural Campus has returned to live Broadway programming.",
    "All forms of “stitching” are welcome (knitting, crocheting, cross-stitch, quilting.)",
    "Rates, including airfare, range from $4,198 to $7,998 per person, double occupancy.",
    "He means what he says, and when he makes a promise, you know you can trust him.",
    "The show starts at 7 p.m., with a pit party for fans going from 2:30 to 5:30.",
    "Tickets are $50 per person and the deadline to purchase tickets is Feb. 14.",
    "is a virtual Stitch Meetup for Adults on Wednesdays at 6:30 p.m. via Zoom.",
    "Recchi won three Stanley Cups, with Pittsburgh, Carolina and Boston.",
    "Extreme Deep: Mission to the Abyss will run from April 2 to July 24.",
    "Extreme Deep: Mission to the Abyss will be on view through July 24.",
    "For more information and to register, visit https://bit.ly/3IeXYph.",
    "For more information, call 215-893-1955 or visit kimmelcenter.org.",
    "Bartos wants a constitutional amendment prohibiting the practice.",
    "For more information email: Abbe at KlebanoffA@Freelibrary.org.",
    "Rates range from $1,577 to $2,387 per person, double occupancy.",
    "Rebecca Conviser: Creative Expressions opened on Jan. 13.",
    "“To many people it represents an era of police brutality.",
    "“At the same time, it is an iconic piece of architecture.",
    "The Pine Barrens will be available online Feb. 12-15.",
    "Ground your mind and body with this virtual program.",
    "Ocean Bound will run from Aug. 20 to Jan. 15, 2023.",
    "Proceeds will benefit the Faculty Scholarship Fund.",
    "Call 215-788-9408 for information and reservations.",
    "The workshop is for kids in third to fifth grades.",
    "He was elected to the Hockey Hall of Fame in 2017.",
    "For tickets, go to PHSonline.org/the-flower-show.",
    "“It means different things to different people.",
    "Tickets are available at www.ticketmaster.com.",
    "For information, visit davinciartalliance.org.",
    "Invisible World of Water runs through May 1.",
    "Masks and proof of vaccination are required.",
    "For some that era continues to this day.",
    "It sits on a large and valuable parcel.",
    "ImpeachKrasner.com includes a petition.",
    "For more information, visit ansp.org.",
    "The deadline to respond is March 14.",
    "Both exhibitions run through Feb. 2.",
    "Register at https://bit.ly/3pbrMLq.",
    "Sea Change is running indefinitely.",
    "Register at https://bit.ly/3Da6brG.",
    "They are awarded by random lottery.",
    "The theme is In Full Bloom.",
    "Tickets are $35.",
    "“They’re wrong.",
    "Bring water.",
    "Sew What?"
  ]
}