{
  "id": 3063,
  "mediaId": 2748,
  "date": "2022-01-29",
  "headline": "Pennsylvania Dem Hopefuls Don't Want Anything to Do With Biden as President Visits State",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EyywrEjvQ00XbopgXQLUxbI8-E57ZdwfqZqiHgp_kvBC8Bndy4m-cRWGXbGvsYECaIzSEiw1zmIJgpe74GPLGeYR7NMGUqhEDfWkaXg3zgeaCVO=w1200-h630-n-k-no-nu",
  "link": "http://www.stationgossip.com/2022/01/pennsylvania-dem-hopefuls-dont-want.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STATION GOSSIP",
  "authorUrl": "https://www.blogger.com/profile/14290129071922737076",
  "termIds": [
    0
  ],
  "sentences": [
    "President Joe Biden’s home state may be Delaware, but during his time in Congress, he was jokingly referred to as “Pennsylvania’s third se...\nPresident Joe Biden’s home state may be Delaware, but during his time in Congress, he was jokingly referred to as “Pennsylvania’s third senator.”\nHe grew up in Scranton, Pennsylvania, after all, and the northern portion of the state he represented was practically a suburb of Philadelphia.",
    "On one hand, he’s an unabashed progressive whom Vox described in 2018 as “a Bernie Sanders-endorsed steel town mayor.”\nOn the other, he comes across as a too-good-to-be-true sop to the blue-collar vote: a tattooed, goateed man with the physique of a pro wrestler who is fond of doing socially distanced interviews with an American flag as a prominent backdrop.",
    "“And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president,” it said.",
    "And on that last count — that voters will “end up thinking less of you for not showing up” — consider this: What are the odds a Friday photo with the president ends up being of more use to the Pennsylvania Democrat who’s in it than it does to whoever his GOP opponent is?",
    "As for whether “things can turn around in politics pretty dramatically,” we’ve been watching the doddering Biden campaign and govern for three years now; no one with sense or self-preservation skills seems to be confident this ship will right itself before November.",
    "Ol’ lunch-pail Joe is theoretically supposed to shore up those blue-collar bona fides, which is how any progressive Democrat is going to win a U.S. Senate race in Pennsylvania — which, again, is listed as a toss-up by Cook Political Report.",
    "When Biden came down to Atlanta earlier in the month to pitch the Democrats’ voting overhaul legislation — a topic that is to Abrams’ political rhetoric what the blues is to the Rolling Stones’ music — Abrams was conspicuously absent.",
    "Tom Wolf, who is term-limited, and Sen. Bob Casey, whose current term runs through 2024.”\nOther Democrats with their eyes on the 2022 elections seem to have scheduling conflicts when Biden is in town or are begging him not to come.",
    "“The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months,” the AP reported.",
    "John Fetterman and Attorney General Josh Shapiro — the leading Democratic candidates for senator and governor, respectively — declined to join Biden during the visit, citing scheduling conflicts.",
    "This, one surmises, has something to do with a solemn, unspoken campaign pledge not to appear with presidents who have approval ratings stuck in the 30s on any day that ends with the letter Y.",
    "Ed Rendell, a Democrat, told the AP that Democrats who distance themselves from Biden are “stupid.”\n“They’re stupid because things can turn around in politics pretty dramatically,” he said.",
    "However, now that Biden is visiting in 2022 — when Shapiro is likely facing a general election rated as a toss-up by the Cook Political Report — the Democratic candidate is suddenly busy.",
    "However, the only high-profile candidate for either seat who’ll appear with Biden is Democrat Rep. Conor Lamb, who’s Fetterman’s highest-profile opponent in the Senate race.",
    "Two politicians felicitously having scheduling conflicts, if Biden weren’t 20,000 leagues under the sea in polling, would seem unusual given the closeness of their races.",
    "This is going to be about the people of Texas and what the people of Texas want.”\nOn Jan. 21, he reiterated this position in an interview with The Dallas Morning News.",
    "“Josh Shapiro is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,” Shapiro spokesman Will Simons said.",
    "The little nonpartisan polling that’s been done of the Democratic primary race shows Fetterman with a significant lead over Lamb, who’s more moderate policy-wise.",
    "“Like every American should, Josh wants our president to be successful and we’ll continue welcoming President Biden to his home state of Pennsylvania,” he added.",
    "Shapiro, the overwhelming favorite in the Democratic gubernatorial primary, didn’t have his office say what the scheduling conflict was — merely that it existed.",
    "So why do two Pennsylvania Democrats facing tough, high-profile statewide races this fall want nothing to do with him when he visits Pittsburgh on Friday?",
    "His blue-collar image attracted voters in the Keystone State during his time in Congress and as vice president and during his 2020 presidential campaign.",
    "“I’m not interested in any national politician — anyone outside of Texas — coming into this state to help decide the outcome of this,” he said.",
    "This is Beto in November, asked if he wanted Biden to come and campaign for him: “This campaign in Texas is not going to be about Joe Biden.",
    "Fetterman, meanwhile, said he would be meeting with Democrats in the state capital of Harrisburg to talk about the midterm elections.",
    "“Leading Pennsylvania Democrats who are not on the ballot this year did not have the same scheduling conflicts,” the AP reported.",
    "According to The Atlanta Journal-Constitution, this was — I know you’ll never believe this, but — due to a scheduling conflict.",
    "People end up thinking less of you for not showing up.”\nRendell isn’t exactly playing the electoral game right now, however.",
    "“I think we all want to make sure that we’re working with, listening to and voting with one another here in Texas.”\nRight.",
    "At least former Rep. Beto O’Rourke, mounting a quixotic gubernatorial run in Texas, is more honest (or too stupid to lie).",
    "In an October Franklin and Marshall poll, Fetterman had 34 percent and Lamb 12 percent — but 37 percent were undecided.",
    "The fact that Fetterman, who’s aiming to replace retiring GOP Sen. Pat Toomey, is staying away is even more damning.",
    "Both Fetterman and Shapiro had been invited to Pittsburgh for a photo op with the president Friday afternoon.",
    "“Third senator” or not, Joe Biden looks to be as toxic in Pennsylvania as he is in the rest of the country.",
    "Those who are — Abrams, Fetterman, O’Rourke and Shapiro — seem to think they can hide pretty effectively.",
    "He rather unsubtly told Biden from the genesis of his campaign to stay out of the Lone Star State.",
    "“It’s great that President Biden is coming to Pittsburgh to talk about infrastructure,” he said.",
    "Fetterman is supposed to be the perfect synthesis of both sides of the modern Democratic Party.",
    "Perhaps more telling than who won’t be there to support Biden in Pittsburgh is who will be.",
    "Shapiro appeared three times with the president in the summer and fall of 2021.",
    "Fetterman won’t be there, though — even though his headquarters is in the city.",
    "If he’s staying away, that ought to induce an eyebrow or two to raise.",
    "It’s not going to be about anyone from outside of our state.",
    "Take Stacey Abrams, who’s running for governor in Georgia.",
    "“Those who will appear with Biden on Friday include Gov.",
    "According to The Associated Press, both Lt. Gov.",
    "However, plenty of undecided voters remain.",
    "It’s not going to be about Donald Trump.",
    "Outspoken former Pennsylvania Gov.",
    "“You can’t hide."
  ]
}