{
  "id": 3107,
  "mediaId": 8500,
  "date": "2022-01-31",
  "headline": "Pennsylvania Democrats deadlock on endorsing in Senate race",
  "image": "https://kubrick.htvapps.com/vidthumb/e61a350e-167b-4bb0-a988-8afc693060bf/e61a350e-167b-4bb0-a988-8afc693060bf_image.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wtae.com/article/pennsylvania-senate-democrats-endorsement-lamb-fetterman-kenyatta-arkoosh/38932820",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARC LEVY Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) —\nPennsylvania's Democratic Party committee members deadlocked Saturday in suburban Harrisburg on a vote to endorse in the party's hotly contested primary race for U.S. Senate, giving Conor Lamb by far the most votes, but not enough for the party's backing.",
    "In his speech before the vote to the hotel ballroom of mask-wearing Democrats, Lamb told committee members that his endorsement would \"put fear into the hearts\" of Republicans because of his experience winning three congressional races on politically dicey turf for Democrats.",
    "Still, the result with core party activists was out of step with Fetterman's strength in fundraising and status as a statewide elected officeholder and media darling for his plain speaking, casual dressing and 6-foot-8, bald and tattooed profile.",
    "While his opponents suggested that winning the backing of committee members is an insider's game, Lamb said it was an equal opportunity for each candidate to show party activists who had the best pitch, experience and campaign to win in November.",
    "\"For me, the most important thing was to show these people what I mean when I say 'I will fight for every vote anywhere in our state,' and I think they all saw that for me, and that was why we did so well,\" Lamb said.",
    "The wide-open race for the battleground-state seat being vacated by two-term Republican Sen. Pat Toomey of Pennsylvania is expected to be one of the nation's premier Senate contests this year.",
    "Committee members also endorsed the Shapiro-backed state Rep. Austin Davis for lieutenant governor, giving him their backing via a huge margin over another state lawmaker, Rep. Brian Sims.",
    "Lamb, he said, has been calling caucus members since last summer and showing a commitment to the Latino community, while the other candidates began reaching out in the past couple weeks.",
    "Lamb, he said, had a home-field advantage as a \"master of inside baseball establishment politics\" that have helped Lamb avoid a primary challenge in his three campaigns for Congress.",
    "The Democratic field features John Fetterman, the state's lieutenant governor, plus Montgomery County Commissioner Val Arkoosh and state Rep. Malcolm Kenyatta of Philadelphia.",
    "Lamb had called each committee member multiple times, his campaign said, and sent them mail pieces, including one that crowed that he \"beat the Trump machine three times.\"",
    "A campaign spokesperson shrugged off the vote afterward, saying Fetterman's campaign doesn't \"run through ballrooms, our campaign runs through the people in 67 counties.\"",
    "In an interview after the vote, Kenyatta said the campaign for committee members' votes is the kind of \"traditional politics\" that have continued to fail working people.",
    "Democrats had an easier time endorsing Josh Shapiro, the state's two-term attorney general, in a unanimous voice vote against no competition.",
    "Lamb, a third-term congressman from suburban Pittsburgh, came closest, with 60%, after working for months to win over committee members.",
    "The Republican field is notable for three wealthy and well-connected candidates moving from blue states to run in Pennsylvania.",
    "Its chair, David Rodriguez, said caucus members concluded that Lamb is the best candidate to win November's election.",
    "Winning an endorsement was a high hurdle to clear, requiring two-thirds of the party's roughly 350 committee members.",
    "\"I'm a master of going out and talking to actual people about what's at stake in their life,\" Kenyatta said.",
    "\"I could call Conor Lamb right now and he would pick up the phone,\" Rodriguez said in an interview Friday.",
    "In his speech, Fetterman suggested that he leads the pack in more important ways: polls and fundraising.",
    "Before Saturday, Lamb already had the unanimous endorsement of the party's Latino Caucus.",
    "\"I'm going out and laying out a vision about how we restore the basic bargain.\"",
    "We keep going to every county, every vote, talking to the people.\"",
    "\"The inside game isn't our game,\" spokesperson Joe Calvello said.",
    "Who is running for US Senate in Pennsylvania?",
    "Watch the report in the video player above.",
    "\"So nothing changes for us today.",
    "The primary election is May 17.",
    "We keep doing our thing.",
    "Here's a list"
  ]
}