{
  "id": 3122,
  "mediaId": 2679,
  "date": "2022-02-02",
  "headline": "Company faces criminal charges over pipeline explosion",
  "image": "",
  "link": "https://www.seattletimes.com/business/company-faces-criminal-charges-over-pipeline-explosion/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MICHAEL RUBINKAM",
  "authorUrl": "https://www.seattletimes.com/author/michael-rubinkam/",
  "termIds": [
    0
  ],
  "sentences": [
    "She said Energy Transfer has been discussing the case with Shapiro’s office “and will continue to work with them and look forward to getting these issues resolved.”\nThe state Department of Environmental Protection previously levied a $30 million civil fine on Energy Transfer after determining the company violated numerous regulations during construction of the Revolution pipeline.",
    "An energy company already charged with violating Pennsylvania environmental laws during construction of a multibillion-dollar pipeline system is facing more legal trouble after prosecutors on Wednesday filed a new criminal case alleging its negligence led to the explosion of a different pipeline near Pittsburgh.",
    "ETC Northeast Pipeline LLC, a subsidiary of Dallas-based Energy Transfer LP, botched construction of the Revolution pipeline, a 42-mile pipeline that runs from Butler County to a natural gas processing plant in Washington County, the attorney general’s office alleged.",
    "The financial penalty was part of a 2020 settlement agreement between the environmental agency and ETC in which the state agreed to lift a moratorium on construction permits it had imposed on Energy Transfer nearly a year earlier.",
    "That allowed the company to resume construction on its much larger Mariner East pipeline network, which takes natural gas liquids from the Marcellus Shale gas field in western Pennsylvania to an export terminal near Philadelphia.",
    "A 2018 landslide along the pipeline’s route in Beaver County triggered a gas explosion and fire that destroyed a home, a barn and several cars, collapsed six high-voltage transmission towers, and prompted an evacuation.",
    "In October, Shapiro filed 48 criminal counts against Energy Transfer, accusing the company of illegally releasing industrial waste at 22 sites in 11 counties during construction of Mariner East.",
    "The family whose home was destroyed awakened to a loud roar and saw an “orange glow bright as day” but managed to escape, a grand jury wrote in a report issued Wednesday.",
    "The “explosion happened because of Energy Transfer’s negligence as they built the Revolution pipeline,” Attorney General Josh Shapiro said in a written statement.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe charges “come as no surprise to us, as these are not new or additional claims,” said a company spokesperson, Vicki Granado.",
    "A spill of thousands of gallons of drilling fluid contaminated wetlands, a stream and part of a 535-acre lake at Marsh Creek State Park outside Philadelphia.",
    "An investigation found the landslide was triggered by ETC’s failure to install adequate erosion control equipment at the hillside site.",
    "Shapiro said Energy Transfer ruined the drinking water of at least 150 families statewide.",
    "___\nThis story has been corrected to show that charges were filed Wednesday, not Tuesday.",
    "The company was charged with nine misdemeanor counts under the state’s Clean Streams Law.",
    "The pipeline failed just two weeks after being placed into service.",
    "Energy Transfer said it looks forward to resolving the case.",
    "A conviction could result in fines and restitution.",
    "MICHAEL RUBINKAM"
  ]
}