{
  "id": 3177,
  "mediaId": 2732,
  "date": "2022-01-30",
  "headline": "Editorial: Logical failings with Act 77 challenge, court ruling",
  "image": "",
  "link": "https://triblive.com/opinion/editorial-logical-failings-with-act-77-challenge-court-ruling/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Placing the issue in front of Pennsylvania voters might indeed be the best way of ending the question for good since passing a law with bipartisan support and having it signed by the governor did no good.",
    "Yes, the 2020 and 2021 election cycles proved people were very interested in the ease and accessibility of voting by mail rather than driving to a polling place and standing in line.",
    "That is the law that passed with majority Republican support and some Democrats coming on board to make no-excuse mail-in voting legal in Pennsylvania.",
    "But it is ridiculous to think that same large turnout would persist when removing the ability to vote from the kitchen table instead of a firehall.",
    "If presented to the people, a constitutional amendment to end the … requirement of in-person voting is likely to be adopted,” the opinion states.",
    "On Friday, Pennsylvania’s Commonwealth Court narrowly decided that voting by mail without being sick or working isn’t how things should be done.",
    "However, by placing more questions and amendments on the voter’s plate, it becomes all the more important to have an engaged electorate.",
    "Because the case that came before them was filed by Bradford County Commissioner Doug McLinko and joined by 14 Republican legislators.",
    "It is just as ludicrous as 11 legislators who voted for a law filing a lawsuit that calls their own work unconstitutional.",
    "The five-judge panel that came to that decision split along party lines — three Republicans to two Democrats.",
    "This argument is a Mobius strip of logic, twisting in on itself like a judicial snake eating its legal tail.",
    "Pennsylvania Attorney General Josh Shapiro has vowed to appeal the ruling to the state Supreme Court.",
    "That isn’t the kind of thing that is always noted in a court decision, but this time it has to be.",
    "Numerous legal challenges that said the practice was legal didn’t stop even more legal challenges.",
    "No-excuse mail-in voting has proven to be the most engaging way to bring voters into the process.",
    "“Approximately 1.38 million voters have expressed their interest in voting by mail permanently.",
    "That is perfectly legal and definitely a way to circumvent the governor’s well-used veto pen.",
    "The Commonwealth Court majority opinion outlined a way to make the process constitutional.",
    "The state Legislature increasingly has been doing battle with Gov.",
    "At least not until someone decides it needs to be amended again.",
    "Of those 14 legislators, 11 of them voted for Act 77 in 2019.",
    "Tom Wolf by placing ballot questions before the public.",
    "Just stick it on the ballot and let the voters decide.",
    "But there’s no arguing with amending the constitution.",
    "It isn’t just not legal, the court decided.",
    "Categories: Editorials | Opinion",
    "Except that now it’s not.",
    "At least, for the moment.",
    "It’s unconstitutional.",
    "Why?"
  ]
}