{
  "id": 3183,
  "mediaId": 8481,
  "date": "2022-02-01",
  "headline": "Shapiro looks to fill police vacancies across the state",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2021/08/AP_19134676259496.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/news/regional-news/shapiro-looks-to-fill-police-vacancies-across-the-state/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Marrie",
  "authorUrl": "https://www.wearecentralpa.com/author/aaron-marrie/",
  "termIds": [
    0
  ],
  "sentences": [
    "Establishing law enforcement scholarships could attract more people to the profession and create a more diverse pool of applicants for departments to recruit from\nExpand outreach and recruitment efforts to attract the next generation of first responders, from police officers to social workers.",
    "By helping departments fill vacancies with a state-funded sign-up bonus we can reduce wasteful competition between departments, tackle today’s shortage, and ensure a pipeline of highly trained, experienced officers for departments of all sizes.",
    "With new data from Pennsylvania Emergency Management Agency (PEMA) and the Municipal Police Officers’ Education and Training Commission (MPOETC), it confirmed Shapiro’s concerns across the state of Pennsylvania.",
    "If we do not thank our first responders, we risk losing more talent and making current shortages even worse\nExpand and guarantee Act 89 funding to cover the cost of training cadets.",
    "The funding has an annual cap, so MPOETC may not be able to maintain their current levels of support if police chiefs successfully recruit the number of cadets needed statewide.",
    "We owe a debt of gratitude to the people who have taken on extra shifts and worked longer hours, under the toughest conditions of their careers, to protect Pennsylvanians.",
    "$1,200 in hero pay for first responders and 911 operators to recognize and retain the honorable police officers, firefighters and emergency personnel we have today.",
    "Currently, Act 89 only covers a portion of the cost local police departments incur to send cadets to a municipal police academy to receive their Act 120 training.",
    "We need to jumpstart interest in public safety careers and a sign-up bonus will attract candidates and make clear we value police and public safety personnel.",
    "WTAJ– Attorney General Josh Shapiro is looking to fill vacancies in Pennsylvania police departments and is outlining incentives to bring in more officers.",
    "Shapiro closes his announcement by saying he looks forward to the challenge and wants to recognize first responders and public safety personnel.",
    "Looking at the data, one-third of MPOETC’s accredited law enforcement agencies report having 1,229 officer vacancies, Shapiro’s release states.",
    "While some states and many private sector employers have given additional compensation to frontline workers, Pennsylvania has not done enough.",
    "The Commonwealth should establish a grant program to fund recruitment and outreach efforts to introduce young adults to public safety careers.",
    "In an announcement Tuesday, Feb. 1, Shaprio said he grew concerned about Pa police departments being “stretched thin” last year.",
    "Shapiro says we must help hire the next generation of officers for local police departments to return to their intended size.",
    "Guaranteeing state support and covering a greater portion of these costs will help police departments recruit officers.",
    "Tuition at municipal police academies can be a barrier for people who cannot afford to start a public safety career.",
    "Strained departments often cannot take officers off patrol duty to attend a career workshop or job fair.",
    "Create new scholarships up to $8,500 for Act 120 training to expand and diversify recruitment efforts.",
    "A $6,000 sign-up bonus for new officers and public safety personnel who join local forces in need.",
    "With Shaprio’s announcement, he offered multiple proposals to help combat the crisis.",
    "The state should explore similar programs for other public safety professions."
  ]
}