{
  "id": 3212,
  "mediaId": 8356,
  "date": "2022-02-02",
  "headline": "Primary 2022: Hot races for governor, U.S. Senate, plus what you need to know about voting",
  "image": "https://www.gannett-cdn.com/-mm-/61139cc29e99b8c4dc307e3e9a3e39c9c2e21f7c/c=0-716-2429-2088/local/-/media/2016/03/31/PAGroup/YorkDailyRecord/635950274628927414-primary-stock-photo.jpg?width=2429&height=1372&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.ydr.com/story/news/2022/02/02/primary-2022-central-pa-what-voters-need-know-seats-up-election/6561216001/",
  "mediaOutlet": "ldnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Teresa Boeckel",
  "authorUrl": "https://www.ydr.com/staff/4395323002/teresa-boeckel/",
  "termIds": [
    0
  ],
  "sentences": [
    "More than a dozen Republicans are running, including:\nLou Barletta, a former U.S. congressman\nJake Corman, the state Senate president pro tempore\nCharlie Gerow, a longtime Republican strategist and CEO of a Harrisburg public relations firm\nMelissa Hart, a former member of the U.S. House\nScott Martin, a state senator from Lancaster County\nDoug Mastriano, a state senator from Franklin County\nWilliam McSwain, a former U.S. attorney for the Eastern District of Pennsylvania\nJoe Gale, Montgomery County commissioner\nShawn Berger, restaurateur\nGuy Ciarrocchi, CEO of the Chester County Chamber of Business and Industry\nJason Monn, restaurateur and former mayor\nJason Richey, lawyer\nJohn Ventre, retired UPS executive\nDave White, former Delaware County council member\nNche Zama, cardiothoracic surgeon.",
    "Others include:\nAlexandria Gloria Khalil, a mom and former business owner and educator\nKyle Norton, a campus safety and security consultant in Philadelphia\nMartin Rosenfeld, a deputy sheriff in Elk County\nWalter Steve Sluzynsky\nLlewellyn Tapera, works in retail\nAmong the Republicans are: television show host Dr. Mehmet Oz; Jeff Bartos, a 2018 candidate for lieutenant governor; Kathy Barnette, a Fox News commentator, author and veteran from Montgomery County; and Carla Sands, a former ambassador to Denmark under President Donald Trump, who lives in Cumberland County; David McCormick, a hedge fund manager, veteran and former Treasury official in the President George W. Bush administration.",
    "Here are the seats that will be up for election:\nAdams County\nState House\nDistrict 91, covers part of Adams County\nDistrict 193, covers parts of Adams and Cumberland counties\nState Senate\nNone\nFranklin County\nState House\nDistrict 78, covers Fulton County and parts of Franklin and Bedford counties\nDistrict 82, covers Juniata County and parts of Franklin and Mifflin counties\nDistrict 89, covers part of Franklin County\nDistrict 90, covers part of Franklin County\nState Senate\nDistrict 30, covers Blair and Fulton counties and parts of Cumberland, Franklin and Huntingdon counties.",
    "York County\nState House\nDistrict 47, covers part of York County\nDistrict 92, covers parts of York and Cumberland counties\nDistrict 93, covers part of York County\nDistrict 94, covers part of York County\nDistrict 95, covers part of York County\nDistrict 169, covers part of York County\nDistrict 196, covers part of York County\nState Senate\nDistrict 28, covers part of York County\nDistrict 48, covers Lebanon County and parts of Dauphin and York counties.",
    "How to contact your elections office\nAdams County\nDirector: Angie Crouse\nAddress: Elections & Voter Registration, 117 Baltimore St., Gettysburg, PA 17325\nPhone: (717) 337-9832\nFranklin County\nChief Registrar: Jennie M. Aines\nAddress: Franklin Voter Registration Office, 157 Lincoln Way East, Chambersburg, PA 17201\nPhone: (717) 261-3886\nWebsite: franklincountypa.gov\nLebanon County\nDirector: Sean D.",
    "Others include:\nJohn Debellis, a small business owner\nSean Gale, a Montgomery County attorney\nRonald Edward Johnson II, a U.S. Army Veteran\nEverett Stern, owns an intelligence firm in Chester County\nJoseph John Vodvarka\nU.S. Congress\nVoters also will be selecting representatives for Congress.",
    "Address: Elections & Voter Registration, Municipal Building, Room 209, 400 South 8th St., Lebanon, PA 17042\nPhone: (717) 228-4428\nYork County\nDeputy ?Director: Anne S. Mendoza\nAddress: York County Administrative Center, 28 E. Market St., York, PA 17401\nPhone: (717) 771-9604",
    "U.S. Senate race in Pennsylvania:Here's who is running, so far\nPa. governor's race: Here's everything you need to know about who's running in 2022\nThe primary is closed, meaning only registered Democrats and Republicans may vote on candidates in their respective parties.",
    "Lebanon County\nState House\nDistrict 101, covers part of Lebanon County\nDistrict 102, covers part of Lebanon County\nDistrict 104, covers parts of Lebanon and Dauphin counties\nState Senate\nDistrict 48, covers Lebanon County and parts of Dauphin and York counties.",
    "District 10, covers Dauphin County and parts of Cumberland and York counties\nDistrict 11, covers Lancaster County and part of York County\nDistrict 13, covers Adams, Franklin, part of Cumberland County and more.",
    "It's only a few months until the May 17 primary, when Pennsylvania voters will nominate candidates for a number of high-profile positions, including governor, U.S. Senate and Congress.",
    "Know this\nAn appellate court ruled last month that voting by mail is unconstitutional, but the state is appealing the decision to the Pennsylvania Supreme Court.",
    "It has no immediate effect on mail-in voting, and those who wish to cast a mail ballot should request one, according to the Pennsylvania Department of State.",
    "Here's what voters need to know:\nU.S. Senate seat\nDozens of candidates are running for a U.S. Senate seat currently held by Sen. Pat Toomey, R-Lehigh County.",
    "The state has been working on new congressional maps based on the 2020 U.S. census data, and the boundaries of the districts have not been determined.",
    "The county election office will send out an application that must be completed and returned in order to receive a mail ballot.",
    "Mail-in ballot: Apply for a no-excuse mail-in or absentee ballot online at vote.pa.gov or contact the local elections office.",
    "Closer to home, voters also will be choosing candidates for senators and representatives to the state's General Assembly.",
    "New congressional and legislative maps have not been finalized, and it could end up delaying the primary.",
    "Here are the positions that are up for re-election:\nDistrict 9, covers Lebanon as well as other areas.",
    "Tom Wolf, a Democrat, has served two terms, and under state law cannot seek re-election for a third.",
    "Josh Shapiro, the current Pennsylvania attorney general, is the only Democrat running for governor.",
    "John Fetterman, U.S. Rep. Conor Lamb, state Rep. Malcolm Kenyatta, and State Senator Sharif Street.",
    "Many Democratic and Republican candidates already have announced the seats they plan to seek.",
    "General Assembly seats\nVoters also will be picking candidates for state House and Senate.",
    "Voters who signed up to be on the annual mail ballot list must take action each year.",
    "Find the status of your voter registration online at vote.pa.gov.",
    "Polls are open from 7 a.m. to 8 p.m.\nAre you registered?",
    "Primary day information\nWhen: Tuesday, May 17.",
    "Governor, lieutenant governor\nGov.",
    "The deadline to register is May 2.",
    "Among the Democrats are: Lt. Gov.",
    "The deadline to apply is May 10.",
    "Use a mail ballot?",
    "He is retiring.",
    "Drasher????"
  ]
}