{
  "id": 3229,
  "mediaId": 6404,
  "date": "2022-02-04",
  "headline": "Democrat Candidate for Texas Governor Beto O’Rourke ‘Not Interested’ In Help From Joe Biden",
  "image": "https://americanlookout.com/wp-content/uploads/2019/09/Beto-guns.jpg",
  "link": "https://americanlookout.com/democrat-candidate-for-texas-governor-beto-orourke-not-interested-in-help-from-joe-biden/",
  "mediaOutlet": "americanlookout.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://americanlookout.com/author/aleister/",
  "termIds": [
    4905,
    5518,
    3926,
    3989,
    3503,
    392,
    6175,
    6653
  ],
  "sentences": [
    "The Washington Examiner reports:\nBiden finds few friends on campaign trail\nPresident Joe Biden says he wants to spend more time outside the White House in 2022, but if it’s to hit the campaign trail, he may have a difficult time filling his schedule ahead of the midterm elections.",
    "“The avoidance of the president by members of his own party is perhaps the biggest proof that his presidency has been a disaster.”\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nAnd it’s no wonder why, Ortiz added.",
    "Texas gubernatorial hopeful Beto O’Rourke has said he’s “not interested” in help from Biden, and Florida Senate candidate Val Demings answered that she was “running [her] race” when asked if she wanted Biden to campaign with her.",
    "“Moderate Democrats in purple and red states don’t want to be associated with President Biden because his failed presidency will drag down their electoral chances,” said Alfredo Ortiz, president and CEO of Job Creators Network.",
    "Several high-profile Democratic candidates have already skipped out on appearing with Biden, including Georgia gubernatorial candidate Stacey Abrams and Pennsylvania Democrats John Fetterman and Josh Shapiro.",
    "Far left Democrat Beto O’Rourke, who is running for governor of Texas for some reason, has recently said that he is not interested in help from President Joe Biden.",
    "Can you even imagine how crazy the Democrats are going to become if Biden insists on running again in 2024?",
    "Members of his own party do not want to be seen in public with him and for obvious reasons.",
    "To the president’s critics, it all adds up to one more sign that he’s failing.",
    "He has become an anchor around the necks of vulnerable Democrats.",
    "This is terribly embarrassing for Biden and the Democrat party.",
    "This is how politically toxic Joe Biden has become."
  ]
}