{
  "id": 3241,
  "mediaId": 8504,
  "date": "2022-01-28",
  "headline": "Court finds Pennsylvania mail-in voting law unconstitutional, appeal anticipated",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/01/4dee0343c444402ebedd97e58d9d1850-1-e1632487835838.jpg?w=1280",
  "link": "https://www.yourerie.com/news/court-finds-pennsylvania-mail-in-voting-law-unconstitutional/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/?post_type=profile&p=1032698",
  "termIds": [
    0
  ],
  "sentences": [
    "The Department added that they are “notifying all county election boards that they should proceed with all primary election preparations as they were before today’s Commonwealth Court ruling.”\nPennsylvania Attorney General Josh Shapiro, who is also running for Governor, tweeted that he is “confident that Act 77 will ultimately be upheld as constitutional.”\nThe court’s ruling and opinion issued by President Judge Emerita Mary Hannah Leavitt can be read below:\nIn 2019 Governor Tom Wolf said Act 77 made voting “more convenient and more secure for millions of Pennsylvanians.”\nJust over 2.5 million people voted under the law in 2020's presidential election, most of them Democrats, out of 6.9 million total cast.",
    "PA Department of State\nThe Department of State announced that the ruling has “no immediate effect on mail-in voting” and that voters should request their mail-in ballots for the May primary election.",
    "Acting Secretary of the Commonwealth of Pennsylvania Veronica Degraffenreid argued that the challenge to no-excuse mail-in voting lacked standing and that the challenge was untimely filed.",
    "According to court documents, 14 members of the Pennsylvania House of Representatives filed a petition to block the 2019 law that would allow any qualified voter to vote by mail.",
    "The law allowed voters to submit a ballot by mail up to 50 days before an election and placed voters on a list to permanently receive a ballot application by mail.",
    "Act 77 also outlined rules for voting machine decertification and appropriated funding for voting machine upgrades that provide a verifiable paper trail.",
    "The decision, by a five-judge Commonwealth Court panel of three Republicans and two Democrats, could be put on hold immediately by an appeal from Gov.",
    "(WHTM) – The Commonwealth Court of Pennsylvania has found the commonwealth’s no-excuse mail-in voting law, Act 77, is unconstitutional.",
    "The Department of State disagrees with today’s ruling and is working to file an immediate appeal to the Pennsylvania Supreme Court.",
    "It also established 15 more days to register to vote and extended mail-in and absentee submission deadlines.",
    "Tom Wolf’s administration to the state Supreme Court.",
    "The Associated Press contributed to this story"
  ]
}