{
  "id": 3269,
  "mediaId": 2668,
  "date": "2022-01-28",
  "headline": "Biden's Brain Turns to Confetti in Real Time During PA Remarks",
  "image": "https://media.townhall.com/townhall/reu/o/2021/343/007b42e7-5c8f-465b-865d-43bb89fbbe16-1110x740.jpg",
  "link": "https://redstate.com/nick-arama/2022/01/28/bidens-brain-turns-to-confetti-in-real-time-during-pa-remarks-n514129",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Arama",
  "authorUrl": "https://redstate.com/author/nick-arama",
  "termIds": [
    0
  ],
  "sentences": [
    "He kind of made a joke about Fetterman here, who ended up being present (despite initially saying he wouldn’t be), saying if he had Fetterman in front of him, he “could have made All-American.” Fetterman is built like a Mack truck, but that still wouldn’t have helped Biden’s football skills and grades.",
    "But Biden faced a different problem when he arrived — while some Democrats were in attendance to greet him, people like State Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, were not there to meet with him because of “scheduling conflicts.” Lt. Gov.",
    "pic.twitter.com/cccjj9Dq2h\n— RNC Research (@RNCResearch) January 28, 2022\nBiden has previously lied about his athletic prowess, claiming he hit a home run at a Congressional baseball game in the 1970s, but there is no record that ever happened.",
    "— Townhall.com (@townhallcom) January 28, 2022\nFinally, Biden wraps up and completely forgets his “patriotic duty” to mask up — which he repeatedly urges on other Americans — as he then goes to everyone and shakes hands, unmasked.",
    "Biden couldn’t seem to remember his name and then called him “Mayor of Louisiana.”\nWATCH: Biden forgets his infrastructure czar Mitch Landrieu’s name for AT LEAST the third time, calling him the “mayor of LOUISIANA.\"",
    "pic.twitter.com/Eeev09auVo\n— RNC Research (@RNCResearch) January 28, 2022\nThen Biden spoke about his infrastructure czar, in charge of the distribution of dollars, former mayor of New Orleans, Mitch Landrieu.",
    "pic.twitter.com/XXAhTR6GuU\n— RNC Research (@RNCResearch) January 28, 2022\nBiden previously called Landrieu “Mitch McCo–,” seemingly confusing him with Senate Majority Leader Mitch McConnell (R-KY).",
    "We’re seeing that a lot, as Democrats are deflecting questions about Biden or avoiding being with him, treating him like he’s poison because of his horrible polling numbers, as we noted earlier.",
    "Maybe one of the reasons that they don’t want to meet with Biden or have him in to help with their campaigns is he might not be able to even remember their names or what positions they hold.",
    "We saw Stacey Abrams, who is a candidate for governor of Georgia, having a “scheduling conflict,” too, when Biden was in Georgia to talk about ‘voting rights’ — her chief issue.",
    "A maskless Biden shakes hands indoors despite calling mask wearing a “patriotic duty.” pic.twitter.com/GBwebThfBz\n— RNC Research (@RNCResearch) January 28, 2022",
    "Infrastructure is desperately needed, but I wouldn’t trust for a minute that money allocated by Democrats will go to the things that need infrastructure help.",
    "1/2 pic.twitter.com/8KMklcKpHS\n— Mike Doyle (@USRepMikeDoyle) January 28, 2022\nSo, he used that as a talking point about the importance of infrastructure.",
    "Biden needs to keep up with the news — the court just found the ‘law’ under which Pennsylvania allowed no excuse mail-in voting to be unconstitutional.",
    "I’ve been in touch with the White House, @gainey_ed and @ACE_Fitzgerald to ask for help and facilitate coordination on rebuilding it.",
    "But, they also should tell him how he’s going about it is just wrong — because it just doesn’t come across well at all.",
    "Beto O’Rourke, who is going to run for governor in Texas, said outright he had no need for Biden to help his campaign.",
    "Here he goes again, with this crazy thing that inflation is because of higher costs, and the price of vehicles.",
    "pic.twitter.com/67hXd91x2s\n— Townhall.com (@townhallcom) January 28, 2022\nAll costs are up across the board.",
    "When talking about Rep. Conor Lamb (D-PA), Biden got his position wrong, referring to him as a senator.",
    "John Fetterman declined, as well, but ended up changing his mind after the bridge collapse.",
    "BIDEN: \"One third of the inflation in America is a consequence of the cost of automobiles.\"",
    "This makes me think again about the fact that uncontrolled anger is often part of dementia.",
    "Joe Biden traveled to Pittsburgh today to talk about Build Back Better and infrastructure.",
    "WATCH: Biden bizarrely says he \"could have been an All-American\" college football player.",
    "Hours before he got there, the Forbes Avenue bridge collapsed, injuring 10 people.",
    "Someone must have told him that sometimes one does voice modulation for emphasis.",
    "He quit the freshman football team his FIRST semester because of poor grades.",
    "The Forbes Avenue bridge collapse is a major challenge for our community.",
    "Biden also keeps doing that weird whispering thing that is truly creepy.",
    "It will disrupt transportation in PGH for months at least.",
    "He loses it on the question of the cost of insulin.",
    "That’s like saying high costs cause high costs.",
    "Does he not understand what inflation is?",
    "Biden never even played a full season.",
    "Biden says Conor Lamb is a \"senator.\"",
    "He's not.",
    "Huh?"
  ]
}