{
  "id": 3299,
  "mediaId": 8504,
  "date": "2022-01-28",
  "headline": "Biden visits collapsed bridge, touts infrastructure law",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/01/AP22028671390323-2.jpg?w=1280",
  "link": "https://www.yourerie.com/news/western-pa-news/biden-visits-collapsed-bridge-touts-infrastructure-law/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.wearecentralpa.com/author/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "3 House Democrat, refused to say whether vulnerable Democrats on the ballot this fall should embrace the label “Biden Democrat.”\n“I want every Democrat to run as Democrats who deliver,” Hoyer told Politico when asked directly about “Biden Democrats.”\nThe White House announced Biden’s trip on Monday after the president said last week he would look to get out of Washington more in the second year of his presidency.",
    "As for the rest of the nation’s aging bridges, he pledged, “We’re gonna fix them all.”\nThe bridge collapse — which caused no fatalities but prompted rescuers to form a human chain to retrieve people from a precariously perched bus — offered Biden a striking example of what he has declared is an urgent need for investments in the country’s infrastructure.",
    "PITTSBURGH, PA (AP) — Arriving just hours after a serious bridge collapse, President Joe Biden stared into the cratered muddy earth where the aging span fell early Friday, striking evidence supporting the $1 trillion infrastructure law he already had planned to tout on his trip to Pittsburgh.",
    "And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president.",
    "Biden, who has seen his poll numbers sink in the midst of an unrelenting pandemic and high inflation, said it was important that he “go out and talk to the public” about what he’s accomplished and about why Congress needs to get behind the rest of his domestic agenda.",
    "During his visit, Biden was to tour a manufacturing research and development center before delivering remarks promoting economic progress during his first year in office and the investments his administration has helped foster in American manufacturing jobs.",
    "He was also expected to call on Congress to pass new legislation aimed at increasing U.S. competitiveness with China and invest billions to support supply chain resilience and semiconductor chip research and manufacturing.",
    "The infrastructure law signed by Biden has earmarked about $1.6 billion for Pennsylvania bridge maintenance, with tens of billions more for public transit, highway maintenance and broadband internet expansion in the state.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "Earlier in the month, Georgia Democrat Stacey Abrams, a leading candidate for governor in another swing state, skipped a chance to appear with the president in the state, citing an unspecified scheduling conflict.",
    "But two of the three leading Democrats on Pennsylvania’s statewide ballot this spring who were invited to appear with Biden were not attending, their campaigns confirmed on the eve of the president’s visit.",
    "The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.",
    "“He’ll be talking about how far we’ve come in getting our economy moving again, making more right here in America, and ensuring all workers benefit,” Psaki told reporters at the White House on Thursday.",
    "The steel span was built in 1970, and a 2019 inspection revealed the deck and superstructure to be in poor condition, according to the U.S. Department of Transportation’s National Bridge Inventory.",
    "The Pennsylvania battle to replace Republican Sen. Pat Toomey, who is not seeking reelection, is expected to be one of the most competitive Senate races this year.",
    "Standing before concrete barriers papered with yellow police tape, Biden craned his neck to look out over the expanse left by the crumbled bridge.",
    "Friday’s trip was an opening step in a broader campaign to promote White House achievements in key states before the midterm elections.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "Last week, Texas Democrat Beto O’Rourke said he didn’t need the Democratic president’s assistance in his campaign for governor.",
    "He spoke with first responders at the scene and Pittsburgh Mayor Ed Gainey, as a light snow dusted the wreckage.",
    "And in the weeks since, several other notable Democrats have seemed to distance themselves from Biden as well.",
    "“The idea that we’ve been so far behind on infrastructure for so many years, it’s mind boggling,” Biden said.",
    "While in Pittsburgh, Biden will focus on the economy, according to White House press secretary Jen Psaki.",
    "Associated Press writers Aamer Madhani and Alexandra Jaffe in Washington contributed to this report.",
    "It brought Biden, a Pennsylvania native, home to one of the top-targeted states this cycle.",
    "All three had been invited to participate in a photo line with the president.",
    "And this week, Rep. Steny Hoyer, the No.",
    "Peoples reported from New York.",
    "Lt. Gov."
  ]
}