{
  "id": 339,
  "mediaId": 8254,
  "date": "2022-02-21",
  "headline": "Majority of Pennsylvanians undecided in GOP Governor race, Barletta holds lead",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/GettyImages-958986602.jpg?w=1280",
  "link": "https://www.abc27.com/election/majority-of-pennsylvanians-undecided-in-gop-governor-race-barletta-holds-lead/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "The group’s polling methodology consists of a nine question questionnaire using live callers, integrated voice response, text messages, emails, and other proprietary digital methods not disclosed by the group.",
    "(WHTM) – A poll of likely Pennsylvanian Republican voters shows a majority are still undecided on who to vote for in the Republican primary race for Governor.",
    "The poll, conducted by The Trafalgar Group, interviewed 1,070 likely Pennsylvania Republican voters with 29 percent either undecided or likely not to vote.",
    "Scott Martin, who suspended his campaign for Governor due to on-going medical issues caused by his recent leg injury, finished fifth with four percent.",
    "More than 13 percent said they supported another candidate in the crowded gubernatorial field that includes nine candidates not named in the poll.",
    "Congressman Lou Barletta led the list of candidates with 24.1 percent followed by State Senator Doug Mastriano at 19.9 percent.",
    "President Pro Tempore of Pennsylvania’s Senate Jake Corman was third among the listed candidates with 5.1 percent.",
    "The Trafalgar Group says the poll was conducted with 95 percent confidence and a 2.99 percent margin of error.",
    "An exact breakdown of how each age group, gender, and ethnicity responded to the poll was not released.",
    "More than 87 percent of the respondents were white and 42.1 percent were in the 45-64 age range.",
    "State Attorney General Josh Shapiro is currently the only Democrat running for Governor in 2022.",
    "Former U.S. Attorney William McSwain placed fourth with 4.4 percent in the Trafalgar Group poll.",
    "A majority of respondents (53.2 percent) were male."
  ]
}