{
  "id": 3390,
  "mediaId": 8500,
  "date": "2022-01-31",
  "headline": "Faith, community organizations request changes to investigation of Peter Spencer's death",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/vlcsnap-2022-01-31-22h58m57s666-1643687953.png?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wtae.com/article/peter-spencers-death-investigation-venango-county/38946927",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kalea Gunderson",
  "authorUrl": "https://www.wtae.com/news-team/b4b63f68-33d8-4f90-870e-aa6060f8ddaa",
  "termIds": [
    0
  ],
  "sentences": [
    "Bush signed the letter as well, backing Spencer’s family in a list of demands they have already made, which includes asking the District Attorney White to turn over the case to the state Attorney General’s Office, and requests the U.S. Attorney for Western Pennsylvania and the FBI step in.",
    "\"It's important for us to have confidence in law enforcement and what they’re doing because we know that they are very dedicated people, but we also feel it's important for us to be vocal when we feel that there are situations that are not being handled correctly,\" Merrick said.",
    "PITTSBURGH —\nA group of nearly 100 people from various faith and community organizations sent a letter to state and federal law enforcement agencies, requesting the investigation into Peter Spencer's death be handed over to the State Attorney General Josh Shapiro.",
    "The state Attorney General's Office said in a statement, \"Under Pennsylvania law, our office does not have jurisdiction to investigate non-fatal shootings and homicides absent a referral from the district attorney for either a conflict or resource need.\"",
    "\"Our hope is that there will be justice in this case for Peter Spencer, and we’re not at all convinced right now that that’s unfolding that way,\" Tracy Merrick said.",
    "The U.S. Attorney’s Office of Western Pennsylvania said the office has received the letter and has referred it to the proper investigative agency for review.",
    "Officials said Spencer was found shot nine times on Carl's Road in Rockland Township on Dec. 12, after spending time with a former co-worker and others.",
    "\"I would ask that the district attorney step back and allow others to come alongside you to make sure justice is posted for Peter Spencer,\" said Rev.",
    "It also asks the Venango County Coroner to share all information regarding the autopsy to pathologist Dr. Cyril Wecht immediately.",
    "Based on statements made by White earlier this month, he expects the autopsy report to be complete within the next three weeks.",
    "The Pennsylvania State Police's Heritage Affairs Section that investigates hate or bias-related crimes is involved in the case.",
    "He is one of the 97 people expressing concern about how the investigation into Spencer’s death is being handled.",
    "The Venango County District Attorney's Office did not respond to requests for comment on this letter.",
    "New information released on death of Jamaican immigrant Peter Spencer in Venango County",
    "The case is in the hands of Venango County District Attorney Shawn White.",
    "Merrick is a member of the First United Methodist Church of Pittsburgh.",
    "Randy Bush, pastor of East Liberty Presbyterian Church.",
    "The FBI could not comment.",
    "Rev."
  ]
}