{
  "id": 3483,
  "mediaId": 8467,
  "date": "2022-02-02",
  "headline": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/02/Grave_marker_company_sued_again_1-1.jpg?w=1024&h=830",
  "link": "https://www.thereporteronline.com/2022/02/02/shapiro-sets-campaign-cash-record-to-start-election-year/",
  "mediaOutlet": "Timeschronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.thereporteronline.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "No other reports on file came close, although Bill McSwain, a white-collar defense attorney who was the top federal prosecutor in Philadelphia under former President Donald Trump, has the endorsement of an organization that is a conduit for campaign cash from billionaire Jeffrey Yass.",
    "Shapiro, whose campaign report was posted online by the state after Monday night’s reporting deadline, is not expected to face opposition in the primary and has unified the party, getting endorsements from its state committee and biggest allies, including the AFL-CIO.",
    "By MARC LEVY\nHARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General Josh Shapiro, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "Dave White, who runs a large plumbing and HVAC firm in Delaware County, loaned himself $3 million and led the field with almost $2.5 million in the bank.",
    "The double-digits deep field of Republican candidates vying for the party’s nomination reported relatively anemic fundraising through Dec. 31.",
    "He reported raising $13.4 million in 2021, boosted by labor unions and big checks in a state that puts no limits on individual contributions.",
    "Labor unions gave Shapiro more than $3 million in 2021, while donors who gave at least $50,000 kicked in more than $5.4 million.",
    "The organization, he told a Republican audience last week, is prepared to spend up to $20 million on his campaign.",
    "Jake Corman, the state Senate’s ranking Republican, reported just over $2 million in the bank.",
    "___\nFollow Marc Levy on Twitter at https://www.twitter.com/timelywriter.",
    "The primary election is May 17."
  ]
}