{
  "id": 3490,
  "mediaId": 8314,
  "date": "2022-02-03",
  "headline": "A look at the two gay candidates running statewide",
  "image": "",
  "link": "https://epgn.com/2022/02/03/a-look-at-the-two-gay-candidates-running-statewide/",
  "mediaOutlet": "epgn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Segal",
  "authorUrl": "https://epgn.com/author/mark/",
  "termIds": [
    0
  ],
  "sentences": [
    "If you break down the advantages of the candidates, they fall into these columns: Fetterman has the money; Lamb has major support from Democratic leaders throughout the state; but Malcolm has his passion and eloquence, and that he has outperformed and impressed the state’s politicos.",
    "No one at the state committee knows where the race for Senate will go, and so long as Malcolm continues to create a grassroots and diverse ground of support he holds well for his future.",
    "For Malcolm, his campaign has caught fire by his passion and by a continuous stream of endorsements from his fellow state representatives, mayors, unions, and progressive organizations.",
    "Governor race, Brian lost by almost 3 to 1 in the voting, and Austin Davis, an African American State Rep from Western PA, was endorsed and has the statewide party behind him.",
    "The November race for Governor is of the utmost importance to our community and it will be a tough fight, especially if it were two white men from Philadelphia on the ballot.",
    "First, the State Democratic Convention voted on endorsements on January 29, and the financial filings of campaign committees over the last year were filed January 31.",
    "Malcolm is in a race where it’s an open primary, while Brian is in a race where the Democratic party and the candidate for Governor have united behind a candidate.",
    "In the Senate race, Malcolm had enough support at the convention to get the party to not endorse any candidate and to therefore have an open primary in May.",
    "And we in the LGBT community have two statewide races where members of our community are involved: for U.S. Senate, Malcolm Kenyatta; and for Lt.",
    "He was endorsed by Shapiro for a number of reasons, notably among them that in today’s climate you simply can not run a team for Governor and Lt.",
    "Malcolm’s success at raising funds, gaining endorsements, and preventing an endorsement by the State Committee is remarkable.",
    "Both Malcolm and Brian should get credit for truly working the last year by going around the state and seeking support.",
    "Governor Fetterman, Congressman Conor Lamb, and Chair of the Montgomery County Board of Commissioners Val Arkoosh.",
    "Fetterman has the most funds in the bank, and Lamb has deep party support but was not able to get an endorsement.",
    "Brian’s opponent in the race, Austin Davis, was endorsed by Josh Shapiro, the Democratic candidate for Governor.",
    "Malcolm on the other hand is in a completely different position statewide due to the nature of the Senate race.",
    "If Brian stays in the race, the party has to work a primary and waste valuable funds and time.",
    "As the Associated Press recently reported, Pennsylvania politics is in the national spotlight.",
    "Malcolm has out performed on every level and continues to grow a diverse coalition.",
    "Brian’s campaign simply did not get the same level of grassroots or party support.",
    "While many in our community were rooting for Brian, he simply didn’t deliver.",
    "For Brian it’s almost the opposite, and there is one factor that stands out.",
    "So, why did Malcolm do so well and Brian so poorly on both outcomes?",
    "Both those races changed in the last few days due to two events.",
    "Malcolm simply works with people, and his passion is believable.",
    "There are a few simple facts from the outcome of the two events.",
    "Governor that is made up of two white men from Philadelphia.",
    "Both are still in the race, but there is a major difference.",
    "They would rather focus on the November general election.",
    "The Democrats do not wish to use all their efforts now.",
    "Then there are campaign filings from the candidates.",
    "His major opponents in the race are current Lt.",
    "For 2021, Brian raised a little over $600,000.",
    "Malcolm raised just over $1.6 million.",
    "Brian should not act as a spoiler.",
    "Governor, Brian Sims.",
    "Bottom line.",
    "In the Lt."
  ]
}