{
  "id": 4355,
  "mediaId": 8254,
  "date": "2022-01-19",
  "headline": "Mike Turzai opts against run for Governor of Pennsylvania in 2022",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2020/06/1000-9.jpeg?w=1280",
  "link": "https://www.abc27.com/news/this-week-in-pennsylvania/pennsylvania-politics/mike-turzai-opts-against-run-for-governor-of-pennsylvania-in-2022/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Owens",
  "authorUrl": "https://www.abc27.com/author/dennis-owens/",
  "termIds": [
    0
  ],
  "sentences": [
    "Although I will always be grateful for the many kind messages and well wishes I received, for now focusing on family and work is what matters most.”\nMike Turzai\nIn November sources told ABC27 that Turzai would enter a Gubernatorial race that now includes more than a dozen candidates vying for the Republican nomination.",
    "While Pennsylvania Attorney General Josh Shapiro is the only Democrat seeking to succeed outgoing Governor Tom Wolf, there are 14 Republicans who have thrown their hats into the ring.",
    "I was honored to serve the Commonwealth as Speaker making a positive difference advancing school choice, energy independence, renewed manufacturing and the protection of the unborn.",
    "Sign up for the abc27 newsletters here\nTurzai served as a Representative in the Pennsylvania House from 2001 to June of 2020 and was Speaker of the House starting in 2015.",
    "“While I did not formally announce my candidacy for Governor, I was encouraged by friends and supporters to consider running this year.",
    "HARRISBURG, Pa. (WHTM) – Former Pennsylvania Speaker of the House Mike Turzai tells ABC27 that he will not run for Governor in 2022.",
    "Turzai confirmed his decision with WHTM’s Dennis Owens in a statement on Wednesday afternoon.",
    "Two weeks ago Republican State Senator Doug Mastriano announced that he would join the race.",
    "Get daily news, weather, and breaking news alerts straight to your inbox!",
    "He also served as the House Majority Leader from 2011 to 2014."
  ]
}