{
  "id": 4375,
  "mediaId": 8452,
  "date": "2022-01-26",
  "headline": "Josh Shapiro speaks to Temple Jewish Law Students Association",
  "image": "https://ttn-media.s3.amazonaws.com/wp-content/uploads/2022/01/25210237/Screen-Shot-2022-01-25-at-6.22.50-PM-min.png",
  "link": "https://temple-news.com/josh-shapiro-speaks-to-temple-jewish-law-students-association/",
  "mediaOutlet": "temple-news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fallon Roth",
  "authorUrl": "https://temple-news.com/author/fallonroth/",
  "termIds": [
    0
  ],
  "sentences": [
    "“And then two, to make sure that our laws are reflective of a Commonwealth that seeks to value and protect all.”\nShapiro also discussed his political career, reflecting on challenges he faced in 2004 while campaigning as a Democrat in a primarily Republican district for a seat in the Pennsylvania House of Representatives.",
    "“A tool that will allow you not just to understand the law, but hopefully to use the law to empower and advance others, to draw on our shared faith and our teachings that teach us about service to others.”\nLawyers must use their skills to fight against antisemitism and other forms of bigotry, Shapiro added.",
    "As a gubernatorial candidate in the 2022 election, Shapiro’s campaign focuses on creating safe communities, lowering taxes to promote economic growth, providing affordable higher education options and expanding vocational, technical and computer-based educational options for students.",
    "“I went to Harrisburg with a whole bunch of big ideas, ideas that I had accumulated along the way when I was knocking on people’s doors and listening to them, and I quickly found that Harrisburg was a place that loved the status quo,” Shapiro said.",
    "Temple’s JLSA invited Shapiro to speak because he was accessible and relevant to the organization because of his religion, legal career and political involvement in Pennsylvania, said Natan Yakov, JLSA’s co-president and a second-year law student.",
    "Now as Pennsylvania’s attorney general, Shapiro shared stories about the role of faith in his upbringing during a virtual event Tuesday night hosted on Zoom by Temple University’s Jewish Law Students Association.",
    "Dan Yosipovitch, a third-year law student and the other co-president of Temple’s JLSA, hopes the law students who attended the event will relate to and learn from Shapiro’s experience.",
    "“Continue to do the important law enforcement work that we do to hold those accountable, who bring hate and hateful conduct and violent conduct into our communities,” Shapiro said.",
    "In his opening remarks, Shapiro described how his faith has motivated him throughout his career and encouraged law students to understand how law intersects with the Jewish faith.",
    "“And I think a lot of my fellow students are in the same boat.”\nYakov also believes Shapiro’s experiences will show students the impact a law career can have on the public sphere.",
    "“I have an interest in public service myself, so I hope to get some inspiration and learn about some of his experiences that will help me in my future journey,” Yosipovitch said.",
    "When asked how students can become involved in protecting American democracy, Shapiro advised them to vote and volunteer with local election boards and political parties.",
    "The memories of Shabbat, synagogue services and learning the importance of helping others at Jewish day school built the foundation for Shapiro’s legal career.",
    "“It’s inspirational to see somebody that you understand, that you share a lot with, seeing him in places you maybe want to one day be in,” Yakov said.",
    "The Commonwealth’s Attorney General and gubernatorial candidate discussed his law and political career along with his campaign for governor.",
    "With nearly 40 students in attendance, he also answered questions about his career, antisemitism, elections and his gubernatorial campaign.",
    "“And there’s a lot of wisdom to be had, here’s a lot of knowledge to be learned and there’s a lot of advice to be listened to.”",
    "In Josh Shapiro’s childhood home, every Friday night was reserved for Shabbat dinner, which begins the day of rest in Judaism.",
    "He was elected to the state House in 2005 and said he faced a decision to reject or follow the status quo.",
    "“You will have a tool that very few other people in this country have,” Shapiro said."
  ]
}