{
  "id": 4420,
  "mediaId": 2732,
  "date": "2022-01-27",
  "headline": "Rep. Emily Kinkead: As governor, Shapiro will protect our democracy",
  "image": "",
  "link": "https://triblive.com/opinion/rep-emily-kinkead-as-governor-shapiro-will-protect-our-democracy/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rep. Emily Kinkead",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Couple these voter suppression tactics and power grabs with HB 2207 — a bill that seeks to allow the Legislature to draw its own redistricting maps by dissolving the Legislative Redistricting Commission — and it becomes clear that the Republicans in Harrisburg and those running for governor don’t care about the will of Pennsylvania voters.",
    "I realized that if this had taken place just one day earlier, there was a very real possibility that sympathizers, realizing that the Pennsylvania Legislature was in session, could have similarly stormed our Capitol in Harrisburg, putting not just elected officials in danger, but also our families.",
    "These unprecedented attacks and the fact that the next governor will appoint a secretary of state and oversee the 2024 election make clear that we must elect a governor who has a history of defending our democracy and has a plan to protect our rights and improve our elections.",
    "Far-right propaganda prompted a majority of my Republican colleagues to sign onto letters demanding that the duly-cast votes of millions of eligible Pennsylvanians be discarded — but only for president, not for their own elections, despite being on the same ballots.",
    "That’s why I’m supporting Josh Shapiro for governor, because he has a proven track record of defending democracy and fighting for Pennsylvanians’ rights, and has a 10-point plan to defend democracy, ensure access to the ballot box and improve elections.",
    "Legislation that will institute onerous voter ID restrictions, shorten the window to register to vote, undermine mail-in voting, and make voting less accessible to shift workers, poor people, young people, BIPOC communities and non-English speakers.",
    "His plan will protect voters’ personal information, expand voter registration through automatic and same-day voter registration opportunities, and establish in-person early voting while protecting vote-by-mail options.",
    "The way the GOP has weaponized our constitutional amendment process to eviscerate the checks and balances that are meant to exist between the legislative, judicial, and executive branches is frightening.",
    "My blood ran cold as I watched in horror as windows were shattered and Capitol Police were attacked, as the worst domestic attack on any of our democratic institutions was happening right before my eyes.",
    "Legislation that threatens to expose the driver’s license and Social Security numbers of 9 million Pennsylvanians — all in an attempt to orchestrate a taxpayer-funded, sham “audit”of the 2020 election.",
    "The Republican majority in Harrisburg continues to perpetuate these lies, using them to attack the central tenets of our democracy and undermine the voices of millions of eligible voters.",
    "The next day, Jan. 6, I was back in Pittsburgh working with my staff to move furniture into our district office when I saw the news of the insurrection and attack on the U.S. Capitol.",
    "This commonwealth is the birthplace of American democracy, and it’s also the place where we could see the beginning of the end of this fragile experiment, if we are not careful.",
    "6” in debate on the floor of the state House, we are forced to vote again and again on legislation that is based on the same election lies that led to the deadly insurrection.",
    "Nevertheless, my Republican colleagues have advanced both a narrative and legislation that undercuts every Pennsylvanian’s ability to have their voice heard in our democracy.",
    "Rep. Emily Kinkead, a Democrat, represents District 20, which encompasses Bellevue, Avalon, West View, Ross Township and parts of the City of Pittsburgh.",
    "Furthermore, his plan calls for adequate election funding and vote-by-mail pre-canvassing authorization that our counties have been desperately seeking.",
    "Attacks on our democracy are only getting worse, and our next governor must be committed to defending our democracy and protecting our right to vote.",
    "They will use the Legislature to strip away power from those who seek to hold them accountable for their actions and attacks on our rights.",
    "Legislation that undermines the ability of counties to receive additional assistance to pay for the increased costs to run elections.",
    "Our democracy and our voting rights are on the ballot this year, and we need a governor who will always choose democracy over power.",
    "It was an awe-inspiring day that I was able to share with my parents and my sister who were in Harrisburg to witness the event.",
    "Here are just a few of these bills: HB 38, HB 55, HB 1596, SB 106, HB 2044, HB 1300, HB 1800, HB 2141, and on and on.",
    "The events of Jan. 6 were spurred on by lies and misinformation about the security and integrity of our elections.",
    "With Shapiro as governor, we know our rights will be protected and our communities will get the help they need.",
    "By any metric, our elections are the freest, fairest and most secure they have ever been.",
    "Our next governor will either authorize or veto these attacks on your right to vote.",
    "While Democrats are prohibited from saying the words “Jan.",
    "On Jan. 5, 2021, I was sworn into my first term in office.",
    "Categories: Featured Commentary | Opinion"
  ]
}