{
  "id": 4513,
  "mediaId": 8493,
  "date": "2022-01-09",
  "headline": "Sen. Mastriano Announces, Kellyanne Conway Helps Corman",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/594013-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "Kellyanne knows what it takes to win tough campaigns, and we’re excited to have her on our team.”\nMs. Conway praised Mr. Corman as a “strong principled leader” who will “restore personal freedoms” and “create jobs [and] expand educational opportunities.” Ms. Conway is the first woman to run a successful presidential campaign and was one of the longest tenured high level members of the Trump administration.",
    "During her three years in the White House Ms. Conway developed a reputation as a fierce protector of Mr. Trump, drawing criticism for staunchly defending Mr. Trump’s falsehoods, most infamously explaining that Trump officials used “alternative facts.” Last month, Mr. Corman’s campaign brought on Poolhouse, the creative agency that produced TV, radio and digital ads for Virginia Gov.-elect Glenn Youngkin.",
    "PA Headlines 1/9/22 This is a compilation of PA Headlines\nGETTYSBURG, Pa. (AP) — PennLive is reporting… A Pennsylvania state senator who has pushed to overturn last year’s presidential election and led protests against pandemic shutdowns and mitigation efforts formally announced on Saturday that he will run for the Republican gubernatorial nomination.",
    "Mastriano, 58, was a little-known retired Army colonel who had lost an effort to run for Congress when he won a 2019 special election for the state Senate from a rural district where Interstate 81 meets the Maryland state line.",
    "Ms. Conway, Donald Trump’s campaign manager in 2016 and later senior counsel for the president, will work for the campaign as a pollster and special adviser, the Corman campaign said in an announcement Friday.",
    "Sen. Doug Mastriano of Franklin County launched his campaign at a Gettysburg rally more than four months before voters will pick the major-party candidates in the race to succeed Democratic Gov.",
    "“You know, we know one another, and we know of people and it doesn’t matter if you’ve never met them if you know of them and they’re a good person, they’re your brother in that respect,” Welker.",
    "Last week the wife of the Vice President of the fire company died, and just hours later, on the same day, another firefighter, Scott Dreher, President of the fire company died due to COVID.",
    "The pandemic and his energetic efforts on behalf of former President Donald Trump before and after the 2020 results were in catapulted him to prominence within state Republican circles.",
    "The GOP field seeking the nomination for governor is remarkably wide — 13 appeared at a candidate’s forum in Carlisle this week, but not Mastriano or former U.S. Rep. Lou Barletta.",
    "More at PennLive.com\nDAUPHIN COUNTY, Pa. (WHTM) — WHTM is reporting… Positive cases of COVID continue to climb across the state and it’s even taking a toll on our first responders.",
    "Mastriano’s decision to join the large field of GOP hopefuls was widely expected, particularly after he said last month that he had reached his goal for campaign donations.",
    "Gratz Fire Chief Harry Welker says this is a devasting loss for his crew and their families because these members of the fire company have done so much for the community.",
    "All three deaths were related to an unvaccinated status but when it comes to vaccines, the 35 emergency crew members with the Gratz Fire Co. have their own choice.",
    "More at PennLive.com\nHARRISBURG — PennLive is reporting… Former Trump adviser Kellyanne Conway is joining the gubernatorial campaign of state Sen. Jake Corman.",
    "Pennsylvania Attorney General Josh Shapiro, a resident of Abington in the Philadelphia suburbs, appears to have cleared the Democratic Party primary field.",
    "Chief Welker says most of the crew are younger and healthy and as for these recent deaths there’s no telling if underlying health conditions were a factor.",
    "“Kellyanne Conway is a proven winner who’s ready to help Republicans take back the governor’s office here in Pennsylvania,” Mr. Corman, R-Centre, said.",
    "“It doesn’t totally scare me, but it sort of, it makes you think twice about doing what you’re doing sometimes,” Welker said.",
    "“We want to be there to have their back to basically do what for them whatever they would need to have done,” Welker said.",
    "Chief Welker says so many communities have come together and salute those that have lost their lives to COVID.",
    "Dreher was described as a hero who put others first and has been with the Gratz Fire Co. for over 30 years.",
    "A Midstate fire company recently lost three team members within a month due to the deadly COVID-19 virus.",
    "For the Gratz Fire Company, the COVID-19 virus has taken a huge toll on their first responders.",
    "Welker says in early December, the crew had a firefighter pass away due to COVID.",
    "Mr. Corman is one of at least 15 Republicans seeking the nomination for governor.",
    "“Her experience in communications and polling is second-to-none.",
    "“He had a very, very warm and welcoming demeanor to him.",
    "He’s just going to be missed,” Welker said.",
    "A procession was held in his honor.",
    "The primary election is May 17.",
    "Tom Wolf, who is term-limited.",
    "More at WHTM.com."
  ]
}