{
  "id": 4568,
  "mediaId": 2602,
  "date": "2022-01-09",
  "headline": "GOP's Doug Mastriano enters Pennsylvania governor with shofar blast",
  "image": "",
  "link": "https://www.jpost.com/american-politics/article-691969",
  "mediaOutlet": "Jerusalem Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SHIRA HANAU/JTA",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/Rrt6QXURPB\n— Ron Filipkowski (@RonFilipkowski) January 8, 2022\nMastriano, a Pennsylvania state senator who has fashioned a political persona for himself in the style of Donald Trump, cast doubt on the results of the 2020 presidential election and spoken out against vaccine mandates, had long been expected to enter the governor’s race before formally announcing his candidacy Saturday.",
    "https://t.co/JbT9wG8BaC\n— Bill Kristol (@BillKristol) January 9, 2022\nMichael Flynn, who served as Trump’s first national security advisor for just a few weeks before resigning in disgrace, and Jenna Ellis, an attorney who worked to overturn the 2020 election results for Trump, appeared alongside Mastriano at the event, according to the York Daily Record.",
    "Mastriano is running as a Republican and, if he wins the primary, will likely face off against Josh Shapiro, the state’s Democratic attorney-general who rose to prominence by vocally opposing efforts to cast doubt on Joe Biden’s victory in the state in the 2020 presidential election.",
    "“I know, it’s a free country, so I guess Mr. Mastriano is free to appropriate two of the most meaningful elements of Jewish worship, the prayer shawl worn on Shabbat and the shofar sounded on Rosh Hashanah, for his political event.",
    "I know, it’s a free country, so I guess Mr. Mastriano is free to appropriate two of the most meaningful elements of Jewish worship, the prayer shawl worn on Shabbat and the shofar sounded on Rosh Hashanah, for his political event.",
    "The use of shofars by Christians at right-wing political events has become increasingly common in recent years and this was not the first time Mastriano has attended a right-wing event where a shofar was blown.",
    "Although Mastriano said he left the Capitol after it was clearly “no longer a peaceful protest,” some of his Democratic colleagues in the state senate have called for him to be expelled or court-martialed.",
    "But that didn’t stop him from announcing his candidacy for Pennsylvania governor at an event where a man donned a tallit, or a Jewish prayer shawl, and blew a shofar.",
    "Jack Jenkins, a reporter for Religion News Service, told the New Yorker that the event was intended to mimic the Biblical story in which the walls of Jericho fell.",
    "And Mastriano was in Washington on Jan. 6, 2021 when Trump’s supporters rallied and later stormed the Capitol, with some of them sounding shofars.",
    "They opened the proceedings the same way they opened J6 in DC, by blowing the Shofar, signaling that this political battle will also be spiritual.",
    "In December 2020, he attended a series of “Jericho Marches” in Washington, D.C. where Trump’s supporters prayed for him to remain president.",
    "According to the New Yorker, Mastriano used campaign funds to charter buses to bring Trump supporters to the Jan. 6, 2021 rally.",
    "And I’m free to say it’s beneath contempt,” Bill Kristol, the former editor of the Weekly Standard, said in a tweet.",
    "Mastriano has made “establishment Republicans” his enemy and was condemned by some of them on social media.",
    "“They blew on shofars believing they could literally overturn the election results,” Jenkins said.",
    "MAGA Sen. Doug Mastriano announced his candidacy for Gov of PA today.",
    "And I’m free to say it’s beneath contempt.",
    "Doug Mastriano isn’t Jewish.",
    "Shapiro is Jewish."
  ]
}