{
  "id": 4704,
  "mediaId": 8481,
  "date": "2022-04-18",
  "headline": "Lou Barletta talks governor’s race as primary looms",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/04/barletta-noon.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/pennsylvania-governor-election-2022/lou-barletta-talks-governors-race-as-primary-looms/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Tracy",
  "authorUrl": "https://www.wearecentralpa.com/author/jordan-tracy/",
  "termIds": [
    3926,
    4539,
    4811,
    2148,
    2911,
    2765,
    1610,
    6208
  ],
  "sentences": [
    "We are just going to do the best we can to try and win this because it’s very important that we beat Josh Shapiro in November.”\nBarletta will be joined on stage with Doug Mastriano, Dave White, and Bill McSwain in Harrisburg on April 27th for a debate right here on WTAJ.",
    "He said, “President Trump’s endorsement plays a big role in the election and who can win the primary.”\nWith that in mind, Barletta says he will wait and see what Mr. Trump decides to do.",
    "ALTOONA, Pa. (WTAJ) — Former Congressman Lou Barletta joined WTAJ News at Noon on Monday to talk about his campaign for the Republican nomination for the governor of Pennsylvania.",
    "But at the same time, we have to make sure that those that are in our public schools are getting the best education that they can possibly get.",
    "Barletta, the father of two public school teachers, believes education is a major issue that voters have been keeping an eye on in this race.",
    "It’s a diploma, not a government check.”\nFormer President Donald Trump has not endorsed a candidate in this race as of yet.",
    "With the May primary just four weeks away, Barletta sees his name with Doug Mastriano at the top of the latest polls.",
    "Barletta just held a fundraiser at Mar-A-Lago and believes whoever Mr. Trump endorses will make a major impact.",
    "He detailed, “Parents should still have that right to have their their children go to where they want to.",
    "He explained, “We haven’t run one ad yet and still remained at the top and our ads will now start again.",
    "He explained, “I know President Trump well enough to not speak for him or what he will or won’t do.",
    "He’s pro-school choice and believes parents should have a stronger say in their child’s education.",
    "He believes it’s his name recognition that has helped carry him near the top of this race.",
    "However, he has come out and said he would not support Bill McSwain.",
    "If we want to lift people out of poverty, it’s through education.",
    "We feel pretty good going down the stretch.",
    "That’s totally his call."
  ]
}