{
  "id": 4714,
  "mediaId": 8503,
  "date": "2022-04-21",
  "headline": "This week on the campaign trail for PA governor, Senate races: Polls, debates and pledges",
  "image": "https://www.gannett-cdn.com/presto/2022/04/20/NBCC/d4791936-dd04-4649-b70b-e24bc464fdf9-young-boston22.jpg?crop=1439,810,x0,y69&width=1439&height=810&format=pjpg&auto=webp",
  "link": "https://www.ydr.com/story/news/politics/2022/04/21/tracking-campaign-updates-in-pennsylvanias-senate-and-governor-races/65350855007/",
  "mediaOutlet": "ydr.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Ullery",
  "authorUrl": "https://www.buckscountycouriertimes.com/staff/5573447002/chris-ullery/",
  "termIds": [
    4531,
    3989,
    4080,
    2540,
    2709,
    2911,
    3029,
    1126,
    1489,
    392
  ],
  "sentences": [
    "Candidates Jake Corman, Joe Gale, Charlie Gerow, Melissa Hart and Nche Zama discussed where they stood on key issues such as election reform, abortion and recreational marijuana in hopes of swaying undecided voters, while recent polls have them all behind the absent candidates.",
    "Bochetto was the most recent candidate to sign the pledge to support legislation setting a cap of no more than three terms for U.S. House members and two terms of senators, a pledge the organization says is currently signed by more than 90 of the 535 members of Congress.",
    "Fetterman also leads the pack on both parties for campaign funding, reporting a total of more than $15 million raised for his campaign to date, followed by Oz's $13.4 million and McCormick's $11.3 million, according to Federal Elections Commission filings posted online.",
    "State Sen. Doug Mastriano of Franklin County, former U.S. Rep. Lou Barletta of Luzerne County, Delaware County businessman Dave White and former U.S. Attorney Bill McSwain of Chester County turned down the invitation for this week’s debate sponsored by Spotlight PA.",
    "Pennsylvania is considered one of several battleground states in this election with the Senate currently evenly divided between Republicans and Democrats, but Vice President Kamala Harris gives the advantage to the Democrats if a tie-breaking vote is called.",
    "Similarly, four of nine Republican candidates favored in recent polling for the ballot spot to run against presumptive Democratic nominee Josh Shapiro in November's gubernatorial race declined an invite for a Spotlight debate in Gettysburg this week.",
    "Collectively, the three front runners in their respective parties make up more than 61% of the $64.5 million raised by more than 35 Republican, Democratic and independent candidates who have at one point crowded the race for Toomey's open seat.",
    "Eight Senate candidates sign term limits pledge\nAs of Wednesday, the entire slate of current Republican candidates and Democrat Khalil have signed a pledge for term limits on elected officials, a news release from non-partisan group U.S.",
    "A Franklin and Marshall College poll released last week reported little change from poll results the previous month, when economic concerns and disapproval over Democratic President Joe Biden's performance were main issues among voters.",
    "Only one in four voters told Franklin and Marshall they felt the state was headed in the right direction, with 75% of voters who said they are worse off also saying the state is \"on the wrong track,\" the report states.",
    "The first debate on April 25 at Dickinson College in Carlisle, Cumberland County, features the full slate of current Democratic candidates for Senate: John Fetterman, Malcolm Kenyatta, Alexandria Khalil and Conor Lamb.",
    "In the race for governor, an early March Fox News poll of Republican voters had Barletta favored at 19%, Mastriano at 18%, White at 14% and McSwain at 11%, with about 25% saying they were undecided for the primary.",
    "There remain some clear favorites among decided voters for both Senate races and the GOP gubernatorial primary, but a significant amount of undecided voters make the outcomes a toss up leading up to the primary.",
    "Those sentiments could favor Republican candidates going into the Nov. 8 midterm election, with roughly 44% of Republicans and 39% of Democrats saying they would favor a GOP candidate for Congress.",
    "Cardiothoracic surgeon turned TV host Mehmet Oz and former hedge fund CEO David McCormick, considered frontrunners in the GOP race, are currently unconfirmed for Spotlight's debate next week.",
    "While the group had some success pushing for term limits in 23 states, a 1995 U.S. Supreme Court ruling found states cannot individually set term limits for their own members of Congress.",
    "The May 17 primary is rapidly approaching, and soon 4 million Democrats and 3.4 million Republicans will decide their party's candidates for governor and U.S. Senate in Pennsylvania.",
    "Spotlight PA reported last week that state campaign finance reports through March show the nine GOP candidates have collectively raised $13 million so far in their bid for governor.",
    "The term limits amendment resolutions would require a two-thirds majority in the House and Senate, and ratification by 38 states, in order to become part of the U.S. Constitution.",
    "I expect to be home tomorrow and on the campaign trail shortly, and I look forward to being on the debate stage on Monday,\" Bartos said in a statement Wednesday afternoon.",
    "White leads in campaign funding with $5.1 million, followed by Corman's $2.8 million, McSwain ($2.4 million), Mastriano ($1.4 million) and Barletta with $1.3 million.",
    "America needs a Congress that will be served by citizen legislators, not career politicians,” said Philip Blumel, president of the group behind the national pledge.",
    "Bartos hit a short pause on his campaign Wednesday morning after doctors identified a non-cancerous nodule on his thyroid, recommending surgery to remove the gland.",
    "Republican Senate candidates Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale and Carla Sands are currently expected to attend Spotlight's April 26 debate.",
    "Spotlight PA, an independent news organization partnering with multiple outlets across the state, will host two U.S. Senate debates at 7 p.m. April 25 and 26.",
    "Recent polls have continued that trend, with the gap between Barletta and Mastriano closing and undecided voters climbing to nearly 50% in some reports.",
    "“This overwhelming support of term limits shows that there are individuals who are willing to put self-interest aside to follow the will of the people.",
    "About 36% of voters polled, including a quarter of Democrats and 40% of Independents, reported feeling \"worse off\" financially compared to a year ago.",
    "New debates, polls and campaign finance reports make up the bulk of news impacting the key state and federal races in the commonwealth this week.",
    "Voters favored Oz at 16% and McCormick at 15%, with Barnette in third place 7% followed by Bartos and Sands trailing at 5% and 6%, respectively.",
    "About 26% of Democrats were undecided, while nearly half of decided voters said they could change their minds between now and the primary.",
    "The group based out of Washington, D.C., has pushed for term limits at all levels of government since it was founded in the 1990s.",
    "For now, Fetterman still leads the Democrats with 28% of voters supporting him over Lamb's 17% in April, both up from last month.",
    "My family and I are grateful to the great doctors, nurses and staff of the University of Pennsylvania for their outstanding care.",
    "About 43% of Republican voters are still undecided and nearly two-thirds of decided voters say they could change their minds.",
    "In the Republican field, Oz and McCormick are nearly neck and neck and ahead of the five other candidates running.",
    "With Sen. Pat Toomey retiring this year, the commonwealth could sway the balance of power on the national stage.",
    "Another 6% of voters said they would vote for \"someone else\" while the report found 0% support for Sean Gale.",
    "Kenyatta remains a distant third in the polls, going from just 2% support in March to 4% in April.",
    "The four other Republican candidates have collectively raised just $868,000 so far.",
    "\"The surgery was successful and I’m resting comfortably.",
    "Who's ahead in the polls and campaign funding?",
    "Term Limits states."
  ]
}