{
  "id": 4753,
  "mediaId": 8306,
  "date": "2022-04-21",
  "headline": "Christine Flowers: Neither Sims nor Shapiro deserve to be in public office",
  "image": "https://www.delcotimes.com/wp-content/uploads/2021/08/dtimes.jpg",
  "link": "https://www.delcotimes.com/2022/04/21/christine-flowers-neither-sims-nor-shapiro-deserve-to-be-in-public-office/",
  "mediaOutlet": "delcotimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christine Flowers",
  "authorUrl": "https://www.delcotimes.com/author/christine-flowers/",
  "termIds": [
    4905,
    3621,
    3926,
    2609,
    1057
  ],
  "sentences": [
    "I remember the day when he took out a camera in front of the Planned Parenthood that is a few blocks from my apartment (tragically in his state legislative district) and essentially stalked several young girls and their mother as they were praying outside of the abortion clinic.",
    "It’s not exactly a bloodbath and it’s far from the level of Lincoln Project-Never Trumper attacks on a whole segment of the Republican Party, but it does show that there are some troubled waters flowing from the Schuylkill up to the Susquehanna, and back again.",
    "Then he sued the Little Sisters of the Poor, or forced them to sue him when he wanted them to foot the bill for someone else’s birth control, and I realized that Josh Shapiro was willing to do anything to curry favor with the most radical wing of his party.",
    "Brian Sims, whose greatest hits include stalking young pro-life girls outside of Planned Parenthood and posting a photo of himself giving the finger to then-Vice President Mike Pence, decided to play fast and loose with the truth in a campaign ad.",
    "In the case of Shapiro, he was a huge proponent of that section of Obamacare which would have forced religious employers to provide health insurance coverage for birth control, with some narrow and unacceptable conscience exceptions.",
    "It’s true that the attorney general was rather dismissive of the religious status of the Little Sisters of the Poor, and curried favor with those lay Catholic Democrats who think that party is more important than religious doctrine.",
    "More importantly, it reminds us that the Democrat Party is filled with men who think they have a right to tell pro-life women what they should do with their faith, their bodies and their constitutional rights.",
    "I check my Twitter feed, and there he is again, tweeting that he’s the only gubernatorial candidate who will protect my right to choose (not the right to choose a mask, the right to choose an abortion.",
    "That’s the reason the Little Sisters of the Poor were forced to go to court to defend and protect their constitutional right to worship, and live, according to the dictates of their faith.",
    "A guy who makes Josh Shapiro look like a Boy Scout put his foot in his mouth yet again, triggering an unexpected yet welcome push back from the Democratic gubernatorial candidate.",
    "That video of him stalking and then attempting to doxx those women went viral, leading to a lot of really bad publicity for him (and also leading to his blocking me on Twitter).",
    "It’s like playing Whack-A-Josh, because every time I think I’ve successfully clicked him into oblivion, he is, like a preppy and bespectacled Poltergeist, b-a-a-a-a-a-a-ck.",
    "That’s why I’m so focused on the fact that the current attorney general seems to believe that being a Catholic nun is less important than being a generous employer.",
    "Brian Sims does not deserve to be in office anywhere, let alone in the commonwealth where the principles of religious freedom were drafted and codified.",
    "And it’s only the primary cycle, so I’m trembling at how much more of the Joshiverse I’ll be forced to navigate between now and the general election.",
    "There was one Josh siting that made me smile this week, and reminded me of how I felt when he took over for Kathleen Kane as stateAttorney General.",
    "I turn on the television, and there he is yet again, telling the country what he’s done to hold drug companies accountable for the opioid crisis.",
    "After the mess she’d created in Harrisburg, I welcomed someone who seemed to be a fairly moderate, non-partisan guy from neighboring Montco.",
    "But as before when I wrote that Sims makes Shapiro look like a Boy Scout in general, that is especially true when talking about abortion.",
    "His point was political, just as everything Josh Shapiro has done in his life has been designed to move him to the next level of power.",
    "He supposedly sent a personal letter to the parents of the girls involved, more than five months after putting a bounty on their heads.",
    "That was news to Shapiro, who sent off a strongly-worded letter to Sims campaign telling him to, essentially, cease and desist lying.",
    "Not being a psychoanalyst, I am not sure why Sims has such a problem with pro-life Catholic women, but he most assuredly does.",
    "Sims ran an ad with a visual of a ribbon with a check mark next to it, and the words “Endorsed by Josh Shapiro” underneath.",
    "In case you weren’t watching, Sims, who is running for lieutenant governor, suggested that Josh Shapiro had endorsed him.",
    "The prospect that either of them might be running Pennsylvania next year brings me to my knees, and not in prayer.",
    "Josh Shapiro, who had a big problem with Catholic nuns, is also not a friend of the Free Exercise Clause.",
    "Of course Sims would not call it “lying.” He’d call it anticipating what Shapiro actually meant to say.",
    "I log onto Facebook, and there he is, telling me that the GOP is going to destroy life as we know it.",
    "He was kind of like Joe Biden, if Biden were young, still in possession of his faculties and Jewish.",
    "The really bad part was when he offered to pay $100 to anyone who could identify the girls.",
    "He’s a laboratory experiment of a politician, and he’s exceptionally good at what he does.",
    "For that reason, and that reason alone, I can almost excuse what he did to those nuns.",
    "It’s only my body, my choice if I want to destroy another body inside of my own).",
    "They had rosaries and Hail Marys, he had an IPhone and a deep well of hostility.",
    "The Democrats refused to censure Sims, and he never issued a public apology.",
    "I can’t hide my delight at this little intra-family squabble on the left.",
    "I am not going to vote for him for governor, no way no how.",
    "But back to the thing that made me smile this week.",
    "Their faith, by the way, happens to be my faith.",
    "Her column usually appears Thursday and Sunday.",
    "I’m tired of seeing Josh’s face in my own.",
    "However, credit where credit is due.",
    "Email her at cflowers1961@gmail.com.",
    "Christine Flowers is an attorney.",
    "But he didn’t make it personal.",
    "This incident happened in 2019.",
    "That’s not the case with Sims.",
    "At least, it seems that way.",
    "Josh Shapiro is everywhere.",
    "And then … silence.",
    "I can’t avoid him."
  ]
}