{
  "id": 5029,
  "mediaId": 8409,
  "date": "2022-04-21",
  "headline": "Ukrainian dance troupe highlighting International Spring Festival",
  "image": "https://www.pottsmerc.com/wp-content/uploads/2022/04/intfest941611.jpg?w=1024&h=936",
  "link": "https://www.pottsmerc.com/2022/04/21/ukrainian-dance-troupe-highlighting-international-spring-festival/",
  "mediaOutlet": "phoenixvillenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sokil",
  "authorUrl": "https://www.pottsmerc.com/author/dan-sokil/",
  "termIds": [
    4591,
    3614,
    3926,
    3496,
    2752,
    6672,
    6569
  ],
  "sentences": [
    "In addition to the return of Voloshky, the nationally acclaimed Ukrainian Dance Troupe, other performers include the Fralinger String Band, along with 40 different cultural and nationality bands, singers, and dancers, including Fitzpatrick School of Irish Dance, International Ballet, Guang Hua Chinese School, Jaisohn Korean Youth Drum Team, Children of Adam Band, Latin Jazz Trio, Superheroes Unite, ArCoNet Youth and Chamber Orchestra and many more.",
    "Two years without it, we’ve missed it, like we missed everything during the pandemic — but with what’s been going on with Ukraine, we missed it even more.”\nAfter a two-year hiatus due to COVID-19, the 32nd annual International Spring Festival, sponsored by the Lansdale Public Library, will return to North Penn High School from 11 a.m. to 5 p.m. on Saturday, April 23.",
    "They don’t need Ukraine, they need the Ukrainian people to be destroyed.”\nSupport from the local community in the Philadelphia area has been “overwhelming,” Lewyckyj said, adding that he’s been heartened to see that people locally understand the differences between the two countries, their two cultures, and their two political systems.",
    "Representatives Brian Fitzpatrick and Madeleine Dean, Montgomery County commissioners Val Arkoosh, Ken Lawrence and Joe Gale; Montgomery County District Attorney Kevin Steele, Bucks County District Attorney Matthew Weintraub, state Senators Bob Mensch and Maria Collett, and state Representatives Steve Malagari and Todd Stephens.",
    "The ISF is one of the largest multicultural festivals in the mid-Atlantic region attracting thousands of people each year, according to festival organizers, to celebrate multi-cultural diversity through the visual, culinary and performing arts of more than 30 countries, alongside a family health and wellness fair.",
    "“We recently did a concert with the Philadelphia Orchestra, a benefit the Philadelphia Orchestra organized, and the very next day we heard back from people who watched it, on ‘Voice of America,’ and they were watching it from bomb shelters in Kyiv and Lviv, and cheering for the Philadelphia Orchestra.",
    "While Voloshky will be there just to perform, Lewyckyj said other area residents will have displays on Ukrainian culture and history, and can point to groups and organizations such as the Ukrainian Federation of America for ways to help those on the ground in that country.",
    "All of the support helps.”\nThe festival will also feature a Family Health and Wellness Fair sponsored by Jefferson Health — Abington, which will feature free interactive health exhibits, resource information and free health screenings from a variety of providers.",
    "Saturday’s ISF will feature Ukraine in the entrance parade of nations, a performance by a Voloshky member of the Ukrainian national anthem, and could also include a Q-and-A and/or an appearance by local dignitaries with ties to both countries.",
    "Most Popular\nEastern Berks township requiring residents to pay for tree removal on their properties\nMorning Briefing: 12-year old child dead in murder-suicide; Another community hospital may be closing; Bad signs for 76ers after loss",
    "Because in Vladimir Putin’s own words, it was put that ‘Ukraine is not a real culture, it’s not a real language, it’s not a real nation.’ And in fact, it’s a nation and a culture that’s much older than the Russian empire,” he said.",
    "Also new this year will be a mobile cancer screening provided by the Sidney Kimmel Cancer Center, which will be parked in the front parking lot of the high school and will provide free cancer prevention and screening information.",
    "TOWAMENICIN — When members of the Voloshky Ukrainian Dance Ensemble take the stage at the International Spring Festival on Saturday afternoon, it’ll come with a deeper meaning for members — and a message to the world.",
    "Those who are veterans can bring their DD214 to receive free photo ID cards that can be used for discounts throughout the county, which will be issued by the staff of Jeanne Sorg, Montgomery County Recorder of Deeds.",
    "“I have worked (in Ukraine) a lot, and all of our music is recorded and composed by a symphony orchestra in Kyiv, and so we know a lot of the musicians there, and hear from them every once in a while,” he said.",
    "That vaccine clinic is just one of several changes made this year to accommodate those concerned about COVID, according to Meyer, so the event may look slightly different than the last time it was held in 2019.",
    "“This year’s festival will be a bit smaller than it has in recent years,” Meyer said, with no show in the high school’s planetarium and no display from the North Penn Arts Alliance as in prior years.",
    "So we’re just performing this dance, as it was, with no commentary, and it’s pretty amazing that our folk dance already had this tension between the two countries already worked into it,” he said.",
    "of Lansdale will provide Hands Only CPR education and demonstrate emergency equipment, and the Jaisohn Medical Center and Asian American Coalition will be providing a free COVID vaccine clinic.",
    "“There’s a dance, that’s an old folk dance, that we haven’t changed at all, but it was banned by the Soviet Union because it seemed to poke fun at the fact that Russia was occupying Ukraine.",
    "Other new additions include a model train display in the high school gym, and family-fun exercise from Rapping About Prevention, Inc. and the North Penn YMCA, according to event organizers.",
    "The day will feature displays, activities, and fun facts for kids and visitors of all ages, including culture-specific outfits, costumes, and musical instruments from different countries.",
    "Festivities begin with a grand parade starting at 11:30 a.m., and at noon on the main stage, local dignitaries will speak; those invited include state Attorney General Josh Shapiro, U.S.",
    "Lewyckyj said Wednesday that the dance company’s return to the ISF will carry a deeper meaning for most members, and messages they hope to convey to those who attend .",
    "Lewyckyj said Wednesday that he hopes Voloshky’s performance will send a message to the local community — and a different message to a certain country and its leader.",
    "“It more or less is getting back to life as we know it,” said Taras Lewyckyj, artistic director of Voloshky, regarding the return to an in-person festival.",
    "Those who attend can also pick up a passport to learn facts about different countries, and after filling out their passport can create art and win prizes.",
    "Lewyckyj said the dances done by Voloshky will resemble the shows they’ve done at the festival in prior years, but with key differences.",
    "It’s been wonderful, how the U.S. really has stepped up, as a true world leader, to support Ukraine and our democracy,” Lewyckyj said.",
    "And ironically, it just seems like Russia has, by creating this war, has underscored it probably better than I ever could,” he said.",
    "“Eritrea is a new country this year and there will be three Indigenous Nations represented: Lenape, Cherokee, and Lakota,” he said.",
    "And so you can see that in what the war is doing: it’s not a war to take land, as much as it is to destroy the Ukrainian people.",
    "“The exhibits in the gym will be more spread out, with larger aisles, to allow for more room for social distancing,” he said.",
    "“The fact that we celebrate a unique cultural identity, separate from Russia, seems very uncomfortable to Vladimir Putin.",
    "Rapping About Prevention, Inc. and the North Penn YMCA will engage families in energizing, fun exercise.",
    "For more information visit www.ISFconnect.org or search for “International Spring Festival” on Facebook.",
    "The list of countries has several new additions, according to library director Tom Meyer.",
    "“We’ve been there from the beginning and watched it grow into a huge event.",
    "“Every time we do this, we underscore the unique identity.",
    "The Ukrainian performance will be front and center.",
    "“For people in the group, it means a whole lot.",
    "“We thank everybody for their support.",
    "The Volunteer Medical Services Corps.",
    "Parking and admission are free."
  ]
}