{
  "id": 5046,
  "mediaId": 8483,
  "date": "2022-04-23",
  "headline": "One-on-one with Pennsylvania gubernatorial candidate Josh Shapiro",
  "image": "https://kubrick.htvapps.com/vidthumb/images/josh-shapiro-1650406963.jpg?crop=1xw:1xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/one-on-one-with-pennsylvania-gubernatorial-candidate-josh-shapiro/39766033",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Lehman",
  "authorUrl": "https://www.wgal.com/news-team/f2045d51-727e-451e-b547-f5dfa705624f",
  "termIds": [
    4946,
    3926,
    1022,
    392,
    6506,
    6208
  ],
  "sentences": [
    "\"I'm very willing to work with Republicans and Democrats in the legislature to perfect our system, no doubt, but I'm not willing to engage in fear-mongering and peddling these ridiculous conspiracy theories,\" he said.",
    "Shapiro wants to revisit the state's entry into the regional greenhouse gas initiative, but he also wants to see investment into energy sector jobs.",
    "\"I'm frankly tired of hearing this false choice that somehow we have to choose between either environmental protection or energy development.",
    "Shapiro thinks he can cut through partisan gridlock in Harrisburg, including on issues like election reforms sought by county commissioners.",
    "Since kicking off his campaign, Shapiro has said he'd put everyday Pennsylvanians first, not big corporations that may prey on people.",
    "Shapiro said he'd also push for increased education investments, including mental health supports, as part of his first budget.",
    "I also want to make sure that we have a government that works for their interests, not against their interests,\" he said.",
    "Shapiro said voters will have a clear choice in November, no matter who wins the Republican primary.",
    "Pennsylvania Attorney General Josh Shapiro is the only Democrat running for the state's top office.",
    "\"I want everybody to get a $250 immediate gas tax refund for each car you own or lease,\" he said.",
    "They want to make it harder for people to vote, harder for workers to organize,\" he said.",
    "We continue to talk to candidates about their stance on issues ahead of the May primary.",
    "Shapiro said he wants to give relief on taxes for things like cellphones and gas.",
    "One-on-one with Pennsylvania gubernatorial candidate Charlie Gerow",
    "\"I've stood up and fought against that as attorney general.",
    "But he's not going to revisit 2020 election fraud claims.",
    "\"I've fought for those who have been wronged,\" he said.",
    "\"They want to undermine the rights of Pennsylvanians.",
    "They want to undermine reproductive rights.",
    "I actually think we can do both,\" he said."
  ]
}