{
  "id": 6300,
  "mediaId": 8368,
  "date": "2022-04-12",
  "headline": "Trump blasts GOP governor hopeful McSwain",
  "image": "https://metrophiladelphia.com/wp-content/uploads/2022/02/DSC_0189-1200x800.jpg",
  "link": "https://metrophiladelphia.com/trump-blasts-gop-governor-hopeful-mcswain/",
  "mediaOutlet": "Metro - United States - Pennsylvania",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Tomczuk",
  "authorUrl": "https://metrophiladelphia.com/author/jack-tomczuk/",
  "termIds": [
    0
  ],
  "sentences": [
    "“They said Philadelphia and Detroit were two of the most corrupt places in the Country, with Georgia being one of the most corrupt states!”\nMcSwain wrote a letter to Trump last summer claiming that the U.S. Department of Justice prevented him from coming forward with evidence of issues with the election, the Inquirer reported.",
    "“When I’m Governor, we’re going to get back to a voting system that everyone has confidence in, and that begins with repealing the unconstitutional mail-in balloting law, Act 77, that Doug Mastriano voted for,” he added.",
    "Days after endorsing celebrity doctor Mehmet Oz for U.S. Senate, the former president attacked GOP gubernatorial candidate Bill McSwain, who led the U.S. Attorney’s Office in Philadelphia during Trump’s administration.",
    "Trump, in a statement, characterized McSwain as “a coward, who let our Country down” for not taking action to investigate his oft-repeated and frequently-debunked claims of fraud in the 2020 presidential election.",
    "Recent polls have put McSwain behind former U.S. Rep. Lou Barletta, Mastriano and Dave White, a businessman who previously served on Delaware County Council, in the Republican gubernatorial primary.",
    "He did not mention the former president in his response to Trump’s rebuke, instead opting to take a shot at state Sen. Doug Mastriano, one of the Republican frontrunners in the governor’s race.",
    "As part of his platform aimed at “restoring faith in our elections,” McSwain supports voter identification legislation and laws against “ballot harvesting,” according to his campaign website.",
    "However, McSwain did raise an impressive $1.43 million in campaign contributions just from January to March, and he entered April with more cash on hand than any of the other top candidates.",
    "McSwain, who lives in Chester County, has touted his ties to Trump, and a smiling picture of the pair was featured in a television advertisement released by his campaign last week.",
    "Act 77, which passed in 2019 with support from GOP legislative leaders, legalized no-excuse mail-in balloting, a popular option since the beginning of the COVID-19 pandemic.",
    "Former Attorney General William Barr strongly denied the allegations and told the Inquirer McSwain admitted that he was just trying to get Trump’s political support.",
    "The Pennsylvania GOP decided not to back a candidate for governor or U.S. senate, amid speculation that party officials were waiting on Trump’s endorsement.",
    "I’ve prosecuted and put people behind bars who committed voter fraud, and put rioters and looters in jail,” McSwain said Tuesday in a statement.",
    "On the Democratic side, state Attorney General Josh Shapiro appears set to cruise to his party’s nomination for governor.",
    "“Bill McSwain should be ashamed of himself, as should many Republican leaders who didn’t act,” Trump continued.",
    "Sign up for our Daily Email newsletter to stay up-to-date on the latest local news throughout Philadelphia.",
    "The Democratic Governors Association poked fun at McSwain in light of Trump’s anti-endorsement.",
    "A legal challenge to the law is currently being considered by the Pennsylvania Supreme Court.",
    "You’re fired,” the group’s deputy communications director, Sam Newton, retorted.",
    "Donald Trump isn’t finished weighing in on Pennsylvania politics.",
    "Tom Wolf is term-limited and cannot seek reelection.",
    "“I’m proud of my record as U.S. Attorney.",
    "No fraud evidence was ever presented.",
    "“Sorry, Bill.",
    "Gov."
  ]
}