{
  "id": 6511,
  "mediaId": 8254,
  "date": "2022-04-10",
  "headline": "Who’s running for Governor of Pennsylvania in 2022?",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/Governor-Fullscreen-2022update-2.png?w=1280",
  "link": "https://www.abc27.com/election/whos-who-2022-pennsylvania-governor-race/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "Dropped Out\nJason Monn (R)\nDan Meuser (R)\nScott Martin (R) — He announced that he is suspending his campaign for Governor due to on-going medical issues caused by his recent leg injury and issued the following statement: “The injuries to my leg were beyond a simple broken bone and included a severing of numerous ligaments and tendons in my ankle that are going to require greater and longer rehabilitation than I originally hoped would be necessary.”\nGuy Ciarrocchi (R) — “It is time that I close this chapter and wish my colleagues well—both old and new friends.",
    "You know that I will continue to be a voice for local businesses, an advocate for children, a defender of liberty—and someone who believes in the promise of America.”\nJason Richey (R) – Despite receiving enough petitions to appear on the ballot, the Associated Press reported on March 17 that Richey dropped out of the race and endorsed William McSwain.",
    "According to his campaign website, White is an “avid supporter of veterans and was presented with a plaque by the Pennsylvania Veterans Museum, where they named a room in his honor.”\nWhite’s candidate status was approved, after he collected the necessary signatures, on March 11.",
    "If elected, the Green Party says she” would work to inform residents and protect the environment.”\nLibertarian Party\nThe Libertarian Party of Pennsylvania announced that Matt Hackenburg has been nominated to be the party’s official nominee for Governor.",
    "Mastriano has been a public and active supporter of former President Donald Trump, which, as he shared with abc27’s Dennis Owens, he hopes will make him a winner in the May primary.",
    "Joe Soloski (L) — As the sole Libertarian candidate, Joe Soloski believes in the principles of limited government and minimum state spending, according to his campaign website.",
    "According to his campaign website, if elected, John Ventre plans to reduce state legislators from 253 to 67, make election day a state holiday, repeal Act 77 plus others.",
    "Shawn Berger (R) – According to election officials, Berger, a businessman from Carbon County, did not meet the petition requirements to appear on the primary ballot.",
    "Did Not Meet Petition Requirements\nJohn Ventre (R) – According to election officials, Ventre did not meet the petition requirements to appear on the primary ballot.",
    "Hackenburg, a former member of the Army National Guard, lives in Northampton County and has a fifteen-year career as a computer engineer in the aerospace industry.",
    "In 2018, Lou Barletta was the Republican party’s Donald Trump-endorsed nominee for U.S. Senate, and in May 2021, he announced his run for Pennsylvania governor.",
    "If elected, he plans to focus on strengthening the economy, reducing crime, promoting school choice, and pro-family policies, according to his campaign website.",
    "HARRISBURG, Pa. (WHTM) — Before hitting the polls on May 17 for the primary election, abc27 has compiled a list of who is running for governor of Pennsylvania.",
    "Digiulio has a bachelor’s degree in biology and chemistry from Lock Haven University and previously worked for a number of years for the Department of Defense.",
    "On April 12 Corman filed a petition to withdraw from the race, but after speaking with former President Donald Trump, Corman filed to remain in the race.",
    "Zama is a renowned cardiothoracic surgeon and has worked for hospitals across Pennsylvania in Philadelphia, York, East Stroudsburg, and other locations.",
    "According to his campaign website, Joe Gale was the first elected official in Pennsylvania to endorse former President Trump during his 2016 campaign.",
    "Republican\nThe Senator of Pennsylvania’s 33rd District announced his candidacy for Wolf’s open seat in January 2022 at a rally in Gettysburg.",
    "Heading into the election year, Shapiro entered 2022 with $13.4 million in his campaign account, which is a state record for a candidate.",
    "Tuesday, March 15, marked the official day for candidates to hand in their signed petitions to officially add their names to the ballot.",
    "Announced in September 2021, William McSwain, former U.S. Attorney appointed by former President Donald Trump, is running for governor.",
    "Both brothers were approved for their individual races, with Joe Gale’s name officially added to the governor race ballot on March 14.",
    "Before his time as the attorney general for Pennsylvania, Shapiro was the chairman of the Board of Commissioners in Montgomery County.",
    "Green Party\nThe Green Party of Pennsylvania announced that Christina “PK” Digiulio will be their candidate for Governor in 2022.",
    "As of March 8, Mastiano’s candidate status was approved and his name was officially added to the ballot for the May primary.",
    "Charlie Gerow also runs a communications and marketing firm in Harrisburg and is a Pa. Republican party committee member.",
    "In January, Shapiro endorsed Pittsburgh-area state lawmaker Austin Davis to be his running mate and lieutenant governor.",
    "Corman’s candidate status was approved and his name was officially added to the ballot for the May primary on March 14.",
    "According to Hart’s LinkedIn account, she is also an attorney plus a strategic and political communications consultant.",
    "Christina Olson (G) — The Hellertown resident announced her campaign and became the sole candidate in the Green party.",
    "The former Republican member of the United States House launched her campaign for the state governor in January 2022.",
    "Plus, visit Pennsylvania Politics or Your Local Election HQ on abc27.com for more information on upcoming elections.",
    "Learn more about each candidate hoping to fill the empty seat Governor Tom Wolf will leave behind in 2023 below.",
    "As of March 14, McSwain’s signatures were collected and his candidate status for the primary was approved.",
    "Prior to his time as an attorney, McSwain was a scout/sniper platoon commander in the U.S. Marine Corps.",
    "Barletta is also known for his time as former Hazleton mayor and his four terms as a member of Congress.",
    "To learn more about Hart, visit her campaign website created by Hart for PA by clicking here or here.",
    "The Conservative activist announced his candidacy at a firehouse in Cumberland County in June 2021.",
    "The President Pro Tempore of Pennsylvania’s Senate joined the race for governor in November 2021.",
    "Mastriano has also been in the media for sponsoring busses to the U.S. Capitol on Jan. 6, 2021.",
    "The information provided is from the candidate’s website or articles from abc27’s reporters.",
    "The Montgomery County commissioner announced his candidacy for governor in February 2021.",
    "Or, visit the campaign website created by Friends of Doug Mastriano, by clicking here.",
    "During her time in Congress, she was a co-chair of the Republican National Convention.",
    "Links to each candidate’s campaign page will also be updated as they become available.",
    "Gale’s brother Sean is running for Pennsylvania’s United States Senate seat, as well.",
    "Shapiro received his required signatures and his petition was approved on March 14.",
    "Democrat\nPennsylvania’s Attorney General announced his candidacy in October 2021.",
    "This page will continue to be updated as candidates join or drop from the race.",
    "In June 2021, the Republican from Westmoreland County announced his candidacy.",
    "To learn more about Dave White, visit his campaign website by clicking here.",
    "She did not meet the petition requirements to appear on the primary ballot.",
    "He did not meet the petition requirements to appear on the primary ballot.",
    "To learn more about Barletta, visit his campaign website by clicking here.",
    "To learn more about McSwain, visit his campaign website by clicking here.",
    "To learn more about Shapiro, visit his campaign website by clicking here.",
    "The Pittsburgh-based attorney announced his run for governor in May 2021.",
    "To learn more about Corman, visit his campaign website by clicking here.",
    "To learn more about Gerow, visit his campaign website by clicking here.",
    "To learn more about Gale, visit his campaign website by clicking here.",
    "He began his political career on the campaign staff of Ronald Reagan.",
    "The businessman from Delaware County joined the race in January 2021.",
    "To learn more about Mastriano, visit his website by clicking here.",
    "To learn more about Dr. Zama, visit his website by clicking here.",
    "Gerow’s candidate status was officially approved on March 15.",
    "Zama’s candidate status was officially approved on March 15.",
    "Josh Shapiro made his run for governor official via Twitter.",
    "Barletta had his candidate status approved on March 11.",
    "Dr. Nche Zama made his candidacy official in May 2021.",
    "He is the state Democrat committee endorsed candidate.",
    "He is in his second term as the attorney general.",
    "Hart’s candidate status was approved on March 15.",
    "He was the fifteenth Republican to join the race.",
    "Senator candidates must receive 2,000 signatures."
  ]
}