{
  "id": 6572,
  "mediaId": 8483,
  "date": "2022-04-16",
  "headline": "One-on-one with Pennsylvania gubernatorial candidate Charlie Gerow",
  "image": "https://kubrick.htvapps.com/vidthumb/images/charlie-gerow-1649803077.jpg?crop=1xw:1xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/one-on-one-with-pennsylvania-gubernatorial-candidate-charlie-gerow/39707104",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Lehman",
  "authorUrl": "https://www.wgal.com/news-team/f2045d51-727e-451e-b547-f5dfa705624f",
  "termIds": [
    4913,
    4946,
    4081,
    3926,
    392,
    1126,
    6095,
    6506
  ],
  "sentences": [
    "Gerow hasn't held political office, but the conservative strategist from Cumberland County thinks he can give Republicans an edge in the governor's race.",
    "Charlie Gerow, who is running for the Republican nomination, thinks he can offer the GOP its best chance of beating Democrat Josh Shapiro this fall.",
    "\"A basic citizenship test, which would evidence the fact that they had read the Constitution, that they knew about the rule of law,\" he said.",
    "We continue to bring you profiles of candidates running for Pennsylvania governor this year so you can be informed when you cast your ballot.",
    "On education, Gerow said he wants to make civics a central part of education again and add another requirement for graduating seniors.",
    "\"Ultimately, who can take Josh Shapiro on in that debate stage in October is going to be what decides this race,\" he said.",
    "Gerow said his experience in communications can help him find common ground between Democrats and Republicans.",
    "\"I think that's what you need in a governor – somebody who can unite people, bring them together.",
    "Gerow said he'd also back expansion of natural gas and other sectors of the energy industry.",
    "You know, they call me the conservative happy warrior and I always liked that,\" he said.",
    "\"I would have signed both the fetal heartbeat bill and the Down syndrome bill,\" he said.",
    "On election security, Gerow said no-excuse mail voting was a mistake in Pennsylvania.",
    "As an adopted child, Gerow said he's firmly pro-life and would have signed bills Gov.",
    "And while I've fought for principle, I've always done it with a smile on my face.",
    "Even Tom Wolf in a fit of lucidity said they're too high,\" he said.",
    "One-on-one with Pennsylvania gubernatorial candidate Lou Barletta",
    "Gerow said he'd look to cut taxes for Pennsylvania businesses.",
    "He thinks it could help an economy hurt by COVID-19 shutdowns.",
    "He thinks people need an election system they can trust.",
    "\"I am a little bit different as a candidate,\" he said.",
    "\"We have the highest in the country.",
    "Tom Wolf vetoed."
  ]
}