{
  "id": 6659,
  "mediaId": 8469,
  "date": "2022-04-12",
  "headline": "Trump intervenes in Pennsylvania GOP gubernatorial primary",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.webp",
  "link": "https://www.timesleader.com/wire/state-wire/1550275/trump-intervenes-in-pennsylvania-gop-gubernatorial-primary-2",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Besides McSwain and Corman, other GOP candidates include former GOP congressman Lou Barletta, best known for his hard line on immigration; state Sen. Doug Mastriano, a Trump supporter who pushed to overturn the 2020 election and showed up outside the U.S. Capitol during the Jan. 6 insurrection; and Dave White, who runs a large plumbing and HVAC firm and is a former Delaware County councilman.",
    "He knew what was happening and let it go.”\nTrump’s false claims of a stolen election have been debunked by the courts, his own Justice Department and numerous recounts, and no prosecutor, judge or election official in Pennsylvania has raised a concern about widespread fraud after Democrat Joe Biden won the state in 2020.",
    "Corman, the top-ranking state senator, had his lawyers petition the state Commonwealth Court on Tuesday afternoon to withdraw his candidacy and remove his name from the May 17 primary ballot — and then, barely three hours later, changed his mind and decided to continue with his campaign.",
    "By MARK SCOLFORO and MICHAEL RUBINKAM\nHARRISBURG, Pa. (AP) — Former President Donald Trump waded into Pennsylvania’s GOP gubernatorial primary on Tuesday, slamming a former acolyte over his alleged failure to investigate Trump’s false claims of widespread election fraud.",
    "Last summer, when McSwain asked for Trump’s endorsement, the former prosecutor criticized the manner in which Pennsylvania’s presidential election was run but claimed that Trump’s attorney general, Bill Barr, had blocked him from investigating potential irregularities.",
    "McSwain, in a statement released by his campaign, did not address Trump directly but said, “I’m proud of my record as U.S. Attorney.”\n“I’ve prosecuted and put people behind bars who committed voter fraud, and put rioters and looters in jail.",
    "McSwain has called the presidential election in Pennsylvania a “partisan disgrace” as he sought to curry favor with the former president, and often touted his connection to Trump while campaigning for the GOP nod in a crowded primary field.",
    "Corman, who represents a swath of central Pennsylvania surrounding Penn State’s main campus, is the Senate’s president pro tempore and has served in the chamber since 1999 after taking over the seat his father held.",
    "McSwain “told me that he had to do this because he was under pressure from Trump and for him to have a viable candidacy he couldn’t have Trump attacking him,” Barr told the paper last year.",
    "The nine-person field has some that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee Josh Shapiro, the state attorney general.",
    "He encouraged me to keep fighting, and that’s what I’m going to do — keep fighting for the people of Pennsylvania,” said Corman, whose campaign has struggled to gain traction.",
    "He was the U.S. Attorney who did absolutely nothing on the massive Election Fraud that took place in Philadelphia and throughout the commonwealth,” Trump said in a statement.",
    "“Two developments today have led me to decide to remain in the race for governor: President Trump’s statement on the race and my conversation directly with the president.",
    "So McSwain “tried to thread the needle” by saying “things that were technically true” without giving “support to Trump’s stolen election narrative,” Barr said.",
    "Barr told him to pass along any “serious allegations” of election fraud to Shapiro’s office, McSwain said in a letter seeking Trump’s imprimatur.",
    "Bill McSwain, who spent nearly three years as the top federal prosecutor in Philadelphia under Trump, had been seeking Trump’s endorsement.",
    "Trump, who has in Pennsylvania’s Republican U.S. Senate primary, has yet to make an endorsement in the governor’s race.",
    "Trump’s attack prompted another high-profile candidate to reconsider his decision to drop out of the race.",
    "When I’m Governor, we’re going to get back to a voting system that everyone has confidence in,” he said.",
    "You’re fired,” Sam Newton, spokesperson for the Democratic Governors Association, said in a statement.",
    "He told The Philadelphia Inquirer that McSwain was never told to “stand down” from investigating.",
    "Trump’s snub of McSwain prompted a change of heart for another GOP candidate, Jake Corman.",
    "“One person in Pennsylvania who I will not be endorsing is Bill McSwain for Governor.",
    "“Do not vote for Bill McSwain, a coward, who let our Country down.",
    "Barr , saying the order came from a top deputy, not him.",
    "Democrats were gleeful about Trump’s attack on McSwain.",
    "Rubinkam reported from northeastern Pennsylvania.",
    "Instead, Trump turned on him.",
    "“Sorry Bill."
  ]
}