{
  "id": 6681,
  "mediaId": 8449,
  "date": "2022-04-15",
  "headline": "Demócrata progresista y republicano de extrema lideran contiendas clave",
  "image": "https://media.telemundo62.com/2022/04/Screen-Shot-2022-04-15-at-9.21.07-AM.png?resize=1200%2C675&quality=85&strip=all",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/democrata-progresista-y-republicano-de-extrema-lideran-contiendas-clave/2206929/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4081,
    2469,
    1126,
    393,
    6506
  ],
  "sentences": [
    "El demócrata progresista John Fetterman, vicegobernador de Pensilvania, está muy por delante en la contienda primaria de su partido por el Senado de los Estados Unidos, mientras que el republicano de extrema derecha Doug Mastriano, un senador estatal del centro rural del estado, está en la delantera en las primarias republicanas para gobernador, según una nueva encuesta de Franklin and Marshall College publicada el jueves.",
    "Los resultados de la encuesta muestran que los aspirantes centristas de ambos partidos tienen mucho trabajo por hacer, desde el representante estadounidense Conor Lamb, un demócrata del oeste de Pensilvania que va detrás de Fetterman, hasta candidatos republicanos como Dave McCormick y Jake Corman.",
    "La contienda para gobernador podría determinar si los temas sociales divisivos se convierten o no en ley en un estado donde el gobernador demócrata Tom Wolf ha usado su poder de veto a menudo durante sus ocho años en el cargo para frustrar una legislatura conservadora controlada por republicanos.",
    "Mastriano ha liderado los esfuerzos para anular las elecciones presidenciales de 2020, mientras que Trump pidió esta semana a los votantes que no eligieran a McSwain, a quien llamó un \"cobarde\" que no hizo \"absolutamente nada\" sobre las afirmaciones refutadas de fraude electoral.",
    "Yost dijo que es probable que Fetterman se haya sentido impulsado por el reconocimiento de su nombre, no solo como el actual vicegobernador, sino también como alguien que se postuló en todo el estado en el pasado, una candidatura fallida para el Senado \\ en 2016.",
    "“Creo que el desempeño de Fetterman entre la base progresista, donde hay mucha energía, realmente lo ayuda”, dijo Berwood Yost, director del Centro de Investigación de Opinión y el Instituto Floyd de Políticas Públicas en Franklin and Marshall College.",
    "La encuesta muestra que el 16% de los republicanos encuestados votaría por Mehmet Oz para el Senado si las elecciones se celebraran hoy, lo que le da una ventaja mínima sobre David McCormick, quien obtuvo el 15% del apoyo de los encuestados.",
    "La carrera por el Senado para reemplazar al senador republicano Pat Toomey podría ser crítica en una cámara donde los demócratas ocupan la mitad de los escaños pero tienen un voto de desempate gracias a la vicepresidenta Kamala Harris.",
    "Los votantes registrados como republicanos o demócratas tendrán que tomar decisiones importantes en las otras tres contiendas primarias: las contiendas republicanas para el Senado y gobernador y la contienda demócrata para el Senado.",
    "De manera similar, la encuesta se realizó antes de que Trump criticara duramente a Bill McSwain, el exfiscal federal para el este de Pensilvania que se postula para gobernador del lado republicano.",
    "“Sé que la estrategia de Lamb ha sido plantear el tema de la elegibilidad, pero no sé cómo resuena eso entre los fieles del partido que van a votar en esta elección”, dijo Yost.",
    "“La bofetada de Trump contra McSwain ciertamente no lo ayudará entre los votantes de Trump”, en un estado donde el expresidente todavía tiene mucha influencia, dijo Yost.",
    "El 12% de los encuestados dijo que votaría por McSwain si las elecciones se realizaran hoy, mientras que el 15% dijo que votaría por el senador estatal Doug Mastriano.",
    "Mientras tanto, Lamb, más centrista, ha planteado el tema de la elegibilidad en un estado sólido, pero la táctica no ha dado los resultados deseados.",
    "Otra pregunta en la encuesta revela que Oz es visto \"muy desfavorablemente\" por el 24% de los republicanos y \"muy favorablemente\" por solo el 5%.",
    "Estos nuevos resultados brindan una idea del sentimiento de los votantes antes de las elecciones primarias de mayo y generales de noviembre.",
    "La encuesta se realizó antes del respaldo de Trump, y el expresidente “todavía es una figura popular en el partido republicano”, dijo Yost.",
    "Franklin and Marshall College encuestó a 785 votantes registrados de Pensilvania entre el 30 de marzo y el 10 de abril.",
    "Mientras tanto, el Senado republicano y las primarias para gobernador siguen siendo un \"desastre confuso\", dijo Yost.",
    "De los votantes encuestados, 356 se identificaron como demócratas, 317 como republicanos y 112 como independientes.",
    "El fiscal general demócrata Josh Shapiro se postula sin oposición en las primarias del 17 de mayo.",
    "Esas dos contiendas clave darán forma a la política local y nacional en los años venideros.",
    "Un factor que podría funcionar a favor de Oz, dijo Yost, es el respaldo de Trump.",
    "La escasa ventaja de Oz enmascara un gran problema para su elegibilidad general.",
    "Wolf no puede postularse para un tercer mandato."
  ]
}