{
  "id": 6739,
  "mediaId": 2654,
  "date": "2022-04-11",
  "headline": "Biden issues new federal rule aimed at privately made ‘ghost guns’ without serial numbers",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/04/2022-04-11T195323Z_1250936819_RC25LT9OCYXV_RTRMADP_3_USA-BIDEN-GUNCONTROL-1024x692.jpg",
  "link": "https://www.pbs.org/newshour/politics/biden-issues-new-federal-rule-aimed-at-privately-made-ghost-guns-without-serial-numbers",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Balsamo",
  "authorUrl": "https://www.pbs.org/newshour/author/michael-balsamo-associated-press",
  "termIds": [
    4905,
    5802,
    4767,
    2190,
    1489,
    200
  ],
  "sentences": [
    "Christian Heyne, the vice president of policy at Brady, another gun control group, said Dettelbach was “an unimpeachable public servant who has spent a career using the levers of government to hold negligent or nefarious actors accountable.”\nJustice Department statistics show that nearly 24,000 ghost guns were recovered by law enforcement at crime scenes and reported to the government from 2016 to 2020.",
    "Speaking at the White House, Biden highlighted the Justice Department’s work to finalize new regulations to crack down on ghost guns, and announced the nomination of Steve Dettelbach, who served as a U.S. attorney in Ohio from 2009 to 2016, to run the Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "But gun safety advocacy groups, like Everytown for Gun Safety, which pushed the federal government for years to take action on ghost guns, applauded Biden’s moves and insisted that both Dettelbach’s appointment and the finalized rule will help combat gun violence.",
    "WASHINGTON (AP) — President Joe Biden on Monday took fresh aim at ghost guns, the privately made firearms without serial numbers that are increasingly cropping up in violent crimes, as he struggles to break past gun-control opposition to address firearm deaths.",
    "Congress has deadlocked on legislative proposals to reform gun laws for a decade, and executive actions have faced stiff headwinds in federal courts — even as the Democratic base has grown more vocal in calling on Biden to take more consequential action.",
    "“A year ago this week standing here with many of you, I instructed the attorney general to write a regulation that would rein in the proliferation of ghost guns because I was having trouble getting anything passed in the Congress,” Biden said.",
    "Still, the announcement on guns highlights the limits of Biden’s influence to push a sweeping congressional overhaul of the nation’s firearm laws in response to both a recent surge in violent crime and continued mass shootings.",
    "“Just as we opposed the Trump Administration’s arbitrary ban on bump stocks, GOA will also sue Biden’s ATF to halt the implementation of this rule,” Aidan Johnston, the group’s director of federal affairs said in a statement.",
    "Federally licensed firearms dealers must retain key records until they shut down their business or licensed activity and then transfer the records to ATF as they are currently required to do at the end of licensed activity.",
    "WATCH: Yo-Yo Ma and Gabby Giffords perform ‘Sound of Silence’ to honor lives lost to gun violence\nSome states, like California, have enacted laws in recent years to require serial numbers to be stamped on ghost guns.",
    "Biden had to withdraw the nomination of his first ATF nominee, gun-control advocate David Chipman, after it stalled for months because of opposition from Republicans and some Democrats in the Senate.",
    "Both Republican and Democratic administrations have failed to get nominees for the ATF position through the politically fraught process since the director’s position was made confirmable in 2006.",
    "As well as turning up more frequently at crime scenes, ghost guns have been increasingly encountered when federal agents buy guns in undercover operations from gang members and other criminals.",
    "WATCH: Biden takes fresh aim at ‘ghost guns’ with new rules\n“Law enforcement is sounding the alarm,” Biden said of ghost guns, briefly holding one up for cameras to see in the Rose Garden.",
    "And two, they are unserialized and untraceable.”\nThe critical component in building an untraceable gun is what is known as the lower receiver, a part typically made of metal or polymer.",
    "Pennsylvania Attorney General Josh Shapiro, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "A gunman who killed his wife and four others in Northern California in 2017 had been prohibited from owning firearms, but he built his own to skirt the court order before his rampage.",
    "It is hard to say how many are circulating on the streets, in part because in many cases police departments don’t contact the government about the guns because they can’t be traced.",
    "“Ghost guns look like a gun, they shoot like a gun, and they kill like a gun, but up until now they haven’t been regulated like a gun,” said John Feinblatt, Everytown’s president.",
    "“Today is a critically important step to close that loophole.”\nHe said the move is likely to help drive down violence and aid both police and prosecutors in bringing their cases.",
    "An unfinished receiver — sometimes referred to as an “80-percent receiver” — can be legally bought online with no serial numbers or other markings on it, no license required.",
    "The new rule changes the current definition of a firearm under federal law to include unfinished parts, like the frame of a handgun or the receiver of a long gun.",
    "Previously, these dealers were permitted to destroy most records after 20 years, making it harder for law enforcement to trace firearms found at crime scenes.",
    "For years, federal officials have been sounding the alarm about an increasing black market for homemade, military-style semi-automatic rifles and handguns.",
    "The requirement applies regardless of how the firearm was made, meaning it includes ghost guns made from individual parts, kits, or by 3D-printers.",
    "The rule is also likely to help bring down the number of people who shouldn’t be purchasing firearms before a gun lands in their hand, he said.",
    "And in 2019, a teenager used a homemade handgun to fatally shoot two classmates and wound three others at a school in suburban Los Angeles.",
    "And just last week, a police officer there was shot by a ghost gun-wielding 18-year-old, who police said had also shot three others.",
    "Police in Philadelphia have seen nearly a 500% increase in the number of ghost guns recovered in the past two years, Shapiro said.",
    "Gun safety groups and Democrats in Congress have been pushing for the Justice Department to finish the rule for months.",
    "The New York Police Department, for example, said officers found 131 firearms without serial numbers since January.",
    "Manufacturers must also run background checks before a sale — as they do with other commercially made firearms.",
    "“There are two challenges: One, criminals can easily buy them without going through a background check.",
    "It will probably be met with heavy resistance from gun groups and draw litigation in the coming weeks.",
    "For nearly a year, the ghost gun rule has been making its way through the federal regulation process.",
    "Police across the country have been reporting spikes in ghost guns being recovered by officers.",
    "“Our communities are paying the price.”\nHe promised the new regulations would save lives.",
    "The rule goes into effect 120 days from the date of publication in the Federal Register.",
    "Since then, only one nominee, former U.S. Attorney B. Todd Jones, has been confirmed.",
    "Jones was acting director when President Barack Obama nominated him in January 2013.",
    "The group believes the rule violates the U.S. Constitution and several federal laws.",
    "“This loophole has caused our nation countless lives,” Shapiro said in an interview.",
    "Jones made it through the Senate in 2013 but only after a six-month struggle.",
    "The Biden administration’s plan on guns was first reported by Politico.",
    "Gun Owners of America vowed that it would immediately fight the rule.",
    "Dettelbach’s confirmation, too, is likely to be an uphill battle.",
    "It says those parts must be licensed and include serial numbers.",
    "AP writer Will Weissert contributed."
  ]
}