{
  "id": 6973,
  "mediaId": 6570,
  "date": "2022-04-14",
  "headline": "Editorial: Joe Biden, Josh Shapiro right to target ghost guns",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/COLLINS-COLUMN-2-1649889133.jpg",
  "link": "https://www.post-gazette.com/opinion/editorials/2022/04/14/biden-shapiro-ghost-guns/stories/202204130059",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "",
  "termIds": [
    4905,
    3926,
    1022,
    200,
    6009
  ],
  "sentences": [
    "Following a shooting spree Tuesday morning injuring at least 23 people on a subway train in Brooklyn, federal agents traced a handgun used by the shooter to identify the gun’s manufacturer, seller and initial owner.",
    "Last year, about 20,000 suspected ghost guns were recovered by law enforcement in criminal investigations and reported to the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF).",
    "With minimal expertise, people can create untraceable firearms that stymie investigators and generate a sense of impunity among those who carry them.",
    "Ghost guns — privately assembled and untraceable firearms without serial numbers — are proliferating and now pose a serious threat to public safety.",
    "Pennsylvania Attorney General Josh Shapiro has, sensibly, vowed to defend the new regulation against challenges that emerge in this state.",
    "Gun rights advocates — if they truly represent law-abiding hobbyists and not murderous outlaws — cannot reasonably object.",
    "For those with the know-how, do-it-yourself guns allow for configurations that can’t be found on manufactured firearms.",
    "The new ATF regulation requires stamped serial numbers on completed firearms, as well as on multiple key components.",
    "Further, background checks that currently apply only to off-the-shelf guns will also apply to gun kits and parts.",
    "It’s about assisting law enforcement in the increasingly difficult task of fighting violent crime.",
    "It’s no more an invasion of privacy than having a vehicle identification number, or VIN, on a car.",
    "They only hamper those who intend to create untraceable guns for unlawful and immoral purposes.",
    "That information, along with other evidence, helped police name a suspect: Frank R. James, 62.",
    "Gun tinkerers can continue to ply their craft, with the minimal hurdle of a background check.",
    "Philadelphia police have seen a six-fold increase in ghost guns in the last 24 months alone.",
    "They make finding a killer, or anyone else using a gun for unlawful purposes, much tougher.",
    "Without serial numbers, such traces are impossible, and every gun should have them.",
    "The Biden administration is right to close the ghost gun loophole through the ATF.",
    "Regulating ghost guns isn’t about eliminating firearms as a hobby.",
    "One of those guns was used to shoot an officer earlier this month.",
    "It’s not a government conspiracy to confiscate people’s guns.",
    "But these innovations are also invitations to law-breaking.",
    "Ghost guns can be assembled from kits or from other parts.",
    "Serial numbers on components don’t hamper them at all.",
    "Do-it-yourself guns are easier than ever to build.",
    "The figure marked a tenfold increase from 2016.",
    "First Published April 14, 2022, 4:00am"
  ]
}