{
  "id": 6992,
  "mediaId": 8493,
  "date": "2022-04-12",
  "headline": "At Local Forum, Gubernatorial Candidate Gale Calls Out Mastriano",
  "image": "https://www.wkok.com/wp-content/uploads/2020/06/vote-1-300x225.jpg",
  "link": "https://www.wkok.com/596844-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    4946,
    4539,
    3926,
    2650,
    1126,
    6407
  ],
  "sentences": [
    "In my opinion, anyone who voted for that disastrous legislation should be disqualified for running for any office.”\nBut then it was back to fighting for this and other big issues come this fall, including passionate remarks from retired surgeon Dr. Nche Zama, especially on the current state of teaching gender, “Gender is biology, and yet we stand back and watch our kids being indoctrinated in school that the anatomy that God gave them is wrong.",
    "In the Lieutenant Governor race, current Lebanon County state representative Russ Diamond focused on being at the forefront of fighting Governor Tom Wolf’s COVID mitigation efforts, including vaccine mandates, “The most important bill I have is a constitutional amendment which would cement medical freedom as a fundamental, individual right in Pennsylvania.",
    "Candidates at Susquehanna Valley Conservatives Forum\nLEWISBURG – The current field of candidates for Governor and Lieutenant Governor on the crowded GOP ticket all agree on what’s at stake versus Josh Shapiro and state democrats…but that didn’t stop one gubernatorial candidate from taking a big shot at one current favorite.",
    "Current Montgomery County Commissioner Joe Gale called out Republicans who voted for the Act 77 mail-in voting bill during a candidates forum Monday night hosted by the Susquehanna Valley Conservatives, “And one of the candidates running for Governor is Doug Mastriano, who I call Doug ‘mail-in’ Mastriano.",
    "I want to be a nightmare to those perpetrators.” Dr. Zama also was passionate about pro-life policies, but cleverly says Pennsylvania needs ‘radical surgery.’\nCumberland County’s Charlie Gerow and former US and state legislator Melissa Hart were other candidates who took part.",
    "You should have that right.”\nFormer state house member Rick Saccone is also running for lieutenant governor, focusing on gun rights and pro-life endorsements and accomplishments.",
    "Other Lieutenant Governor candidates in attendance included Jeff Coleman, Carrie DelRosso, and Chris Frye.",
    "Forum organizers said Doug Mastriano and Lou Barletta couldn’t attend.",
    "Because the only exemption you should ever need is ‘No thank you.",
    "Fireworks From GOP Governor, Lt. Gov.",
    "I don’t want that.’ That’s it."
  ]
}