{
  "id": 804,
  "mediaId": 8500,
  "date": "2022-02-22",
  "headline": "GOP candidate for governor ups campaign cash in late filing",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/mastriano-2-1621452889.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wtae.com/article/doug-mastriano-campaign-cash-pennsylvania-governor/39176710",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) —\nA Republican state lawmaker who is running for governor of Pennsylvania filed an updated campaign finance statement Tuesday showing that he has almost twice as much campaign cash as he initially reported, and spent almost 15 times as much.",
    "Mastriano has become a force in right-wing politics in Pennsylvania, first leading anti-shutdown rallies during the early months of the coronavirus pandemic and later spreading falsehoods about the 2020 presidential election won by Democrat Joe Biden.",
    "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General Josh Shapiro.",
    "Mastriano was in regular communication with Donald Trump as the then-president sought to reverse his election loss and was outside the Capitol during the insurrection.",
    "Mastriano is now reporting that he had slightly over $1 million in his campaign account heading into 2022, instead of the $550,000 he initially reported.",
    "He also reported spending more than $215,000 last year, not under $15,000, a figure so small that it raised questions about its accuracy.",
    "Last week, the congressional committee investigating the Jan. 6, 2021, insurrection at the U.S. Capitol issued Mastriano a subpoena.",
    "Last May, Mastriano said Trump “ asked me ” to run for governor, although Trump has made no endorsement in the race.",
    "The filing by state Sen. Doug Mastriano, R-Franklin, was three weeks after the deadline in state law.",
    "GOP won't endorse in big primary fields for governor, Senate"
  ]
}