{
  "id": 8729,
  "mediaId": 2522,
  "date": "2022-04-09",
  "headline": "ATF responds to claims NBC News’ ‘ghost guns’ segment may have broken the law",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-NBC-Ghost-Guns.jpg",
  "link": "https://www.bizpacreview.com/2022/04/09/atf-investigates-nbc-news-over-ghost-guns-segment-and-whether-it-broke-the-law-1223425/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    3297,
    3926,
    4648,
    5004,
    888,
    887,
    200,
    6678
  ],
  "sentences": [
    "“It is the duty and responsibility of the Pennsylvania General Assembly to therefore investigate—and if necessary—hold our Attorney General accountable for any violations of the law or his oath of office that may have occurred.”\n“The questionable report is only the latest in a long line of incidents where reporters have broken the very gun laws they set out to show are too weak.",
    "— Stephen Gutowski (@StephenGutowski) April 7, 2022\nOn Monday, the Second Amendment Foundation and Gun Owners of America signed a letter with three other gun-rights groups calling for the Republican-controlled Pennsylvania legislature to investigate the NBC News incident, according to Ammoland.",
    "Well, this’ll be the last we hear of this, why would the ATF prosecute the people they like over their arbitrary rules\n— Eric Hoover (@Eric_Hoover96) April 7, 2022\nThe left is claiming that “ghost guns” are rampant in the United States and that more laws are needed to control them.",
    "“We call on the Biden Justice Department to investigate possible violations of federal gun law, same as that agency would investigate any private citizen who had done the same thing,” Alan Gottlieb, head of the Second Amendment Foundation, proclaimed in a press release.",
    "SIGN UP HERE\n(Video Credit: NBC News)\nNBC News may be investigated by the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) for potentially breaking the law after airing a highly controversial segment on the “ghost guns” market in the United States.",
    "“ATF greatly values the public’s assistance in providing information about potential violations of the Federal firearms and explosives laws,” an ATF spokesman commented to The Reload, which is a media outlet that reports on the gun industry.",
    "— Stephen Gutowski (@StephenGutowski) April 7, 2022\nIn response to the dust-up, the ATF issued an official response on Thursday that did not confirm or deny that NBC News will be investigated for the legal breach.",
    "— Dayne (@Thunder_28606) April 7, 2022\nProponents for gun rights note that the transfer of a handgun kit across state lines would require a background check from the involved gun dealer as any firearm would.",
    "“You don’t get a pass simply by working for NBC.”\n\"The questionable report is only the latest in a long line of incidents where reporters have broken the very gun laws they set out to show are too weak.\"",
    "In May of 2021, the Department of Justice published its proposed rule broadening the definition of what constitutes a firearm in a further effort to ban so-called “ghost guns,” according to The Reload.",
    "The core question is whether the unfinished pistol frame and tools to complete it that the NBC reporter handed over to PA Attorney General staff for finishing was legally the same as a finished gun.",
    "The agency is asserting that all tips they have received regarding the incident will be “evaluated” and “referred to the responsible ATF Field Division” based on resources and availability.",
    "In a special report on March 17, NBC News reporter Vaughn Hillyard showed how it was allegedly a simple matter to buy a “ghost gun” kit that could then produce a gun without serial numbers.",
    "Journalists from NBC, CBS, and a Katie Couric documentary have faced scrutiny for potentially breaking state and federal gun laws during their reporting over the past decade.",
    "Gun rights advocates contend that Hillyard violated federal law when he purchased the kit across state lines and then transported it back to his state to have it assembled.",
    "As a side note, Hillyard also had the firearm constructed in the segment by an off-camera individual who reportedly works for Pennsylvania Attorney General Josh Shapiro.",
    "They have complained to the ATF and federal authorities that members of the press should be investigated for the infringement just as anyone else would be.",
    "It’s illegal for us and it’s illegal for them,” the legal counsel for Gun Owners of America, Andrew Austin, charged in a statement given to The Reload.",
    "“That leaves some ambiguity until the rule is adopted,” firearms reporter and The Reload founder Stephen Gutowski stated, according to Mediaite.",
    "The reporter bought a kit outside of his home state, brought it across state lines, then gave it to other individuals to build the firearm.",
    "Many believe the statement indicates that absolutely nothing will be done about the violation of the law in connection with NBC News.",
    "The diktat has not satisfied the left or the media, prompting them to go all-out against “ghost guns” to further gun control.",
    "The law concerning the kits is said to be a legal gray area with the ATF vowing to address the issue to tighten regulations.",
    "Shapiro and his office know this was illegal as he has prosecuted individuals for exactly these actions,” the letter said.",
    "“They aren’t permitted to make guns for third parties or transfer firearms to others without getting a background check.",
    "The rule makes it much more difficult to sell unfinished firearms receivers, especially as part of a gun-building kit.",
    "They are clearly not very well informed on the laws in question and may have gotten some bad advice as well.",
    "The mistakes have added to mistrust of major media sources among gun owners,” The Reload commented.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Ironically, that move may have broken the very law the media outlet was reporting on.",
    "https://t.co/VdWrTuqaxC\n— Rob Romano (@2Aupdates) April 7, 2022\nYou would hope so.",
    "If so, transferring it across state lines without a background check was illegal.",
    "You break the law for a company or for yourself, it’s still breaking the law.",
    "At issue is the question of whether the kits are actual firearms or not.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "Really pisses me off what the media can get away with.",
    "The public will not see it and we do not share it.",
    "It is a blatant effort to infringe on gun rights.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Happened a few years back.",
    "He’ll get a free pass.",
    "My view?",
    "“Mr."
  ]
}