{
  "id": 8756,
  "mediaId": 2732,
  "date": "2022-04-05",
  "headline": "AG Josh Shapiro bans Martino Motors from selling cars",
  "image": "",
  "link": "https://triblive.com/local/penn-hills/ag-josh-shapiro-bans-martino-motors-from-selling-cars/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tanisha Thomas",
  "authorUrl": "https://triblive.com/author/tanisha-thomas/",
  "termIds": [
    3926,
    6505,
    6506
  ],
  "sentences": [
    "“Scammers are shifting into high gear to try and take advantage of Pennsylvanians looking to buy a used car and it’s my job as the people’s lawyer to stop them.”\nFollowing the February announcement of Shapiro’s legal action, several consumers reached out to the Tribune-Review to share their stories of purchasing faulty vehicles.",
    "But when demand went up, Martino Motors hit reverse and returned to their predatory ways in order to make a quick buck at the expense of hard-working Pennsylvanians.”\nShapiro announced in February that he was taking legal action against two Pennsylvania dealerships, one of them being Martino Motors.",
    "He said the dealership had been selling cars that are not “roadworthy.”\n“We’ve seen an increase in demand for used cars here in Pennsylvania, and with that comes an increase in scammers,” Shapiro said.",
    "Attorney General Josh Shapiro announced in a press release Monday that Martino Motors, 536 Rodi Road, violated an Assurance of Voluntary Compliance (AVC) that the dealership entered into in 2014.",
    "Many consumers encountered mechanic problems shortly after leaving the lot, costing them hundreds of dollars to fix — sometimes even more than what they initially paid for their cars.",
    "The office is reviewing complaints to determine if further requests for restitution from the court are warranted.",
    "Others had cars that were no longer operable a short time after they were purchased.",
    "You can contact Tanisha at 412-480-7306, tthomas@triblive.com or via Twitter .",
    "A Penn Hills used car dealership is banned from selling cars in Pennsylvania.",
    "Categories: Allegheny | Local | Penn Hills Progress | Top Stories",
    "“The ones that every dealership in Pennsylvania have to abide by.",
    "“Martino Motors agreed to play by the rules,” Shapiro said.",
    "The Attorney General’s office reported 21 complaints.",
    "Shapiro was not immediately available for comment.",
    "Tanisha Thomas is a Tribune-Review staff writer."
  ]
}