{
  "id": 1752,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Trump predicts tremendous season' for Republicans he supports: I was 22 and 0'",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trumprally7_06202020_gettyimages.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3477280-trump-predicts-tremendous-season-for-republicans-he-supports-i-was-22-and-0/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Vakil",
  "authorUrl": "https://thehill.com/author/caroline-vakil/",
  "termIds": [
    1147,
    1646,
    1801,
    2095,
    380,
    428,
    2672,
    2710,
    2845
  ],
  "sentences": [
    "He also predicted that celebrity cardiothoracic surgeon Mehmet Oz was going to do well in the Pennsylvania GOP primary, where he is facing former hedge fund executive David McCormick, who has hired a number of former Trump staffers on his campaign.",
    "Trump told Fox that he thought the Georgia primaries later this month would be interesting,? noting he had a number of endorsed candidates there, including former Sen. David Purdue (R), who he has backed against incumbent Gov.",
    "It was a great evening for the Republican Party, and we love all of our candidates from Indiana, from Ohio, I went 22 and 0,? the former president told Fox News in an interview published on Wednesday.",
    "I think all of them will be winning in the fall.?\nIn a separate interview with CBN News, published on Wednesday, Trump said his record was unparalleled.?\nMy endorsements, it's totally unparalleled.",
    "Former President Trump was bullish on his midterm endorsements after all 22 of his chosen candidates in Ohio and Indiana won their respective Republican primaries on Tuesday.",
    "Polls had the Trump critic-turned-acolyte trailing in highly competitive race, with his challengers trying to highlight his previous criticism of the former president.",
    "I think we're going to win a lot of races with great candidates who are going to go on to big numbers in the fall,? he added.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "It was a great victory for everyone, but I am most happy for the Republican Party because we have great candidates.",
    "At the center of Trump's successful endorsements on Tuesday was Hillbilly Elegy? author and venture capitalist J.D.",
    "Vance, who won the Ohio Senate Republican primary just weeks after receiving Trump's blessing.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "I'm almost unblemished,? he told the Chrisian news outlet.",
    "I think we're going to have a tremendous season.",
    "showed tremendous strength,? Trump told Fox.",
    "Nobody's ever had a record like this.",
    "Brian Kemp (R).",
    "I think J.D."
  ]
}