[
  {
    "id": 77,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "She faces multiple GOP primary challengers, including one endorsed by Trump, Army Special Forces veteran <span class='selected-term'>Joe Kent</span>.",
    "author": "Cristina Marcos",
    "title": "The fates of the 10 House Republicans who voted to impeach Trump"
  },
  {
    "id": 2256,
    "mediaId": 237,
    "date": "1/17/2022 12:00:00 AM",
    "sentence": "It's going to come from the right, too.?\nHe was one of two Republican candidates, along with <span class='selected-term'>Joe Kent</span> of Washington, to attend a September Justice for J6? rally in support of alleged participants of the Jan. 6 Capitol riot still in Washington, D.C., jails.",
    "author": "Emily Brooks",
    "title": "A top GOP House candidate in Georgia says election doubts still driving voters"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. Jaime Herrera Beutler\nThe six-term Washington state lawmaker faces several primary challengers, including the Trump-backed <span class='selected-term'>Joe Kent</span>.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 2247,
    "mediaId": 195,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Trump has endorsed <span class='selected-term'>Joe Kent</span>, one of Herrera Beutler's Republican primary challengers in Washington's 3rd Congressional District.",
    "author": "Julia Manchester",
    "title": "GOP women's group endorses Herrera Beutler in primary race"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "There was probably a time when it made sense to have someone like Kevin McCarthy, but we need new leadership in the House,? said <span class='selected-term'>Joe Kent</span>, a square-jawed former Special Forces officer who is trying to unseat Representative Jaime Herrera Beutler in Washington, one of 10 Republicans who voted to impeach Mr. Trump after the Capitol attack.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 2238,
    "mediaId": 43,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "These chyrons appeared during Carlson's show, accompanying Carlson's statements prior to and during his colloquy with his guest, <span class='selected-term'>Joe Kent</span>a Donald Trump-endorsed zealot currently attempting to unseat Washington Rep. Jaime Herrera Butler.",
    "author": "",
    "title": "America now has its own 'Fifth Column,' and its name is Fox News"
  },
  {
    "id": 2223,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Vance, <span class='selected-term'>Joe Kent</span> and David Sacks.",
    "author": "",
    "title": "POLITICO Playbook PM: What the March jobs report means for Biden"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Army veteran <span class='selected-term'>Joe Kent</span> got the Trump nod in a primary against Rep. Jaime Herrera Beutler (R-Wash.).",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In southwestern Washington, Trump has endorsed former Army Green Beret <span class='selected-term'>Joe Kent</span> against Herrera Beutler.",
    "author": "",
    "title": "New lines, interesting races in Washington state"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The GOP's supreme master is supporting <span class='selected-term'>Joe Kent</span>, an Army veteran who has defended Putin's invasion of Ukraine, but that endorsement hasn't deterred his fellow Republicans, evangelical author Heidi St. John and state Rep. Vicki Kraft.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  }
]