{
  "id": 11089,
  "mediaId": 2746,
  "date": "2022-03-14",
  "headline": "Seventeen GOP lawmakers sue CDC over mask mandates on flights",
  "image": "https://twt-thumbs.washtimes.com/media/image/2020/08/11/virus_outbreak_congressman_antibodies_91886_c0-216-5179-3237_s1200x700.jpg?593e82a00fab2d01d596bed603dc8cbc02b85a40",
  "link": "https://www.washingtontimes.com/news/2022/mar/14/seventeen-gop-lawmakers-sue-cdc-over-mask-mandates/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    3618,
    1433,
    253,
    1126,
    392,
    6653,
    6175,
    6159,
    6279,
    5949
  ],
  "sentences": [
    "The lawmakers that signed on as co-plaintiffs are: Sen. Rand Paul of Kentucky; Rep. Andy Biggs of Arizona; Rep. Dan Bishop of North Carolina; Rep. Lauren Boebert of Colorado; Rep. Andrew Clyde of Georgia; Rep. Warren Davidson of Ohio; Rep. Bob Good of Virginia, Rep. Paul Gosar of Arizona;, Rep. Marjorie Taylor Greene of Georgia; Rep. Brian Mast of Florida; Rep. Alex Mooney of West Virginia; Rep. Barry Moore of Alabama; Rep. Ralph Norman of South Carolina, Rep. Bill Posey of Florida, Rep. Matt Rosendale of Montana, and Rep. Chip Roy of Texas.",
    "“Congress never passed a law requiring masks on commercial flights.”\n“This lawsuit targets the faceless bureaucrats who are behind the CDC‘s unscientific regulation so that this illegal mask mandate can be brought to a permanent end,” he said.",
    "“The Centers for Disease Control and Prevention does not have the legal authority to force people traveling on commercial airlines to wear masks,” Rep. Thomas Massie, Kentucky Republican, said in a statement.",
    "Republicans have warned against government overreach and argued that individuals and their families should be able to make their own decisions regarding COVID prevention.",
    "“Even if Congress had granted the CDC the authority to promulgate the Mask Mandate, this authority would violate the nondelegation doctrine,” the lawsuit says.",
    "The administration announced last week that it was extending the mask mandate on public transportation including airlines, trains and buses until April 18.",
    "Seventeen Republicans have filed a lawsuit against the Center for Disease Control and Prevention demanding an end to mask mandates on flights.",
    "Democrats have taken a more cautious approach, and have generally lined up behind mask mandates as a way to slow the spread of the virus.",
    "The lawsuit filed against the CDC says the body lacks the authority to make people wear masks on commercial airlines.",
    "The debate over coronavirus protocols has divided the nation.",
    "The lawsuit says the CDC is overstepping its authority."
  ]
}