{
  "id": 11225,
  "mediaId": 2533,
  "date": "2022-03-10",
  "headline": "Pelosi Quietly Dropped Huge Spending Bill At 2:30AM For Vote Just Hours Later",
  "image": "https://www.chicksonright.com/wp-content/uploads/2022/03/IMG_3843.jpg",
  "link": "https://www.chicksonright.com/blog/2022/03/10/pelosi-quietly-dropped-huge-spending-bill-at-230am-for-vote-just-hours-later/",
  "mediaOutlet": "chicksontheright.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Argyle",
  "authorUrl": "https://www.chicksonright.com/blog/author/natalie-argyle/",
  "termIds": [
    0
  ],
  "sentences": [
    "That’s on top of the $4.1 billion they’re getting for operations support, of course pic.twitter.com/CB4SDiMsU0\n— Oilfield Rando (@Oilfield_Rando) March 10, 2022\nOn page 1,556, of the $1.5 Trillion dollar Omnibus bill that Democrats are still fighting over, I just thought I’d let y’all know that we are going to fund $17,000,000 “to build and maintain safe latrines” in developing countries.",
    "Watch his full discussion with @TBatesNews and @JRiveraRAV on #AVAM: https://t.co/rtp07r8tWm pic.twitter.com/5U75xvd10O\n— Real America’s Voice (RAV) (@RealAmVoice) March 9, 2022\nLiterally in the DARK OF NIGHT, the Democrat controlled Rules Committee met at 1:30 am – 2:30 am and passed the HORRENDOUS $1.5 TRILLION Omnibus bill.",
    "“That is a DISGUSTING display by BOTH SIDES of this body…STOP selling the American people a bill of goods, and I’m looking directly at my party when I say that.” pic.twitter.com/wuwGRm59tS\n— Townhall.com (@townhallcom) March 8, 2022\nThey passed the bill, so I guess they didn’t care all that much.",
    "pic.twitter.com/nwoe26FVMa\n— Oilfield Rando (@Oilfield_Rando) March 10, 2022\nHaha one section of the Omnibus gives the DOD $300,000,000 to train/arm Ukrainian forces but exempts the Azov Battalion pic.twitter.com/ncwBM9s8EG\n— Oilfield Rando (@Oilfield_Rando) March 10, 2022\nWhat’s AZOV, you ask?",
    "Do you think it’s even POSSIBLE for your representatives to know exactly what it was that they were voting on, considering they had less than 8 hours to sift through 2741 pages of technical legal jargon?",
    "Do you think our elected representatives in government care that it’s obvious to the American people that the couldn’t possibly know everything that was in it when they voted on it?",
    "And since we’re almost $30 trillion in debt already, I guess they also don’t care all that much about the historic and daily increasing inflation Americans are facing today.",
    "While you were sleeping, and in the midst of historic inflation and a historic spending deficit, your government representatives dropped another massive spending bill.",
    "pic.twitter.com/T65B6WDiJ9\n— Oilfield Rando (@Oilfield_Rando) March 10, 2022\nLmao the omnibus bill gives the IRS $275,000,000 for “Business Systems Modernization”.",
    "Sen. Ron Johnson: “By the end of this fiscal year we will be about $30 trillion dollars in debt and that’s on top of a roughly $21 or $22 trillion dollar economy.",
    "We’re at dangerous levels.” pic.twitter.com/n4lMnvGnBy\n— The Hill (@thehill) May 26, 2021\nAs time passes, we discover more of what was actually in the bill.",
    "Unfortunately, both parties waive the rules and exempt themselves from accountability – especially when working together to bankrupt America.",
    "— Oilfield Rando (@Oilfield_Rando) March 10, 2022\nLook how many new laws they crammed into this thing as simple line items.",
    "$200,000,000 for the Gender Equity and Equality Action Fund\n$50,000,000 for the Women’s Leadership Fund.",
    "We’ve given them eleventy fafillion in the last two years across all the covid and infrastructure bills.",
    "@RepAndyBiggsAZ: They’ve given us a 2700 page bill at 2:30 this morning and said we vote on it at 10am.",
    "https://t.co/Bd9wq4zsmb\n— Warren Davidson (@WarrenDavidson) March 9, 2022\nAnother question.",
    "pic.twitter.com/lUGTjwxBno\n— Rep. Marjorie Taylor Greene (@RepMTG) March 9, 2022\nQuestion.",
    "Another $3.2 billion for Energy Efficiency and renewable energy projects in the omnibus.",
    "They did NOT tell anyone or announce this debate on the bill until after midnight!",
    "WATCH: @RepChipRoy ERUPTS on the House floor at both Democrats AND Republicans.",
    "They’re basically saying we don’t get to know what’s in it until we pass it.",
    "And they were scheduled to vote on it less than 8 hours later at 10:00 AM.",
    "The House rules package requires three legislative days to read the bill.",
    "Very long story short, t’s a Neo-Nazi faction of the Ukrainian military.",
    "They disseminated the 2741 page, $1.5 Trillion bill at 2:30 AM.",
    "— Rep. Marjorie Taylor Greene (@RepMTG) March 9, 2022",
    "We woke up to 2,741 pages and we vote today!",
    "I just want to know if their gender neutral?",
    "Just tipsy skimming through the omnibus.",
    "Most certainly not Republicans.",
    "No one is coming to save you.",
    "Here are some highlights.",
    "We are a clown country.",
    "Why not.",
    "."
  ]
}