{
  "id": 13990,
  "mediaId": 8497,
  "date": "2022-03-15",
  "headline": "17 lawmakers, including some from Ohio, Kentucky, sue CDC over mask mandate on planes",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/planes-3-1595354611.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/17-lawmakers-including-some-from-ohio-kentucky-sue-cdc-over-mask-mandate-on-planes/39441743",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Americans are fed up with political measures linked to public health and deserve representation that will take action to bring these unconstitutional mask mandates to an end,\" Rep. Warren Davidson said in a statement.",
    "\"The CDC lacks the legal authority to make law, it hasn’t used rule-making consistent with the Administrative Procedures Act, and shouldn’t be able to use coercion to compel airlines or TSA to enforce its mandates.\"",
    "\"I’ve been leading the charge in the Senate to end these unscientific, unconstitutional mask mandates, and am proud to continue the fight by joining Rep. Massie on this effort,\" Sen. Rand Paul said in a statement.",
    "\"The Centers for Disease Control and Prevention does not have the legal authority to force people traveling on commercial airlines to wear masks,\" Rep. Thomas Massie said in a statement.",
    "Kentucky Rep. Thomas Massie (R) said the lawsuit claims none of the statutes or regulations by the Centers for Disease Control and Prevention permit them to enforce the mandate.",
    "This lawsuit targets the faceless bureaucrats who are behind the CDC's unscientific regulation so that this illegal mask mandate can be brought to a permanent end.\"",
    "COLUMBUS, Ohio —\nSeventeen Congress members have filed a lawsuit against the Centers for Disease Control to end the mask mandate on commercial airlines.",
    "Massie is asking a federal court to declare \"the mask mandate is beyond the CDC’s statutory authority or is unconstitutional.\"",
    "It also alleges that if Congress granted the CDC the authority, it would violate a principle \"non-delegation doctrine.\"",
    "It also seeks an injunction prohibiting the CDC from enforcing the mandate.",
    "\"Congress never passed a law requiring masks on commercial flights."
  ]
}