{
  "id": 1638,
  "mediaId": 2546,
  "date": "2022-02-15",
  "headline": "How Cynthia Lummis, a rancher and grandmother, was crowned the Senate’s queen of crypto",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/senate_vote_tw526_052521.jpg",
  "link": "https://rollcall.com/2022/02/15/cynthia-lummis-senate-crypto/",
  "mediaOutlet": "CQ Politics ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Saksa",
  "authorUrl": "https://www.rollcall.com/author/jim-saksa/",
  "termIds": [
    0
  ],
  "sentences": [
    "What they’re really saying is we don’t trust the federal government, we don’t trust the Fed, we don’t trust the government controlling the money supply.”\nThe final sign, said Bernstein, “is when you go to a party or step in an Uber and the driver or person next to you starts talking about their Bitcoin investments — [when] the people who generally don’t know the difference between debenture and derriere suddenly become experts on blockchain.”\nLummis doesn’t seem fazed by these criticisms — that Bitcoin fails to live up to its coinage as a currency because it’s not actually useful as a means of exchange and that, instead, its valuation stems completely from numismatic speculation.",
    "According to Lummis’ office, the draft bill they hope to introduce this spring gives “clear guidance to regulators about which assets belong to different asset classes, protects consumers through strong standards and mechanisms for policing bad actors, regulates stablecoins, and creates a new digital asset self-regulatory organization under the joint jurisdiction of the CFTC and SEC to oversee the digital asset markets.”\nBond, whose organization hopes to be the self-regulatory organization, or SRO, under that proposal, said the Cowboy State provides the model Congress should emulate.",
    "Schoar recently co-authored a paper arguing that Bitcoin’s sky-high prices are mostly the product of investors betting that “regulators worldwide will allow Bitcoin to be a financial instrument that regular people are allowed to invest in.”\nToward regulation\nScammers have flocked to the blockchain, executing classic pump-and-dump schemes, which the jargon-loving crypto community calls “rug pulls.” The FTC received nearly 7,000 reports of crypto scams worth $80 million between October 2020 and March 2021, a twelvefold increase over the same period a year earlier.",
    "Working with lawmakers in both parties, Lummis has written a draft bill that her office touts as “the first comprehensive, broad piece of legislation relating to digital assets, of the same caliber as Gramm-Leach-Bliley and Riegle-Neal.”\nOne of those laws, the Gramm-Leach-Bliley Act of 1999, deregulated large swaths of the financial sector to contested effect: Supporters credited it for unleashing an economic boom, while critics blamed it for the subsequent bust in 2008.",
    "And now from her seat on the Senate Banking Committee, Lummis is leading the legislative push to build a regulatory framework that will support crypto markets, which some U.S. financial regulators have currently described as “95 percent fraud, hype, noise and confusion” and “the Wild West.”\nThat plan has its critics, who say it’s self-serving.",
    "“I went, I did my speech, and then I stuck around for two days in a room with no windows on a resort beach in Cancun, Mexico — never went to the beach, just sat in there and listened with complete fascination to a big debate among the people who keep the Bitcoin algorithms, the miners, the investors,” she said.",
    "And it won’t be cheap: The Cambridge Bitcoin Electricity Consumption Index estimated in February that Bitcoin was using about 125 terawatt hours per year, which is more electricity than the entire country of Norway and just short of what the entire global gold mining industry consumes.",
    "But the way Lummis tells it, the astronomical return on investment wasn’t what converted her into a Bitcoin evangelist who wears her faith on her Twitter profile — she added laser eyes to her campaign account’s avatar last February — and speaks in crypto’s extremely online tongues.",
    "While the nascent crypto lobby has been trying to educate an often skeptical Congress for a few years now, its first legislative crisis came last summer, when the Senate added tax reporting requirements for crypto firms shortly before passing the bipartisan infrastructure bill.",
    "Much of the money being invested into crypto is flowing to upstarts promising to disrupt Wall Street using blockchain technology, falling under the purview of a disjointed state and federal regulatory regime that’s hard enough to navigate without the additional complications.",
    "She has the zeal of the newly converted here.”\nLummis says her bill would tame that lawlessness by providing regulatory clarity and allowing legit crypto projects to flourish under a supervisory framework akin to those that currently oversee securities and commodities.",
    "It’s the one that’s going to grow in value over time.”\nDuring our interview, Lummis also touted a user’s ability to send Bitcoin “over your phone, in a flash, without transaction fees,” in contrast to the costs of wiring money through banks or using a credit card.",
    "I pressed Lummis on this point: Something so volatile hardly sounds like a “store of value,” and even though U.S. inflation is the highest it’s been in decades, at 7 percent over 2021, that’s a far cry from what has happened to Lebanon’s nearly worthless pound.",
    "While law enforcement can sometimes still track down recipients — the FBI recovered about $2.3 million of the $4.3 million in Bitcoin that Colonial Pipeline paid to ransomware hackers last summer — many illicit transactions fly completely under the radar.",
    "(She’ll say things like “I am a HODLer,” shorthand for the crypto community’s exhortation to “Hold On for Dear Life.”)\nIf Christmas 2013 was Lummis’ baptism, her confirmation came in 2017, shortly after she retired from the House after four terms.",
    "Miami Mayor Francis X. Suarez gave the opening speech at the two-day, $1,499-a-ticket conference, but the highlight was none other than Ross Ulbricht, the founder of Silk Road, a flea market for illegal drugs and other contraband on the dark web.",
    "“The notion of having something of value on the internet that I could never get my hands on was foreign to me.”\nNo, it was a hunch about the young man sitting across her kitchen table in snowy Star Valley, Wyo., just before Christmas in 2013.",
    "I see them as hard money, much the way gold is hard money.”\nEditor’s note: The writer of this article owns small amounts of a few different cryptocurrencies, including Bitcoin, that total less than $200 in value at the time of publication.",
    "Some candidates are even running on pro-crypto platforms, a move that seems aimed more at gleaning the nascent tech field’s donations than winning votes, given that only 16 percent of U.S. adults say they have ever used or invested in it.",
    "A token first sold to fund the development of a new product can look an awful lot like a stock or bond regulated by the Securities and Exchange Commission, but it could then start being used more like money, or at least store credit.",
    "“I think she’s got an interest in trying to protect Wyoming’s advantages.”\nAnne Alexander, a professor at the University of Wyoming, said about 50 crypto firms have relocated to the state to take advantage of the crypto laws there.",
    "“Infrastructure showed what a shining star Sen. Lummis is.”\nBond also pointed to Lummis’ legislative aide, Chris Land, who as a staffer in the state legislature helped write Wyoming’s industry-heralded cryptocurrency statute.",
    "So, to say that our currency is squeaky clean is incorrect, but it’s the cleanest, most reliable, most dependable currency that’s issued by any country on earth.”\n“But it’s not going to withstand the test of time,” she added.",
    "This year’s Super Bowl broadcast, so packed with commercials touting exchanges like Coinbase and FTX that some took to calling it the “crypto bowl,” may have made it seem like crypto has decisively hit the mainstream.",
    "“As I understand it, I just happened to sit in on what was a really consequential conversation among those early adopters of Bitcoin.”\nAfter that she was hooked, and two years later she was running for the Senate.",
    "But even among her colleagues in the Financial Innovation Caucus that she co-founded with Arizona Democrat Kyrsten Sinema, this Mountain West grandmother has become crypto’s most zealous cheerleader in Congress.",
    "“Her intellectual curiosity initially led her to buy Bitcoin a few years ago, and I believe it is what enables her to see the potential of the innovations for U.S. businesses, investors and consumers,” she said.",
    "“How lucky are we?”\nWyoming’s laws are so good for crypto, said fellow lawmaker and convert Davidson, he worries, perhaps half-jokingly, that Lummis might not want to fully level the playing field with her bill.",
    "“Having grown up as a rancher, we always said, ‘Well, buy more land, they’re not making any more of it.’ And the rancher’s dream was, ‘I only want to own the land next door to me,’” she said.",
    "(Unlike some other researchers, Schoar and her co-authors don’t think Bitcoin’s usefulness for crime drives its value much, estimating that just 3 percent of bitcoin is used illicitly.)",
    "Lummis traveled to Miami last summer for the 2021 Bitcoin Conference, speaking on a panel about Congress with Ohio Republican Rep. Warren Davidson, a fellow crypto enthusiast.",
    "Ulbricht, perhaps better known by his online alias “the Dread Pirate Robert,” was sentenced to life in prison for his role facilitating drug deals online using Bitcoin.",
    "When asked about how it looked to share a billing with a convicted criminal, Lummis avoided the question, arguing instead that Bitcoin is no worse than plain old cash.",
    "She was invited to give a speech on how Congress works at the Satoshi Roundtable, an influential meeting of crypto minds named after Bitcoin’s pseudonymous inventor.",
    "Lummis argued that Bitcoin fits in a well-diversified retirement portfolio — it can fluctuate in price day by day, but long term, she sees it going nowhere but up.",
    "The Crypto Council for Innovation called Lummis “a champion for crypto.” Perianne Boring, president of the Chamber of Digital Commerce, called her a visionary.",
    "Lummis bristles at the suggestion that Bitcoin’s main value comes from illicit activities, but it’s an association that’s tough to escape, as she knows.",
    "For Cynthia Lummis, the Senate’s “crypto queen” and owner of somewhere between $170,000 and $230,000 worth of Bitcoin, it all started with a hunch.",
    "I asked her if she agreed, minus the negative spin, that Bitcoin is better understood as a financial asset to bet on rather than a useful currency.",
    "Lummis, who last year disclosed an August purchase of between $50,001 and $100,000 more Bitcoin, says her belief in the cryptocurrency runs deep.",
    "Schoar’s paper found that most of Bitcoin’s price stems from forecasts of its continued rise and that it’s rarely used to actually buy things.",
    "“And so, I thought, I want to make friends with this guy, he could be a member of our family.”\nLummis was right — Will is now her son-in-law.",
    "According to the DEA’s 2020 National Drug Threat Assessment, cartels seem to be running more of their money laundering operations on crypto.",
    "That would do wonders for the price of Bitcoin, said Antoinette Schoar, a professor of finance at the Massachusetts Institute of Technology.",
    "“It’s definitely a conflict of interest,” said Dylan Hedtler-Gaudette, government affairs manager at the Project on Government Oversight.",
    "When that ends, the expense of running massive server farms dedicated to running the Bitcoin network will fall entirely on the users.",
    "Drug dealers, hackers, tax evaders and other shady characters have also increasingly hidden their illicit activities in plain sight.",
    "But many of those companies have just incorporated there, not moved their operations or located their headquarters there, she said.",
    "After the sponsor of that bill, Tyler Lindholm, lost a primary challenge in 2020, Lummis hired him to be her state policy director.",
    "Transactions on blockchains like Bitcoin are public — anyone can see them — but the sending and receiving accounts are anonymous.",
    "The price of Bitcoin had swung between $67,000 and $30,000 in the past year, fluctuating as much as 10 percent in a single day.",
    "“The concepts of property ownership have always been embedded in the way I grew up, and the way I think about stores of value.",
    "“Cynthia Lummis was just incredible in this whole thing,” said Michelle Bond, CEO of the Association of Digital Asset Markets.",
    "There will only be 21 million bitcoins ever produced, ever,” she continued, contrasting that with hyperinflation in Lebanon.",
    "This is not deregulatory, this is creating a regulatory regime.”\n‘Hard money’\nOthers in the industry echoed Bond’s praise.",
    "“Wyoming is ahead of every other state,” said the Ohio Republican, who is arguably crypto’s biggest fan in the House.",
    "“It’s easier to hide a crime committed in U.S. dollars than it is to hide a crime committed in Bitcoin,” she said.",
    "But cryptocurrencies can be chimeric assets, causing jurisdictional headaches for regulators and developers alike.",
    "Not about blockchain technology’s still unproven promise to revolutionize finance or Bitcoin’s growth potential.",
    "This drawback hasn’t sunk Bitcoin’s appeal, Schoar said, because it’s not actually used as a means of exchange.",
    "‘You don’t get it, you’re an idiot,’” he said, adding that this anger often comes with an ideological edge.",
    "“In this particular case, she has become the leading evangelist for crypto, so it makes it look even worse.",
    "Third, “when you express skepticism and people don’t just disagree with you, but [they] get angry at you.",
    "The conference organizers played a recording of a lengthy phone call he made extolling Bitcoin’s virtues.",
    "Lummis opposed the requirement and penned an amendment that won some, but not enough, bipartisan support.",
    "(He was also indicted for soliciting a hitman to kill an associate, but prosecutors dropped the charge.)",
    "You look at its price history and you see it’s got Chernobyl, Three Mile Island-level risk,” he said.",
    "“But the dollar is the world’s reserve currency, and there’s not a near-term end in sight for that.",
    "“Just like land, Bitcoin is a store of value, it is property, it is a commodity, it is limited.",
    "But Bitcoin exhibits what he identifies as the four key characteristics of a financial bubble.",
    "He thinks blockchain might actually be able to revolutionize aspects of the financial system.",
    "“It was pretty apparent at the time that my daughter and Will were pretty serious,” she said.",
    "Upon her swearing-in last year, Lummis became the first crypto owner in the Senate’s history.",
    "Currently, the miners are subsidized by the chance of being rewarded a newly minted bitcoin.",
    "That makes it a lousy inflation hedge, said William J. Bernstein, an investor and author.",
    "For one, people have quit their jobs to go all in on Bitcoin and other cryptocurrencies.",
    "Even at lower prices, Bitcoin’s fees can be higher than what Visa or Mastercard charge.",
    "A few other senators, like Patrick J. Toomey and now Ted Cruz, have also bought crypto.",
    "Even if you look past the conmen and hackers, crypto faces large regulatory challenges.",
    "“It’s been as high as $60 in times of crazy demand,” said Schoar, the MIT professor.",
    "It’s not the one you want to spend, it’s not the one you want to throw off income.",
    "“When you look at what Wyoming has done, it’s not a deregulatory state,” she said.",
    "Others resemble commodities overseen by the Commodity Futures Trading Commission.",
    "On the day she spoke to CQ Roll Call last month, those were worth about $128,000.",
    "Those fees will only go up after the 21 millionth bitcoin is mined, Schoar said.",
    "“I think it makes sense as part of a diversified asset allocation,” she said.",
    "Lummis isn’t the only politician who has embraced the much-hyped technology.",
    "She bought one in 2013, and another two in 2014, for around $1,000 in total.",
    "They’ve also made plenty of extreme predictions about its future value.",
    "It is inflating, it doesn’t buy as much as it used to,” she responded.",
    "“They can’t articulate any cogent reasons why it’s a store of value.",
    "“I say spend dollars and save Bitcoin, because the dollar is stable.",
    "The U.S. dollar is the cleanest shirt in the dirty laundry.",
    "Instead, Schoar said Bitcoin’s value is purely speculative.",
    "But using crypto, and Bitcoin in particular, isn’t free.",
    "Bitcoin users pay miners to process their transactions.",
    "And he was “extremely right about Bitcoin,” she said.",
    "They have a 700-page manual on digital assets.",
    "It wasn’t his arguments that won Lummis over.",
    "“Now we get that in the Senate,” Bond said.",
    "Still, the industry praised her hustle.",
    "It was how her daughter looked at him.",
    "“I was skeptical,” said Lummis, R-Wyo.",
    "“They created an actual framework.",
    "“It’s a classic bubble,” she said.",
    "“I see them as a long-term asset.",
    "“What is the risk with Bitcoin?",
    "Bernstein echoed that concern.",
    "We’re $30 trillion in debt.",
    "“It is the store of value.",
    "“Exactly,” she said."
  ]
}