{
  "id": 1924,
  "mediaId": 2746,
  "date": "2022-02-10",
  "headline": "Pandemic outcome will define Dr. Fauci’s legacy; shifts in advice divide Americans on partisan lines",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/02/virus_outbreak_us_12629_c0-0-4872-2842_s1200x700.jpg?ff7407e731c00f1ec87d443f81612d4fb939e74e",
  "link": "https://www.washingtontimes.com/news/2022/feb/10/dr-anthony-fauci-legacy-to-be-determined-by-pandem/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Howell Jr.",
  "authorUrl": "https://www.washingtontimes.com/staff/tom-howell-jr/",
  "termIds": [
    5878,
    2765,
    3217,
    867,
    160,
    6678
  ],
  "sentences": [
    "Dr. Fauci said federal grantee work at the lab couldn’t have been linked to the coronavirus and that Mr. Paul was stirring up “crazies out there.”\n“I ask myself, ‘Why would the senator want to do this?’ Go to Rand Paul’s website and you see, ‘Fire Dr. Fauci’ with a little box that says ‘contribute here.’ You can do $5, $10, $20, $100,” Dr. Fauci said at a Jan. 11 hearing of the Senate Health Education, Labor and Pensions Committee.",
    "He said the “attacks on me, quite frankly, are attacks on science.”\nDr. Parekh, at the bipartisan think tank, said, “We would have all liked instructions to wear masks” at that early juncture in the pandemic, but the science changes and, even today, scientists are asking Americans to ditch cloth masks and upgrade to KN95- or N95-grade masks to protect against fast-moving variants.",
    "“I think COVID has become so politicized,” Dr. Frieden said, “that it’s almost inevitable that anyone who speaks about it will be politicized.”\nDr. Fauci, long known in Washington circles, became a household name as a prominent member of President Trump’s COVID-19 task force and shared the stage that day in early February as the virus emerged on the West Coast.",
    "“Unfortunately, because I think he’s dedicated his adult life to public service and he did do some spectacular things, he’s going to be remembered as failing to mitigate a lot of the negative impact of COVID in the United States.”\nDr. Fauci’s supporters say the U.S. population at large needs to take responsibility for reducing the misery wrought by COVID-19.",
    "And, I guess, if there’s anything that I would hope would be different in 2022 — and maybe it can’t be — it’s that we’re able to reach the unvaccinated more effectively because that’s what’s going to drive death rates down.”\nDr. Fauci has made it clear that he plans to see through the COVID-19 fight instead of retiring anytime soon.",
    "Yes, he suffered some nicks and bruises during his tenure through the pandemic, but no one else was as clear, committed and staunch about conveying what he saw as the facts to legislators and the American people.”\nRepublicans say Americans’ troubling track record in dealing with the pandemic will stick to Dr. Fauci.",
    "Wearing a mask, socially isolating, getting vaccinated — it’s all about influencing individual behavior.”\nDefenders say Dr. Fauci was put in a tough spot as he became the chief explainer and bearer of bad news in a pandemic, and he was sucked into the political vortex of the 2020 elections.",
    "It might be hard to win back their trust as he closes out a nearly 40-year career in which he advised seven presidents, received a Medal of Freedom from President George W. Bush for his work on HIV/AIDS treatment and helped President Obama navigate the Ebola and Zika crises.",
    "Last month, top House Republicans released emails that they said showed Dr. Fauci was aware that U.S. research money was going to EcoHealth Alliance, which was funding the Wuhan Virology Institute in China, and was warned that the virus may have leaked from the institute.",
    "Mr. Trump frequently chided the doctor over the flip-flop, but Dr. Fauci later said the rate of asymptomatic spread of the virus wasn’t clear in February 2020 and the country was trying to maintain supply for medical professionals who were treating patients with COVID-19.",
    "And, you know, when you do that, it actually hurts one’s credibility as a scientist,” said Mr. Mango, whose forthcoming book, “Warp Speed: Inside the Operation That Beat COVID, the Critics and the Odds,” also delves into missteps by the Trump administration.",
    "“I think they’re going to say that Dr. Tony Fauci was one of the instrumental figures in that period of history to get us through the biggest public health challenge in 100 years,” said Dr. Anand Parekh, chief medical adviser at the Bipartisan Policy Center.",
    "Today, Dr. Anthony Fauci’s face is on Halloween masks and billboards, his name has become synonymous with the COVID-19 pandemic, and anyone who doesn’t recognize him must have taken social distancing so seriously that they have shut off society completely.",
    "“There’s plenty of work for him to do back in the National Institute for Allergy and Infectious Diseases.”\nMore than 6 in 10 Americans who consumed a “very conservative” media diet were not confident that Dr. Fauci was providing trustworthy information.",
    "A world-leading 400,000 people in the U.S. died from COVID-19 during the Trump administration, largely before the vaccination campaign, but even more Americans died during Mr. Biden’s first year, increasing the national toll to roughly 840,000.",
    "“It is imperative we investigate if this information was conveyed to the rest of the government and whether this information would have changed the U.S. response to the pandemic,” wrote Reps. James Comer of Kentucky and Jim Jordan of Ohio.",
    "And when that happens, whether it’s your fault or not, you should recognize that,” said Paul Mango, a key liaison between the Department of Health and Human Services and the White House’s Operation Warp Speed in the Trump administration.",
    "For one thing, his lab played a key role in the rapid development of a COVID-19 vaccine, swiftly shifting a partnership between the National Institutes of Health and drugmaker Moderna away from other diseases and toward the new pandemic.",
    "Whatever the perspective, the 81-year-old immunologist from Brooklyn, New York, remains a constant media presence in the third year of a COVID-19 fight that will define his public career, which began in the Reagan administration.",
    "It is policymakers and elected officials who have to weigh and balance different options in the context of liberties and individuals’ rights,” said Amesh Adalja, a senior scholar at the Johns Hopkins Center for Health Security.",
    "Just shy of half (49%) were not confident in the doctor if they relied on media labeled “conservative,” including Fox News, according to a mid-2021 study by the Annenberg Public Policy Center at the University of Pennsylvania.",
    "“What’s been so striking about COVID is Tony was never a partisan figure,” said Dr. Tom Frieden, a former director of the Centers for Disease Control and Prevention who fought the Ebola and Zika viruses with Dr. Fauci.",
    "“As a scientist, as a health official, when those data change, it’s essential that you change your opinion because you’ve got to be guided by the science and the current data,” He told NBC’s “Meet the Press” in June.",
    "“History will judge him kindly for his fierce advocacy of science during the Trump era,” said Arthur Caplan, director of the division of medical ethics at the New York University Grossman School of Medicine.",
    "As a mysterious new virus from China started to rip through the U.S. in February 2020, a doctor with neatly parted gray hair and glasses stepped to the White House podium and was promptly interrupted.",
    "You think about the number of lives that were saved, and he has really been a part of that from the beginning.”\nYet it’s clear that Dr. Fauci has lost his luster with a huge portion of the country.",
    "Dr. Fauci was almost untouchable at the start of the pandemic, but his aura of credibility has slipped as the pandemic drags on and conservatives’ concerns seep deeper into the public discourse.",
    "The senator said Dr. Fauci needs to be more forthcoming about federal grants that were awarded to a team working with virologists in Wuhan, where the virus was discovered in late 2019.",
    "But if Tony is the guy who from early on was the chief spokesperson and scientific adviser to the president, someone has to look and say, ‘Guess what, it didn’t work,’” Mr. Mango said.",
    "In the 1980s, he was a frequent target of Larry Kramer, a prominent AIDS activist who accused him of being too inexperienced and refusing to hear the cries of HIV-infected patients.",
    "But I think he’s an inappropriate spokesperson at this point in the pandemic for a number of reasons, not least of which is he’s lost the trust of at least half the country, right?",
    "He said the work clearly meets the definition of “gain of function” research that could make pathogens more dangerous and might have led to a leak of the unusual coronavirus.",
    "The senior Republicans on the House Oversight and Reform Committee and House Judiciary Committee said Dr. Fauci must give a transcribed interview to Congress on the matter.",
    "Legislation introduced by Rep. Warren Davidson, Ohio Republican, would set 12-year term limits for directors of the National Institute of Allergy and Infectious Diseases.",
    "At some level, you could say we [in the Trump administration] made a trade-off and that there were other areas of livelihood that we maintained and it cost us some lives.",
    "“If you look at everything I’ve said on TV, it is to validate, encourage and get people to abide by the recommendations of the Centers for Disease Control and Prevention.",
    "The study found that 7 in 10 people who relied on social media sources and more than 80% who looked to mainstream sources were somewhat or very confident in Dr. Fauci.",
    "“What we really should have had on the team was a behavioral scientist who understands how to communicate to the American people in a way that alters their behavior.",
    "Overcoming opposition to his performance during the COVID-19 pandemic likely will be tougher, especially if he is judged by raw results in two administrations.",
    "The National Institute of Allergy and Infectious Diseases declined The Washington Times’ request for comment or an interview with the doctor for this article.",
    "Dr. Fauci also was criticized after he acknowledged that he gradually and deliberately increased the vaccination goal based on what the public might bear.",
    "The senator also cited emails that seemed to suggest Dr. Fauci pushed for media stories rebutting doctors who raised alarm about a suspected lab leak.",
    "“If you look at it objectively, fatalities per capita, hospitalizations per capita, cases per capita, the U.S. is not a shining light in this.",
    "So the fact that he has become kind of a partisan lightning rod, to me, reflects not that Tony has changed but that the U.S. has changed.",
    "He fell out of favor with the president, who accused him of offering shifting counsel or being too swift to advise societal restrictions.",
    "A majority of voters in an October Hill-HarrisX poll said it is time for him to resign, reversing numbers from just a few months earlier.",
    "In liberal enclaves, Dr. Fauci is hailed as a hero who has saved thousands of lives amid the indifference of the Trump administration.",
    "On the outs with Trump allies, Dr. Fauci has found more welcoming terrain under President Biden, the seventh president he has advised.",
    "They say it’s not his fault that the country has devolved into a level of partisanship in which scientific facts seem up for debate.",
    "I think he did everything in his power to try to improve the response in the prior administration and in the current administration.",
    "Former Trump trade adviser Peter Navarro told “The Jason Rantz Show” last year that he twice told Mr. Trump to fire Dr. Fauci.",
    "“Every day you appear on TV, you do more damage than good when it comes to educating the American public on COVID,” he said.",
    "Dr. Fauci and other health officials advised against the need for face coverings in public before reversing their position.",
    "Among conservatives, he is a power-hungry manipulator who has misled the country about aspects of the coronavirus fight.",
    "Look at everything I’ve ever said.”\nThe senator replied by telling Dr. Fauci, “You’re hurting the team right now.”",
    "They became friends as Dr. Fauci won over more of the AIDS-afflicted community through his research on treatment.",
    "I think the biggest challenge is getting more people vaccinated,” said Dr. Frieden, the former CDC director.",
    "“There’s no silver bullet [for the pandemic], but if there is a silver bullet, vaccines are closest to it.",
    "He’s had pretty good relations with both Democratic and Republican presidents, senators and congressmen.",
    "Sen. Roger Marshall, Kansas Republican, told Dr. Fauci: “Frankly, honestly, you’ve lost your reputation.",
    "That means he will add a few more chapters to his legacy — and have a shot at winning back trust.",
    "He said he personally feuded with Dr. Fauci from the beginning of the pandemic over travel bans.",
    "I’m the director of the National Institute of Allergy and Infectious Diseases at NIH,” he said.",
    "If you think about this entire pandemic, it’s only been a challenge of behavior modification.",
    "“He showed himself to be a pro’s pro in providing science advice to a hostile administration.",
    "He has become Mr. Biden’s chief medical adviser, adding to his government responsibilities.",
    "This is the third in a six-part series on “two years and counting” for the coronavirus.",
    "His rounds of questioning the doctor on Capitol Hill have turned into viral viewing.",
    "They call Dr. Fauci a steady and comforting voice in a once-in-a-century crisis.",
    "Health experts say Dr. Fauci’s reputation as a dedicated scientist will endure.",
    "He said Dr. Fauci’s legacy will be a weakening of public trust in the position.",
    "“I think he positioned himself almost as a political figure, unfortunately.",
    "Demonizing him did not work despite his ideological critics’ best efforts.",
    "Sen. Rand Paul, Kentucky Republican, remains the doctor’s harshest critic.",
    "“I believe that’s a real distortion of the reality,” Dr. Fauci said.",
    "Some Republicans say those sorts of manipulations demand punishment.",
    "The American people don’t trust the words coming out of your mouth.",
    "“He was tasked with stopping the destruction caused by the virus.",
    "The situation has become more challenging since that survey.",
    "A reporter in the briefing room wanted to know his name.",
    "“I don’t think [Dr. Fauci] has responsibility for that.",
    "“My top line on Tony is, I do believe he’s a good man.",
    "Sometimes you get it right, and sometimes you don’t.",
    "I don’t even know what his party registration is.",
    "Hindsight is always 20/20,” Dr. Parekh said.",
    "Dr. Fauci isn’t a stranger to controversy.",
    "“The vaccines are remarkably effective.",
    "I believe he’s an excellent scientist.",
    "Former colleagues dismiss the attacks.",
    "“You’ve got to move with the science.",
    "“I’ve never talked politics with him.",
    "Click HERE to read the series.",
    "“My name is Dr. Tony Fauci."
  ]
}