{
  "id": 2160,
  "mediaId": 8496,
  "date": "2022-02-08",
  "headline": "Rise in Holocaust comparisons a dangerous and disturbing trend, experts say",
  "image": "https://media.wkyc.com/assets/WKYC/images/aa7a258a-ffe9-456a-b6fa-425d611fff58/aa7a258a-ffe9-456a-b6fa-425d611fff58_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/history/rise-in-holocaust-comparisons-dangerous-disturbing-trend/95-90d31bde-c80d-4663-8ead-f923d41a0cbd",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"We have to be very careful at a time when antisemitism is reaching a high-water mark, that we remember our history, and that we certainly don't downplay it or undermine it because all of that contributes to a rise of [extremism and] what we're seeing.\"",
    "\"To diminish [Holocaust victims and survivors'] memories and their legacies by comparing it to health protocols that are put in place to keep our communities safer is just not legitimate and needs to stop,\" Pasch told us.",
    "In that interview, Betty Gold — then a docent with the Maltz Museum of Jewish Heritage in Beachwood — told Kyle about her time hiding from the Nazis in Poland in a false wall with her family and neighbors.",
    "\"I've been here since 1949, and some of the stuff is happening all over again, the antisemitism, the bigotry,\" he lamented before paraphrasing the writer and philosopher George Santayana.",
    "People like Jenna Ryan, now in jail for her part in the Jan. 6 attack on the U.S. Capitol, who invoked a Holocaust analogy in an interview that same month with Kate Snow of NBC News.",
    "\"The family who had a little girl — a baby about a year and a half, I think — suddenly started to cry,\" Gold, who passed away in 2014, recalled during that conversation.",
    "These are gut-wrenching, first-hand accounts from people who actually lived through it, but now there's a trend of people who claim to know what the Holocaust is like.",
    "\"And from our elected officials who have a responsibility to lead with their words and their actions, those elected officials need to do better.\"",
    "\"If we want to have policy debates on CDC guidance, on masking, on what constitutes being fully vaccinated, we could have those policy debates.\"",
    "\"There is no comparison between that and needing to get a vaccine to eat at a fancy restaurant or attend a sporting event,\" Pasch added.",
    "Tragically, Gold's memory is a story Frayman knows well: His own infant brother, Chaim, also perished while the family was in hiding.",
    "\"When we distort what occurred with the Holocaust ... we are erasing the the history of the Jewish people, our history,\" Pasch said.",
    "It may feel like distant history to many, but there are those among us — like Roman Frayman in Beachwood — who remember it vividly.",
    "\"There's just no comparison between the Holocaust [and] wearing a mask and wearing a Jewish star when you're 6 years old,\" he said.",
    "Then there are lawmakers like Ohio state Rep. Warren Davidson, who tweeted that vaccine mandates are like those of Nazi Germany.",
    "Frayman puts it simply:\n\"I can't believe that I would survive the Holocaust and I would come to the land of the free,\" he said.",
    "\"I was 3 years old living in Sosnowiec, [Poland]; that's where all the Jews then were rounded up and we were taken to a ghetto.",
    "Living through the horror is unimaginable — when even just hearing the devastating stories can stick with you for years.",
    "Those were scapegoats, and I believe that people who are Caucasian are being turned into evil in front of the media.\"",
    "Both Pasch and Frayman told us these incidents put into sharp perspective the need for better Holocaust education.",
    "To learn more about the efforts of the Anti-Defamation League in combatting antisemitism and hate, visit adl.org.",
    "\"She was screaming her head off, and suddenly the mother made the horrific decision: She suffocated her baby.\"",
    "James Pasch, regional director of the Cleveland Anti-Defamation League, says this is a disturbing trend.",
    "BEACHWOOD, Ohio — Eighty years ago, more than 6 million Jews were killed in Europe by the Nazi regime.",
    "It was called Shrodula,\" Frayman recalled in a recent interview with 3News anchor Maureen Kyle.",
    "Well, when there's something that's traumatic and when you're a child, you just never forget.\"",
    "And when it comes to people claiming they are being treated like the Jews in Nazi Germany?",
    "\"It was some form of identity, but [these protocols have] nothing to do with identity.",
    "Kyle hasn't forgotten an interview she did with another local survivor back in 2013.",
    "\"[My treatment] is the epitome of a scapegoat,\" Ryan said at the time.",
    "\"'If you don't remember the past, you are doomed to re-live it.'\"",
    "After backlash, Davidson issued a statement apologizing.",
    "\"People say, 'Well, how do you remember this stuff?'",
    "Survivors like Frayman feel the need to speak out.",
    "\"Just like they did that to the Jews in Germany.",
    "Her memories of survival are haunting.",
    "This has to do with health.\""
  ]
}