{
  "id": 3447,
  "mediaId": 2644,
  "date": "2022-02-02",
  "headline": "GOP lawmakers demand DOJ to address increase in police violence",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/gop-police-violence-index.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/02/gop-lawmakers-demand-doj-to-address-increase-in-police-violence/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The above data is contextualized by a nationwide crisis of surging violence against law enforcement officers and the public they serve.”\nThe members — which sit on the House Committee on Homeland Security or serve on the American Security Task Force — demanded answers on how the DOJ plans to respond to the increasing rates of violence toward law enforcement, what steps are being taken to ensure those responsible for violent attacks on officers are being held accountable and what programs exist or are being out in place to support “support the safety and wellbeing of law enforcement officers at the federal, state, and local levels.”\nThe group also inquired what funding mechanisms the department has are available to support law enforcement organizations, whether there is any “rend analysis is done by the DOJ to understand safety and security challenges facing law enforcement,” what data collection and trend analysis the DOJ conduct on policies on the state and local level that may “contribute to increased violence against law enforcement,” what mental health resources the DOJ facilitates for The lawmakers called for answers by February 15.",
    "Houston has since been rocked, yet again, by the shooting of three additional officers who were injured responding to a disturbance call.”\nThe group noted that the National Fraternal Order of Police documented a 115 percent increase in instances of violence against officers in 2021 than the prior year, marking the highest number of law enforcement “intentionally killed since the terror attacks of September 11, 2001.”\n“Sadly, this violence is part of an upward national trend.",
    "In a letter sent to Attorney General Merrick Garland on Wednesday, the group noted the “troubling pattern across the United States” of officers being targeted, pointing to the recent deaths of law enforcement officials in New York and Houston, Texas, arguing more needs to be done to prevent instances of violence.",
    "“On Friday, January 21st, while responding to reports of a domestic disturbance, New York Police Department (NYPD) Officers Rivera (22) and Mora (27) were violently attacked by a gunman, killing Officer Rivera and mortally wounding Officer Mora, who succumbed to his injuries on January 25,” the wrote.",
    "A group of GOP lawmakers led by Rep. John Katko (R-NY), the top Republican on the House Homeland Security Committee, is calling for the Department of Justice to provide answers on how it plans to address the uptick in violence against law enforcement officials.",
    "), Dan Bishop (N.C.), Ralph Norman (S.C.), Mariannette Miller-Meeks (Iowa), Andrew Clyde (Ga.), Carlos Gimenez (Fla.), Peter Meijer (Mich.), August Pfluger (Texas), Kat Cammack (Fla.), Andrew Garbarino (NY), Greg Steube (Fla.), Tony Gonzales (Texas), John.",
    "“As the Attorney General, it is incumbent upon you to leverage the resources of the Department of Justice (DOJ) to help promote and protect the safety and wellbeing of your federal, state, and local law enforcement partners across the United States.",
    "Data compiled by the Federal Bureau of Investigation (FBI) also showed a 48.7% increase in 2021 of officer killings, totaling 73 deaths from ‘firearms, vehicles, knives, and other personal weapons,’” they continued.",
    "“Shortly following the attack on these NYPD officers, on Sunday, January 23rd, Harris County Texas Deputy Charles Galloway (47) was ‘brutally murdered’ during a traffic stop.",
    "According to the National Fraternal Order of Police, in 2021 there were 346 officers shot in the line of duty, including 63 deaths.",
    "Rutherford (Fla.), Nicole Malliotakis (NY), Warren Davidson (Ohio) and Brian Babin (Texas) also signed onto the letter.",
    "Of these, 103 were ‘ambush-style attacks,’ which increased 115% over the prior year.",
    "In addition to Katko, Reps. Michael Guest (Miss.",
    "), Michael McCaul (Texas), Clay Higgins (La."
  ]
}