{
  "id": 3862,
  "mediaId": 2512,
  "date": "2022-01-27",
  "headline": "This 90-Year-Old Holocaust survivor is fed up with unhinged anti-vaxxers and their Nazi/vaccine comparisons",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29178231&width=1200&coordinates=0%2C0%2C0%2C104&height=600",
  "link": "https://www.alternet.org/2022/01/anti-vaxxers-2656491052/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    5523,
    2240,
    2957,
    3869,
    3587,
    6427
  ],
  "sentences": [
    "Zoltak’s family, Stern notes, “avoided that fate” by “going on the run” and “hiding wherever they could.”\nFox host Lara Logan says that people tell her that Dr. Fauci doesn't represent science, but represents Josef Mengele, the Nazi doctor known as the \"Angel of Death\" for performing medical experiments at Auschwitz: \"I am talking about people all across the world are saying this\"pic.twitter.com/fF2DAWfG7d\n— Oliver Darcy (@Oliver Darcy) 1638231600\nI know and understand that the common response to this is, WTF?",
    "And on the Democratic side, anti-vaxxer Robert F. Kennedy, Jr. (the son of Robert Kennedy and nephew of President John F. Kennedy) recently compared unvaccinated Americans to Anne Frank, saying that in Nazi Germany, at least Frank “could hide in the attic.”\nAt the antivaxx rally in DC, RFK Jr. says that in the future \"none of us can run and none of us can hide\" because of Bill Gates' satellites and also 5G, unlike... the Holocaust.\\n\\n\"Even in Hitler's Germany, you could hide in the attic like Anne Frank did.",
    "And it\\u2019s not just shocking, it\\u2019s sickening and unacceptable.https://twitter.com/oliverdarcy/status/1465475667231924228\\u00a0\\u2026\n— Sam Stein (@Sam Stein) 1638235219\nZoltak, discussing anti-vaxxers who make Nazi/Holocaust comparisons, told the Beast, “It takes an awful lot of what we would call chutzpah, because anybody who did not live through German occupation in Europe for any length of time would not know what the Holocaust was.",
    "\\n#HolocaustRemembranceDay\\n#ItStartedWithWordspic.twitter.com/2j2h8hS6G8\n— Claims Conference (@Claims Conference) 1617852600\nLogan is not the only far-right anti-vaxxer who has made ludicrous and anti-Semitic comments about the Holocaust; everyone from Rep. Marjorie Taylor Greene of Georgia to Rep. Warren Davidson of Ohio has done it as well.",
    "Throughout the COVID-19 pandemic, many far-right anti-vaxxers have not been shy about comparing vaccine and testing mandates, face mask requirements and social distancing guidelines to the activities of Adolf Hitler’s Nazi regime of the 1930s and early 1940s.",
    "Zoltak, according to the Daily Beast’s Marlow Stern, was only ten when Nazis invaded Siemiatycze, Poland, his home town, and sent many of its Jewish residents to the infamous Treblinka death camp — where at least 900,000 Jews were slaughtered.",
    "And someone who witnessed the Holocaust first hand and lived to talk about it, 90-year-old Polish Jew and author Sidney Zoltak, is fed up the outrageous and downright idiotic things that anti-vaxxers have been saying about the Holocaust.",
    "There’s nothing that I can compare it to, and I’m certainly not going to compare it to going through the COVID-19 pandemic.”\nZoltak continued, “My aim was to live another day, and I did anything I could in order to live.",
    "Describing his family’s struggle to survive the Holocaust back in Poland, Zoltak told the Beast, “We would go out at night to get fresh air, occasionally — and often, in the bunker, we could not breathe any air.",
    "\"pic.twitter.com/bRtmDBTxZl\n— Ben Collins (@Ben Collins) 1642967180\nZoltak, who now lives in Montreal, Canada, has been publicly lecturing about the horrors of the Holocaust during his travels.",
    "And among the survivors, none of them were my classmates or friends.”\nAnti-vaxxers, Zoltak added, “use the Holocaust because of hate.",
    "They want to say something negative about the Jews, and they use the Holocaust.”\n\\u201cDon\\u2019t Buy from Jews!\"",
    "But we keep seeing the Holocaust held up as some sort of analogy to efforts to contain a deadly global pandemic.",
    "Please watch #Holocaust survivor Sidney Zoltak recall what he witnessed outside of his grandparents' store.",
    "\\nBefore Jewish families were forced to leave their homes, the flames of hate were being stoked.",
    "Fox News’ Lara Logan even compared Dr. Anthony Fauci to Dr. Joseph Mengele.",
    "She would say, ‘Surviving is the most important thing for us.",
    "Among my community of 7000 Jews, less than 70 survived.",
    "My mother was the driving force.",
    "We have to survive.’”",
    "She gave us courage.",
    "I feel it too."
  ]
}