{
  "id": 3925,
  "mediaId": 2629,
  "date": "2022-01-24",
  "headline": "Why Can't Republican Politicians Control Their Anti-Semitic Tic?",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNTg3MzY0OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2NTM5ODAyOH0.5MtnDHDDtfad4W0J4vgoCpO3F8HTl42tlbt9l2X7n4k/img.jpg?width=1200&coordinates=0%2C934%2C0%2C935&height=600",
  "link": "https://www.nationalmemo.com/anti-semitism",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    5078,
    4597,
    4016,
    2944,
    2723,
    3008,
    2173,
    894
  ],
  "sentences": [
    "Last June, Georgia Rep. Marjorie Taylor Greene — who has a long history of anti-Semitic, Islamophobic, and racist comments — apologized after saying that requiring proof of vaccination before entering the House chamber without a mask was akin to \"a time in history where people were told to wear a gold star, and they were definitely treated like second class citizens, so much so that they were put in trains and taken to gas chambers in Nazi Germany.\"",
    "The same day, prominent GOP political consultant Dave Carney, who is currently the general strategist for New Hampshire Senate hopeful Chuck Morse, attacked the United Nations for passing a resolution condemning Holocaust denial on the 80th anniversary of the Wannsee Conference at which Nazi officials set in motion their \"final solution\" that led to Third Reich's slaughter of millions of Jews during World War II.",
    "Alabama Rep. Mo Brooks read parts of Hitler's book Mein Kampf aloud on the House floor in 2019 as he attacked media and Democrats over their charges of collusion between Trump's 2016 presidential campaign and Russia, which Brooks called the \"biggest political lie, con, scam, and fraud in American history.\"",
    "In recent weeks, Senate Republicans have been using procedural tactics to block confirmation of Deborah Lipstadt, an Emory University professor of modern Jewish history and Holocaust studies who is President Joe Biden's nominee to be special envoy to combat and monitor antisemitism.",
    "North Carolina Rep. Madison Cawthorn (R-NC) has complained in the past to the Jewish Insider that it is really difficult to convince Jews to stop being Jewish and bragged of visiting Adolf Hitler's vacation home, which he said had been on his \"bucket list\" of things to see.",
    "Back in December, former President Donald Trump, who himself has a lengthy history of using anti-Semitic tropes and rhetoric, made the anti-Semitic claim that Israel once \"had absolute power over Congress\" and lamented, \"And today I think it's the exact opposite.",
    "Rep. Lauren Boebert (R-CO) last week reportedly asked a group of Jewish people visiting the U.S. Capitol if they were there to do \"reconnaissance,\" the latest in a series of recent comments by prominent Republicans that mock or are offensive to Jews.",
    "Greg Abbott, Sen. Susan Collins (R-ME), former Energy Secretary Rick Perry, and former House Speaker Newt Gingrich, tweeted a story about the U.N. resolution with the comment, \"And again remind me how much money we pour down this rat hole each year?",
    "Last week, Ohio Rep. Warren Davidson apologized for comparing a Washington, D.C., vaccination requirement for restaurants and bars to a \"Gesundheitspass,\" which is translated as \"health pass\" but was associated with Nazi \"racial hygiene\" theory.",
    "A month later she was back at it, saying in response to an administration plan to provide information on vaccines that the American people \"don't need your medical brown shirts showing up at their door.\"",
    "According to BuzzFeed News, the first-term lawmaker and QAnon conspiracy theorist later said the comment was a \"joke\" and added, \"I'm too short to see anyone's yarmulkes.\"",
    "Sen. Jim Risch (R-ID) told CNN in December that some GOP senators were upset that Lipstadt had made critical comments on Twitter about Republican lawmakers.",
    "Morse, the current state Senate president, has not publicly condemned the tweet and did not immediately respond to an inquiry about Carney and his comment.",
    "Troy Price, executive director of the New Hampshire Democratic Party, responded, \"Seems like money well spent if it's helping to end anti-Semitism.",
    "Last March, Carney called flight attendants who enforce federal COVID-19 safety rules \"mask nazi[s].\"",
    "At least two GOP representatives have also made comments likening coronavirus rules to the Holocaust.",
    "It's pretty disgusting to see the @Morse4Senateteam spewing this crap.\"",
    "Reprinted with permission from American Independent\nanti-semitism",
    "And I think Obama and Biden did that.\"",
    "Carney, who has advised Texas Gov.",
    "Anyone?\""
  ]
}