{
  "id": 4139,
  "mediaId": 2540,
  "date": "2022-01-27",
  "headline": "Politicizing the Holocaust dehumanizes us all",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220126212919-holocaust-memorial-day-england-012622-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/27/opinions/holocaust-remembrance-day-politicization-wilf/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Wilf",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "This was followed by a host on Fox News going so far as to compare Dr. Anthony Fauci with Josef Mengele, the sadistic SS “physician” known as the “angel of death.” In 2019, New York Democratic Congresswoman Alexandria Ocasio-Cortez compared border facilities to “concentration camps,” and earlier this month, Ohio GOP Rep. Warren Davidson compared the Covid-19 vaccination policies in Washington, DC, to the Nazi regime on Twitter.",
    "Just last week, the United Nations adopted a resolution by consensus against Holocaust denial, while Egypt commemorated International Holocaust Remembrance Day for the very first time, in an event sponsored by Cairo’s US embassy and the United States Holocaust Memorial Museum.",
    "Seventy-seven years after the end of the Second World War, we have witnessed a disturbing surge in the politicization of Holocaust imagery that has distorted and warped its memory in disgraceful ways, often tied to debates about the Covid-19 pandemic or Israeli policy.",
    "Calling out inappropriate Holocaust comparisons is important, but it’s equally important and likely more effective when communal leaders reach out and conduct one-on-one conversations, explaining both the pain these comparisons cause and the danger they perpetuate.",
    "While other states and school districts may teach about the Holocaust without such laws in place, most states lack the standards and requirements to ensure that students across the board learn the important lessons about this terrible stain on human history.",
    "In May, a group calling itself “Goy Power” showed up at a pro-Israel rally in a van carrying the message “Hitler was Right.” In November, attendees wore yellow stars to a hearing of the Kansas state legislature to discuss Covid-19 policies in the workplace.",
    "The Reverend Canon Michael Smith, acting Dean of York, lights some of the 600 candles shaped as a Star of David on the floor of the Chapter House of York Minster as part of a commemoration for Holocaust Memorial Day on Wednesday in York, England.",
    "We work to ensure that the next generation learns about the atrocities of the Holocaust, to understand what conditions allowed it to take place and to cherish both the memories of those we lost and those who survived.",
    "Working with dozens of social service agencies across the continent and internationally, Federations also care for vulnerable Holocaust survivors, many of whom cannot afford food, dental care and other necessities.",
    "We owe it to the next generation of students as concerned citizens to proactively reach out to our state representatives and governors and urge them to support this key Holocaust education expansion legislation.",
    "I am proud that my organization, the Jewish Federations of North America, which represents more than 300 Jewish communities across the country, is at the forefront of fighting back against this racist bigotry.",
    "Use of such language today emboldens extremists and bigots who seek to weaken our societal bonds, a condition that is dangerous not only for Jewish people, but every minority group and, indeed, society itself.",
    "Yet as we mark this year’s International Holocaust Remembrance Day, I am terribly saddened by efforts to minimize the atrocities and manipulate the memory of the Holocaust for political gain here at home.",
    "The images and rhetoric are re-traumatizing for some survivors and they represent a clear example of what happens when we do not heed the lessons that survivors have painstakingly taught us.",
    "Beyond supporting survivors directly, one of the most important steps we can take to fight the rising tide of irresponsible, hurtful and hateful rhetoric is bolstering Holocaust education.",
    "Using outlandish, irresponsible words and images to inflame people and for political gain is horrible; it inflicts yet more pain on the survivors who have already suffered so much.",
    "The use of dehumanizing, antisemitic and racist language in Nazi Germany, that eventually spread across Europe, led to actions that saw the near extermination of the Jewish people.",
    "We already took a big step with the Never Again Education Act, which was signed into law in May 2020 and authorized $10 million over five years for Holocaust education nationwide.",
    "Holocaust survivors have worked to create a brighter future for all people; my parents instilled in me the values of resilience, hard work, philanthropy and love for Israel.",
    "We must insist that the survivors of the Holocaust, who are our heroes and our teachers, are treated responsibly, with the dignity and respect that they deserve.",
    "Together we must commit to preserve our humanity and make good on the promise we repeat every day, every week, every month and every year: “Never Again!”",
    "We must counteract statements that equate Covid-19 policies with the antisemitic Nazi regime that was determined to exterminate an entire people.",
    "These outrageous comparisons, which were made to score cheap political points, are irrational, irresponsible, callous and hurtful.",
    "Even in the US, more than one-third of Holocaust survivors live in poverty, according to The Blue Card, a nonprofit organization.",
    "CNN —\nAs a child of Holocaust survivors, nothing is more sacred and important to me than preserving the memory of this period.",
    "This year we will allocate more than $5 million to help them and other older adults whose lives have been impacted by trauma.",
    "Before long, there will be no more Holocaust survivors to provide first-hand testimony of the atrocities of the Third Reich.",
    "We must wholeheartedly reject imagery that depicts Jews or the Jewish state as genocidal and bent on world domination.",
    "The incidents are an affront to the memory of Holocaust victims and to all who espouse to support human rights.",
    "There’s also more that we can do when politicians and public figures step out of line with their rhetoric.",
    "Editor’s Note: Mark Wilf is Chair of the Board of Trustees of the Jewish Federations of North America.",
    "Only 22 states currently require schools provide age-appropriate Holocaust education to all students.",
    "It happened incrementally, with a numbing indifference that ballooned into a catastrophic event.",
    "It is a sign of our divided times, in which we too often fail to see the humanity in each other.",
    "They deserve swift condemnation from all our elected officials from both political parties.",
    "These sorts of comparisons to Nazi Germany are an egregious affront to Holocaust survivors.",
    "The international community has made great strides in educating the world about it.",
    "We must educate our children about the horrors of the Holocaust.",
    "That trend of dehumanization is worrying in and of itself.",
    "The views expressed in this commentary are his own.",
    "The Holocaust didn’t happen overnight.",
    "Read more opinion on CNN.",
    "But that’s only a start.",
    "The clock is ticking.",
    "He later apologized."
  ]
}