{
  "id": 4407,
  "mediaId": 2699,
  "date": "2022-01-27",
  "headline": "Holocaust Survivor Sidney Zoltak Has a Message for Anti-Vaxxers Exploiting His Trauma",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_312/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1643274782/sidney-zoltak-interior_2250_b9crmh",
  "link": "https://www.thedailybeast.com/sidney-zoltak-holocaust-survivor-has-a-message-for-anti-vaxxers-exploiting-his-trauma?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marlow Stern",
  "authorUrl": "https://www.thedailybeast.com/author/marlow-stern",
  "termIds": [
    0
  ],
  "sentences": [
    "When Nancy Pelosi required members of the House to wear masks on the chamber floor, Republican Rep. Marjorie Taylor Greene said it was akin to “a time in history where people were told to wear a gold star… put in trains and taken to gas chambers in Nazi Germany.” Upon learning that Washington, D.C., would be requiring proof of vaccination to patronize its businesses, Republican Rep. Warren Davidson tweeted an image of a Nazi document with the caption, “This has been done before.",
    "In honor of Holocaust Remembrance Day, Zoltak is one of many survivors taking part in #DONTBEABYSTANDER, a social media campaign spearheaded by the Claims Conference and Yad Vashem, the World Holocaust Remembrance Center, to commemorate the “Righteous Among the Nations”—or brave non-Jews who risked their lives to save Jews during the Holocaust, like the Krynski family who took in the Zoltaks.",
    "In 2013, he penned a memoir about his tragic ordeal, My Silent Pledge: A Journey of Struggle, Survival & Remembrance, and appeared in the documentary Righteous Reunion: A Survivor Reunites With His Rescuer, capturing the days in Poland he spent reuniting with Zigmund Krynski, the shepherd boy who helped rescue his family.",
    "In recent months, a number of Americans—mostly on the conservative right—have compared taking precautions against the spread of COVID-19 to the Holocaust, reappropriating everything from swastikas to the yellow Star of David as symbols of their so-called oppression.",
    "“We knew who the perpetrators were, and we talk about the ones who participated in the actual killing and genocide, but hardly ever do we speak about the other contributors to the enormity of the genocide that happened—six million Jews,” says Zoltak.",
    "We feel like family to each other.’ If two families, one Jewish and one Polish, can feel that way at this point, then a lot of others can do the same thing.”\n“To this day, I’m in contact with the grandson of [Zigmund],” he continues.",
    "If there wasn’t any hate, there would be no reason for the killing.”\nFor the last several decades, Zoltak has traveled the world lecturing students about the horrors of the Holocaust, and why it must never happen again.",
    "He’s also served as part of a number of organizations, including the Child Survivors-Hidden Children’s Federation, the Montreal Holocaust Centre, and the Jewish Holocaust Survivors of Canada.",
    "“It takes an awful lot of what we would call chutzpah, because anybody who did not live through German occupation in Europe for any length of time would not know what the Holocaust was.",
    "The town of Siemiatycze was finally liberated in 1944, but 13-year-old Sidney and his family returned to their home to find that they were no longer welcome by the townspeople.",
    "“They want to say something negative about the Jews, and they use the Holocaust.”\nZoltak, 90, was only 10 years old when the Nazis invaded his Polish hometown of Siemiatycze.",
    "“She did a kind gesture as a human being and the daughter did not forget the kindness of my mother, and reciprocated, taking us in and hiding us for 14 months.",
    "The Jews were rounded up, segregated in a ghetto, and eventually sent to Treblinka—an extermination camp responsible for the deaths of 900,000 Jews.",
    "Sidney says he was regularly harassed and beaten by the non-Jewish kids in the camps but would nevertheless work all day and take classes at night.",
    "One day, their family came across a barn belonging to a poor Polish Catholic family, where a young shepherd boy recognized Sidney’s mother, Henia.",
    "#DoNotComply.” And just last weekend, Robert F. Kennedy Jr., a notorious anti-vaxxer, likened COVID vaccine mandates to the plight of Anne Frank.",
    "But for them, it was enough.”\nThe Zoltaks spent the final seven months in an underground bunker attached to the barn, without seeing daylight.",
    "“He wanted his children to meet the children of the Polish-Catholic family, the Krynskis, and we went to Poland for two days and they met us.",
    "That was no small thing to do—to risk your lives in order to hide people that you didn’t even know just because you bought a coat from them.",
    "We have to survive.’”\nWe would go out at night to get fresh air, occasionally—and often, in the bunker, we could not breathe any air.",
    "Zoltak’s family avoided that fate by escaping the ghetto through barbed wire and going on the run, hiding wherever they could.",
    "“We would go out at night to get fresh air, occasionally—and often, in the bunker, we could not breathe any air,” he recalls.",
    "“There’s nothing that I can compare it to, and I’m certainly not going to compare it to going through the COVID-19 pandemic.",
    "There’s nothing that I can compare it to, and I’m certainly not going to compare it to going through the COVID-19 pandemic.",
    "My mother was kind to her, she thought, because she gave her a coat to take home that wasn’t fully paid for,” he explains.",
    "If the perpetrators did some killing, and the rest of the world didn’t do much to stop it, why would they want to stop?",
    "“My son Larry, in 2019, decided to continue the relationship with both families,” Zoltak explains.",
    "They spent the next four years in displaced-persons camps, where Sidney’s father died.",
    "And among the survivors, none of them were my classmates or friends,” he remembers.",
    "We carry no hate, no grudges, and feel a closeness to each other as human beings.",
    "And when we see each other we say, ‘We’re not just people who know each other.",
    "My aim was to live another day, and I did anything I could in order to live.",
    "He eventually settled in Montreal, where he married and had two sons.",
    "“The shepherd boy’s sister had bought a coat at my parents’ shop.",
    "All of this is infuriating to Holocaust survivor Sidney Zoltak.",
    "She would say, ‘Surviving is the most important thing for us.",
    "Among my community of 7,000 Jews, less than 70 survived.",
    "“They use the Holocaust because of hate,” Zoltak adds.",
    "“One of the main contributors was indifference.",
    "Therefore, I think it’s a beautiful ending.”",
    "Right now, we talk on the telephone.",
    "We talked together, had a reunion.",
    "“If I don’t call him, he calls me.",
    "We feel to each other like family.",
    "My mother was the driving force.",
    "We need to stop the hate.",
    "She gave us courage."
  ]
}