{
  "id": 4410,
  "mediaId": 2553,
  "date": "2022-01-27",
  "headline": "Texas’s Chip Roy Challenges Kevin McCarthy, Mitch McConnell To Defund Government Over ‘Tyrannical’ COVID-19 Vax Mandates",
  "image": "https://dw-wp-production.imgix.net/2022/01/Kevin-Mcarthy-Chip-Roy.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/texass-chip-roy-challenges-kevin-mccarthy-mitch-mcconnell-to-defund-government-over-tyrannical-covid-19-vax-mandates",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Meads",
  "authorUrl": "https://www.dailywire.com/author/tim-meads",
  "termIds": [
    4905,
    4066,
    4267,
    3788,
    3516,
    1477,
    1489
  ],
  "sentences": [
    "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nAs of press time, the following Republicans have signed onto Roy’s letter, according to a list obtained by The Daily Wire:\nSenators: Rand Paul (KY), Sen. Ron Johnson (WI)\nCongressmen: Scott Perry (PA), Warren Davidson (OH), Lauren Boebert (CO), Bob Good (VA), Dan Bishop (CA), Andy Biggs (TX), Jody Hice (GA), Marjorie Taylor Greene (GA), Jeff Duncan (SC), Mary E. Miller (IL), Louie Gohmert (TX), Alex X. Mooney (MD), Matt Rosendale (MT), Ralph Norman (SC), Bill Posey (FL), Clay Higgins (LA), Randy K. Weber (TX), Andrew Clyde (GA), and Paul A. Gosar, D.D.S.",
    "“This includes Washington, D.C., the American people’s capital city, over which the Constitution grants Congress the complete authority to “exercise exclusive Legislation in all Cases whatsoever.”\nEarlier this month, Democratic Mayor Muriel Bowser began enforcing a COVID-19 vaccine mandate that requires nearly every indoor business in the capital to ask for proof of the COVID-19 vaccine as well as photo ID before serving customers.",
    "“Currently, medical workers, men and women in uniform, federal employees, and federal contractors face termination if they do not receive a COVID-19 vaccine – even though evidence shows these vaccines do not prevent the spread of the virus,” Roy said in a reference to the Clients of Medicare and Medicaid Services mandate, which SCOTUS upheld as constitutional.",
    "The government is scheduled to run out of money in February 18, and Roy has put together a letter that he plans to send to Minority Leader Kevin McCarthy (R-CA) — signed by more than a dozen of his colleagues — demanding that Republicans do not fund a government that will be turned on its citizens in the name of COVID-19 safety.",
    "Resigned membership from Capitol Hill Club today because I refuse to show a “vax card.” #PledgeNoVaxCard\n— Chip Roy (@chiproytx) January 19, 2022\nThere are numerous legal challenges to mandates around the country, but as Roy asserted, conservatives are largely relying on the court system to strike down these rules.",
    "We’re going to find out.”\n“After February 18, 2022, government funding will expire and congressional Republicans must once again decide whether they will vote to fund a federal government that is enforcing tyrannical COVID-19 vaccine mandates on the American people,” Roy’s letter states.",
    "In a statement provided to The Daily Wire, Roy pondered, “Most Republicans say that vax mandates are tyrannical and foolish, but will they unite before government funding expires on February 18th to pledge not to fund enforcement of these mandates?",
    "Congressman Chip Roy (R-TX) wants his colleagues to put their money where their mouths are and refuse to fund the United States government until President Joe Biden ends his “tyrannical” pursuit of vaccine mandates.",
    "“Congressional Republicans cannot continue to abdicate their Article I duties in hopes the judicial branch will rule in favor of the American people,” the letter concludes.",
    "“The Biden administration has unilaterally imposed five separate COVID-19 vaccine mandates, four of which continue to directly impact millions of Americans,” he added.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "(AZ), Russ Fulcher (ID), Thomas Massie (KY), Barry Moore (AL), Brian Mast (FL), Troy E. Nehls (TX), Michael Cloud (TX), David Schweikert (AZ).",
    "One of those mandates included the private-sector employer mandate, which was opposed successfully all the way to the Supreme Court.",
    "“Moreover, myriad municipalities and states that directly benefit from federal funding have imposed similar mandates,” he added.",
    "Last week, OSHA announced they would be dropping the rule which would enforce the mandate but would be pursuing other options.",
    "Will at least 10 of the 19 GOP Senators who voted to punt last time now stand up for healthcare workers or not?",
    "That establishment announced they would comply, and Roy announce he was dropping his membership in response.",
    "One of those businesses is the popular GOP social club — The Capitol Hill Club.",
    "Get inside access to The Daily Wire by becoming a member."
  ]
}