{
  "id": 4582,
  "mediaId": 8339,
  "date": "2022-01-13",
  "headline": "Auschwitz Memorial Says Congressman Who Compared COVID Vax Cards to Nazi Passbooks Is Exploiting the Holocaust",
  "image": "https://www.insideedition.com/sites/default/files/styles/video_1920x1080/public/images/2022-01/ohio.jpg?h=c673cd1c&width=1280&height=720",
  "link": "https://www.insideedition.com/auschwitz-memorial-says-congressman-who-compared-covid-vax-cards-to-nazi-passbooks-is-exploiting",
  "mediaOutlet": "Inside Edition",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1849,
    3008,
    4084,
    122,
    6427,
    6060
  ],
  "sentences": [
    "Davidson then doubled down on his message in a tweet that read: \"Let's recall that the Nazis dehumanized Jewish people before segregating them, segregated them before imprisoning them, imprisoned them before enslaving them, and enslaved them before massacring them.”\n\"Dehumanizing and segregation are underway - and wrong,” he added.",
    "\"Exploiting of the tragedy of all people who between 1933-45 suffered, were humiliated, tortured & murdered by the totalitarian regime of Nazi Germany in a debate about vaccines & COVID limitation in the time of global pandemic is a sad symptom of moral and intellectual decay,” the Auschwitz Memorial said in a statement.",
    "Cincinnati-area Republican Congressman Warren Davidson retweeted a message from Washington, D.C. Mayor Muriel Bowser who tweeted a message about bringing proof of vaccination card and a mask when leaving your home to enter a store or restaurant.",
    "The Nazi-era pass that Davidson used in his message was known as a “Gesundheitspass,” which was a health pass that Nazi officials required for citizens to carry with them and prove their identity, CBS News reported.",
    "Poland’s Auschwitz-Birkenau Memorial has slammed the recent comments made by an Ohio congressman who compared Covid vaccine cards to Nazi-era passes, CBS News reported.",
    "\"I told him that the use of such imagery wasn't just a repugnant and dangerous false equivalency, but deeply offensive and painful for Jewish people,\" Phillips said.",
    "Following his tweets, the Auschwitz Memorial condemned the tweets, saying they are \"exploiting\" the Holocaust, which resulted in the deaths of millions.",
    "Minnesota Democratic Rep. Dean Phillips, who is Jewish, told CNN's Jake Tapper Wednesday that he confronted Davidson about the tweet.",
    "Davidson posted his message in a quote tweet that read “This Has Been Done Before #DoNotComply” with a Nazi-era passbook.",
    "\"I said I'd debate mandates and tyranny whenever he wishes, but there's no debate on the offense of his post.",
    "Illinois Republican Rep. Adam Kinzinger also spoke to Tapper and said, \"This is the new politics.",
    "Do you have a personal story, or have information that might lead to a story on Inside Edition?",
    "The American Jewish Committee called on the politician to apologize and remove the tweets.",
    "Davidson has not responded to the flurry of backlash he has received.",
    "Email us: tips@insideedition.com or Call us: (212) 817-5555\nEmail Us",
    "\"Every Republican leader needs to be condemning that kind of B.S.",
    "It's about how can we out-outrage the other person.\"",
    "\"It's insane,\" Kinzinger added.",
    "It's not about leading anymore.",
    "He could have cared less.\"",
    "right now.\"",
    "Got a tip?"
  ]
}