{
  "id": 6646,
  "mediaId": 8285,
  "date": "2022-04-15",
  "headline": "The Chaos Theory Behind Ohio’s Redistricting Fiasco",
  "image": "https://cdn2.cincinnatimagazine.com/wp-content/uploads/sites/5/2022/04/Ohio_Congressional_Districts_crop.jpg",
  "link": "https://www.cincinnatimagazine.com/article/the-chaos-theory-behind-ohios-redistricting-fiasco/",
  "mediaOutlet": "cincinnatimagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim DeBrosse",
  "authorUrl": "https://www.cincinnatimagazine.com/author/jim-debrosse/",
  "termIds": [
    5761,
    5803,
    4730,
    2774,
    2131,
    6060,
    6077,
    6474
  ],
  "sentences": [
    "John Kasich tweeted a declaration of near-sainthood for party chieftains after the measure breezed through the General Assembly in 2014: “Ohio Republican Leaders deserve a ton of credit for breaking the cycle (of partisan districts) and potentially giving up power.” Even Matt Huffman, then a state rep involved in the bipartisan negotiations, was quoted in The Lima News at the time: “This system basically says we are going to have a system that you now have an incentive to take in account what the minority party wants.",
    "The League, in particular, has been pushing for more than two decades to reform Ohio’s redistricting machinery—it first proposed a constitutional amendment in 1999 after maps were heavily gerrymandered by Democrats following the 1970 and 1980 censuses and by Republicans in 1990.\nPepper believes the Republican fix was in from the very inception of the reform amendments in 2015 and 2018.",
    "If they failed, a simple majority of the commission would approve a four-year map, but with two safeguards against gerrymandering built into the law: No map “shall be drawn primarily to favor or disfavor a political party,” and the number of seats favoring each political party “shall correspond closely to the statewide preferences of the voters of Ohio” during the previous decade.",
    "For the last 10 years, gerrymandering in Ohio has guaranteed seats for a super majority of Republican legislators under pressure to please the more extreme party members who vote in primaries, rather than serve the broader interest of all Ohioans if they had to run in competitive general elections, says David Pepper, former head of the Ohio Democratic Party.",
    "After getting one more bum’s rush at the March 28 meeting, Democratic commission member Sen. Vernon Sykes lamented, “At some point (in this process), you just get tired of being mistreated.”\nThe Ohio Supreme Court has so far rejected as unconstitutional four sets of state legislative maps and one Congressional map, including its latest ruling on April 14.",
    "Recent examples include the 2018 resignation of House Speaker Cliff Rosenberger for accepting overseas vacations from payday lending lobbyists, the 2021 expulsion of House Speaker Larry Householder on racketeering charges, and the ongoing investigation into the $61-million FirstEnergy bribery scandal, the largest in the state’s history.",
    "But local residents who haven’t kept an eye on what’s been happening with the Ohio Redistricting Commission in Columbus are missing a “hell is real” battle of historic proportions—a political and legal donnybrook over drawing the state’s new legislative and congressional district maps that could leave its constitution in tatters.",
    "The costly upshot of all the foot-dragging is that Ohioans will have to go to the polls twice to vote in primaries this year: The traditional May 3 primary for U.S. Congressional and statewide offices like Governor, followed by a second special primary at a yet-undetermined date for state legislative and schoolboard races.",
    "“I just wrote to Maureen O’Connor to tell her what a great job she’s doing and that she should run for governor.” Heimlich accused his fellow Republicans of trying to “rape the system as it has been done for years.”\nThe Republican commissioners “failed on purpose,” Pepper says.",
    "While Democrats on the commission offered access to their mapmakers as well as early drafts of their maps, the Republicans have drawn all their maps without Democratic input and, according to court depositions, with their own mapmakers under the direction of Cupp and Huffman.",
    "While it’s true the National Democratic Redistricting Committee has filed its own lawsuit in Ohio, fair district advocates include members from both political parties as well as non-partisan voting rights groups like the League of Women Voters, Common Cause, and the ACLU.",
    "Meanwhile, the Republican statewide-elected officials on the commission (DeWine, LaRose, and Auditor Keith Faber) have engaged in some public handwringing over the partisan mess but have stayed in the background while Huffman and Cupp work their magic on the maps.",
    "All of those incentives in Ohio have been turned upside down.”\nThe result of a decade of slam-dunk wins for Ohio’s Republican legislators, Pepper says, has been a downgrading of Ohio’s education system and infrastructure and an upsurge in statehouse corruption.",
    "Levenson said the second map is “a considerable step in the right direction, but we think there should have been another 1.5 seats to make it more proportional.” She said fair district advocates will challenge the map’s use for elections after 2022.",
    "What makes the current redistricting brawl all the more surprising is that, just eight years ago, Ohio Republicans were lauding themselves for reaching a compromise with Democrats that promised an end to the jigsaw puzzle of gerrymandered districts.",
    "Called the Independent State Legislature Theory, the argument is based on a clause in Article I of the U.S. Constitution that says state legislatures are in charge of “the time, place and manner” of elections to determine representation in Congress.",
    "Three years ago, in Rucho vs. Common Cause, the U.S. Supreme Court established a “hands-off” ruling for federal courts in partisan gerrymandering cases, arguing that, under the U.S. Constitution, those issues must be resolved by states alone.",
    "It’s more likely that Republicans will do an end-run around O’Connor and the Ohio Supreme Court after GOP activists took their case in February to a panel of three federal judges, two of whom were appointed by former President Donald Trump.",
    "Meanwhile, to challenge any new map, anti-gerrymandering groups would have to file a whole new lawsuit that wouldn’t be decided until at least late summer or early fall, when it would bump up against the general election in early November.",
    "On a positive note for fair district advocates, the second congressional map approved by Republican commissioners would add another one-and-half potential Democratic districts to the mix, including Ohio’s 1st District seat held by Chabot.",
    "The tactic got its creepy-sounding name in 1812 when The Boston Gazette ran a political cartoon depicting “a new species of monster” (a Gerry-mander) from a dragon-shaped Massachusetts Congressional district approved under then-Gov.",
    "After crawling to the finish line, the Republicans have shown up at commission meetings with secretly-drawn partisan maps, then rammed them through for approval before the commission’s two Democratic members can even look them over.",
    "But since the commission began meeting in August 2021, the five Republicans on the seven-member commission have repeatedly missed the commission’s own legally prescribed deadlines as well as those imposed by the Ohio Supreme Court.",
    "The outcome will determine whether Ohio voters have a real say in deciding who represents them in the Statehouse and in Congress or whether they’ll continue to waste their votes in heavily-gerrymandered “safe” partisan districts.",
    "If applied strictly, that means the Ohio Supreme Court would have no authority to impose a remedy over the wishes of the GOP-controlled state legislature even though the Ohio constitutional reforms give the court the final say.",
    "But according to a recording obtained by Ohio Capital Journal, Secretary of State LaRose told an April 1 breakfast meeting of Union County Republicans that he “certainly wouldn’t oppose it” if legislators acted on their threat.",
    "Cincinnatians rarely pay attention to what happens 100 miles up I-71 in Columbus unless, of course, it involves a Buckeyes football game or a matchup between the cities’ professional soccer teams for the “Hell Is Real” trophy.",
    "A Wyoming resident and Procter & Gamble engineer, Wise shared his state legislative maps with Secretary of State Frank LaRose as a potential compromise before the first set of GOP-generated maps were introduced and adopted.",
    "This is an entire generation of (GOP legislators) in the statehouse who have never been in a real election, and they’re scared to death.”\nEven moderate Republicans are speaking out against the GOP members of the commission.",
    "A 4-3 majority of the Supreme Court, including Chief Justice Maureen O’Connor, a Republican, has argued each time that Republicans on the commission ignored the redistricting reforms overwhelmingly approved by Ohio voters.",
    "Fair district advocates had hopes of reforming Ohio’s maps for the 2022 elections after passage of anti-gerrymandering laws in 2015 and 2018 and creation of a bipartisan commission to draw more balanced district lines.",
    "Ohio’s gerrymandered map for Congressional districts, however, appears to be set for the May 3 primary, thanks to Republican delays and Ohio laws that require a 60-day period for any new Congressional map to be drawn.",
    "Even worse, perhaps, the chaos further erodes Ohioans’ faith in the state election process just as Trumpism and The Big Lie have done for national elections—a point made by Republican congressional candidate Heimlich.",
    "“They said, ‘Oh, it was impossible to meet that (court) deadline.’ Well, yes, if you’re trying to make it impossible by stalling and wasting time.”\nThat tactic appears so far to be working in the Republicans’ favor.",
    "Just two Republican commission members, Senate President Matt Huffman and Speaker of the House Bob Cupp, have an iron grip on its proceedings and, as shown in court depositions, exclusive use of their own mapmakers.",
    "Following the April 4 contempt hearing in the Ohio Supreme Court, Mia Lewis, associate director of Common Cause Ohio, told Spectrum News that the Republican strategy for the last year has been to run out the clock.",
    "Nothing more.”\nOn April 4, Chief Justice O’Connor asked commission members to appear in court to explain why they shouldn’t be held in contempt for failing to submit timely maps in line with the state constitution.",
    "Total chaos is sprouting from this ill-conceived idea that, if only they created enough chaos, the Ohio Supreme Court would declare a map constitutional that (the justices) actually believe is unconstitutional.",
    "… All the people sitting at the table now have an incentive to compromise.”\nOhioans endorsed the constitutional amendment in 2015 with more than 71 percent of the vote and passed it in all 88 counties.",
    "Despite court orders to use an independent mapmaker and open up the process to the public, Republican members of the commission dismissed a constitutional map created by a pair of bipartisan mapmakers.",
    "The three dissenting justices, all Republicans, say the state’s highest court doesn’t have the authority to enforce the reform guidelines, only pose them as “aspirational” goals for the commission.",
    "Under new guidelines that make it harder to carve up cities, the 2022 maps look more compact than the old 2011 gerrymandered ones, but they still have skewed outcomes heavily favoring Republicans.",
    "“In a robust democracy of competitive districts, when you face re-election, you want to push forward ideas that are generally popular and to work with the other side to pass legislation,” he says.",
    "In New York, the Democrats are doing the same thing.”\nEvery 10 years, state legislative and congressional districts must be redrawn to reflect changes in population following the U.S. Census.",
    "Mike DeWine’s mask mandate during the height of the COVID-19 pandemic, and an ollie-ollie-oxen-free call for anyone in Ohio who wants to carry a concealed gun—no permit or training required.",
    "“They’re lying, and they know we know they’re lying,” says Catherine Turcer, executive director of Common Cause Ohio, one of several non-partisan groups fighting for redistricting reform.",
    "“I’m ashamed to be a Republican, to be honest,” says Joan Lawrence, an early advocate of redistricting reform who served nine terms as a Republican state legislator from Delaware County.",
    "Besides the map Wise submitted to the commission, several others have been submitted by professional independent mapmakers, again only to be ignored by Republicans on the commission.",
    "So far, though, only Michigan and Colorado have succeeded in making their commissions truly independent of state politics, according to the library research service CQ Researcher.",
    "The Republican charade of bipartisan reform is now costing Ohio taxpayers tens of millions of dollars in delayed election proceedings and millions more in legal and court costs.",
    "A key reform for the new maps is a fairness requirement that districts reflect the proportionality of Ohio’s voters over the last decade: 54 percent Republican and 46 Democrat.",
    "Four of the nine U.S. Supreme Court justices have already signaled in other redistricting cases that they would be open to considering the Independent State Legislative Theory.",
    "From the very beginning of the redistricting process, court depositions show that Huffman instructed mapmakers to ignore the fairness guidelines in the constitutional reforms.",
    "“They’re the ones in those (2015 and 2018) negotiations who insisted the Ohio Supreme Court have sole and exclusive jurisdiction over any challenge to the maps,” Pepper says.",
    "In addition to the lack of proportionality, the Ohio Supreme Court has also objected to mapmakers’ packing more Democratic than Republican voters into competitive districts.",
    "Representatives, including Steve Chabot of Cincinnati and Warren Davidson of West Chester, voted last year to overturn the results of a free and fair election for president.",
    "“The situation we have now, where over 90 percent of congressional districts are non-competitive in the general election, is a terrible thing for democracy,” says Heimlich.",
    "Pepper recently published The Laboratories of Autocracy (St. Helena Press), a book on the dangers of gerrymandering and voter suppression in statehouses across the nation.",
    "Nevertheless, it should take skilled mapmakers “less than a week” to draw a constitutional map, amateur mapmaker Geoff Wise told the commission at a September hearing.",
    "Instead, they approved a fourth state legislative map at its March 28 meeting, once again tweaking in secret the previous maps already declared unconstitutional.",
    "O’Connor, a moderate Republican whose final term ends this year, has been the swing vote in joining the court’s three Democrats in rejecting the Republican maps.",
    "Cracking divides a district that’s mostly minority party voters into separate parts to be combined with other districts where majority party voters can dominate.",
    "In a March 29 order rejecting the commission’s second Congressional map, O’Connor was forced to push the hearing on a third map well past the May 3 primary.",
    "The court has yet to rule on the commission’s fourth map but, if O’Connor’s contempt motion is any indication, it’s not likely to be approved either.",
    "Huffman and Cupp told commissioners at the March 28 meeting that using an independent mapmaker would have meant missing the court’s 10-day deadline.",
    "The federal panel has given the Ohio Supreme Court until April 20 to resolve the impasse on state legislative maps or they will step in themselves.",
    "The national Republican and Democratic redistricting committees have been squaring off in every state as a precursor to the 2022 midterm elections.",
    "The 2nd Congressional District grabs the county’s eastern suburbs and pairs them with the conservative Appalachian counties along the Ohio River.",
    "This is what you’d expect from people who, for 10 years, have been living in a world without accountability.”\nA Primer: What Is Gerrymandering?",
    "At the time, he points out, the GOP had control not only of the General Assembly and the Governor’s office, but the Ohio Supreme Court as well.",
    "We don’t know if any member has any more power than the others.” Press officers for LaRose and Faber did not return emails asking for comment.",
    "Their dissenting opinion called the majority’s decision to reject the third set of state legislative maps “an exercise of raw political power.",
    "The drawing of constitutional legislative maps is indeed complicated and time-consuming because of the requirements to avoid splitting cities.",
    "With early voting for the May 3 primary beginning April 5, Ohio still has no valid maps for its 99 House and 33 Senate statehouse districts.",
    "“What we need are Republicans and Democrats willing to stand up for free and fair elections and against partisan gerrymandering,” he says.",
    "Sometimes the minority party vote is so concentrated in a large area that it can’t be stacked or cracked to the majority party’s benefit.",
    "Anywhere from $15 million to $25 million for additional copies and mailings of ballots and for opening and staffing polling places twice.",
    "In recent years, those include a ban on abortion after six weeks and criminal penalties for doctors who perform them, an override of Gov.",
    "“To try and impeach a sitting justice of your own party because she’s actually following the constitution is truly outrageous,” he says.",
    "But for state legislative districts, the GOP maps secured about 63 percent of the seats for Republicans in both the House and Senate.",
    "Stacking dilutes the strength of minority party voters in a district by adding an even larger concentration of majority party voters.",
    "The 1st Congressional District takes the county’s western and central portions and runs it north into conservative Warren County.",
    "That’s why voters have you sitting up there.”\nA spokesman for DeWine said the governor feels “it’s a commission of seven members.",
    "Multiple states, including Ohio, have created redistricting commissions to supplement or supplant the role of state legislatures.",
    "Chris Christie, co-chair of the National Republican Redistricting Trust, told reporters in late March that Ohio was a key target.",
    "Phil Heimlich, a moderate Republican challenging Davidson in Ohio’s 8th Congressional District, agrees in principle with Pepper.",
    "Cries of “traitor” have risen among the GOP faithful, and some Republican legislators have even threatened to impeach O’Connor.",
    "Today, gerrymandering is an exact science using extensive voting data and computer algorithms to draw precise district lines.",
    "Four constitutional violations, and now tens of millions of dollars are going to be wasted by having to have two primaries.",
    "In that case, it’s packed into a single district to minimize the number of districts controlled by the minority party vote.",
    "Well, back then, they didn’t count on the voters replacing three of their justices over the next two years with Democrats.",
    "At a September commission hearing, Pepper pleaded with DeWine, LaRose, and Faber to get more involved in the process.",
    "Instead, the Republicans would likely hold 12 seats under their first set of maps and 11 seats under the second set.",
    "They again approved a similar reform measure for congressional districts in 2018 with 70 percent of the vote.",
    "“The whole thing just doesn’t work on the (election) calendar,” said ACLU Ohio Legal Director Freda Levenson.",
    "Democratic-leaning Hamilton County, for instance, has been a prime example of cracking for the last 10 years.",
    "Gerrymandering also has led to a flurry of state legislative actions once considered too extreme for Ohioans.",
    "“It produces extremism on both sides, because the only competition that either side faces is in the primary.",
    "The GOP needs just five more seats in the U.S. House of Representatives to take control from the Democrats.",
    "“They thought the laws were open-ended enough that, with a favorable Supreme Court, they’d be fine.",
    "The “carrot” was that both parties would be willing to compromise in order to secure a 10-year map.",
    "But the Republicans are counting on a once-radical concept to override the Supreme Court ruling.",
    "“You guys had to campaign a different way than Matt Huffman and (Bob) Cupp,” Pepper told them.",
    "Gerrymandering voting district maps for political advantage is as old as the nation itself.",
    "For the Congressional maps, a fair proportion of the 15 seats would go to nine Republicans.",
    "You are as much a check and a balance to the statehouse majority as the two Democrats are.",
    "But the basic tools of the trade have remained the same: stacking, cracking and packing.",
    "As the law’s “stick,” the Ohio Supreme Court would have final say in any disagreements.",
    "Pepper believes the chief justice is too popular with Ohio voters for that to happen.",
    "Both legislative leaders come from mostly rural Republican districts north of Lima.",
    "Ohio is one of only three states in the country still haggling over redistricting.",
    "A Democrat hasn’t represented any Hamilton County resident in Congress since 2010.",
    "So now it’s a bipartisan court that’s reading the constitution as it’s written.",
    "Each district in the state must contain roughly an equal number of residents.",
    "Their response again was to blame the court for not giving them enough time.",
    "But the incentives built into the law for compromise have failed to work.",
    "“They’ve had a run-out-the-clock strategy for longer than six months now.",
    "“The game is far from over in North Carolina and Ohio,” he said.",
    "The stakes are far more serious than sports bar bragging rights.",
    "“And you don’t want to be corrupt, or you won’t be re-elected.",
    "Somehow, they thought the court would cave to the pressure.",
    "At the Congressional level, five of Ohio’s Republican U.S.",
    "“You had to talk to everybody to win the races you won.",
    "Impeachment has been publicly opposed by Cupp and Gov.",
    "The cost to taxpayers for the double duty elections?",
    "Mike DeWine, both GOP members of the commission.",
    "He says he never heard back from LaRose.",
    "The incentives clearly haven’t worked.",
    "And it’s not just a Republican thing.",
    "You bring a statewide perspective.",
    "That’s why you see the panic.",
    "A senior aide to then-Gov.",
    "It depends on the state.",
    "Former New Jersey Gov.",
    "And what’s the result?",
    "Elbridge Gerry.",
    "Nothing less."
  ]
}