{
  "id": 7526,
  "mediaId": 6676,
  "date": "2022-04-07",
  "headline": "Here are the 6 Republicans who voted against investigating Russia for war crimes",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/04/AP22061123460473.jpg?w=1280",
  "link": "https://www.wkrg.com/national/here-are-the-6-republicans-who-voted-against-investigating-russia-for-war-crimes/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Hill via Nexstar Media Wire",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    4905,
    2187,
    2693,
    3618,
    3008,
    649,
    1126,
    6569,
    6672
  ],
  "sentences": [
    "The text of the bill does not mention the ICC specifically, but it does say that evidence and information collected can be used “in appropriate domestic, foreign, and international courts and tribunals prosecuting those responsible for such crimes.”\n“Yesterday I took a vote on a bill that would have allowed us to catalog and investigate war crimes in the Ukraine.",
    "The congressman, however, said Russia has “probably committed some pretty serious, hostile crimes against humanity.”\nGreene told The Hill in a statement on Thursday that she was against the legislation because it would give authority and information to the International Joint Commission (IJC) and ICC.",
    "“Some of my colleagues and I voted against this resolution in part because it contains language that could set the table for bringing spurious war crimes charges against American service members for mistakes made during military operations in theaters such as Afghanistan,” Massie said.",
    "Biggs said he would not back a Russian oil ban without a guarantee that the U.S. would make efforts toward achieving energy independence, and Massie wrote on Twitter that he was opposing the legislation because Biden did not have plans for energy production.",
    "(The Hill) – The House on Wednesday passed a bill that would direct President Biden to prepare a report on the government’s efforts to collect and examine evidence related to war crimes and other atrocities committed during Russia’s invasion of Ukraine.",
    "Massie wrote in a tweet on Thursday that he opposed the bill because it has language that could set the foundation for “spurious war crimes charges” being brought against American service members for mistakes made during military operations.",
    "And in June, Biggs, Greene and Massie made headlines for opposing a bill that called for awarding Congressional Gold Medals to the U.S. Capitol Police and all individuals who defended the Capitol during the attack on Jan. 6, 2021.",
    "Biggs, in a video posted to Twitter on Thursday, said that while he supports cataloging and investigating war crimes in Ukraine, he does not think information should be turned over to the International Criminal Court (ICC).",
    "Greene told Politico that she voted against the bill because she did not like that the legislation referred to the Capitol as “the temple of our American Democracy” or that it called the Jan. 6 attack an insurrection.",
    "The bipartisan legislation, dubbed the Ukraine Invasion War Crimes Deterrence and Accountability Act, passed the lower chamber in a 418-7 vote, with all those in opposition belonging to the Republican Party.",
    "The eight GOP members in opposition of the legislation have all worked to maintain close ties to former President Trump and have frequently found themselves in the far-right wing of the Republican Party.",
    "Also last month, Biggs, Greene and Massie voted against a separate bill that called for a ban on Russian oil imports and additional sanctions against Russia in response to its invasion of Ukraine.",
    "She said she will not cast a vote “for globalism.”\n“The bill would hand over authority and our intelligence to the ICJ and ICC – international courts that could put our military on trial.",
    "On the other hand, we should not be giving our information over to the International Criminal Court, and this bill indicated that’s where it was going to go,” Bigg said.",
    "GOP Reps. Andy Biggs (Ariz.), Warren Davidson (Ohio), Paul Gosar (Ariz.), Marjorie Taylor Greene (Ga.), Thomas Massie (Ky.) and Scott Perry (Pa.) all opposed the bill.",
    "In a video posted online, Greene said she could not back the U.S. getting involved in the conflict because there are larger issues Americans are facing at home.",
    "Wednesday’s vote was not the first time Biggs, Greene and Massie opposed legislation responding to Russia’s invasion of Ukraine.",
    "Massie wrote on Twitter that he believed the bill gave the president too much authority to impose sanctions on other nations.",
    "said the congresswoman mistakenly voted against the bill, and plans to tell the House clerk that she meant to vote in favor.",
    "Last month the trio voted against a bill to revoke normal trade relations with Russia, along with five other Republicans.",
    "“I do not support affiliating ourselves with the multilateral institutionalist court, the International Criminal Court.",
    "Gosar slammed the bill in a tweet for not making the needs of the American people a top priority.",
    "I will not vote for globalism and the slow slide to become a one world government.",
    "I will only vote to protect America, our military, and our borders,” Greene said.",
    "I support that 100 percent, 100 percent.",
    "A spokesman for Rep. Liz Cheney (R-Wyo.)",
    "That’s why I voted no here,” he added.",
    "Gosar joined the trio in opposition.",
    "We should be doing that."
  ]
}