[
  {
    "id": 2804,
    "mediaId": 8491,
    "date": "2022-01-27",
    "sentence": "COLUMBUS, Ohio (WCMH) – Debate season for Ohio’s open U.S. Senate seat kicked off Thursday night at North Columbus Baptist Church, where Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span> squared off despite the primary election still being months away.",
    "author": "Maeve Walsh",
    "title": "Josh Mandel, Morgan Harper meet in early debate for Senate seat"
  },
  {
    "id": 612,
    "mediaId": 8322,
    "date": "2022-02-23",
    "sentence": "The person who wins the GOP primary is likely to face Rep. Tim Ryan, D-Ohio, in the general election, although he does face a long-shot yet energetic primary opponent in progressive <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tyler Olson",
    "title": "Russia's Ukraine invasion makes waves in Ohio Senate race"
  },
  {
    "id": 726,
    "mediaId": 2664,
    "date": "2022-02-24",
    "sentence": "Not surprisingly, Democratic candidates <span class='selected-term'>Morgan Harper</span> and U.S. Rep. Tim Ryan backed the President’s plans for sanctions.",
    "author": "Nick Evans",
    "title": "Ohio GOP Senate candidates criticize Biden but offer the same response to Russian aggression"
  },
  {
    "id": 11385,
    "mediaId": 2660,
    "date": "2022-03-08",
    "sentence": "There are two major candidates on the Democratic side — U.S. Rep. Tim Ryan, and consumer protection attorney <span class='selected-term'>Morgan Harper</span>.",
    "author": "",
    "title": "The race for the Ohio U.S. Senate seat: A guide"
  },
  {
    "id": 9348,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "Even before the Republicans’ event, the Ohio Democratic Party had predicted it would be “the first of what will be a brutal debate season.” The Democrats dubbed the GOP race a “cavalcade of clowns.”\nThe first Democratic debate, involving US Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and community activist Traci Johnson, is slated for Monday.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 6059,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 4853,
    "mediaId": 8491,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Maeve Walsh",
    "title": "Which Republicans are running to represent Ohio in the U.S. Senate?"
  },
  {
    "id": 5395,
    "mediaId": 2660,
    "date": "2022-04-22",
    "sentence": "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tom Kertscher",
    "title": "In Senate race, JD Vance’s call for higher taxes is only for certain corporations, corporate leaders"
  }
]