[
  {
    "id": 3873,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in a very small primary field that includes progressive <span class='selected-term'>Morgan Harper</span>, who is a former Consumer Financial Protection Bureau senior adviser and a 2020 congressional candidate.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 2064,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Longtime Democratic Rep. Tim Ryan of northeastern Ohio is the front-runner in a small field of contenders that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate,\nWhoever wins the GOP primary will likely be considered the favorite in November’s general election in Ohio, a one-time premiere battleground state that Trump won by eight points in both his 2016 presidential election and his 2020 reelection defeat.",
    "author": "Paul Steinhauser",
    "title": "Trump helps narrow field in crowded Ohio Republican Senate primary"
  },
  {
    "id": 1393,
    "mediaId": 2573,
    "date": "2022-02-14",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "",
    "title": "Super PAC spending $1.4 million to reintroduce J.D. Vance to Ohio voters in GOP Senate showdown"
  },
  {
    "id": 5962,
    "mediaId": 2649,
    "date": "2022-04-21",
    "sentence": "The winning Republican will face off with the winner of the Democratic primary, likely either <span class='selected-term'>Morgan Harper</span> or U.S. Rep. Tim Ryan (D-Ohio).",
    "author": "Taylor Giorno",
    "title": "Ohio’s Republican Senate primary attracts big money as tensions boil over ahead of Saturday Trump rally"
  },
  {
    "id": 4696,
    "mediaId": 8496,
    "date": "2022-04-23",
    "sentence": "\"The entire Ohio GOP Senate race has focused only on Trump’s endorsement instead of how any of these Republicans would improve the lives of Ohioans, \" Democrat U.S. Senate candidate <span class='selected-term'>Morgan Harper</span> wrote in a statement.",
    "author": "",
    "title": "Former President Donald Trump holds rally in Ohio"
  }
]