[
  {
    "id": 4346,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in small primary field that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "Paul Steinhauser",
    "title": "Trump ally Marjorie Taylor Greene endorses JD Vance in Ohio GOP Senate showdown"
  },
  {
    "id": 3551,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Julie Carr Smyth",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 3361,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "“Josh Mandel is the swamp.”\n- Democratic Senate candidate <span class='selected-term'>Morgan Harper</span>\n“I am scared as a woman, as a Black person, as a daughter who has a mother who lives off of a monthly pension, of getting this guy anywhere near a seat of power in the United States Senate,” Harper said.",
    "author": "Liz Skalka",
    "title": "A Hard-Right Republican And A Progressive Debated. It Went As Well As You'd Expect."
  },
  {
    "id": 3423,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "JULIE CARR SMYTH",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 3546,
    "mediaId": 2594,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Via AP news wire",
    "title": "Ryan, not onstage, takes central focus at Ohio Senate event"
  },
  {
    "id": 2804,
    "mediaId": 8491,
    "date": "2022-01-27",
    "sentence": "COLUMBUS, Ohio (WCMH) – Debate season for Ohio’s open U.S. Senate seat kicked off Thursday night at North Columbus Baptist Church, where Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span> squared off despite the primary election still being months away.",
    "author": "Maeve Walsh",
    "title": "Josh Mandel, Morgan Harper meet in early debate for Senate seat"
  },
  {
    "id": 2871,
    "mediaId": 2919,
    "date": "2022-01-28",
    "sentence": "“<span class='selected-term'>Morgan Harper</span>, Joe Biden, Nancy Pelosi, Chuck Schumer — they want to keep those jobs buried in the ground.”\nMandel said he relishes his status as an “outsider” — though he has been twice elected as Ohio Treasurer and was previously an Ohio House representative — and said it’s part of why he’s built his campaign around churches rather than the typical party apparatus.",
    "author": "Nick Evans",
    "title": "Morgan Harper and Josh Mandel face off in Senate debate"
  },
  {
    "id": 3348,
    "mediaId": 2664,
    "date": "2022-01-28",
    "sentence": "— <span class='selected-term'>Morgan Harper</span> (@Morgan Harper) 1643386108\nIN OTHER NEWS: Florida Republicans effectively 'nullified' Black state rep's election by refusing to send certification letter\nFlorida Republicans effectively 'nullified' Black state rep's election by refusing to send certifica",
    "author": "Bob Brigham",
    "title": "The 'very worst forms of gutter Trumpism' on full display in Ohio’s GOP Senate primary: columnist"
  },
  {
    "id": 3199,
    "mediaId": 2919,
    "date": "2022-01-31",
    "sentence": "From now through November, this team is going to keep building the momentum we need to bring home a victory for Ohio workers in this race.”\nRyan joins a field of four Democrats that have announced their intent to run for the Senate seat, which currently includes consumer protection attorney and Columbus native <span class='selected-term'>Morgan Harper</span>, Demar Sheffey, a Cleveland native and Treasurer of the Cuyahoga Soil & Water Conservation District, and Westlake resident \"working-class citizen\" Rick Taylor.",
    "author": "Camryn Justice",
    "title": "Rep. Tim Ryan submits signatures to appear on ballot for US Senate race"
  },
  {
    "id": 2774,
    "mediaId": 2590,
    "date": "2022-02-03",
    "sentence": "“He did not come up through the ranks being a bomb-throwing, provocative divider.”\n<span class='selected-term'>Morgan Harper</span>, a progressive underdog running for the Democratic nomination opposite Mandel, summed up the impression he tends to leave on Democrats.",
    "author": "Liz Skalka",
    "title": "Josh Mandel May Be Trolling The GOP. He Could Be Ohio's Next Senator."
  },
  {
    "id": 2064,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Longtime Democratic Rep. Tim Ryan of northeastern Ohio is the front-runner in a small field of contenders that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate,\nWhoever wins the GOP primary will likely be considered the favorite in November’s general election in Ohio, a one-time premiere battleground state that Trump won by eight points in both his 2016 presidential election and his 2020 reelection defeat.",
    "author": "Paul Steinhauser",
    "title": "Trump helps narrow field in crowded Ohio Republican Senate primary"
  },
  {
    "id": 1925,
    "mediaId": 8491,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Samantha Bender",
    "title": "Geno DiFabio kicks off campaign for Mahoning County commissioner"
  },
  {
    "id": 1393,
    "mediaId": 2573,
    "date": "2022-02-14",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "",
    "title": "Super PAC spending $1.4 million to reintroduce J.D. Vance to Ohio voters in GOP Senate showdown"
  },
  {
    "id": 1189,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "The winner of the Republican primary will face the winner of a Democrat primary that includes 10-term U.S. Rep. Tim Ryan and progressive <span class='selected-term'>Morgan Harper</span>, a former consumer protection attorney.",
    "author": "",
    "title": "GOP Sen. Rob Portman Endorses Jane Timken for His Seat"
  },
  {
    "id": 1105,
    "mediaId": 2728,
    "date": "2022-02-16",
    "sentence": "The winner of the Republican primary will face the winner of a Democratic primary that includes 10-term U.S. Rep. Tim Ryan and progressive <span class='selected-term'>Morgan Harper</span>, a former consumer protection attorney.",
    "author": "Julie Carr Smyth",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 1153,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "The winner of the Republican primary will face the winner of a Democratic primary that includes 10-term U.S. Rep. Tim Ryan and progressive <span class='selected-term'>Morgan Harper</span>, a former consumer protection attorney.",
    "author": "Associated Press",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 361,
    "mediaId": 2578,
    "date": "2022-02-22",
    "sentence": "His answer entirely revolved around natural gas drilling and the jobs it would bring to Ohio\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nLike a true Democrat, <span class='selected-term'>Morgan Harper</span> refused to shake his hand after the debate.",
    "author": "Jim Hoft",
    "title": "MANDEL BRINGS THE FIRE: GOP Candidate Josh Mandel SHREDS Vicious Audience Member During Senate Debate in Black Community – Then Destroys Dem Opponent (VIDEO)"
  },
  {
    "id": 783,
    "mediaId": 2564,
    "date": "2022-02-22",
    "sentence": "+4\nView gallery\nMandel avoided saying whether he would also compare Capitol rioters to 'thugs' as he did with BLM protesters, instead stating: 'What violates my sensibilities over the past year or two in respect to behavior in that regard that you're describing, is organizations like Black Lives Matter that burned down police stations in places like Minneapolis'\n'I told the story earlier about being at a town hall, the bar and restaurant down the street, where I told folks, \"I'm going to date <span class='selected-term'>Morgan Harper</span>.",
    "author": "Elizabeth Elkind",
    "title": "Chaos at Ohio Senate race debate as Republican Josh Mandel shouts at audience member who said he should be 'put out' for calling BLM 'thugs' and calls his Democratic rival 'like AOC only dumber'"
  },
  {
    "id": 811,
    "mediaId": 2557,
    "date": "2022-02-22",
    "sentence": "Don’t you suck up to him.”\nThe second Josh Mandel v. <span class='selected-term'>Morgan Harper</span> debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nPromoted Content\nMandel is just openly insulting Harper at this debate, to groans pic.twitter.com/YANuVOJn9X\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nAfter a debate in which Mandel called Harper dumb and scolded her for being “angry” about a dozen times, Harper refuses to shake his hand pic.twitter.com/yTuvfYDGzm\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe full debate is in the video below:\nHarper posted a video message on Tuesday, blasting Mandel, calling him a sexist and a racist.",
    "author": "DML News App",
    "title": "VIDEO: Debate erupts into chaos as Republican compares Dem to ‘dumber’ AOC"
  },
  {
    "id": 373,
    "mediaId": 2573,
    "date": "2022-02-22",
    "sentence": "An Ohio Senate debate between Republican candidate Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span> devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the incendiary Ohio Senate race.",
    "author": "Tyler Olson",
    "title": "Mandel-Harper Ohio Senate debate goes off the rails in Cleveland"
  },
  {
    "id": 286,
    "mediaId": 2512,
    "date": "2022-02-22",
    "sentence": "Mandel's dizzying remarks came in a Cleveland debate against his Democratic opponent <span class='selected-term'>Morgan Harper</span>, who had just answered a question about whether she'd give unconditional support to defend Israel if Iran attacks the Jewish state.",
    "author": "Jon Skolnik",
    "title": "?Republican Senate hopeful Josh Mandel makes debate audience 'groan' after clueless remark about slavery"
  },
  {
    "id": 75,
    "mediaId": 2614,
    "date": "2022-02-23",
    "sentence": "The debate Monday included only Harper and Mandel.”\nThe second Josh Mandel v. <span class='selected-term'>Morgan Harper</span> debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe moderator asked Mandel about a comment calling Black Lives Matter members “thugs.” Then an audience member interrupted with a loud “uhhhhuh.”\n“You ain’t coming in the Black community.",
    "author": "DrewBerquist.com",
    "title": "Ohio Senate Debate Gets Out Of Hand"
  },
  {
    "id": 170,
    "mediaId": 2745,
    "date": "2022-02-24",
    "sentence": "This, like his first spots, is a world away from the invective that Mandel hurls at liberals on Twitter, and the dismissiveness he's shown Democrat <span class='selected-term'>Morgan Harper</span> in two debates with her.",
    "author": "",
    "title": "The Trailer: In Texas, safe-seat candidates fight about the best way to be partisan"
  },
  {
    "id": 726,
    "mediaId": 2664,
    "date": "2022-02-24",
    "sentence": "Not surprisingly, Democratic candidates <span class='selected-term'>Morgan Harper</span> and U.S. Rep. Tim Ryan backed the President’s plans for sanctions.",
    "author": "Nick Evans",
    "title": "Ohio GOP Senate candidates criticize Biden but offer the same response to Russian aggression"
  },
  {
    "id": 12989,
    "mediaId": 2641,
    "date": "2022-02-28",
    "sentence": "Former senior adviser at the Consumer Financial Protection Bureau <span class='selected-term'>Morgan Harper</span> is at 4%, while a whopping 51% are undecided.",
    "author": "Brian Freeman",
    "title": "Poll: Gibbons Leads GOP Primary for Ohio Sen. Portman's Seat"
  },
  {
    "id": 17166,
    "mediaId": 8491,
    "date": "2022-02-28",
    "sentence": "Columbus lawyer <span class='selected-term'>Morgan Harper</span>, who lost the Democratic primary Joyce Beaty in 2020 for Ohio’s 3rd Congressional District and has been seen as Ryan’s top opponent, finished last in Emerson’s poll.",
    "author": "Ben Orner",
    "title": "Ryan dominates Democratic field in Senate poll"
  },
  {
    "id": 12830,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "But also putting up a strong fight for the nomination are attorney <span class='selected-term'>Morgan Harper</span>, a progressive who challenged Rep. Joyce Beatty to represent the Columbus area in 2020; and Traci Johnson, a longtime state employee who is now a tech executive.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 10697,
    "mediaId": 2573,
    "date": "2022-03-09",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "Paul Steinhauser",
    "title": "Ohio GOP Senate showdown: Dolan spotlights law enforcement support in new massive ad buy"
  },
  {
    "id": 11049,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "The Ohio Democratic Party last month endorsed the primary frontrunner, Rep. Tim Ryan, further consolidating support behind him as his anti-establishment opponent, <span class='selected-term'>Morgan Harper</span>, struggled to gain traction.",
    "author": "",
    "title": "GOP Senate candidates thrash each other ahead of fight for majority"
  },
  {
    "id": 12448,
    "mediaId": 8455,
    "date": "2022-03-21",
    "sentence": "The first Democratic debate, involving U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and community activist Traci Johnson, is slated for March 23.",
    "author": "ASSOCIATED PRESS",
    "title": "Fight at Ohio GOP Senate debate elevates military issue"
  },
  {
    "id": 9348,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "Even before the Republicans’ event, the Ohio Democratic Party had predicted it would be “the first of what will be a brutal debate season.” The Democrats dubbed the GOP race a “cavalcade of clowns.”\nThe first Democratic debate, involving US Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and community activist Traci Johnson, is slated for Monday.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 9723,
    "mediaId": 2732,
    "date": "2022-03-21",
    "sentence": "Even before the Republicans’ event, the Ohio Democratic Party had predicted it would be “the first of what will be a brutal debate season.” The Democrats dubbed the GOP race a “cavalcade of clowns.”\nThe first Democratic debate, involving U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and community activist Traci Johnson, is slated for March 23.",
    "author": "Associated Press",
    "title": "Fight in Ohio GOP Senate debate leads to demand for apology"
  },
  {
    "id": 9333,
    "mediaId": 6571,
    "date": "2022-03-21",
    "sentence": "The first Democratic debate, involving U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and community activist Traci Johnson, is slated for March 23.",
    "author": "",
    "title": "Fight In Ohio GOP Senate Debate Leads To Demand For Apology"
  },
  {
    "id": 9462,
    "mediaId": 2594,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Via AP news wire",
    "title": "Campaigns weigh strategy options if Ohio primary is delayed"
  },
  {
    "id": 9695,
    "mediaId": 2560,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Julie Carr Smyth and Jill Colvin",
    "title": "Campaigns weigh strategy options if Ohio primary is delayed"
  },
  {
    "id": 9081,
    "mediaId": 2919,
    "date": "2022-03-29",
    "sentence": "Mandel made waves when he claimed in a debate with <span class='selected-term'>Morgan Harper</span> that there is no separation between church and state.",
    "author": "Nick Evans",
    "title": "3 takeaways from Ohio Republican Senate debate"
  },
  {
    "id": 9118,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "He will face off against progressive candidate and attorney <span class='selected-term'>Morgan Harper</span> and tech executive Traci Johnson in the Democratic primary on May 3.",
    "author": "Orlando Mayorquin",
    "title": "Who is Tim Ryan? What to know about the congressman running for Senate in Ohio"
  },
  {
    "id": 7755,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tom Kertscher",
    "title": "In Ohio US Senate race, Mandel falsely claimed that Gibbons said military service isn’t ‘real work’"
  },
  {
    "id": 7082,
    "mediaId": 2572,
    "date": "2022-04-04",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "Paul Steinhauser",
    "title": "Cruz endorses Mandel in Ohio’s crowded and combustible GOP Senate primary"
  },
  {
    "id": 7080,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Democrats seeking their party's nod are U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and Columbus activist and tech executive Traci Johnson.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 7797,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "The Trailer: Some called his anti-China ad dangerous. Here's why Tim Ryan kept running it."
  },
  {
    "id": 8723,
    "mediaId": 8371,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 8713,
    "mediaId": 8384,
    "date": "2022-04-07",
    "sentence": "Democrats seeking their party’s nod are U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and Columbus activist and tech executive Traci Johnson.",
    "author": "Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 7744,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "Democrats seeking their party's nod are U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and Columbus activist and tech executive Traci Johnson.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 7513,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "Democrats seeking their party’s nod are U.S. Rep. Tim Ryan, former consumer protection attorney <span class='selected-term'>Morgan Harper</span> and Columbus activist and tech executive Traci Johnson.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 6059,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 4853,
    "mediaId": 8491,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Maeve Walsh",
    "title": "Which Republicans are running to represent Ohio in the U.S. Senate?"
  },
  {
    "id": 5962,
    "mediaId": 2649,
    "date": "2022-04-21",
    "sentence": "The winning Republican will face off with the winner of the Democratic primary, likely either <span class='selected-term'>Morgan Harper</span> or U.S. Rep. Tim Ryan (D-Ohio).",
    "author": "Taylor Giorno",
    "title": "Ohio’s Republican Senate primary attracts big money as tensions boil over ahead of Saturday Trump rally"
  },
  {
    "id": 5395,
    "mediaId": 2660,
    "date": "2022-04-22",
    "sentence": "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tom Kertscher",
    "title": "In Senate race, JD Vance’s call for higher taxes is only for certain corporations, corporate leaders"
  }
]