[
  {
    "id": 4279,
    "mediaId": 2702,
    "date": "2022-01-25",
    "sentence": "> From censure to out-and-out political targeting, progressives want to challenge fellow Democrats they believe stand in the way of their agenda in Congress, reports The Hill’s Hanna Trudo, who offers five 2022 examples: Jessica Cisneros is challenging Rep. Henry Cuellar (Texas); Rana Abdelhamid wants to defeat Rep. Carolyn Maloney (New York); Kina Collins is targeting Rep. Danny K. Davis (Illinois); Odessa Kelly is taking aim at Rep. Jim Cooper (Tennessee); and Ohio underdog <span class='selected-term'>Morgan Harper</span> would like to best Rep. Tim Ryan for contention in the state’s Senate primary in May (she will face off during a debate on Thursday against Republican Senate candidate Josh Mandel in Columbus) (Cleveland.com).",
    "author": "",
    "title": "The Hill’s Morning Report – Biden, NATO eye ‘all scenarios’ with Russia"
  },
  {
    "id": 719,
    "mediaId": 2658,
    "date": "2022-02-22",
    "sentence": "The invitation\nDEBATE DEBACLE — Ohio GOP Senate candidate JOSH MANDEL and Dem candidate <span class='selected-term'>MORGAN HARPER</span> participated in a debate Monday evening.",
    "author": "",
    "title": "POLITICO Playbook: Today’s conundrum: What’s an ‘invasion’?"
  },
  {
    "id": 612,
    "mediaId": 8322,
    "date": "2022-02-23",
    "sentence": "The person who wins the GOP primary is likely to face Rep. Tim Ryan, D-Ohio, in the general election, although he does face a long-shot yet energetic primary opponent in progressive <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tyler Olson",
    "title": "Russia's Ukraine invasion makes waves in Ohio Senate race"
  },
  {
    "id": 221,
    "mediaId": 8322,
    "date": "2022-02-23",
    "sentence": "Continue reading …\nEXPLOSIVE OHIO DEBATE - An Ohio U.S. Senate debate between Republican candidate Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span> devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the Ohio Senate race.",
    "author": "Jack Durschlag",
    "title": "Russia-Ukraine crisis intensifies"
  },
  {
    "id": 726,
    "mediaId": 2664,
    "date": "2022-02-24",
    "sentence": "Not surprisingly, Democratic candidates <span class='selected-term'>Morgan Harper</span> and U.S. Rep. Tim Ryan backed the President’s plans for sanctions.",
    "author": "Nick Evans",
    "title": "Ohio GOP Senate candidates criticize Biden but offer the same response to Russian aggression"
  }
]