{
  "id": 1996,
  "mediaId": 2658,
  "date": "2022-03-22",
  "headline": "Meta hires former Trump White House aide, Issue One hires Lott",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/03/22/meta-hires-former-trump-white-house-aide-issue-one-hires-lott-00019387",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "New Joint Fundraisers\nKistner Victory Committee (KISTNER FOR CONGRESS, Service Knowledge Oath Leadership PAC (SKOL PAC), NRCC)\nMary Miller Victory Committee (Rep. Mary Miller, House Freedom Fund, Faith in America PAC)\nValor Honor Country Fund (Van Orden for Congress, Eli Crane for Congress, The Pat Harrigan Committee)\nNew PACs\nFinancial Freedom PAC (Hybrid PAC)\nHispanic Leadership Trust (PAC)\nLouisville for Public Safety (Super PAC)\nThe Reparations Pledge (Super PAC)\nThe Right Voice For New Jersey (Super PAC)\nStand for Freedom PAC (Super PAC)\nNew Lobbying Registrations\n90 West LLC: Woodwell Climate Research Center\nAlta Crest LLC: American Postal Infrastructure\nAlta Crest LLC: Specialist Telemed\nBlank Rome Government Relations: Chunker\nBradley Arant Boult Cummings LLP: The City Of Eufaula\nCornerstone Government Affairs, Inc.: Nurse-Family Partnership\nCypress Advocacy, LLC: Meta Platforms, Inc.\nDentons US LLP: Dc Water\nForis, Inc And Its Affiliated Entity, Foris Dax, Inc. D/B/A Crypto.Com: Foris, Inc And Its Affiliated Entity, Foris Dax, Inc. D/B/A Crypto.Com\nFranklin Square Group, LLC: Helion Energy, Inc.\nHolland & Knight LLP: Quicktrip Corporation\nLiberty Partners Group, LLC: Revenue Cycle Coding Strategies And Rc Billing\nPort Side Strategies, LLC: New Venture Fund\nRidge Policy Group: The Coalition For App Fairness\nSidley Austin LLP: Foris Dax, Inc. D/B/A Crypto.Com\nSquire Patton Boggs: Stellant Systems\nStarzyk & Associates, LLC: Santee Sioux Nation\nSubject Matter (Fka Elmendorf Ryan): Northrop Grumman Systems Corporation\nThe Livingston Group, LLC: Health Supply US, LLC\nValneva USa, Inc.: Valneva USa, Inc.\nNew Lobbying Terminations\nAlta Crest LLC: Oregon Institute Of Technology\nAlta Crest LLC: The Austin Center For Manufacturing & Innovation\nAlta Crest LLC: Ursa Major Technologies\nAmerican Public University System: American Public University System\nBrody Group L.L.C.",
    "— Republicans’ signals that they plan “to use Jackson’s confirmation hearing as a forum to slam Demand Justice — a liberal organization that advocates for adding seats to the Supreme Court and pushed for Jackson’s nomination — as a pernicious ‘dark money’ group acting as puppet master to her selection” is “a playbook Democrats have employed in the past against conservative nominees and the organizations that work to promote them, such as the Federalist Society, but Democrats insist there’s a major difference: They don’t work directly with Demand Justice.”\n— “‘I honestly don’t know that much about them,’ said Sen. Cory Booker (D-N.J.), a member of the Judiciary Committee.",
    "The group — which after opposing Trump during the 2016 primaries has closely aligned itself with him ever since — has spent heavily backing Rep. Ted Budd’s (R-N.C.) Senate bid, as well as Rep. Mo Brooks’ (R-Ala.) struggling campaign for Senate.”\n…WHILE DEMS REJECT KOCH MONEY: “More than two dozen U.S. lawmakers received roughly $110,000 in campaign contributions from Koch Industries in the weeks leading up to Vladimir Putin’s attack on Ukraine — money some ethics lawyers say should be returned given the company’s decision to maintain operations in Russia,” CNBC’s Brian Schwartz reports.",
    "Schrader’s campaign received $4,500 from the Koch Industries’ political action committee during the 2022 election cycle, according to the nonpartisan Center for Responsive Politics, which tracks campaign donations and spending.”\n— After Schwartz’s story published, Georgia Democrat Sanford Bishop “told CNBC that his campaign will not accept contributions from Koch Industries as long as they are continuing to do work in Russia and will be donating the amount they’ve received this cycle to a charity providing aid to Ukraine.",
    "lawmakers are being scrutinized for accepting campaigns contributions from the conglomerate, which is run by billionaire Charles Koch, even as other major U.S. and European companies flee the country to avoid sanctions over its invasion of Ukraine.”\n— “The company’s glass manufacturer Guardian Industries, which has two facilities in Russia, will remain fully active despite the Kremlin’s war with Ukraine, Koch Industries President and Chief Operating Officer Dave Robertson said in a statement last week.",
    "U.S. President Joe Biden’s administration and Western allies have taken aim at Russia with sanctions, including targeting the country’s central bank.”\n— “At least one lawmaker, Rep. Kurt Schrader, D-Ore., won’t accept future donations from Koch Industries and will donate what it has recently received to a charity dedicated to providing aid to Ukraine, spokeswoman Deb Barnes said after CNBC emailed to ask about the donations.",
    "DEMS DOWNPLAY DEMAND JUSTICE LINKS: After Demand Justice, the liberal judicial advocacy group, took a starring role in Republican senators’ opening statements in the confirmation hearing of Ketanji Brown Jackson on Monday, Democrats in the chamber sought to differentiate the group from its conservative counterparts like the Federalist Society, Marianne Levine reports.",
    "A bipartisan group of senators is working on potential reforms to the law, which Issue One argues in a blog post on its website has numerous gaps and ambiguities that were revealed in the aftermath of the 2020 election and “exposed the nation to enormous risks.”\n— Crossroads’ Mathew ?Lapinski and Alex Gleason will also work on the account.",
    "They’re not to us what the Heritage Foundation and the Federalist Society are to [Republicans].’”\n— “When [Judiciary ranking member Chuck] Grassley asked Jackson about whether the high court is ‘bought’ by ‘dark money groups,’ she responded that ‘I don’t have any reason to believe that that’s the case.",
    "Meta hires former Trump White House aide, Issue One hires Lott\nBy CAITLIN OPRYSKO\n03/22/2022 04:51 PM EDT\nPresented by\nWith Daniel Lippman\nNEW BUSINESS: Meta Platforms, the parent company of Facebook and Instagram, has added more conservative bona fides to its outside lobbying team.",
    "— Meanwhile Issue One, the political reform advocacy group, has hired a team of lobbyists from Crossroads Strategies that includes former Sen. Trent Lott to push for updates to the Electoral Count Act, the 19th-century law that governs certification of presidential elections.",
    "She replied she hadn’t.”\nCLUB FOR GROWTH HAULS IN CASH: The conservative Club for Growth’s super PAC brought in $6.6 million in February, our Brittany Gibson and Zach Montellaro report in a round-up of campaign finance filings from this weekend’s deadline.",
    "Sources familiar with the matter told POLITICO in 2019 that the company was bringing on Cypress as it amassed a lobbying team to pitch its since-scrapped digital currency, Libra, to the Hill, but no registration was ever filed, disclosures show.",
    "He spent the past four years with LNG producer Cheniere Energy as senior vice president for policy, government and public affairs, and before that he served in the Obama Energy Department as assistant secretary for fossil energy.",
    "The social media network has hired Brant Imperatore and Rick Dearborn of Cypress Advocacy to lobby on antitrust and competition bills — several forms of which, of course, are pending on the Hill right now.",
    "“Chris has devoted his career to shaping progressive energy policy and driving toward a more sustainable future,” Steven Croley, Ford’s chief policy officer and general counsel, said in a statement.",
    "Imperatore is a former attorney for the House Financial Services Committee, while Dearborn served as White House deputy chief of staff at the outset of President Donald Trump’s term.",
    "He personally gave $3 million to the Club, and Kentucky Freedom PAC — a super PAC that supports Sen. Rand Paul (R-Ky.), and which Yass has funded — gave an additional $2 million.",
    "Bishop’s campaign has seen $2,500 from the Koch Industries PAC this cycle.”\nJobs Report\n— Gladys Barcena is joining the Madison Group as senior director of government relations.",
    "Ford announced earlier this month that it will split its operations into one business for gas-powered cars and one to ramp up its production of battery-powered models.",
    "I have only the highest esteem for the members of the Supreme Court.’” Sen. Lindsey Graham (R-S.C.) “asked Jackson whether she had ever interacted with the group.",
    "— “The Club has been active in Republican primaries this year, and it has been the largest outside spender of the cycle so far, according to OpenSecrets.",
    "Crossroads is the only outside lobbying firm currently on retainer for Issue One, which spent $145,000 on lobbying last year, according to disclosures.",
    "— Cypress is Meta’s first new lobbying hire this year, coming off record spending of more than $20 million for the embattled platform in 2021.",
    "Public Affairs: Ursa Major Technologies\nDeutsche Organization Incorporated: Cixcess Inc.\nIce Miller Strategies LLC: Celo Foundation\nFollow Us",
    "— Ian Choiniere has been promoted to director of product advocacy at the American Chemistry Council overseeing the spray foam division.",
    "FORD TAPS NEW HEAD LOBBYIST: Christopher Smith is joining Ford as its chief government affairs officer, the automaker announced today.",
    "— “Its largest benefactor continues to be Jeff Yass, who has emerged as one of the most powerful Republican donors in recent years.",
    "“He brings tremendous passion and expertise to Ford as we shape the future of transportation.”\nGood afternoon and welcome to PI.",
    "She most recently served as vice president of government relations and public policy at Zillow and is a Lyft alum.",
    "— Crystal Ebert is now a director for digital and communications at Bully Pulpit Interactive, Playbook reports.",
    "— NFT marketplace OpenSea has hired Loni Mahanta as their new vice president of policy and government affairs.",
    "She previously was an administrative assistant for the House Appropriations Transportation-HUD Subcommittee.",
    "— Alex Stroman has been promoted to director of U.S. state government and community relations at TC Energy.",
    "She previously was an assistant director of policy and political affairs for the American Jewish Committee.",
    "He previously led U.S. East stakeholder relations at the company, and is an RNC and Trump inaugural alum.",
    "‘If you pick the ACLU, or the [Center for American Progress] those are groups that we’ve worked with.",
    "— Jackie Subar is now national director of strategic partnerships for the Anti-Defamation League.",
    "— Smith joins Ford as the auto industry forges ahead in its transition toward electric vehicles.",
    "Smith will replace Mitch Bainwol, who retired from the company at the end of last year.",
    "She most recently was a digital adviser at EMILY’s List, and is a DCCC alum.",
    "Shipping magistrate Richard Uihlein kicked in an additional $1 million.",
    "He was previously a manager of product communications for ACC.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "The committee has $26.7 million in the bank.",
    "Send tips: coprysko@politico.com.",
    "— “U.S."
  ]
}