{
  "id": 4580,
  "mediaId": 2658,
  "date": "2022-02-17",
  "headline": "Ballard to fundraise for potential Ways and Means chair",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/02/17/ballard-to-fundraise-for-potential-ways-and-means-chair-00009900",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1544,
    1721,
    1941,
    3114,
    3746,
    4160,
    4622,
    878,
    1162,
    4977
  ],
  "sentences": [
    "Cornerstone Government Affairs, Inc.: The University Of Louisiana Monroe Foundation\nCypress Advocacy, LLC: Financial Technology Association (Fta)\nFaegre Drinker Biddle & Reath LLP: Ssm Health\nFoley Hoag LLP: Rio Tinto\nGevo, Inc.: Gevo, Inc.\nHolland & Knight LLP: City Of San Diego, Ca\nHolland & Knight LLP: City Of Sugar Land, Tx\nInvariant LLC: Datarobot, Inc.\nInvariant LLC: Mccain Foods USa, Inc.\nJennifer Cupp: World Coffee Research\nK&L Gates, LLP: Aleutian Maritime Lc\nKyndryl Inc: Kyndryl Inc\nLot Sixteen LLC: Orsted North America Inc.\nMehlman Castagnetti Rosen & Thomas, Inc.: National Association Of Professional Employer Organizations\nMercury Public Affairs, LLC: Zestfinance, Inc. D/B/A Zest Ai\nNiagara Bottling, LLC: Niagara Bottling, LLC\nNuro, Inc.: Nuro, Inc.\nTai Ginsberg & Associates, LLC: Born Free USa\nTai Ginsberg & Associates, LLC: Bumble Bee Foods, LLC\nTai Ginsberg & Associates, LLC: Cape Cod Commercial Fishermans Alliance, Inc.\nTai Ginsberg & Associates, LLC: Fishing Communities Coalition\nTai Ginsberg & Associates, LLC: Woods Hole, Martha'S Vineyard And Nantucket Steamship Authority\nTch Group, LLC: Truepill\nThe Washington Tax & Public Policy Group (Formerly The Washington Tax Group): Bp Corporation North America Inc.\nThorn Run Partners: Applied Materials, Inc.\nThorn Run Partners: Broadcom Corporation\nThorn Run Partners: Clemson University\nThorn Run Partners: Community Council Health Systems\nThorn Run Partners: Connecticut Center For Advanced Technology (Ccat)\nThorn Run Partners: Edwards Vaccum\nThorn Run Partners: Euv Tech\nThorn Run Partners: Family Heart Foundation\nThorn Run Partners: George Mason University\nThorn Run Partners: Georgetown University\nThorn Run Partners: Integra Technologies\nThorn Run Partners: Kennedy Krieger Institute\nThorn Run Partners: Loyola University Maryland\nThorn Run Partners: Main Line Health\nThorn Run Partners: Medstar Health\nThorn Run Partners: National Center For Manufacturing Sciences\nThorn Run Partners: Neurotrauma Sciences, LLC\nThorn Run Partners: Oshkosh Corporation\nThorn Run Partners: Roper St. Francis Healthcare\nThorn Run Partners: Somalogic\nThorn Run Partners: Stratacache, Inc\nThorn Run Partners: Strategic Radiology\nThorn Run Partners: Surescan Corporation\nThorn Run Partners: Tectus Corporation Dba Mojo Vision\nThorn Run Partners: The Chemours Company\nThorn Run Partners: University Of Baltimore Maryland\nThorn Run Partners: Villanova University\nThorn Run Partners: Virginia Wesleyan University\nTurntide Technologies: Turntide Technologies\nVan Scoyoc Associates: New Classrooms Innovation Partners, Inc.\nNew Lobbying Terminations\nCassidy & Associates, Inc.: Dji Technology Incorporated\nJack Ferguson Assoc., Inc.: Kent School\nTch Group, LLC: Stericycle Inc\nThorn Run Partners: Bird Rides, Inc.\nThorn Run Partners: Mcallister & Quinn On Behalf Of Villanova University\nTravel Tech: The Travel Technology Association: Travel Tech: The Travel Technology Association\nVectis Dc: Los Angeles Police Protective League\nFollow Us",
    "“As the Chamber launches attacks on antitrust moves against tech’s biggest firms, the group Fight Corporate Monopolies is launching a new ‘War Room’ campaign Thursday,” a day after the Chamber “released a report arguing that proposed antitrust bills in Congress aimed at Big Tech companies like Google, Apple, Meta and Amazon would harm American competitiveness and undermine national security.”\n— “The group is betting that blaming big corporations for economic problems across U.S. sectors, including banking, pharmaceuticals and Big Tech, will be a winning message for Democrats in the midterm elections.” The group is also “launching a rapid response campaign and a six-figure public opinion research effort, along with preliminary poll results testing sentiment on the power of big corporations” led by Helen Brosnan, a Democratic strategist who worked on Elizabeth Warren's (D-Mass.)",
    "— “These issues include Zinke’s attempts to aid Halliburton’s then-chair David Lesar and other developers in creating a commercial development known as 95 Karrow on land adjacent to a vacant lot in Montana that Zinke controlled through a family-run nonprofit foundation, a deal that would have led to Zinke potentially running a microbrewery on the site.”\n— “The negotiations, which included emails and text messages from Zinke to developers between August 2017 and July 2018, also involved meetings with Lesar and other developers in Zinke’s office at Interior’s D.C. headquarters even as the department was charged with overseeing Halliburton’s activities on federal land.",
    "Four top GOP digital strategists tell Axios it's also imperiling efforts to build a sustainable, grassroots base of financial support for anyone not named Trump.”\n— Axios reports that “22 cents of every dollar in donations processed through GOP payment processor WinRed last year went not to GOP midterm candidates but to two Trump committees: Save America and the Trump Make America Great Again Committee,” and that “the two groups brought in more WinRed money than the National Republican Senatorial Committee and the National Republican Congressional Committee — combined.”\n— “As problematic as the volume, Republican critics say, is the tone.",
    "New Joint Fundraisers\nThe Emmer Hill Committee (Reps. Tom Emmer, French Hill)\nGT Farm Team 2022 (Reps. Don Bacon, Jim Baird, Mike Bost, Rodney Davis, Jim Hagedorn)\nVan Orden Crane Victory Fund (Eli Crane for Congress, Van Orden for Congress)\nNew PACs\nSave Glendora Schools (PAC)\nTotal Community Options Inc. dba InnovAge PAC (PAC)\nNew Lobbying Registrations\nAlston & Bird LLP: Gaggle\nBracewell LLP: Match Group Holdings I, LLC\nBrownstein Hyatt Farber Schreck, LLP: Tapestryhealth\nCarmen Group Incorporated: Digital Gadgets\nCornerstone Government Affairs, Inc.: Atlanta University Consortium Center, Inc.",
    "TOP-ED: Jim Nussle, the head of the Credit Union National Association and a former congressman from Iowa, has an op-ed in The Hill today urging the powers that be on the Hill to “join us in the new normal” and “open the Capitol to the public.” In the piece, Nussle complains that when 4,000 members of his organization head to Washington for a fly-in next week, “only a fraction of them will be able to meet face-to-face with their elected representatives.”\n— “Without those meetings, how can they have a say in the bills that could advance the communities they serve?” Nussle writes.",
    "But Ed Mortimer, the Chamber’s vice president for transportation and infrastructure, shot the idea down in a statement on Wednesday nevertheless, arguing that any suspension of the fee “will negatively impact the Highway Trust Fund and has no promise of actually helping lower prices for consumers or improving the economy.”\n— POLITICO’s Tanya Snyder digs into this more here, writing that pausing the gas tax for “even part of the year would blow an enormous hole” in the trust fund, which pays for highway, tunnel and bridge projects across the country.",
    "Ron Wyden (D-Ore.), John Hickenlooper (D-Colo.), Tim Kaine (D-Va.), Tina Smith (D-Minn.), Tammy Baldwin (D-Wis.), Bob Casey (D-Pa.), Jacky Rosen (D-Nev.) and Hassan, Sherry Widicus of Quest Diagnostics, Chris Davis of Cigna, J.C. Scott of the Pharmaceutical Care Management Association, Liz Fox of United Health Group, Shoshana Krilow of Vizient, Oliver Kim of Cambia, Marty Paone and Aquila Powell of Prime Policy Group, Karishma Page of K&L Gates, Teresa Skala and David Caruolo of Anheuser-Busch and Zack Marshall of Alkermes.",
    "Still others are placing the financial and logistical burden of requiring proof of a same-day negative COVID-19 test to discuss matters important to communities across the country,” obstacles that he argues “raise serious questions about our lawmakers’ transparency and accessibility.”\n— Nussle also calls the online platforms that have allowed fly-ins and other meetings on the Hill to continue virtually “a great backstop,” he argues “they can never replace the feeling and nuance that comes across in face-to-face engagement.",
    "Keeping lawmakers and staff safe is important, but surely proper vaccinations, masking, and so many other security measures put in place on the Capitol campus over the last two years are enough.”\nANNALS OF FUNDRAISING: “Donald Trump's spamming of Republican donors could kneecap party efforts to build a steady funding stream for future elections and compete with Democratic fundraising, top GOP officials are privately warning,” per Axios’ Lachlan Markay and Jonathan Swan.",
    "CHAMBER SWATS DOWN PROPOSED GAS TAX HOLIDAY: The U.S. Chamber of Commerce, which is typically all about a tax cut, is roundly rejecting calls from some vulnerable Democrats to suspend the federal gas tax in a bid to address rising consumer costs, calling a proposal floated this week a “temporary stunt” that would undermine the much-touted bipartisan infrastructure bill that the Chamber lobbied hard to pass last year.",
    "… But the investigation did not find evidence that Zinke violated formal conflicts of interest laws or that Interior granted Halliburton any specific favors.”\nSPOTTED at a DSCC fundraiser last night hosted by Prime Policy Group’s Emily Katz, Nathanson+Hauck’s Melanie Nathanson and SplitOak Strategies’ Sarah Egge, per a tipster: DSCC Chair Gary Peters (D-Mich.), Sens.",
    "The lobbyist on the contract, Michael Tongour, a former GOP aide on the Senate Health Education Labor and Pensions Committee, told POLITICO that he has been working primarily on government procurement issues — reaching out to Defense Department officials and letting them know about the company's ability to provide Covid-19 tests.",
    "BALLARD TO FUNDRAISE FOR POTENTIAL WAYS AND MEANS CHAIR: A gaggle of lobbyists at Ballard Partners is set to host a fundraiser next month for the lawmaker who could become the next chair of the powerful House Ways and Means Committee if Republicans retake the majority, according to an invitation obtained by PI.",
    "… All of this is building a Republican fundraising machine and ecosystem that's heavily reliant on one person: Donald Trump.”\nTHE ANTITRUST BATTLE LINES ARE DRAWN: “Progressive organizations are going big on anti-monopoly messaging as the U.S. Chamber of Commerce defends Big Tech,” Axios’ Ashley Gold reports.",
    "— The firm, whose business boomed under the Trump administration thanks to Ballard’s friendship with the former president and which has picked up a number of Democratic and congressional lobbyists over the past year, snapped up Buchanan’s longtime chief of staff Dave Karvelas earlier this year.",
    "— Founder Brian Ballard, along with Ballard’s Sylvester Lukis, Pam Bondi, Dan McFaul, Justin Sayfie, Rebecca Benn and Jose Felix Diaz will throw the March 1 fundraiser for Rep. Vern Buchanan of Florida, currently the top Republican on the tax writing panel’s Health Subcommittee.",
    "Ballard to fundraise for potential Ways and Means chair\nBy CAITLIN OPRYSKO\n02/17/2022 05:23 PM EST\nPresented by\nWith Megan R. Wilson and Daniel Lippman\nPROGRAMMING NOTE: We’ll be off this Monday for Presidents Day but will be back in your inboxes on Tuesday, Feb. 22.",
    "— Jones Day is adding seven former Supreme Court clerks from the most recent full term to its offices in Chicago, New York, San Diego and Washington: James Burnham, Brendan Duffy, Harry Graver, Madeline Lansky, Jack Millman, Krista Perry Heckmann and David Phillips.",
    "IF YOU MISSED IT WEDNESDAY: “Former Interior Secretary Ryan Zinke violated ethics obligations in his land dealings with a Halliburton executive, the Interior Department’s internal watchdog said in a report released Wednesday.",
    "O’Sullivan was most recently director of government affairs at the drug wholesaler AmerisourceBergen, where she developed and implemented the company's legislative agenda and helped build AmerisourceBergen’s employee PAC.",
    "The report from the department’s inspector general confirms a series of issues POLITICO brought to light in 2018 during Zinke’s tenure as former President Donald Trump’s Interior secretary,” our Ben Lefebvre reports.",
    "— Tusk Strategies is launching a dedicated transportation and infrastructure practice with a focus on emerging mobility themes like electric vehicles, autonomous transit and vehicle communications.",
    "— Third Way senior political analyst David de la Fuente is leaving to help run the DCCC’s Independent Expenditure, and director of education Tamara Hiler will move to Denver to drive Colorado Gov.",
    "The appeals frequently rely on hard-sell tactics, such as questionable pledges that donations will be matched up to some multiple — tactics that have drawn the scrutiny of the Justice Department.",
    "The immense volume and frantic tone of Trump fundraising appeals are making it extremely difficult for other candidates seeking GOP small-dollar support to break through, operatives said.",
    "She was previously a senior official at the Trump-era HHS, serving first as assistant secretary for public affairs and then as deputy chief of staff for operations and strategy.",
    "TRUEPILL BRINGS ON K STREET HELP: Truepill, an online pharmacy, diagnostics and telehealth company, has brought on its first lobbying firm, TCH Group, Megan R. Wilson reports.",
    "Suggested contributions begin at $500 per individual or $2,000 to attend, per the invitation, and go up to $1,500 per individual or $3,000 per PAC to be named a co-host.",
    "Prior to that, she worked for Roberti Global, assisting corporate clients in the health care, energy, transportation, telecommunications and finance sectors.",
    "While the Capitol has reopened to guests since the onset of the pandemic and last year’s insurrection, the building has still not reopened to the public.",
    "— Judy Stecker has joined Hill+Knowlton Strategies as senior vice president and U.S. health care media and public affairs lead, Morning Pulse reports.",
    "— Mark Simakovsky has joined U.S. Agency for International Development as a deputy assistant administrator in the Bureau for Europe and Eurasia.",
    "“Some offices remain entirely remote, while others are limiting meeting size to only five constituents at a time, with the burden of an escort.",
    "The inspector general concluded Zinke did not comply with obligations in his ethics agreement, recusal memorandum and accompanying documents.",
    "She spent the past seven years as senior foreign policy adviser for Kaine and is an alum of the Obama NSC and the State Department.",
    "Maggie Hassan (D-N.H.) and Mark Kelly (D-Ariz.), two of the Democratic caucus’ most vulnerable senators, has long odds for passage.",
    "Jobs Report\n— Manica Noziglia has been named vice president of Washington operations for General Atomics Electromagnetic Systems.",
    "She was previously a senior vice president, and is an Environmental Defense Fund and Democratic National Convention alum.",
    "— “The former president's decision to bombard donors with numerous daily emails and texts is sucking up record sums.",
    "— Disclosure forms suggest the work could broaden, also mentioning \"affordable prescription drugs\" and \"telehealth.\"",
    "Truepill helps fulfill prescriptions for companies like Hims & Hers, Nurx and the Mark Cuban Cost Plus Drug Company.",
    "She also led external outreach for Operation Warp Speed and the health department’s Covid response work.",
    "— “Constituents face obstacles to meeting with their elected representatives,” Nussle writes.",
    "— Brian Hale is joining FTI Consulting as a managing director in the cybersecurity practice.",
    "Beth DeFalco will lead the group’s communications, marketing and public relations efforts.",
    "— Nicole Porreca is joining Boeing as director for international operations and policy.",
    "INVARIANT ADDS 1: Ashley O’Sullivan has joined Invariant’s government relations team.",
    "— A proposed bill to temporarily eliminate the 18.4 cents-per-gallon levy from Sens.",
    "He previously was assistant director in the Office of Public Affairs at the FBI.",
    "The tactics and strategies they use are not sustainable,’ one strategist said.",
    "He was previously senior vice president at Beacon Global Strategies.",
    "Henry Greenidge and Seth Webb will co-lead the new practice.",
    "— Adrienne Cooper has been promoted to partner at Pivot.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "presidential campaign and for the Justice Democrats.",
    "Jared Polis’ education policy, Playbook reports.",
    "Good afternoon and welcome to PI.",
    "Send tips: coprysko@politico.com.",
    "‘It's a massive issue.",
    "..."
  ]
}