{
  "id": 493,
  "mediaId": 2649,
  "date": "2022-04-20",
  "headline": "QAnon figure Ron Watkins gave a $95,000 loan to his House campaign in Arizona",
  "image": "https://cdn1.opensecrets.org/news/wp-content/uploads/2022/04/21154538/Optimized-GettyImages-1297805096-1-e1650570361702.jpg",
  "link": "https://www.opensecrets.org/news/2022/04/qanon-figure-ron-watkins-gave-a-95000-loan-to-his-house-campaign-in-arizona",
  "mediaOutlet": "opensecrets.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Gavin",
  "authorUrl": "https://www.opensecrets.org/news/author/wgavincrp-org/",
  "termIds": [
    2201,
    2486,
    4141,
    4459,
    4802,
    860,
    878,
    4830
  ],
  "sentences": [
    "Naumovski is the founder of marketing firm Raww Digital and Resist the Mainstream, which describes itself as “a media company for people who have lost trust in the mainstream media.”\nOther contributions to Watkins’ campaign include $2,222 from Jeffrey Walker, the founder of an Arizona pool cleaning company, and $1,000 from Avery Kramer, who recently became the chief operating officer of biotech research company Symbrosia.",
    "In October 2021, Watkins registered to run in the 1st Congressional District of Arizona, which is currently represented by Rep. Tom O’Halleran (D-Ariz.), but later amended his candidacy to run in the 2nd Congressional District of Arizona after new congressional maps were approved in the state.",
    "Watkins’ loan came just four days after his campaign amended a campaign finance report to include over $20,000 in funds that it originally failed to disclose, and one day after the Federal Election Commission sent a letter asking Watkins to disclose the source of those funds before May 2.",
    "Teams of forensic linguists found that Watkins played a role in helping write 8kun posts from “Q,” an anonymous poster who claimed to be a high-ranking government official with insider knowledge of former President Donald Trump’s White House, as early as 2018.",
    "The founder and former CEO of PIN, Joe Oltmann, has been described as “influential in stoking election conspiracy claims” and was nominated by Colorado Republicans as a gubernatorial candidate earlier this month.",
    "Watkins’ campaign funding\nWatkins raised $83,000 between January and March 2022, about $20,000 less than the the campaign reported as operating expenditures, according to FEC filings.",
    "Ron Watkins, a central figure in the QAnon conspiracy movement currently running for Congress in Arizona as a Republican, reported making a $95,000 loan to his campaign on March 29.",
    "Only 11 of the about 70 contributions to the campaign in the first quarter of 2022, including contributions from Watkins and Walker, are from donors with Arizona addresses.",
    "In February, Watkins’ campaign made a $500 contribution to Citizens for Gail Golec, Maricopa County Board of Supervisors candidate Gail Golec’s political action committee.",
    "The donations came in November and December 2021, shortly after Watkins asked his 423,000 followers on the messaging app Telegram to donate Bitcoin to the campaign.",
    "Watkins’ father Jim Watkins, best known for operating 8kun and supporting QAnon, made a $2,354 donation to the campaign described as “T-shirts” in October 2021.",
    "The theory, which draws from other debunked conspiracy theories such as “Pizzagate,” and has been linked to kidnapping schemes and the Jan. 6 insurrection.",
    "Golec is a noted conspiracy theorist and self-proclaimed citizen journalist who gave up her job as a realtor to investigate election fraud full-time.",
    "He declined the nomination after endorsing two election-deniers, state Rep. Ron Hanks and Mesa County Clerk Tina Peters, for statewide offices.",
    "Outside of the loan, the largest reported contribution to Watkins’ campaign in the first quarter of 2022 was $3,127 from Rumen Naumovski.",
    "Rep. Ann Kirkpatrick (D-Ariz.), who currently represents the 2nd district, announced her retirement ahead of this year’s redistricting.",
    "The campaign ended the first quarter of 2022 with $100,257 cash on hand — all but about $5,000 came from Watkins’ personal loan.",
    "The Watkins campaign’s fundraising remains far behind other contenders for Arizona’s 2nd District congressional seat.",
    "Peters, who was recently indicted on criminal election tampering charges, is running for Colorado secretary of state.",
    "Republican candidate and former Navy SEAL Eli Crane raised $$647,000 in the quarter, and has $483,000 cash on hand.",
    "The campaign has relied primarily on out-of-state money and drew only three donors from Arizona in 2021.",
    "The Cook Political Report rates the district as “likely Republican,” despite its Democratic incumbent.",
    "Hanks has previously touted his attendance at the Jan. 6 insurrection to show his loyalty to Trump.",
    "The Watkins campaign reported receiving two separate cryptocurrency contributions, both in Bitcoin.",
    "O’Halleran raised $578,000 in the first quarter, and ended March with $1.7 million cash on hand.",
    "Watkins’ campaign paid PIN Business Network over $5,000 for an “email blast” in January.",
    "Read more OpenSecrets News & Analysis: Campaign finance · Congress · Election 2022",
    "QAnon is an alt-right conspiracy theory that began on 4chan message boards.",
    "Republican primary elections will take place in Arizona on Aug. 2."
  ]
}