{
  "id": 5572,
  "mediaId": 2614,
  "date": "2022-02-11",
  "headline": "Chicken Hawks Flapping On Ukraine",
  "image": "https://www.lifezette.com/wp-content/uploads/2021/08/2021.08.29-06.13-lifezette-612bce448bc3f.jpg",
  "link": "https://www.lifezette.com/2022/02/chicken-hawks-flapping-on-ukraine/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SteveGruber.com",
  "authorUrl": "https://www.lifezette.com/author/sgruber/",
  "termIds": [
    1431,
    1672,
    2299,
    2558,
    3104,
    4426,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "Aside from another definition that is not our subject today, a chicken hawk is defined in military circles as someone who talks a big game when it comes to military deployments, but who never wore the uniform.",
    "” Thus, war whoops would be a whole lot more convincing coming from someone who attended not a conference at the Metropolitan Club, but who once attended basic training.",
    "That is a steep though tolerable price to pay to rid the Oval Office, and perhaps some of Congress, of chicken hawks once and for all.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "One Republican senator, who shall go nameless lest I lose my source, was a fine state Attorney General but now thinks he’s Patton.",
    "There are members of Congress like Joni Ernst, Tom Cotton, Dan Crenshaw, and others who know what it means to wear the uniform.",
    "Let’s hope that senile bumbler doesn’t get us into a shooting war because he forgot to take his meds one afternoon.",
    "As chicken hawkery is nothing new, it would have prevented some presidents who ought to have been prevented.",
    "One of those attendees called the Ukrainian situation “fun.” Neither the speaker or the funster has served.",
    "When I went to Basic in 1980, I don’t remember my Vietnam vet drill sergeants being particularly hawkish.",
    "Republicans want to look tough, Democrats loathe Russia (which is something relatively new for them).",
    "Simply pass an amendment that to become Commander in Chief you must have served in the US military.",
    "But we still get Teddy Roosevelt, Harry Truman, Ike, Kennedy, Nixon, Ford, Reagan, and both Bushes.",
    "Now, it’s not like perpetual civilians can’t speak out on national security and the military.",
    "But, as Margaret Thatcher told a liberal Cabinet member, “Stop spending someone else’s money.",
    "Republican congressional candidates like Derrick Van Orden and Eli Crane know as well.",
    "Okay granted, we lose my favorite president, Cal Coolidge, and we keep Jimmy Carter.",
    "Their mouths are writing checks they have refused to honor in their own lives.",
    "Colleagues are hearing chicken hawks squawk at national security conferences.",
    "They are strong on national security and counsel smart moves on Ukraine.",
    "Apparently, their precious tails are too valuable to risk in uniform.",
    "One DC analyst went so far as to call for NATO air strikes on Russia.",
    "But as far as I know, none of them advocate bombing Moscow just yet.",
    "It originally appeared in SteveGruber.com and is used by permission.",
    "I’m personally hearing it from both sides of the aisle on the Hill.",
    "the loudest, I would say there is a credibility gap present there.",
    "However, there is a constitutional remedy for a guy like Biden.",
    "When it comes to Ukraine we are seeing a lot of chicken hawks.",
    "This piece was written by David Kamioner on February 11, 2022.",
    "As for the chicken hawks who are now crowing (do hawks crow?)",
    "Think, no Biden, Obama, Clinton, and certain others.",
    "They had seen too much to blithely want more.",
    "Of course, never served in the military.",
    "Decent men all and passable presidents.",
    "But attendees gave her applause.",
    "And behind the Resolute Desk?",
    "That is batguano insane.",
    "Uh huh, right."
  ]
}