{
  "id": 5988,
  "mediaId": 2594,
  "date": "2022-02-03",
  "headline": "Alleged QAnon mastermind’s fundraising filing shows he raised just $33,000",
  "image": "https://static.independent.co.uk/2022/02/03/18/newFile-4.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/qanon-campaign-fundraiser-finance-b2007200.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graig Graziosi",
  "authorUrl": "https://www.independent.co.uk/author/graig-graziosi",
  "termIds": [
    3541,
    3975,
    860,
    4830,
    5244
  ],
  "sentences": [
    "It also does not appear that Mr Watkins has any real support on the ground in Arizona; of his donations, only one was made by someone who actually lives in the state, and none are less than $250, suggesting at least some of his donations are from organisations rather than individuals, who tend to give in smaller amounts.",
    "Ms Rogers is far-right, extremely supportive of former President Donald Trump, and was a major driving force behind the state's catastrophic Maricopa County 2020 election audit, which once again proved that Joe Biden won the state.",
    "While staying on sites like Telegram and Gab allow Mr Watkins to target the people who are most likely to recognise him, it closes him off from the broader base of Republicans who still use the larger US social media sites.",
    "Back in October when he filed for his candidacy, Mr Watkins told Vice News that he was \"going to raise at least a million dollars, and I'm going to win so that the people have a real voice in Washington DC”.",
    "If the name \"Ron Watkins\" means nothing to you, you apparently aren't alone, at least judging by the meager war chest the alleged QAnon hoaxer and congressional candidate has managed to scrape together.",
    "Most of his campaigning has been done on Telegram, a social chat app where QAnon adherents and other conservatives have migrated after being banned from sites like Twitter and Facebook.",
    "Mr Watkins insisted to The Daily Beast in October that his donations were exceeding $1,000 daily, but - based on his campaign finance report - that does not appear to be accurate.",
    "Of course the border is huge and there is no flood of people crossing it at all hours - contrary to what some conservatives believe - and his stunt was ultimately unsuccessful.",
    "The Daily Beast reports that Mr Watkins, with a small but extremely invested internet following, has been struggling to raise funds in his bid to join the federal legislature.",
    "His first campaign finance filling showed that he has only raised approximately $33,000, some of which was in the form of a loan from his father, 8kun operator Jim Watkins.",
    "Because of her populist conservative bonafides, Ms Rogers is extremely popular among the group of fringe right-wingers that Mr Watkins hopes to draw into his campaign.",
    "Further, his association with QAnon is only appealing to a small segment of the Republican party, and may work against him among the less fringe members of the base.",
    "The week Mr Watkins attended a Scottsdale Unified School District board meeting - he has no children - and railed against Communists trying to brain wash children.",
    "Last month, Mr Watkins travelled to a section of Mr Trump's border wall in the middle of the night, hoping to spot illegal immigrants trying to cross the border.",
    "Mr Watkins is the former administrator of 8kun, a volatile image board where regular internet users rub shoulders with white nationalists and other extremists.",
    "He was asked to stop speaking after two minutes because he was electioneering during a time intended for legitimate discussion of school-related business.",
    "Mr Watkins only recently moved to Arizona after growing up in Washington and living for many years in the Philippines where he helped to administer 8kun.",
    "However, he recently tried to throw her under the bus on Gab, insinuating she was covering up for the failure of the 2020 Arizona audit.",
    "The entire episode may have been a desperate attempt to draw attention to his campaign, a tactic Mr Watkins has employed in the past.",
    "She hit back, calling him a \"weirdo\" and mocking him for failing to bring in enough donations to field a serious congressional run.",
    "Ms Rogers said she would enact a \"ceasefire\" and told her supporters not to trust her or Mr Watkins, but to \"trust Jesus.\"",
    "While $33,000 might seem like a lot, it's not the kind of money that can field a successful congressional campaign.",
    "The front runner in the Arizona race is currently former Navy SEAL Eli Crane, who has already raised over $800,000.",
    "He has also started picking fights with popular right-wing Arizona politicians, namely state Senator Wendy Rogers.",
    "Eventually the two extremists made up after Mr Watkins' followers insisted he was actually a good-faith actor.",
    "Mr Watkins is trailing his GOP primary rivals, who have raised 10 to 20 times the amount that he has.",
    "There are numerous reasons explaining why Mr Watkins' campaign is faltering.",
    "The elder Watkins is another possible true identity of Q.",
    "Oh, and he might be Q from the QAnon conspiracy theory.",
    "First, he's been accused of being a carpetbagger.",
    "He is also running for Congress in Arizona."
  ]
}