{
  "id": 6589,
  "mediaId": 2748,
  "date": "2022-01-20",
  "headline": "Six Ex-Navy SEALs Running for Congress Unite to Take on 'Grave Threat' Nancy Pelosi",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Ew_8f2MoawsbgTIz0Adcbaqjg0j8yahzkDHzEjxuzrg6ziMsBDAL6PqdoACGkX69iahJmwSjj1pt1cUDFSUrX38t-4J8j5Dm0Sreg-D9wfB9diPug=w1200-h630-n-k-no-nu",
  "link": "http://www.stationgossip.com/2022/01/six-ex-navy-seals-running-for-congress.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STATION GOSSIP",
  "authorUrl": "https://www.blogger.com/profile/14290129071922737076",
  "termIds": [
    2201,
    2371,
    2599,
    2852,
    3975,
    4466,
    4777,
    1124,
    1169
  ],
  "sentences": [
    "The Senate is in the news right now, of course, thanks to Democrats Joe Manchin of West Virginia and Kyrsten Sinema of Arizona thwarting the still-possible takeover of state elections by the federal government, but it’s important to remember that things would never have gotten to this pass if it weren’t for Pelosi’s wishes – and the iron control she exerts over her party’s caucus in the House.",
    "According to the SEAL PAC website, they are:\nEli Crane is running in Arizona’s 1st Congressional District; Brady Duke in Florida’s 7th Congressional District; Ed Thelander in Maine’s 1st Congressional District; Ryan Zinke in Montana’s 1st Congressional District; Morgan Luttrell, in Texas’ 8th Congressional District; and Derrick Van Orden in Wisconsin’s 3rd Congressional District.",
    "Zinke, the chairman of SEAL PAC and a former SEAL Team 6 commander, served as interior secretary during the Trump administration but left in 2018 amid a host of allegations from Democrats who took control of the House in the 2018 midterms (the midterms that returned Pelosi to the speaker’s chair).",
    "As much as President Joe Biden has disgraced himself and his country with his miserable handling of world affairs as well as the economy at home, Pelosi and Senate Majority Leader Chuck Schumer have been doing their best to destroy the country from within.",
    "The 30-second ad makes the point perfectly, showcasing the six former SEALs and the congressional districts they’re campaigning in, followed by a picture of Nancy Pelosi:\n“They took a blood oath to defend America,” the narrator intones.",
    "It’s Pelosi who used the cover of the pandemic to push monstrous spending bills through Congress, and it’s Pelosi who’s the legislative muscle behind the progressive push to “reform” American elections in Democrats’ favor.",
    "Considering he called the attacks against him “vicious and politically driven,” it’s a good bet Zinke is looking at settling a personal and political score with Pelosi.",
    "And judging by an ad the group released Tuesday through a political action committee, they want voters to know the real objective:\nUnseating House Speaker Nancy Pelosi.",
    "“Join them.”\nIn a country that’s witnessed what Democratic control over the White House and both houses of Congress means, that’s a message bound to hit home.",
    "And now, six combat veterans of one of the most celebrated sections of the country’s military are putting her name in their political crosshairs.",
    "It’s Pelosi who was the most viciously visible figure of the “resistance” during President Donald Trump’s years in power.",
    "Former Navy SEALs, all with combat experience, are running for the House of Representatives in the November midterms.",
    "This cadre of combat veterans gunning for the potentially outgoing Nancy Pelosi is likely to make it much worse.",
    "“Now they have one grave threat left to defeat,” come the words accompanying Pelosi’s picture.",
    "These former Navy SEALs have protected America from enemies all over the world.",
    "By pretty much every measure, the upcoming midterms look bad for the Democrats.",
    "They know that our enemies are no match for their strength and their courage.",
    "It was Pelosi who orchestrated two sham impeachment attempts against Trump.",
    "They’re running six separate campaigns, but they are aiming at one target.",
    "“They understand that the only easy day was yesterday."
  ]
}