{
  "id": 7227,
  "mediaId": 2861,
  "date": "2022-01-24",
  "headline": "Nasty Nancy Is On The Hot Seat After Six Retired Navy SEALs Launch Congressional Bids to End Her Reign",
  "image": "http://en-volve.com/wp-content/uploads/2022/01/maxresdefault-7.jpg",
  "link": "https://en-volve.com/2022/01/24/six-retired-navy-seals-launch-congressional-bids-to-stop-pelosi/",
  "mediaOutlet": "en-volve.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "A.M. Smith, You Are Going To Send Email To, Move Comment",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Now they have one grave threat left.”\n\nThe ad then shows a photo of Pelosi, stating, “Join them.”\n\nLuttrell’s campaign website says his priorities, if elected, would be to “stand with police and veterans,” “stop all voter fraud,” “defend private property,” “increase our cybersecurity,” and ultimately “take the House back.”\n\nOn Duke’s campaign website, the conservative slammed “our nation’s politicians” for compromising “too much,” leading to “radical policies that ruin America.”\n\n“I’ve stared danger in the face in war, and I will never back down from a fight,” Duke added.",
    "The six SEALs, who include Morgan Luttrell of Texas’ 8th Congressional District, Brady Duke of Florida’s 7th District, Eli Crane of Arizona’s 2nd District, Derrick Van Orden of Wisconsin’s 3rd District, Ed Thelander of Maine’s 1st District, and Ryan Zinke of Montana’s 1st District, said in a new ad that Pelosi is the “one grave threat” they still face.",
    "I’ll stand up to the liberal elite in Congress and fight to stop the reckless spending so our families…https://t.co/ygS9eQ3aRb — Brady Duke (@BradyDukeFL) December 16, 2021\n\nRead original article at Headline USA",
    "Nancy Pelosi and Stephanie Murphy have spent trillions to check off Biden’s liberal Christmas wish list, unleashing record inflation on our economy.",
    "Six veteran Navy SEALs are running for Congress in separate races with the same goal in mind: deposing House Speaker Nancy Pelosi, D-Calif.",
    "These former Navy SEALs have protected America from enemies all over the world.",
    "They know that our enemies are no match for their strength and their courage.",
    "“They took a blood oath to protect America,” the ad’s narrator says.",
    "“They understand that the only easy day was yesterday."
  ]
}