{
  "id": 7228,
  "mediaId": 2896,
  "date": "2022-01-23",
  "headline": "WATCH: Navy SEALs Decimate Pelosi In Epic Video",
  "image": "https://100percentfedup.com/wp-content/uploads/2022/01/fisted-pelosi.jpeg",
  "link": "https://100percentfedup.com/watch-navy-seals-decimate-pelosi-in-epic-video/",
  "mediaOutlet": "100percentfedup.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "As SEAL PAC Chairmen, I take our mission very seriously and we are working to elect a conservative majority to Congress to get America headed in the right direction again.”\n\nAs Breitbart reported, “The ad features the following six SEAL veterans running in this year’s midterms: Morgan Luttrell (running in Texas’ eighth district), Brady Duke (running in Florida’s seventh district), Eli Crane (running in Arizona’s second district), Derrick Van Orden (running in Wisconsin’s third district), Ed Thelander (running in Maine’s first district), and Ryan Zinke (running in Montana’s first district).”\n\nThe PAC, SEAL PAC, supports conservative military veterans running for Congress.",
    "Speaking on that, one of the participants in the ad, Ryan Zinke, had this to say to Breitbart about the upcoming midterms and just how important they are for the future of the American nation:\n\n“The midterm elections will help determine the direction of our country.",
    "RINO cowards like Crenshaw and Cheney, not to mention the never-Trump leftists in disguise, would rather work with the left side of the aisle than fight and win the culture war and kick Pelosi off the throne that she certainly doesn’t deserve.",
    "She’s also a leftist radical that needs to be taken down if we’re to save the country from the predations of the socialists that would see this great land of bounty destroyed so that they can gain the level of control they so desire.",
    "It hits the nail on the head, demolishes the left, and finally expresses how real Americans actually feel about Pelosi and Co. She and her coterie of far-left wackjobs aren’t just opponents of our party.",
    "These former Navy SEALs have protected America from enemies all over the world.” Then, the narrator says “Now they have one grave threat left to defeat,” and a picture of Nasty Nancy Pelosi pops up.",
    "Luckily, however, a few Republicans just so happen to be real winners and real fighters: 6 Navy SEALs are being backed by a PAC and are working together to take down Nasty Nancy Pelosi.",
    "A guest post by Blue State Conservative\n\nNancy Pelosi isn’t just the wicked witch of the West, a stock trader, and a real estate investor.",
    "Speaker Nancy Pelosi and the Democrat House majority represent a threat to America and the Constitution that veterans fought to defend.",
    "Whereas others would sit silently and let leftists do their country harm, these 6 are putting Pelosi on notice.",
    "It’s chaired by Ryan Zinke, who’s also in the video and running for Congress in the upcoming midterms.",
    "Hopefully, these brave men and great patriots will be elected and deal with the Pelosi problem.",
    "At the very least, it’s encouraging that while the military has gone woke, these SEALs haven’t.",
    "Unfortunately, not all Republicans are cognizant of just how big the Pelosi problem is.",
    "They’re domestic enemies that need to be defeated if America is to be preserved.",
    "They know that our enemies are no match for their strength and their courage.",
    "SEAL PAC’s mission is to elect conservative military veterans to Congress.",
    "In it, a narration says “They took a blood oath to defend America.",
    "We have all taken a blood oath to defend the Constitution.",
    "They understand that the only easy day was yesterday.",
    "Watch them here:\n\nThe ad is truly epic.",
    "The stakes couldn’t be higher."
  ]
}