{
  "id": 2432,
  "mediaId": 2643,
  "date": "2022-02-09",
  "headline": "Big Government is a Constant Threat to Religious Liberty | Opinion",
  "image": "",
  "link": "https://www.newsweek.com/big-government-constant-threat-religious-liberty-opinion-1676915",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Mandel , Former state treasurer",
  "authorUrl": "",
  "termIds": [
    4116,
    191
  ],
  "sentences": [
    "The saddest part of this attack on religious liberty at BYU is that former BYU president Jeffrey R. Holland—a respected gentle giant with a PhD in American Studies from Yale—just a year ago gave a brilliant, compassionate speech about how to offer place for all, tolerance and love for all, while still upholding the standards of faith groups who stand on the ground of religious liberty.",
    "I would be outraged—as I'm sure the BYU community is, and parents across my home state of Ohio would be—if government bureaucrats sought to dictate which elements of our faith are allowed to be practiced and taught in my children's Orthodox Jewish school in Beachwood, Ohio, or at schools like Open Door Christian in Elyria, Ohio, or Cincinnati Hills Christian in Cincinnati.",
    "This makes virtually every religiously affiliated institution of higher learning in the country subject to the shifting winds of partisan politics—relatively unmolested under Republican administrations, but operating with a target on their backs when Democrats occupy the White House.",
    "They rightly understood that civil authority must remain completely separate from religion, because as soon as the two become intertwined, the government begins to make decisions about which aspects of Americans' spirituality to permit and which aspects to repress.",
    "BYU ostensibly enjoys numerous \"exemptions\" from federal law because of its status, but it's clear from the ongoing investigation into its internal rules and procedures that these exemptions are not worth the paper they're printed on.",
    "Unfortunately, many on the Left seem to think that the First Amendment's establishment clause offers a blank check to impose secular values on any religious institution that interacts with the federal government in any way.",
    "Since it's virtually impossible for them to operate without becoming entangled in the tentacles of the federal leviathan in some way, religious institutions are forced to operate with a sword of Damocles over their heads.",
    "According to the Left, receiving any kind of federal funding—even in the form of student aid awarded to individual students without the school's involvement—subjects institutions to the federal government's jurisdiction.",
    "We must reform our public education system so kids at both private and public schools get a great education that teaches core values, first principles and pride in being an American.",
    "The school has come under federal investigation by the Education Department's Office of Civil Rights (OCR) for alleged discrimination over its ban on \"homosexual behavior.\"",
    "The mere existence of the investigation is a form of bullying designed to coerce the school into moderating, if not abandoning, its adherence to core religious beliefs.",
    "Americans are a tolerant people—toleration is written into our founding documents, and takes pride of place in the highest law in the land, the U.S. Constitution.",
    "Recently, the godless Left set its sights on Brigham Young University (BYU), a private university affiliated with the Church of Jesus Christ of Latter-day Saints.",
    "Unfortunately, today public schools are more likely to host assaults on religious faith than to support the diversity of beliefs that America needs.",
    "But we should never tolerate the loss of our fundamental liberties, especially the right to freely practice the religion of our choice.",
    "What gives the federal government the right to poke its nose into the honor code of a private religious institution?",
    "We must fight for the religious liberty of every American or else our country will spiral into a secular wasteland.",
    "Freedom of religion means the government cannot force religious institutions to act against their core beliefs.",
    "They also understood that religious faith is vital to the character of any self-governing people.",
    "He also served two terms in the Ohio Legislature and two terms as State Treasurer of Ohio.",
    "It is one of about 1,400 schools currently under investigation by federal busybodies.",
    "Josh Mandel is a Marine Corps veteran who served two tours in Anbar Province, Iraq.",
    "That's not how our Founding Fathers intended this country to operate.",
    "The views expressed in this article are the writer's own.",
    "Josh is a candidate for U.S. Senate in Ohio.",
    "BYU is not alone."
  ]
}