{
  "id": 2660,
  "mediaId": 2688,
  "date": "2022-02-10",
  "headline": "Republican Mayor Argues Ice Fishing Leads To Prostitution",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-10-at-7.39.53-AM.png",
  "link": "https://talkingpointsmemo.com/morning-memo/republican-mayor-craig-shubert-ohio-hudson-ice-fishing-prostitution?utm_source=rss&utm_medium=rss&utm_campaign=republican-mayor-craig-shubert-ohio-hudson-ice-fishing-prostitution",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    3684,
    3246,
    2887,
    5145,
    4372,
    4466,
    1126
  ],
  "sentences": [
    "GOP Candidate Outraged About Not Being Allowed To Let Trans Kids Get Bullied\nRepublican Texas House candidate Shelley Luther, an ex-school teacher who is “not comfortable with the transgenders,” complained during a campaign event on Saturday about a time when she had a transgender student in her classroom and was told that “I couldn’t have kids laugh at them.”\nMust Read\n“‘Blue’ suburban moms are mobilizing to counter conservatives in fights over masks, book bans and diversity education” – The Washington Post\nObama To Speak To House Dems\nThe former president is slated to hold a private virtual meeting with the House Democratic caucus today and will have a keynote discussion with House Speaker Nancy Pelosi (D-CA), according to NBC News.",
    "MTG Sounds Alarm Over Pelosi’s Cold Spanish Soup Police State\nDuring an appearance on conservative outlet Real America yesterday, far-right Rep. Marjorie Taylor Greene (R-GA) railed against Pelosi’s “gazpacho police.”\nJust to clear things up, @RepMTG\nGazpacho: a vegetable-based Spanish cold soup\nGestapo: Nazi Germany's secret police pic.twitter.com/T9q76r706G\n— The Republican Accountability Project (@AccountableGOP) February 9, 2022\nDo you like Morning Memo?",
    "Axios described it as one of Trump’s “lapses in preserving government documents.”\nRNC Chair Responds To McConnell’s Pushback\nRepublican National Committee Chair Ronna McDaniel doubled down on the RNC’s censure of Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL) during a Fox News appearance on Wednesday after Senate Minority Leader Mitch McConnell (R-KY) firmly spoke out against the language in the measure.",
    "pic.twitter.com/YbvVgHZDNr\n— Josh Mandel (@JoshMandelOhio) October 19, 2021\nKansas GOP’s Second Shot At Map Veto Override Succeeds\nAfter initially failing on Monday, Kansas’ GOP-controlled legislature had the votes on Wednesday and Tuesday to form supermajorities in the state Senate and House, respectively, to override Democratic Gov.",
    "The lawmakers argued that because the ERA missed the 1982 deadline to get 38 states to ratify it (Virginia was the 38th state to ratify it in 2020), the amendment is “no longer pending before them.”\nThe Republican senators also want the the acting Archivist who’ll replace Ferriero to make the same commitment, according to the letter.",
    "Trump Took Potentially Classified Docs To Mar-A-Lago\nThe National Archives and Records Administration (NARA) found that some of the White House records that the ex-president improperly took to his Mar-A-Lago Florida resort may have been classified, the New York Times reports.",
    "pic.twitter.com/9N0R2tVri6\n— Amanda Weinstein (@ProfWeinstein) February 9, 2022\nThis guy was also endorsed by GOP Ohio Senate candidate/Trump wannabe Josh Mandel last year for having a meltdown over a textbook’s writing prompts:\nThis is Mayor Craig Shubert of Hudson, Ohio.",
    "That’s what prompted the National Archives to reportedly ask the DOJ to investigate Trump’s handling of White House documents, according to the Times — which included the ex-president taking at least 15 boxes of them to his resort or tearing them into itty-bitty pieces.",
    "Sure, ice fishing sounds good on paper, Shubert argued, but what about that well-known pipeline that goes from ice fishing to ice fishing “shanties,” which inevitably lead to ice fishing prostitution in said shanties, aka dens of sin where prostitution happens on ice?",
    "In potentially related (and extremely gross) news, Trump’s White House staffers occasionally found wads of printed paper clogging up toilets, according to an excerpt from New York Times reporter Maggie Haberman’s upcoming book reported by Axios.",
    "Bloomberg Named Pentagon Board Chair For Some Reason\nPentagon Press Secretary John Kirby announced on Wednesday that Defense Secretary Lloyd Austin had tapped the former New York City mayor to chair the…Defense Innovation Board???",
    "A Frozen Slippery Slope\nGOP Mayor Craig Shubert of Hudson, Ohio served up what promises to be the Brain Galaxy Take of the Week during a city council debate over whether to allow ice fishing at a local park on Tuesday.",
    "Rob Portman (R-OH), Ron Johnson (R-WI) and Mitt Romney (R-UT) wrote a letter dated Wednesday to National Archivist David Ferriero asking him to commit to not certifying the ERA before he retires in April.",
    "Disagreement in the GOP is “welcome,” McDaniel claimed in response to McConnell’s criticism that the RNC shouldn’t be singling out Cheney and Kinzinger or any Republican over their beliefs.",
    "Under the proposed map, Rep. Sharice Davids (D-KS) – the one Kansas Democrat in Congress – would face a tougher chance of holding onto her seat, according to the Kansas City Star.",
    "He’s the Patriot who told the school board that they had the choice of resigning or facing criminal charges for teaching child pornography to students.",
    "That lawmaker, who’s also a doctor, has admitted to prescribing ivermectin and is also under investigation by the Kansas State Board of Healing Arts.",
    "One of them switched after a separate Senate committee passed a measure requiring pharmacists to fill prescriptions for ivermectin.",
    "The Justice Department told NARA to have its inspector general’s office (OIG) look into it, the Times reports.",
    "The two House Republicans went “a step too far” by joining the House Jan. 6 Committee, the GOP chair argued.",
    "The staffers reportedly believed the then-president had tried to flush pieces of paper.",
    "The point is, horse paste apparently made it into a fight over gerrymandering somehow.",
    "Two Republican senators switched to “yes” on Tuesday after previously voting no.",
    "*\n*Same guy who thinks creative writing classes are child pornography.",
    "Laura Kelly’s veto of the district map drawn by Republicans.",
    "Hudson mayor thinks ice fishing leads to prostitution!",
    "Urge Archivist To Not Certify Equal Rights Act\nSens.",
    "It’s unclear if the OIG has done so.",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "Put your poles away boys!",
    "A lot of things happened.",
    "Let us know!",
    "GOP Sens.",
    "HERO."
  ]
}