{
  "id": 3538,
  "mediaId": 2524,
  "date": "2022-01-28",
  "headline": "Josh Mandel is the most idiotic robot running for Senate in Ohio, making him GQP's frontrunner",
  "image": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/01/josh.jpg?fit=1200%2C664&ssl=1",
  "link": "https://boingboing.net/2022/01/28/josh-mandel-is-the-most-idiotic-robot-running-for-senate-in-ohio-making-him-gqps-frontrunner.html?utm_source=rss&utm_medium=rss&utm_campaign=josh-mandel-is-the-most-idiotic-robot-running-for-senate-in-ohio-making-him-gqps-frontrunner",
  "mediaOutlet": "Boing Boing",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carla Sinclair",
  "authorUrl": "https://boingboing.net/author/carlasinclair",
  "termIds": [
    0
  ],
  "sentences": [
    "We're sure you shower daily and brush your chimp-like chompers twice as much, but sometimes getting a good clean feel comes from a much different…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "He dug in his heels, arguing that he had every right to spew his toxic views — even in a school board district that he does not live in.…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "Work, having a social life, and going to the gym — it can…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "His recycled platitudes are as brainless and stale as they come: coronavirus is a bio-weapon, America was founded only on Judeo-Christian values, he is pro-God, he is pro-gun, he is pro-Trump.",
    "Sheriffs in Ohio asked US Senate candidate, Josh Mandel, to leave a school board meeting on Monday after he took the mic to bash transgender students.",
    "From sparkling mineral water sourced in the Alps to cans of Canada Dry seltzer, carbonated water comes in many…",
    "Alright, admit it, if you're like 75% of Americans, you probably have a caffeine addiction.",
    "Yep, the same ol' same ol' big lies, bluster, and complete ignorance of the constitution.",
    "Carbonated water has been the water connoisseur's go-to for quite some time.",
    "Ohio Senate candidate Josh Mandel brings nothing new to the GQP funhouse.",
    "A perfect frontrunner for Ohio's 2022 Republican primaries.",
    "\"I believe the 2020 election was stolen from Donald J.",
    "Possibly, even unhygienic?",
    "Feeling a little icky?",
    "Who could blame you?",
    "Trump.\"",
    "Dirty?"
  ]
}