{
  "id": 3769,
  "mediaId": 2741,
  "date": "2022-01-21",
  "headline": "Eric Adams Pulls Crypto-Paycheck Stunt Hours Before Bitcoin Crash",
  "image": "https://media.vanityfair.com/photos/61eb2fede56bd126a82a7563/16:9/w_1280,c_limit/GettyImages-1237705338.jpg",
  "link": "https://www.vanityfair.com/news/2022/01/eric-adams-paycheck-bitcoin-crash",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Ecarma",
  "authorUrl": "https://www.vanityfair.com/contributor/caleb-ecarma",
  "termIds": [
    0
  ],
  "sentences": [
    "In December, Florida governor Ron DeSantis announced he is exploring a program that would allow businesses to pay the state in cryptocurrency, stating, “Our view as the state government is this is something that we welcome and we want to make sure that the state government is crypto-friendly.”\n— The Life and Death of Rosanne Boyland, a Capitol Rioter\n— Ghislaine Maxwell’s Guilty Verdict Comes Into Question\n— Kimberly Guilfoyle’s Leaked Texts Aren’t Doing the Trumps Any Favors\n— Why Did Team Biden Reject a Proposal for “Free Rapid Tests for the Holidays”?",
    "While Adams has framed his paycheck publicity stunt as a way to showcase New York as “the center of cryptocurrency and other financial innovations,” his interest in crypto may also be related to his close relationship with crypto entrepreneur Brock Pierce, who reportedly gave Adams a ride to Puerto Rico—its own kind of crypto haven—on his private jet in November.",
    "— Melania Trump’s 2022 Resolution: Grift Like There’s No Tomorrow\n— Elizabeth Holmes’s Guilty Verdict Won’t Change Silicon Valley\n— TV Star Sarah Wynter’s Battle With Postpartum Psychosis\n— From the Archive: Inside the Chaotic Final Days of Theranos\n— Not a subscriber?",
    "As for New York’s chief crypto enthusiast, Adams isn’t exactly “taking his paychecks in Bitcoin.” Instead, the mayor said that he used Coinbase, a cryptocurrency exchange platform, to convert the funds from his check into Bitcoin and Ethereum.",
    "This latest crash, which resulted in a market loss of more than $205 billion, was partly triggered by the news that Russia’s central bank is weighing a nationwide ban on the use and mining of cryptocurrencies.",
    "“In New York we always go big, so I’m going to take my first THREE paychecks in Bitcoin when I become mayor,” Adams tweeted after Suarez stated that “100%” of his next check would be doled out in Bitcoin.",
    "A few weeks ago, Republican congressional candidate Josh Mandel listed his love of Bitcoin beside his commitment to the “Almighty God” and his family, while outlining the issues he represents.",
    "In November, New York City mayor Eric Adams found himself in what one might call a pissing contest with Miami mayor Francis Suarez, over who would accept more of his salary in cryptocurrency.",
    "“Adams isn’t being ‘paid in Bitcoin’ any more than using his paycheck to buy Shake Shack equals being ‘paid in cheeseburgers,’” explained tech executive Anil Dash in a Thursday tweet.",
    "Hours after his announcement, both Bitcoin and Ethereum fell off a cliff, causing the mayor’s crypto check to lose about 10% of its value in the span of a single day.",
    "Just wait!” On Thursday, Adams, who was sworn in on New Year’s Day, informed New Yorkers that he had followed through with his commitment.",
    "Unfortunately for hizzoner, he chose a particularly bad time to put all of his eggs into the internet’s favorite speculative market.",
    "Despite experiencing relative gains over the past two years, the crypto market has proven especially volatile of late.",
    "“NYC is going to be the center of the cryptocurrency industry and other fast-growing, innovative industries!",
    "In September, the value of the world’s cryptocurrencies dropped roughly 9% after a Chinese crackdown.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "I took my first check in Bitcoin and Ethereum,” he said in a clip shared to Twitter.",
    "I promise we will be,” tweeted Mandel, who is running for a Senate seat in Ohio.",
    "Adams isn’t the only U.S. politician to recently dive into the cryptoverse.",
    "“Ohio must be a pro-God, pro-family, pro-bitcoin state.",
    "(Adams had said he paid his own way.)",
    "“Promise made, promise kept."
  ]
}