{
  "id": 4270,
  "mediaId": 2547,
  "date": "2022-01-26",
  "headline": "Jim Acosta Mocks The Cowardly GOP Of 2022",
  "image": "https://crooksandliars.com/files/mediaposters/2022/01/49406.jpg",
  "link": "https://crooksandliars.com/2022/01/jim-acosta-mocks-cowardly-gop-2022",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Painter",
  "authorUrl": "https://crooksandliars.com/team/red-painter",
  "termIds": [
    0
  ],
  "sentences": [
    "On Tuesday he had a great segment on the Mitch McConnell's focus on \"honoring the election results\", with a quote of McConnell saying \"it's important for candidates to remember we need to respect the results of our Democratic process unless the court system demonstrates that some significant fraud occurred that would change the outcome.\"",
    "But by far my favorite part was Jim completely mocking Mo Brooks, pointing out that \"McConnell declined to call out Alabama Republican Congressman Mo Brooks who was running for the Senate in that state after infamously appearing at the January 6th Stop The Steal rally.\"",
    "Then he showed a creepy clip or talking point spewing robot man, Josh Mandel, a GOP candidate from Ohio who repeated this right wing talking point: \"We need to get rid of this January 6th commission and replace it with a November 3rd commission.",
    "I adore Jim Acosta and with his week long stint hosting the now empty 9pm slot, I am getting a full 7 days straight of his wit, dark humor and scathing takedowns of the right and their bonkers right wing media mouthpieces.",
    "Mocking McConnell some more with an unfortunate visual of Trump coming out of a bottle \"dressed up like Barbara Eden like I Dream of Jeannie either that or the Trump toothpaste coming out of the tube.",
    "And finally, the perfect Congressman to pull in the rear, Ted Cruz and his on air self-flagellation with Tucker Carlson after calling the January 6th rioters \"terrorists\" and then walking it back.",
    "Ending this amazing segment, Jim reminded the Republican Party that while \"it's sring time for Trumpism and our Republican Party while our Democracy stuck in a winter of discontent.",
    "But then Jim stuck the knife in, pointing out that although McConnell blamed Trump for the January 6th insurrection he still voted to acquit him during the impeachment.",
    "Jim pointed out that he \"tried catching up with Mo Brooks last year, in case you missed it, but he took no names and kicked no ass...there he goes.",
    "If they want to focus on something how about focus on the election cheating by the Democrats?\"",
    "Sure, we're ready to respect the results of the Democratic process, but you guys go first.\"",
    "And some bonkers videos of GOP candidates spewing The Big Lie about the \"rigged\" election.",
    "Because the truth is not allowed on FOX or any right wing media outlets.",
    "I am not exaggerating when I tell you that I was falling over laughing.",
    "Lots of talking out of both sides of your mouth there, turtle boy.",
    "This January 6th commission is a total sham and waste of time.",
    "Everyone has embraced the Trump lies about the 2020 election.",
    "Who would buy Trump toothpaste?",
    "And I am HERE.",
    "Just brutal.",
    "bye-bye.\"",
    "Indeed.",
    "Gross.",
    "FOR.",
    "IT."
  ]
}