{
  "id": 5010,
  "mediaId": 8313,
  "date": "2022-04-20",
  "headline": "Opinion: America would be better off with more veterans in public office",
  "image": "https://www.gannett-cdn.com/presto/2022/04/07/PCIN/78448ab2-8b11-4ba4-97a9-4cee731ea236-mandel_ad_screen_grab.jpg?crop=2047,1152,x0,y61&width=2047&height=1152&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/04/21/opinion-america-would-better-off-more-veterans-public-office/7367825001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Mandel",
  "authorUrl": "",
  "termIds": [
    2290,
    1424,
    5925,
    6678
  ],
  "sentences": [
    "On the heels of Biden’s Afghanistan debacle, and amidst the multi-dimensional partnerships between China, Russia and Iran, our nation could surely use the steady hands, sturdy backbones and head-on-a-swivel bearing of more military veterans in positions of leadership.",
    "Black kids from inner-city Bronx, Hispanic kids from rural Texas, white kids from backwoods Tennessee, and Jewish boys from Beachwood, Ohio – we are all brothers – bound together by love of God and country and carrying on a tradition paved for us by generations past.",
    "Veterans like myself would never sacrifice American troops for an ill-defined or unimportant objective, and we will never shy away from putting ourselves in harm’s way if it is necessary to defend our families, our republic and our God-given freedoms.",
    "I consider my role as Ohio’s next senator to be a continuation of service to country, and surely one informed by my experiences in the Marines and by being the grandson of a U.S. Army soldier and a Holocaust survivor liberated by Allied Troops.",
    "We know that the only way to truly keep ourselves and our fellow citizens safe is to be constantly vigilant against threats and prepared to stand up to those who challenge us, while doing everything in our power to prevent war.",
    "While military service does not uniquely qualify someone for public service, there are certain moments in American history in which our country would be better served with more veterans in the U.S. House and U.S. Senate.",
    "We’ve risked our lives and endured hardships in service to God and country, and through it all we were led by some of the smartest and bravest people this country has to offer.",
    "We will never back down from a fight that is just, and we never sacrifice our principles for the illusions of what politicians might want us to view as their cause du jour.",
    "For one thing, nobody has a more realistic understanding of the nature of war, and the reasons to do everything we can to prevent future wars, than those who have served.",
    "More than anything, I learned that the bedrock of America produces the most patriotic, unselfish, loyal young men and women a nation could ever ask for.",
    "America would be much better off with more veterans serving in the U.S. Senate, and I will be proud to do my small part as one of them.",
    "Opinion contributor\nIn the 1970s, about 80% of those who served in public office were veterans of the United States Armed Forces.",
    "Veterans like myself will do everything we can to prevent the next generations of sons and daughters from having to go to war.",
    "We were trained to be exactly the sort of leaders this country is sorely lacking right now in the political arena.",
    "Veterans bring to the table plenty of skills that our nation needs beyond the realm of foreign policy as well.",
    "In the service, we learn to cultivate a mentality of vigilance and develop the courage to back it up.",
    "The presence of military veterans in the corridors of power is important for a number of reasons.",
    "Today, we’re at a record low in our nation’s history in terms of veterans in office– just 16%.",
    "Josh Mandel is a Marine Corps veteran, former state treasurer and candidate for U.S. Senate.",
    "I learned a lot during the small part I played on two tours in Anbar Province, Iraq.",
    "Not just about war, but about leadership, sacrifice and what really matters in life.",
    "Veterans know what it means to serve, and we know what it means to lead.",
    "Now is indeed one of those moments."
  ]
}