{
  "id": 6173,
  "mediaId": 8413,
  "date": "2022-04-13",
  "headline": "Damschroder: STRS elections built on political spin",
  "image": "https://www.gannett-cdn.com/presto/2018/11/26/PFRE/445d6268-e650-4513-ac0c-3bdb73dfe5d4-Damschroder.jpg?crop=3023,1734,x0,y563&width=3023&height=1734&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/04/13/ohio-teachers-pension-board-elections-built-political-spin/7287034001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Damschrodeer",
  "authorUrl": "",
  "termIds": [
    3123,
    2679,
    5811,
    1259,
    552,
    6474
  ],
  "sentences": [
    "Dr. Fictenbaum said “fully implemented, the plan could earn $4 billion a year, enough to restore COLA and reverse many of the cuts.” Restoring a 3% annual cost of living adjustment and reversing service requirements forcing teachers to work years longer for much less in benefits, is not possible with a $250 million program.",
    "The motion from Steen, sparking the debate, was to provide a Columbus start-up called QED with $250 million to test the concept of swapping ultra-safe treasury bills with Goldman Sachs for high risk investments requiring the Wall Street giant to keep funds on hand to safeguard against the risk.",
    "Last week, STRS put out a news release saying the Boston College Center for Retirement Research proactively contacted the Ohio teachers retirement fund to deny the existence of a CRR study showing STRS as the worst public pension plan in the nation.",
    "In the contentious debate, proponents of the proposal said this could only be done with “too big to fail” institutions, so taxpayers would make good on the buy-backs if the secret leverage ever caused the STRS counterparty into insolvency.",
    "What Dr. Fichtenbaum calls a “myth” today was clearly advocated by Steen, Fichtenbaum and former board chairman Robert Stein, who said, “This is probably the most important agenda item in the history of the pension system.",
    "QED’s Metcalf was a member of the Ohio Public Employees Retirement System Board of Trustees, appointed by state treasurer Josh Mandel, when OPERS was paying fund managers excessive fees in every investment category.",
    "The evidence is in another statement from Dr. Fichtenbaum that obliterates the truth of the presentation on a business partnership to alter STRS investment strategy, delivered to the board on Nov. 18.",
    "Columnist\nThe political shenanigans in the contested primary elections for the senate or governor’s office have nothing on the battle for board seats on the State Teachers Retirement System of Ohio.",
    "But sadly, the drive for reform, if successful, will make the current crisis of self-interested management pocketing six figure bonuses for obviously subpar performance seem like the good old days.",
    "Board members Wade Steen and Dr. Rudy Fichtenbaum responded with an email released through a new reform group called fix my pension, asking why benefits have been cut if the pension is so great.",
    "But $250 million would provide QED with a seven figure return on the investment of time partners Jonathan Tremmel and Seth Metcalf invested in lobbying for the plan.",
    "The apparent intent of Steen, Fictenbaum and Stein was to use the $250 million test of concept as the first step in shifting $65 billion to the asset swap proposal.",
    "STRS would be protected by a buy-back agreement between Goldman Sachs and QED, an agreement unshared with regulators at the Federal Reserve.",
    "But it is shielded from investigations into breach of fiduciary duty by its status as a state institution, protected by sovereign immunity.",
    "Managing a $65 billion fund would bring hundreds of millions to them annually, a fact opponents of the proposal hammered relentlessly.",
    "The QED three assured fellow board members their proposal mirrored the success of HOOPP, the Healthcare of Ontario Pension Plan.",
    "Stein said he had seen an employment contract between Robert Goobie, the HOOPP mastermind of the program and QED.",
    "In another message to members, STRS said the average retiree contributed $215,000 for a benefit worth $2 million.",
    "STRS's no big deal reaction to the 100% loss of a $525 million dollar investment is exhibit one.",
    "As I have repeatedly documented in this space, STRS is a maelstrom of questionable management.",
    "George Voinovich’s administration, writes about business and economic development in Ohio.",
    "This comes during the April 1 to May 2 window for voting on three STRS board seats.",
    "Goobie denied any involvement with QED when I spoke to him at length in December.",
    "I was the only journalist in the room when the proposal was debated.",
    "John Damschroder, a Fremont native who worked in Gov.",
    "Putting a fox in the henhouse is not reform."
  ]
}