{
  "id": 6672,
  "mediaId": 8480,
  "date": "2022-04-11",
  "headline": "Ohio lawmaker introduces bill to require photo ID at polls",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/04/aac5acc1db5b438a954e8e4b50c021ea.jpg?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/ohio-lawmaker-introduces-bill-to-require-photo-id-at-polls/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/?post_type=profile&p=1041730",
  "termIds": [
    0
  ],
  "sentences": [
    "“If I didn’t, I would be given a provisional ballot which then takes a poll worker away from other activities.”\nWhile Miller said the law could hamper the ability to vote by communities of color, rural Ohioans, seniors, and other populations who might lack access to a BMV, she argued that SB 320 could lead to longer lines at the polls and greater confusion for all voters.",
    "Of the 62 potentially fraudulent ballots LaRose referred to law enforcement, he said 31 involved non-citizens who registered to vote but never cast a ballot, and the other 31 alleged cases involved non-citizens who cast a ballot, dead people for whom a ballot was cast, and those who cast multiple ballots, according to a February news release from LaRose’s office.",
    "“There’s errors that get made, poll workers make errors, but not impersonation fraud.”\nIn suggesting voter fraud prompts the need for tightened voter ID laws, Kogan said lawmakers could be hurting, rather than helping, their own mission in improving voter confidence in the electoral process.",
    "“Ohio is an important election state, and voters need to have confidence in the integrity of our elections.”\nThe bill, which sparks concern for some voting rights advocates, would also require the Bureau of Motor Vehicles to issue free state ID cards to Ohioans ages 17 and up.",
    "Under Senate Bill 320, Ohioans would be required to display photo identification before casting a ballot at the polls in an effort to combat voter fraud and enhance election security in the state, according to the bill’s sponsor, Sen. Teresa Gavarone (R-Huron).",
    "Vlad Kogan, an associate professor of political science at Ohio State University, said of the 0.0005% of potential fraud reported by LaRose, an even smaller percentage constituted voter impersonation – the type of fraud photo ID laws seek to prevent.",
    "The legislation comes two months after LaRose announced that election fraud in Ohio is “exceedingly rare,” reporting that the potentially illegal votes cast during the 2020 general election constituted 0.0005% of the total 6 million ballots cast.",
    "Jen Miller, executive director for the League of Women Voters of Ohio, said the “overly stringent” law could impose another barrier to voting for transient populations, like college students and military members, whose addresses might fluctuate.",
    "As SB 320 awaits a committee assignment for further review, Gavarone said she’s hopeful that fellow state lawmakers acknowledge the public opinion that sways toward supporting a photo ID requirement.",
    "“I think photo ID is something that’s going to help election integrity and security in Ohio, and actually, recent polling has shown that the vast majority of Americans agree,” Gavarone said.",
    "If signed into law, utility bills, bank statements and other acceptable forms of identification under current state law would no longer be permitted, according to the bill’s text.",
    "Gavarone said in the case that an address is incorrect, voters can supplement their photo ID with a secondary form of identification, like a utility bill or credit card statement.",
    "Kogan agreed, adding that in a state with strict voter ID laws already on the books, changes to what’s required at the polls could discourage some Ohioans from casting a ballot.",
    "“We want to make sure everyone is able to vote, so if you don’t have a driver’s license or state ID, we’ll provide one without charge,” Gavarone said.",
    "Rob Nichols, a spokesperson for Secretary of State Frank LaRose, said his office is reviewing the legislation to better understand its implications.",
    "The evidence points to the opposite – the rhetoric you hear around the legislation probably increases unsureness and decreases confidence,” he said.",
    "According to a June 2021 poll conducted by Monmouth University, about 80% of respondents said they supported a photo ID mandate.",
    "Pew Research Center found that 93% of Republicans and 61% of Democrats are in favor of requiring the presentation of a photo ID.",
    "“For years Ohio’s secretaries of state have been saying it’s just not a problem; we don’t have impersonation fraud,” Kogan said.",
    "The identification presented at the polls must also be up to date with a voter’s current address, according to SB 320’s text.",
    "“Changing the rules all the time causes people to stay home, and they might even have an ID that qualifies,” Kogan said.",
    "“We need to be constantly looking at what we’re doing to make sure in Ohio we’re doing what’s right,” Gavarone said.",
    "COLUMBUS, Ohio (WCMH) – A bill tightening Ohio’s voter ID laws was introduced last week at the Statehouse.",
    "“Right now, I have an unexpired Ohio drivers’ license with the wrong address.",
    "“There’s no evidence that passing voter ID law increases people’s confidence.",
    "I would have to remember to bring a secondary ID,” Miller said."
  ]
}