{
  "id": 7261,
  "mediaId": 2644,
  "date": "2022-04-05",
  "headline": "Ohio GOP Senate front-runner panned for taking $1.5M in PPP funds for bank",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/ohio-senate-gop-race-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/05/ohio-senate-candidate-mike-gibbons-slammed-by-jd-vance-for-taking-ppp-funds/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Nelson",
  "authorUrl": "",
  "termIds": [
    4306,
    2290,
    1489,
    1417,
    976,
    195,
    1126,
    6474
  ],
  "sentences": [
    "“Gibbons has spent over $11 million self-funding his Senate campaign since he took the $1.5 million from taxpayers, so he clearly didn’t need the money to pay his bills or keep Ohioans employed.”\nVance added that Gibbons “shamefully abused the trust of taxpayers to line his pockets, at the expense of those who truly needed that money to survive.”\nVance, a venture capitalist best known as the author of the best-selling memoir “Hillbilly Elegy,” is currently third in polls going into the May 3 primary election.",
    "Staff-reported pay information on Glassdoor indicates that six-figure salaries are common at the company, which describes itself as “a leading independent investment bank and financial advisory firm.”\nAlthough Gibbons benefited from the PPP funds, he said in October that he would have voted against the CARES Act, which contained the first installment of the program’s funds.",
    "Brown Gibbons Lang & Co. LLC was approved for a forgivable PPP loan on April 14, 2020 — two days before the program’s initial $350 billion in funding ran out, as larger firms scooped up the cash while lockdowns crushed smaller restaurants and shops.",
    "The crowded Republican Senate primary in Ohio is drawing new controversy, with candidate JD Vance slamming front-runner Mike Gibbons for “shamefully” taking $1.5 million in Paycheck Protection Program loans for his investment bank.",
    "“How many struggling small businesses in Ohio went bankrupt or were forced to fire their workers just because Mike Gibbons cut ahead of them in line for PPP funds that he didn’t even need?” Vance told The Post.",
    "At a debate last month, Gibbons and former Ohio Treasurer Josh Mandel, currently second in GOP primary polls, came close to a physical altercation on stage as Mandel slammed Gibbons for business links to China.",
    "ProPublica’s database of PPP records indicates that Gibbons’ company received $1,513,100 in PPP loan money and said all of it would go toward payroll for 72 positions.",
    "According to the RealClearPolitics average of recent polls, Gibbons is leading the GOP primary with about 20% support, followed by Mandel at 18.7% and Vance at 11%.",
    "The primary remains unsettled, however, with two other candidates polling above 5% and former President Donald Trump not yet issuing an endorsement.",
    "Donald Trump’s Paycheck Protection Program as laid out by law, was used to pay the salaries of employees during the 2020 lockdown,” Cotten said.",
    "Gibbons has self-funded about $11.4 million out of the total $12.1 million raised by his campaign, according to federal campaign finance data.",
    "Lawmakers approved a second batch of PPP funds in late April 2020, though some smaller companies still struggled to navigate the process.",
    "Congress established the Paycheck Protection Program in March 2020 to help small businesses with up to 500 employees.",
    "President Trump’s program helped ensure they continued to receive paychecks during the government imposed lockdowns.”",
    "The government converted the loan to a grant because it met the program’s conditions, according to the database.",
    "Gibbons’ spokeswoman Samantha Cotten returned fire on Vance and said her boss did nothing wrong.",
    "“Mike Gibbons has created thousands of jobs, and at any given time has hundreds of employees.",
    "He raised the attack ahead of a Tuesday night Republican primary debate.",
    "Loans were forgiven if companies spent a certain percentage on payroll.",
    "Initially, the requirement was 75%, but was later reduced to 60%.",
    "“JD Vance clearly has spent too much time in the CNN green rooms.",
    "It’s unclear which employee salaries were covered."
  ]
}