{
  "id": 8941,
  "mediaId": 2641,
  "date": "2022-03-22",
  "headline": "Ohio's Mandel, Gibbons to Newsmax: Not Backing Down After Debate Fight",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=687fde37-5578-4800-bb20-98388a413323&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/josh-mandel-mike-gibbons-ohio-debate/2022/03/22/id/1062328/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sandy Fitzgerald",
  "authorUrl": "",
  "termIds": [
    2290,
    2370,
    2684,
    1489,
    911,
    910,
    6077,
    6067,
    6509,
    6474
  ],
  "sentences": [
    "Mandel, a former Ohio treasurer and U.S. Marine, and Gibbons, a real estate developer and investment banker, both of whom are from Cleveland, appeared to be close to coming to blows on the debate stage after Mandel accused Gibbons of having made millions of dollars from stock in a Chinese company, and with Gibbons responding that Mandel, who served two tours in Iraq, had \"never been in the private sector in your entire life.",
    "\"This guy, Mike Gibbons, who's a wealthy investment banker who made a bunch of money by sending American jobs to China, he attacked me, and he said that serving in the military, in my case, or your case in the Marine Corps, is not real work, and he managed to insult pretty much every veteran in the state of Ohio and veterans across America.\"",
    "Mandel, appearing on Newsmax's \"Greg Kelly Reports,\" and Gibbons, who spoke out on Newsmax's \"Stinchfield,\" both insisted that they were correct in the argument on the stage in the party's first debate this year in the heated contest to replace retiring Sen.",
    "Mandel, meanwhile, said Gibbons \"kept losing his composure\" after their argument, and insisted that \"we've gotten into this mess in Washington in large part, Greg, because we sent wimpy soft Republicans to the nation's capital in the House and the Senate.\"",
    "\"This guy has the audacity to tell me and you and other veterans throughout our country that we don't know what work is like, that we never held a real job because we served in the Marine Corps, the Army or the Navy, the Air Force,\" said Mandel.",
    "He also insisted that he doesn't think military service uniquely qualifies someone for public office, but there are \"certain moments\" when the nation would be better served if there were more men and women in Congress who have served overseas.",
    "Mandel, however, told Kelly that he would \"stand up for every veteran\" in Ohio and the country and that when he was serving in Iraq and former President Donald Trump was running for office, \"Gibbons was shipping American jobs to China.\"",
    "Ohio GOP Senate candidates Josh Mandel and Mike Gibbons, who made headlines over the weekend after squaring off toe-to-toe during a party debate near Columbus, did not appear ready to back down during interviews on Newsmax Monday.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "\"I think our United States Senate would be such a better chamber — such a better institution — if we had more men and women in there who have actually worn the uniform and served their country in the U.S.",
    "Gibbons also insisted when he told Mandel that he'd never served \"a day in the private sector,\" that didn't have anything to do with his military career, but with his career after.",
    "They invest in it and oftentimes in almost all cases because we've sold to German and Swiss and French companies, American operations, they expanded and more jobs are created.\"",
    "But Gibbons insisted to Stinchfield that his business involves selling companies, but even with the sales to a Chinese firm, that doesn't mean jobs were lost.",
    "\"I don't remember any of the exchange because I was more worried about whether or not he's going to take a swing at me because it certainly looked like that.\"",
    "\"Now is one of those moments, when we look at the threat we face with Russia and Ukraine and China, Iran and the invasion in our southern border,\" he said.",
    "\"It's not the time for Republicans who are just going there to be bipartisan and help [Chuck] Schumer and [Nancy] Pelosi get things done.",
    "MAGA patriots to our country, they're sick of Republicans being weak, and now is not the time for soft Republicans,\" said Mandel.",
    "Further, Gibbons said Monday, \"when a foreign company buys a company, they don't pick it up and move it to the other country.",
    "Mandel told Newsmax's Greg Kelly Monday that \"when you're the front-runner, people are taking shots at you left and right.\"",
    "Gibbons also insisted that he's a constitutional conservative who doesn't \"have a liberal bone in my body and never will.\"",
    "\"I didn't think, running in a Senate race, I would have somebody literally attacking me on stage,\" Gibbons said.",
    "\"He's a consummate career politician and he was talking about stack trading, that he knows nothing about.",
    "\"In 2013, when we were doing this, China was not nearly the China we have now,\" Gibbons said.",
    "\"It is a price you pay when you're in the military, you know it's not necessarily lucrative.",
    "But Gibbons insisted to Newsmax's Grant Stinchfield that he was the one who was attacked.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"I think conservatives throughout our country, I think America first.",
    "I had no knowledge of it, actually, until Josh brought it out.",
    "It was in the state of Michigan, and it didn't take any jobs.",
    "It isn't technically the private sector but it is service.\"",
    "\"It was a minor transaction in our organization.",
    "\"He's a serial campaigner,\" said Gibbons.",
    "It actually increased jobs initially.\"",
    "Now is the time for fighters.\"",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "And he basically lied.\"",
    "You don't know squat.\"",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "Special Links:",
    "Rob Portman.",
    "military.\""
  ]
}