{
  "id": 9029,
  "mediaId": 2658,
  "date": "2022-03-22",
  "headline": "POLITICO Playbook: Friction between Harris and Biden camps revealed in new book",
  "image": "https://static.politico.com/48/2a/62a889e4465bb2a2fc51e1e1a16c/220322-harris-biden-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/22/friction-between-harris-and-biden-camps-revealed-in-new-book-00019145",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    2469,
    2765,
    4271,
    3879,
    3458,
    3080,
    2943,
    1063,
    6195
  ],
  "sentences": [
    "In remarks published by a Ukrainian public TV channel, Zelensky said the country ‘cannot fulfill ultimatums.’”\nMORE HEADLINES — “Pitched battle in Mariupol intensifies, as war displaces millions across Ukraine,” WaPo … “Russia Relies Increasingly on Missiles, Artillery to Pressure Ukraine,” WSJ … “The Next 2 Weeks Could Determine the Fate of Ukraine,” by Paul McLeary and David Brown … “Ukraine retakes key Kyiv suburb; battle for Mariupol rages,” AP\nCONGRESS\nNOT NORMAL — Andrew Desiderio and Burgess Everett write that “mere days after all but eight House members voted to revoke normal trade relations with Russia — a whopping total in the bitterly divided chamber — its path through the Senate is already looking complicated.”\nRepublicans in the Senate want the piece of legislation to be paired with another measure banning Russian oil imports that’s already passed the House.",
    "And I know that my judicial role is further constrained by careful adherence to precedent,’ Jackson said.”\nMORE ROUNDUPS — “4 takeaways from Ketanji Brown Jackson’s confirmation hearing,” WaPo … “GOP venting, 2024 auditions and a historic moment: Highlights from Day 1 of Ketanji Brown Jackson hearing,” NBC … “Kavanaugh tensions simmer behind low-key opening to Jackson hearings,” by Josh Gerstein and Marianne LeVine\nWHAT’S IN STORE FOR DAY TWO — Republicans are trying to focus on Demand Justice and squeezing Jackson on the court packing that the liberal group advocates for, Marianne reports.",
    "“How was she supposed to communicate clearly about voting-rights legislation, Harris asked West Wing aides, when the president would not even say that he supported changing the Senate rules to open the path for a bill?”\nAs calls for Biden to come out in favor of a filibuster carve-out for voting rights and frustration with the White House’s perceived lack of prioritization of the issue grew, Harris told Biden aides that she couldn’t be as forceful publicly as she wanted to be.",
    "THE NEW GOP — “The Rise of the Tucker Carlson Politician,” by NYT Magazine’s Jason Zengerle: “Two Republican Senate candidates field-test a new message honed in the cable-news studio.”\nWAR IN UKRAINE\nNOT BACKING DOWN — Ukrainian President VOLODYMYR ZELENSKYY “remained defiant Monday, saying he would never agree to an ultimatum from Russia or surrender Ukraine’s cities, even as the Kremlin continued its bombardment of the capital, the coast and elsewhere,” WaPo recaps.",
    "“Her approval numbers were even lower than Biden’s, and other Democrats were already eyeing the 2024 race if Biden declined to run.”\n— The pair reports that Harris and Biden have had a “friendly but not close” personal relationship, “and their weekly lunches lacked a real depth of personal and political intimacy.”\n— As for the VP’s portfolio, they write that Harris, wary of being hemmed in, didn’t want to pick a few signature issues.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Toplines … Crosstabs\nTAKEAWAYS FROM DAY ONE — During the first day of hearings, Jackson “promised she would be an independent jurist who will decide cases ‘without fear or favor’ — emphasizing her neutrality on the bench in hopes of heading off the expected criticism from Republicans that she has been a judicial activist,” WaPo’s Seung Min Kim, Ann Marimow and Aaron Davis recap.",
    "“Several experts said they’d simply ask her directly about her views on big-picture concepts, like ‘Has the Supreme Court amassed too much power?’ or ‘Do you believe in a living Constitution?’”\nALL POLITICS\nCOMING ATTRACTIONS — SARAH PALIN told Newsmax she’d run for the House seat left vacant by the late DON YOUNG “in a heartbeat” if she were asked to serve.",
    "POLITICO Playbook: Friction between Harris and Biden camps revealed in new book\nBy EUGENE DANIELS and RACHAEL BADE\n03/22/2022 06:13 AM EDT\n Updated 03/22/2022 08:27 AM EDT\n 2022-03-22T08:27-0400\nPresented by\nDRIVING THE DAY\nThe White House has worked hard to project a united front between President JOE BIDEN and VP KAMALA HARRIS and their respective teams.",
    "But the upcoming book “This Will Not Pass: Trump, Biden, and the Battle for America’s Future” ($29.99), by NYT’s Jonathan Martin and Alex Burns, reveals some frustrations at the highest echelons of the White House between the Biden and Harris camps, as well as the VP’s angst over the policy portfolio she was given.",
    "“But one key Republican involved in the push suggested that Democrats are already on track for a resolution by letting both the trade and oil sanctions packages pass.”\nPLAYBOOKERS\nSteven Horsford’s wife is, umm, not happy that he’s running for reelection after he admitted to a longtime affair with a Senate intern.",
    "office … Kathryn Jean Lopez … POLITICO’s Josh Siegel,Ruairí Arrieta-Kenna and Gaby Torres … Ann Clancy … E&E News’ Emma Dumain, Alex Wang and Scott Streater … Dan Backer … Matt Williams of the Democratic Policy and Communications Committee … Sarah Mars Bowie … AARP’s Myrna Blyth … Patrick Manion … former Sens.",
    "Why, she asked, do we have to choose the one who attacked Joe?”\nJill Biden’s spokesman, MICHAEL LAROSA, repeated the statement her office has issued in the past on this type of reporting: “Many books will be written on the 2020 campaign, with countless retellings of events — some accurate, some inaccurate.",
    "ENGAGED — Alexa Shaffer, comms director at the Voter Participation Center and a Jared Huffman and Sheldon Whitehouse alum, and Virgilio “Lio” Barrera, director of government affairs at LafargeHolcim and a Martin Heinrich and Mark Udall alum, got engaged last week at home, with help from their dog Harper.",
    "But Monday’s latest troubling allegations about the former governor — that he physically abused his family members, including knocking down his wife and leaving one of their sons with a “swollen face, bleeding gums and a loose tooth” that eventually had to be removed, per the AP — have upended the race.",
    "HAPPY BIRTHDAY: Sen. Alex Padilla (D-Calif.) … Rep. Pete Sessions (R-Texas) … Wolf Blitzer … NBC’s Ali Vitali … Judge Neomi Rao … Giovanni Hashimoto … MSNBC’s Joshua Johnson … Tony Green … Rebecca Miller Spicer of Airlines for America … Lyzz Schwegler … Sarah Feldman of Sen. Jon Tester’s (D-Mont.)",
    "The president hauled senior staff into the Oval Office and warned if “he found that any of them was stirring up negative stories about the vice president, Biden said, they would quickly be former staff.”\n— Meanwhile, Harris was growing increasingly agitated by her predicament.",
    "But its executive director, BRIAN FALLON, considers the GOP questions a “badge of honor” and accuses Republicans of hypocrisy on “dark money.”\n— POLITICO Magazine rounds up some top legal minds on the question of what senators should really be asking Jackson.",
    "“In private, Bedingfield had taken to noting that the vice presidency was not the first time in Harris’s political career that she had fallen short of sky-high expectations: Her Senate office had been messy and her presidential campaign had been a fiasco.",
    "Eric Adams, fashion maven, donned a “new going out jacket by a local designer.”\nFox News had the chyron of the day/month/year: “Biden bike ride as Zelenskyy warns of WWIII.”\nAmericans think “The West Wing” is the most realistic TV portrayal of politics.",
    "She even told White House aides “in frank terms that she did not want to be restricted to a few subjects mainly associated with women and Black Americans.”\nHarris did ask to lead the administration’s push to shore up federal voting rights.",
    "“Vice President Harris is a force in this administration and I have the utmost respect for the work she does every day to move the country forward.”\n— The Biden White House had been remarkably leak-proof in the first several months.",
    "Those numbers are similar to what we saw in February and reflect the GOP strategy not to go after Jackson early on — lest they distract from pocketbook issues like inflation that Republicans think will resonate most in the midterms.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nKBJ CHRONICLES\nSURVEY SAYS — A new POLITICO/Morning Consult poll out this morning shows that 47% of voters think Jackson should be confirmed, while only 19% oppose confirmation.",
    "Fellow Republicans are demanding that Greitens step aside, airing fears they’ve held privately for months that he will squander a seat in a comfortable GOP state if he somehow makes it to the general election.",
    "The First Lady and her team do not plan to comment on any of them.”\nMORE WHERE THIS CAME FROM: Check out tonight’s West Wing Playbook (subscribe here) for more exclusive reporting from the JMart-Burns book.",
    "Pic\nWELCOME TO THE WORLD — Jon Bergner, founder of Exigent Government Relations, and Brianna Bergner, an associate partner development executive at Equinix, welcomed Samantha Davis Bergner on Saturday.",
    "“One senator close to her, describing Harris’s frustration level as ‘up in the stratosphere,’ lamented that Harris’s political decline was a ‘slow-rolling Greek tragedy,’” Martin and Burns write.",
    "Martha McSally (R-Ariz.) and Orrin Hatch (R-Utah) … Kate Head … former Rep. Thomas Andrews (D-Maine) … GOP ad-maker Bob Gardner … Jeff Cohen … Amy Kramer\nDid someone forward this email to you?",
    "“The dispute threatens to delay or derail congressional action on an overwhelmingly popular measure designed to punish Russia and deprive its economy of key revenue streams,” the pair writes.",
    "“As Moscow sought its first strategic victory in a war that appears to be approaching a stalemate in many places, it issued a warning to leaders in Mariupol: flee, or face further attacks.",
    "The frontrunner in Georgia has the support of Washington Republicans but also has a bevy of physical abuse allegations against him, including that he held a gun to his ex-wife’s head.",
    "Pic\n— Caroline Ponseti, senior director at the Herald Group, and John Lin, counsel for the Senate Commerce Committee, got engaged Sunday at the cherry blossoms near the Tidal Basin.",
    "“The fact that no one working on this book bothered to call to fact check this unattributed claim tells you what you need to know,” Bedingfield responded in an email Monday night.",
    "BIDEN’S TUESDAY — The president will receive the President’s Daily Brief at 10:15 a.m.\nPress secretary JEN PSAKI will brief with national security adviser JAKE SULLIVAN at 1 p.m.",
    "While Republican attacks on Jackson are expected at her confirmation hearings this week, the decision to tread lightly from the get-go has helped keep her unfavorables down.",
    "The numbers, when you look closely, are a result of strong Democratic support for seating her on the bench and apparent unawareness among independents and even GOP voters.",
    "— Martin and Burns add new details to first lady JILL BIDEN’s discontent with Harris as a top VP choice after she went after Joe Biden over school busing during a debate.",
    "Pic … Another pic\n— David Turner, comms director at the Democratic Governors Association, and Elizabeth Weiss, a teacher in D.C., welcomed Hank Eugene Turner on Feb. 16.",
    "MEDIA MOVES — WaPo announced that Jacqueline Alemany will become a congressional investigations reporter and Evan Halper is joining as an energy reporter from the LAT.",
    "But as the effort stalled in Congress, leaving the White House (and Harris) with not many options, she placed some of the blame at Biden’s feet, according to the book.",
    "Playbook got its hands on some juicy excerpts:\n— Harris allies complained throughout the first year of the administration that she was handed an impossible portfolio.",
    "According to the book, KATE BEDINGFIELD, Biden’s comms director, not only grew tired of the criticism that the White House was mismanaging Harris — she blamed the VP.",
    "THE SENATE will meet at 10 a.m. to take up motion to proceed to the America COMPETES Act, with a recess from 12:30 p.m. to 2:15 p.m. for weekly conference meetings.",
    "We’ll see if Senate Minority Leader MITCH MCCONNELL or DONALD TRUMP take a different tack — or whether Missouri GOP primary voters will decide that enough’s enough.",
    "She told him she couldn’t go all out until “voters knew that Biden himself was willing to back the procedural steps required to” pass legislation, the two write.",
    "But that began to change after Harris’ trip to Guatemala in June to address immigration, with reports of dysfunction in her office finding their way to print.",
    "“‘I know that my role as a judge is a limited one — that the Constitution empowers me only to decide cases and controversies that are properly presented.",
    "They met online during the first week of the pandemic lockdown, and their first in-person date was waiting three hours to pick up takeout sushi.",
    "2022 WATCH — ERIC GREITENS pushed past the 2018 scandal that drove him from office to become the frontrunner in Missouri’s GOP Senate primary.",
    "), who’s running for Senate against Greitens and has criticized him over the previous allegation of violent sexual assault, said in a video.",
    "NRSC Chair RICK SCOTT (R-Fla.) called the allegations “disturbing” but maintained his position that the committee won’t pick a candidate.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "The couple was introduced by a mutual friend while Alexa was in New Mexico working as comms director for Sen. Ben Ray Luján’s campaign.",
    "Mike Gibbons, the Ohio Senate hopeful who nearly came to blows with Josh Mandel, urged voters to “choose your fighter” in the race.",
    "SPOTTED: former CDC Director Robert Redfield and former White House NEC chief of staff Tom O’Donnell at Cafe Milano in Abu Dhabi.",
    "Case in point: While three-quarters of Democrats support confirmation, 39% of independent voters agree and 43% have no opinion.",
    "The Judiciary Committee will continue its confirmation hearings on KETANJI BROWN JACKSON’s Supreme Court nomination at 9 a.m.",
    "Pic\nFIRST IN PLAYBOOK — Tammy Wincup has been hired as the next president and chief commercial officer of Revolution Foods.",
    "Meanwhile, 41% of GOP voters have no opinion about Jackson’s confirmation while 23% support confirmation and 36% oppose.",
    "“Speaking in confidence with a close adviser to her husband’s campaign, the future First lady posed a pointed question.",
    "She previously was an organizer with the Democratic Party of Virginia and is founder of Daughters Defend Democracy.",
    "So far, the GOP doesn’t appear to be any closer to unifying behind a single candidate to ensure Greitens loses.",
    "He most recently was a columnist and video producer at Insider, where he founded the Voices of Color vertical.",
    "… Rhett DeHart is now of counsel for Womble Bond Dickinson’s white collar and government investigations team.",
    "The situation is raising questions about the GOP’s handling of another Senate GOP candidate, HERSCHEL WALKER.",
    "She previously was an administrative assistant for the House Appropriations Transportation-HUD Subcommittee.",
    "She previously was an assistant director of policy and political affairs for the American Jewish Committee.",
    "But Republicans still have the same problem: Greitens denies the allegations and is refusing to drop out.",
    "“It’s time for Eric to get out of the Senate race and get professional help.” Sen. JOSH HAWLEY (R-Mo.",
    "TRANSITIONS — Ally Sammarco has opened her own political strategy and digital media firm, ARS Media.",
    "Ukrainian officials rejected the demands, and the fate of the southeastern port city is uncertain.",
    "… Jackie Subar is now national director of strategic partnerships for the Anti-Defamation League.",
    "— Robert O’Brien, former national security adviser in the Trump White House, is joining the U.S.",
    "Perhaps, she suggested, the problem was not the vice president’s staff,” Martin and Burns write.",
    "… Indivar Dutta-Gupta is joining the Center for Law and Social Policy as executive director.",
    "…\n…Gladys Barcena is joining the Madison Group as senior director of government relations.",
    "(Horsford’s office didn’t respond to request for comment about his wife’s Twitter thread.)",
    "Expect questions in the coming weeks about the differing approaches to the two situations.",
    "Senate Dems brush off the attacks by saying they have little to do with the organization.",
    "He currently is co-executive director of the Georgetown Center on Poverty and Inequality.",
    "(To be clear, Biden has already used executive action banning oil imports from Russia.)",
    "… Crystal Ebert is now a director for digital and comms at Bully Pulpit Interactive.",
    "He previously was at Morning Consult and social activism agency Don’t Cry Wolf.",
    "She most recently was a digital adviser at EMILY’s List, and is a DCCC alum.",
    "She came in at 6 lbs, 11 oz and 19.5 inches, and joins big sister Isabella.",
    "He previously was acting U.S. attorney for the District of South Carolina.",
    "… Manny Ocbazghi is joining NBC News Digital as a social video producer.",
    "— T. Anthony Patterson is joining Public Agenda as director of comms.",
    "“Real men never abuse women and children,” Rep. VICKY HARTZLER (R-Mo.",
    "There are millions of people in the United States, she began.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Global Leadership Coalition’s National Advisory Council.",
    "The VP’s office declined to comment on the excerpts.",
    "Send Playbookers tips to playbook@politico.com.",
    "Natalie Allison and Burgess Everett have more.",
    "That ticked off Biden, according to the book.",
    "She most recently was president of Protocol.",
    "), no fan of Greitens, said much the same.",
    "Thanks for reading Playbook.",
    "Good Tuesday morning.",
    "THE HOUSE is out.",
    "Sign up here."
  ]
}