[
  {
    "id": 659,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) has argued, for instance, that you actually have a constitutionally protected right to free, unrestricted travel within the United States,? which would prevent airlines from requiring passengers to be vaccinated against the coronavirus.",
    "author": "",
    "title": "Opinion: A party that censures its defenders of the Constitution has lost its way"
  },
  {
    "id": 584,
    "mediaId": 238,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "Freshman Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) said it would be asinine' for a GOP majority to disband the panel, and Rep. Matt Gaetz (R-Fla.) has called for using it to pursue unfounded theories about the Justice Department's involvement in the Jan. 6 attack,? Politico's Olivia Beavers and Kyle Cheney report.",
    "author": "",
    "title": "Pence and RNC take radically different roads on Jan. 6"
  },
  {
    "id": 589,
    "mediaId": 43,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosar ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump is the worst president the U.S. ever had'"
  },
  {
    "id": 3066,
    "mediaId": 237,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> and Sen. Rand Paul endorsed Starbuck before Trump and pressed back on Trump's endorsement.",
    "author": "Christopher Hutton",
    "title": "Trump-endorsed Morgan Ortagus announces Tennessee run for Congress"
  },
  {
    "id": 568,
    "mediaId": 195,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "As Jonah Goldberg, the conservative pundit who walked away from his job as a contributor at Fox News because of its blind devotion to Donald Trump bluntly puts it in his blog, The Goldberg File: The upshot of this is that [Republican Members of Congress] Paul Gosar, <span class='selected-term'>Madison Cawthorn</span>, Marjorie Taylor Greene, Matt Gaetz, and the other gargoyles of the right can spew their bile and be considered Republicans in good standing and receive help from the party.?\nAs for our former president, Goldberg says: Donald Trump, it is now abundantly clear, endeavored to invalidate a constitutionally valid election with the full support of such poltroons and gibbons.",
    "author": "Bernard Goldberg",
    "title": "The new politics of America: Fall into line or pay the price"
  },
  {
    "id": 3061,
    "mediaId": 43,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "CNN\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "Overnight News Digest: Europe's giant"
  },
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Starting gate\nFirebrands meet friendly fire: Republican lightning rods Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span> and Lauren Boebert have raised millions of dollars flouting political norms.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 504,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 3054,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Almost everyone had expected Moore to run in the 13th District under the map that has since been struck down, but he decided not to after Rep. <span class='selected-term'>Madison Cawthorn</span> surprised everyone by announcing he'd run for that constituency rather than the neighboring 14th.",
    "author": "",
    "title": "Morning Digest: Longtime Democratic power player on Long Island will not seek"
  },
  {
    "id": 477,
    "mediaId": 376,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "He has since distanced himself from that view, and he has nevertheless attracted the backing of populist firebrands Marjorie Taylor Greene and <span class='selected-term'>Madison Cawthorn</span>, who represent House districts in Georgia and North Carolina, respectively.",
    "author": "Stephanie Akin",
    "title": "GOP primary in Texas tests how far Trump loyalty should extend"
  },
  {
    "id": 428,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "Ron DeSantis, Republican senators Ted Cruz, Rick Scott and Marco Rubio, and Representatives Matt Gaetz, Jim Jordan, Lauren Boebert, <span class='selected-term'>Madison Cawthorn</span> and Marjorie Taylor Greene  in building buzz for the star of the circus, former President Donald Trump.",
    "author": "",
    "title": "The Myth of Instant Gratification"
  },
  {
    "id": 3014,
    "mediaId": 237,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "In addition to Cruz, Collins boasted endorsements from North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> and those critical of McCarthy: a PAC aligned with the House Freedom Caucus and Georgia Rep. Marjorie Taylor Greene.",
    "author": "Emily Brooks",
    "title": "Navy SEAL Morgan Luttrell wins in Texas House primary that was GOP proxy war"
  },
  {
    "id": 300,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Democrats have repeatedly slammed McCarthy for his criticisms of Cheney and Kinzinger and attempted to link vulnerable GOP lawmakers to scandals surrounding conservative firebrands like Reps. <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Marjorie Taylor Greene of Georgia, with some recently calling for members to denounce their anti-Ukraine rhetoric.",
    "author": "Juliegrace Brufke",
    "title": "McCarthy says GOP criticisms of Cheney and Kinzinger won't dissuade swing voters"
  },
  {
    "id": 304,
    "mediaId": 195,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "A month ago, McCarthy publicly criticized members Rep. Marjorie Taylor Greene (R-Ga.) and Rep. Paul Gosar (R-Ariz.) for speaking at a white nationalist conference, which he called unacceptable.? Last week, he said that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) was wrong? for calling Ukrainian President Volodymyr Zelensky a \"thug.\"",
    "author": "Emily Brooks -",
    "title": "A more unified House GOP aims to get everyone on same page"
  },
  {
    "id": 2966,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The challenge was filed by the same coalition of constitutional scholars and liberal activists who unsuccessfully tried to block Rep. <span class='selected-term'>Madison Cawthorn</span> from the GOP primary ballot in North Carolina.",
    "author": "Marshall Cohen",
    "title": "Groups try to disqualify Rep. Marjorie Taylor Greene's candidacy over January 6"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "What's more, House GOP leaders made clear that far-right members like Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who recently called Ukrainian President Volodymyr Zelensky a thug,? did not speak for the conference.",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 2957,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "The complaint is similar to one targeting North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> and says that Republican Secretary of State Brad Raffensperger must call a hearing to determine Greene's eligibility.",
    "author": "",
    "title": "Morning Digest: Nebraska Republican to resign after being convicted of campaign finance fraud"
  }
]