[
  {
    "id": 699,
    "mediaId": 376,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Colorado Rep. Lauren Boebert raised $3.8 million last year, and North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> raised $3.1 million.",
    "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
    "title": "House GOP feels no fundraising backlash for opposing electors"
  },
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Starting gate\nFirebrands meet friendly fire: Republican lightning rods Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span> and Lauren Boebert have raised millions of dollars flouting political norms.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 2655,
    "mediaId": 238,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Return to menu\nIt can be a challenge to keep tabs on all the controversies involving Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), the youngest member of Congress.",
    "author": "",
    "title": "Post Politics Now Grand jury being seated in Georgia in new phase of Trump election probe"
  },
  {
    "id": 1,
    "mediaId": 151,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "In North Carolina, more establishment-oriented Republicans are hoping to oust Rep. <span class='selected-term'>Madison Cawthorn</span>  a hardliner who has drawn a rash of unfavorable attention in recent weeks  and Cawthorn's political acolyte Bo Hines, who is running in an open seat in the central region of the state.",
    "author": "",
    "title": "Are you going to cave? GOP primaries pit fighters against governing wing"
  }
]