[
  {
    "id": 2745,
    "mediaId": 43,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "Media outlet InfoWars, filing for bankruptcy in the face of mounting legal pressure over remarks by founder and conspiracy theorist Alex Jones, that the 2012 Sandy Hook shootings were a hoax\n Johnson & Johnson, forced to pay $99m to settle a lawsuit alleging that the company fuelled West Virginia's opioid epidemic (as it was not part of the $5bn settlement the company previously made with other states)\n Former state Department press secretary Morgan Ortagus, removed from this year's congressional primary ballot by the Tennessee GOP (despite her endorsement from 45) as she only moved to the state in 2021\n 45's fundraising campaign, ordered to pay $1.3 million in legal fees to former White House aide and The Apprentice? star Omarosa Manigault Newman, as an arbitrator ruled the NDA she was forced to sign was too vague to enforce\n The town of Tiburon, California, having to pay a $150k to a couple who were racially profiled by police (while working inside their own store) and must institute new police training\n Rep. Marjorie Taylor Greene, fumbling badly in a televised deposition (over whether she should be disqualified from running for re-election) to avoid committing perjury\n House GOP leader Kevin McCarthy, denying that he ever said (to colleagues) he was going to recommend a 45 resignation, only to have audiotapes showing  that he did\n Brian Kolfage and Andrew Badolato, former Steve Bannon aides, pleading guilty to pocketing hundreds of thousands of dollars solicited from donors while promising all donations would pay for the border wall\n Dion Marsh, facing life in prison if convicted of federal hate crimes in violently attacking four Orthodox Jewish men and hitting three of them with a car in a violent one-day spree in New Jersey\n Netflix, whose shares lost 35% in a day by reporting its first drop in subscribers for more than a decade, blaming the 100m households that share their passwords with freeloaders, but also competition from Disney+\n Oklahoma corrections officer Matthew Ware, convicted of allowing white supremacists to attack two Black pretrial detainees and placing a Black detainee to be stretched in restraints for criticizing how Ware ran the center\n Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC), revealed as having being stopped once again by police for driving with a revoked license  and revealed as having partied in women's lingerie (after scolding liberals on transgender rights)\n Streaming subscription service CNN + (with hires such as Chris Wallace, Kasie Hunt.",
    "author": "",
    "title": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)"
  }
]