[
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 3042,
    "mediaId": 238,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "On the phone from her home at the far western edge of the North Carolina mountains, the former head of the Cherokee County GOP is seething because Rep. <span class='selected-term'>Madison Cawthorn</span>  the youngest member of the headline-grabbing Trump acolytes on Capitol Hill  has disappointed her once again.",
    "author": "Lisa Rab",
    "title": "Is North Carolina congressman and Trump acolyte Madison Cawthorn exposing the limits of the new celebrity politics?"
  },
  {
    "id": 3040,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "David Beard:\nBut <span class='selected-term'>Madison Cawthorn</span>, who is a relatively new representative from the far western part of North Carolina, representing Asheville and the mountain areas, he didn't like his new district because it was still pretty safely Republican, but slightly less so, where you could imagine in a really bad Republican year that he might be at some sort of risk.",
    "author": "",
    "title": "Texas primary preview, with Jeff Singer (transcript)"
  },
  {
    "id": 2987,
    "mediaId": 237,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is stumbling at home and abroad as his bid to play Republican kingmaker falls flat with voters and alienates colleagues.",
    "author": "David M. Drucker",
    "title": "'His act is wearing thin': North Carolina Republicans gripe about Madison Cawthorn"
  },
  {
    "id": 2981,
    "mediaId": 238,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Madison Cawthorn is in trouble. And it's entirely his own fault."
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n House Democrats raised $19.3 million in February, a committee record\n Trump's EPA chief Scott Pruitt weighing Senate run in Oklahoma\n New Hampshire Gov.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 2754,
    "mediaId": 43,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "'The end of men': Photos of 'family values' Republican <span class='selected-term'>Madison Cawthorn</span> in women's lingerie draw instant ridicule\nRaw Story, Sarah K. Burris, 4/22/2022\nThe dirt on Rep. Madison Cawthorn (R-NC) continues to come out and the latest is a series of photos of the young Republican partying with a group of ladies while wearing a black lace brassiere, large sterling silver hoop earrings, and a silver necklace he held seductively between his teeth.",
    "author": "",
    "title": "DKos Asheville Open Thread: 2nd"
  },
  {
    "id": 2718,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited Tuesday for having a loaded 9mm handgun at a TSA checkpoint at Charlotte Douglas International Airport, the second time he has been stopped with a firearm at an airport since taking office last year.",
    "author": "",
    "title": "Rep. Madison Cawthorn cited for having a gun at Charlotte airport"
  },
  {
    "id": 2706,
    "mediaId": 63,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Topline\nA wave of controversy hitting right-wing firebrand Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) shows no signs of letting up, with a Republican senator on Wednesday calling for an investigation into potential insider trading by the youngest member of Congresshere are the many other troubles he has faced since launching a congressional bid two years ago.",
    "author": "Nicholas Reimann",
    "title": "A Time Line Of Madison Cawthorn's MisstepsFrom Visiting Nazi Retreat To Wild Orgy Claims"
  },
  {
    "id": 2671,
    "mediaId": 43,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nMail-in registration deadline: April 22, 2022\nOnline registration deadline: April 22, 2022\nIn-person registration deadline: April 22, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\nGroup accuses Rep. Cawthorn of misconduct, files ethics complaint\nWLOS, Samiar Nefzi, 4/29/2022\nCongressman <span class='selected-term'>Madison Cawthorn</span> is now facing a complaint, accusing him of several ethical violations.",
    "author": "",
    "title": "DKos Asheville Open Thread: Mad"
  },
  {
    "id": 2633,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "US Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican of North Carolina, waves to the crowd after he spoke before former President Donald Trump takes the stage at a rally on April 9, 2022, in Selma, NC.",
    "author": "Camila DeChalus",
    "title": "Voters in Madison Cawthorn's North Carolina district have very mixed feelings about the freshman lawmaker as controversies swirl before his May 17 primary"
  }
]