[
  {
    "id": 2717,
    "mediaId": 129,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> was briefly detained by the police on Tuesday after trying to bring a loaded gun through airport security in Charlotte, N.C., in his carry-on bag, the second time in a little more than a year that the North Carolina Republican has been stopped from flying with a firearm.",
    "author": "",
    "title": "Madison Cawthorn Again Brought a Loaded Gun to the Airport, Officials Say"
  },
  {
    "id": 2719,
    "mediaId": 63,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "This is the second time a gun has been found on Cawthorn at an airport: The Transportation Security Administration discovered a 9mm handgun in his carry-on bag at Asheville Regional Airport in February 2021.\nVirtually every Monday or Tuesday we start the week out with another embarrassing headline from <span class='selected-term'>Madison Cawthorn</span> .",
    "author": "Nicholas Reimann",
    "title": "Madison Cawthorn Cited For Carrying Gun At Charlotte Airport"
  },
  {
    "id": 2720,
    "mediaId": 165,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ryan Bort",
    "title": "Madison Cawthorn Caught Trying to Bring a Gun Through Airport Security  Again"
  },
  {
    "id": 2721,
    "mediaId": 65,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited for being in possession of a firearm at Charlotte Douglas International Airport on Tuesday morning, according to multiple local media reports.",
    "author": "Paul Best",
    "title": "North Carolina Rep. Madison Cawthorn cited for having gun at Charlotte airport: reports"
  },
  {
    "id": 2722,
    "mediaId": 21,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Officers cited Rep. <span class='selected-term'>Madison Cawthorn</span> on Tuesday for carrying a loaded gun inside of Charlotte Douglas International Airport, the latest in a string of controversies Cawthorn has found himself in.",
    "author": "Brent D. Griffiths",
    "title": "Madison Cawthorn is cited for bringing a loaded gun into the Charlotte Airport"
  },
  {
    "id": 2723,
    "mediaId": 409,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> (R., N.C.) was stopped by police on Tuesday after trying to bring a loaded handgun on board a flight.",
    "author": "Arjun Singh",
    "title": "Madison Cawthorn Stopped by Police from Taking Gun on Flight"
  },
  {
    "id": 2712,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is favored to win the Republican primary in North Carolina's 11th Congressional District despite several run-ins with the law and fresh allegations of insider trading.",
    "author": "David M. Drucker",
    "title": "Rep. Madison Cawthorn holds GOP primary edge despite many unflattering headlines"
  }
]