[
  {
    "id": 2861,
    "mediaId": 33,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Federal Judge Amy Totenberg of the Northern District of Georgia said during a lengthy hearing that she has significant questions and concerns? about a recent ruling in a similar case, which blocked the same challenge against Rep. <span class='selected-term'>Madison Cawthorn</span>, a North Carolina Republican.",
    "author": "Marshall Cohen",
    "title": "Judge appears likely to allow January 6-related candidacy challenge against Marjorie Taylor Greene"
  },
  {
    "id": 2794,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, who also faces a Republican primary in mid-May.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld"
  },
  {
    "id": 1987,
    "mediaId": 147,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep the Republicans on the ballot, and in North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "Kate Brumback",
    "title": "WATCH: Rep. Marjorie Taylor Greene fights court challenge to her reelection"
  },
  {
    "id": 1992,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Free Speech for People levied a similar case against Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), but he successfully sued in federal court to block the proceedings.",
    "author": "",
    "title": "Rep. Greene declines to say if interfering with electoral count makes one an enemy of the Constitution'"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "AD WARS  Sen. THOM TILLIS isn't letting up in his opposition to fellow North Carolina Republican Rep. <span class='selected-term'>MADISON CAWTHORN</span>: A Tillis-aligned super PAC is putting up $310,000 to air an ad attacking Cawthorn, per Axios' Lachlan Markay.",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 2769,
    "mediaId": 163,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene faces 'insurrectionist' challenge"
  },
  {
    "id": 2771,
    "mediaId": 881,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "So <span class='selected-term'>Madison Cawthorn</span>, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] Mark Finchem are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "Insurrectionist' Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 2773,
    "mediaId": 593,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene Faces 'Insurrectionist' Challenge"
  },
  {
    "id": 2781,
    "mediaId": 129,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "That section declares that no person shall? hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath? to support the Constitution,? had then engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nSimilar cases have suffered setbacks in North Carolina, where a federal judge blocked a challenge against Representative <span class='selected-term'>Madison Cawthorn</span>, another far-right Republican, and in Arizona, where the Superior Court in Maricopa County ruled on Thursday that it did not have the authority to block the re-elections of two other conservative Republicans, Representatives Paul Gosar and Andy Biggs, and the candidacy for secretary of state of a state representative, Mark Finchem.",
    "author": "",
    "title": "Marjorie Taylor Greene Denies Insurrectionist' Charge in Court"
  },
  {
    "id": 2785,
    "mediaId": 33,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Greene filed a federal lawsuit to shut down the state process -- which is how GOP Rep. <span class='selected-term'>Madison Cawthorn</span> fended off a similar candidacy challenge in North Carolina.",
    "author": "Marshall Cohen",
    "title": "Rep. Marjorie Taylor Greene testifies for more than 3 hours in hearing on whether to disqualify her from seeking reelection"
  },
  {
    "id": 2788,
    "mediaId": 178,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep three Republicans on the ballot, and in North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "KATE BRUMBACK",
    "title": "Marjorie Taylor Greene hostile in testimony over eligibility"
  },
  {
    "id": 2655,
    "mediaId": 238,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Return to menu\nIt can be a challenge to keep tabs on all the controversies involving Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), the youngest member of Congress.",
    "author": "",
    "title": "Post Politics Now Grand jury being seated in Georgia in new phase of Trump election probe"
  }
]