[
  {
    "id": 3082,
    "mediaId": 238,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "The announcement has caused a firestorm, with far-right, high-profile backers ranging from North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to conservative activist Candace Owens taking to social media to voice their support for Robby Starbuck, a rival candidate who's been a mainstay of the pro-Trump movement,? Politico's Alex Isenstadt reports.",
    "author": "",
    "title": "Biden has promises left to keep on his LGBTQ agenda"
  },
  {
    "id": 2891,
    "mediaId": 238,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Is Palin going to stand out in a Republican caucus alongside the likes of Reps. <span class='selected-term'>Madison Cawthorn</span> (N.C.), Marjorie Taylor Greene (Ga.), Lauren Boebert (Colo.), and Matt Gaetz (Fla.)?",
    "author": "",
    "title": "Opinion: Sarah Palin is back, for a GOP that was remade in her image"
  },
  {
    "id": 233,
    "mediaId": 33,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Washington is meanwhile still reverberating with a bizarre episode triggered by Republican North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>'s claim he was invited to an orgy and saw leaders in the nation's anti-drug fight snorting cocaine.",
    "author": "Stephen Collinson",
    "title": "Obama and Romney are back, and show how American politics have changed for the worse"
  },
  {
    "id": 2856,
    "mediaId": 147,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "In 2020, political newcomer <span class='selected-term'>Madison Cawthorn</span> comfortably won a GOP congressional primary runoff over Trump's pick.",
    "author": "Gary D. Robertson",
    "title": "Trump's endorsement power tested in North Carolina Senate race"
  },
  {
    "id": 2822,
    "mediaId": 129,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "The decision by Judge Totenberg stood in stark contrast with a recent ruling in a similar case involving Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina.",
    "author": "",
    "title": "Effort to Remove Marjorie Taylor Greene From Ballot Can Proceed, Judge Says"
  },
  {
    "id": 2818,
    "mediaId": 124,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "The group filed a similar challenge on behalf of voters against Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C, which a federal judge in that state blocked last month.",
    "author": "",
    "title": "Challenge to Rep. Marjorie Taylor Greene's re-election bid can proceed, judge rules"
  },
  {
    "id": 2821,
    "mediaId": 34,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "The Atlanta judge's ruling came a month after a Trump-appointed judge dismissed a similar effort to disqualify Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) from running for reelection.",
    "author": "Jake Johnson",
    "title": "Judge Rules Effort to Bar Marjorie Taylor Greene From Office Over Jan. 6 Can Proceed"
  },
  {
    "id": 896,
    "mediaId": 675,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Marjorie Taylor Greene warns Dems of 'another way to play this game'"
  },
  {
    "id": 2799,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The first source of pain is freshman Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who has come under fire from Republican colleagues in recent weeks after making controversial comments.",
    "author": "Max Greenwood",
    "title": "Campaign Report  GOP jockeying ramps up in Senate primaries"
  },
  {
    "id": 3252,
    "mediaId": 169,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Recently, a photograph circulated online of Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., \"grilling a burger.\"",
    "author": "Ashlie D. Stevens",
    "title": "A new wave of politicians are shedding the misconception that cooking and politics don't mix"
  }
]