[
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "In 2020, a businessperson he backed in North Carolina fell to now-Representative <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 3121,
    "mediaId": 43,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "North Carolina representative <span class='selected-term'>Madison Cawthorn</span>, for example, was born in 1995.",
    "author": "Tony Wikrent",
    "title": "Wrap  Political Economy  January 2, 2022"
  },
  {
    "id": 843,
    "mediaId": 169,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Joe Kent  Washington, 3rd congressional district\nKent is running to unseat Rep. Jamie Herrera Beutler, R-Wash., who voted to impeach Trump after the Capitol riot, and is the most prominent candidate backed by the \"Insurrection Caucus,\" meaning Trump allies like Greene, Boebert, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Rep. Matt Gaetz of Florida.",
    "author": "Igor Derysh",
    "title": "Meet the scariest Republican candidates of 2022: It wasn't easy to pick 'em"
  },
  {
    "id": 1607,
    "mediaId": 43,
    "date": "1/15/2022 12:00:00 AM",
    "sentence": "In North Carolina today, eleven voters filed a challenge with the State Board of Elections to <span class='selected-term'>Madison Cawthorn</span> as a candidate for reelection on the grounds that he is disqualified by the third section of the Fourteenth Amendment, which prohibits from holding office anyone who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any state legislature, or as an executive or judicial officer of any state, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nNorth Carolina law says [t]he burden of proof shall be upon the candidate, who must show by a preponderance of the evidence of the record as a whole that he or she is qualified to be a candidate for the office.?\nIn late December 2021, Cawthorn told supporters to call your congressman and feel freeyou can lightly threaten them.",
    "author": "",
    "title": "When Your Worldview is too Big, The World Seems Overwhelming: Saturday's GNR"
  },
  {
    "id": 3093,
    "mediaId": 65,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "FORMER NFL PLAYER, IRAQ WAR VETERAN JAKE BEQUETTE CHALLENGES ARKANSAS SEN. BOOZMAN\n\"No one has more respect for President Trump than me, and that endorsement came before I got into the race,\" Bequette said, highlighting his own endorsements from Reps. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., and Burgess Owens, R-Utah.",
    "author": "Brooke Singman",
    "title": "Arkansas Senate race: Bequette charges Boozman, GOP establishment have 'not been leading from the front'"
  },
  {
    "id": 1506,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "@robbystarbuck is the correct pick for Tennessee's 5th district and Tennesseans have his back.?\nI endorsed @robbystarbuck months ago and I stand by my endorsement,? Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) tweeted.",
    "author": "Max Greenwood",
    "title": "Trump under fire over Tennessee primary nod"
  },
  {
    "id": 3038,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 1290,
    "mediaId": 43,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right Rep. <span class='selected-term'>Madison Cawthorn</span> announced Monday he'd run for re-election in the new 11th District, a seat in the western North Carolina mountains that includes most of the constituents he tried to leave behind after the Republicans passed their now-defunct congressional map in November.",
    "author": "",
    "title": "Morning Digest: Join us for our liveblog tonight as the 2022 primaries get underway in Texas"
  },
  {
    "id": 1292,
    "mediaId": 129,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "At a recent rally for Mr. Collins, Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Madison Cawthorn</span> of North Carolina made clear that their support for Mr. Collins was about opposition to the existing political order in Washington.",
    "author": "",
    "title": "A Sneak Peek at the Country's Midterm Battles: Primary Day in Texas"
  },
  {
    "id": 1263,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right freshman Rep. <span class='selected-term'>Madison Cawthorn</span> caught a break on filing day when a federal judge rejected a lawsuit that tried to keep the Republican off the ballot in this western North Carolina seat because of his actions both in the lead-up to and during the Jan. 6 attack on the U.S. Capitol.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 1238,
    "mediaId": 43,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "Wednesday, Mar 9, 2022  9:16:19 AM Pacific Standard Time  Jeff Singer\nNC-11: State Sen. Chuck Edwards' opening spot for the May Republican primary focuses on his business background, conservative record, and mountain values,? which is a not-so-subtle swipe at Rep. <span class='selected-term'>Madison Cawthorn</span>'s failed attempt to district hop.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/9"
  },
  {
    "id": 1228,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "We also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "Morning Digest: Oregon's new congressional district brings some old characters out of the woodwork"
  },
  {
    "id": 1147,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Right now, what you say about the enemy and saying Putin is an intelligent actor or there are reasons why he wanted to protect his flank  no, there wasn't.?\nMcCrory also takes issue with North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> calling Ukrainian President Volodymyr Zelensky a \"thug\" at a town hall and with President Joe Biden's initial dismissiveness of the Russians possibly invading Ukraine.",
    "author": "Salena Zito",
    "title": "McCrory on why he is still standing despite both Club for Growth and Trump against him"
  },
  {
    "id": 2970,
    "mediaId": 25,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n More\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Supreme Court tosses Wisconsin state legislative maps but keeps congressional maps in place"
  },
  {
    "id": 1055,
    "mediaId": 881,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "While his candidates didn't always win primariesAlabama Republicans rejected Trump-backed appointed Alabama Sen. Luther Strange for Roy Moore in 2017, and North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> beat a Trump-backed candidate in 2020his overall record was almost spotless when he was in the White House.",
    "author": "",
    "title": "Former President Donald Trump began the 2022 midterm elections with a flurry of endorsements, seeking to keep his iron grip on the GOP by elevating sycophants and scaring Republicans who might criticize his 2020 election lies into keeping their mouths shut."
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "(CNN)Sen. Thom Tillis of North Carolina is throwing his weight behind a primary opponent to freshman Rep. <span class='selected-term'>Madison Cawthorn</span> -- an extraordinary broadside against a fellow Republican from his home state, as internal frustration with the controversial MAGA firebrand reaches a boiling point.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2181,
    "mediaId": 43,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "? NC-11: While state Sen. Chuck Edwards' new spot avoids directly mentioning freshman incumbent <span class='selected-term'>Madison Cawthorn</span>, the person he's trying to unseat in next month's GOP primary, there's no question whom Edwards is comparing himself to when he says, \"If you want a celebrity, go watch the Kardashians.",
    "author": "",
    "title": "Morning Digest: Maryland's Republican governor and Democratic legislature reach redistricting deal"
  },
  {
    "id": 2141,
    "mediaId": 233,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "They include Rep. Ted Budd, a little-known congressman running for a Senate seat who won a surprise endorsement from Trump, and Rep. <span class='selected-term'>Madison Cawthorn</span>, who continues to have Trump's support even though he has faced backlash from members of his own party over various recent incendiary comments.",
    "author": "Editors",
    "title": "Ukraine evacuations, Trump rally, weekend at the Masters: 5 things to know this weekend"
  },
  {
    "id": 2857,
    "mediaId": 136,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Speakers at the rally include North Carolina Representatives <span class='selected-term'>Madison Cawthorn</span>, Dan Bishop and Greg Murphy.",
    "author": "Xander Landen",
    "title": "How to Watch Trump North Carolina Rally: Time, Live Stream for Selma Speech"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "A day after Mr. McCarthy reprimanded Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina for saying that colleagues in Washington had held orgies and used cocaine, Mr. Trump awarded Mr. Cawthorn a coveted speaking slot at his next rally.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 2024,
    "mediaId": 129,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Jasmine Beach-Ferrara, a gay minister who has raised $1.4 million to oust Representative <span class='selected-term'>Madison Cawthorn</span>, the far-right Republican, from his North Carolina seat.",
    "author": "",
    "title": "Democratic Dollars Flow Once Again to Likely Lost Causes"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "But Trump's risker endorsement in the state is for Rep. <span class='selected-term'>Madison Cawthorn</span>'s reelection.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 2803,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The Tar Heel State is, however, proving troublesome in other ways after a former district staff member for Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) accused the 26-year-old lawmaker of improperly firing her after denying family and medical leave.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Biden administration makes huge election year decision"
  },
  {
    "id": 1997,
    "mediaId": 136,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Republican Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina survived a similar effort to invalidate his reelection bid last month.",
    "author": "Aila Slisco",
    "title": "Trump Blames Georgia Republicans for Taylor Greene 'Going Through Hell'"
  },
  {
    "id": 2004,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The trio discussed yet another primary in North Carolina for a House race in the far western part of the state, which involves <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "",
    "title": "Highlights from The Downballot: Confusion in New York over redistricting and a May primary overview"
  },
  {
    "id": 2794,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, who also faces a Republican primary in mid-May.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld"
  },
  {
    "id": 1978,
    "mediaId": 112,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed a similar challenge on behalf of voters in western North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "Associated Press",
    "title": "Marjorie Taylor Greene testifies in constituent suit seeking to disqualify her from re-election to Congress"
  },
  {
    "id": 1987,
    "mediaId": 147,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep the Republicans on the ballot, and in North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "Kate Brumback",
    "title": "WATCH: Rep. Marjorie Taylor Greene fights court challenge to her reelection"
  },
  {
    "id": 1992,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Free Speech for People levied a similar case against Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), but he successfully sued in federal court to block the proceedings.",
    "author": "",
    "title": "Rep. Greene declines to say if interfering with electoral count makes one an enemy of the Constitution'"
  },
  {
    "id": 2763,
    "mediaId": 237,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> blasted the Left for dredging up photographs of him wearing women's lingerie, saying the newly resurfaced photos amount to a desperate attempt to hurt him.",
    "author": "Misty Severi",
    "title": "Cawthorn slams Left for unearthing 'goofy' photos of him in lingerie"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "AD WARS  Sen. THOM TILLIS isn't letting up in his opposition to fellow North Carolina Republican Rep. <span class='selected-term'>MADISON CAWTHORN</span>: A Tillis-aligned super PAC is putting up $310,000 to air an ad attacking Cawthorn, per Axios' Lachlan Markay.",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 2771,
    "mediaId": 881,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "So <span class='selected-term'>Madison Cawthorn</span>, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] Mark Finchem are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "Insurrectionist' Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 2788,
    "mediaId": 178,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep three Republicans on the ballot, and in North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "KATE BRUMBACK",
    "title": "Marjorie Taylor Greene hostile in testimony over eligibility"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "? NC-11: Axios reports that Results for North Carolina, a super PAC close to Sen. Thom Tillis, is spending $310,000 on an ad campaign against Rep. <span class='selected-term'>Madison Cawthorn</span>, which makes this the first major outside spending of the May 17 Republican primary.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  },
  {
    "id": 1941,
    "mediaId": 151,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "THE GREAT LAKES STATE  In northern Michigan, Trucker Randy and pay for play' claims roil Senate race,? by Jonathan Oosting, Bridge Michigan: A Republican state Senate candidate in northern Michigan says he was offered a $50,000 government job to withdraw from the race as part of a plot involving well-known conservative radio host Trucker Randy' Bishop, who is running for the same seat as a Democrat.?\nPRIMARY SOURCES  <span class='selected-term'>Madison Cawthorn</span>'s Blunders Open Door to Primary Challengers,? by Natalie Andrews, The Wall Street Journal: The brashness that catapulted freshman Rep. Madison Cawthorn to national attention is wearing on some of his voters here in his rural district in the Blue Ridge Mountains.?\nDAY IN COURT  Herbster files defamation lawsuit against Slama over assault allegations,? by Dan Crisler, Omaha World-Herald: Charles W. Herbster, a businessman and a front-runner for the Republican nomination to be Nebraska's next governor, filed a lawsuit Friday against State Sen. Julie Slama after she, along with seven other women, accused him this month of groping them.?\nTHE SHOW-ME STATE  Eric Greitens posts, then deletes, video featuring KCPD ride along.",
    "author": "",
    "title": "Southern border is the backdrop for GOP ads"
  },
  {
    "id": 1962,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Monday, Apr 25, 2022  1:52:47 PM Pacific Daylight Time  Stephen Wolf\nNC-11: State Sen. Chuck Edwards' latest ad for next month's Republican primary cuts right to the chase and calls far-right Rep. <span class='selected-term'>Madison Cawthorn</span> an Instagramer who posts all day but doesn't actually do anything to solve the country's ongoing problems.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/25"
  },
  {
    "id": 1910,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Chuck Edwards for Congress, Instagram.? Ad by ad, North Carolina state Sen. Chuck Edwards (R) has gotten more direct and sarcastic with his mockery of Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.).",
    "author": "David Weigel",
    "title": "The Trailer: The pandemic planner, the crypto billionaire and a bunch of angry Democrats"
  },
  {
    "id": 1919,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) and a PAC aligned with him have helped Chuck Edwards, a primary challenger of embattled Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.).",
    "author": "",
    "title": "Post Politics Now Biden issues first pardons, commutations of his presidency"
  },
  {
    "id": 1931,
    "mediaId": 43,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "? NC-11: State Sen. Chuck Edwards' latest ad for next month's Republican primary cuts right to the chase and calls far-right Rep. <span class='selected-term'>Madison Cawthorn</span> an Instagramer who posts all day but doesn't actually do anything to solve the country's ongoing problems.",
    "author": "",
    "title": "Morning Digest: Michigan GOP nominates Big Lie boosters for secretary of state and attorney general"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "\"There will be more Marjorie Taylor Greenes and <span class='selected-term'>Madison Cawthorn</span>s nominated for federal office and for state office and for local officefar more than there are Fred Uptons.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 1890,
    "mediaId": 43,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "We have talked about <span class='selected-term'>Madison Cawthorn</span> plenty on this show.",
    "author": "",
    "title": "The Downballot: Big, big May primary preview (transcript)"
  },
  {
    "id": 126,
    "mediaId": 43,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "? NC-11: GOPAC, a Republican super PAC that says it hasn't endorsed anyone in this race, is out with a survey from Differentiators Data that shows freshman Rep. <span class='selected-term'>Madison Cawthorn</span> leading state Sen. Chuck Edwards 38-21 in next month's Republican primary.",
    "author": "",
    "title": "Morning Digest: Trump pick for Nebraska governor attacks woman who accused him of assault in new ad"
  },
  {
    "id": 1850,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "He was also on the losing end of a North Carolina primary in 2020 won by Representative <span class='selected-term'>Madison Cawthorn</span> and an Alabama Senate primary in 2017 in which Roy S. Moore defeated Senator Luther Strange.",
    "author": "",
    "title": "Why Republican Insurgents Are Struggling to Topple G.O.P. Governors"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 28, 2022\nCawthorn later tweeted a screenshot of an article from The Epoch Times titled \"Rep. Cawthorn Says 'Establishment' Targeting Him With 'Coordinated Drip Campaign.'\"",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  },
  {
    "id": 2679,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The Fire <span class='selected-term'>Madison Cawthorn</span> group, operated by the American Muckrakers PAC, accused the North Carolina congressman of ethical violations, including paying thousands of dollars worth of gifts, loans and other benefits to his staffer and close aide, Stephen Smith, 23, which were not declared.",
    "author": "Ewan Palmer",
    "title": "What Madison Cawthorn, Stephen Smith Venmo Messages Say"
  },
  {
    "id": 2682,
    "mediaId": 237,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Several Republican lawmakers, such as Reps. Paul Gosar, Andy Biggs, and <span class='selected-term'>Madison Cawthorn</span>, have been targeted with similar lawsuits.",
    "author": "Ryan King",
    "title": "Marjorie Taylor Greene's lawyers attempt to block 'Marshall law' text from court record"
  },
  {
    "id": 2665,
    "mediaId": 195,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "News\nThe flood of controversies surrounding Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) shows no sign of ceasing just weeks before his May 17 primary, raising questions as to whether he can avoid a runoff despite being one of the highest-profile freshmen in the House.",
    "author": "Tal Axelrod",
    "title": "Mounting scandals fuel uncertainty over Cawthorn's reelection"
  },
  {
    "id": 1767,
    "mediaId": 136,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Meanwhile, voters have filed complaints with state elections officials to disqualify Georgia Representative Marjorie Taylor Greene and North Carolina Representative <span class='selected-term'>Madison Cawthorn</span>both high-profile Trump alliesfrom seeking re-election for statements they made that have been construed as supportive of the January 6 siege on the U.S. Capitol.",
    "author": "Jon Jackson",
    "title": "J.D. Vance Wins Ohio Primary in Crucial Test of Trump's Power"
  },
  {
    "id": 2644,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "The leader of the \"Let's Go Brandon\" cryptocurrency revealed that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC) traded the meme coin three weeks before NASCAR driver Brandon Brown announced he had struck a sponsorship deal with the coin, heightening suspicion from watchdogs that the beleaguered congressman may have violated insider trading laws.",
    "author": "Andrew Kerr",
    "title": "Meme coin leader's admission could land Madison Cawthorn in more hot water"
  },
  {
    "id": 1746,
    "mediaId": 43,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "House\n? NC-11: It's impossible to fit every article of freshman Rep. <span class='selected-term'>Madison Cawthorn</span>'s dirty laundry into one 30-second commercial, but Sen. Thom Tillis' allies at Results for NC do the best they can in their newest spot for the May 17 GOP primary.",
    "author": "",
    "title": "Morning Digest: How an unknown QAnon candidate shocked the Ohio GOP establishment on Tuesday night"
  },
  {
    "id": 3161,
    "mediaId": 195,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": " The Washington Post: Inside the Republican campaign to take down Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.).",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Biden talks inflation; House helps Ukraine"
  },
  {
    "id": 3148,
    "mediaId": 129,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Hines, a 26-year-old former college football recruit often compared to Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina before Cawthorn's recent string of troubles, is running for a U.S. House seat representing the exurban area just south of Raleigh.",
    "author": "",
    "title": "Corman endorses Barletta for governor in Pennsylvania, as Republicans step up their effort to halt Mastriano."
  },
  {
    "id": 3305,
    "mediaId": 195,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "But with the arrival of Thursday's subpoenas, not even House Minority Leader Kevin McCarthy (R-Calif.) would say he'd reject the entreaty outright.? How Republicans are handling the subpoenas\nInteresting read  The Entirely Predictable Unraveling of <span class='selected-term'>Madison Cawthorn</span>':\nPolitico's Michael Kruse writes: A string of embarrassing incidents has led many to question whether the young congressman from North Carolina was really ready for the job.?\nRead the profile on Cawthorn  and how he got to where he is.",
    "author": "Cate Martel",
    "title": "The Hill's 12:30 Report  Elon Musk's Twitter deal hits snag"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) faced a similar lawsuit, which was dismissed in March, yet Cawthorn still faces a difficult primary, with senior Republicans opposing him.",
    "author": "",
    "title": "Senate primaries to watch"
  },
  {
    "id": 3387,
    "mediaId": 195,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "North Carolinas 11th District GOP primary\nRep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) has stirred controversy after controversy since entering the House in early 2021.",
    "author": "Max Greenwood",
    "title": "Seven primary races to watch on Tuesday"
  }
]