[
  {
    "id": 2717,
    "mediaId": 129,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> was briefly detained by the police on Tuesday after trying to bring a loaded gun through airport security in Charlotte, N.C., in his carry-on bag, the second time in a little more than a year that the North Carolina Republican has been stopped from flying with a firearm.",
    "author": "",
    "title": "Madison Cawthorn Again Brought a Loaded Gun to the Airport, Officials Say"
  },
  {
    "id": 2718,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited Tuesday for having a loaded 9mm handgun at a TSA checkpoint at Charlotte Douglas International Airport, the second time he has been stopped with a firearm at an airport since taking office last year.",
    "author": "",
    "title": "Rep. Madison Cawthorn cited for having a gun at Charlotte airport"
  },
  {
    "id": 2721,
    "mediaId": 65,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited for being in possession of a firearm at Charlotte Douglas International Airport on Tuesday morning, according to multiple local media reports.",
    "author": "Paul Best",
    "title": "North Carolina Rep. Madison Cawthorn cited for having gun at Charlotte airport: reports"
  },
  {
    "id": 2722,
    "mediaId": 21,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Officers cited Rep. <span class='selected-term'>Madison Cawthorn</span> on Tuesday for carrying a loaded gun inside of Charlotte Douglas International Airport, the latest in a string of controversies Cawthorn has found himself in.",
    "author": "Brent D. Griffiths",
    "title": "Madison Cawthorn is cited for bringing a loaded gun into the Charlotte Airport"
  },
  {
    "id": 2723,
    "mediaId": 409,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> (R., N.C.) was stopped by police on Tuesday after trying to bring a loaded handgun on board a flight.",
    "author": "Arjun Singh",
    "title": "Madison Cawthorn Stopped by Police from Taking Gun on Flight"
  },
  {
    "id": 2724,
    "mediaId": 376,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> was cited Tuesday for possession of a dangerous weapon on city property after a gun was discovered in his bag at a security screening checkpoint in Charlotte Douglas International Airport in North Carolina.",
    "author": "Chris Marquette",
    "title": "Rep. Madison Cawthorn cited for bringing gun through Charlotte airport"
  },
  {
    "id": 2714,
    "mediaId": 881,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Madison Cawthorn</span> simply cannot keep it together right now.",
    "author": "Paul Blest",
    "title": "Madison Cawthorn Is Having a Hell of a Week"
  }
]