[
  {
    "id": 3060,
    "mediaId": 65,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "Bequette has recently seen endorsements from Reps. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., and Burgess Owens, R-Utah.",
    "author": "Brooke Singman",
    "title": "Arkansas super PAC spends $900K on ads supporting GOP Senate candidate Jake Bequette"
  },
  {
    "id": 2862,
    "mediaId": 43,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nJohn Oliver to Kevin McCarthy: You 'raised the monster' that is <span class='selected-term'>Madison Cawthorn</span> and 'it's your effing problem'\nRaw Story, Sarah K. Burris, 4/4/2022\nRep. Kevin McCarthy (R-CA) revealed this week that he no longer has \"trust\" in Rep. Madison Cawthorn (R-NC), the young official who outed GOP members for having \"sexual get-togethers\" and snorting cocaine.",
    "author": "",
    "title": "DKos Asheville Open Thread: Your weekly Cawthorn, packed full of (your words here). And bears!"
  },
  {
    "id": 2815,
    "mediaId": 376,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "GOP Sen. Thom Tillis plans to appear as a special guest? at a fundraiser slated for next week benefiting Chuck Edwards, a primary challenger of embattled North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, according to an invitation sent to potential donors in the lobbying sector.",
    "author": "Kate Ackley",
    "title": "GOP senators, lobbyists aid challengers to lightning rod House members"
  },
  {
    "id": 2747,
    "mediaId": 136,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "A new advertisement on Thursday calling out GOP Representative <span class='selected-term'>Madison Cawthorn</span>'s \"lies\" was paid for by a super PAC that is aligned with GOP Senator Thom Tillis.",
    "author": "Andrew Stanton",
    "title": "Trump-Backed Cawthorn's 'Lies' Ripped in Ad by PAC Linked to GOP's Tillis"
  },
  {
    "id": 2740,
    "mediaId": 169,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,\" Tillis said last month.",
    "author": "Jon Skolnik",
    "title": "Madison Cawthorn called out for \"lying\" in new ad funded by Republican senator's super PAC"
  },
  {
    "id": 136,
    "mediaId": 151,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "They're running out of things to throw at me...\nShare your most embarrassing vacay pics in the repliesg??https://t.co/YicRk0Albu\n <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 22, 2022\n9 days ago: According to reporting from the local site Smoky Mountain News, Lisa Wiggins, a former caseworker and aide to the lawmaker, filed a workplace complaint against the congressman claiming that Cawthorn denied her leave when two family members passed away within the same week.",
    "author": "",
    "title": "A new Democratic super PAC is endorsing 11 more candidates and spending $10 million in primary contests."
  },
  {
    "id": 2714,
    "mediaId": 881,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Madison Cawthorn</span> simply cannot keep it together right now.",
    "author": "Paul Blest",
    "title": "Madison Cawthorn Is Having a Hell of a Week"
  },
  {
    "id": 2672,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) has been hit with a new ethics complaint by a political action committee seeking to unseat him that hits the embattled lawmaker with a host of accusations.",
    "author": "Emily Brooks",
    "title": "Cawthorn hit with new ethics complaint filed by rival PAC"
  }
]