[
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 954,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/24"
  },
  {
    "id": 3038,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 3040,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "David Beard:\nBut <span class='selected-term'>Madison Cawthorn</span>, who is a relatively new representative from the far western part of North Carolina, representing Asheville and the mountain areas, he didn't like his new district because it was still pretty safely Republican, but slightly less so, where you could imagine in a really bad Republican year that he might be at some sort of risk.",
    "author": "",
    "title": "Texas primary preview, with Jeff Singer (transcript)"
  },
  {
    "id": 1263,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right freshman Rep. <span class='selected-term'>Madison Cawthorn</span> caught a break on filing day when a federal judge rejected a lawsuit that tried to keep the Republican off the ballot in this western North Carolina seat because of his actions both in the lead-up to and during the Jan. 6 attack on the U.S. Capitol.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 3007,
    "mediaId": 43,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "In a recipe for infighting, the far-right House Freedom Caucushome to Reps. Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosaris getting ready to make a play for increased power.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 3000,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "We also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "North Carolina, South Korea, and why you should Run For Something (transcript)"
  },
  {
    "id": 2992,
    "mediaId": 43,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "? NC-11: Local media reported Wednesday that the North Carolina State Highway Patrol had charged Republican Rep. <span class='selected-term'>Madison Cawthorn</span> days before with driving on a revoked license.",
    "author": "",
    "title": "Morning Digest: Everything you need to know about overriding vetoes in Louisiana"
  },
  {
    "id": 2344,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Brnovich is widely considered the strongest Republican candidate, but Masters boasts endorsements from Freedom Caucus-aligned Republicans such as <span class='selected-term'>Madison Cawthorn</span> and Tucker Carlson.",
    "author": "",
    "title": "Seats in Pennsylvania and Wisconsin"
  },
  {
    "id": 2942,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\n<span class='selected-term'>Madison Cawthorn</span> turns his slander onto the Republican Party\nRepublicans freaking out about Madison Cawthorn's allegations of 'cocaine' and 'orgies'\nMadison Cawthorn changes cocaine and orgy allegations in heated meeting with GOP leader McCarthy\nThis is a short blurb about Daily Kos.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "Madison Cawthorn vows to keep talking about Republican cocaine use and orgies"
  },
  {
    "id": 2944,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. <span class='selected-term'>Madison Cawthorn</span> in the May 17 Republican primary for North Carolina's 11th District, saying the next day that the incumbent has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nTillis threw in an unsubtle reference to Cawthorn's previous attempt to leave his constituents behind to run for an even more conservative district in the Charlotte area that he barely represented before a new court-drawn map foreclosed that possibility, antics that likely did him far more damage at home than his litany of embarrassing behavior.",
    "author": "",
    "title": "North Carolina senator endorses effort to deny renomination to Madison Cawthorn in May"
  },
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on <span class='selected-term'>Madison Cawthorn</span> (it's not really about cocaine and orgies); pick apart a huge blunder that led the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "? NC-11: Axios reports that Results for North Carolina, a super PAC close to Sen. Thom Tillis, is spending $310,000 on an ad campaign against Rep. <span class='selected-term'>Madison Cawthorn</span>, which makes this the first major outside spending of the May 17 Republican primary.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  }
]