[
  {
    "id": 2983,
    "mediaId": 43,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "Fox News' Tucker Carlson has all but declared eternal fealty to the Motherland, and Trumpian Mini-Me's like <span class='selected-term'>Madison Cawthorn</span> and Marjorie Taylor Greene have decided to give plenty of aid and comfort to their longtime war-criminal crush, but the problem actually runs deeper than that.",
    "author": "",
    "title": "Missouri radio station continues to air literal Russian war propaganda"
  },
  {
    "id": 2878,
    "mediaId": 21,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Fox News host and former GOP politician Trey Gowdy has asked Rep. <span class='selected-term'>Madison Cawthorn</span> to reveal who in DC's elite did drugs in front of him and invited him to sex parties  or admit that he was lying.",
    "author": "Cheryl Teh",
    "title": "Fox News host says Madison Cawthorn needs to name those involved in orgies and drugs, or admit to making up stories about DC's elite"
  },
  {
    "id": 896,
    "mediaId": 675,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Marjorie Taylor Greene warns Dems of 'another way to play this game'"
  },
  {
    "id": 2799,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The first source of pain is freshman Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who has come under fire from Republican colleagues in recent weeks after making controversial comments.",
    "author": "Max Greenwood",
    "title": "Campaign Report  GOP jockeying ramps up in Senate primaries"
  },
  {
    "id": 2794,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, who also faces a Republican primary in mid-May.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld"
  },
  {
    "id": 2634,
    "mediaId": 129,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "If Madison Were Omar \nTo the Editor:\nRe Police Accuse Lawmaker of Trying to Fly With Gun? (news article, April 27), about Representative <span class='selected-term'>Madison Cawthorn</span> trying to bring a gun through airport security:\nInstead of this ultraright white man, imagine this story being about another professional American man, this one with swarthy skin and named Omar, who was twice caught trying to bring a loaded gun onto a commercial flight.",
    "author": "",
    "title": "Tucker Carlson's Influence on America and Its Media"
  },
  {
    "id": 2615,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Susan Collinsest Susan Collins That Ever Susan Collinsed"
  }
]