[
  {
    "id": 699,
    "mediaId": 376,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Colorado Rep. Lauren Boebert raised $3.8 million last year, and North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> raised $3.1 million.",
    "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
    "title": "House GOP feels no fundraising backlash for opposing electors"
  },
  {
    "id": 1238,
    "mediaId": 43,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "Wednesday, Mar 9, 2022  9:16:19 AM Pacific Standard Time  Jeff Singer\nNC-11: State Sen. Chuck Edwards' opening spot for the May Republican primary focuses on his business background, conservative record, and mountain values,? which is a not-so-subtle swipe at Rep. <span class='selected-term'>Madison Cawthorn</span>'s failed attempt to district hop.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/9"
  },
  {
    "id": 2344,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Brnovich is widely considered the strongest Republican candidate, but Masters boasts endorsements from Freedom Caucus-aligned Republicans such as <span class='selected-term'>Madison Cawthorn</span> and Tucker Carlson.",
    "author": "",
    "title": "Seats in Pennsylvania and Wisconsin"
  },
  {
    "id": 2949,
    "mediaId": 124,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Congressional Republicans are fuming after Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., claimed some lawmakers have invited him to sex parties and have used cocaine in front of him without offering any specifics.",
    "author": "",
    "title": "The most popular  and unpopular  2022 candidate qualities"
  },
  {
    "id": 2024,
    "mediaId": 129,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Jasmine Beach-Ferrara, a gay minister who has raised $1.4 million to oust Representative <span class='selected-term'>Madison Cawthorn</span>, the far-right Republican, from his North Carolina seat.",
    "author": "",
    "title": "Democratic Dollars Flow Once Again to Likely Lost Causes"
  },
  {
    "id": 2810,
    "mediaId": 43,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "x\nx\nx\nBonus Good News:\ngg Republicans in Disarray gg\nx\nFmr staffer to <span class='selected-term'>Madison Cawthorn</span> has filed an explosive complaint against him, alleging illegal and immoral? acts, that he doesn't care about constituents, there's more liquor than water in his district office, and he is a habitual liar? and bad person.?https://t.co/mOqUuQXbKx\n Ron Filipkowski gg (@RonFilipkowski) April 18, 2022\nOpinion: Mike Lee has some explaining to do, Jennifer Rubin, Washington Post, April 18, 2022.",
    "author": "",
    "title": "What Have Dems Done for Us Lately? GLAD YOU ASKED!"
  },
  {
    "id": 1767,
    "mediaId": 136,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Meanwhile, voters have filed complaints with state elections officials to disqualify Georgia Representative Marjorie Taylor Greene and North Carolina Representative <span class='selected-term'>Madison Cawthorn</span>both high-profile Trump alliesfrom seeking re-election for statements they made that have been construed as supportive of the January 6 siege on the U.S. Capitol.",
    "author": "Jon Jackson",
    "title": "J.D. Vance Wins Ohio Primary in Crucial Test of Trump's Power"
  },
  {
    "id": 2644,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "The leader of the \"Let's Go Brandon\" cryptocurrency revealed that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC) traded the meme coin three weeks before NASCAR driver Brandon Brown announced he had struck a sponsorship deal with the coin, heightening suspicion from watchdogs that the beleaguered congressman may have violated insider trading laws.",
    "author": "Andrew Kerr",
    "title": "Meme coin leader's admission could land Madison Cawthorn in more hot water"
  },
  {
    "id": 2650,
    "mediaId": 34,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Accompanying all of this will be the ongoing antics of Trump's whacky surrogatesTucker Carlson, Marjorie Taylor Greene, Matt Gaetz, Steven Bannon, <span class='selected-term'>Madison Cawthorn</span>, Trump Junior, et alwho mimic Trump's bravado, bigotry, divisiveness, and disdain for the law.",
    "author": "Robert Reich",
    "title": "The Democrats' Secret Sauce for Winning the Midterms"
  }
]