[
  {
    "id": 3049,
    "mediaId": 43,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Proposed NC congressional map could put <span class='selected-term'>Madison Cawthorn</span>'s seat in significant electoral danger: report\nRaw Story, Matthew Chapman, 2/14/2022\nOn Monday, writing for Carolina Journal, former North Carolina GOP Executive Director Dallas Woodhouse outlined how a proposed state congressional map to remediate the illegal gerrymander struck down by state courts could affect one district in particular: that of freshman GOP Rep. Madison Cawthorn.",
    "author": "",
    "title": "DKos Asheville Open Thread: 14th Amendment moves,"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Besieged by multiplying scandals and salacious accusations, Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  },
  {
    "id": 97,
    "mediaId": 195,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is speaking out more forcefully against a barrage of negative news stories about him as he tries to hang on to political life less than two weeks before a contentious primary vote with top Republicans in his state working against him.",
    "author": "Emily Brooks",
    "title": "Cawthorn ramps up defense as crass videos add to mountain of bad press"
  },
  {
    "id": 2628,
    "mediaId": 163,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Saul Loeb/Pool via REUTERS/File Photo\nWASHINGTON, May 5 (Reuters) - A grainy 28-second video showing a naked young man gyrating against someone in bed amid squeals and laughter was the latest in a string of episodes that has turned Republicans against one of their own: the brash U.S. Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "David Morgan",
    "title": "Nude video latest scandal turning Republicans against U.S. Rep. Cawthorn"
  }
]