[
  {
    "id": 2867,
    "mediaId": 151,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Also booked for the rally is Rep. <span class='selected-term'>Madison Cawthorn</span>, the freshman congressman from the western part of the state who has angered top House Republicans after talking about orgies and cocaine.",
    "author": "",
    "title": "Local conservatives revolt against Trump House favorite"
  },
  {
    "id": 2827,
    "mediaId": 21,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kayla Epstein",
    "title": "Trump's allies say his Twitter ban has backfired as they keep his voice loud on the social network: 'It's a net benefit'"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "A day after Mr. McCarthy reprimanded Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina for saying that colleagues in Washington had held orgies and used cocaine, Mr. Trump awarded Mr. Cawthorn a coveted speaking slot at his next rally.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 2822,
    "mediaId": 129,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "The decision by Judge Totenberg stood in stark contrast with a recent ruling in a similar case involving Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina.",
    "author": "",
    "title": "Effort to Remove Marjorie Taylor Greene From Ballot Can Proceed, Judge Says"
  },
  {
    "id": 2634,
    "mediaId": 129,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "If Madison Were Omar \nTo the Editor:\nRe Police Accuse Lawmaker of Trying to Fly With Gun? (news article, April 27), about Representative <span class='selected-term'>Madison Cawthorn</span> trying to bring a gun through airport security:\nInstead of this ultraright white man, imagine this story being about another professional American man, this one with swarthy skin and named Omar, who was twice caught trying to bring a loaded gun onto a commercial flight.",
    "author": "",
    "title": "Tucker Carlson's Influence on America and Its Media"
  }
]