[
  {
    "id": 3042,
    "mediaId": 238,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "On the phone from her home at the far western edge of the North Carolina mountains, the former head of the Cherokee County GOP is seething because Rep. <span class='selected-term'>Madison Cawthorn</span>  the youngest member of the headline-grabbing Trump acolytes on Capitol Hill  has disappointed her once again.",
    "author": "Lisa Rab",
    "title": "Is North Carolina congressman and Trump acolyte Madison Cawthorn exposing the limits of the new celebrity politics?"
  },
  {
    "id": 2987,
    "mediaId": 237,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is stumbling at home and abroad as his bid to play Republican kingmaker falls flat with voters and alienates colleagues.",
    "author": "David M. Drucker",
    "title": "'His act is wearing thin': North Carolina Republicans gripe about Madison Cawthorn"
  },
  {
    "id": 2960,
    "mediaId": 43,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "The non-partisan group previously filed a separate challenge against the Constitutional eligibility of North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to run in 2022 on the same basis.",
    "author": "",
    "title": "Good News! On Biden's Economy and Trump's Insurrectionists: 'BradCast' 3/24/2022"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Washington, DC (CNN)Rep. <span class='selected-term'>Madison Cawthorn</span> -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "Morning Digest: Why GOP leaders finally want to boot <span class='selected-term'>Madison Cawthorn</span> (it's not really about orgies)\nDaily Kos Staff, 4/1/2022\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 2895,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "He isn't the same kind of comedy fodder that MTG, Lauren Boebert, and <span class='selected-term'>Madison Cawthorn</span> are.",
    "author": "",
    "title": "Gary Snyder for Congress"
  },
  {
    "id": 2826,
    "mediaId": 43,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Several Democrats take on incumbent Rep. Cawthorn\nWLOS, Kimberly King, 3/30/2022\nCongressman <span class='selected-term'>Madison Cawthorn</span>, who represents North Carolina's 11th District, faces his first re-election on May 17 against seven Republican challengers.",
    "author": "",
    "title": "DKos Asheville Open Thread: Replacing Cawthorn, Meadows voter fraud, WNC judges all"
  },
  {
    "id": 149,
    "mediaId": 147,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "(CHEERING AND APPLAUSE)\nGeoff Bennett:\nA similar challenge to North Carolina Republican <span class='selected-term'>Madison Cawthorn</span> was blocked by a federal judge last month.",
    "author": "Lisa Desjardins",
    "title": "GOP's McCarthy and Greene are confronted by their own words after Jan. 6"
  },
  {
    "id": 2757,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Two pictures of Republican Rep. <span class='selected-term'>Madison Cawthorn</span> (N.C.) shared with Politico show the embattled congressman at what appears to be a party in women's lingerie.",
    "author": "Lexi Lonas",
    "title": "Photos show Cawthorn wearing lingerie at apparent party: Politico"
  },
  {
    "id": 2724,
    "mediaId": 376,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> was cited Tuesday for possession of a dangerous weapon on city property after a gun was discovered in his bag at a security screening checkpoint in Charlotte Douglas International Airport in North Carolina.",
    "author": "Chris Marquette",
    "title": "Rep. Madison Cawthorn cited for bringing gun through Charlotte airport"
  },
  {
    "id": 2674,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Madison Cawthorn</span> ( R-N.C.) has been a lightning rod for controversy.",
    "author": "Sarakshi Rai",
    "title": "Timeline of Madison Cawthorn controversies"
  },
  {
    "id": 2682,
    "mediaId": 237,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Several Republican lawmakers, such as Reps. Paul Gosar, Andy Biggs, and <span class='selected-term'>Madison Cawthorn</span>, have been targeted with similar lawsuits.",
    "author": "Ryan King",
    "title": "Marjorie Taylor Greene's lawyers attempt to block 'Marshall law' text from court record"
  },
  {
    "id": 2643,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) May 4, 2022\nThe American Muckrakers PAC, a group trying to achieve Cawthorn's defeat in this year's election, posted the video on its website, FireMadison.com, according to a Charlotte Observer report.",
    "author": "Ryan King",
    "title": "Madison Cawthorn says 'blackmail won't win' after nude video surfaces"
  }
]