[
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "(CNN)Sen. Thom Tillis of North Carolina is throwing his weight behind a primary opponent to freshman Rep. <span class='selected-term'>Madison Cawthorn</span> -- an extraordinary broadside against a fellow Republican from his home state, as internal frustration with the controversial MAGA firebrand reaches a boiling point.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Washington, DC (CNN)Rep. <span class='selected-term'>Madison Cawthorn</span> -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 3268,
    "mediaId": 43,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "Cawthorn addresses video released by opposition group showing him naked in bed being crass'\nCNN, Mary Kay Mallonee, 5/5/2022\nAn opposition group that is actively campaigning against Rep. <span class='selected-term'>Madison Cawthorn</span> has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, being crass with a friend? and acting foolish.?\nAfter the video appeared on social media, Cawthorn tweeted, A new hit against me just dropped.",
    "author": "",
    "title": "North Carolina Open Thread: Cawthorn's Corner"
  },
  {
    "id": 3442,
    "mediaId": 195,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC) will face primary voters on Tuesday amid a pileup of controversies that has built up around him in recent months.",
    "author": "",
    "title": "Madison Cawthorn faces primary voters on Tuesday"
  }
]