[
  {
    "id": 2813,
    "mediaId": 136,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Free Speech for People filed a similar lawsuit against Republican Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina, but the effort was blocked by U.S. District Richard Myers.",
    "author": "Alexandra Hutzler",
    "title": "GOP Likely Keeps House Seat if Marjorie Taylor Greene Is Booted Off Ballot"
  },
  {
    "id": 2817,
    "mediaId": 238,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "The organization also filed a similar lawsuit on behalf of North Carolina voters to prevent Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) from running for reelection because of his alleged role in the storming of the Capitol but was initially unsuccessful.",
    "author": "Eugene Scott",
    "title": "Legal effort to remove Greene from Ga. ballot can proceed, judge rules"
  },
  {
    "id": 896,
    "mediaId": 675,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Marjorie Taylor Greene warns Dems of 'another way to play this game'"
  },
  {
    "id": 2799,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The first source of pain is freshman Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who has come under fire from Republican colleagues in recent weeks after making controversial comments.",
    "author": "Max Greenwood",
    "title": "Campaign Report  GOP jockeying ramps up in Senate primaries"
  },
  {
    "id": 2731,
    "mediaId": 675,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "In fact, the Arizona group that was integral in bringing the complaint also has had its fingers in similar cases brought against Reps. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., and Marjorie Taylor Green, R-Ga.\nOther critics of the Democrat movement have said there would need to be an adjudication of someone being involved specifically as an \"insurrectionist\" before such claims would be legitimate.",
    "author": "Bob Unruh",
    "title": "Judge rules on Dems' attempt to banish Republican candidates"
  },
  {
    "id": 2617,
    "mediaId": 675,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Judge recommends 'insurrection' claim against Marjorie Taylor Greene be dropped"
  }
]