[
  {
    "id": 843,
    "mediaId": 169,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Joe Kent  Washington, 3rd congressional district\nKent is running to unseat Rep. Jamie Herrera Beutler, R-Wash., who voted to impeach Trump after the Capitol riot, and is the most prominent candidate backed by the \"Insurrection Caucus,\" meaning Trump allies like Greene, Boebert, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Rep. Matt Gaetz of Florida.",
    "author": "Igor Derysh",
    "title": "Meet the scariest Republican candidates of 2022: It wasn't easy to pick 'em"
  },
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Starting gate\nFirebrands meet friendly fire: Republican lightning rods Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span> and Lauren Boebert have raised millions of dollars flouting political norms.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 3007,
    "mediaId": 43,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "In a recipe for infighting, the far-right House Freedom Caucushome to Reps. Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosaris getting ready to make a play for increased power.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 2949,
    "mediaId": 124,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Congressional Republicans are fuming after Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., claimed some lawmakers have invited him to sex parties and have used cocaine in front of him without offering any specifics.",
    "author": "",
    "title": "The most popular  and unpopular  2022 candidate qualities"
  },
  {
    "id": 2932,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "That story has repeated itself again as House Minority Leader Kevin McCarthy (R-Calif.) told reporters on Wednesday that he may take further action to condemn Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who conceded that he exaggerated? in saying recently that GOP members invited him to orgies and that he saw them doing cocaine regularly (The Hill).",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Some brighter news for Biden?"
  },
  {
    "id": 2906,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "McConnell has largely shrugged off the criticism, while also not shying away from rebuking controversial staunchly pro-Trump Republicans like Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "Jason Lemon",
    "title": "McConnell Says He Only Cares About Winning, Fine With Pro-Trump Republicans"
  },
  {
    "id": 2810,
    "mediaId": 43,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "x\nx\nx\nBonus Good News:\ngg Republicans in Disarray gg\nx\nFmr staffer to <span class='selected-term'>Madison Cawthorn</span> has filed an explosive complaint against him, alleging illegal and immoral? acts, that he doesn't care about constituents, there's more liquor than water in his district office, and he is a habitual liar? and bad person.?https://t.co/mOqUuQXbKx\n Ron Filipkowski gg (@RonFilipkowski) April 18, 2022\nOpinion: Mike Lee has some explaining to do, Jennifer Rubin, Washington Post, April 18, 2022.",
    "author": "",
    "title": "What Have Dems Done for Us Lately? GLAD YOU ASKED!"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "AD WARS  Sen. THOM TILLIS isn't letting up in his opposition to fellow North Carolina Republican Rep. <span class='selected-term'>MADISON CAWTHORN</span>: A Tillis-aligned super PAC is putting up $310,000 to air an ad attacking Cawthorn, per Axios' Lachlan Markay.",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 2673,
    "mediaId": 238,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Look at Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), emblematic of the new generation of Republican stars, along with figures such as Marjorie Taylor Greene (Ga.) and Matt Gaetz (Fla.).",
    "author": "",
    "title": "Opinion The House GOP is a dumpster fire. What if it takes power?"
  }
]