[
  {
    "id": 3079,
    "mediaId": 209,
    "date": "1/30/2022 12:00:00 AM",
    "sentence": "It's hard to blame him when he has to deal with GOP troublemakers like Reps. Lauren Boebert (Colo.), Marjorie Taylor Greene (Ga.), <span class='selected-term'>Madison Cawthorn</span> (N.C.), and Paul Gosar (Ariz.).",
    "author": "Grayson Quay",
    "title": "The GOP might retake Congress in the midterms. Then what?"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Other attendees of the fundraiser on Wednesday include Congressmen <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Jim Jordan of Ohio.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 2891,
    "mediaId": 238,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Is Palin going to stand out in a Republican caucus alongside the likes of Reps. <span class='selected-term'>Madison Cawthorn</span> (N.C.), Marjorie Taylor Greene (Ga.), Lauren Boebert (Colo.), and Matt Gaetz (Fla.)?",
    "author": "",
    "title": "Opinion: Sarah Palin is back, for a GOP that was remade in her image"
  },
  {
    "id": 2887,
    "mediaId": 238,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "Return to menu\nNorth Carolina state Sen. Chuck Edwards, who's mounting a GOP primary challenge to embattled Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), has a new ad out in which he compares Cawthorn's celebrity status to that of the Kardashians.",
    "author": "",
    "title": "Post Politics Now With Romney and Murkowski's pledged votes, Jackson has clear path to confirmation"
  },
  {
    "id": 233,
    "mediaId": 33,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Washington is meanwhile still reverberating with a bizarre episode triggered by Republican North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>'s claim he was invited to an orgy and saw leaders in the nation's anti-drug fight snorting cocaine.",
    "author": "Stephen Collinson",
    "title": "Obama and Romney are back, and show how American politics have changed for the worse"
  }
]