[
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "But Trump's risker endorsement in the state is for Rep. <span class='selected-term'>Madison Cawthorn</span>'s reelection.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 1941,
    "mediaId": 151,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "THE GREAT LAKES STATE  In northern Michigan, Trucker Randy and pay for play' claims roil Senate race,? by Jonathan Oosting, Bridge Michigan: A Republican state Senate candidate in northern Michigan says he was offered a $50,000 government job to withdraw from the race as part of a plot involving well-known conservative radio host Trucker Randy' Bishop, who is running for the same seat as a Democrat.?\nPRIMARY SOURCES  <span class='selected-term'>Madison Cawthorn</span>'s Blunders Open Door to Primary Challengers,? by Natalie Andrews, The Wall Street Journal: The brashness that catapulted freshman Rep. Madison Cawthorn to national attention is wearing on some of his voters here in his rural district in the Blue Ridge Mountains.?\nDAY IN COURT  Herbster files defamation lawsuit against Slama over assault allegations,? by Dan Crisler, Omaha World-Herald: Charles W. Herbster, a businessman and a front-runner for the Republican nomination to be Nebraska's next governor, filed a lawsuit Friday against State Sen. Julie Slama after she, along with seven other women, accused him this month of groping them.?\nTHE SHOW-ME STATE  Eric Greitens posts, then deletes, video featuring KCPD ride along.",
    "author": "",
    "title": "Southern border is the backdrop for GOP ads"
  },
  {
    "id": 2738,
    "mediaId": 195,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "A state senator challenging Rep. <span class='selected-term'>Madison Cawthorn</span> (R) in the North Carolina released a new ad on Monday knocking the congressman for his use of Instagram.",
    "author": "Mychael Schnell",
    "title": "Cawthorn challenger knocks opponent for Instagram use in new ad"
  }
]