[
  {
    "id": 3107,
    "mediaId": 34,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "I'm privileged to participate with the team from Free Speech for People and my fellow North Carolina counsel, in this critically important effort to enforce that constitutional mandate and disqualify <span class='selected-term'>Madison Cawthorn</span> from attempting to be elected to public office in 2022.?\nThe purpose of the constitutional provision relied on by the challengers to Mr. Cawthorn's candidacy is to prevent persons who sought illegally to overthrow a duly elected government from participating in running that government,? said James G. Exum, Jr. The challengers believe the evidence will show Mr. Cawthorn to be one of those persons.?\nCurrently, Cawthorn represents North Carolina's 11th Congressional District, but for the 2022 election, he filed a notice of candidacy for the redrawn 13th Congressional District.",
    "author": "",
    "title": "North Carolina Voters Challenge Rep. Madison Cawthorn's Candidacy for Reelection Under Fourteenth Amendment's Insurrectionist Disqualification Clause"
  },
  {
    "id": 3108,
    "mediaId": 63,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "As Democrats, we have got to get better at speaking up and using our voices,? Aiken said in a video announcing his candidacy, noting that far-right figures like Reps. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) and Marjorie Taylor Greene (R-Ga.) ain't quieting down anytime soon.? If the loudest and most hateful voices think they're gonna speak for us, just tell them I'm warming up the old vocal chords.?\nIf elected, Aiken would be the first openly gay congressman from the South, he said in his campaign video.",
    "author": "Alison Durkee",
    "title": "American Idol' Star Clay Aiken Running For Congress In North Carolina"
  },
  {
    "id": 3110,
    "mediaId": 237,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Aiken also took aim at controversial Republican lawmakers by name, including North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, whom he called a white nationalist.",
    "author": "Kate Scanlon",
    "title": "Former American Idol contestant Clay Aiken launches second bid for Congress"
  },
  {
    "id": 3113,
    "mediaId": 34,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "\"The Constitution mandates that those who take the oath to support the Constitution and then violate that oath shall be disqualified from holding office,\" said Orr, who called himself \"privileged to participate... in this critically important effort to enforce that constitutional mandate and disqualify <span class='selected-term'>Madison Cawthorn</span> from attempting to be elected to public office in 2022.\"",
    "author": "Kenny Stancil",
    "title": "Citing 'Blatant Acts of Insurrection,' NC Voters Petition to Bar Cawthorn From Seeking Reelection"
  },
  {
    "id": 3099,
    "mediaId": 209,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "He specifically criticized Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), placing him in the former category.",
    "author": "Brendan Morrow",
    "title": "Former American Idol star Clay Aiken is running for Congress again"
  },
  {
    "id": 3102,
    "mediaId": 147,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "Mark Robinson and U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Gary D. Robertson",
    "title": "Clay Aiken, American Idol' runner-up, aims for Congress again"
  },
  {
    "id": 3096,
    "mediaId": 881,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "But after watching noted shitbag <span class='selected-term'>Madison Cawthorn</span> rise to prominence in the House over the past two years and listening to North Carolina's Lieutenant Governor go on a baldly homophobic rant in November, he felt compelled to get back in the mix.",
    "author": "Drew Schwartz",
    "title": "We Asked a Campaign Strategist If Clay Aiken (???) Could Actually Get Elected to Congress"
  },
  {
    "id": 3092,
    "mediaId": 129,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> has breezily dismissed a candidacy challenge filed by voters in his home state, North Carolina, seeking to bar him from re-election to the House of Representatives based on his role in the events of Jan. 6.",
    "author": "",
    "title": "Will Madison Cawthorn Be Brought Down by Insurrection'?"
  },
  {
    "id": 3089,
    "mediaId": 178,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the reelection bid of Rep. <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "Jonathan Weisman New York Times",
    "title": "Cawthorn challenge raises the question: Who is an 'insurrectionist'?"
  },
  {
    "id": 3083,
    "mediaId": 151,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "The announcement has caused a firestorm, with far-right, high-profile backers ranging from North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to conservative activist Candace Owens taking to social media to voice their support for Robby Starbuck, a rival candidate who's been a mainstay of the pro-Trump movement.",
    "author": "",
    "title": "Trump faces MAGA revolt over endorsement"
  },
  {
    "id": 3080,
    "mediaId": 43,
    "date": "1/30/2022 12:00:00 AM",
    "sentence": "NC-Sen: Snowflake Bathroom Bill Gov Compares Himself Not Getting A Job At Duke To 1960s Segregation\nDaily Kos, poopdogcomedy, 1/27/2022\n<span class='selected-term'>Madison Cawthorn</span> case could spell trouble for other insurrectionists' including Trump\n Madison Cawthorn, NC-11\nIf an effort to disqualify Rep. Madison Cawthorn (R-NC) from the ballot is successful, it could lead to similar challenges against other lawmakers accused of fueling the Capitol insurrection  including former president Donald Trump.The case against Cawthorn  who cheered on the Jan. 6 rioters  seeks to force him to prove that he's not an insurrectionist based on a little-known section of the 14th Amendment that was adopted to punish members of the Confederacy after they reclaimed their elected offices in Washington.",
    "author": "",
    "title": "North Carolina Open Thread: Fentanyl test strips, Whining McCrory and Cawthorn's Corner"
  },
  {
    "id": 3073,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "A group of registered voters have invoked the 14th Amendment to disqualify Rep. <span class='selected-term'>Madison Cawthorn</span> from running again for a seat in the House in 2022, based on his support for the January 2021 riot at the U.S. Capitol.",
    "author": "",
    "title": "Biden vs. Trump: The Makings of a Shattering Constitutional Crisis"
  },
  {
    "id": 3077,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "\"If <span class='selected-term'>Madison Cawthorn</span> were ten years old and seeking to be on the ballot in North Carolina, there'd be no question that he's ineligible to be placed on the ballot because he doesn't meet the age qualification for a member of Congress.",
    "author": "",
    "title": "Cawthorn Facing Ballot Removal for Role in Insurrection (So May Trump, Others): 'BradCast' 2/1/2022"
  },
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 504,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 3054,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Almost everyone had expected Moore to run in the 13th District under the map that has since been struck down, but he decided not to after Rep. <span class='selected-term'>Madison Cawthorn</span> surprised everyone by announcing he'd run for that constituency rather than the neighboring 14th.",
    "author": "",
    "title": "Morning Digest: Longtime Democratic power player on Long Island will not seek"
  },
  {
    "id": 3049,
    "mediaId": 43,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Proposed NC congressional map could put <span class='selected-term'>Madison Cawthorn</span>'s seat in significant electoral danger: report\nRaw Story, Matthew Chapman, 2/14/2022\nOn Monday, writing for Carolina Journal, former North Carolina GOP Executive Director Dallas Woodhouse outlined how a proposed state congressional map to remediate the illegal gerrymander struck down by state courts could affect one district in particular: that of freshman GOP Rep. Madison Cawthorn.",
    "author": "",
    "title": "DKos Asheville Open Thread: 14th Amendment moves,"
  },
  {
    "id": 3047,
    "mediaId": 43,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Proposed NC congressional map could put <span class='selected-term'>Madison Cawthorn</span>'s seat insignificant electoral danger: report\nRaw Story, Matthew Chapman, 2/14/2022\nOn Monday, writing for Carolina Journal, former North Carolina GOP Executive Director Dallas Woodhouse outlined how a proposed state congressional map to remediate the illegal gerrymander struck down by state courts could affect one district in particular: that of freshman GOP Rep. Madison Cawthorn.",
    "author": "",
    "title": "North Carolina Open Thread"
  },
  {
    "id": 3042,
    "mediaId": 238,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "On the phone from her home at the far western edge of the North Carolina mountains, the former head of the Cherokee County GOP is seething because Rep. <span class='selected-term'>Madison Cawthorn</span>  the youngest member of the headline-grabbing Trump acolytes on Capitol Hill  has disappointed her once again.",
    "author": "Lisa Rab",
    "title": "Is North Carolina congressman and Trump acolyte Madison Cawthorn exposing the limits of the new celebrity politics?"
  },
  {
    "id": 954,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/24"
  },
  {
    "id": 3037,
    "mediaId": 21,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "North Carolina congressman <span class='selected-term'>Madison Cawthorn</span> said on Monday that a petition filed against him is close to successfully blocking him from running for office this year.",
    "author": "Matthew Loh",
    "title": "Rep. Madison Cawthorn says petitioners are 'very close' to getting him barred from running for re-election this year"
  },
  {
    "id": 3038,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 3040,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "David Beard:\nBut <span class='selected-term'>Madison Cawthorn</span>, who is a relatively new representative from the far western part of North Carolina, representing Asheville and the mountain areas, he didn't like his new district because it was still pretty safely Republican, but slightly less so, where you could imagine in a really bad Republican year that he might be at some sort of risk.",
    "author": "",
    "title": "Texas primary preview, with Jeff Singer (transcript)"
  },
  {
    "id": 3036,
    "mediaId": 43,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "So while we're still stuck with them, I like to think that they both lost in this situation,? Beard added, which makes me happy.?\nNir reminded the audience that Cawthorn is being investigated over his involvement in the Jan. 6 insurrection: We also shouldn't forget about the fact that there is still a pending challenge to <span class='selected-term'>Madison Cawthorn</span>'s eligibility to even appear on the ballot because of his involvement around the Jan. 6 insurrection and invasion of the Capitol.",
    "author": "",
    "title": "Highlights from The Downballot: A Texas primary preview with Jeff Singer"
  },
  {
    "id": 3027,
    "mediaId": 43,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "Or, y'know, maybe someone can file the same kind of lawsuit that <span class='selected-term'>Madison Cawthorn</span> has been hit with to block this seditious bigot from getting to run for any office in North Carolina, ever again.|\nClick Here for Full FRED Archive\nOne Year Ago, February 21st, 2021: Mike Hubbard (AL)\n Two Years Ago, February 21st, 2020: Michele Presnell (NC)\n Three Years Ago, February 21st, 2019: Omar Navarro (CA)\n Four Years Ago, February 21st, 2018: Rayne Brown (NC)\n Five Years Ago, February 21st, 2017: Isaac Latterell (SD) 2017 Update\n Six Years Ago.",
    "author": "",
    "title": "Fanatical Republican Extremist of the Day: Dan Bishop"
  },
  {
    "id": 3009,
    "mediaId": 675,
    "date": "3/6/2022 12:00:00 AM",
    "sentence": "That was the case that was brought recently against U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Judge deals blow to Dem scheme to keep Republicans out of Congress"
  },
  {
    "id": 3011,
    "mediaId": 43,
    "date": "3/6/2022 12:00:00 AM",
    "sentence": "But Congress may by a vote of two-thirds of each House, remove such disability.?\nBeat him at the ballot box\nBlueNC/News&Observer, 3/4/2022\nTRUMP JUDGE BLOCKS CHALLENGE TO <span class='selected-term'>MADISON CAWTHORN</span>'S CONGRESSIONAL RUN: Cawthorn's opponents say the Jan. 6 attack was an attempted insurrection  a word that top GOP Sen. Mitch McConnell of Kentucky has also used to describe that day that resulted in several deaths and injuries.",
    "author": "",
    "title": "North Carolina Open Thread: Republicans for Putin, NC Candidates, Thom Tillis, Cawthorn's Corner"
  },
  {
    "id": 1263,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right freshman Rep. <span class='selected-term'>Madison Cawthorn</span> caught a break on filing day when a federal judge rejected a lawsuit that tried to keep the Republican off the ballot in this western North Carolina seat because of his actions both in the lead-up to and during the Jan. 6 attack on the U.S. Capitol.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 3007,
    "mediaId": 43,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "In a recipe for infighting, the far-right House Freedom Caucushome to Reps. Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosaris getting ready to make a play for increased power.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 2996,
    "mediaId": 409,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> (R., N.C.) recently called Ukrainian President Volodymyr Zelensky a thug? and said the Ukrainian government is evil,? according to a newly surfaced video.",
    "author": "Brittany Bernstein",
    "title": "Madison Cawthorn Calls Zelensky a Thug,' Accuses Ukrainian Government of Pushing Woke Ideologies'"
  },
  {
    "id": 2999,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "North Carolina, South Korea, and why you should Run For Something, with Amanda Litman\nThe Downballot\nFollowShare\n0:0042:43\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nWe also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/10"
  },
  {
    "id": 3000,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "We also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "North Carolina, South Korea, and why you should Run For Something (transcript)"
  },
  {
    "id": 2988,
    "mediaId": 675,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Leftists use failed strategy to attack Wisconsin GOP"
  },
  {
    "id": 2989,
    "mediaId": 209,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is having a moment ... and not exactly a good one.",
    "author": "Brigid Kennedy",
    "title": "Cawthorn primary challengers respond after lawmaker calls Zelensky 'a thug'"
  },
  {
    "id": 2993,
    "mediaId": 43,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Also in North Carolina, <span class='selected-term'>Madison Cawthorn</span>'s eligibility to appear on the ballot this November has been challenged by a group of voters under an unusual and interesting North Carolina law that is based on the 14th Amendment.",
    "author": "",
    "title": "Highlights from The Downballot: North Carolina, South Korea, and why you should Run for Something"
  },
  {
    "id": 2987,
    "mediaId": 237,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is stumbling at home and abroad as his bid to play Republican kingmaker falls flat with voters and alienates colleagues.",
    "author": "David M. Drucker",
    "title": "'His act is wearing thin': North Carolina Republicans gripe about Madison Cawthorn"
  },
  {
    "id": 2981,
    "mediaId": 238,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Madison Cawthorn is in trouble. And it's entirely his own fault."
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n House Democrats raised $19.3 million in February, a committee record\n Trump's EPA chief Scott Pruitt weighing Senate run in Oklahoma\n New Hampshire Gov.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 1147,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Right now, what you say about the enemy and saying Putin is an intelligent actor or there are reasons why he wanted to protect his flank  no, there wasn't.?\nMcCrory also takes issue with North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> calling Ukrainian President Volodymyr Zelensky a \"thug\" at a town hall and with President Joe Biden's initial dismissiveness of the Russians possibly invading Ukraine.",
    "author": "Salena Zito",
    "title": "McCrory on why he is still standing despite both Club for Growth and Trump against him"
  },
  {
    "id": 2970,
    "mediaId": 25,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n More\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Supreme Court tosses Wisconsin state legislative maps but keeps congressional maps in place"
  },
  {
    "id": 2962,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Dems again try failed strategy to try to derail GOP representative's re-election bid"
  },
  {
    "id": 2960,
    "mediaId": 43,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "The non-partisan group previously filed a separate challenge against the Constitutional eligibility of North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to run in 2022 on the same basis.",
    "author": "",
    "title": "Good News! On Biden's Economy and Trump's Insurrectionists: 'BradCast' 3/24/2022"
  },
  {
    "id": 2947,
    "mediaId": 165,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) admitted claims he had made about his colleagues inviting him to orgies and doing cocaine in front of him were exaggerated,? House Speaker Kevin McCarthy (R-Calif.) said after admonishing the freshman congressman, according to multiple reports.",
    "author": "William Vaillancourt",
    "title": "Turns Out Noted Liar Madison Cawthorn May Have Also Been Lying About Getting Invited to a Congressional Orgy"
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "(CNN)Sen. Thom Tillis of North Carolina is throwing his weight behind a primary opponent to freshman Rep. <span class='selected-term'>Madison Cawthorn</span> -- an extraordinary broadside against a fellow Republican from his home state, as internal frustration with the controversial MAGA firebrand reaches a boiling point.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2921,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Now I have to go to North Carolina and campaign for Thom Tillis's primary opponent because Donald Trump and <span class='selected-term'>Madison Cawthorn</span> are more popular with the grassroots in North Carolina than Thom Tillis will ever be, never mind the other RINO there, Richard Burr.",
    "author": "Juliegrace Brufke",
    "title": "Roger Stone defends Madison Cawthorn, claims orgies and drug abuse not uncommon in DC"
  },
  {
    "id": 2922,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,? Tillis wrote.",
    "author": "Mychael Schnell",
    "title": "Tillis endorses Cawthorn's primary challenger"
  },
  {
    "id": 2923,
    "mediaId": 233,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Cawthorn's revoked license: GOP Congressman <span class='selected-term'>Madison Cawthorn</span> charged with driving on a revoked license for 2nd time; court dates set\nIn a tweet just hours before Tillis' announcement, Cawthorn said \"the radical left, the establishment, and the media want to take me down,\" but he will move forward.",
    "author": "David Jackson",
    "title": "More trouble for GOP Rep. Madison Cawthorn: North Carolina Republican senator endorses primary opponent"
  },
  {
    "id": 2924,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,? Tillis said.",
    "author": "Juliegrace Brufke",
    "title": "Republicans turn against Rep. Madison Cawthorn after orgies and cocaine comment"
  },
  {
    "id": 2926,
    "mediaId": 136,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span>, a North Carolina Republican, is facing backlash from his state's two GOP senators after multiple recent controversieswith one senator deciding to back his primary challenger.",
    "author": "Jason Lemon",
    "title": "GOP Senators From Madison Cawthorn's State Won't Back His Re-Election Bid"
  },
  {
    "id": 2927,
    "mediaId": 169,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "On Sunday, one of their bigger lunkheads in Congress, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina, told a podcast host that his GOP colleagues were big fans of orgies and blow.",
    "author": "Amanda Marcotte",
    "title": "Madison Cawthorn's cocaine-and-orgies brouhaha blows up the GOP's QAnon plan"
  },
  {
    "id": 2938,
    "mediaId": 234,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "In his short time in Congress, freshman representative <span class='selected-term'>Madison Cawthorn</span> has said and done a lot of things that, to people outside of the Republican Party, would fall under the umbrella of disgraceful, unacceptable behavior.",
    "author": "Bess Levin",
    "title": "Party That Excused Rioters Smearing Human S--t on the Walls of the Capitol Draws the Line at Cocaine and Orgy Allegations"
  },
  {
    "id": 2939,
    "mediaId": 118,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "In his first term, North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> has been an embarrassment.",
    "author": "Inae Oh",
    "title": "Republicans, Fearing Questions From Their Spouses, Draw the Line at Cocaine Orgies"
  },
  {
    "id": 2944,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. <span class='selected-term'>Madison Cawthorn</span> in the May 17 Republican primary for North Carolina's 11th District, saying the next day that the incumbent has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nTillis threw in an unsubtle reference to Cawthorn's previous attempt to leave his constituents behind to run for an even more conservative district in the Charlotte area that he barely represented before a new court-drawn map foreclosed that possibility, antics that likely did him far more damage at home than his litany of embarrassing behavior.",
    "author": "",
    "title": "North Carolina senator endorses effort to deny renomination to Madison Cawthorn in May"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Washington, DC (CNN)Rep. <span class='selected-term'>Madison Cawthorn</span> -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 923,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. <span class='selected-term'>Madison Cawthorn</span> in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 2900,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is slated to speak at former President Trump's upcoming rally in North Carolina, giving the embattled congressman a key audience with Trump's ultra-conservative base as he faces backlash from GOP lawmakers and much of his state's congressional delegation.",
    "author": "Max Greenwood",
    "title": "Cawthorn to speak at North Carolina Trump rally"
  },
  {
    "id": 2901,
    "mediaId": 237,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Embattled North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> refused to retract his accusations that orgies and cocaine use take place among politicians in Washington despite coming under fire from his Republican colleagues.",
    "author": "Juliegrace Brufke",
    "title": "Cawthorn defends 'calling out corruption' with orgy and cocaine claims"
  },
  {
    "id": 2904,
    "mediaId": 237,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Embattled Rep. <span class='selected-term'>Madison Cawthorn</span> will speak at a rally with former President Donald Trump in North Carolina later this month after the freshman lawmaker set many in his own party against him with claims his colleagues engage in orgies and use cocaine.",
    "author": "Kate Scanlon",
    "title": "Fresh off McCarthy tongue-lashing, Cawthorn says he'll rally with Trump next week"
  },
  {
    "id": 2905,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> could be in for a tough fight to keep his seat as primary opponents circle and prominent Republicans take aim at the youngest member of the U.S. House of Representatives.",
    "author": "Darragh Roche",
    "title": "Will 'Orgy' Claims Cost Madison Cawthorn His GOP Career?"
  },
  {
    "id": 2906,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "McConnell has largely shrugged off the criticism, while also not shying away from rebuking controversial staunchly pro-Trump Republicans like Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "Jason Lemon",
    "title": "McConnell Says He Only Cares About Winning, Fine With Pro-Trump Republicans"
  },
  {
    "id": 2910,
    "mediaId": 21,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Several Republican Party leaders in North Carolina are backing Rep. <span class='selected-term'>Madison Cawthorn</span>'s primary challenger following the congressman's claims that he had witnessed \"sexual perversion\" and drug use among his Congress colleagues.",
    "author": "Cheryl Teh",
    "title": "GOP leaders from Madison Cawthorn's home state are backing his primary challenger after the congressman's orgy comments"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nBut if losing Tillis' endorsement and a reprimand from House leadership was meant to temper Cawthorn's actions, it doesn't appear to have worked.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2917,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Perhaps Rep. <span class='selected-term'>Madison Cawthorn</span>'s revelation about GOP sex parties and cocaine use hit a little too close to home, because this is apparently where the rubber meets the road for Republicans.",
    "author": "",
    "title": "As Republicans fret over Cawthorn's drugs and orgies revelation, Trump gives him a platform"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "Morning Digest: Why GOP leaders finally want to boot <span class='selected-term'>Madison Cawthorn</span> (it's not really about orgies)\nDaily Kos Staff, 4/1/2022\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 2893,
    "mediaId": 118,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Inae Oh",
    "title": "Madison Cawthorn's Response to Orgy Scandal: Attack the Liberals"
  },
  {
    "id": 2894,
    "mediaId": 151,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "| Andrew Harnik/AP Photo\nBy Olivia Beavers and Craig Howie\n 04/01/2022 08:19 PM EDT\nAmid a burgeoning congressional controversy, Rep. <span class='selected-term'>Madison Cawthorn</span> on Friday blamed Democrats and the media for amplifying his comments that some of his fellow GOP members engage in orgies and use cocaine.",
    "author": "",
    "title": "Cawthorn blames the left and the media' after intra-GOP furor over sex-and-drugs comments"
  },
  {
    "id": 2895,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "He isn't the same kind of comedy fodder that MTG, Lauren Boebert, and <span class='selected-term'>Madison Cawthorn</span> are.",
    "author": "",
    "title": "Gary Snyder for Congress"
  },
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Morning Digest: Why GOP leaders finally want to boot <span class='selected-term'>Madison Cawthorn</span> (it's not really about orgies)\nDaily Kos Staff, 4/1/2022\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 2891,
    "mediaId": 238,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Is Palin going to stand out in a Republican caucus alongside the likes of Reps. <span class='selected-term'>Madison Cawthorn</span> (N.C.), Marjorie Taylor Greene (Ga.), Lauren Boebert (Colo.), and Matt Gaetz (Fla.)?",
    "author": "",
    "title": "Opinion: Sarah Palin is back, for a GOP that was remade in her image"
  },
  {
    "id": 2885,
    "mediaId": 178,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "So, congratulations are in order for that firebrand Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C. Where the insurrection and a speaking gig at white nationalist event have failed, you, my friend, have found success.",
    "author": "LZ Granderson",
    "title": "Ewww. Madison Cawthorn went too far."
  },
  {
    "id": 2877,
    "mediaId": 169,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Putin fanboys like Donald Trump, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina, and Fox News' Tucker Carlson were practically drooling with glee, declaring Putin was a \"genius\" acting out of \"love,\" and gearing up a narrative about how Russia's commanding victory was a blow against the decadence bred by democracy.",
    "author": "Amanda Marcotte",
    "title": "Putin's war crimes  and his military failures  are making his GOP apologists squirm"
  },
  {
    "id": 2854,
    "mediaId": 65,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Rep. Ted Budd, R-N.C., who has received an endorsement from Trump, will offer remarks as he seeks to win the Senate seat being vacated by Sen. Richard Burr, R-N.C.\nOther North Carolina Republicans slated to speak at the event include Rep. <span class='selected-term'>Madison Cawthorn</span>, Rep. Dan Bishop, Rep. Greg Murphy, Lt. Gov.",
    "author": "Kyle Morris",
    "title": "Former President Trump addresses supporters at North Carolina rally"
  },
  {
    "id": 2856,
    "mediaId": 147,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "In 2020, political newcomer <span class='selected-term'>Madison Cawthorn</span> comfortably won a GOP congressional primary runoff over Trump's pick.",
    "author": "Gary D. Robertson",
    "title": "Trump's endorsement power tested in North Carolina Senate race"
  },
  {
    "id": 2857,
    "mediaId": 136,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Speakers at the rally include North Carolina Representatives <span class='selected-term'>Madison Cawthorn</span>, Dan Bishop and Greg Murphy.",
    "author": "Xander Landen",
    "title": "How to Watch Trump North Carolina Rally: Time, Live Stream for Selma Speech"
  },
  {
    "id": 2862,
    "mediaId": 43,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nJohn Oliver to Kevin McCarthy: You 'raised the monster' that is <span class='selected-term'>Madison Cawthorn</span> and 'it's your effing problem'\nRaw Story, Sarah K. Burris, 4/4/2022\nRep. Kevin McCarthy (R-CA) revealed this week that he no longer has \"trust\" in Rep. Madison Cawthorn (R-NC), the young official who outed GOP members for having \"sexual get-togethers\" and snorting cocaine.",
    "author": "",
    "title": "DKos Asheville Open Thread: Your weekly Cawthorn, packed full of (your words here). And bears!"
  },
  {
    "id": 2865,
    "mediaId": 19,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Trump's remarks came at a rally in Selma, North Carolina, in support of Rep. Ted Budd (R-NC), who seeks a U.S. Senate seat in North Carolina; congressional hopeful Bo Hines, and first-term Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC).",
    "author": "Jordan Dixon-Hamilton",
    "title": "Trump Calls on Republicans to Remove DHS Secretary Mayorkas"
  },
  {
    "id": 2849,
    "mediaId": 136,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "MSNBC host Cori Coffin asked the GOP strategist about the \"warm welcome\" that North Carolina Republican Representative <span class='selected-term'>Madison Cawthorn</span> received during Trump's Saturday rally in Selma, North Carolina, and whether or not the congressman is the \"future of the GOP.\"",
    "author": "Fatma Khaled",
    "title": "Trump Crowds 'Getting Smaller,' Base 'Shrinking,' Says GOP Strategist"
  },
  {
    "id": 2850,
    "mediaId": 136,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Attendees of former President Donald Trump's North Carolina rally on Saturday said they believed GOP Representative <span class='selected-term'>Madison Cawthorn</span>'s claim that high-profile individuals in Washington, DC, invited him to an \"orgy\" and did cocaine in front of him.",
    "author": "Jason Lemon",
    "title": "Trump Rally-Goers Believe Cawthorn's Orgy Claim: 'Why Make That Up?'"
  },
  {
    "id": 2851,
    "mediaId": 136,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Trump arrived in North Carolina to promote and endorse Ted Budd for the Senate race in the Republican primary and the re-election bid for U.S. Representative <span class='selected-term'>Madison Cawthorn</span>, who came under fire from Republican House Leader Kevin McCarthy over claims of orgies and cocaine use amongst his Republican colleagues.",
    "author": "Anders Anglesey",
    "title": "Donald Trump Vows 'Justice for the Jan. 6 Prisoners' to Cheers at NC Rally"
  },
  {
    "id": 2852,
    "mediaId": 136,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Trump said earlier in the rally, in which he was there to promote and endorse Ted Budd for the Senate race in the primary and the re-election campaign for U.S. Representative <span class='selected-term'>Madison Cawthorn</span>, who has drawn ire lately for his remarks about alleged orgies and cocaine use among Congress members.",
    "author": "Scott McDonald",
    "title": "Trump Says He's 'The Most Honest Human Being God Has Ever Created'"
  },
  {
    "id": 2853,
    "mediaId": 43,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nJohn Oliver to Kevin McCarthy: You 'raised the monster' that is <span class='selected-term'>Madison Cawthorn</span> and 'it's your effing problem'\nRaw Story, Sarah K. Burris, 4/4/2022\nRep. Kevin McCarthy (R-CA) revealed this week that he no longer has \"trust\" in Rep. Madison Cawthorn (R-NC), the young official who outed GOP members for having \"sexual get-togethers\" and snorting cocaine.",
    "author": "",
    "title": "North Carolina Open Thread: Trump rally, Election police, Hog farming, Cawthorn, and Spring flowers"
  },
  {
    "id": 2845,
    "mediaId": 21,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> speaks before a rally for former U.S. President Donald Trump at The Farm at 95 on April 9, 2022 in Selma, North Carolina.",
    "author": "Cheryl Teh",
    "title": "Madison Cawthorn criticized GOP leaders for 'weakening' and 'cheapening' the Republican party's platform and chasing 'non-existent middle-ground voters'"
  },
  {
    "id": 2842,
    "mediaId": 43,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "The major media outlets proceeded to covered a medium-sized political rally in Johnston County with wall-to-wall live coverage approximating that of September 11th:\nThe next morning, literally every story on the Raleigh News & Observer's website was about the Trump rally:\nThough reporters did fact-check? Trump's speech (which was, as usual, chock-full of gibberish), they also provided him (as well as Tedd Budd, <span class='selected-term'>Madison Cawthorn</span>, Bo Hines, Dan Bishop and a litany of fellow travelers) a bonanza of free advertising.",
    "author": "",
    "title": "Trump's North Carolina \"rally\" on Saturday was a total bust. Here's why."
  },
  {
    "id": 2830,
    "mediaId": 43,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Kraushaar wrote: <span class='selected-term'>Madison Cawthorn</span> just filed his 1stQ fundraising report  spent more than he raised and has less than 300K in bank.? According to New York Times political reporter Shane Goldmacher, Rep. Cawthorn has a lot less than even that in the bank.",
    "author": "",
    "title": "Madison Cawthorn raised $3.5 million but seems to only have a little over $100K left"
  },
  {
    "id": 2824,
    "mediaId": 237,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Just In...\nTaxpayers footed the bill for Rep. <span class='selected-term'>Madison Cawthorn</span>'s visit to a luxury riverside mountain resort in August 2021, according to House disbursement records reviewed by the Washington Examiner.",
    "author": "Andrew Kerr",
    "title": "Madison Cawthorn spent taxpayer funds at luxury resort"
  },
  {
    "id": 2826,
    "mediaId": 43,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Several Democrats take on incumbent Rep. Cawthorn\nWLOS, Kimberly King, 3/30/2022\nCongressman <span class='selected-term'>Madison Cawthorn</span>, who represents North Carolina's 11th District, faces his first re-election on May 17 against seven Republican challengers.",
    "author": "",
    "title": "DKos Asheville Open Thread: Replacing Cawthorn, Meadows voter fraud, WNC judges all"
  },
  {
    "id": 2822,
    "mediaId": 129,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "The decision by Judge Totenberg stood in stark contrast with a recent ruling in a similar case involving Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina.",
    "author": "",
    "title": "Effort to Remove Marjorie Taylor Greene From Ballot Can Proceed, Judge Says"
  },
  {
    "id": 2813,
    "mediaId": 136,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Free Speech for People filed a similar lawsuit against Republican Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina, but the effort was blocked by U.S. District Richard Myers.",
    "author": "Alexandra Hutzler",
    "title": "GOP Likely Keeps House Seat if Marjorie Taylor Greene Is Booted Off Ballot"
  },
  {
    "id": 2815,
    "mediaId": 376,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "GOP Sen. Thom Tillis plans to appear as a special guest? at a fundraiser slated for next week benefiting Chuck Edwards, a primary challenger of embattled North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, according to an invitation sent to potential donors in the lobbying sector.",
    "author": "Kate Ackley",
    "title": "GOP senators, lobbyists aid challengers to lightning rod House members"
  },
  {
    "id": 2816,
    "mediaId": 195,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "At one point during the call, Lisa Wiggins, who was a caseworker for the 26-year-old first-term representative in his district office for over a year, described that office as having more liquor bottles than they do water bottles.?\nCawthorn's office insinuated that the allegations, made in a secretly recorded and released conversation with the head of an anti-Cawthorn PAC, were politically motivated, and hinted at potential counteraction by saying that they constitute defamation of character.?\nWiggins unloaded about Cawthorn in a call with David Wheeler, the president of the anti-Cawthorn American Muckrakers PAC more commonly known as Fire <span class='selected-term'>Madison Cawthorn</span>, accusing him of denying me my FMLA? leave when her uncle died and her husband suffered a heart attack the same week.",
    "author": "Emily Brooks",
    "title": "Secretly recorded call adds to controversy swirling around Cawthorn"
  },
  {
    "id": 2808,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Voters in North Carolina are seeking to bar Representative <span class='selected-term'>Madison Cawthorn</span> from running for re-election to his House seat, and those in Georgia are trying to do the same to Representative Marjorie Taylor Greene.",
    "author": "",
    "title": "Only the Feds Could Disqualify Madison Cawthorn and Marjorie Taylor Greene"
  },
  {
    "id": 2809,
    "mediaId": 43,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "GOP Rep. <span class='selected-term'>Madison Cawthorn</span> said he missed 15 House votes because he was fulfilling his 'service as a husband'.",
    "author": "",
    "title": "Does Cawthorn Know that Votes are Public Record?"
  },
  {
    "id": 2793,
    "mediaId": 136,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Another Trump loyalist, North Carolina Representative <span class='selected-term'>Madison Cawthorn</span>, is similarly facing a legal challenge from voters to his reelection.",
    "author": "Jon Jackson",
    "title": "Donald Trump Could Lose One of His Most Loyal Supporters in Congress"
  },
  {
    "id": 2759,
    "mediaId": 165,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "They're running out of things to throw at me\n <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 22, 2022\nCawthorn looks like he's having a good time in the photos, and there's absolutely nothing wrong with a man putting on some lingerie.",
    "author": "Ryan Bort",
    "title": "Madison Cawthorn Partying in Lingerie May Be the Least Offensive Thing He's Done"
  },
  {
    "id": 2760,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Photos obtained by POLITICO\nBy Michael Kruse\n 04/22/2022 04:47 PM EDT\nUpdated: 04/22/2022 06:00 PM EDT\nPhotographs obtained by POLITICO appear to show <span class='selected-term'>Madison Cawthorn</span>, the embattled Republican congressman from North Carolina who recently accused his GOP colleagues of inviting him to orgies, wearing lingerie in what appears to be a party setting.",
    "author": "",
    "title": "Exclusive: Madison Cawthorn photos reveal him wearing women's lingerie in public setting"
  },
  {
    "id": 2763,
    "mediaId": 237,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> blasted the Left for dredging up photographs of him wearing women's lingerie, saying the newly resurfaced photos amount to a desperate attempt to hurt him.",
    "author": "Misty Severi",
    "title": "Cawthorn slams Left for unearthing 'goofy' photos of him in lingerie"
  },
  {
    "id": 2769,
    "mediaId": 163,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene faces 'insurrectionist' challenge"
  },
  {
    "id": 2773,
    "mediaId": 593,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene Faces 'Insurrectionist' Challenge"
  },
  {
    "id": 2774,
    "mediaId": 593,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Facing Ballot Challenge, Republican Greene Says She Wanted A 'Peaceful March' On U.S. Capitol"
  },
  {
    "id": 2775,
    "mediaId": 593,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene Faces 'Insurrectionist' Legal Challenge"
  },
  {
    "id": 2784,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Madison Cawthorn having fun with alcohol and lingerie"
  },
  {
    "id": 2747,
    "mediaId": 136,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "A new advertisement on Thursday calling out GOP Representative <span class='selected-term'>Madison Cawthorn</span>'s \"lies\" was paid for by a super PAC that is aligned with GOP Senator Thom Tillis.",
    "author": "Andrew Stanton",
    "title": "Trump-Backed Cawthorn's 'Lies' Ripped in Ad by PAC Linked to GOP's Tillis"
  },
  {
    "id": 2749,
    "mediaId": 195,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives,? Tillis said in a March statement.",
    "author": "Brad Dress",
    "title": "Tillis super PAC launches $300K ad buy knocking Cawthorn"
  },
  {
    "id": 2752,
    "mediaId": 136,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "Following a rocky few weeks after accusing fellow GOP colleagues of inviting him to cocaine-fueled orgies, Republican North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s favorability may be increasing from his recent endorsement by the National Rifle Association (NRA).",
    "author": "Patricia McKnight",
    "title": "National Rifle Association Throws Weight Behind Cawthorn Reelection"
  },
  {
    "id": 2754,
    "mediaId": 43,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "'The end of men': Photos of 'family values' Republican <span class='selected-term'>Madison Cawthorn</span> in women's lingerie draw instant ridicule\nRaw Story, Sarah K. Burris, 4/22/2022\nThe dirt on Rep. Madison Cawthorn (R-NC) continues to come out and the latest is a series of photos of the young Republican partying with a group of ladies while wearing a black lace brassiere, large sterling silver hoop earrings, and a silver necklace he held seductively between his teeth.",
    "author": "",
    "title": "DKos Asheville Open Thread: 2nd"
  },
  {
    "id": 2738,
    "mediaId": 195,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "A state senator challenging Rep. <span class='selected-term'>Madison Cawthorn</span> (R) in the North Carolina released a new ad on Monday knocking the congressman for his use of Instagram.",
    "author": "Mychael Schnell",
    "title": "Cawthorn challenger knocks opponent for Instagram use in new ad"
  },
  {
    "id": 2717,
    "mediaId": 129,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> was briefly detained by the police on Tuesday after trying to bring a loaded gun through airport security in Charlotte, N.C., in his carry-on bag, the second time in a little more than a year that the North Carolina Republican has been stopped from flying with a firearm.",
    "author": "",
    "title": "Madison Cawthorn Again Brought a Loaded Gun to the Airport, Officials Say"
  },
  {
    "id": 2718,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited Tuesday for having a loaded 9mm handgun at a TSA checkpoint at Charlotte Douglas International Airport, the second time he has been stopped with a firearm at an airport since taking office last year.",
    "author": "",
    "title": "Rep. Madison Cawthorn cited for having a gun at Charlotte airport"
  },
  {
    "id": 2719,
    "mediaId": 63,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "This is the second time a gun has been found on Cawthorn at an airport: The Transportation Security Administration discovered a 9mm handgun in his carry-on bag at Asheville Regional Airport in February 2021.\nVirtually every Monday or Tuesday we start the week out with another embarrassing headline from <span class='selected-term'>Madison Cawthorn</span> .",
    "author": "Nicholas Reimann",
    "title": "Madison Cawthorn Cited For Carrying Gun At Charlotte Airport"
  },
  {
    "id": 2721,
    "mediaId": 65,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited for being in possession of a firearm at Charlotte Douglas International Airport on Tuesday morning, according to multiple local media reports.",
    "author": "Paul Best",
    "title": "North Carolina Rep. Madison Cawthorn cited for having gun at Charlotte airport: reports"
  },
  {
    "id": 2722,
    "mediaId": 21,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Officers cited Rep. <span class='selected-term'>Madison Cawthorn</span> on Tuesday for carrying a loaded gun inside of Charlotte Douglas International Airport, the latest in a string of controversies Cawthorn has found himself in.",
    "author": "Brent D. Griffiths",
    "title": "Madison Cawthorn is cited for bringing a loaded gun into the Charlotte Airport"
  },
  {
    "id": 2724,
    "mediaId": 376,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> was cited Tuesday for possession of a dangerous weapon on city property after a gun was discovered in his bag at a security screening checkpoint in Charlotte Douglas International Airport in North Carolina.",
    "author": "Chris Marquette",
    "title": "Rep. Madison Cawthorn cited for bringing gun through Charlotte airport"
  },
  {
    "id": 2726,
    "mediaId": 593,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> has been cited by police for possessing a gun at an airport, according to local media, adding to a string of controversies for the first-term lawmaker ahead of a contested primary election.",
    "author": "Moira Warburton and David Shepardson",
    "title": "U.S. Rep. Cawthorn Cited For Gun At Airport -local Media"
  },
  {
    "id": 2728,
    "mediaId": 237,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE  Rep. <span class='selected-term'>Madison Cawthorn</span> may have violated federal insider trading laws as he hyped up an alleged pump-and-dump cryptocurrency scheme, multiple watchdog groups told the Washington Examiner.",
    "author": "Andrew Kerr",
    "title": "Madison Cawthorn implicated in potential insider trading scheme, experts say"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "\"There will be more Marjorie Taylor Greenes and <span class='selected-term'>Madison Cawthorn</span>s nominated for federal office and for state office and for local officefar more than there are Fred Uptons.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 2703,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) Wednesday called for an investigation by the House Ethics Committee into Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) over allegations that Cawthorn violated federal insider trading laws.",
    "author": "Tal Axelrod",
    "title": "Tillis calls for investigation of Cawthorn over insider trading allegations"
  },
  {
    "id": 2704,
    "mediaId": 21,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina appears to have violated a federal conflict-of-interest law by failing to report his stake in a cryptocurrency named for the anti-Joe Biden slogan \"Let's Go Brandon.\"",
    "author": "Kimberly Leonard",
    "title": "GOP Rep. Madison Cawthorn appears to have violated the STOCK Act by failing to disclose 'let's go brandon' cryptocurrency purchase"
  },
  {
    "id": 2705,
    "mediaId": 32,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Erin Siegal | Reuters\nA Republican senator on Wednesday called on Congress to investigate his GOP colleague Rep. <span class='selected-term'>Madison Cawthorn</span>, of North Carolina, who has come under fire as ethics watchdogs raise suspicions of possible insider trading over his relationship to an anti-Biden cryptocurrency.",
    "author": "Kevin Breuninger",
    "title": "Fellow North Carolina Republican calls for insider trading probe of Rep. Madison Cawthorn's crypto holdings"
  },
  {
    "id": 2706,
    "mediaId": 63,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Topline\nA wave of controversy hitting right-wing firebrand Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) shows no signs of letting up, with a Republican senator on Wednesday calling for an investigation into potential insider trading by the youngest member of Congresshere are the many other troubles he has faced since launching a congressional bid two years ago.",
    "author": "Nicholas Reimann",
    "title": "A Time Line Of Madison Cawthorn's MisstepsFrom Visiting Nazi Retreat To Wild Orgy Claims"
  },
  {
    "id": 2707,
    "mediaId": 63,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Topline\nSen. Thom Tillis called Wednesday for the House Ethics Committee to investigate fellow North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> after watchdog agencies told the Washington Examiner the congressman could be implicated in an insider trading schemethe latest in a series of scandals for Cawthorn.",
    "author": "Anna Kaplan",
    "title": "Sen. Tillis Calls For Insider Trading Probe Over Rep. Cawthorn's Ties To Let's Go Brandon' Meme Coin"
  },
  {
    "id": 2708,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Speculation that the Republican Party may be trying to purge Representative <span class='selected-term'>Madison Cawthorn</span> from Congress has intensified after the North Carolina congressman was embroiled in yet another potential scandal.",
    "author": "Ewan Palmer",
    "title": "Is Madison Cawthorn Being Purged by Republicans?"
  },
  {
    "id": 2709,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) has accused the establishment? of launching a coordinated drip campaign? against him, a comment that comes as the congressman finds himself in the midst of several controversies.",
    "author": "Sarakshi Rai",
    "title": "Cawthorn says establishment' is hitting him with coordinated drip campaign'"
  },
  {
    "id": 2711,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Just In...\nSen. Thom Tillis called on the House Ethics Committee to investigate allegations that his fellow North Carolina Republican, Rep. <span class='selected-term'>Madison Cawthorn</span>, engaged in an insider trading scheme.",
    "author": "Andrew Kerr",
    "title": "Thom Tillis calls for investigation into Madison Cawthorn insider trading allegations"
  },
  {
    "id": 2712,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is favored to win the Republican primary in North Carolina's 11th Congressional District despite several run-ins with the law and fresh allegations of insider trading.",
    "author": "David M. Drucker",
    "title": "Rep. Madison Cawthorn holds GOP primary edge despite many unflattering headlines"
  },
  {
    "id": 2714,
    "mediaId": 881,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Madison Cawthorn</span> simply cannot keep it together right now.",
    "author": "Paul Blest",
    "title": "Madison Cawthorn Is Having a Hell of a Week"
  },
  {
    "id": 1882,
    "mediaId": 376,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "ICYMI\nCawthorn's bad news cycle: Some watchdog groups raised concerns that North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> may have violated insider trading laws when he hyped the Let's Go Brandon? cryptocurrency on Instagram the day before it announced a sponsorship deal with the NASCAR driver Brandon Brown and its value spiked.",
    "author": "Stephanie Akin\nKate Ackley\nMary Ellen McIntire",
    "title": "At the Races: Signs of red ahead"
  },
  {
    "id": 1890,
    "mediaId": 43,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "We have talked about <span class='selected-term'>Madison Cawthorn</span> plenty on this show.",
    "author": "",
    "title": "The Downballot: Big, big May primary preview (transcript)"
  },
  {
    "id": 2693,
    "mediaId": 409,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "State senator Chuck Edwards isn't well-known outside of North Carolina, but that won't be the case for long if his bid to knock off Representative <span class='selected-term'>Madison Cawthorn</span> in an upcoming Republican primary election succeeds.",
    "author": "Dan McLaughlin",
    "title": "Madison Cawthorn's Primary Challenger Is Everything Cawthorn Isn't"
  },
  {
    "id": 2694,
    "mediaId": 32,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "This photo provided by the Transportation Security Administration shows a 9mm Staccato C2 handgun that officials say was found in U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>'s, R-N.C., carry-on bag at a Charlotte Douglas International Airport security checkpoint, Tuesday, April 26, 2022.",
    "author": "Kevin Breuninger",
    "title": "Democrats push for TSA crackdown on guns after GOP Rep. Madison Cawthorn brought handgun to airport"
  },
  {
    "id": 2695,
    "mediaId": 237,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Just In...\nSen. Thom Tillis has unleashed a fresh round of attacks on his fellow North Carolina Republican lawmaker, Rep. <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Andrew Kerr",
    "title": "Thom Tillis continues attacks on fellow North Carolina Republican Madison Cawthorn"
  },
  {
    "id": 2697,
    "mediaId": 21,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Republican Senator Thom Tillis has called for Congress to conduct a bipartisan investigation of his House colleague, Rep. <span class='selected-term'>Madison Cawthorn</span>, over the latter's undeclared cryptocurrency purchases.",
    "author": "Cheryl Teh",
    "title": "North Carolina GOP senator calls for Madison Cawthorn's cryptocurrency purchases to be investigated by House Ethics Committee"
  },
  {
    "id": 2674,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Madison Cawthorn</span> ( R-N.C.) has been a lightning rod for controversy.",
    "author": "Sarakshi Rai",
    "title": "Timeline of Madison Cawthorn controversies"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 28, 2022\nCawthorn later tweeted a screenshot of an article from The Epoch Times titled \"Rep. Cawthorn Says 'Establishment' Targeting Him With 'Coordinated Drip Campaign.'\"",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  },
  {
    "id": 2679,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The Fire <span class='selected-term'>Madison Cawthorn</span> group, operated by the American Muckrakers PAC, accused the North Carolina congressman of ethical violations, including paying thousands of dollars worth of gifts, loans and other benefits to his staffer and close aide, Stephen Smith, 23, which were not declared.",
    "author": "Ewan Palmer",
    "title": "What Madison Cawthorn, Stephen Smith Venmo Messages Say"
  },
  {
    "id": 2681,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The Fire <span class='selected-term'>Madison Cawthorn</span> group, which is operated by the American Muckrakers PAC, also submitted screenshots of what is believed to be Venmo payments between Smith and the congressman with notes such as \"Getting naked for me in Sweden,\" \"The stuff we did in Amsterdam,\" and \"The quickie at the airport\" and \"breaking and entering.\"",
    "author": "Ewan Palmer",
    "title": "Who is Stephen Smith? Madison Cawthorn Staffer Appears to Grope Him in Clip"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Besieged by multiplying scandals and salacious accusations, Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  },
  {
    "id": 2665,
    "mediaId": 195,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "News\nThe flood of controversies surrounding Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) shows no sign of ceasing just weeks before his May 17 primary, raising questions as to whether he can avoid a runoff despite being one of the highest-profile freshmen in the House.",
    "author": "Tal Axelrod",
    "title": "Mounting scandals fuel uncertainty over Cawthorn's reelection"
  },
  {
    "id": 2668,
    "mediaId": 237,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "If you're state Sen. Chuck Edwards, running against Rep. <span class='selected-term'>Madison Cawthorn</span> in North Carolina's 11th Congressional District, you focus on meat-and-potato problems and, more specifically, the mountains.?\nI'm running because the 14-month experiment here in District 11 has concluded, and it's time to send someone to Washington, D.C., to represent the people of the mountains who has a deep history of accomplishment in life and in business and in serving the people of the district,? Edwards told the Washington Examiner in an interview.",
    "author": "David M. Drucker",
    "title": "Chuck Edwards campaigns against Rep. Madison Cawthorn as the adult in the room"
  },
  {
    "id": 2669,
    "mediaId": 136,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 29, 2022\nCawthorn, 26, went on to maintain that he \"looked damn good on that cruise ship,\" apparently referring to now-viral photos of him wearing women's lingerie on a cruise ship that were leaked to the press last week.",
    "author": "Aila Slisco",
    "title": "'Pathetic': Madison Cawthorn Responds to Ethics Complaint Over Conduct"
  },
  {
    "id": 2671,
    "mediaId": 43,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nMail-in registration deadline: April 22, 2022\nOnline registration deadline: April 22, 2022\nIn-person registration deadline: April 22, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\nGroup accuses Rep. Cawthorn of misconduct, files ethics complaint\nWLOS, Samiar Nefzi, 4/29/2022\nCongressman <span class='selected-term'>Madison Cawthorn</span> is now facing a complaint, accusing him of several ethical violations.",
    "author": "",
    "title": "DKos Asheville Open Thread: Mad"
  },
  {
    "id": 2662,
    "mediaId": 43,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Daily Kos Stories\nIt looks like <span class='selected-term'>Madison Cawthorn</span> tried to get on plane with a loaded gun\nDaily Kos, Walter Einenkel, 4/26/2022\nOn Tuesday, WSOC-TV Channel 9 reported that three sources tell them Rep. Madison Cawthorn was cited for having a gun at Charlotte Douglas International Airport Tuesday morning.? The outlet says that they were given a photo that shows a loaded Staccato C2,? a 9 mm handgun that was taken away from Cawthorn during a TSA check inside of Charlotte Douglas International Airport.",
    "author": "",
    "title": "North Carolina Open Thread: Wealthy candidates flood primaries, Military families, Cawthorn"
  },
  {
    "id": 2651,
    "mediaId": 169,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> has been involved in so many scandals since his 2020 congressional election that we need a timeline to keep track.",
    "author": "Paige Harriss",
    "title": "Madison Cawthorn's scandalous freshman term: 11 controversial moments since joining Congress"
  },
  {
    "id": 2643,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) May 4, 2022\nThe American Muckrakers PAC, a group trying to achieve Cawthorn's defeat in this year's election, posted the video on its website, FireMadison.com, according to a Charlotte Observer report.",
    "author": "Ryan King",
    "title": "Madison Cawthorn says 'blackmail won't win' after nude video surfaces"
  },
  {
    "id": 2647,
    "mediaId": 43,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "A push by voters to bar Rep. <span class='selected-term'>Madison Cawthorn</span> from running for office in North Carolina because of his support for insurrectionist activities running up to and on Jan. 6 is not over yet.",
    "author": "",
    "title": "Another problem for Madison Cawthorn could be just around the corner"
  },
  {
    "id": 2630,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "A grainy 28-second video showing a naked young man gyrating against someone in bed amid squeals and laughter was the latest in a string of episodes that has turned Republicans against one of their own: the brash U.S. Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "David Morgan",
    "title": "Nude Video Latest Scandal Turning Republicans Against U.S. Rep. Cawthorn"
  },
  {
    "id": 2633,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "US Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican of North Carolina, waves to the crowd after he spoke before former President Donald Trump takes the stage at a rally on April 9, 2022, in Selma, NC.",
    "author": "Camila DeChalus",
    "title": "Voters in Madison Cawthorn's North Carolina district have very mixed feelings about the freshman lawmaker as controversies swirl before his May 17 primary"
  },
  {
    "id": 2636,
    "mediaId": 32,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The group said the video was provided by a former Cawthorn supporter and big donor who asked to remain anonymous.?\nIt pains us to post it but in the public and voters interest we chose to do so,? the group said, just above an all-caps link urging viewers to WATCH THE VIDEO OF REPUBLICAN CONGRESSMAN <span class='selected-term'>MADISON CAWTHORN</span> DRY HUMPING SOMEONE'S HEAD AND MOANING LOUDLY HERE.?\nRepublicans are hoping to regain House and possibly the Senate in the upcoming midterm elections, and incumbents tend to hold major advantages over their electoral challengers.",
    "author": "Kevin Breuninger",
    "title": "GOP Rep. Cawthorn calls leaked nude video blackmail,' says he was just being crass with a friend'"
  },
  {
    "id": 2638,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The nonprofit openly describes itself as a political action committee dedicated to \"solely to ensuring that North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s first term in office is his last.\"",
    "author": "Nicholas Morgan",
    "title": "Controversial Republican Lashes Out At Foes For Leaking Naked Video To 'Blackmail' Him"
  },
  {
    "id": 1717,
    "mediaId": 21,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "HENDERSONVILLE, North Carolina  Multiple scandals involving guns, money, cocaine orgies, and a nude video are rocking Rep. <span class='selected-term'>Madison Cawthorn</span> ahead of his May 17 Republican primary.",
    "author": "Camila DeChalus",
    "title": "Rep. Madison Cawthorn's primary challenger Chuck Edwards wants to focus on results for North Carolina  not his opponent's many scandals"
  },
  {
    "id": 2621,
    "mediaId": 881,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Willis is investigating whether Trump committed criminal election interference when he called Raffensperger on Jan. 2, 2021 trying to get him to find 11,780 votes, one more than we need.?\nNorth Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> is facing seven primary challengers and a very obvious GOP campaign to run him out of office.",
    "author": "Todd Zwillich",
    "title": "Lies, power grabs, voter suppression, and the tyranny of the minority."
  },
  {
    "id": 2616,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\n<span class='selected-term'>Madison Cawthorn</span> May Have a New Ethics Violation to Handle\nDaily Beast, Roger Sollenberger, 5/5/2022\nRep. Madison Cawthorn (R-NC) has been embroiled in scandal after scandal.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn Roundup, yee haw!"
  },
  {
    "id": 3268,
    "mediaId": 43,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "Cawthorn addresses video released by opposition group showing him naked in bed being crass'\nCNN, Mary Kay Mallonee, 5/5/2022\nAn opposition group that is actively campaigning against Rep. <span class='selected-term'>Madison Cawthorn</span> has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, being crass with a friend? and acting foolish.?\nAfter the video appeared on social media, Cawthorn tweeted, A new hit against me just dropped.",
    "author": "",
    "title": "North Carolina Open Thread: Cawthorn's Corner"
  },
  {
    "id": 3259,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Last November, Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) texted his state's junior senator, Thom Tillis, about a tweet from the senator's wife.",
    "author": "",
    "title": "Inside the Republican campaign to take down Madison Cawthorn"
  },
  {
    "id": 3256,
    "mediaId": 129,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Hines, a 26-year-old former college football recruit often compared to Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina before Cawthorn's recent string of troubles, is running for a U.S. House seat representing the exurban area just south of Raleigh.",
    "author": "",
    "title": "Can Donald Trump Get This 26-Year-Old Elected to Congress?"
  },
  {
    "id": 3245,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Representative <span class='selected-term'>Madison Cawthorn</span> on Wednesday morning posted on Twitter that instead of providing financial help to Ukrainians as they fight against the Russian invasion of their country, the money should be spent stateside.",
    "author": "Adam Staten",
    "title": "Madison Cawthorn Slammed for Suggesting Ukraine Aid Be Spent on Veterans"
  }
]