[
  {
    "id": 3107,
    "mediaId": 34,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "I'm privileged to participate with the team from Free Speech for People and my fellow North Carolina counsel, in this critically important effort to enforce that constitutional mandate and disqualify <span class='selected-term'>Madison Cawthorn</span> from attempting to be elected to public office in 2022.?\nThe purpose of the constitutional provision relied on by the challengers to Mr. Cawthorn's candidacy is to prevent persons who sought illegally to overthrow a duly elected government from participating in running that government,? said James G. Exum, Jr. The challengers believe the evidence will show Mr. Cawthorn to be one of those persons.?\nCurrently, Cawthorn represents North Carolina's 11th Congressional District, but for the 2022 election, he filed a notice of candidacy for the redrawn 13th Congressional District.",
    "author": "",
    "title": "North Carolina Voters Challenge Rep. Madison Cawthorn's Candidacy for Reelection Under Fourteenth Amendment's Insurrectionist Disqualification Clause"
  },
  {
    "id": 3113,
    "mediaId": 34,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "\"The Constitution mandates that those who take the oath to support the Constitution and then violate that oath shall be disqualified from holding office,\" said Orr, who called himself \"privileged to participate... in this critically important effort to enforce that constitutional mandate and disqualify <span class='selected-term'>Madison Cawthorn</span> from attempting to be elected to public office in 2022.\"",
    "author": "Kenny Stancil",
    "title": "Citing 'Blatant Acts of Insurrection,' NC Voters Petition to Bar Cawthorn From Seeking Reelection"
  },
  {
    "id": 3092,
    "mediaId": 129,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> has breezily dismissed a candidacy challenge filed by voters in his home state, North Carolina, seeking to bar him from re-election to the House of Representatives based on his role in the events of Jan. 6.",
    "author": "",
    "title": "Will Madison Cawthorn Be Brought Down by Insurrection'?"
  },
  {
    "id": 3057,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn gone wild, Dem forum, Rosa Parks awards, YMI at 129 yrs"
  },
  {
    "id": 3036,
    "mediaId": 43,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "So while we're still stuck with them, I like to think that they both lost in this situation,? Beard added, which makes me happy.?\nNir reminded the audience that Cawthorn is being investigated over his involvement in the Jan. 6 insurrection: We also shouldn't forget about the fact that there is still a pending challenge to <span class='selected-term'>Madison Cawthorn</span>'s eligibility to even appear on the ballot because of his involvement around the Jan. 6 insurrection and invasion of the Capitol.",
    "author": "",
    "title": "Highlights from The Downballot: A Texas primary preview with Jeff Singer"
  }
]