[
  {
    "id": 3080,
    "mediaId": 43,
    "date": "1/30/2022 12:00:00 AM",
    "sentence": "NC-Sen: Snowflake Bathroom Bill Gov Compares Himself Not Getting A Job At Duke To 1960s Segregation\nDaily Kos, poopdogcomedy, 1/27/2022\n<span class='selected-term'>Madison Cawthorn</span> case could spell trouble for other insurrectionists' including Trump\n Madison Cawthorn, NC-11\nIf an effort to disqualify Rep. Madison Cawthorn (R-NC) from the ballot is successful, it could lead to similar challenges against other lawmakers accused of fueling the Capitol insurrection  including former president Donald Trump.The case against Cawthorn  who cheered on the Jan. 6 rioters  seeks to force him to prove that he's not an insurrectionist based on a little-known section of the 14th Amendment that was adopted to punish members of the Confederacy after they reclaimed their elected offices in Washington.",
    "author": "",
    "title": "North Carolina Open Thread: Fentanyl test strips, Whining McCrory and Cawthorn's Corner"
  },
  {
    "id": 504,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. <span class='selected-term'>Madison Cawthorn</span> from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "author": "",
    "title": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn"
  },
  {
    "id": 3054,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Almost everyone had expected Moore to run in the 13th District under the map that has since been struck down, but he decided not to after Rep. <span class='selected-term'>Madison Cawthorn</span> surprised everyone by announcing he'd run for that constituency rather than the neighboring 14th.",
    "author": "",
    "title": "Morning Digest: Longtime Democratic power player on Long Island will not seek"
  },
  {
    "id": 3000,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "We also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "North Carolina, South Korea, and why you should Run For Something (transcript)"
  },
  {
    "id": 2993,
    "mediaId": 43,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Also in North Carolina, <span class='selected-term'>Madison Cawthorn</span>'s eligibility to appear on the ballot this November has been challenged by a group of voters under an unusual and interesting North Carolina law that is based on the 14th Amendment.",
    "author": "",
    "title": "Highlights from The Downballot: North Carolina, South Korea, and why you should Run for Something"
  },
  {
    "id": 2984,
    "mediaId": 163,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "House Republicans, including Representatives Lauren Boebert (R-CO), Kat Cammack (R-FL), <span class='selected-term'>Madison Cawthorn</span> (R-NC), Marjorie Taylor Greene (R-GA), Lisa McClain (R-MI) and Jody Hice (R-GA), who oppose mask mandates march as a group to the Senate chamber to highlight different coronavirus disease (COVID-19) mask rules between the House and Senate sides of the U.S. Capitol in Washington, U.S., July 29, 2021.",
    "author": "David Morgan",
    "title": "Ukraine war becomes a cudgel in Republican Party's internal conflict"
  },
  {
    "id": 2985,
    "mediaId": 593,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "ATTACK AD\nAlso in North Carolina, Representative <span class='selected-term'>Madison Cawthorn</span> came under fire from his Republican rivals over remarks at a town hall in which he criticized Zelenskiy and Ukraine.",
    "author": "David Morgan",
    "title": "Ukraine War Becomes A Cudgel In Republican Party's Internal Conflict"
  },
  {
    "id": 2987,
    "mediaId": 237,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> is stumbling at home and abroad as his bid to play Republican kingmaker falls flat with voters and alienates colleagues.",
    "author": "David M. Drucker",
    "title": "'His act is wearing thin': North Carolina Republicans gripe about Madison Cawthorn"
  },
  {
    "id": 1147,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Right now, what you say about the enemy and saying Putin is an intelligent actor or there are reasons why he wanted to protect his flank  no, there wasn't.?\nMcCrory also takes issue with North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> calling Ukrainian President Volodymyr Zelensky a \"thug\" at a town hall and with President Joe Biden's initial dismissiveness of the Russians possibly invading Ukraine.",
    "author": "Salena Zito",
    "title": "McCrory on why he is still standing despite both Club for Growth and Trump against him"
  },
  {
    "id": 2970,
    "mediaId": 25,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n More\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Supreme Court tosses Wisconsin state legislative maps but keeps congressional maps in place"
  },
  {
    "id": 2867,
    "mediaId": 151,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Also booked for the rally is Rep. <span class='selected-term'>Madison Cawthorn</span>, the freshman congressman from the western part of the state who has angered top House Republicans after talking about orgies and cocaine.",
    "author": "",
    "title": "Local conservatives revolt against Trump House favorite"
  },
  {
    "id": 2868,
    "mediaId": 151,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Also booked for the rally is Rep. <span class='selected-term'>Madison Cawthorn</span>, the freshman congressman from the western part of the state who has angered top House Republicans after talking about orgies and cocaine.",
    "author": "",
    "title": "Local conservatives revolt against Trump House favorite"
  },
  {
    "id": 2856,
    "mediaId": 147,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "In 2020, political newcomer <span class='selected-term'>Madison Cawthorn</span> comfortably won a GOP congressional primary runoff over Trump's pick.",
    "author": "Gary D. Robertson",
    "title": "Trump's endorsement power tested in North Carolina Senate race"
  },
  {
    "id": 2862,
    "mediaId": 43,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nJohn Oliver to Kevin McCarthy: You 'raised the monster' that is <span class='selected-term'>Madison Cawthorn</span> and 'it's your effing problem'\nRaw Story, Sarah K. Burris, 4/4/2022\nRep. Kevin McCarthy (R-CA) revealed this week that he no longer has \"trust\" in Rep. Madison Cawthorn (R-NC), the young official who outed GOP members for having \"sexual get-togethers\" and snorting cocaine.",
    "author": "",
    "title": "DKos Asheville Open Thread: Your weekly Cawthorn, packed full of (your words here). And bears!"
  },
  {
    "id": 2799,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The first source of pain is freshman Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who has come under fire from Republican colleagues in recent weeks after making controversial comments.",
    "author": "Max Greenwood",
    "title": "Campaign Report  GOP jockeying ramps up in Senate primaries"
  }
]