[
  {
    "id": 843,
    "mediaId": 169,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Joe Kent  Washington, 3rd congressional district\nKent is running to unseat Rep. Jamie Herrera Beutler, R-Wash., who voted to impeach Trump after the Capitol riot, and is the most prominent candidate backed by the \"Insurrection Caucus,\" meaning Trump allies like Greene, Boebert, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Rep. Matt Gaetz of Florida.",
    "author": "Igor Derysh",
    "title": "Meet the scariest Republican candidates of 2022: It wasn't easy to pick 'em"
  },
  {
    "id": 3088,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "Jonathan Weisman",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 3090,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 3077,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "\"If <span class='selected-term'>Madison Cawthorn</span> were ten years old and seeking to be on the ballot in North Carolina, there'd be no question that he's ineligible to be placed on the ballot because he doesn't meet the age qualification for a member of Congress.",
    "author": "",
    "title": "Cawthorn Facing Ballot Removal for Role in Insurrection (So May Trump, Others): 'BradCast' 2/1/2022"
  },
  {
    "id": 589,
    "mediaId": 43,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosar ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump is the worst president the U.S. ever had'"
  },
  {
    "id": 3066,
    "mediaId": 237,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> and Sen. Rand Paul endorsed Starbuck before Trump and pressed back on Trump's endorsement.",
    "author": "Christopher Hutton",
    "title": "Trump-endorsed Morgan Ortagus announces Tennessee run for Congress"
  },
  {
    "id": 3007,
    "mediaId": 43,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "In a recipe for infighting, the far-right House Freedom Caucushome to Reps. Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosaris getting ready to make a play for increased power.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 304,
    "mediaId": 195,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "A month ago, McCarthy publicly criticized members Rep. Marjorie Taylor Greene (R-Ga.) and Rep. Paul Gosar (R-Ariz.) for speaking at a white nationalist conference, which he called unacceptable.? Last week, he said that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) was wrong? for calling Ukrainian President Volodymyr Zelensky a \"thug.\"",
    "author": "Emily Brooks -",
    "title": "A more unified House GOP aims to get everyone on same page"
  },
  {
    "id": 2966,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The challenge was filed by the same coalition of constitutional scholars and liberal activists who unsuccessfully tried to block Rep. <span class='selected-term'>Madison Cawthorn</span> from the GOP primary ballot in North Carolina.",
    "author": "Marshall Cohen",
    "title": "Groups try to disqualify Rep. Marjorie Taylor Greene's candidacy over January 6"
  },
  {
    "id": 2946,
    "mediaId": 129,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "That is the object lesson of Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina, the House's youngest member, whose bid for a second term is in jeopardy after a series of incendiary statements and personal foibles have soured many former supporters.",
    "author": "",
    "title": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too."
  },
  {
    "id": 249,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\nRepublicans freaking out about <span class='selected-term'>Madison Cawthorn</span>'s allegations of 'cocaine' and 'orgies'\nGreene and Gosar won't face punishment for speaking at white nationalist event\nThis is a short blurb about Daily Kos.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nBut if losing Tillis' endorsement and a reprimand from House leadership was meant to temper Cawthorn's actions, it doesn't appear to have worked.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2918,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "While he's hardly the most popular guy in the Capitol  in fact, he's nearly the opposite  26-year-old Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is having a Regina-like effect on his party right now.",
    "author": "",
    "title": "Why Cawthorn got more GOP blowback than MTG"
  },
  {
    "id": 2844,
    "mediaId": 129,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Outside Arizona, challengers are also running against Representatives Marjorie Taylor Greene in Georgia, <span class='selected-term'>Madison Cawthorn</span> in North Carolina and Lauren Boebert in Colorado.",
    "author": "",
    "title": "Gosar, Far-Right Incumbent, Faces G.O.P. Challengers in Arizona"
  },
  {
    "id": 2817,
    "mediaId": 238,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "The organization also filed a similar lawsuit on behalf of North Carolina voters to prevent Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) from running for reelection because of his alleged role in the storming of the Capitol but was initially unsuccessful.",
    "author": "Eugene Scott",
    "title": "Legal effort to remove Greene from Ga. ballot can proceed, judge rules"
  },
  {
    "id": 2794,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, who also faces a Republican primary in mid-May.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld"
  },
  {
    "id": 2771,
    "mediaId": 881,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "So <span class='selected-term'>Madison Cawthorn</span>, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] Mark Finchem are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "Insurrectionist' Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 1875,
    "mediaId": 21,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Republican Reps. Matt Gaetz of Florida, <span class='selected-term'>Madison Cawthorn</span> of North Carolina, and Paul Gosar of Arizona have all proxy voted over 100 times.",
    "author": "Bryan Metzger",
    "title": "These 15 Republicans have proxy voted at least 100 times even though Kevin McCarthy and GOP leadership think voting remotely is unconstitutional"
  },
  {
    "id": 2691,
    "mediaId": 63,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Thom Tillis called Wednesday for the House Ethics Committee to investigate fellow North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> after watchdog agencies told the Washington Examiner the congressman could be implicated in an insider trading scheme,? reports Anna Kaplan:\nTillis said in a tweet insider trading by a member of Congress is a serious betrayal of their oath,? adding that Cawthorn owes North Carolinians an explanation.?\nThe Examiner reports Cawthorn was pictured at an event on December 29 with James Koutoulas, one of the people behind the Let's Go Brandon? cryptocurrency, which is named after the viral chant insulting President Joe Biden.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: McCarthy's Money, Cawthorn's Crypto, Truth Social's Triumph"
  },
  {
    "id": 2664,
    "mediaId": 409,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "I agree with our editorial, with Rich and Kevin, that the efforts to kick Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Paul Gosar, and Andy Biggs off the ballot under Section 3 of the Fourteenth Amendment are ill-considered and dangerous to democracy because these efforts ask courts to apply a standard lower than what Section 3 has historically required.",
    "author": "Dan McLaughlin",
    "title": "Some Additional Section 3 Disqualification Puzzles"
  }
]