[
  {
    "id": 1147,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Right now, what you say about the enemy and saying Putin is an intelligent actor or there are reasons why he wanted to protect his flank  no, there wasn't.?\nMcCrory also takes issue with North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> calling Ukrainian President Volodymyr Zelensky a \"thug\" at a town hall and with President Joe Biden's initial dismissiveness of the Russians possibly invading Ukraine.",
    "author": "Salena Zito",
    "title": "McCrory on why he is still standing despite both Club for Growth and Trump against him"
  },
  {
    "id": 2970,
    "mediaId": 25,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n More\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Supreme Court tosses Wisconsin state legislative maps but keeps congressional maps in place"
  },
  {
    "id": 2921,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Now I have to go to North Carolina and campaign for Thom Tillis's primary opponent because Donald Trump and <span class='selected-term'>Madison Cawthorn</span> are more popular with the grassroots in North Carolina than Thom Tillis will ever be, never mind the other RINO there, Richard Burr.",
    "author": "Juliegrace Brufke",
    "title": "Roger Stone defends Madison Cawthorn, claims orgies and drug abuse not uncommon in DC"
  },
  {
    "id": 2924,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,? Tillis said.",
    "author": "Juliegrace Brufke",
    "title": "Republicans turn against Rep. Madison Cawthorn after orgies and cocaine comment"
  },
  {
    "id": 2926,
    "mediaId": 136,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span>, a North Carolina Republican, is facing backlash from his state's two GOP senators after multiple recent controversieswith one senator deciding to back his primary challenger.",
    "author": "Jason Lemon",
    "title": "GOP Senators From Madison Cawthorn's State Won't Back His Re-Election Bid"
  },
  {
    "id": 2930,
    "mediaId": 593,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., has seen his support among members of his party evaporate after salacious claims he made about being invited to sex parties and witnessing drug use on Capitol Hill.",
    "author": "Nicholas Morgan",
    "title": "Republicans Turn On 'Embarrassment' Madison Cawthorn After Comments About Sex Parties, Cocaine"
  },
  {
    "id": 2933,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>'s (R-N.C.) unfounded allegations of being invited to orgies in Washington and seeing people do cocaine is prompting condemnation from his state's GOP senators, House Minority Leader Kevin McCarthy (Calif.) and other Republicans.",
    "author": "",
    "title": "Madison Cawthorn's antics miff GOP"
  },
  {
    "id": 2900,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is slated to speak at former President Trump's upcoming rally in North Carolina, giving the embattled congressman a key audience with Trump's ultra-conservative base as he faces backlash from GOP lawmakers and much of his state's congressional delegation.",
    "author": "Max Greenwood",
    "title": "Cawthorn to speak at North Carolina Trump rally"
  },
  {
    "id": 2901,
    "mediaId": 237,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Embattled North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> refused to retract his accusations that orgies and cocaine use take place among politicians in Washington despite coming under fire from his Republican colleagues.",
    "author": "Juliegrace Brufke",
    "title": "Cawthorn defends 'calling out corruption' with orgy and cocaine claims"
  },
  {
    "id": 2905,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> could be in for a tough fight to keep his seat as primary opponents circle and prominent Republicans take aim at the youngest member of the U.S. House of Representatives.",
    "author": "Darragh Roche",
    "title": "Will 'Orgy' Claims Cost Madison Cawthorn His GOP Career?"
  },
  {
    "id": 2910,
    "mediaId": 21,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Several Republican Party leaders in North Carolina are backing Rep. <span class='selected-term'>Madison Cawthorn</span>'s primary challenger following the congressman's claims that he had witnessed \"sexual perversion\" and drug use among his Congress colleagues.",
    "author": "Cheryl Teh",
    "title": "GOP leaders from Madison Cawthorn's home state are backing his primary challenger after the congressman's orgy comments"
  },
  {
    "id": 2917,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Perhaps Rep. <span class='selected-term'>Madison Cawthorn</span>'s revelation about GOP sex parties and cocaine use hit a little too close to home, because this is apparently where the rubber meets the road for Republicans.",
    "author": "",
    "title": "As Republicans fret over Cawthorn's drugs and orgies revelation, Trump gives him a platform"
  },
  {
    "id": 2894,
    "mediaId": 151,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "| Andrew Harnik/AP Photo\nBy Olivia Beavers and Craig Howie\n 04/01/2022 08:19 PM EDT\nAmid a burgeoning congressional controversy, Rep. <span class='selected-term'>Madison Cawthorn</span> on Friday blamed Democrats and the media for amplifying his comments that some of his fellow GOP members engage in orgies and use cocaine.",
    "author": "",
    "title": "Cawthorn blames the left and the media' after intra-GOP furor over sex-and-drugs comments"
  },
  {
    "id": 2854,
    "mediaId": 65,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Rep. Ted Budd, R-N.C., who has received an endorsement from Trump, will offer remarks as he seeks to win the Senate seat being vacated by Sen. Richard Burr, R-N.C.\nOther North Carolina Republicans slated to speak at the event include Rep. <span class='selected-term'>Madison Cawthorn</span>, Rep. Dan Bishop, Rep. Greg Murphy, Lt. Gov.",
    "author": "Kyle Morris",
    "title": "Former President Trump addresses supporters at North Carolina rally"
  },
  {
    "id": 2824,
    "mediaId": 237,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Just In...\nTaxpayers footed the bill for Rep. <span class='selected-term'>Madison Cawthorn</span>'s visit to a luxury riverside mountain resort in August 2021, according to House disbursement records reviewed by the Washington Examiner.",
    "author": "Andrew Kerr",
    "title": "Madison Cawthorn spent taxpayer funds at luxury resort"
  },
  {
    "id": 2707,
    "mediaId": 63,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Topline\nSen. Thom Tillis called Wednesday for the House Ethics Committee to investigate fellow North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> after watchdog agencies told the Washington Examiner the congressman could be implicated in an insider trading schemethe latest in a series of scandals for Cawthorn.",
    "author": "Anna Kaplan",
    "title": "Sen. Tillis Calls For Insider Trading Probe Over Rep. Cawthorn's Ties To Let's Go Brandon' Meme Coin"
  },
  {
    "id": 2614,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "This is where <span class='selected-term'>Madison Cawthorn</span> and other odious representatives are from.",
    "author": "",
    "title": "Majority Savers: Please Support Cheri Beasley!"
  }
]