[
  {
    "id": 2669,
    "mediaId": 136,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 29, 2022\nCawthorn, 26, went on to maintain that he \"looked damn good on that cruise ship,\" apparently referring to now-viral photos of him wearing women's lingerie on a cruise ship that were leaked to the press last week.",
    "author": "Aila Slisco",
    "title": "'Pathetic': Madison Cawthorn Responds to Ethics Complaint Over Conduct"
  },
  {
    "id": 1735,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina appeared to confirm the authenticity of a leaked nude video and slammed it as part of a \"drip drip\" campaign to destroy his career.",
    "author": "Sophia Ankel",
    "title": "Madison Cawthorn responds to leaked nude video, says it's part of a 'drip drip' campaign for attempting to destroy his career"
  },
  {
    "id": 2638,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The nonprofit openly describes itself as a political action committee dedicated to \"solely to ensuring that North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s first term in office is his last.\"",
    "author": "Nicholas Morgan",
    "title": "Controversial Republican Lashes Out At Foes For Leaking Naked Video To 'Blackmail' Him"
  },
  {
    "id": 2616,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\n<span class='selected-term'>Madison Cawthorn</span> May Have a New Ethics Violation to Handle\nDaily Beast, Roger Sollenberger, 5/5/2022\nRep. Madison Cawthorn (R-NC) has been embroiled in scandal after scandal.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn Roundup, yee haw!"
  },
  {
    "id": 3268,
    "mediaId": 43,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "Cawthorn addresses video released by opposition group showing him naked in bed being crass'\nCNN, Mary Kay Mallonee, 5/5/2022\nAn opposition group that is actively campaigning against Rep. <span class='selected-term'>Madison Cawthorn</span> has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, being crass with a friend? and acting foolish.?\nAfter the video appeared on social media, Cawthorn tweeted, A new hit against me just dropped.",
    "author": "",
    "title": "North Carolina Open Thread: Cawthorn's Corner"
  }
]