[
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 3054,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Almost everyone had expected Moore to run in the 13th District under the map that has since been struck down, but he decided not to after Rep. <span class='selected-term'>Madison Cawthorn</span> surprised everyone by announcing he'd run for that constituency rather than the neighboring 14th.",
    "author": "",
    "title": "Morning Digest: Longtime Democratic power player on Long Island will not seek"
  },
  {
    "id": 1290,
    "mediaId": 43,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right Rep. <span class='selected-term'>Madison Cawthorn</span> announced Monday he'd run for re-election in the new 11th District, a seat in the western North Carolina mountains that includes most of the constituents he tried to leave behind after the Republicans passed their now-defunct congressional map in November.",
    "author": "",
    "title": "Morning Digest: Join us for our liveblog tonight as the 2022 primaries get underway in Texas"
  },
  {
    "id": 3027,
    "mediaId": 43,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "Or, y'know, maybe someone can file the same kind of lawsuit that <span class='selected-term'>Madison Cawthorn</span> has been hit with to block this seditious bigot from getting to run for any office in North Carolina, ever again.|\nClick Here for Full FRED Archive\nOne Year Ago, February 21st, 2021: Mike Hubbard (AL)\n Two Years Ago, February 21st, 2020: Michele Presnell (NC)\n Three Years Ago, February 21st, 2019: Omar Navarro (CA)\n Four Years Ago, February 21st, 2018: Rayne Brown (NC)\n Five Years Ago, February 21st, 2017: Isaac Latterell (SD) 2017 Update\n Six Years Ago.",
    "author": "",
    "title": "Fanatical Republican Extremist of the Day: Dan Bishop"
  },
  {
    "id": 1228,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "We also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "Morning Digest: Oregon's new congressional district brings some old characters out of the woodwork"
  },
  {
    "id": 2957,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "The complaint is similar to one targeting North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> and says that Republican Secretary of State Brad Raffensperger must call a hearing to determine Greene's eligibility.",
    "author": "",
    "title": "Morning Digest: Nebraska Republican to resign after being convicted of campaign finance fraud"
  },
  {
    "id": 2344,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Brnovich is widely considered the strongest Republican candidate, but Masters boasts endorsements from Freedom Caucus-aligned Republicans such as <span class='selected-term'>Madison Cawthorn</span> and Tucker Carlson.",
    "author": "",
    "title": "Seats in Pennsylvania and Wisconsin"
  },
  {
    "id": 923,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. <span class='selected-term'>Madison Cawthorn</span> in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nBut if losing Tillis' endorsement and a reprimand from House leadership was meant to temper Cawthorn's actions, it doesn't appear to have worked.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2870,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on <span class='selected-term'>Madison Cawthorn</span> (it's not really about cocaine and orgies); pick apart a huge blunder that led to the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "author": "",
    "title": "Morning Digest: Trump's 'bro' now frontrunner following Ohio Republican's unexpected retirement"
  }
]