[
  {
    "id": 2344,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Brnovich is widely considered the strongest Republican candidate, but Masters boasts endorsements from Freedom Caucus-aligned Republicans such as <span class='selected-term'>Madison Cawthorn</span> and Tucker Carlson.",
    "author": "",
    "title": "Seats in Pennsylvania and Wisconsin"
  },
  {
    "id": 2798,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Mr. Starbuck had also nabbed a high-profile endorsement, from Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina.",
    "author": "Azi Paybarah",
    "title": "Tennessee G.O.P. Removes Trump-Backed House Candidate From Ballot"
  },
  {
    "id": 2801,
    "mediaId": 136,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Meanwhile, voters have filed complaints with state elections officials to disqualify Georgia Representative Marjorie Taylor Greene and North Carolina Representative <span class='selected-term'>Madison Cawthorn</span>both high-profile Trump alliesfrom seeking reelection for statements they made that have been construed as supportive of the January 6 capitol riot.",
    "author": "Jon Jackson",
    "title": "Trump's Power Dealt a Blow After Tennessee GOP Turns on Him"
  },
  {
    "id": 2805,
    "mediaId": 169,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Prominent Trump allies like Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., and Candace Owens revolted over the endorsement, criticizing Trump for not backing MAGA favorite Robby Starbuck, a former music video producer and conservative influencer.",
    "author": "Igor Derysh",
    "title": "Tennessee GOP kicks Trump-backed candidate who sparked MAGA civil war off the ballot"
  },
  {
    "id": 2807,
    "mediaId": 25,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Starbuck, a filmmaker backed by Republican Representatives Marjorie Taylor Greene and <span class='selected-term'>Madison Cawthorn</span>, blasted the process and said the party \"declared war on TN voters yesterday.\"",
    "author": "Aaron Navarro",
    "title": "Tennessee GOP kicks Trump-backed candidate Morgan Ortagus off congressional primary ballot"
  }
]