[
  {
    "id": 2989,
    "mediaId": 209,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is having a moment ... and not exactly a good one.",
    "author": "Brigid Kennedy",
    "title": "Cawthorn primary challengers respond after lawmaker calls Zelensky 'a thug'"
  },
  {
    "id": 2947,
    "mediaId": 165,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) admitted claims he had made about his colleagues inviting him to orgies and doing cocaine in front of him were exaggerated,? House Speaker Kevin McCarthy (R-Calif.) said after admonishing the freshman congressman, according to multiple reports.",
    "author": "William Vaillancourt",
    "title": "Turns Out Noted Liar Madison Cawthorn May Have Also Been Lying About Getting Invited to a Congressional Orgy"
  },
  {
    "id": 2874,
    "mediaId": 238,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "The names have become familiar  Reps. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who called Ukrainian President Volodymyr Zelensky a thug,? Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and Lauren Boebert (R-Colo.).",
    "author": "",
    "title": "Post Politics Now Biden to highlight postal reform as focus continues on accomplishments"
  },
  {
    "id": 1919,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) and a PAC aligned with him have helped Chuck Edwards, a primary challenger of embattled Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.).",
    "author": "",
    "title": "Post Politics Now Biden issues first pardons, commutations of his presidency"
  },
  {
    "id": 2728,
    "mediaId": 237,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE  Rep. <span class='selected-term'>Madison Cawthorn</span> may have violated federal insider trading laws as he hyped up an alleged pump-and-dump cryptocurrency scheme, multiple watchdog groups told the Washington Examiner.",
    "author": "Andrew Kerr",
    "title": "Madison Cawthorn implicated in potential insider trading scheme, experts say"
  }
]