[
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Starting gate\nFirebrands meet friendly fire: Republican lightning rods Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span> and Lauren Boebert have raised millions of dollars flouting political norms.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 1875,
    "mediaId": 21,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Republican Reps. Matt Gaetz of Florida, <span class='selected-term'>Madison Cawthorn</span> of North Carolina, and Paul Gosar of Arizona have all proxy voted over 100 times.",
    "author": "Bryan Metzger",
    "title": "These 15 Republicans have proxy voted at least 100 times even though Kevin McCarthy and GOP leadership think voting remotely is unconstitutional"
  },
  {
    "id": 1882,
    "mediaId": 376,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "ICYMI\nCawthorn's bad news cycle: Some watchdog groups raised concerns that North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> may have violated insider trading laws when he hyped the Let's Go Brandon? cryptocurrency on Instagram the day before it announced a sponsorship deal with the NASCAR driver Brandon Brown and its value spiked.",
    "author": "Stephanie Akin\nKate Ackley\nMary Ellen McIntire",
    "title": "At the Races: Signs of red ahead"
  },
  {
    "id": 1735,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina appeared to confirm the authenticity of a leaked nude video and slammed it as part of a \"drip drip\" campaign to destroy his career.",
    "author": "Sophia Ankel",
    "title": "Madison Cawthorn responds to leaked nude video, says it's part of a 'drip drip' campaign for attempting to destroy his career"
  },
  {
    "id": 2638,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The nonprofit openly describes itself as a political action committee dedicated to \"solely to ensuring that North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s first term in office is his last.\"",
    "author": "Nicholas Morgan",
    "title": "Controversial Republican Lashes Out At Foes For Leaking Naked Video To 'Blackmail' Him"
  },
  {
    "id": 1717,
    "mediaId": 21,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "HENDERSONVILLE, North Carolina  Multiple scandals involving guns, money, cocaine orgies, and a nude video are rocking Rep. <span class='selected-term'>Madison Cawthorn</span> ahead of his May 17 Republican primary.",
    "author": "Camila DeChalus",
    "title": "Rep. Madison Cawthorn's primary challenger Chuck Edwards wants to focus on results for North Carolina  not his opponent's many scandals"
  }
]