[
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on <span class='selected-term'>Madison Cawthorn</span> (it's not really about cocaine and orgies); pick apart a huge blunder that led the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 2827,
    "mediaId": 21,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kayla Epstein",
    "title": "Trump's allies say his Twitter ban has backfired as they keep his voice loud on the social network: 'It's a net benefit'"
  },
  {
    "id": 2794,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span>, who also faces a Republican primary in mid-May.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld"
  },
  {
    "id": 2781,
    "mediaId": 129,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "That section declares that no person shall? hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath? to support the Constitution,? had then engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nSimilar cases have suffered setbacks in North Carolina, where a federal judge blocked a challenge against Representative <span class='selected-term'>Madison Cawthorn</span>, another far-right Republican, and in Arizona, where the Superior Court in Maricopa County ruled on Thursday that it did not have the authority to block the re-elections of two other conservative Republicans, Representatives Paul Gosar and Andy Biggs, and the candidacy for secretary of state of a state representative, Mark Finchem.",
    "author": "",
    "title": "Marjorie Taylor Greene Denies Insurrectionist' Charge in Court"
  },
  {
    "id": 2738,
    "mediaId": 195,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "A state senator challenging Rep. <span class='selected-term'>Madison Cawthorn</span> (R) in the North Carolina released a new ad on Monday knocking the congressman for his use of Instagram.",
    "author": "Mychael Schnell",
    "title": "Cawthorn challenger knocks opponent for Instagram use in new ad"
  },
  {
    "id": 2724,
    "mediaId": 376,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> was cited Tuesday for possession of a dangerous weapon on city property after a gun was discovered in his bag at a security screening checkpoint in Charlotte Douglas International Airport in North Carolina.",
    "author": "Chris Marquette",
    "title": "Rep. Madison Cawthorn cited for bringing gun through Charlotte airport"
  },
  {
    "id": 2691,
    "mediaId": 63,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Thom Tillis called Wednesday for the House Ethics Committee to investigate fellow North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> after watchdog agencies told the Washington Examiner the congressman could be implicated in an insider trading scheme,? reports Anna Kaplan:\nTillis said in a tweet insider trading by a member of Congress is a serious betrayal of their oath,? adding that Cawthorn owes North Carolinians an explanation.?\nThe Examiner reports Cawthorn was pictured at an event on December 29 with James Koutoulas, one of the people behind the Let's Go Brandon? cryptocurrency, which is named after the viral chant insulting President Joe Biden.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: McCarthy's Money, Cawthorn's Crypto, Truth Social's Triumph"
  },
  {
    "id": 2681,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The Fire <span class='selected-term'>Madison Cawthorn</span> group, which is operated by the American Muckrakers PAC, also submitted screenshots of what is believed to be Venmo payments between Smith and the congressman with notes such as \"Getting naked for me in Sweden,\" \"The stuff we did in Amsterdam,\" and \"The quickie at the airport\" and \"breaking and entering.\"",
    "author": "Ewan Palmer",
    "title": "Who is Stephen Smith? Madison Cawthorn Staffer Appears to Grope Him in Clip"
  },
  {
    "id": 2636,
    "mediaId": 32,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The group said the video was provided by a former Cawthorn supporter and big donor who asked to remain anonymous.?\nIt pains us to post it but in the public and voters interest we chose to do so,? the group said, just above an all-caps link urging viewers to WATCH THE VIDEO OF REPUBLICAN CONGRESSMAN <span class='selected-term'>MADISON CAWTHORN</span> DRY HUMPING SOMEONE'S HEAD AND MOANING LOUDLY HERE.?\nRepublicans are hoping to regain House and possibly the Senate in the upcoming midterm elections, and incumbents tend to hold major advantages over their electoral challengers.",
    "author": "Kevin Breuninger",
    "title": "GOP Rep. Cawthorn calls leaked nude video blackmail,' says he was just being crass with a friend'"
  },
  {
    "id": 2638,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The nonprofit openly describes itself as a political action committee dedicated to \"solely to ensuring that North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s first term in office is his last.\"",
    "author": "Nicholas Morgan",
    "title": "Controversial Republican Lashes Out At Foes For Leaking Naked Video To 'Blackmail' Him"
  },
  {
    "id": 3259,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Last November, Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) texted his state's junior senator, Thom Tillis, about a tweet from the senator's wife.",
    "author": "",
    "title": "Inside the Republican campaign to take down Madison Cawthorn"
  },
  {
    "id": 3245,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Representative <span class='selected-term'>Madison Cawthorn</span> on Wednesday morning posted on Twitter that instead of providing financial help to Ukrainians as they fight against the Russian invasion of their country, the money should be spent stateside.",
    "author": "Adam Staten",
    "title": "Madison Cawthorn Slammed for Suggesting Ukraine Aid Be Spent on Veterans"
  }
]