[
  {
    "id": 3114,
    "mediaId": 112,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Related (May 2021): Kevin McCarthy, Elise Stefanik and even <span class='selected-term'>Madison Cawthorn</span> are among Republican members of the House boasting of the Biden pandemic relief package's benefits to constituents\nBut even vulnerable lawmakers like Miller-Meeks  who was elected in 2020 with a winning margin of just six votes  don't appear worried about paying a price.",
    "author": "Associated Press",
    "title": "Toeing of party line outweighs deliverables for constituents for many of today's congressional Republicans"
  },
  {
    "id": 3107,
    "mediaId": 34,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "I'm privileged to participate with the team from Free Speech for People and my fellow North Carolina counsel, in this critically important effort to enforce that constitutional mandate and disqualify <span class='selected-term'>Madison Cawthorn</span> from attempting to be elected to public office in 2022.?\nThe purpose of the constitutional provision relied on by the challengers to Mr. Cawthorn's candidacy is to prevent persons who sought illegally to overthrow a duly elected government from participating in running that government,? said James G. Exum, Jr. The challengers believe the evidence will show Mr. Cawthorn to be one of those persons.?\nCurrently, Cawthorn represents North Carolina's 11th Congressional District, but for the 2022 election, he filed a notice of candidacy for the redrawn 13th Congressional District.",
    "author": "",
    "title": "North Carolina Voters Challenge Rep. Madison Cawthorn's Candidacy for Reelection Under Fourteenth Amendment's Insurrectionist Disqualification Clause"
  },
  {
    "id": 3099,
    "mediaId": 209,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "He specifically criticized Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), placing him in the former category.",
    "author": "Brendan Morrow",
    "title": "Former American Idol star Clay Aiken is running for Congress again"
  },
  {
    "id": 3096,
    "mediaId": 881,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "But after watching noted shitbag <span class='selected-term'>Madison Cawthorn</span> rise to prominence in the House over the past two years and listening to North Carolina's Lieutenant Governor go on a baldly homophobic rant in November, he felt compelled to get back in the mix.",
    "author": "Drew Schwartz",
    "title": "We Asked a Campaign Strategist If Clay Aiken (???) Could Actually Get Elected to Congress"
  },
  {
    "id": 3092,
    "mediaId": 129,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> has breezily dismissed a candidacy challenge filed by voters in his home state, North Carolina, seeking to bar him from re-election to the House of Representatives based on his role in the events of Jan. 6.",
    "author": "",
    "title": "Will Madison Cawthorn Be Brought Down by Insurrection'?"
  },
  {
    "id": 3088,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "Jonathan Weisman",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 3090,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 3083,
    "mediaId": 151,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "The announcement has caused a firestorm, with far-right, high-profile backers ranging from North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to conservative activist Candace Owens taking to social media to voice their support for Robby Starbuck, a rival candidate who's been a mainstay of the pro-Trump movement.",
    "author": "",
    "title": "Trump faces MAGA revolt over endorsement"
  },
  {
    "id": 699,
    "mediaId": 376,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Colorado Rep. Lauren Boebert raised $3.8 million last year, and North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> raised $3.1 million.",
    "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
    "title": "House GOP feels no fundraising backlash for opposing electors"
  },
  {
    "id": 3073,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "A group of registered voters have invoked the 14th Amendment to disqualify Rep. <span class='selected-term'>Madison Cawthorn</span> from running again for a seat in the House in 2022, based on his support for the January 2021 riot at the U.S. Capitol.",
    "author": "",
    "title": "Biden vs. Trump: The Makings of a Shattering Constitutional Crisis"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 3043,
    "mediaId": 65,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "GOP REP. <span class='selected-term'>MADISON CAWTHORN</span> LAUNCHES CAMPAIGN TO IMPOSE TERM LIMITS ON CONGRESS: 'DRAIN THE SWAMP'\nGingrich, the former Republican House speaker, was an architect of the 1994 legislative agenda called the Contract with America that detailed actions Republicans would take if they won the majority in Congress.",
    "author": "Marisa Schultz",
    "title": "Madison Cawthorn unveils new Republican Party platform, the 'New Contract with America'"
  },
  {
    "id": 3038,
    "mediaId": 43,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by <span class='selected-term'>Madison Cawthorn</span>, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 2236,
    "mediaId": 151,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "A group of MAGA firebrands, including freshman Reps. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) and Marjorie Taylor Greene (R-Ga.), are catapulting into a GOP primary here to boost Christian Collins, a far-right activist who has vowed to govern in their image.",
    "author": "",
    "title": "The primary foreshadowing the future of the GOP"
  },
  {
    "id": 3030,
    "mediaId": 151,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Greene and Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) recently traveled to Texas to boost far-right activist Christian Collins, hoping to force him into a runoff against former Navy SEAL Morgan Luttrell, who's backed by the McCarthy-aligned Congressional Leadership Fund.",
    "author": "",
    "title": "6 House races to watch in Texas"
  },
  {
    "id": 3033,
    "mediaId": 43,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Madison Cawthorn, chronic politically transmitted disease, is back in"
  },
  {
    "id": 3025,
    "mediaId": 151,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "A group of far-right members of Congress  including Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Madison Cawthorn</span> (R-N.C.)  have backed activist Christian Collins.",
    "author": "",
    "title": "What to watch for in Texas' primaries"
  },
  {
    "id": 3020,
    "mediaId": 129,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "In the race to replace retiring Representative Kevin Brady in Texas's eighth district, former Navy SEAL Morgan Luttrell, who was backed by House Republican leadership, had a wide lead over Christian Collins, the hard-right candidate backed by Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "",
    "title": "Cisneros forces Cuellar into a runoff, a sign of liberal strength in a key Texas congressional race."
  },
  {
    "id": 3014,
    "mediaId": 237,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "In addition to Cruz, Collins boasted endorsements from North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> and those critical of McCarthy: a PAC aligned with the House Freedom Caucus and Georgia Rep. Marjorie Taylor Greene.",
    "author": "Emily Brooks",
    "title": "Navy SEAL Morgan Luttrell wins in Texas House primary that was GOP proxy war"
  },
  {
    "id": 3009,
    "mediaId": 675,
    "date": "3/6/2022 12:00:00 AM",
    "sentence": "That was the case that was brought recently against U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Judge deals blow to Dem scheme to keep Republicans out of Congress"
  },
  {
    "id": 1263,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "? NC-11: Far-right freshman Rep. <span class='selected-term'>Madison Cawthorn</span> caught a break on filing day when a federal judge rejected a lawsuit that tried to keep the Republican off the ballot in this western North Carolina seat because of his actions both in the lead-up to and during the Jan. 6 attack on the U.S. Capitol.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 3007,
    "mediaId": 43,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "In a recipe for infighting, the far-right House Freedom Caucushome to Reps. Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span>, Lauren Boebert, and Paul Gosaris getting ready to make a play for increased power.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 2996,
    "mediaId": 409,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> (R., N.C.) recently called Ukrainian President Volodymyr Zelensky a thug? and said the Ukrainian government is evil,? according to a newly surfaced video.",
    "author": "Brittany Bernstein",
    "title": "Madison Cawthorn Calls Zelensky a Thug,' Accuses Ukrainian Government of Pushing Woke Ideologies'"
  },
  {
    "id": 2984,
    "mediaId": 163,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "House Republicans, including Representatives Lauren Boebert (R-CO), Kat Cammack (R-FL), <span class='selected-term'>Madison Cawthorn</span> (R-NC), Marjorie Taylor Greene (R-GA), Lisa McClain (R-MI) and Jody Hice (R-GA), who oppose mask mandates march as a group to the Senate chamber to highlight different coronavirus disease (COVID-19) mask rules between the House and Senate sides of the U.S. Capitol in Washington, U.S., July 29, 2021.",
    "author": "David Morgan",
    "title": "Ukraine war becomes a cudgel in Republican Party's internal conflict"
  },
  {
    "id": 2980,
    "mediaId": 21,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina faced criticism from members of the GOP after he called Zelenskyy a \"thug\" at an event with constituents.",
    "author": "Bryan Metzger",
    "title": "Here are the 8 House Republicans who voted against suspending normal trade relations with Russia and Belarus"
  },
  {
    "id": 2972,
    "mediaId": 25,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n House Democrats raised $19.3 million in February, a committee record\n Trump's EPA chief Scott Pruitt weighing Senate run in Oklahoma\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Special election set for June to fill seat of late Congressman Don Young"
  },
  {
    "id": 304,
    "mediaId": 195,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "A month ago, McCarthy publicly criticized members Rep. Marjorie Taylor Greene (R-Ga.) and Rep. Paul Gosar (R-Ariz.) for speaking at a white nationalist conference, which he called unacceptable.? Last week, he said that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) was wrong? for calling Ukrainian President Volodymyr Zelensky a \"thug.\"",
    "author": "Emily Brooks -",
    "title": "A more unified House GOP aims to get everyone on same page"
  },
  {
    "id": 289,
    "mediaId": 195,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In another instance of that balancing act, Stefanik demurred on Thursday when asked if remarks from one far-right member, Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) describing Ukrainian President Volodymyr Zelensky as a thug? could prove damaging to House Republicans' midterm efforts.",
    "author": "Max Greenwood",
    "title": "House GOP keeps Trump at arm's length as it hones midterm strategy"
  },
  {
    "id": 2962,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Dems again try failed strategy to try to derail GOP representative's re-election bid"
  },
  {
    "id": 2966,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The challenge was filed by the same coalition of constitutional scholars and liberal activists who unsuccessfully tried to block Rep. <span class='selected-term'>Madison Cawthorn</span> from the GOP primary ballot in North Carolina.",
    "author": "Marshall Cohen",
    "title": "Groups try to disqualify Rep. Marjorie Taylor Greene's candidacy over January 6"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "What's more, House GOP leaders made clear that far-right members like Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), who recently called Ukrainian President Volodymyr Zelensky a thug,? did not speak for the conference.",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 2960,
    "mediaId": 43,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "The non-partisan group previously filed a separate challenge against the Constitutional eligibility of North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to run in 2022 on the same basis.",
    "author": "",
    "title": "Good News! On Biden's Economy and Trump's Insurrectionists: 'BradCast' 3/24/2022"
  },
  {
    "id": 2957,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "The complaint is similar to one targeting North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> and says that Republican Secretary of State Brad Raffensperger must call a hearing to determine Greene's eligibility.",
    "author": "",
    "title": "Morning Digest: Nebraska Republican to resign after being convicted of campaign finance fraud"
  },
  {
    "id": 2946,
    "mediaId": 129,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "That is the object lesson of Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina, the House's youngest member, whose bid for a second term is in jeopardy after a series of incendiary statements and personal foibles have soured many former supporters.",
    "author": "",
    "title": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too."
  },
  {
    "id": 2947,
    "mediaId": 165,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) admitted claims he had made about his colleagues inviting him to orgies and doing cocaine in front of him were exaggerated,? House Speaker Kevin McCarthy (R-Calif.) said after admonishing the freshman congressman, according to multiple reports.",
    "author": "William Vaillancourt",
    "title": "Turns Out Noted Liar Madison Cawthorn May Have Also Been Lying About Getting Invited to a Congressional Orgy"
  },
  {
    "id": 2948,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy has told GOP colleague North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> to straighten his life out? and hasn't ruled out further disciplinary after the freshman congressman backtracked on claims he made in an interview that politicians invited him to an orgy and did cocaine in front of him.",
    "author": "Juliegrace Brufke",
    "title": "McCarthy says Cawthorn admitted he exaggerated orgy and cocaine story"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Other attendees of the fundraiser on Wednesday include Congressmen <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Jim Jordan of Ohio.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 2923,
    "mediaId": 233,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Cawthorn's revoked license: GOP Congressman <span class='selected-term'>Madison Cawthorn</span> charged with driving on a revoked license for 2nd time; court dates set\nIn a tweet just hours before Tillis' announcement, Cawthorn said \"the radical left, the establishment, and the media want to take me down,\" but he will move forward.",
    "author": "David Jackson",
    "title": "More trouble for GOP Rep. Madison Cawthorn: North Carolina Republican senator endorses primary opponent"
  },
  {
    "id": 2926,
    "mediaId": 136,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span>, a North Carolina Republican, is facing backlash from his state's two GOP senators after multiple recent controversieswith one senator deciding to back his primary challenger.",
    "author": "Jason Lemon",
    "title": "GOP Senators From Madison Cawthorn's State Won't Back His Re-Election Bid"
  },
  {
    "id": 2927,
    "mediaId": 169,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "On Sunday, one of their bigger lunkheads in Congress, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina, told a podcast host that his GOP colleagues were big fans of orgies and blow.",
    "author": "Amanda Marcotte",
    "title": "Madison Cawthorn's cocaine-and-orgies brouhaha blows up the GOP's QAnon plan"
  },
  {
    "id": 2930,
    "mediaId": 593,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., has seen his support among members of his party evaporate after salacious claims he made about being invited to sex parties and witnessing drug use on Capitol Hill.",
    "author": "Nicholas Morgan",
    "title": "Republicans Turn On 'Embarrassment' Madison Cawthorn After Comments About Sex Parties, Cocaine"
  },
  {
    "id": 2933,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>'s (R-N.C.) unfounded allegations of being invited to orgies in Washington and seeing people do cocaine is prompting condemnation from his state's GOP senators, House Minority Leader Kevin McCarthy (Calif.) and other Republicans.",
    "author": "",
    "title": "Madison Cawthorn's antics miff GOP"
  },
  {
    "id": 2942,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\n<span class='selected-term'>Madison Cawthorn</span> turns his slander onto the Republican Party\nRepublicans freaking out about Madison Cawthorn's allegations of 'cocaine' and 'orgies'\nMadison Cawthorn changes cocaine and orgy allegations in heated meeting with GOP leader McCarthy\nThis is a short blurb about Daily Kos.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "Madison Cawthorn vows to keep talking about Republican cocaine use and orgies"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Washington, DC (CNN)Rep. <span class='selected-term'>Madison Cawthorn</span> -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 249,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\nRepublicans freaking out about <span class='selected-term'>Madison Cawthorn</span>'s allegations of 'cocaine' and 'orgies'\nGreene and Gosar won't face punishment for speaking at white nationalist event\nThis is a short blurb about Daily Kos.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 2898,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "North Carolina Representative <span class='selected-term'>Madison Cawthorn</span> is set to give remarks at an upcoming Trump rally despite anger from some in the party over his recent comments about orgies and drugs.",
    "author": "Adam Staten",
    "title": "Cawthorn to Speak at Trump Rally Despite GOP Fury Over Orgy, Cocaine Claim"
  },
  {
    "id": 2900,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is slated to speak at former President Trump's upcoming rally in North Carolina, giving the embattled congressman a key audience with Trump's ultra-conservative base as he faces backlash from GOP lawmakers and much of his state's congressional delegation.",
    "author": "Max Greenwood",
    "title": "Cawthorn to speak at North Carolina Trump rally"
  },
  {
    "id": 2905,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> could be in for a tough fight to keep his seat as primary opponents circle and prominent Republicans take aim at the youngest member of the U.S. House of Representatives.",
    "author": "Darragh Roche",
    "title": "Will 'Orgy' Claims Cost Madison Cawthorn His GOP Career?"
  },
  {
    "id": 2906,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "McConnell has largely shrugged off the criticism, while also not shying away from rebuking controversial staunchly pro-Trump Republicans like Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "Jason Lemon",
    "title": "McConnell Says He Only Cares About Winning, Fine With Pro-Trump Republicans"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Unfortunately, <span class='selected-term'>Madison Cawthorn</span> has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nBut if losing Tillis' endorsement and a reprimand from House leadership was meant to temper Cawthorn's actions, it doesn't appear to have worked.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2883,
    "mediaId": 195,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> (R) on the House floor on Monday said Democrats had declared a war on biology? in supporting the rights of transgender Americans, adding that the party's left-wing movement is forcing children to endure radical expressions of sexuality.?\nFlorida Gov.",
    "author": "Brooke Migdon | April 4",
    "title": "Rep. Boebert says children should wait until 21 to make life-altering' decisions about gender and sexuality"
  },
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on <span class='selected-term'>Madison Cawthorn</span> (it's not really about cocaine and orgies); pick apart a huge blunder that led the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 2835,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Meanwhile, Trump is backing Rep. <span class='selected-term'>Madison Cawthorn</span> for re-election  even as he has been a continual source of embarrassment for the GOP and state leaders in North Carolina are now trying to get rid of him.",
    "author": "",
    "title": "Good News Roundup April 13 Edition"
  },
  {
    "id": 18,
    "mediaId": 151,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Reps. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) and Marjorie Taylor Greene (R-Ga.) endorsed Chris Collins, who ultimately lost the race to Luttrell.",
    "author": "",
    "title": "Seeking: GOP dealmakers who won't 'burn the House down'. Apply to: Kevin McCarthy."
  },
  {
    "id": 2828,
    "mediaId": 881,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Rebels who got a clause  Rep. <span class='selected-term'>Madison Cawthorn</span> does not like a good party.",
    "author": "",
    "title": "The Jan. 6 Committee Wants to Speak to Trump's Social Media Guy About QAnon"
  },
  {
    "id": 2813,
    "mediaId": 136,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Free Speech for People filed a similar lawsuit against Republican Representative <span class='selected-term'>Madison Cawthorn</span> in North Carolina, but the effort was blocked by U.S. District Richard Myers.",
    "author": "Alexandra Hutzler",
    "title": "GOP Likely Keeps House Seat if Marjorie Taylor Greene Is Booted Off Ballot"
  },
  {
    "id": 2798,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Mr. Starbuck had also nabbed a high-profile endorsement, from Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina.",
    "author": "Azi Paybarah",
    "title": "Tennessee G.O.P. Removes Trump-Backed House Candidate From Ballot"
  },
  {
    "id": 2802,
    "mediaId": 151,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Beach-Ferrara is seeking to oust Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), while Flowers is vying to replace Rep. Marjorie Taylor Greene (R-Ga.).",
    "author": "",
    "title": "House Dems try to ward off GOP attacks on crime"
  },
  {
    "id": 2807,
    "mediaId": 25,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Starbuck, a filmmaker backed by Republican Representatives Marjorie Taylor Greene and <span class='selected-term'>Madison Cawthorn</span>, blasted the process and said the party \"declared war on TN voters yesterday.\"",
    "author": "Aaron Navarro",
    "title": "Tennessee GOP kicks Trump-backed candidate Morgan Ortagus off congressional primary ballot"
  },
  {
    "id": 2808,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Voters in North Carolina are seeking to bar Representative <span class='selected-term'>Madison Cawthorn</span> from running for re-election to his House seat, and those in Georgia are trying to do the same to Representative Marjorie Taylor Greene.",
    "author": "",
    "title": "Only the Feds Could Disqualify Madison Cawthorn and Marjorie Taylor Greene"
  },
  {
    "id": 1997,
    "mediaId": 136,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Republican Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina survived a similar effort to invalidate his reelection bid last month.",
    "author": "Aila Slisco",
    "title": "Trump Blames Georgia Republicans for Taylor Greene 'Going Through Hell'"
  },
  {
    "id": 2793,
    "mediaId": 136,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Another Trump loyalist, North Carolina Representative <span class='selected-term'>Madison Cawthorn</span>, is similarly facing a legal challenge from voters to his reelection.",
    "author": "Jon Jackson",
    "title": "Donald Trump Could Lose One of His Most Loyal Supporters in Congress"
  },
  {
    "id": 1992,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Free Speech for People levied a similar case against Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), but he successfully sued in federal court to block the proceedings.",
    "author": "",
    "title": "Rep. Greene declines to say if interfering with electoral count makes one an enemy of the Constitution'"
  },
  {
    "id": 2757,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Two pictures of Republican Rep. <span class='selected-term'>Madison Cawthorn</span> (N.C.) shared with Politico show the embattled congressman at what appears to be a party in women's lingerie.",
    "author": "Lexi Lonas",
    "title": "Photos show Cawthorn wearing lingerie at apparent party: Politico"
  },
  {
    "id": 2763,
    "mediaId": 237,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "North Carolina GOP Rep. <span class='selected-term'>Madison Cawthorn</span> blasted the Left for dredging up photographs of him wearing women's lingerie, saying the newly resurfaced photos amount to a desperate attempt to hurt him.",
    "author": "Misty Severi",
    "title": "Cawthorn slams Left for unearthing 'goofy' photos of him in lingerie"
  },
  {
    "id": 2771,
    "mediaId": 881,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "So <span class='selected-term'>Madison Cawthorn</span>, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] Mark Finchem are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "Insurrectionist' Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 2774,
    "mediaId": 593,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Facing Ballot Challenge, Republican Greene Says She Wanted A 'Peaceful March' On U.S. Capitol"
  },
  {
    "id": 2781,
    "mediaId": 129,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "That section declares that no person shall? hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath? to support the Constitution,? had then engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nSimilar cases have suffered setbacks in North Carolina, where a federal judge blocked a challenge against Representative <span class='selected-term'>Madison Cawthorn</span>, another far-right Republican, and in Arizona, where the Superior Court in Maricopa County ruled on Thursday that it did not have the authority to block the re-elections of two other conservative Republicans, Representatives Paul Gosar and Andy Biggs, and the candidacy for secretary of state of a state representative, Mark Finchem.",
    "author": "",
    "title": "Marjorie Taylor Greene Denies Insurrectionist' Charge in Court"
  },
  {
    "id": 2788,
    "mediaId": 178,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep three Republicans on the ballot, and in North Carolina against Republican U.S. Rep. <span class='selected-term'>Madison Cawthorn</span>, who spoke at the rally that preceded the riot.",
    "author": "KATE BRUMBACK",
    "title": "Marjorie Taylor Greene hostile in testimony over eligibility"
  },
  {
    "id": 2752,
    "mediaId": 136,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "Following a rocky few weeks after accusing fellow GOP colleagues of inviting him to cocaine-fueled orgies, Republican North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s favorability may be increasing from his recent endorsement by the National Rifle Association (NRA).",
    "author": "Patricia McKnight",
    "title": "National Rifle Association Throws Weight Behind Cawthorn Reelection"
  },
  {
    "id": 2718,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited Tuesday for having a loaded 9mm handgun at a TSA checkpoint at Charlotte Douglas International Airport, the second time he has been stopped with a firearm at an airport since taking office last year.",
    "author": "",
    "title": "Rep. Madison Cawthorn cited for having a gun at Charlotte airport"
  },
  {
    "id": 2719,
    "mediaId": 63,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "This is the second time a gun has been found on Cawthorn at an airport: The Transportation Security Administration discovered a 9mm handgun in his carry-on bag at Asheville Regional Airport in February 2021.\nVirtually every Monday or Tuesday we start the week out with another embarrassing headline from <span class='selected-term'>Madison Cawthorn</span> .",
    "author": "Nicholas Reimann",
    "title": "Madison Cawthorn Cited For Carrying Gun At Charlotte Airport"
  },
  {
    "id": 2721,
    "mediaId": 65,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., was cited for being in possession of a firearm at Charlotte Douglas International Airport on Tuesday morning, according to multiple local media reports.",
    "author": "Paul Best",
    "title": "North Carolina Rep. Madison Cawthorn cited for having gun at Charlotte airport: reports"
  },
  {
    "id": 2722,
    "mediaId": 21,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Officers cited Rep. <span class='selected-term'>Madison Cawthorn</span> on Tuesday for carrying a loaded gun inside of Charlotte Douglas International Airport, the latest in a string of controversies Cawthorn has found himself in.",
    "author": "Brent D. Griffiths",
    "title": "Madison Cawthorn is cited for bringing a loaded gun into the Charlotte Airport"
  },
  {
    "id": 2723,
    "mediaId": 409,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> (R., N.C.) was stopped by police on Tuesday after trying to bring a loaded handgun on board a flight.",
    "author": "Arjun Singh",
    "title": "Madison Cawthorn Stopped by Police from Taking Gun on Flight"
  },
  {
    "id": 2726,
    "mediaId": 593,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> has been cited by police for possessing a gun at an airport, according to local media, adding to a string of controversies for the first-term lawmaker ahead of a contested primary election.",
    "author": "Moira Warburton and David Shepardson",
    "title": "U.S. Rep. Cawthorn Cited For Gun At Airport -local Media"
  },
  {
    "id": 2735,
    "mediaId": 43,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Republican House members like Marjorie Taylor Greene, <span class='selected-term'>Madison Cawthorn</span> and Lauren Boebert have learned that freshmen members of Congress can command outsized attention  and that outrageous statements are a ticket, if not to policy success, then at least to the kind of attention and fundraising prowess that keeps a career alive.\"",
    "author": "Bill Berkowitz",
    "title": "She's Baaaack: Is Sarah Palin A relic from the past or viable congressional candidate?"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "\"There will be more Marjorie Taylor Greenes and <span class='selected-term'>Madison Cawthorn</span>s nominated for federal office and for state office and for local officefar more than there are Fred Uptons.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 2703,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) Wednesday called for an investigation by the House Ethics Committee into Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) over allegations that Cawthorn violated federal insider trading laws.",
    "author": "Tal Axelrod",
    "title": "Tillis calls for investigation of Cawthorn over insider trading allegations"
  },
  {
    "id": 2705,
    "mediaId": 32,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Erin Siegal | Reuters\nA Republican senator on Wednesday called on Congress to investigate his GOP colleague Rep. <span class='selected-term'>Madison Cawthorn</span>, of North Carolina, who has come under fire as ethics watchdogs raise suspicions of possible insider trading over his relationship to an anti-Biden cryptocurrency.",
    "author": "Kevin Breuninger",
    "title": "Fellow North Carolina Republican calls for insider trading probe of Rep. Madison Cawthorn's crypto holdings"
  },
  {
    "id": 2708,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Speculation that the Republican Party may be trying to purge Representative <span class='selected-term'>Madison Cawthorn</span> from Congress has intensified after the North Carolina congressman was embroiled in yet another potential scandal.",
    "author": "Ewan Palmer",
    "title": "Is Madison Cawthorn Being Purged by Republicans?"
  },
  {
    "id": 2714,
    "mediaId": 881,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Madison Cawthorn</span> simply cannot keep it together right now.",
    "author": "Paul Blest",
    "title": "Madison Cawthorn Is Having a Hell of a Week"
  },
  {
    "id": 1875,
    "mediaId": 21,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Republican Reps. Matt Gaetz of Florida, <span class='selected-term'>Madison Cawthorn</span> of North Carolina, and Paul Gosar of Arizona have all proxy voted over 100 times.",
    "author": "Bryan Metzger",
    "title": "These 15 Republicans have proxy voted at least 100 times even though Kevin McCarthy and GOP leadership think voting remotely is unconstitutional"
  },
  {
    "id": 2690,
    "mediaId": 63,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Topline\nRep. <span class='selected-term'>Madison Cawthorn</span>'s (R-N.C.) tumultuous stretch of personal scandal and legal trouble might be starting to hurt him politically, according to a poll from a national Republican group, which found the controversies have seriously hurt the freshman congressman's image among his constituents.",
    "author": "Nicholas Reimann",
    "title": "Cawthorn's Reelection Support Plummets After Wave Of Controversy, GOP Poll Finds"
  },
  {
    "id": 2691,
    "mediaId": 63,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Thom Tillis called Wednesday for the House Ethics Committee to investigate fellow North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> after watchdog agencies told the Washington Examiner the congressman could be implicated in an insider trading scheme,? reports Anna Kaplan:\nTillis said in a tweet insider trading by a member of Congress is a serious betrayal of their oath,? adding that Cawthorn owes North Carolinians an explanation.?\nThe Examiner reports Cawthorn was pictured at an event on December 29 with James Koutoulas, one of the people behind the Let's Go Brandon? cryptocurrency, which is named after the viral chant insulting President Joe Biden.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: McCarthy's Money, Cawthorn's Crypto, Truth Social's Triumph"
  },
  {
    "id": 2697,
    "mediaId": 21,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Republican Senator Thom Tillis has called for Congress to conduct a bipartisan investigation of his House colleague, Rep. <span class='selected-term'>Madison Cawthorn</span>, over the latter's undeclared cryptocurrency purchases.",
    "author": "Cheryl Teh",
    "title": "North Carolina GOP senator calls for Madison Cawthorn's cryptocurrency purchases to be investigated by House Ethics Committee"
  },
  {
    "id": 2701,
    "mediaId": 43,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Unless you've been hiding under a rock or getting all your information from Fox News (granted, those two are functionally equivalent), you know that North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> was recently cited for bringing a loaded handgun to the Charlotte Douglas International Airport.",
    "author": "",
    "title": "Madison Cawthorn's latest misadventure points up the hypocrisy (and inadequacy) of our gun laws"
  },
  {
    "id": 2673,
    "mediaId": 238,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Look at Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.), emblematic of the new generation of Republican stars, along with figures such as Marjorie Taylor Greene (Ga.) and Matt Gaetz (Fla.).",
    "author": "",
    "title": "Opinion The House GOP is a dumpster fire. What if it takes power?"
  },
  {
    "id": 2674,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Madison Cawthorn</span> ( R-N.C.) has been a lightning rod for controversy.",
    "author": "Sarakshi Rai",
    "title": "Timeline of Madison Cawthorn controversies"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 28, 2022\nCawthorn later tweeted a screenshot of an article from The Epoch Times titled \"Rep. Cawthorn Says 'Establishment' Targeting Him With 'Coordinated Drip Campaign.'\"",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Besieged by multiplying scandals and salacious accusations, Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  },
  {
    "id": 2663,
    "mediaId": 136,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Madison Cawthorn</span> appears to be under attack from the right as a series of damaging news stories have been published about the young Republican and a senior member of his own party has taken aim at him.",
    "author": "Darragh Roche",
    "title": "Madison Cawthorn Is Under Attack from the Right"
  },
  {
    "id": 2669,
    "mediaId": 136,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Madison Cawthorn</span> (@CawthornforNC) April 29, 2022\nCawthorn, 26, went on to maintain that he \"looked damn good on that cruise ship,\" apparently referring to now-viral photos of him wearing women's lingerie on a cruise ship that were leaked to the press last week.",
    "author": "Aila Slisco",
    "title": "'Pathetic': Madison Cawthorn Responds to Ethics Complaint Over Conduct"
  },
  {
    "id": 2654,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "The information emanates from a filing submitted to the quasi-official \"Office of Congressional Ethics\" (OCE) by the political group Fire <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "",
    "title": "Lawmakers behaving badly"
  },
  {
    "id": 2658,
    "mediaId": 238,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) is far from the only House lawmaker to invite controversy.",
    "author": "",
    "title": "The many controversies surrounding Madison Cawthorn"
  },
  {
    "id": 1735,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina appeared to confirm the authenticity of a leaked nude video and slammed it as part of a \"drip drip\" campaign to destroy his career.",
    "author": "Sophia Ankel",
    "title": "Madison Cawthorn responds to leaked nude video, says it's part of a 'drip drip' campaign for attempting to destroy his career"
  },
  {
    "id": 2630,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "A grainy 28-second video showing a naked young man gyrating against someone in bed amid squeals and laughter was the latest in a string of episodes that has turned Republicans against one of their own: the brash U.S. Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "David Morgan",
    "title": "Nude Video Latest Scandal Turning Republicans Against U.S. Rep. Cawthorn"
  },
  {
    "id": 2632,
    "mediaId": 65,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Rep, <span class='selected-term'>Madison Cawthorn</span>, R-N.C., responded to the publication of a nude video of him, claiming that it is part of a \"blackmail\" campaign meant to hurt his chances of winning re-election this year.",
    "author": "Ronn Blitzer",
    "title": "Madison Cawthorn claims 'blackmail' after opposition group publishes nude video"
  },
  {
    "id": 2638,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The nonprofit openly describes itself as a political action committee dedicated to \"solely to ensuring that North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>'s first term in office is his last.\"",
    "author": "Nicholas Morgan",
    "title": "Controversial Republican Lashes Out At Foes For Leaking Naked Video To 'Blackmail' Him"
  },
  {
    "id": 2618,
    "mediaId": 237,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "An Arizona judge threw out a measure to ban Republican Reps. Andy Biggs and Paul Gosar, as well as state Rep. Mark Finchem (who is running for Arizona secretary of state) last month, and efforts against Reps. <span class='selected-term'>Madison Cawthorn</span> (R-NC) and Jim Banks (R-IN) failed as well.",
    "author": "Virginia Aabram",
    "title": "Bid to erase Marjorie Taylor Greene from ballot fails"
  },
  {
    "id": 2628,
    "mediaId": 163,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Saul Loeb/Pool via REUTERS/File Photo\nWASHINGTON, May 5 (Reuters) - A grainy 28-second video showing a naked young man gyrating against someone in bed amid squeals and laughter was the latest in a string of episodes that has turned Republicans against one of their own: the brash U.S. Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina.",
    "author": "David Morgan",
    "title": "Nude video latest scandal turning Republicans against U.S. Rep. Cawthorn"
  },
  {
    "id": 2616,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\n<span class='selected-term'>Madison Cawthorn</span> May Have a New Ethics Violation to Handle\nDaily Beast, Roger Sollenberger, 5/5/2022\nRep. Madison Cawthorn (R-NC) has been embroiled in scandal after scandal.",
    "author": "",
    "title": "DKos Asheville Open Thread: Cawthorn Roundup, yee haw!"
  },
  {
    "id": 3266,
    "mediaId": 367,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Details about the incident are emerging soon after U.S. Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) was cited for having a gun in a carry-on bag.",
    "author": "Patrick Marley",
    "title": "Congressional candidate Derrick Van Orden fined for having a loaded gun in an airport. He calls the incident a mistake."
  },
  {
    "id": 3161,
    "mediaId": 195,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": " The Washington Post: Inside the Republican campaign to take down Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.).",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Biden talks inflation; House helps Ukraine"
  },
  {
    "id": 3256,
    "mediaId": 129,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Hines, a 26-year-old former college football recruit often compared to Representative <span class='selected-term'>Madison Cawthorn</span> of North Carolina before Cawthorn's recent string of troubles, is running for a U.S. House seat representing the exurban area just south of Raleigh.",
    "author": "",
    "title": "Can Donald Trump Get This 26-Year-Old Elected to Congress?"
  },
  {
    "id": 3245,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Representative <span class='selected-term'>Madison Cawthorn</span> on Wednesday morning posted on Twitter that instead of providing financial help to Ukrainians as they fight against the Russian invasion of their country, the money should be spent stateside.",
    "author": "Adam Staten",
    "title": "Madison Cawthorn Slammed for Suggesting Ukraine Aid Be Spent on Veterans"
  }
]