[
  {
    "id": 3088,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "Jonathan Weisman",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 3089,
    "mediaId": 178,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the reelection bid of Rep. <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "Jonathan Weisman New York Times",
    "title": "Cawthorn challenge raises the question: Who is an 'insurrectionist'?"
  },
  {
    "id": 3090,
    "mediaId": 129,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "The novel challenge to the re-election bid of Representative <span class='selected-term'>Madison Cawthorn</span>, one of the House's brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "author": "",
    "title": "Cawthorn Challenge Raises the Question: Who Is an Insurrectionist'?"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "View host/CNN commentator Ana Navarro attended, as well as North Carolina Congressman <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook"
  },
  {
    "id": 2236,
    "mediaId": 151,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "A group of MAGA firebrands, including freshman Reps. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) and Marjorie Taylor Greene (R-Ga.), are catapulting into a GOP primary here to boost Christian Collins, a far-right activist who has vowed to govern in their image.",
    "author": "",
    "title": "The primary foreshadowing the future of the GOP"
  },
  {
    "id": 3033,
    "mediaId": 43,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Madison Cawthorn, chronic politically transmitted disease, is back in"
  },
  {
    "id": 2380,
    "mediaId": 124,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> is back to running in the 11th District (his home district) after previously planning to run in a different district.",
    "author": "",
    "title": "Biden's State of the Union checklist expands from economy to Covid and war in Europe"
  },
  {
    "id": 3010,
    "mediaId": 237,
    "date": "3/6/2022 12:00:00 AM",
    "sentence": "He sports endorsements from Sen. Rand Paul of Kentucky and a collection of conservative populists who are popular in the wing of the Republican Party most supportive of former President Donald Trump, including Reps. <span class='selected-term'>Madison Cawthorn</span> of North Carolina, Matt Gaetz of Florida, and Marjorie Taylor Greene of Georgia.",
    "author": "David M. Drucker",
    "title": "Anthony Sabatini has a low opinion of Republicans he hopes to serve with in DC"
  },
  {
    "id": 2949,
    "mediaId": 124,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Congressional Republicans are fuming after Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., claimed some lawmakers have invited him to sex parties and have used cocaine in front of him without offering any specifics.",
    "author": "",
    "title": "The most popular  and unpopular  2022 candidate qualities"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Controversial Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., drew the ire of his fellow Republicans and House Minority Leader Kevin McCarthy when he said in a podcast interview that lawmakers he looked up to? had invited him to orgies and done cocaine in front of him.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 2927,
    "mediaId": 169,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "On Sunday, one of their bigger lunkheads in Congress, Rep. <span class='selected-term'>Madison Cawthorn</span> of North Carolina, told a podcast host that his GOP colleagues were big fans of orgies and blow.",
    "author": "Amanda Marcotte",
    "title": "Madison Cawthorn's cocaine-and-orgies brouhaha blows up the GOP's QAnon plan"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Washington, DC (CNN)Rep. <span class='selected-term'>Madison Cawthorn</span> -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 2897,
    "mediaId": 65,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Freshman Rep. <span class='selected-term'>Madison Cawthorn</span> Friday addressed the firestorm he created in Washington, D.C., by depicting his short time in Congress as one witnessing cocaine drug use, espionage and sexual perversion.",
    "author": "Marisa Schultz",
    "title": "Madison Cawthorn addresses 'orgy,' cocaine controversy"
  },
  {
    "id": 2901,
    "mediaId": 237,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Embattled North Carolina Rep. <span class='selected-term'>Madison Cawthorn</span> refused to retract his accusations that orgies and cocaine use take place among politicians in Washington despite coming under fire from his Republican colleagues.",
    "author": "Juliegrace Brufke",
    "title": "Cawthorn defends 'calling out corruption' with orgy and cocaine claims"
  },
  {
    "id": 2893,
    "mediaId": 118,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Inae Oh",
    "title": "Madison Cawthorn's Response to Orgy Scandal: Attack the Liberals"
  },
  {
    "id": 2878,
    "mediaId": 21,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Fox News host and former GOP politician Trey Gowdy has asked Rep. <span class='selected-term'>Madison Cawthorn</span> to reveal who in DC's elite did drugs in front of him and invited him to sex parties  or admit that he was lying.",
    "author": "Cheryl Teh",
    "title": "Fox News host says Madison Cawthorn needs to name those involved in orgies and drugs, or admit to making up stories about DC's elite"
  },
  {
    "id": 2850,
    "mediaId": 136,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Attendees of former President Donald Trump's North Carolina rally on Saturday said they believed GOP Representative <span class='selected-term'>Madison Cawthorn</span>'s claim that high-profile individuals in Washington, DC, invited him to an \"orgy\" and did cocaine in front of him.",
    "author": "Jason Lemon",
    "title": "Trump Rally-Goers Believe Cawthorn's Orgy Claim: 'Why Make That Up?'"
  },
  {
    "id": 2816,
    "mediaId": 195,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "At one point during the call, Lisa Wiggins, who was a caseworker for the 26-year-old first-term representative in his district office for over a year, described that office as having more liquor bottles than they do water bottles.?\nCawthorn's office insinuated that the allegations, made in a secretly recorded and released conversation with the head of an anti-Cawthorn PAC, were politically motivated, and hinted at potential counteraction by saying that they constitute defamation of character.?\nWiggins unloaded about Cawthorn in a call with David Wheeler, the president of the anti-Cawthorn American Muckrakers PAC more commonly known as Fire <span class='selected-term'>Madison Cawthorn</span>, accusing him of denying me my FMLA? leave when her uncle died and her husband suffered a heart attack the same week.",
    "author": "Emily Brooks",
    "title": "Secretly recorded call adds to controversy swirling around Cawthorn"
  },
  {
    "id": 2818,
    "mediaId": 124,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "The group filed a similar challenge on behalf of voters against Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C, which a federal judge in that state blocked last month.",
    "author": "",
    "title": "Challenge to Rep. Marjorie Taylor Greene's re-election bid can proceed, judge rules"
  },
  {
    "id": 2769,
    "mediaId": 163,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "A similar challenge backed by the same group against Republican U.S. Representative <span class='selected-term'>Madison Cawthorn</span> failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "author": "Jan Wolfe",
    "title": "Firebrand U.S. Republican Marjorie Taylor Greene faces 'insurrectionist' challenge"
  },
  {
    "id": 2781,
    "mediaId": 129,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "That section declares that no person shall? hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath? to support the Constitution,? had then engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nSimilar cases have suffered setbacks in North Carolina, where a federal judge blocked a challenge against Representative <span class='selected-term'>Madison Cawthorn</span>, another far-right Republican, and in Arizona, where the Superior Court in Maricopa County ruled on Thursday that it did not have the authority to block the re-elections of two other conservative Republicans, Representatives Paul Gosar and Andy Biggs, and the candidacy for secretary of state of a state representative, Mark Finchem.",
    "author": "",
    "title": "Marjorie Taylor Greene Denies Insurrectionist' Charge in Court"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Besieged by multiplying scandals and salacious accusations, Representative <span class='selected-term'>Madison Cawthorn</span>, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  },
  {
    "id": 2653,
    "mediaId": 33,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Washington (CNN)A lawyer for embattled GOP Rep. <span class='selected-term'>Madison Cawthorn</span> argued Tuesday in federal court that states can't enforce basic age or residency requirements for congressional candidates, let alone enforce a constitutional ban against insurrectionists from holding office.",
    "author": "Marshall Cohen",
    "title": "Madison Cawthorn's lawyer argues that states can't enforce age and residency rules for congressional candidates"
  },
  {
    "id": 2617,
    "mediaId": 675,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Judge recommends 'insurrection' claim against Marjorie Taylor Greene be dropped"
  }
]