[
  {
    "id": 2999,
    "mediaId": 43,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "North Carolina, South Korea, and why you should Run For Something, with Amanda Litman\nThe Downballot\nFollowShare\n0:0042:43\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nWe also spend time exploring a trio of different stories out of North Carolinaone concerning <span class='selected-term'>Madison Cawthorn</span>, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/10"
  },
  {
    "id": 2988,
    "mediaId": 675,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Leftists use failed strategy to attack Wisconsin GOP"
  },
  {
    "id": 2970,
    "mediaId": 25,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n Special election set for June to fill seat of late Congressman Don Young\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says <span class='selected-term'>Madison Cawthorn</span> is \"wrong\" about Zelenskyy\n More\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Supreme Court tosses Wisconsin state legislative maps but keeps congressional maps in place"
  },
  {
    "id": 2344,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Brnovich is widely considered the strongest Republican candidate, but Masters boasts endorsements from Freedom Caucus-aligned Republicans such as <span class='selected-term'>Madison Cawthorn</span> and Tucker Carlson.",
    "author": "",
    "title": "Seats in Pennsylvania and Wisconsin"
  },
  {
    "id": 2949,
    "mediaId": 124,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Congressional Republicans are fuming after Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., claimed some lawmakers have invited him to sex parties and have used cocaine in front of him without offering any specifics.",
    "author": "",
    "title": "The most popular  and unpopular  2022 candidate qualities"
  },
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on <span class='selected-term'>Madison Cawthorn</span> (it's not really about cocaine and orgies); pick apart a huge blunder that led the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 865,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "At the moment, Greene, Lauren Boebert, and <span class='selected-term'>Madison Cawthorn</span> have the power mostly to marshal attention.",
    "author": "David A. Graham",
    "title": "The Wackadoodle Wave"
  },
  {
    "id": 2644,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "The leader of the \"Let's Go Brandon\" cryptocurrency revealed that Rep. <span class='selected-term'>Madison Cawthorn</span> (R-NC) traded the meme coin three weeks before NASCAR driver Brandon Brown announced he had struck a sponsorship deal with the coin, heightening suspicion from watchdogs that the beleaguered congressman may have violated insider trading laws.",
    "author": "Andrew Kerr",
    "title": "Meme coin leader's admission could land Madison Cawthorn in more hot water"
  },
  {
    "id": 2617,
    "mediaId": 675,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. <span class='selected-term'>Madison Cawthorn</span>, a Republican from North Carolina.",
    "author": "Bob Unruh",
    "title": "Judge recommends 'insurrection' claim against Marjorie Taylor Greene be dropped"
  },
  {
    "id": 2621,
    "mediaId": 881,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Willis is investigating whether Trump committed criminal election interference when he called Raffensperger on Jan. 2, 2021 trying to get him to find 11,780 votes, one more than we need.?\nNorth Carolina Republican Rep. <span class='selected-term'>Madison Cawthorn</span> is facing seven primary challengers and a very obvious GOP campaign to run him out of office.",
    "author": "Todd Zwillich",
    "title": "Lies, power grabs, voter suppression, and the tyranny of the minority."
  },
  {
    "id": 3266,
    "mediaId": 367,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Details about the incident are emerging soon after U.S. Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) was cited for having a gun in a carry-on bag.",
    "author": "Patrick Marley",
    "title": "Congressional candidate Derrick Van Orden fined for having a loaded gun in an airport. He calls the incident a mistake."
  }
]