[
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "In 2020, a businessperson he backed in North Carolina fell to now-Representative <span class='selected-term'>Madison Cawthorn</span>.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 3121,
    "mediaId": 43,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "North Carolina representative <span class='selected-term'>Madison Cawthorn</span>, for example, was born in 1995.",
    "author": "Tony Wikrent",
    "title": "Wrap  Political Economy  January 2, 2022"
  },
  {
    "id": 3073,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "A group of registered voters have invoked the 14th Amendment to disqualify Rep. <span class='selected-term'>Madison Cawthorn</span> from running again for a seat in the House in 2022, based on his support for the January 2021 riot at the U.S. Capitol.",
    "author": "",
    "title": "Biden vs. Trump: The Makings of a Shattering Constitutional Crisis"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Other attendees of the fundraiser on Wednesday include Congressmen <span class='selected-term'>Madison Cawthorn</span> of North Carolina and Jim Jordan of Ohio.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 2930,
    "mediaId": 593,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Madison Cawthorn</span>, R-N.C., has seen his support among members of his party evaporate after salacious claims he made about being invited to sex parties and witnessing drug use on Capitol Hill.",
    "author": "Nicholas Morgan",
    "title": "Republicans Turn On 'Embarrassment' Madison Cawthorn After Comments About Sex Parties, Cocaine"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "But Trump's risker endorsement in the state is for Rep. <span class='selected-term'>Madison Cawthorn</span>'s reelection.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 2803,
    "mediaId": 195,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The Tar Heel State is, however, proving troublesome in other ways after a former district staff member for Rep. <span class='selected-term'>Madison Cawthorn</span> (R-N.C.) accused the 26-year-old lawmaker of improperly firing her after denying family and medical leave.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Biden administration makes huge election year decision"
  }
]