{
  "id": 4722,
  "mediaId": 8441,
  "date": "2022-04-22",
  "headline": "2022 Primary election candidate list",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/03/Election2022Webstock.jpg?w=1024&h=512",
  "link": "https://www.thereporteronline.com/2022/04/22/2022-primary-election-candidate-list/",
  "mediaOutlet": "Springfield Sun - United States - Pennsylvania",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sokil",
  "authorUrl": "https://www.thereporteronline.com/author/dan-sokil/",
  "termIds": [
    0
  ],
  "sentences": [
    "The 4th contains part of Berks County and part of Montgomery County consisting of the townships of Abington, Cheltenham, Douglass, East Norriton, Horsham (part), Limerick, Lower Frederick, Lower Gwynedd, Lower Merion (part), Lower Moreland, Lower Pottsgrove, Lower Providence, Lower Salford, New Hanover, Perkiomen, Plymouth, Skippack, Springfield, Towamencin, Upper Dublin, Upper Frederick, Upper Gwynedd, Upper Merion (part), Upper Moreland, Upper Pottsgrove, Upper Providence, Upper Salford, West Norriton, West Pottsgrove, Whitemarsh, Whitpain and Worcester and the boroughs of Ambler, Bryn Athyn, Collegeville, Conshohocken, Green Lane, Hatboro, Jenkintown, Lansdale, North Wales, Pottstown, Rockledge, Royersford, Schwenksville, Trappe and West Conshohocken.",
    "The 44th contains part of Berks County consisting of the township of Union and the borough of Birdsboro; part of Chester County consisting of the townships of Caln, Charlestown, East Brandywine, East Coventry, East Nantmeal, East Pikeland, East Vincent, East Whiteland, Honey Brook, North Coventry, Sadsbury, Schuylkill, South Coventry, Upper Uwchlan, Uwchlan, Wallace, Warwick, West Brandywine, West Caln, West Nantmeal, West Pikeland, West Sadsbury and West Vincent and the boroughs of Atglen, Elverson, Honey Brook, Parkesburg, Phoenixville and Spring City; and part of Montgomery County consisting of the townships of Lower Providence and Upper Providence and the borough of Royersford.",
    "The 24th contains part of Berks County consisting of the townships of Amity, Colebrookdale, District, Douglass, Earl, Hereford, Longswamp, Pike, Rockland and Washington and the boroughs of Bally, Bechtelsville, Boyertown and Topton and part of Montgomery County consisting of the townships of Douglass, Limerick, Lower Frederick, Lower Pottsgrove, Lower Salford, Marlborough, New Hanover, Perkiomen, Skippack, Towamencin, Upper Frederick, Upper Gwynedd, Upper Hanover, Upper Pottsgrove, Upper Salford and West Pottsgrove and the boroughs of Collegeville, East Greenville, Green Lane, North Wales, Pennsburg, Pottstown, Red Hill, Schwenksville and Trappe.",
    "You can check your voter registration status here: https://www.pavoterservices.pa.gov/pages/voterregistrationstatus.aspx\nA new legislative map approved by state supreme court in February has also made changes to certain districts in our area, and you can check the final map online here: https://www.redistricting.state.pa.us/maps/\nBelow are the candidates that will be on the 2022 primary election ballot for local races, according to the unofficial candidate list published by Montgomery County’s Department of Voter Services.",
    "The 12th contains part of Montgomery County consisting of the townships of Franconia, Hatfield, Horsham, Lower Gwynedd, Lower Moreland, Montgomery, Plymouth, Salford, Upper Dublin, Upper Moreland, Whitpain and Worcester and the boroughs of Ambler, Bryn Athyn, Hatboro, Hatfield, Lansdale, Souderton and Telford.",
    "The 1st contains all of Bucks County and parts of Montgomery County including Franconia, Hatfield, Marlborough, Montgomery, Salford and Upper Hanover townships, parts of Horsham Township, and the boroughs of East Greenville, Hatfield, Pennsburg, Red Hill, Souderton and Telford.",
    "The 4th contains part of Montgomery County consisting of the townships of townships of Abington, Cheltenham and Springfield and the boroughs of Jenkintown and Rockledge and part of the city of Philadelphia.",
    "The 147th contains part of Montgomery County consisting of the townships of Douglass, Franconia (part), Lower Frederick, Lower Salford, New Hanover, Upper Frederick, Upper Pottsgrove and Upper Salford.",
    "Montgomery County’s primary election is scheduled for May 17, and the last day to register to vote in the primary is May 2, while the last day to apply for an absentee or mail-in ballot is May 10.",
    "The 53rd contains part of Montgomery County consisting of the townships of Franconia (part), Hatfield and Montgomery (part) and the boroughs of Hatfield, Lansdale, Souderton and Telford.",
    "The 150th contains part of Montgomery County consisting of the townships of Lower Providence, Upper Providence and West\nNorriton (part) and the boroughs of Collegeville and Trappe.",
    "The 152nd contains part of Montgomery County consisting of the townships of Abington (part), Lower Moreland and Upper Moreland and the borough of Bryn Athyn and Hatboro.",
    "The 61st contains part of Montgomery County consisting of the townships of Lower Gwynedd, Towamencin, Upper Gwynedd and Whitpain (part) and the borough of North Wales.",
    "The 149th contains part of Montgomery County consisting of the townships of Lower Merion (part) and Upper Merion and the boroughs of Bridgeport and West Conshohocken.",
    "The 16th includes the eight towns in Pennridge School District — Perkasie, Sellersville, Dublin, Silverdale, Hilltown, Bedminster, East Rockhill and West Rockhill.",
    "The 151st contains part of Montgomery County consisting of the townships of Horsham, Montgomery (part) and Upper Dublin (part) and the borough of Ambler.",
    "The 153rd contains part of Montgomery County consisting of the of the townships of Abington (part) and Upper Dublin (part) and the borough of Rockledge.",
    "The 148th contains part of Montgomery County consisting of the townships of Lower Merion (part) and Whitemarsh and the borough of Narberth.",
    "The 154th contains part of Montgomery County consisting of the townships of Cheltenham and Springfield and the borough of\nJenkintown.",
    "The following candidate list for Bucks County primary elections is from the unofficial candidate list on the Bucks County website.",
    "The first elections of 2022 are just weeks away, and there are some basics readers should know before casting their votes.",
    "24th State Senatorial district: Democratic — Jill Dennin, Emanuel Wilkerson; Republican — Tracy Pennycuick, David Moyer.",
    "4th U.S. Congressional district: Democratic — Madeleine Dean; Republican — Christian Nascimento, Daniel Burton Jr.",
    "Note that each race with more than one candidate from the same political party will be on the primary ballot.",
    "54th State House District: Democratic — Greg Scott, Rochelle Culbreath; Republican — Allen Arthur Anderson.",
    "1st U.S. Congressional district: Democratic — Ashley Ehasz; Republican — Brian Fitzpatrick, Alex Entin.",
    "The 54th contains the township of Plymouth and the boroughs of Conshohocken and Norristown.",
    "147th State House district: Democratic — Alexandra Wisser; Republican — Donna M. Scheuren.",
    "150th State House district: Democratic — Joe Webster; Republican — Beth Ann Bittner Mazza.",
    "53rd State House district: Democratic — Steve Malagari; Republican — Jennifer Neha Sodha.",
    "The 143rd includes Bedminster, Hilltown, Dublin, Perkasie, Sellersville and Silverdale.",
    "154th State House district: Democratic — Napoleon Nelson; Republican — Angelina Banks.",
    "151st State House district: Democratic — Melissa Cerrato; Republican — Todd Stephens.",
    "44th State Senatorial district: Democratic — Katie Muth; Republican — Jessica Florio.",
    "12th State Senatorial district: Democratic — Maria Collett; Republican — Rob Davies.",
    "152nd State House district: Democratic — Nancy Guenst; Republican — John Weinrich.",
    "61st State House district: Democratic — Liz Hanbidge; Republican — Jessie Bradica.",
    "153rd State House district: Democratic — Ben Sanchez; Republican — Larry Ulrich.",
    "143rd State House District: Democratic — Gwen Stoltz; Republican — Shelby Labs.",
    "4th State Senatorial district: Democratic — Art Haywood; Republican – none.",
    "148th State House district: Democratic — Mary Jo Daley; Republican — none.",
    "16th State Senatorial district: Republican — Pat Browne, Jarrett Coleman.",
    "149th State House district: Democratic — Tim Briggs; Republican — none.",
    "Staff writer Bob Keeler contributed information to this story.",
    "145th State House District: Republican — Craig Staats.",
    "The 145th includes East Rockhill and West Rockhill.",
    "."
  ]
}