{
  "id": 1375,
  "mediaId": 2551,
  "date": "2022-04-02",
  "headline": "Stunning swap rumour has Luke Brooks AND Michael Maguire leaving the Tigers to be replaced by premiership-winning coach Shane Flanagan and his halfback son Kyle",
  "image": "https://i.dailymail.co.uk/1s/2022/04/02/07/56122263-0-image-a-4_1648881445360.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10678285/Swap-rumour-Tigers-Luke-Brooks-Michael-Maguire-replaced-Shane-Flanagan-son-Kyle.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Alston For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Josh+Alston+For+Daily+Mail+Australia",
  "termIds": [
    1270,
    2625,
    3918,
    3953,
    4311,
    178,
    280,
    317,
    686
  ],
  "sentences": [
    "+3\nView gallery\nKyle Flanagan is on the outer with the Bulldogs and is not even training with the first grade side, instead playing for Mounties in the NSW Cup\nThe Daily Telegraph's Paul Kent said Flanagan and Brooks are rumoured to be set to swap clubs and that the deal would include coach Shane Flanagan switching to the Tigers in a package deal with his son.",
    "+3\nView gallery\nAfter copping a ban from coaching in the NRL over the Sharks peptide scandal, Shane Flanagan is now free to coach and is rumoured to be heading to West Tigers\nThe Sydney Morning Herald’s Andrew Webster said on SEN Radio that Mcguire was on thin ice.",
    "Maguire and his halfback Brooks have worn the brunt of blame for the Tigers' shocking start to the 2022 NRL season including their stumbling loss to the Titans on Thursday that many fans dubbed the worst game they had ever seen.",
    "'After Brooks twice had requests for a release to Newcastle rejected over the summer – [director of football Tim] Sheens declaring he was going nowhere – the Bulldogs have emerged as the latest interest,' Kent wrote.",
    "Flanagan had previously been banned from coaching and received a one-year suspension from the NRL in 2014 for his role in the Cronulla Sharks peptides scandal.",
    "Meanwhile, halfback Kyle Flanagan is stuck in reserve grade limbo at the Bulldogs with no signs of a return to firsts after he was relegated in 2021.",
    "'He said last night after the match, 'we keep doing that things will turn', I reckon he’s been saying that things will turn for two seasons.'",
    "After four straight losses the Tigers now face a tough stretch of games against the Sharks, Eels, Rabbits, Dragons and then Manly.",
    "'The right bower, however, is that Flanagan will land at Leichhardt as part of a package deal that includes his father Shane.'",
    "Luke Brooks and coach Michael Maguire could both be shipped from the Wests Tigers in a stunning swap deal with the Bulldogs.",
    "'It begins with Kyle Flanagan moving to the Tigers in a swap for Brooks, with a side deal done to square up the money.",
    "+3\nView gallery\nLuke Brooks is under fire at the Tigers after failing to deliver results since his debut in 2013.",
    "'It’s conceivable that they won’t win any of those, at what point does Tim Sheens … … pull the trigger?'",
    "Former Broncos player Denan Kemp then questioned whether Brooks had the backing of teammates at Concord.",
    "Flanagan is currently working as a list management consultant at the Dragons and as a commentator.",
    "'They’ve got Luke Brooks there, he’s the man but there’s no real backing behind him,' Kemp said.",
    "His coaching ended this year and he is free to take up an NRL head coaching role at the Tigers.",
    "It has been reported his management twice asked for a release in the off-season.",
    "'They say he was looking to go to Newcastle at the end of the year.'",
    "'The Bulldogs move is part of a bigger conspiracy.",
    "'The Bulldogs would happily swap him for Brooks.",
    "'He’s running out of things to say,' he said.",
    "Do they not get behind him as a team?",
    "'Do they get behind him as a team?",
    "Is he confident?",
    "Webster asked."
  ]
}