[
  {
    "id": 991,
    "mediaId": 2590,
    "date": "2022-02-17",
    "sentence": "Advertisement\nIn the contest for the GOP nomination, Oz has several rivals: Kathy Barnette, a conservative commentator; Jeff Bartos, a real estate developer who ran unsuccessfully for lieutenant governor; <span class='selected-term'>Dave McCormick</span>, a former hedge fund CEO; and Carla Sands, Donald Trump’s ambassador to Denmark.",
    "author": "Liz Skalka",
    "title": "Inside Dr. Oz's Campaign Road Show"
  },
  {
    "id": 10698,
    "mediaId": 8322,
    "date": "2022-03-18",
    "sentence": "The campaign for <span class='selected-term'>Dave McCormick</span>, a Republican running against Oz, argued to Fox News Digital that the columns reflect a larger trend of anti-gun rhetoric from the Oz camp.",
    "author": "",
    "title": "Dr. Oz denies writing gun control advocacy columns, business partner claims authorship"
  },
  {
    "id": 9025,
    "mediaId": 2553,
    "date": "2022-03-21",
    "sentence": "“No one actually believes that he was so offended by the content of these columns that he waited until he was running for senate in a Republican primary to disown them.”\n<span class='selected-term'>Dave McCormick</span>, the leading Republican candidate in the race, slammed Oz, saying in a statement that Oz “has a long public record and history of being enthusiastically anti-Second Amendment.”\n“He has supported red flag laws and sided with extreme left gun grabbers to try to take away guns from Americans,” McCormick’s campaign continued.",
    "author": "Ryan Saavedra",
    "title": "Articles Surface Featuring Dr. Oz’s Name On Byline That Cheer Clamping Down On Second Amendment Rights"
  },
  {
    "id": 6116,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 5582,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  }
]