[
  {
    "id": 2675,
    "mediaId": 2573,
    "date": "2022-01-28",
    "sentence": "",
    "author": "",
    "title": "Biden visits Pittsburgh bridge collapse site, promises US will 'fix them all'"
  },
  {
    "id": 2691,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "author": "",
    "title": "The Republican megadonor funding the party’s 2022 hopes"
  },
  {
    "id": 1789,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 1806,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 1635,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 1022,
    "mediaId": 2781,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "author": "Fox News",
    "title": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad"
  },
  {
    "id": 965,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "Pennsylvania GOP Senate candidate <span class='selected-term'>Dave McCormick</span> ran a “Let’s go, Brandon!” Super Bowl campaign ad within his state, listing some of Biden’s losses since taking office, using actual headlines, including:\nInflation a record high;\nThe fiasco in Afghanistan is a grave blow;\nBig Tech silencing conservative voices;\nU.S. trade deficit hits record high;\nOn pace to surpass record for annual homicides; and,\nIllegal border crossings soar to record highs.",
    "author": "Michael Dorstewitz",
    "title": "The Supreme Court Will Disappoint Joe Biden on Gun Control"
  },
  {
    "id": 931,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— <span class='selected-term'>Dave McCormick</span> (@DaveMcCormickPA) February 14, 2022",
    "author": "Valerie Richardson",
    "title": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania"
  },
  {
    "id": 1604,
    "mediaId": 8359,
    "date": "2022-02-14",
    "sentence": "US Senate Candidate <span class='selected-term'>Dave McCormick</span> aired a \"Let's Go, Brandon\" themed ad that is brilliant in its simplicity.",
    "author": "Brodigan",
    "title": "Watch: Senate Candidate Airs Brilliant 'Let's Go, Brandon' Ad During the Super Bowl"
  },
  {
    "id": 118,
    "mediaId": 2572,
    "date": "2022-02-24",
    "sentence": "The latter, <span class='selected-term'>Dave McCormick</span>, joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden admin on the ropes"
  },
  {
    "id": 16,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 12781,
    "mediaId": 2573,
    "date": "2022-02-28",
    "sentence": "Continue reading …\n<span class='selected-term'>DAVE MCCORMICK</span> - Russia's unprovoked invasion of Ukraine has begun, driven by Vladimir Putin's decades-old desire to rebuild the Soviet Union.",
    "author": "REBECCA GRANT",
    "title": "Belarus may enter Ukraine fight, actress calls Zelenskyy 'a true leader'"
  },
  {
    "id": 11719,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "A Fox News poll released in early March showed Oz second in the Senate race behind former hedge fund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "George Stockburger",
    "title": "Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 8955,
    "mediaId": 2526,
    "date": "2022-03-30",
    "sentence": "During the Pennsylvania Republican Senate primary debate forum, frontrunner <span class='selected-term'>Dave McCormick</span>, saying that everyone should be held accountable for their past statements, confronted the celebrity doctor about his anti-fracking history over the years on his shows and in columns he has written.",
    "author": "Jacob Bliss",
    "title": "Mehmet Oz Has Meltdown During Live Debate When Confronted With Record, Called ‘Liberal’"
  },
  {
    "id": 7626,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 7633,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 6116,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 4905,
    "mediaId": 8493,
    "date": "2022-04-20",
    "sentence": "The nation is watching us work to reclaim the greatness of our country, and sending someone, someone like <span class='selected-term'>Dave McCormick</span>, to Washington, D.C. is something you can be proud of.",
    "author": "WKOK Staff",
    "title": "McCormick Rally with Sec. Pompeo: America Headed ‘Wrong Direction’"
  }
]