[
  {
    "id": 936,
    "mediaId": 8254,
    "date": "2022-02-18",
    "sentence": "Candidates Jeff Bartos and Kathy Barnette had the opportunity to reach the voters who have been bombarded by TV ads from their opponents Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Jordan Tracy",
    "title": "Four GOP candidates for US Senate meet in Blair County"
  },
  {
    "id": 884,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 12496,
    "mediaId": 2573,
    "date": "2022-02-27",
    "sentence": "Among his top rivals in the GOP Senate primary are Mehmet Oz, the well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show;\" <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump; and veteran and conservative political commentator Kathy Barnette.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania Senate clash: Bartos showcases ‘strongest grassroots army’ in GOP primary race"
  },
  {
    "id": 15522,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "(WHTM) – A new Fox News poll shows former hedge fund CEO <span class='selected-term'>Dave McCormick</span> taking a nine point lead in the race to represent Pennsylvania in the United States Senate.",
    "author": "George Stockburger",
    "title": "McCormick, Oz lead Fox News Poll of Pa. Senate race"
  },
  {
    "id": 10834,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "And my failing RINO opponent <span class='selected-term'>Dave McCormick</span> is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "author": "Dillon Burroughs",
    "title": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks"
  },
  {
    "id": 11719,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "A Fox News poll released in early March showed Oz second in the Senate race behind former hedge fund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "George Stockburger",
    "title": "Dr. Oz removed from Biden’s sports council"
  }
]