[
  {
    "id": 3561,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "In the crowded race to replace retiring Sen. Pat Toomey (R-Pa.), conservative commentator Kathy Barnette came in second place, while the poll showed hedge fund executive <span class='selected-term'>Dave McCormick</span> in third place.",
    "author": "",
    "title": "Governors get in on redistricting"
  },
  {
    "id": 4122,
    "mediaId": 6526,
    "date": "2022-01-25",
    "sentence": "“It’s not often a U.S. senator from Texas comes to the Lehigh Valley,” Jonathan DelCollo of Reading said, referring to guest speaker Ted Cruz, who was there to support fellow Republican <span class='selected-term'>Dave McCormick</span>’s bid for Pat Toomey’s soon-to-be-vacated Senate seat.",
    "author": "Andrew Scott",
    "title": "‘The country looks to Pennsylvania’: Ted Cruz rallies in the Lehigh Valley to kick off candidate’s bid to replace Sen. Pat Toomey"
  },
  {
    "id": 2861,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 2734,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 3066,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "STATION GOSSIP",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 2865,
    "mediaId": 2918,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Natalie Winters",
    "title": "A Dominion Voting Systems Rep is Sponsoring a Republican Senate Campaign Fundraiser."
  },
  {
    "id": 2691,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "author": "",
    "title": "The Republican megadonor funding the party’s 2022 hopes"
  },
  {
    "id": 1789,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 1806,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 1635,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 958,
    "mediaId": 2662,
    "date": "2022-02-13",
    "sentence": "According to Conservative Brief — <span class='selected-term'>Dave McCormick</span> was the CEO of Bridgewater Associates, the largest hedge fund in the world with assets worth at least $150 billion, from 2020 until January of this year.",
    "author": "Jim Hoft",
    "title": "MUST SEE: GOP Candidate Releases ‘Let’s Go Brandon’ Commercial During the Super Bowl (VIDEO)"
  },
  {
    "id": 931,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— <span class='selected-term'>Dave McCormick</span> (@DaveMcCormickPA) February 14, 2022",
    "author": "Valerie Richardson",
    "title": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania"
  },
  {
    "id": 1022,
    "mediaId": 2781,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "author": "Fox News",
    "title": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad"
  },
  {
    "id": 1122,
    "mediaId": 2730,
    "date": "2022-02-18",
    "sentence": "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate <span class='selected-term'>Dave McCormick</span> pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "author": "Rebecca Downs",
    "title": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State"
  },
  {
    "id": 936,
    "mediaId": 8254,
    "date": "2022-02-18",
    "sentence": "Candidates Jeff Bartos and Kathy Barnette had the opportunity to reach the voters who have been bombarded by TV ads from their opponents Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Jordan Tracy",
    "title": "Four GOP candidates for US Senate meet in Blair County"
  },
  {
    "id": 884,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 16,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 17,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 50,
    "mediaId": 2590,
    "date": "2022-02-26",
    "sentence": "Advertisement\nIn this 2022 photo combination shown are Republican Pennsylvania U.S. Senate candidates, <span class='selected-term'>Dave McCormick</span>, left and Mehmet Oz.",
    "author": "Jeff McMillan and Marc Levy",
    "title": "In Trans People, GOP Candidates Find Latest 'Wedge Issue'"
  },
  {
    "id": 12496,
    "mediaId": 2573,
    "date": "2022-02-27",
    "sentence": "Among his top rivals in the GOP Senate primary are Mehmet Oz, the well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show;\" <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump; and veteran and conservative political commentator Kathy Barnette.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania Senate clash: Bartos showcases ‘strongest grassroots army’ in GOP primary race"
  },
  {
    "id": 15311,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "A recent Fox News poll found Bartos with 9% support from Pennsylvanian Republican voters, tying him with Kathy Barnette for third behind <span class='selected-term'>Dave McCormick</span> and Dr. Mehmet Oz.",
    "author": "George Stockburger",
    "title": "Pa. Senate candidate Jeff Bartos reaches petition requirement"
  },
  {
    "id": 10969,
    "mediaId": 2664,
    "date": "2022-03-14",
    "sentence": "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and <span class='selected-term'>Dave McCormick</span> are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "author": "Travis Gettys",
    "title": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch"
  },
  {
    "id": 10699,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "(McCormick Senate campaign)\n\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz told Fox News.",
    "author": "Brooke Singman",
    "title": "Dr. Oz will renounce his Turkish citizenship if elected to Senate: 'I will only be a U.S. citizen'"
  },
  {
    "id": 10698,
    "mediaId": 8322,
    "date": "2022-03-18",
    "sentence": "The campaign for <span class='selected-term'>Dave McCormick</span>, a Republican running against Oz, argued to Fox News Digital that the columns reflect a larger trend of anti-gun rhetoric from the Oz camp.",
    "author": "",
    "title": "Dr. Oz denies writing gun control advocacy columns, business partner claims authorship"
  },
  {
    "id": 9216,
    "mediaId": 2732,
    "date": "2022-03-19",
    "sentence": "He had just spent about an hour listening to Republican U.S. Senate candidate <span class='selected-term'>Dave McCormick</span> as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "author": "Paula Reed Ward",
    "title": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville"
  },
  {
    "id": 9025,
    "mediaId": 2553,
    "date": "2022-03-21",
    "sentence": "“No one actually believes that he was so offended by the content of these columns that he waited until he was running for senate in a Republican primary to disown them.”\n<span class='selected-term'>Dave McCormick</span>, the leading Republican candidate in the race, slammed Oz, saying in a statement that Oz “has a long public record and history of being enthusiastically anti-Second Amendment.”\n“He has supported red flag laws and sided with extreme left gun grabbers to try to take away guns from Americans,” McCormick’s campaign continued.",
    "author": "Ryan Saavedra",
    "title": "Articles Surface Featuring Dr. Oz’s Name On Byline That Cheer Clamping Down On Second Amendment Rights"
  },
  {
    "id": 12260,
    "mediaId": 8483,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Matt Barcaro",
    "title": "Ad Watch: Fact-checking ad attacking Republican US Senate candidate Dave McCormick"
  },
  {
    "id": 9974,
    "mediaId": 8254,
    "date": "2022-03-30",
    "sentence": "The four candidates — Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span> and Dr. Mehmet Oz — took part in the live forum from 9 to 10 a.m. on Wednesday, March 30.",
    "author": "Anna Ashcraft",
    "title": "GOP Senate candidates take part in live forum"
  },
  {
    "id": 9193,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 9116,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "Advertisement\nAt Wednesday’s forum, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> brought up Oz’s past columns that caution against fracking, which Oz’s campaign claims were actually authored by someone else.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Goes Full Climate Denial, Says Carbon Dioxide Isn't A Problem"
  },
  {
    "id": 7274,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 7623,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 7626,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 7633,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 7085,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Trump suggests he’ll decide on Pennsylvania GOP Senate endorsement in ‘about a week’"
  },
  {
    "id": 8431,
    "mediaId": 8483,
    "date": "2022-04-09",
    "sentence": "Ad Watch: Fact-checking ad attacking Republican US Senate candidate <span class='selected-term'>Dave McCormick</span>\nRecommended",
    "author": "Matt Barcaro",
    "title": "Ad Watch: Fact-checking ad claiming Republican US Senate candidate Dave McCormick paid for attacks on Donald Trump"
  },
  {
    "id": 6065,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5777,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5518,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 5838,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 6214,
    "mediaId": 8254,
    "date": "2022-04-14",
    "sentence": "In the Republican primary field, there is no clear front-runner at the moment with Mehmet Oz sitting at 16% and <span class='selected-term'>Dave McCormick</span> coming in with 15%.",
    "author": "Lauren Rude",
    "title": "Nearly half of voters say they will vote for Republican Congress candidate: Franklin & Marshall poll"
  },
  {
    "id": 6026,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  },
  {
    "id": 5752,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 5582,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  },
  {
    "id": 5735,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO <span class='selected-term'>Dave McCormick</span> lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "author": "Brian Schwartz",
    "title": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races"
  },
  {
    "id": 5023,
    "mediaId": 8393,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  },
  {
    "id": 5107,
    "mediaId": 8504,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5145,
    "mediaId": 8404,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "Lauren Rude",
    "title": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs"
  },
  {
    "id": 4628,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  },
  {
    "id": 4629,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race for a seat that could help determine the balance of power in the Senate, Oz and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are at the top of the GOP primary polls.",
    "author": "Austin Kellerman",
    "title": "What to watch for in Dr. Oz’s first televised Senate debate"
  },
  {
    "id": 4649,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5011,
    "mediaId": 8481,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  }
]