[
  {
    "id": 991,
    "mediaId": 2590,
    "date": "2022-02-17",
    "sentence": "Advertisement\nIn the contest for the GOP nomination, Oz has several rivals: Kathy Barnette, a conservative commentator; Jeff Bartos, a real estate developer who ran unsuccessfully for lieutenant governor; <span class='selected-term'>Dave McCormick</span>, a former hedge fund CEO; and Carla Sands, Donald Trump’s ambassador to Denmark.",
    "author": "Liz Skalka",
    "title": "Inside Dr. Oz's Campaign Road Show"
  },
  {
    "id": 17,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 12476,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "The state’s GOP primary is one of the most hotly contested and most-watched of the cycle, as Oz faces off against a crowded field of Republicans, including former hedge fund CEO and veteran <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brooke Singman",
    "title": "Dr. Oz says COVID-19 'steeled' him to run for office, calls on Fauci to resign"
  },
  {
    "id": 11555,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 10834,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "And my failing RINO opponent <span class='selected-term'>Dave McCormick</span> is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "author": "Dillon Burroughs",
    "title": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks"
  },
  {
    "id": 5274,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  }
]