{
  "id": 1009,
  "mediaId": 675,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "What did Hillary Clinton know and when did she know it?",
  "image": "https://www.wnd.com/wp-content/uploads/2021/11/hillary-clinton-view-2021-jpg.jpg",
  "link": "https://www.wnd.com/2022/01/hillary-clinton-know-know/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    2171
  ],
  "sentences": [
    "According to handwritten notes, then-CIA chief John Brennan warned President Obama that Moscow had intercepted information about the alleged approval by Hillary Clinton on July 26, 2016, of a proposal from one of her foreign policy advisers to vilify Donald Trump.?\nAt the convention, Clinton foreign policy adviser Jake Sullivan drove a golf cart from one TV-network news tent in the parking lot to another, pitching producers, anchors, correspondents and even some NBC network executives a story that Trump and his advisers were in bed with Putin and possibly conspiring with Russian intelligence to steal the election.",
    "Gordon, who held a position roughly equivalent to Sullivan's on the 2016 Trump campaign, said in an interview that he hopes Durham adds Sullivan and other Clinton aides to his criminal investigation, if he hasn't already.?\nHe suspects Sullivan was the Russiagate hoax mastermind? and hopes that he and other members of Clinton's 2016 team  as well as the candidate herself  are subpoenaed for testimony and document production just as he and other Trump advisers were targeted by Special Counsel Robert Mueller, based almost entirely on rumors started by the Clinton machine.",
    "\"Just one day after we learned about Trump's hundreds of millions of dollars in undisclosed Russian business interests,? Caplin's statement continued, \"this report suggests Page met with a sanctioned top Russian official to discuss the possibility of ending U.S. sanctions against Russia under a Trump presidency  an action that could directly enrich both Trump and Page while undermining American interests.?\n\"We've never seen anything like this in American politics,? the Clinton campaign statement added with alarm.",
    "Hillary told Sullivan she wanted him to take over [her campaign],? journalists Amie Parnes and Jonathan Allen reported in their 2017 bestseller, \"Shattered: Inside Hillary's Doomed Campaign.? You're going to be my traffic cop and my rabbi, she told Sullivan, adding that he would be her de facto chief strategist.?\nSullivan was included in every aspect of her campaign strategy,? they wrote, because no one on the official campaign staff understood Hillary's thought process as well as Sullivan.\"",
    "He made the same allegations on ABC News' This Week,? anchored by George Stephanopoulos, who served as White House communication director during Bill Clinton's presidency..\nHillary Clinton campaign Communications Director Jennifer Palmieri has acknowledged that they were all bent on casting a cloud\" of suspicion over Trump and seeding doubt about his loyalties by suggesting the possibility of collusion between Trump's allies and Russian intelligence.\"",
    "The notes reflect that Steele told [his FBI handler Michael Gaeta] that Steele was aware that Democratic Party associates' were paying for [his] research; the ultimate client' was the leadership of the Clinton presidential campaign; and the candidate' was aware of Steele's reporting,? Justice Department watchdog Michael Horowitz wrote in his 2019 report examining the FBI's use of the dossier to justify spying on Trump campaign adviser Carter Page.",
    "That same day, Sullivan hyped the story on Twitter, claiming in a written campaign statement that Trump and the Russians were operating a secret hotline? through Alfa Bank and speculating federal authorities? would be investigating this direct connection between Trump and Russia.? He portrayed the discovery as the work of independent experts  computer scientists?  without disclosing their connections to the campaign.",
    "TRENDING: Florida Republicans draft ingenious bill to chase gender lunacy out of schools: Other states should copy it\nBut court documents, behind-the-scenes video footage and recently surfaced evidence reveal that Clinton and her top campaign advisers were much more involved in the more than $1 million operation to dredge up dirt on Trump and Russia than they have let on.",
    "It was set up to communicate privately with a Putin-tied Russian bank called Alfa Bank.?\nAt the same time that Simpson was working Slate, he leaked to a friend at the New York Times that the FBI had evidence of the Trump-Alfa link, providing the Times and other friendly media outlets a serious news hook to publish the unfounded rumors on the eve of the November election.",
    "Clinton's team had even \"prepared a video promoting the Trump-Alfa Bank server connection and was poised to make an all-out push through social media,? according to Isikoff and David Corn in their book, Russian Roulette.? But that plan was canned,? they wrote because the Oct. 31 Times story noted that the FBI had not been able to corroborate the claims of a cyber-link.",
    "\"It's chilling to learn that U.S. intelligence officials are conducting a probe into suspected meetings between Trump's foreign policy adviser Carter Page and members of Putin's inner circle while in Moscow,? according to the statement, which attached the Sept. 23, 2016, Yahoo article in full and noted the report came on the heels of ABC's story about Millian.",
    "Later that day, Hillary Clinton tweeted out a campaign video incorporating heavily edited quotes from Millian and suggesting they were more evidence Trump was an unwitting agent of the Russian Federation.? Above the video she posted on Sept. 22, Clinton personally tweeted: The man who could be your next president may be deeply indebted to another country.",
    "I sort of thought he was, you know, just talking to us as, you know, a fellow traveler in this  in this campaign effort.?\nVeteran FBI investigators doubt Sullivan or his boss were in the dark about the campaign-funded work of Elias, Sussmann, Simpson or Steele and other campaign operations designed to make Trump look compromised by a foreign adversary.",
    "In Durham's indictment of Sussmann for lying to the FBI about his work for the Clinton campaign while feeding them the Alfa Bank story, prosecutors revealed that Sussmann's partner Marc Elias kept Clinton campaign bigwigs in the loop about the project to manufacture a Trump-Russian bank conspiracy, which the FBI months later completely debunked.",
    "But Simpson also attended the convention in Philadelphia, and at the same time Clinton's top people were making the TV media rounds, Simpson and his Fusion GPS co-founder, Peter Fritsch, were meeting with the New York Times and other major print media outlets to pitch Russia collusion\" stories, focusing primarily on Manafort.",
    "By Paul Sperry\nReal Clear Investigations\nAs indictments and new court filings indicate that Special Counsel John Durham is investigating Hillary Clinton's 2016 campaign for feeding false reports to the FBI to incriminate Donald Trump and his advisers as Kremlin agents, Clinton's role in the burgeoning scandal remains elusive.",
    "Sources familiar with his probe say Durham ultimately is investigating the Clinton campaign for, among other things, alleged conspiracy to defraud the FBI, the Justice Department and the Pentagon's research arm, which provided funding and sensitive Internet logs to Clinton operatives who helped fabricate the Alfa Bank hoax.",
    "Lt. Gen. Michael Flynn, \"who is a paid tool for Russian television.?\nAdded Clinton: This is what scares me  the way that Putin has taken over the political apparatus, or is trying to  .? At that point, a media handler interrupted them over some staging issues, and they stopped discussing Trump and Russia.",
    "The day after Clinton's false tweet about Millian and Trump, her campaign released a statement by senior national spokesman Glen Caplin touting a new bombshell report? by Yahoo News that revealed the FBI was investigating \"Trump's foreign policy adviser\" for suspected links to the Kremlin.",
    "Under oath, Podesta denied speaking with Clinton about the dossier even after the election: I don't know that I've ever discussed the dossier with Mrs. Clinton.? He also swore Clinton never talked to him about opposition research, in general, or who the campaign might hire to conduct it.",
    "With more than 380 payments from the Clinton campaign and the DNC being made to Perkins Coie, it is seemingly impossible that the candidate herself would not have direct knowledge of the purpose of those payments or any earmarks being made, especially those for Fusion GPS,? Schoen said.",
    "\"In addition to outright surveillance via the fraudulent FISA warrant against Carter Page, many of us were hit with federal and congressional subpoenas, subjected to grueling Senate and House investigations, special counsel interrogations and resulting harsh media spotlight,? he said.",
    "Durham last year indicted Sussmann for lying to the FBI, detailing how the lawyer and Simpson had collaborated with a team of anti-Trump, pro-Clinton computer researchers to draft a technical report for the FBI and media allegedly connecting Trump to Alfa Bank through email servers.",
    "Sullivan, who now serves as President Biden's national security adviser, maintained in December 2017 congressional testimony he didn't even know that the politically prominent Elias worked for Perkins Coie, a well-known Democratic law firm representing the Clinton campaign.",
    "We were on a mission to get the press to focus on the prospect that Russia had not only hacked and stolen emails from the Democratic National Committee, but that it had done so to help Donald Trump and hurt Hillary Clinton,? Palmieri stated in a 2017 Washington Post column.",
    "Top officials involved in her campaign have repeatedly claimed, some under oath, that they and the candidate were unaware of the foundation of their disinformation campaign: the 35-page collection of now debunked claims of Trump/Russia collusion known as the Steele dossier.",
    "In a related filing in the Danchenko case, Durham noted that his areas of inquiry? include investigating the extent to which the Clinton campaign and/or its representatives directed, solicited or controlled the defendant's [Danchenko's] activities? surrounding the dossier.",
    "Major media stories from 2016, however, routinely identified Elias as general counsel for the Clinton campaign? and a partner at Perkins Coie.?\nTo be honest with you, Marc wears a tremendous number of hats, so I wasn't sure who he was representing,? Sullivan testified.",
    "\"Experts are telling us that Russian state actors broke into the DNC, stole these emails, and other experts are now saying the Russians are releasing these emails for the purpose of actually helping Donald Trump,? Mook told CNN's Jake Tapper at the convention.",
    "The Alfa smear was meant as an October surprise? that would rock the Trump campaign and take media focus off the probe of Clinton's emails, which then-FBI Director James Comey had been pressured by a New York agent to revive in the final week of the campaign.",
    "Politics\nCommentary\nJack Cashill\nBetsy McCaughey\nMichael Master\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nLarry Elder\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "Danchenko and the Clinton campaign, including Podesta and other officials, happen to share the same D.C. law firm  Schertler & Onorato  which gives the appearance that the Clinton campaign and the main source of the dossier have entered into a joint defense.",
    "Among those Americans aware of the Durham probe, fully 60% think the special counsel should question Clinton about her role in the dossier and other campaign foul play, according to a recent national poll by TechnoMetrica Institute of Policy and Politics.",
    "He also insisted he didn't tell his campaign contacts about his meetings with Steele or Simpson, despite billing the campaign for such consultations, and never shared the dossier reports or other materials they generated with those Clinton officials.",
    "Former Bill Clinton political strategist Doug Schoen said it stretches credulity to suggest that top officials in the Clinton camp, including the candidate herself, weren't fully aware of the research their campaign attorney was billing them for.",
    "Durham's ongoing investigation has found that core parts of the dossier were fabricated and falsely attributed to Millian as their source, including the foundational claim of a well-developed conspiracy of cooperation? between Russia and Trump.",
    "Durham reported that Steele's main collector of information  onetime Brookings Institution analyst Igor Danchenko  never even spoke with Millian, as he had claimed, but simply made up the source of the most explosive information in the dossier.",
    "A senior congressional investigator who insisted on anonymity said the denials are hard to believe and described them as an effort to insulate Clinton from a major undertaking of her campaign that has proved scandalous, if not criminal.",
    "He also indicated prosecutors want to find out whether the campaign knew Danchenko and Steele were funneling false information to the FBI, and intend to summon multiple former employees of the campaign\" as trial or grand jury witnesses.",
    "Emails obtained by Durham's investigators show the lawyer had briefed top Clinton campaign officials Sullivan, Palmieri and Mook about the Alfa smear in September 2016. Elias kept Clinton campaign members informed,? the indictment said.",
    "Sullivan spread the anti-Trump rumors behind the scenes while Clinton Campaign Manager Robby Mook went in front of the cameras to echo essentially what Steele, a former British intelligence officer, had reported back to the campaign.",
    "The evidence suggests that the Trump-Russia conspiracy theory sprang from a multi-pronged effort within the Clinton campaign, which manufactured many of the false claims, then fed them to friendly media and law enforcement officials.",
    "While Mook has not been questioned under oath on the Hill, he told CNN: I didn't know that we were paying the contractor that created that document.?\nWhat I've known [about the dossier] is what I've read in the press,? he claimed.",
    "A new court filing in the Sussmann case reveals that Elias has given testimony before a criminal grand jury impaneled by Durham in Washington, D.C.\nGrand jury testimony is sealed and it's not known what Elias told prosecutors.",
    "Durham's recent indictments of Sussmann and subcontractor Danchenko implicate key campaign figures and make clear that the Clinton campaign's influence on the contents of the dossier was much deeper than previously known.",
    "For instance, Durham found that a longtime Clinton insider and campaign adviser  Charles Dolan  was a key source for the dossier and most likely originated the false pee tape? rumor involving Trump and Moscow prostitutes.",
    "On July 5, 2016  the same day the FBI publicly exonerated Clinton in her email scandal  Steele handed off the first installments of the dossier to an FBI agent overseas who had handled him previously as an informant.",
    "It was also in September that then-Clinton campaign attorney Michael Sussmann planted at FBI headquarters the manufactured allegation that Trump had set up a secret hotline? to Putin through Russia-based Alfa Bank.",
    "I consulted with Robby Mook, who was campaign manager,? he said, noting that Mook handled budget matters and signed off on opposition-research expenses billed by Perkins Coie, which totaled more than $1.2 million.",
    "The FBI nonetheless cited the article to support its applications to a secret federal court for authority to spy on Page, claiming it corroborated the dossier's allegations, even though they were one and the same.",
    "Later that same month, during the Democratic National Convention in Philadelphia, the CIA picked up Russian chatter about a Clinton foreign policy adviser who was trying to develop allegations to vilify? Trump.",
    "In the Sussmann case, Durham's agents have already questioned one former employee of the Clinton campaign? and subpoenaed Clinton campaign records, according to a new document filed by Durham earlier this week.",
    "Clinton herself was at the center of these efforts, using her personal Twitter account and presidential debates to echo the false claims of Steele and others that Trump was in cahoots with the Russians.",
    "Three times I was summoned before the special counsel, the first of which in August 2017 was apparently leaked to the Washington Post.?\nGordon is not alone in his desire to see Clinton held to account.",
    "Durham is telling us that this Alfa Bank hoax  and probably related matters  were Clinton campaign ops at the very highest level,? former FBI counterintelligence agent and lawyer Mark Wauck noted.",
    "Quoting unnamed Clinton surrogates, both the New York Times and CNN have reported that the candidate was unaware of the dossier prior to BuzzFeed publishing it two months after the 2016 election.",
    "It shows Clinton speaking to her running mate, Democratic Sen. Tim Kaine, and his wife, Anne, in hushed tones about Trump and Russia in a back room before a campaign event in early October 2016.",
    "I don't say this lightly,? Clinton whispered, pausing to look over her shoulder, \"[but Trump's] agenda is other people's agenda.?\n\"We're scratching hard, trying to figure it out,? she continued.",
    "She claimed Trump did what the dossier falsely claimed he did  conspiring with the Russian government to hack her campaign and steal emails  though she allegedly never read Steele's reports.",
    "In the final debate, for example, Clinton accused Trump of being Putin's puppet? and accepting his help? in sabotaging her campaign, drawing conclusions similar to ones made in the dossier.",
    "We wanted to raise the alarm.?\nIt's not known if their media blitz was coordinated with Glenn Simpson, the Clinton campaign's opposition-research contractor who hired Steele for $168,000.",
    "Here again, Clinton's team hyped as a bombshell? Trump-Russia revelation a media report that it helped craft from opposition research it commissioned and from FBI interest it generated.",
    "The campaign's in-house opposition research team, led by chief researcher Christina Reynolds, was under the direction of Palmieri, the head of communications who is close to Clinton.",
    "Podesta has testified that he, too, had no idea Steele and Fusion GPS were on the campaign's payroll and didn't read the dossier until BuzzFeed posted it online after the election.",
    "\"I appeared before the Senate Intelligence Committee, Senate Judiciary Committee, House Intelligence Committee and produced requested documents to the House Judiciary Committee.",
    "Also that day, Clinton tweeted, It's time for Trump to answer serious questions about his ties to Russia,? while attaching a meme that read: Donald Trump has a secret server.",
    "You know, as campaign manager, there's a lot going on.?\nMook added that he wasn't sure who was gathering the information for the dossier: I don't know the answer to that.",
    "Elias Met Simpson Often\nIn his testimony, Elias said he met with Simpson and other Fusion GPS researchers at least 20 times and Steele at least once during the campaign.",
    "Durham Inching Closer\nWith each new indictment and court filing, Clinton inches closer to the center of the special prosecutor's investigation, now in its third year.",
    "Although Clinton has not been pressed by major media on her role in Russiagate, a short scene in the 2020 documentary Hillary? suggests she was aware of the effort.",
    "Both Manafort and Flynn had been cited in dossier reports submitted to the Clinton campaign before the two Democratic nominees had their October 2016 conversation.",
    "Clinton also appeared to cite dossier disinformation in the presidential debates, casting further doubt on claims she was walled off from such opposition research.",
    "However, Elias insisted he left his interlocutors in the dark about the sources of that information, for which the campaign was paying him in excess of $1 million.",
    "Broken down by political affiliation, 80% of Republicans, 44% of Democrats and 74% of independent voters agree that Clinton should be interviewed by investigators.",
    "What happened more than five years ago may have renewed relevance: Some Democratic strategists speculate that Clinton is eyeing another run at the White House.",
    "In 2016, Dolan actively campaigned and participated in calls and events as a volunteer on behalf of Hillary Clinton,? according to the Danchenko indictment.",
    "Simpson, in turn, worked with Slate reporter Franklin Foer to craft a story propagating the allegation, even reviewing his piece in advance of publication.",
    "But In 2017, he testified in a closed-door session of Congress that Mook was his campaign contact for opposition-research projects, including the dossier.",
    "She may have known [about the dossier and its financing before the election],? he said, \"but the degree of exactly what she knew is beyond my knowledge.\"",
    "That same week, Simpson worked with ABC News correspondent Brian Ross on a since-debunked story framing Trump supporter Sergei Millian as a Russian spy.",
    "Now serving in the White House as President Biden's national security adviser, Sullivan has denied under oath knowing details about the dossier project.",
    "\"He is the vehicle, the vessel for all these other people.?\nThe two then discussed all these weird connections? between the Trump campaign and Russia.",
    "In their London meeting, Steele noted that Clinton was aware of his reporting, according to contemporaneous notes Steele took of their conversation.",
    "Durham indicated in a recently filed court document that he is actively investigating the Clinton campaign and seeks to question its top officials.",
    "As Vice President Kamala Harris' popularity wanes and her shot at becoming the first female president slips, they say Clinton may see an opening.",
    "Kaine brought up former Trump Campaign Manager Paul Manafort, and Clinton expressed suspicion about Trump's then-national security adviser, ret.",
    "The dossier falsely accused Manafort, Flynn and other Trump advisers of participating in a Kremlin conspiracy to steal the election for Trump.",
    "She informed Kaine that she and her aides were scratching hard? to expose them, a project Kaine seemed to be hearing about for the first time.",
    "He, in turn, would travel each week to Clinton campaign headquarters in Brooklyn, N.Y., to report what he had learned about Trump and Russia.",
    "It seems likely that he acted as an intermediary between the campaign and Steele's primary sub-source, Danchenko, with whom he communicated.",
    " it gets smacked down.?\nIn congressional testimony, Podesta has largely claimed ignorance about the campaign's opposition-research efforts.",
    "How credible is it to suppose that Hillary herself wasn't in the know??\nDurham's investigators have been questioning Elias under subpoena.",
    "She warned voters: Computer scientists have apparently uncovered a covert server linking the Trump Organization to a Russian-based bank.\"",
    "Former Clinton campaign spokesman Brian Fallon told CNN in a separate interview she may not have been totally out of the loop, however.",
    "Clinton's lawyer, David Kendall, who practices at the Washington-based firm Williams & Connolly, did not reply to requests for comment.",
    "In effect, Clinton broadcast to her millions of followers a story her campaign had helped manufacture through a paid contractor.",
    "Then in September 2016, ABC's \"Good Morning America,? which is co-hosted by Stephanopoulos, aired parts of the Millian report.",
    "In other words, the Clinton campaign not only funded the Russia dirt on Trump but provided some of the actual sourcing for it.",
    "Sullivan even sat down with CNN honcho Jeff Zucker to outline the opposition research they had gathered on Trump and Russia.",
    "Even though her campaign helped pay for the dossier, they claim she only read it after BuzzFeed News published it in 2017.",
    "We had been waiting for the Alfa Bank story to come out,? Clinton Campaign Chairman John Podesta told Isikoff and Corn.",
    "'October Surprise' That Wasn't\nClinton teed up that statement in an Oct. 31 tweet of her own, which quickly went viral.",
    "I just can't attribute to what piece of information, you know, came to us at one time or where it came from, frankly.",
    "The intercepts said Clinton herself had approved a plan? to stir up a scandal? against Trump by tying him to Putin.",
    "The biggest lie is Hillary didn't know about any of this oppo stuff even though she tweeted about it!? he said.",
    "Campaign operatives, in turn, laundered the dirt through the FBI and into the mainstream media to damage Trump.",
    "Bad publicity from the planted stories would later pressure Trump to dump Manafort as his campaign manager.",
    "According to \"Russian Roulette,\" however, Elias shared the findings of Steele's memos with at least Mook.",
    "Elias even maintained that he hired Fusion GPS on his own without consulting with Mook or the campaign.",
    "Clinton expressed concerns over Trump's weird connections? to Russia and its president, Vladimir Putin.",
    "He also visited CNN and MSNBC, as well as Fox News, to spin the Clinton campaign's unfounded theories.",
    "Yahoo reporter Michael Isikoff had interviewed Steele in a room at a Washington inn booked by Simpson.",
    "Simpson set up Ross' interview with Millian through ABC producer Matthew Mosk, an old Simpson friend.",
    "Trout also represents other ex-campaign officials who recently retained him in matters before Durham.",
    "I will never be out of the game of politics,? Clinton told ABC's Good Morning America? in October.",
    "He said he would receive written reports from them and direct them to find certain information.",
    "This could be the most direct link yet between Donald Trump and Moscow,? Sullivan proclaimed.",
    "\"Every day seems to cast new doubts on what's truly driving Donald Trump's decision-making.\"",
    "Dossier author Christopher Steele himself has suggested Clinton was briefed on his reports.",
    "Steele had filed a campaign report about the bank's ties to Putin around the same time.",
    "I was the gatekeeper,? he said, between the research contractors and the campaign.",
    "[Editor's note: This story originally was published by Real Clear Investigations.]",
    "[Editor's note: This story originally was published by Real Clear Investigations.]",
    "Simpson also told Ross that Trump was involved in shady business deals in Moscow.",
    "\"Elias would at times brief Mook on their contents,? Isikoff and Corn wrote.",
    "You encouraged espionage against our people,? Clinton said on Oct. 19, 2016.",
    "He called the Clinton-funded smears depraved? and nationally destabilizing.\"",
    "His office declined to say whether it intended to question Clinton herself.",
    "But the Yahoo story about Page's nefarious Kremlin meetings was apocryphal.",
    "Durham warned the court that the arrangement poses a conflict of interest.",
    "Mook said he doesn't recall seeing the dossier memos during the campaign.",
    "Podesta's attorney, Bob Trout, did not respond to requests for comment.",
    "Durham recently indicted Danchenko for lying to the FBI about Millian.",
    "The skepticism cooled the media firestorm the campaign had hoped for.",
    "Its main source was Steele, whose identity was hidden in the story.",
    "He was far more than a foreign policy adviser to Clinton.",
    " I wish we paid more attention to it on the campaign.\"",
    "What did she know and when did she know it?",
    "His portfolio included campaign strategy.",
    "Foer's story broke on Oct. 31, 2016.",
    "All of this was hidden from voters.",
    "Sullivan's title was misleading.",
    "Do you trust him to run ours?\"",
    "Then  boom!",
    "J.D."
  ]
}