{
  "id": 1012,
  "mediaId": 675,
  "date": "1/24/2022 12:00:00 AM",
  "headline": "Is Biden right? Does the left own the future?",
  "image": "https://www.wnd.com/wp-content/uploads/2021/12/biden-omicron-white-house-screencapture.jpg",
  "link": "https://www.wnd.com/?p=4977456",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick J. Buchanan",
  "authorUrl": "https://www.wnd.com/author/pbuchanan/",
  "termIds": [
    1765,
    2083,
    2087,
    2171,
    146,
    428,
    2590,
    2826,
    2934,
    2945,
    2959
  ],
  "sentences": [
    "Biden's problem is that while millions might agree on aspects of his Build Back Better plan, the present primary concerns of the electorate are those government duties that his party is visibly failing to perform: controlling the pandemic, stopping the shootings and killings of cops, halting the invasion across our southern border, preventing the loss of incomes and savings to inflation.",
    "TRENDING: Florida Republicans draft ingenious bill to chase gender lunacy out of schools: Other states should copy it\nTo get off the defensive and onto offense, Biden brought his own questions for his GOP inquisitors and conservative critics:\n\"What are Republicans for?",
    "Politics\nCommentary\nJack Cashill\nBetsy McCaughey\nMichael Master\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nLarry Elder\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "Biden appears to be a failing president who believes in the inevitable victory of the ideology toward which he himself has been moving over his half-century career since arriving in Washington as a 30-year-old centrist Democrat.",
    "Historically, Democrats led the fight for Social Security, Medicare, Medicaid, food stamps, civil rights, voting rights, welfare and most of the rest of a federal monolith that now consumes perhaps a fourth of our GDP.",
    "Democrats, for example, are almost unanimous in their support of federally funded universal pre-K, child care, the child tax credit, student loan forgiveness and federal standards for voting in federal elections.",
    "Republicans have been the party that resisted the expansion of government over our lifetimes, and its role has often been to conduct an orderly retreat to a new defense perimeter after the most recent defeat.",
    "The most celebrated Republican of the last century was Ronald Reagan, who famously declared that the nine most terrifying words in the English language were, \"I'm from the government, and I'm here to help.\"",
    "Third, America's major media centered in New York and Washington, D.C., is liberal and Democratic, as are our cultural institutions  museums, Hollywood, higher education, the entertainment industry.",
    "America's white majority, home to the base of the GOP, is a diminishing majority, on average older than the core constituencies of the Democratic Party  the young, the migrants and people of color.",
    "Second, the Democratic mega-states in presidential elections  California, New York, Illinois  seem solidly blue, while Republican mega-states like Texas and Florida seem less solidly red.",
    "How to avoid spending his time with the White House press corps defending his decisions and explaining his actions as allegations of failure, one after another, were tossed up at him.",
    "Biden entered knowing what issues would be paramount and what questions would be raised:\nWhy had he been unable to control a coronavirus pandemic now killing 2,000 Americans a day?",
    "And the party of Senate Minority Leader Mitch McConnell and House Minority Leader Kevin McCarthy is basically an opposition party whose goal is to prevent them from succeeding.",
    "In short, behind Biden's demand that the GOP identify its goals was an attempt to shift the debate onto terrain more familiar and favorable for the Democratic Party.",
    "Naming them would reveal the divisions inside the GOP on priorities and open Republicans up to the kind of attacks the GOP is mounting against Biden's agenda.",
    "Biden was making the case that while the Democratic Party has an agenda of declared goals, providing benefits to millions, the GOP is the party of \"No.\"",
    "Before he appeared at his first solo news conference of 2022, President Joe Biden knew he had a communications problem he had to deal with.",
    "Turning the tables, Biden charged his Republican critics with having no policy goals, other than the willful obstruction of his goals.",
    "Why was he unable to contain an inflation eating up the wages, salaries and savings of American families at a yearly rate of 7%?",
    "Republicans have emphasized, as a major role of government, providing the security that citizens cannot provide for themselves.",
    "Security against crime and violence, security against an invasion of the country, security against hostile foreign powers.",
    "Yet, despite the imperiled position of Biden's party today, it has relative strengths and long-term trends in its favor.",
    "For the truth is that Democrats are the party of government, and Republicans are the party of the private sector.",
    "Fourth, the trend for democracies is toward transferring more and more power to central governments, not less.",
    "Why was he unable to secure a southern border that 150,000 illegal immigrants were crossing every month?",
    "There is another reason Biden would like to force Republicans to identify their goals.",
    "As for the culture wars, traditionalism has been in retreat since the 1950s.",
    "Under President Calvin Coolidge, the U.S. government share of GDP was 3%.",
    "\"The fundamental question is: What's Mitch (McConnell) for?",
    "Biden is seeking to re-elevate that critical difference.",
    "Why not fight our battles on this terrain for a change?",
    "Name me one thing they're for,\" Biden demanded to know.",
    "And, behind his exasperation, he has a point.",
    "They do have things they want to accomplish.",
    "What's he proposing to make anything better?",
    "Namely, how to get off the defensive.",
    "Unfortunately, he may not be wrong.",
    "These are their historic roles.",
    " What's he for on these things?",
    " What's he for on immigration?",
    "Democrats do have an agenda.",
    "Biden was demanding.",
    "What are they for?\"",
    "What are they for?",
    "What's he for?"
  ]
}