{
  "id": 1015,
  "mediaId": 675,
  "date": "1/17/2022 12:00:00 AM",
  "headline": "Restoring value for all human life, from conception to the grave",
  "image": "https://ae01.alicdn.com/kf/HTB1fopbov9TBuNjy1zb760pepXaT/EN_300_250.png",
  "link": "https://www.wnd.com/2022/01/restoring-value-human-life-conception-grave/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Norris",
  "authorUrl": "https://www.wnd.com/author/cnorris/",
  "termIds": [
    2171,
    482,
    2944,
    2945
  ],
  "sentences": [
    "Health\nCommentary\nBrent Smith\nJoseph Farah\nBarbara Simpson\nMichael Brown\nRead all of today's COMMENTARY...\nWorld\nEducation\nDiversions\nFaith\nMoney\nPolitics\nU.S.\nCOMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "It's an assault on and abandonment of the baby's \"right to life,\" which is one of three specifically identified unalienable rights clearly set forth in the Declaration (and the Constitution through Article VII and the Bill of Rights).",
    "\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\"",
    "As long as Americans are re-examining how to respect and get along with one another (and even agree to disagree agreeably), maybe it's high time we re-evaluated the worth we give to the voiceless in wombs, too.",
    "On Jan. 22, 1973, the U.S. Supreme Court declared their decision regarding the case of Roe v. Wade, when the highest court in the land ruled that individual state laws banning abortion were unconstitutional.",
    "When all men of all religions  shall enjoy equal liberty, property, and an equal chance for honors and power  we may expect that improvements will be made in the human character and the state of society.\"",
    "What Dr. Gould may not have realized is that such statements represent not only the monumental shift of humanity's condition and value, but also serve as a new beginning point for how we treat one other.",
    "In early America, and even when I was growing up in school in the 1950s, there were two codes that shaped most people's view of humanity: that God created us, and that we were created equal.",
    "Even the late Stephen Jay Gould, America's well-known Harvard paleontologist and evolutionary biologist, once confessed, \"Before Darwin, we thought that a benevolent God had created us.",
    "(For those who are thinking of having an abortion or if you want to help someone who is thinking about it, please read this free e-copy of Randy Alcorn's fantastic book, \"Why Pro-Life?",
    "\"Then God said, 'Let Us make man in Our image, according to Our likeness;  And God created man in His own image, in the image of God He created him; male and female He created them.\"",
    "(Ever since, tens of thousands of churches continue to recognize the third Sunday in January as a day to commemorate the high value of human life from the womb to the tomb.)",
    "Or we may follow it to its inescapable conclusion  a society in which the powerful, for their own self-interest, determine which human beings will live and which will die.\"",
    "From the cradle to the grave, we are justifying the termination of human life with softened terminology (\"abortion\" or \"health care\") and moral and medical justifications.",
    "It is staggering to think that, since 1973, over 63 million humans and Americans have lost their lives in the womb due to being aborted or killed by their parent.",
    "Whether in the U.S. Capitol or in cities across every state of our union, we shouldn't defend unjustified violence to humans outside the womb or inside the womb.",
    "As Thomas Jefferson wrote in 1809, \"The care of human life and happiness, and not their destruction, is the first and only legitimate object of good government.\"",
    "America's founders believed equality would give legs to freedom, even with slavery, as professor Thomas West documented well in \"Vindicating Our Founders.\"",
    "Eleven years later, on Jan. 13, 1984, President Ronald Reagan issued a proclamation designating Jan. 22 as the first National Sanctity of Human Life Day.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "That is why our forefathers called all Americans to uphold the worth of all men, women and children in our founding documents and their writings.",
    "Gone is its present power to aid us in the fight for equality  to remind us of one another's value and challenge us to treat one another fairly.",
    "Reclaiming the value of human life is not merely a challenge for all Americans but the primary calling and purpose of government.",
    "That is why 21 states are poised right now to ban or severely restrict abortion if Roe v. Wade is overturned, according to NPR.",
    "Abortion is the quintessential example  a total abandonment of the right to life, liberty and the pursuit of happiness.",
    "Actually, the issue of abortion shouldn't even be dealt with on a federal level, except to protect that right to life.",
    "Naturalism and scientific theory have oddly convinced most there is no God, even though they can do no such thing.",
    "If we don't fight to give human life its original value, we will continue to devalue it with reckless abandon.",
    "You will also find help in Dr. James Dobson's online article, \"How to Help a Friend Who Wants an Abortion.\"",
    "According to our Constitution, the debate and legalities of abortion should remain on the state level.",
    "And the government involves itself in every type of overreach, subterfuge and coercion imaginable.",
    "And it is a violation of government's primary purpose: to protect this unalienable right to life.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "As my friend and prolific author, Randy Alcorn, wrote in his free online book, \"Why Pro-Life?",
    "This Saturday, Jan. 22, marks 49 years since abortion became legal across the United States.",
    "It reminds us of the valiant time when men fought to gain our independence from Britain.",
    "Caring for the Unborn and their Mothers\": \"Abortion has set us on a dangerous course.",
    "Their views were based in the Bible and expressed in the Declaration of Independence.",
    "We're just fortunate to have broken the endless caste systems of creative chaos.",
    "Humans have gone from the pedestal of creation to the trash piles of evolution.",
    "It's a historical document encased under bulletproof glass in Washington, D.C.",
    "And our endless debates over when human life begins and ends haven't helped.",
    "And the blue-book value for humanness has gone from a Mercedes to a monkey.",
    "Americans are terminating life outside of the womb with equal callousness.",
    "From that point onward, abortion-on-demand was legalized in all 50 states.",
    "The beginning of life has not always been questioned as it is in our day.",
    "The value of human life has not always fluctuated from person to person.",
    " Biology took away our status as paragons created in the image of God.\"",
    "Abortion isn't simply a woman's right to choose her own \"health care.\"",
    "Most early Americans believed humans were the highest creation of God.",
    "Instead, we should esteem all human life from conception to the grave.",
    "We're now a product of random chance and selection, or so we're told.",
    "As John Adams said, \"We should begin by setting conscience free.",
    "We may come to our senses and back away from the slippery slope.",
    "It's something we tour to see, like all the relics of the past.",
    "Unfortunately, we have rejected the timeless values it upholds.",
    "Today, the Declaration of Independence isn't living; it's dead.",
    "We value positions, possessions and perceived quality of life.",
    "Further personal help and counseling can also be found HERE. )",
    "We're too busy fighting for ourselves to fight for others.",
    "And we sit back puzzled, asking: How did it get this bad?",
    "We've completely redefined and revalued human life.",
    "Disrespect, disrepute and slander are commonplace.",
    "Vitriol is vomited all over news and social media.",
    "Employees and employers with disloyalties abound.",
    "We've traded in the Good Book for our pocketbook.",
    "Do we still need the Declaration of Independence?",
    "Look around, from school shootings to euthanasia.",
    "We're ultimately no different than cockroaches.",
    "Violent crime is now justified patriotism.",
    "Family members take one another to court.",
    "Caring for the Unborn and their Mothers.\"",
    "The way we treat one another proves it.",
    "Antagonism has turned to militancy.",
    "Neither has so-called \"science.\"",
    "Shopping has turned to looting.",
    "We've left our core values.",
    "Human disposability is in.",
    "America has lost her way.",
    "We've abandoned the past.",
    "Friends backstab friends.",
    "Honor is out the window.",
    "Gangs kill for sport.",
    "Human value is out.",
    "More than ever."
  ]
}