{
  "id": 1017,
  "mediaId": 675,
  "date": "1/15/2022 12:00:00 AM",
  "headline": "Fossil fuels proliferate as 'climate industrial complex' is 'clueless'",
  "image": "https://www.wnd.com/wp-content/uploads/2019/03/oil-pump.jpg",
  "link": "https://www.wnd.com/2022/01/fossil-fuels-proliferate-climate-industrial-complex-clueless/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    107,
    107,
    2566,
    2566,
    2558,
    2675,
    2675,
    2558,
    2743,
    2743,
    2709,
    2709,
    2863,
    2863,
    2899,
    2899
  ],
  "sentences": [
    "India's Minister of Petroleum and Natural Gas reported that the country would acquire massive additional areas for oil exploration and production? by 2025. As far as the government of India is concerned, we are going to step on the accelerator in terms of exploration and production in a very big way,? said the minister in November.",
    "India and China Goes Full Throttle on Coal\nAs climate doomsayers met in November in Glasgow for the annual U.N. meeting, Asian political leaders promoted policies that sought to increase fossil fuel production  largely because of lessons learned from acute coal shortages in India and China earlier in the year.",
    "Politics\nCommentary\nBrent Smith\nJoseph Farah\nBarbara Simpson\nMichael Brown\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nCOMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Meanwhile, the country's aviation minister has made an open call to states to reduce jet fuel prices in order to increase air-traffic.?\nSo, if anyone is thinking that fossil fuels are dead, they should think again.",
    "But as fuel prices rose, Biden responded to his self-induced energy insecurity by releasing 50 million barrels of oil reserves and even called for an increase in domestic oil production.",
    "By Vijay Jayaraj\nReal Clear Energy\nIt has been a little more than a month since the United Nations climate meeting at Glasgow, yet global use of fossil fuels has increased rapidly.",
    "Though many may classify his actions as temporary solutions (to a non-existent problem), the rest of the world sees through the veneer of climate politics and the hypocrisy within.",
    "As if promises to end fossil fuels are nothing but vapors from the incense offered at the altar of climate drama  only to be consumed by an inescapable energy reality.",
    "Oil Futures on a High and India Cashes In on Imports\nIndia is also keen on securing its oil sources as OPEC has forecasted a high global demand in 2022.",
    "TRENDING: The willful blindness of the left\nWithin a span of a few months, the U.S. president went from being a climate savior to a climate villain.",
    "India's coal minister has asked the government's coal production arm, Coal India Limited, to meet an annual target of 1 billion tonnes by 2024.",
    "However, the federal government intervened by releasing millions of barrels of oil from strategic reserves, prices have come down drastically.",
    "Though India and China have managed to overcome the recent shortage in coal reserves, domestic production must be complemented by imports.",
    "For instance, U.S. President Joe Biden cancelled domestic oil projects and vowed to stop funding for international fossil fuel projects.",
    "With the Omicron variant expected to have only a minimal impact on the economy, we can expect sustained demand for coal through 2022.",
    "An UAE firm owned by India's richest man is all set to import crude oil, petroleum, and petrochemical products in December.",
    "There is nothing that the climate industrial complex can do about the situation in the U.S. or other parts of the world.",
    "The 2.6 billion people in India and China will continue to use fossil fuels as their primary energy source until 2070.",
    "Coal production for November hit record highs as Beijing scrambled to ensure enough of the fuel to meet winter needs.",
    "Overall, the first 11 months of this year accounted for 3.67 billion tonnes of coal, which is 4.2% higher than 2020.",
    "The Indian government has opened more coal mines and has allocated new mines to private players through auctions.",
    "The country's major state-owned oil firms and refineries have already secured supply for the first half of 2022.",
    "Even the most advanced European and Scandinavian countries are witnessing a revival of the fossil fuel sector.",
    "Oil from Saudi Arabia, Kuwait, and Iraq were bought in large quantities by Asian countries.",
    "[Editor's note: This story originally was published by Real Clear Energy.]",
    "[Editor's note: This story originally was published by Real Clear Energy.]",
    "It is as if the anti-fossil climate conference never happened this year.",
    "Gas prices at fuel stations remained high in India throughout the year.",
    "October 2021 witnessed the highest monthly production since March 2015.",
    "Meanwhile, China is taking similar measures to ensure its coal supply.",
    "Hence, the price of coal from Australia and Indonesia remains high.",
    "In fact, in Asia, production of fossil fuels is proliferating."
  ]
}