{
  "id": 1019,
  "mediaId": 675,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "Candid reflections on the COVID vaccines",
  "image": "https://www.wnd.com/wp-content/uploads/2021/10/vaccine-vaccination-shot-medicine-2-Pixabay.jpg",
  "link": "https://www.wnd.com/?p=4975259",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Brown",
  "authorUrl": "https://www.wnd.com/author/michaelbrown/",
  "termIds": [
    1702,
    1702
  ],
  "sentences": [
    "In the end, because of my 100% commitment to healthy living and eating, dating back to Aug. 24, 2014 (without any deviation from that healthy routine for a single day since then), I was advised not to be vaccinated given the strength of my immune system and my overall vibrant health.",
    "Politics\nCommentary\nBrent Smith\nJoseph Farah\nBarbara Simpson\nMichael Brown\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nCOMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Accordingly, I find it abhorrent when people mock its reality  a tendency I find primarily in our conservative circles  as if it were some kind of phantom virus or creation of the media or the government or nothing more than the flu.",
    "And I know pastors who felt that the Lord told them not to yield to fear but to go on with their public services, and in two years, they have not had a significant COVID outbreak of any kind.",
    "When it comes to the vaccine, a friend and I were recently comparing notes, and of the several dozen people we know who have died of COVID, to our knowledge, not one of them was vaccinated.",
    "\"As Bill Gates noted in the New England Journal of Medicine on Feb. 28, 'In the past week, Covid-19 has started behaving a lot like the once-in-a-century pathogen we've been worried about.'",
    "Yet there are pro-vaxxers who use reports of the latest COVID death as their personal bully pulpit, with posts like, \"Well, your friend wouldn't have died if he had been vaccinated!\"",
    "Yet I am terribly grieved over the divisions in the Body of Christ over the vaccines, with some accusing the vaccinated of lacking faith or branding mask-wearers as spiritual wimps.",
    "And my own experience with it, finally contracting COVID on Dec. 26 and spending a day in the hospital earlier this week, underscores to me how virulent this coronavirus is.",
    "Although I myself have not been vaccinated (more on that shortly), I have never been remotely anti-vax, nor have I ever downplayed the lethal nature of the coronavirus.",
    "Yet, because many people look to me for guidance in life-and-death matters, when I do not feel confident that I can give a definitive answer, I refrain from doing so.",
    "He told me that 95% of the COVID victims fighting for their lives in that facility were not vaccinated, while the 5% who were vaccinated had severe co-morbidities.",
    "That being said, watching other friends die over these months and now having to recover from COVID myself, I continue to wrestle with the question of vaccination.",
    "And what about those documented cases where otherwise healthy people have died of blood clots (or related conditions) within hours or days of getting vaccinated?",
    "And even at this early stage, 'Covid-19 has already caused 10 times as many cases as SARS [severe acute respiratory syndrome] in a quarter of the time.'\"",
    "Added to this is the draconian nature of the vaccine mandates, not to mention their apparent illegality, and everything becomes more complex still.",
    "Plus, my doctor had already prescribed ivermectin for me, along with some other recommended supplements, in the event that I did contract COVID.",
    "But I am also grieved at those who pass judgment on the unvaccinated rather than recognizing that these are complex and difficult issues.",
    "That's why I remained quiet about my personal choices until now, not wanting to influence others either way when I was not sure myself.",
    "And I watched how a large number of my friends and co-workers contracted COVID and were back to normal in a matter of days or weeks.",
    "On the other hand, there remain many serious concerns with the vaccines, concerns raised by leading scientists and doctors.",
    "And, during these last two years, I have been in many crowds of multiple thousands, standing together in close quarters.",
    "(The blood tests for my annual physical can be as many as 35 pages long, so my health is very carefully analyzed.)",
    "And as I write these words, another colleague is fighting for his life, now on a ventilator and needing a miracle.",
    "He was a very strong anti-vaxxer but told his wife before being sedated that he now wished he had been vaccinated.",
    "As I wrote in my very first article on COVID, on March 2, 2020, \"There is no denying the seriousness of the virus.",
    "Do we simply dismiss them out of hand, especially when they have nothing to gain by raising their concerns?",
    "When people make such statements, they mock the memory of the dead and ridicule the pain of the mourning.",
    "Who gave you the right to criticize those who feel it is important to act with extreme care and caution?\"",
    "While in the hospital this week, I had a candid conversation with a totally non-judgmental doctor.",
    "Let us, at least, walk with respect and grace toward those who hold to different perspectives.",
    "As to why I was not vaccinated before, I weighed the issues carefully, as did my wife, Nancy.",
    "I also consulted my primary care physician and got advice from some other top doctors.",
    "I have lost far too many friends to COVID to minimize the threat of this foul virus.",
    "Would some of their precious lives have been saved if they had been vaccinated?",
    "This is very troubling and, in my view, cannot be lightly brushed aside.",
    "And rather than throwing stones at others, let's offer a helping hand.",
    "And let us be vigilant and diligent to preserve our own health.",
    "And what are we to think when social media bans their material?",
    "Who anointed you the arbiter and judge of the faith of others?",
    "Doesn't this only underscore the warnings they are bringing?",
    "It appears that my immune system had been doing quite well.",
    "To those who mock, I ask, \"Who appointed you God and Lord?",
    "(Thankfully, I have finally developed natural immunity.)",
    "Why simply venture an opinion on something so critical?",
    "So, I was prepared in the event of getting sick.",
    "Shall we tell them their own faith is not real?",
    "Right now, America and the nations are hurting.",
    "If we ever needed to work together, it is now.",
    "And human suffering continues to increase.",
    "And they do this in Jesus' name, at that.",
    "How many similar stories have we heard?",
    "The death toll continues to rise.",
    "Confusion continues to dominate.",
    "Why so little reporting on this?",
    "What kind of madness is this?",
    "What a cruel game to play!",
    "Not for a second.",
    "Please."
  ]
}