{
  "id": 1035,
  "mediaId": 675,
  "date": "1/1/2022 12:00:00 AM",
  "headline": "Republican aims to shake up California's spending",
  "image": "https://www.wnd.com/wp-content/uploads/2021/05/hollywood-sign-california-celebrities-famous-TV-movies-films-pixabay.jpg",
  "link": "https://www.wnd.com/?p=4971646",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    971,
    1078,
    1394,
    1624,
    1761,
    1951,
    2090,
    2095,
    2171,
    2250,
    2416,
    2465,
    4325,
    146,
    417,
    428,
    2590,
    2661,
    2672
  ],
  "sentences": [
    "I don't think what I'm proposing is particularly controversial.?\nPolitics\nCommentary\nJoseph Farah\nPatrice Lewis\nBrent Smith\nPreBorn Americans United\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nCraige McMillan\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Officials' inability to rein in waste and abuse cost the state and federal government more than $30 billion in unemployment payments to prisoners and other fraudsters while millions of workers forced out of their jobs by Newsom's lockdowns either waited months for their money or never received it.",
    "I felt like the state wasn't managed very well.?\nIt's a sun-drenched 72-degree late-December day, and Chen has agreed to meet me in a lobby restaurant at La Valencia, a luxury Mediterranean-style hotel built in 1926 and known as the pink lady? of La Jolla, a tony enclave north of San Diego.",
    "They're looking for someone to come in with the right experience and fresh ideas.?\nInstead of simply throwing more money and government workers at the problem, Chen wants to recruit high-tech experts from Silicon Valley to implement innovative technology solutions in a timely manner.",
    "More than 10 years ago, an auditor recommended major improvements to the unemployment system to avoid the same type of widespread fraud that has occurred over the last two years, but no state elected leader, including the controller, made sure those steps were taken.",
    "Building on his public policy experience, Chen says he's learned critical real-life business lessons while serving as chairman of the board of directors of El Camino Health, a group of hospitals, urgent care and primary care centers based in Northern California.",
    "In October, the California Department of Public Health renewed a no-bid $1.7 billion annual contract for a COVID testing lab despite an inspection report documenting myriad problems, including failing to meet the contract's turnaround times and number of tests.",
    "You don't need to be a rocket scientist to figure out that if you're going to hire a state employee, they darn well better live in the state of California.?\nChen also is eager to scrutinize the state's spending on fighting wildfires and curbing homelessness.",
    "People aren't coming here anymore because they don't see opportunity  plain and simple.?\nBut instead of just complaining about it, Chen feels compelled to try to fix it, so his own young children have some of the same opportunities he and his parents did.",
    "It's the controller's job to say, Listen, if you didn't go through the proper bidding the law requires, you cannot legally award this contract  and by the way, I'm not going to pay the contract because you didn't bid for it in the right way,'? Chen says.",
    "Despite the long odds against him, Chen believes many voters are more open to a Republican for this role to provide some accountability and fiscal sanity? after a series of state management failures and contracting scandals during the COVID pandemic.",
    "Earlier this month, Daniel Lee, the California schools superintendent of equity, resigned after news reports that he lives in Philadelphia, has no background working in any school system and is close friends with schools Superintendent Tony Thurmond.",
    "Is the problem getting better or worse??\nSomeone needs to put their foot down, and my point is no one is right now,? Chen asserts, arguing that too many controllers in recent years have had limited or no experience in the private sector.",
    "By Susan Crabtree\nReal Clear Politics\nLanhee Chen, an educator and GOP policy adviser to presidential candidates, could have reconsidered his plans to run for state controller in California after the recall election against Gov.",
    "In recent years, the statewide-elected controller post, California's top bean-counter and auditor, has mainly operated outside the media spotlight even though the office holder is considered the state's chief financial officer.",
    "He's also the rare California political candidate who has served in both the George W. Bush and Barack Obama administrations (as a senior health care official and a member of the Social Security Advisory Board, respectively).",
    "Despite false poll-driven drama over the summer, Newsom easily sailed to victory in a state where Democrats outnumber Republicans nearly two to one and Republican registrations have continued to dwindle in recent years.",
    "Chen says he's undaunted by the challenge and has been yearning for a more direct public policy role since he and his wife moved back to the Golden State after Romney's unsuccessful White House run in 2012.",
    "A lawyer and former presidential campaign policy adviser to Mitt Romney and Marco Rubio, Chen teaches public policy at Stanford University and serves as a fellow at the prestigious Hoover Institution.",
    "The son of immigrants from Taiwan who earned their citizenship through a medical training program, Chen grew up in the San Gabriel Valley watching his parents work hard to attain the American dream.",
    "Chen decamped from Washington, D.C., to the Bay Area nine years ago, though he's still well-known inside the Beltway for frequent appearances on NBC's Meet the Press? and other political news shows.",
    "Chen will face off against Malia Cohen, the former San Francisco supervisor who serves on the state Board of Equalization, a public agency charged with tax administration and fee collection.",
    "House Minority Leader Kevin McCarthy, along with most elected Republicans across the state, have endorsed Chen for the role, helping him to amass a more than $1 million campaign war chest.",
    "If elected, Chen plans to scrutinize the financial books of every state agency and assign letter grades based on fiscal management and compliance with reporting requirements.",
    "State officials admitted they hired Lee without posting the position first or getting public input, a violation of hiring rules, although they claimed to be unaware of them.",
    "He also aims to set up a website where all Californians can search state contracts posted in real time to see who is getting the money and how it's being used.",
    "We should be getting the best minds in fraud prevention, in artificial intelligence, in coding and programming to help us solve this problem,? he says.",
    "You [should] have checks and balances.?\nAmid California's strict pandemic policies, a series of government failures have harmed millions of residents.",
    "Cohen, a telegenic black woman, has the public backing of House Speaker Nancy Pelosi, Yee and nearly every top elected Democrat in California.",
    "Still, running as a Republican in Democrat-dominant California is no easy feat; no GOP candidate has won statewide office in 15 years.",
    "That could change if the next controller is willing to shake up business as usual in Sacramento exactly what Chen is pledging to do.",
    "Let's figure out what's working and what's not and double down on what's working and stop spending money on what's not,? he says.",
    "The controller position is open next year for the first time since 2014 when term-limited Democrat Betty Yee was first elected.",
    "It's a perfect office  to have somebody serve whose political interests are not aligned with everybody else,? Chen says.",
    "Just last week, the San Francisco Chronicle called the race one to watch next year to gauge national voter sentiment.",
    "The guy who's watching over the checkbook should not have the same interests as the person spending the money.",
    "The California we came back to wasn't the same California where I grew up,? Chen tells RealClearPolitics.",
    "There's an exquisite panoramic view of the Pacific Ocean framed by palm trees just over Chen's shoulder.",
    "These academic positions have helped insulate him from the usual Trump-era loyalty tests.",
    " That's not going to solve the problem.?\nOther management scandals have come to light.",
    "We've spent $2 [billion] to $3 billion on homelessness over the last couple of years.",
    "[Editor's note: This story originally was published by Real Clear Politics.]",
    "Chen, 43, certainly doesn't need the unglamorous and usually thankless job.",
    "You have people who are deeply upset about the status quo,? Chen says.",
    "The agency has only implemented a small fraction of them, Chen notes.",
    "Just last year, another auditor recommended a long list of reforms.",
    "He also worked on the nonprofit's compliance and audit committee.",
    "Is the money we're spending actually getting to our firefighters?",
    "Are we getting them the equipment they need?? he asks.",
    "Again, it's about oversight, right?? Chen tells RCP.",
    "Why are we doing our best to chase people away?",
    "Chen has also vowed to crack down on cronyism.",
    "It's beautiful, right?? he asks rhetorically.",
    "Life opportunities are much more constrained.",
    "Gavin Newsom flopped so badly in September.",
    "Why would you want to live anywhere else?",
    "But what's the typical Sacramento answer?",
    "Let's [hire] more government employees.",
    "We've got so many natural advantages.",
    "Why are we squandering them?",
    "Time is also of the essence.",
    "It's pretty basic."
  ]
}