{
  "id": 3295,
  "mediaId": 675,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "The hunting and harassment of a conservative campus coed",
  "image": "https://www.wnd.com/wp-content/uploads/2022/05/unt-texas.jpg",
  "link": "https://www.wnd.com/2022/05/hunting-harassment-conservative-campus-coed/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michelle Malkin",
  "authorUrl": "https://www.wnd.com/author/mmalkin/",
  "termIds": [
    2171,
    2250,
    2517,
    3044,
    428,
    539,
    3000,
    2934
  ],
  "sentences": [
    "Armed with a megaphone, MAGA hat and the armor of God, Kelly shouted from the rooftops in opposition to COVID-19 lockdowns; held a Bible verse Easter egg hunt that triggered anti-Christian vitriol online and in real life; and upheld true ideological diversity on campus by bringing prominent dissidents to speak.",
    "Instead of holding stodgy, insular meetings conducted in hushed tones debating arcane tax law with wannabe GOP swamp creatures who look down their noses at rabble-rousing, grassroots activists, Kelly put herself on the front lines of the campus culture wars.",
    "The same allergic reaction to free speech and alternative thought was repeated again last week when Neidert invited conservative Christian family activist Tracy Shannon to warn about the alphabet mafia's trans therapy coercion techniques.",
    "Pretty pathetic state of affairs, isn't it, when the multibillion-dollar funded \"conservative movement\" over the past 30 years outsources its job to a foreign tech mogul who has only recently awakened to woke tyranny?",
    "In February, she invited Jeff Younger, the Texas Army vet and father who made international headlines battling his ex-wife in court over her plans to turn their 7-year-old son into a girl, for a campus event.",
    "Having faced escalating threats and intimidation from a profane and godless student mob of intolerant liberals over the past two years, Kelly told me she is \"hesitant\" to receive her diploma on May 13.",
    "But for Kelly Neidert, a firebrand campus conservative and marketing major at the University of North Texas in Denton, commencement is no ordinary rite of passage filled with joy and laughter.",
    "Betsy McCaughey\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nMichael Brown\nLarry Elder\nRead all of today's COMMENTARY...\nNew Section",
    "\"I had to hire security for myself and my activist partner for the event because I have zero confidence in the university protecting free speech on campus,\" Shannon told me.",
    "Meanwhile, leftist students and the local antifa cell will show up to events with instruments, air-horns, megaphones, etc., literally drowning out my speaking.\"",
    "\"My story has been in the news cycle on and off since July of 2020,\" she points out, \"but Greg Abbott has never once spoken about it or publicly supported me.",
    "Younger, who vows to ban transgender sexual abuse of children in the school and courts, will be on the May primary runoff ballot for a statehouse seat.",
    "Most graduating college seniors in America are in high spirits this month as they prepare for cap-and-gown ceremonies and extended family celebrations.",
    "Kelly revived a local chapter of the Young Conservatives of Texas, which broke off from the establishment-run Young Americans for Freedom decades ago.",
    "A woke vigilante, caught on security camera video, stalked her off-campus apartment and spray painted the phrase \"Stay home Nazi C-\" on her door.",
    "On Monday, Kelly was notified by Twitter that her account had been locked for violating \"community standards\" against violence and hatred.",
    "After graduation, she will lead a new grassroots group, Protect Texas Kids, to \"help combat the indoctrination in K-12 schools.\"",
    "When these capitulationist Republicans publicly denounce us, the left feels even more justified in their attacks against us.\"",
    "After a Daily Beast hit piece against her and her conservative twin brother, \"leftists started trying to go after my parents.",
    "A Change.org petition signed by more than 20,000 loons has called on the university to expel Kelly for her campus activism.",
    "\"Capitulationist Republicans are the biggest enemy to Christian conservatives who stand up to the woke mob,\" Kelly told me.",
    "\"The university denied YCT a room for the event, the first time in history a room was denied for safety concerns.\"",
    "One leftist Twitter account posted a satellite image of my parent's house, while others tried to get them fired.\"",
    "\"If I do walk for graduation,\" Kelly told me, \"I will require a private security team to ensure that I am safe.\"",
    "The 22-year-old Denison, Texas, native transferred to UNT in from a small conservative Baptist college in 2019.",
    "\"I had a TikTok dedicated to exposing what goes on at my university and that was banned at 65,000 followers.",
    "Do University of North Texas alumni and donors give a damn about the witch hunt against this brave gal?",
    "This caused literal satanic witches to cast a \"hex\" on the new group with \"intentions of misfortune.\"",
    "Hysterical tantrum-throwers shut down the event and forced Neidert to retreat to a janitor's closet.",
    "I reached out to University of North Texas President Neal Smatresk multiple times seeking comment.",
    "I am hopeful that Twitter will be more fair about free speech since Elon Musk is taking over.\"",
    "Greg Abbott, a self-styled champion of free speech, online and by phone as well.",
    "At that point I knew that there needed to be a conservative presence on campus.\"",
    "I know exactly of what she speaks, having endured and exposed it for 30 years.",
    "\"They fight for the left, but the left will absolutely never fight for them.",
    "Politics\nCommentary\nJack Cashill\nLt. Col. James Zumwalt\nJane M. Orient, M.D.",
    "My message to Abbott is to stop talking and actually do something about it.",
    "The only violence in her tweets was the violence and hatred of her enemies.",
    "\"When I saw how far left the UNT campus was, I was honestly shocked.",
    "Her simple advice to future conservative activists:\n\"Raise hell.\"",
    "It was a \"huge culture shock,\" she recounted on Monday.",
    "Will any adults in Texas step up to the plate?",
    "And boy, did she establish a presence.",
    "Her website is protecttxkids.org.",
    "I reached out to Texas GOP Gov.",
    "Neidert refuses to back down.",
    "No response.",
    "Zilch.",
    "Hello?",
    "Nada.",
    "Zip."
  ]
}