{
  "id": 3297,
  "mediaId": 239,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Reform-minded leaders now at the helm in St. Louis",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/04/06/st._louis-mayor_18580_c0-768-2512-2232_s885x516.jpg?4af0d64ced74ded00191218aaa66f34625054913",
  "link": "https://www.washingtontimes.com/news/2021/apr/9/reform-minded-leaders-now-at-the-helm-in-st-louis/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JIM SALTER",
  "authorUrl": "",
  "termIds": [
    2171
  ],
  "sentences": [
    "The association's president, Jay Schroeder said in a statement that it is committed to working with anyone else willing to do the hard work of making this city a better, safer place to live.?\nGardner was elected on a platform similar to Jones' and has been at odds with the law enforcement establishment virtually since taking office.",
    "Jones joins Kim Gardner, 46, who was elected circuit attorney in 2016 and easily re-elected last year - and racial justice activist Cori Bush, 44, who pulled a stunning upset last year in ousting longtime Congressman William Lacy Clay in the district that includes all of St. Louis.",
    "She was first elected in November 2016 after campaigning to rebuild trust in the criminal justice system at a time when the region was still healing from unrest that followed the fatal police shooting of a Black teenager, Michael Brown, in nearby Ferguson two years earlier.",
    "The hyper-segregation, the racist policies that have existed in our government systems, the systemic racism  these are things we have to address head-on in order to move forward.?\nJones is a former Democratic state representative who has been the city treasurer since 2013.",
    "ST. LOUIS (AP) - The daunting task of turning around the fortunes of St. Louis is now in the hands of a new era of leaders - specifically, three 40-something progressive Black women, all of them elected on a mandate of racial justice and change.",
    "That includes trust within the department, she said, noting that while the majority of officers are members of the St. Louis Police Officers Association, about 260 mostly Black officers have their own association, the Ethical Society of Police.",
    "New mayor Tishaura Jones, 49, will become the city's first Black female to lead the city when she's sworn in on April 20 and will be working with a Board of Alderman that includes four new members from a progressive slate elected on Tuesday.",
    "Unlike many cities, St. Louis is still struggling with how to successfully dissolve those ancient chains.?\nSt. Louis is nearly evenly split between white and Black residents where whites make up 48% of the population and Blacks 45%.",
    "She also angered police by developing a list of officers who weren't allowed to bring cases to her office after a national group accused the officers of posting racist and anti-Muslim comments on social media.",
    "Webster University political science adjunct professor Bill Hall said St. Louis voters clearly aren't happy with the status quo in a city with a declining population and one of the nation's worst murder rates.",
    "If they can't trust each other, how can they expect the public to trust them??\nSt. Louis Police Officers Association business manager Jeff Roorda has been an outspoken critic of both Gardner and Jones.",
    "Voters using the city's new nonpartisan election format in the March primary advanced Jones and Alderwoman Cara Spencer, another reform-minded progressive, to Tuesday's general election.",
    "Jones' plans are similar to the policing changes pushed by Bush and Gardner, and critics have questioned how a city with so much violence can consider scaling back policing.",
    "She wants treatment, rather than punishment, for drug users, and more emphasis on social service programs to help the neighborhoods with the highest crime rates.",
    "Jones' reform efforts will be aided by the election of four new progressive aldermen, the result of a flip the board? campaign led by Alderwoman Megan Green.",
    "She said progressives now make up a majority of the 28-member board, and she's hopeful St. Louis can become a trendsetter on major criminal justice reforms.",
    "Jones called it the number-one issue that holds us back.?\nAt the heart of Jones' reform plan is a major rethinking of the city's criminal justice system.",
    "For example, police may see the benefit in sending social workers, rather than officers, to some calls involving the homeless, Rosenfeld said.",
    "She said the city must address the elephant in the room  how we still have separate police unions for Black officers and white officers.",
    "In 2017, Roorda, on Facebook, called Jones a lazy cop-hater? and race-baiter.? Jones says Roorda has to go.?\nRoorda declined comment.",
    "I'm the most optimistic that I've been in a long time probably since being in elected office,? Green, who took office in 2014, said.",
    "Despite the tensions, University of Missouri-St. Louis criminologist Rick Rosenfeld believes police may be open to some changes.",
    "Jones also has raised the possibility of replacing Police Chief John Hayden, who was hired by outgoing Mayor Lyda Krewson.",
    "I think the voters have spoken that this is the kind of leadership that they want to see,? Jones said in an interview.",
    "Gardner has stopped prosecuting non-violent crimes and low-level drug cases, and ended the cash bail system.",
    "But racial segregation has dogged St. Louis virtually throughout its existence.",
    "She has vowed to end St. Louis' arrest and incarcerate? model of policing.",
    "Louis, not unlike other cities, has a history of segregation,? Hall said.",
    "Krewson, a moderate Democrat, opted not to seek a second term.",
    "I think there are good things to come for St. Louis.?",
    "Jones cited a need to re-establish trust in police.",
    "St."
  ]
}