{
  "id": 4217,
  "mediaId": 675,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "'Ban the sex change': Governor wants to outlaw child-gender switches",
  "image": "https://www.wnd.com/wp-content/uploads/2022/04/children-baby-babies-abortion-hopeful-fingerpaint-colors-face-smiing-playing-happy-fun-unsplash.jpg",
  "link": "https://www.wnd.com/?p=5002430",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    2171,
    4571,
    2661
  ],
  "sentences": [
    "Ron DeSantis said he would support banning child sex change operations in Florida in a Monday podcast interview on The Truth With Lisa Boothe.?\nDeSantis said it was unhealthy to let children permanently alter their bodies through operations such as mastectomies and castration, and that there appeared to be an organized effort to push children into these extreme forms of medical intervention.",
    "When they say gender-affirming care, what they mean a lot of times is you are really, youre castrating a young boy, youre sterilizing a young girl, youre doing mastectomies for these very young girls.?\nIt seems like theres a concerted effort in society to push these kids in, to do some type of medical intervention, and in our judgement thats not healthy,? he added.",
    "When they say gender-affirming care, what they mean a lot of times isyoure castrating a young boy, youre sterilizing a young girl?\nFull interview: https://t.co/OBnBigUEBW pic.twitter.com/lpM4zcx9Tt\n Lisa Boothe (@LisaMarieBoothe) May 2, 2022\nYeah, I would ban the sex change  the operations,? DeSantis told Boothe.",
    "Health\nCommentary\nScott Lively\nMychal Massie\nRachel Alexander\nRead all of today's COMMENTARY...\nMoney\nPolitics\nFaith\nU.S.\nDiversions\nEducation\nWorld\nMORE COMMENTARY\nMichael Brown\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "DeSantis has also fought against transgender ideology in athletics, banning males from womens sports in 2021 and declaring Emma Weyant the true winner of the Womens NCAA 500-yard freestyle race March 22 after she lost to transgender athlete Lia Thomas.",
    "I dont think its appropriate for kids at all.?\nDeSantis signed legislation banning classroom instruction on gender identity and sexual orientation in kindergarten through third grade March 28.",
    "DeSantis also pointed out that the majority of young people with gender dysphoria naturally grow out of it by the time they reach adulthood, making permanent operations inappropriate.",
    "He defended the new law in a public feud with Disney which ended with the company losing its special self-governing district and stepping back from politics.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "And so youre doing things that are permanently altering them and then theyre not going to be able to reverse that,? he said.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "@GovRonDeSantis: I would ban the sex changeyou cant get a tattoo if youre 12 years old.",
    "I think that its something that you cant get a tattoo if youre 12 years old.",
    "For these young kids, 80% of the cases resolve themselves as they grow up.",
    "This story originally was published by the Daily Caller News Foundation.",
    "He said he would support a bill banning these procedures for children.",
    "By Laurel Duggan\nDaily Caller News Foundation\nRepublican Florida Gov.",
    "."
  ]
}