{
  "id": 627,
  "mediaId": 675,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "RNC votes to censure Cheney, Kinzinger over campaign against Trump",
  "image": "https://www.wnd.com/wp-content/uploads/2021/05/liz-cheney-2021-jpg.jpg",
  "link": "https://www.wnd.com/?p=4980094",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    2465,
    2465,
    2214,
    2214,
    1248,
    1335,
    1335,
    1248,
    1147,
    1147,
    427,
    428,
    427,
    562,
    562,
    428,
    2976,
    2976
  ],
  "sentences": [
    "She simply called the Jan. 6, 2021, riot at the U.S. Capitol an \"insurrection,\" blamed it on President Trump, who had held a rally earlier in the day, concluded he was guilty, and insisted Congress remove him from office, even though his term already had expired.",
    "Politics\nCommentary\nPatrice Lewis\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nLaura Hollis\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Yahoo News said Kinzinger's response was, \"Rather than focus their efforts on how to help the American people, my fellow Republicans have chosen to censure two lifelong members of their party for simply upholding their oaths of office.\"",
    "The resolution charges that the actions of Cheney and Kinzinger on Pelosi's special partisan committee assigned to \"investigate\" the riot actually is \"persecution of ordinary citizens engaged in legitimate political discourse.\"",
    "There, however, the state party already has stripped her of party recognition and a straw poll among county GOP officials snubbed her recently, with six votes for Cheney and 59 for primary challenger, Harriet Hageman.",
    "Pelosi's committee, which has made clear its goal is less to discover what happened at the riot than to pin blame on Trump, is partisan because Pelosi refused to seat several members nominated by the minority GOP.",
    "Their open dislike for and opposition to the last, and possibly next, GOP president on Friday earned GOP Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois a censure from the Republican National Committee.",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants,\" Cheney claimed.",
    "The two voted for President Trump's impeachment at the end of his first term, an impeachment hastily assembled by House Speaker Nancy Pelosi who did not allow time to assemble evidence or facts.",
    "Some Democrats have essentially admitted that the entire campaign was a pretext to try to find some way to make sure Trump does not run in 2024, which he has not confirmed he will do.",
    "Utah Sen. Mitt Romney, a longtime critic of President Trump, said, \"Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "RNC officials earlier had told reporters some members wanted to expel Cheney and Kinzinger and the censure move was a resolution to that.",
    "Cheney lashed out at the party that put her in Congress, and made her father vice president under George W. Bush.",
    "The party said it now would \"immediately cease any and all support of them as members of the Republican Party.\"",
    "The resolution was adopted during the group's winter meetings in Salt Lake City, and came on a unanimous vote.",
    "A national committeeman from Maryland, David Bossie, said the dispute was \"not about dissenting views.",
    "He has, however, publicly stated his fans will be very happy with his decision, when it is announced.",
    "Instead, she picked the anti-Trump Cheney and Kinzinger to be the \"Republicans\" on the committee.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "USA Today noted the move shows how Trump \"has maintained his grip on the party.\"",
    "Kinzinger is not seeking reelection but Cheney is in her state of Wyoming.",
    "This is about them helping [House Speaker] Nancy Pelosi.\""
  ]
}