{
  "id": 6554,
  "mediaId": 151,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Prominent lawmaker in racial justice protests lags in Kentucky Dem primary",
  "image": "https://www.politico.com/dims4/default/39ca649/2147483647/legacy_thumbnail/1200x798%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F66%2F7d%2Fefaef9c04dfc9cbbbb5246767c1c%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1236694898",
  "link": "https://www.politico.com/news/2022/05/17/house-primary-democrats-kentucky-00033056",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2171
  ],
  "sentences": [
    "I'm the only candidate in this race who actually has been part of social justice movements, Scott told POLITICO, adding that only one of us is having that conversation.\nShe also says it's a convenient narrative by those who say she can't build coalitions  it glosses over the multiple elections she's won to the Louisville city council and General Assembly.",
    "Though it drastically limited the use law enforcement being able to enter a residence without notice  and mandated that an EMT be onsite to provide medical assistance if one is performed  Scott railed against it for not going far enough, arguing it was a clear slap in the face to her and others who pushed for the tougher law.",
    "It also means [she's] coming from a community [where] we don't have, like a political machine, or sustained political engagement by our people.\nAccording to the most recent census figures Louisville is nearly 72 percent white, while Black residents make up around 22 percent.",
    "| Jon Cherry/Getty Images\nBy Brakkton Booker\n 05/17/2022 12:31 PM EDT\nAttica Scott was part of a group of activists who took to the streets in September 2020 after a grand jury decision to not directly charge Louisville police officers for the killing of Breonna Taylor.",
    "A registered nurse and Black Lives Matter activist, Bush was able to capitalize on the renewed fervor and energy of nationwide protests calling for greater police accountability six years later, utilizing an insurgent campaign to knock off then-Rep. Lacy Clay.",
    "If she falls short, it will be a reminder that the period of racial reckoning that followed the police killings of George Floyd, Taylor and others have not necessarily translated into political wins for the activists on the front lines.",
    "Palmer has criticized the lawmaker, telling USA Today that she found Scott's comments about legislation that bore her daughter's name disrespectful. She also referred to Scott as a fraud in a now-deleted Facebook post.",
    "Arthur, like Scott, represents Louisville's West End, where he says the community's majority Black population is still learning how to harness its political might following the social justice protests a few years back.",
    "Without its full support in the primary  and that includes Tamika Palmer, Breonna Taylor's mother, who declined to endorse Scott last summer when she announced her candidacy  Scott has struggled to gain traction.",
    "On the flip side, Attica Scott, in some cases, is known as someone who hasn't built coalitions, said Jecorey Arthur, a member of the Louisville Metro Council, who has not has not endorsed either candidate.",
    "As the Democratic minority leader in the state Senate, McGarvey has positioned himself as someone who can forge relationships and work across the aisle in the Republican-controlled legislature.",
    "Scott, who is backed by progressive groups including the Progressive Change Campaign Committee and Higher Heights for America PAC, would go further, and has advocated defunding the police.",
    "The incident touched off weeks of protests that turned violent, sparking conversations about racial inequality, police violence and the growing militarization of local law enforcement.",
    "If elected Scott would make history by becoming Kentucky's first Black member of Congress  it's one of 20 states that have never elected or appointed an African American to Congress.",
    "Chief among them is her relationship with the activist community in Louisville, which two years ago saw some of the most sustained protests during the push for racial reckoning.",
    "McGarvey says he supports federal law enforcement reform, adding he would support the George Floyd Justice in Policing Act, which would limit qualified immunity for officers.",
    "One longtime Democratic analyst, former Secretary of State Bob Babbage, said Scott can't be counted out in a state where an 80-1 favorite won the Kentucky Derby 10 days ago.",
    "Kevin Cosby of Simmons College of Kentucky and recently-elected state Rep. Keturah Herron, a longtime social justice advocate who appeared in a McGarvey campaign ad.",
    "While McGarvey amassed a war chest of more than $1.5 million, according to the most recent campaign finance disclosures, Scott had a little more than $236,000.",
    "McGarvey's benefited from the support of cryptocurrency super PAC Protect our Future that spent roughly $1 million in support of McGarvey's candidacy.",
    "But in the primary for the seat left vacant by the retirement of veteran Rep. John Yarmuth, Scott's path has been strewn with a number of obstacles.",
    "He also boasts several key endorsements, including that of Yarmuth, the House Budget Committee chair who has represented the district for 15 years.",
    "In 2016 she bested a longtime state House incumbent to become the first Black woman to be elected to the legislature in 20 years.",
    "Bush built her profile in the aftermath of the shooting death of Michael Brown, who was killed by a white police officer in 2014.",
    "Yet in the Louisville-based 3rd District Democratic primary, Scott is viewed as a longshot against state Sen. Morgan McGarvey.",
    "But equally important, McGarvey, who is white, has received the backing of prominent Black leaders in the city including Rev.",
    "Rep. Attica Scott gives a speech outside of the Hall of Justice during the Reject the Verdict rally in Louisville, Kentucky.",
    "Both support key items on the progressive agenda, including Medicare For All and decriminalizing and legalizing marijuana.",
    "So did her subsequent legislative push to outlaw no-knock warrants like the botched one that led to Taylor's shooting.",
    "As a Kentucky state legislator, her arrest during protests calling for criminal justice reforms drew national notice.",
    "Scott has also struggled to keep pace with McGarvey in fundraising  she's been outraised by a roughly 6-to-1 margin.",
    "Her bill, dubbed Breonna's Law, was ultimately scuttled in favor of a bill sponsored by a Republican state senator.",
    "It's a blueprint similar to the one that got Ferguson activist Cori Bush elected to Congress from Missouri in 2020.",
    "It's something he touts as a useful skill if Democrats lose their grip on the House majority in the next Congress.",
    "Scott, a former member of the Louisville Metro Council, has a history of toppling incumbents herself.",
    "That measure, hailed as a step in the right direction, was signed into law by state's Democratic Gov.",
    "In the wake of Taylor's killing, Scott led a push to outlaw all no-knock warrants in the state.",
    "That characterization is part of the reason Taylor's family has been at odds with Scott.",
    "But, he added, the political oddsmakers have McGarvey as the overwhelming favorite.",
    "Andy Beshear, who was joined by members of Taylor's family at the bill signing.",
    "On the issues, there isn't much daylight between Scott and McGarvey.",
    "She's at a disadvantage just based on that alone, Arthur adds.",
    "As a lawmaker, her legislative record has won her notice.",
    "One notable area where they differ is on police reform."
  ]
}