{
  "id": 7211,
  "mediaId": 675,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "FLASHBACK: Here's why gas is up $2 since Biden took office",
  "image": "https://www.wnd.com/wp-content/uploads/2022/05/gas-pump-car-Unsplash.jpg",
  "link": "https://www.wnd.com/2022/05/flashback-gas-2-since-biden-took-office/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    1448,
    1805,
    2030,
    2087,
    2171,
    146,
    473,
    2888,
    2942
  ],
  "sentences": [
    "While the Biden administration continues to insist the record high prices at the gas pump are largely due to Russia's invasion of Ukraine, a video montage of the president's vows during the 2020 campaign to crush the industry that provides the vast majority of energy, along with his actions on his first day in office, suggest there are other factors in play.",
    "Watch this.pic.twitter.com/X5tcDOPtT8\n RNC Research (@RNCResearch) May 19, 2022\nBiden's campaign later clarified that \"eliminating\" oil-based energy meant ending subsidies for the industry and transitioning by 2050 to an economy with net-zero emissions.",
    "See Biden's remarks on March 31:\nBiden on March 31: Gas prices will \"continue to come down ... it will come down and it could come down fairly significantly\"\nGas prices just reached a new record high for the 9th day in a row.",
    "pic.twitter.com/8quZblf5pQ\n RNC Research (@RNCResearch) May 18, 2022\nContent created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "On March 31, Biden announced his decision to release oil from the Strategic Petroleum Reserve, promising prices at the pump would \"continue to come down ... it will come down and it could come down fairly significantly.\"",
    "In a July 2019 primary debate with his Democratic Party opponents hosted by CNN, Biden was asked, \"Would there be any place for fossil fuels, including coal and fracking, in a Biden administration?\"",
    "Politics\nDiversions\nFaith\nMoney\nHealth\nU.S.\nEducation\nMORE COMMENTARY\nBarbara Simpson\nLt. Col. James Zumwalt\nDaniel Joseph\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "On Thursday, however, Sen. Josh Hawley, R-Mo., tied the president's policies to the record-high gas prices in an exchange with Secretary of Energy Jennifer Granholm.",
    "Biden also affirmed that he would be willing to sacrifice economic growth and thousands of blue collar jobs to hasten the transition to alternative energy.",
    "Hawley argued that long before the Russian invasion  from January to August of 2021  \"the price of gasoline was up over 30% in my state alone.\"",
    "Economists warned that the move could make gas even more expensive, and less than two months later, the average gas price has surged to $4.59.",
    "If you appreciate our Christian journalists and their uniquely truthful reporting and analysis, please help us by becoming a WND Insider!",
    "In conversations with individual voters on the campaign trail, he promised to \"end fossil fuels\" and stop fracking and new pipelines.",
    "See the montage of Biden's condemnation of the oil industry:\nWondering why gas is up $2 since Biden took office?",
    "World\nCommentary\nPatrice Lewis\nBrent Smith\nCraige McMillan\nWayne Allyn Root\nRead all of today's COMMENTARY...",
    "He issued a 60-day halt on all new oil and gas leases and drilling permits on federal lands and waters.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "\"He directed federal agencies to eliminate all supports for fossil fuels,\" Hawley continued.",
    "If you like WND, get the news that matters most delivered directly to your inbox  for FREE!",
    "Granholm told Hawley \"you can thank the activity of Vladimir Putin for invading Ukraine.\"",
    "The senator shot back: \"With all due respect, madam secretary, that's utter nonsense.\"",
    "In the CNN debate, Biden stated emphatically: \"No more drilling on federal lands.",
    "\"It has been a continuous, continuous upward tick since then,\" Hawley said.",
    "For 25 years, WND has boldly brought you the news that really matters.",
    "\"He imposed new regulations on oil and gas and methane emissions.",
    "\"And here's what your president did when he first came to office.",
    "The senator noted the halt affected 25% of U.S. oil production.",
    "Are you telling me that had no effect on our energy supply?\"",
    "No ability for the oil industry to continue to drill.",
    "He immediately reentered the Paris Climate Accord.",
    "Those were all just in the first few days.",
    "No more drilling, including offshore.",
    "We would make sure it's eliminated.\"",
    "He halted leasing programs in ANWR.",
    "He canceled the Keystone Pipeline.",
    "That's nationwide,\" Hawley said.",
    "\"We would work it out.",
    "\"No,\" he replied.",
    "Period.\""
  ]
}