{
  "id": 7300,
  "mediaId": 261,
  "date": "d2022-05-24T02:09",
  "headline": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
  "image": "https://www.gannett-cdn.com/presto/2021/08/19/PDTF/6a932570-36a8-40b2-926e-98754ddd1b3d-IMG_James_Craig_1_1_16R8U50.JPG?crop=4481,2521,x0,y224&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/elections/2022/05/23/james-craig-perry-johnson-filed-few-signatures-governor/9890480002/",
  "sentiment": "-0.692",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Egan",
  "authorUrl": "https://www.freep.com/staff/2646657001/paul-egan/",
  "termIds": [
    651,
    1682,
    1844,
    2002,
    2171,
    2298,
    3075,
    3095,
    3099,
    5542,
    5545,
    307,
    2645,
    2678,
    2748,
    2791,
    5556
  ],
  "sentences": [
    "The complaint against Johnson filed by Liedel on behalf of another Michigan resident alleges that his campaign filed petitions with \"extensive irregularities, including signatures from dead people, apparent forgeries, extensive signature errors, a high number of duplicate signatures, numerous address and jurisdictional issues, and the use of many of the same petition circulators in apparent illicit petition activities.\"",
    "\"Because of the pervasiveness of fraudulent petition sheets and the fact that sheets submitted by the same circulators affected multiple candidates, staff have prepared an omnibus report documenting the detection of, and staff response to, these petition sheets,\" the bureau said in a report.",
    "Some sheets appeared \"round-tabled\"  a practice in which a group of individuals passes around sheets, with each person signing one line on each sheet \"in an attempt to make the handwriting and signatures appear authentic and received from actual voters,\" according to the reports.",
    "LANSING  Former Detroit Police Chief James Craig, once the consensus front-runner in the Republican race for governor, has not filed enough valid signatures to make the August primary ballot, according to a report released late Monday by the Bureau of Elections.",
    "The complaint filed by Brewer alleged that of the signatures Craig filed, nearly 7,000 were forged, over 300 were duplicates, nearly 200 came from nonregistered voters, 30 came from deceased voters and nearly 2,000 were otherwise defective.",
    "Craig's signatures faced two challenges  one from a Michigan resident represented by lawyer and former Michigan Democratic Party Chair Mark Brewer, and another from Michigan Strong PAC, a conservative group supporting Dixon's campaign.",
    "It appears certain petition circulators used outdated voter lists as the basis for their forged signatures, resulting in many dead voters turning up on the submitted sheets and others with outdated addresses, according to the reports.",
    "Also on the ballot, and suddenly in much stronger positions, are:Ottawa County real estate agent Ryan Kelley; Farmington Hills pastor Ralph Rebandt; Bloomfield Hills businessman Kevin Rinke, and Kalamazoo chiropractor Garrett Soldano.",
    "The reports also say that Oakland County businessman and \"quality guru\" Perry Johnson did not file enough valid signatures, but they clear Norton Shores businesswoman Tudor Dixon, whose petitions were also the subject of a complaint.",
    "Brown's campaign manager, David Yardley, said the campaign was not notified of any problems until Monday night, but it appears the bureau \"is disqualifying every signature from certain circulators whether valid or invalid.\"",
    "\"The extent to which each candidate's ballot qualification is affected by these circulators is proportional to the number and percentage of these circulator sheets in the candidate's nominating petition submission.\"",
    "\"The collapse of the James Craig campaign ... likely is the greatest in Michigan history,\" said John Sellek, a Republican political consultant who was a top aide to former Republican Attorney General Bill Schuette.",
    "\"We strongly believe they are refusing to count thousands of signatures from legitimate voters who signed the petitions and look forward to winning this fight before the board, and if necessary, in the courts.\"",
    "An investigation by the bureau found at least 36 petition circulators submitted at least 68,000 fraudulent signatures across at least 10 nominating petitions  not all of them petitions for governor.",
    "The bureau reports on Craig and other GOP candidates  which cite widespread forgery of signatures by multiple signature gatherers  could cut the crowded Republican field of 10 candidates in half.",
    "The bureau does not currently \"have reason to believe that any specific candidates or campaigns were aware of the activities of fraudulent-petition circulators,\" according to the staff reports.",
    "Bureau staff even found two identical petition sheets submitted for two different judicial candidateTen Republican candidates met the April 19 deadline to file signatures for the race.",
    "But John Yob, a Grand Rapids-based political consultant and spokesman for Johnson, who has also been regarded as a top-tier candidate, said his campaign will fight the recommendation.",
    "Michael Brown, Byron Center businesswoman Donna Brandenburg and Grand Haven financial adviser Michael Markey also be excluded from the ballot for having too few signatures.",
    "The Bureau of Elections \"does not have the right to unilaterally void every single signature obtained by the alleged forgers who victimized five campaigns,\" Yob said.",
    "Regardless of what the board decides, criminal investigations and possible charges against certain signature collectors are possible, according to the reports.",
    "The complaint from Michigan Strong PAC also alleged that Craig collected signatures from unregistered voters and engaged in other fraudulent activity.",
    "At the same time, experts say there is an onus on candidates and campaigns to perform a level of due diligence by vetting the signatures they submit.",
    "On the day of the filing deadline, the Craig campaign attempted to file about 4,000 more signatures, on top of those he had filed earlier that day.",
    "Nobody challenged the validity of the signatures they filed and the bureau report did not identify problems sufficient to disqualify them.",
    "Dixon's petition states that she is running for a term that expires in 2026, when in fact the four-year term expires on Jan. 1, 2027.",
    "A complaint against Dixon from a Michigan resident represented by Steve Liedel, former legal counsel to Democratic Gov.",
    "As a result, Craig failed to file sufficient signatures to appear on the August primary ballot, the complaint alleged.",
    "Craig, Johnson and other affected candidates have said they are victims of the fraud, not perpetrators.",
    "To qualify for the Aug. 2 primary ballot, each candidate had to file at least 15,000 valid signatures.",
    "Petitions filed by Craig, Johnson and Dixon were all challenged in complaints filed in late April.",
    "The reports now go to a Thursday meeting of the Board of State Canvassers for rulings.",
    "But the 4 p.m. deadline had passed and the additional signatures were not accepted.",
    "A spokesman for Craig could not immediately be reached for comment Monday night.",
    "It's a bombshell setback for what has been seen as a faltering Craig campaign.",
    "The four-member board has two Democratic members and two Republican ones.",
    "But the reports go further, recommending that Michigan State Police Capt.",
    "Read more on Michigan politics and sign up for our elections newsletter.",
    "Jennifer Granholm, alleges that her campaign misled voters.",
    "Contact Paul Egan: 517-372-8660 or pegan@freepress.com.",
    "Follow him on Twitter @paulegan4."
  ]
}