{
  "id": 8430,
  "mediaId": 675,
  "date": "5/29/2022 12:00:00 AM",
  "headline": "Study undermines alarm about asymptomatic COVID spread",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/virus-pathogen-disease-pandemic-Pixabay.jpg",
  "link": "https://www.wnd.com/2022/05/study-undermines-alarm-asymptomatic-covid-spread/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    2087,
    2171,
    6173,
    540,
    569,
    627,
    3600,
    2945
  ],
  "sentences": [
    "Along with massive numbers of police, firemen, Border Patrol agents, Navy SEALs, pilots, air-traffic controllers, and countless other truly essential Americans, they're all considered so dangerous as to merit termination, their professional and personal lives turned upside down due to their decision not to be injected with the experimental COVID vaccines.",
    "Politics\nCommentary\nLt. Col. James Zumwalt\nJoseph Farah\nPatrice Lewis\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nBarbara Simpson\nDaniel Joseph\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "However, scientific studies have supported her clear initial statement, and newly published research of nearly 30,000 people across 42 countries has found asymptomatic carriers are about 68% less likely to pass the virus on than those who get sick, DailyMail.com reported.",
    "In her original statement June 8, 2020, at a news briefing at the United Nations agency's Geneva headquarters, she said that from \"the data we have, it still seems to be rare that an asymptomatic person actually transmits onward to a secondary individual.\"",
    "\"If both the proportion and transmissibility of asymptomatic infection are relatively low, people with asymptomatic SARS-CoV-2 infection should account for a smaller proportion of overall transmission than presymptomatic individuals,\" she said.",
    "A study from China published in the Journal Nature in November 2020 on the prevalence of infection after a lockdown found no transmission of the SARS-CoV-2 among people who were in close contact with asymptomatic patients.",
    "The whole epic showdown is laid out as never before in the sensational October issue of WND's monthly Whistleblower magazine, titled \"THE GREAT AMERICAN REBELLION: 'We will not comply!'",
    "Back in June 2020, the World Health Organization's top infectious disease epidemiologist caused a stir when she said coronavirus transmission by asymptomatic individuals is \"very rare.\"",
    "\"If we actually followed all of the symptomatic cases, isolated those cases, followed the contacts and quarantined those contacts, we would drastically reduce\" the outbreak.",
    "Many health officials believed they accounted for up to a third of all infections, with some scientists claiming asymptomatic patients were just as infectious as the sick.",
    "Lead author Diana Buitrago-Garcia of the University of Bern in Switzerland said the role of asymptomatic carriers of the virus in overall COVID transmission was minor.",
    "In December 2021, as WND reported the NFL's chief medical officer said the league had not seen verifiable spread this season by people who don't display symptoms.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "\"And in that, I used the phrase 'very rare,' and I think that that's misunderstanding to state that asymptomatic transmission globally is very rare.",
    "When WHO's Kerkhove walked back her statement in June 2020, she said asymptomatic spread is a \"really complex question\" and much is still unknown.",
    "Today, under Joe Biden, tens of thousands of these same heroes are denounced as rebels, conspiracy theorists, extremists and potential terrorists.",
    "Biden's tyrannical mandate threatens to cripple American society  from law enforcement to airlines to commercial supply chains to hospitals.",
    "If you appreciate our Christian journalists and their uniquely truthful reporting and analysis, please help us by becoming a WND Insider!",
    "EDITOR'S NOTE: Last year, America's doctors, nurses and paramedics were celebrated as frontline heroes battling a fearsome new pandemic.",
    "But the study, published in the journal PLOS Medicine, found asymptomatic carriers were responsible for as little as 14% of cases.",
    "And the estimated overall risk of passing the virus to someone else was about two-thirds lower, the researchers said.",
    "Van Kerkhove said that conclusion had important implications for how to limit the spread of the coronavirus.",
    "The fear of asymptomatic spread is one of the primary reasons for the COVID-19 lockdowns and mask mandates.",
    "A day later, Dr. Maria Van Kerkhove walked back her statement, saying there had been \"misunderstandings.\"",
    "But the good news is that huge numbers of \"yesterday's heroes\" are now fighting back  bravely and boldly.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "If you like WND, get the news that matters most delivered directly to your inbox  for FREE!",
    "\"What we really want to be focused on is following the symptomatic cases,\" she said.",
    "For 25 years, WND has boldly brought you the news that really matters.",
    "COVID-19 power grab ignites bold new era of national defiance.\"",
    "\"I was responding to a question at the press conference.",
    "I was just trying to articulate what we know,\" she said.",
    "I wasn't stating a policy of WHO or anything like that.",
    "\"We don't actually have that answer yet,\" she said.",
    "I was referring to a small subset of studies.\"",
    "\"It's very rare,\" she said.",
    "It's already happening."
  ]
}