{
  "id": 862,
  "mediaId": 675,
  "date": "d2022-05-05T17:12",
  "headline": "GOP doubles Democrat turnout in Ohio despite Roe leak",
  "image": "https://www.wnd.com/wp-content/uploads/2022/04/voting-vote-election-Unsplash.jpg",
  "link": "https://www.wnd.com/2022/05/gop-doubles-democrat-turnout-ohio-despite-roe-leak/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    704,
    1226,
    1300,
    2171,
    146,
    428,
    482,
    2633,
    2668,
    2689,
    2845
  ],
  "sentences": [
    "TRENDING: Missing retired K-9 'Haso' found dead a half-mile from home, criminal investigation underway\nHowever, the New York Times compiled data showing Republicans cast slightly more than 1 million ballots in the GOP primary for governor, a 29% increase compared to the 2018 primaries.",
    "Faith\nCommentary\nMichael Master\nMichael Brown\nJack Cashill\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nDiversions\nPolitics\nWorld\nU.S.\nHealth\nMoney\nEducation\nMORE COMMENTARY\nBetsy McCaughey\nStar Parker\nBen Shapiro\nRead all of today's COMMENTARY...\nNew Section",
    "RNC Chairwoman Ronna McDaniel told Breitbart News that Ohio voters \"reject Biden's failed agenda of historic inflation, Biden's gas hike, and the crisis at our southern border, and will hold Democrats accountable and vote for Republicans up and down the ballot.\"",
    "The House Democrat's campaign chief Rep. Sean Patrick Maloney of New York said after the Politico report Monday night that abortion now will become the biggest issue in the midterms in November, claiming \"only Democrats will protect our freedoms.\"",
    "And high profile party leaders such as Vice President Kamala Harris and Sen. Elizabeth Warren of Massachusetts delivered passionate diatribes, with Harris charging Republicans \"are trying to weaponize the use of the law against women.\"",
    "It's clear that Democratic Party leaders hope their base will be motivated by the leak of the Supreme Court opinion indicating the justices are prepared to overturn the Roe v. Wade decision establishing a right to abortion.",
    "But just one day after the shocking leak was reported by Politico, Republican voters in the Ohio midterm primaries doubled the turnout of Democrats, Breitbart News reported.",
    "Republicans, however, saw a huge increase in suburban counties, with a rise of 30% in Butler County, 22% in Clermont County, 28% in Delaware County and 48% in Lake County.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "As of 2021, according to the secretary of state, Ohio had 947,027 registered Democrats, 836,080 Republicans and 6,196,547 unaffiliated voters.",
    "The power of President Trump's support was displayed Tuesday, with all 22 candidates in Ohio and Indiana endorsed by Trump winning primaries.",
    "If you appreciate our Christian journalists and their uniquely truthful reporting and analysis, please help us by becoming a WND Insider!",
    "The Democratic turnout, meanwhile, decreased by 26% from 2018, with only 502,100 Democrats casting ballots.",
    "An RNC analysis of the Ohio vote on Tuesday showed Democratic Party turnout \"cratered in urban areas.\"",
    "Democratic ballots decreased by 34% from 2018 to 2022 in Hamilton, Franklin and Cuyahoga counties.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "If you like WND, get the news that matters most delivered directly to your inbox  for FREE!",
    "Warren, visibly rattled, said she was \"angry and upset and determined.\"",
    "For 25 years, WND has boldly brought you the news that really matters.",
    "Registered Democrats outnumber Republicans in the Buckeye State.",
    "Vance, the author of the mega-bestseller \"Hillbilly Elegy.\"",
    "Among them was newcomer J.D."
  ]
}