{
  "id": 866,
  "mediaId": 675,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Returning to the site of Brownsville Revival 20 years later",
  "image": "https://www.wnd.com/wp-content/uploads/2019/05/dove-christianity-christians-God-peace-Holy-Spirit-hand-birds-Noah-pixabay.jpg",
  "link": "https://www.wnd.com/?p=5002809",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Tomczak",
  "authorUrl": "https://www.wnd.com/author/ltomczak/",
  "termIds": [
    1079,
    1618,
    2014,
    2030,
    2171,
    63,
    246,
    2583,
    2590,
    2945
  ],
  "sentences": [
    "Hearing testimonies of places where Muslims are being miraculously converted, prisons are being up ended by the Gospel, youth are being radically saved, crime is dropping, evangelism is exploding, economic conditions are improving dramatically, and leaders are uniting together to testify to the manifest Presence of God in their midst imparts hope and encouragement for us here in America.",
    "When an historical, supernatural visitation occurs in an obscure, lower-income locality, drawing over 2 million people from around the world alongside 20,000 people genuinely converted with people waiting in long lines in the hot sun all day to be a part, and for five years you were integrally involved, can you understand why I would take a return trip to the site?",
    "Nehemiah reminded the people of God's promise to Moses that \"If you return to Me and keep My commandments and do them, though your outcasts are under the farthest part of the heavens, I will gather them from there and bring them back to the place where I have chosen to establish My Name\" (Nehemiah 1:9).",
    "World\nCommentary\nJerry Newcombe\nDennis Prager\nStar Parker\nRead all of today's COMMENTARY...\nDiversions\nU.S.\nJustice for JonBent / Change.org\nMoney\nFaith\nPolitics\nEducation\nHealth\nMORE COMMENTARY\nLarry Tomczak\nStephen Moore\nAndy Schlafly\nRead all of today's COMMENTARY...\nNew Section",
    "We need to recalibrate our thinking so that our focus is not so much on our creature comforts or clever ways to accumulate more bodies in our buildings but rather on the honor of God and hosting His manifest Presence, which ultimately brings the change supernaturally.",
    "Driving to Pensacola, Florida, to celebrate our 46th wedding anniversary, my wife and I had a mosaic of memories from where our lives intersected with millions who were radically transformed by what happened at the Brownsville church over 20 years ago.",
    "Walking the grounds reminiscing and at times wiping away tears, I thanked God that I was able to teach regularly alongside Dr. Michael Brown in the Bible school that exploded almost overnight from a handful to over 1,100 students.",
    "One Egyptian brother told of how his country experienced incredible upheaval, yet he saw in Isaiah 19 how God prophetically foretold Egypt being shaken of its idols so that it would manifest God's unshakable kingdom!",
    "Years ago lightning struck the roof of the Brownsville church, and when Doris and I were there recently we saw that there had just been another unexpected mishap that caused part of the roof to literally collapse!",
    "Here's the Deal\nChe and I shared together for an hour on the phone weeks ago, and it was the perfect preparation for me as my wife and I revisited the site of the Brownsville Revival!",
    "For some strange reason I don't think Satan appreciates all that happened and continues to happen through multitudes who have a special place in their heart for revival in our day.",
    "Turning back to God\nAllow me to give you another example to stir your heart to seek after God's transformative Presence the way we experienced it in the Brownsville Revival.",
    "Bill Johnson, Cindy Jacobs, Jim Garlow, Samuel Rodriguez, Lou Engle, Eric Metaxas, David Barton, Mat Staver, Lance Wallnau, Mike Bickle, Dutch Sheets, Mario Murillo, Gov.",
    "Two of our children were a part, and now one of them is leading a thriving Atlanta church with his wife whom he met at BRSM (the Brownsville Revival School of Ministry).",
    "Is this upheaval happening in our nation so we likewise will turn from our idols, stop trusting in our ingenuity and programs and humbly turn back to the living God?",
    "John Kilpatrick, the former senior pastor and primary overseer of the spiritual outpouring, said that the locality is the \"lightning capital of the country!\"",
    "We became best friends and today maintain our covenant relationship, inspiring each other and others to believe God for a third Great Awakening in our day.",
    "In the face of escalating chaos, national conflict and global shaking, God has a bulletproof plan that is currently unfolding in unprecedented ways.",
    "Almost 45 years ago a mixed-up, drug-addicted, pleasure-seeking young man was radically converted and came to me asking if I would disciple him.",
    "Che boldly declares, \"Our nation is facing one of its darkest hours, and now is the time for God's people to usher in the greatest revival!\"",
    "George Otis Jr. has traveled the globe, documenting places where God's Presence has invaded a city and brought about genuine transformation.",
    "Hosting God's manifest Presence is integral to all awakening/revivals, and the key components are humility, holiness and hunger for God.",
    "Che has just released a phenomenal new book entitled \"Turning our Nation Back to God Through Historic Revival\" (available on Amazon).",
    "Example: Not long ago a minister from Egypt declared the breathtaking things God was doing there and elsewhere to transform cities.",
    "But in different parts of the world, there is a different kind of invasion  the Presence of God bringing transformation to cities!",
    "That young man is now Dr. Che Ahn, the president of Harvest International Ministry, a global apostolic network in over 65 nations!",
    "Nehemiah's magnificent obsession\nIn a time of moral and civil decline, Nehemiah started rebuilding the walls of the city of God.",
    "At the center of this Holy Spirit outpouring were two core values: the Presence of God and humble repentance before a Holy God.",
    "His magnificent obsession was that once again the Presence of Almighty God would be experienced among the people of God.",
    "If you have ever watched any of his videos portraying what happens, you will be both impressed and profoundly stirred.",
    "An astonishing invasion\nVladimir Putin followed the same strategy of Hitler and Stalin in his invasion of Ukraine.",
    "With all our political division and disastrous policies, the absolute priority must not be the GOP but rather GOD!",
    "Sarah Palin, Dr. Chuck Pierce and I heartily endorse this timely book and encourage everyone to get it today!",
    "Gavin Newsom in California to inspire the entire nation not to be cowardly in the face of oppression today.",
    "Instead, we should be asking, \"What is holding back the Presence of God that truly can transform America?\"",
    "The other is an executive assistant in a national Christian ministry promoting Spirit-led generosity.",
    "Everything must start with God, not the blessing or our bailout in this moment of cultural crisis.",
    "Historic revival is on God's agenda, and it's our turn to respond and turn our nation back to God!",
    "Che believes that at this critical moment in history, we are being offered a divine invitation.",
    "Here's a question asked often, yet basically off the mark: \"How can we get God to fix America?\"",
    "He's the International Chancellor of Wagner University and courageously stood up to Gov.",
    "Senior Christian leader Tony Evans says it best: \"Multitudes want God to bless America.",
    "The ways of God are becoming so easy and clear that only the obedient will follow.",
    "Google his \"Transformation\" documentaries and you will be spiritually blown away!",
    "It's the same for America at this pivotal time  a tipping point in our history.",
    "In the midst of these years make them known\" (Habakkuk 3:2).",
    " O Lord, revive Your work in the midst of the years!",
    "Watch Larry's most recent \"Week in Review\" video.",
    "\"O Lord, I have heard the report of You.",
    "Few truly want one nation under God.\"",
    "This one is very personal to me.",
    "Are you one of them?",
    "God to fix America?"
  ]
}