{
  "id": 8673,
  "mediaId": 943,
  "date": "5/30/2022 12:00:00 AM",
  "headline": "GOP candidates running for U.S. Sen. Tammy Duckworth's seat face pick your poison dilemma' in blue Illinois",
  "image": "https://www.chicagotribune.com/resizer/wbpiODYw3gbo2aKTvsOmkuOTAW0=/800x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/4NFGY3Z6GJG7TLNIWZRDMKKDU4.jpg",
  "link": "https://www.chicagotribune.com/politics/elections/ct-senate-duckworth-republican-candidates-20220530-yehn27c2una2ten4rhxijqyhni-story.html",
  "sentiment": "0",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clare Spaulding",
  "authorUrl": "https://www.chicagotribune.com/ct-clare-spaulding-staff.html#nt=byline",
  "termIds": [
    2171
  ],
  "sentences": [
    "The effort to attract former President Donald Trump's MAGA followers could be risky given Illinois' heavily Democratic electorate, but GOP candidates are faced with a pick your poison dilemma in choosing a primary campaign strategy, said John Shaw, director of the Paul Simon Public Policy Institute at Southern Illinois University.",
    "In addition to embracing traditional GOP stances of opposing abortion and supporting police and gun rights, several of the candidates have ratcheted up their conservative rhetoric by sounding off on matters that have sparked heated national debates but haven't become major issues in Illinois.",
    "Formerly a staunch Democrat, Hubbard said she became a Republican in 2014, after a police officer shot and killed a young Black man, Michael Brown, in Ferguson, Missouri, sparking protests and condemnation of police brutality against Black people.",
    "Peggy Hubbard, a Navy veteran, former police officer and former IRS agent from Belleville, outside St. Louis, has called Salvi a pawn of the Illinois GOP, which Hubbard said is working in unison with the Democrats to keep the control in Chicago.",
    "(Susan Walsh / AP)\nSeven Republican candidates are competing for the right to challenge Democratic U.S. Sen. Tammy Duckworth in November, and most of them have staked out staunchly conservative positions ahead of their party's June 28 primary.",
    "Vice President Kamala Harris smiles after greeting Sen. Tammy Duckworth in the Rose Garden of the White House in Washington on May 17, 2022, during a reception to celebrate Asian American, Native Hawaiian, and Pacific Islander Heritage Month.",
    "We need (politicians) to go to D.C. and bring our thoughts and dreams and ideas to D.C., not propagandize us and tweet to us on behalf of Big Pharma or big business or big government, Dubiel said at the Assyrian GOP forum.",
    "Kathy Salvi's opponents have attempted to use her more moderate positions  for example, focusing on parental choice in schools rather than joining the far-right drumbeat against critical race theory  against her.",
    "On May 20, his campaign hosted an event featuring retired Lt. Gen. Michael Flynn, Trump's first national security adviser, to discuss how to save Illinois and take back America, according to his campaign website.",
    "Williams, who supports reparations for Black Americans, has made previous runs for the 2nd Congressional District seat when it was held by Jesse Jackson Jr., both as a Democrat and a member of the Green Party.",
    "Geneva financial planner Bobby Piton, who has focused his campaign on a promise to root out corruption in state government, repeatedly pushes unfounded claims of voter fraud in the 2020 election.",
    "After the 2020 election, Piton worked in Arizona to try to push baseless claims of voter fraud in that state and was billed as an expert witness for the Trump legal team in its rejected efforts.",
    "Hubbard, who is Black, said at a May 1 forum that she is the candidate best poised to beat Duckworth in November because she eliminates any minority card the Asian American senator might play.",
    "Hubbard, the only candidate from outside the Chicago area, tried to unseat U.S. Sen. Dick Durbin in 2020 but came in second in the GOP primary to former Lake County Sheriff Mark Curran.",
    "The sort of messages that work in a primary campaign, and may get you the Republican nomination, almost certainly ensure that you lose the general election in November, Shaw said.",
    "Mundelein attorney Kathy Salvi, who has staked out more traditional party positions than the other candidates, leads the GOP hopefuls in both campaign finances and endorsements.",
    "Salvi has endorsements from a number of Republican organizations, including those from Lake and Sangamon counties and Evanston, Schaumburg, New Trier and Barrington townships.",
    "Her husband, Al, was elected as a state representative in 1992 and served two terms before making unsuccessful bids for U.S. Senate in 1996 and for secretary of state in 1998.",
    "Having grown up under the oppressive regime of communist Poland, Chlebek said at the Skokie forum that he wants to curtail government spending and protect American liberties.",
    "Casey Chlebek, a Polish immigrant and real estate manager from Lake Forest, is also a repeat candidate from the 2020 GOP primary, when he finished last in a field of five.",
    "As of March 31, she had about $250,000 in her campaign fund, equal to the amount of a loan she made to her campaign, according to Federal Election Commission records.",
    "Three of the candidates have explicitly said the 2020 presidential election won by Joe Biden was stolen, despite there being no evidence of widespread voter fraud.",
    "An America First agenda is the best agenda for the Black American community, he said at the Skokie forum, crediting Trump's policies for reducing unemployment.",
    "Williams, who is Black and describes himself as running as an Abraham Lincoln-Frederick Douglass Republican, said his top concern is reducing violent crime.",
    "Hubbard said during the Daily Herald forum that she got behind after putting her finances on the line to help pay for her mother's brain cancer treatment.",
    "Those include what they perceive to be critical race theory in schools and, without evidence, questioning the results of the 2020 presidential election.",
    "He ran multiple times to unseat U.S. Rep. Bobby Rush from his long-held 1st Congressional District seat, including in 2018, but was never successful.",
    "A college dropout who worked his way up at suburban radio station WCKG, Dubiel said he is running to represent everyday Illinoisans in Washington.",
    "None of the Republican candidates have the name recognition of Duckworth, of Hoffman Estates, who is running unopposed in the Democratic primary.",
    "Two others have parroted concerns about election security that are often raised by those seeking to throw the 2020 election into question.",
    "When asked during a Daily Herald forum last month whether the 2020 presidential election was stolen, Salvi did not give a direct answer.",
    "Dolton pastor Anthony Williams was the only candidate at the Daily Herald forum who explicitly said Biden was legitimately elected.",
    "And none of their campaigns come anywhere near the $7.1 million Duckworth's campaign reported having in the bank as of March 31.",
    "Salvi says she opposes abortion and supports building a wall along the southern border with Mexico to halt illegal immigration.",
    "Also running is Matt Dubiel, a Naperville entrepreneur who sold one of his small businesses and quit his job to run for office.",
    "Through the first quarter of this year, she had raised $50,000 on top of the loan she made to her campaign, records show.",
    "Piton's campaign had raised about $143,500, with more than $40,000 on hand as of March 31, according to FEC records.",
    "She also is backed by Illinois Family Action, a Christian organization that opposes abortion and same-sex marriage.",
    "Along with Hubbard and Piton, Tillman has repeated the false claim that the 2020 presidential election was stolen.",
    "My husband served on the front lines of Ferguson, Hubbard said at a May 1 Assyrian GOP candidate forum in Skokie.",
    "Trump pardoned Flynn after he had been convicted of lying to the FBI about his contacts with a Russian diplomat.",
    "Tillman is the author of Tillman's Handbook of Great Black American Patriots, and an avid Trump supporter.",
    "She said she worked the issues out with the mortgage company and bank and still lives in her same home.",
    "J.B. Pritzker to declare gun violence a public health crisis, an action the governor took in November.",
    "Piton has contributed $50,000 to his own campaign, half as a donation, the other half as a loan.",
    "According to public records, Hubbard defaulted on her home mortgage payment in 2016 and 2018.",
    "Jimmy Lee Tillman II, the only Senate candidate from Chicago, is the son of former Ald.",
    "Election Day is June 28, but early voting in much of the state is already open.",
    "Spurred by the fatal shooting of his son in 2018, Williams said he lobbied Gov.",
    "For more information about the election, visit the Tribune's voter guide.",
    "I wish we had a different president to meet this moment, but we don't.",
    "Salvi ran for Congress in 2006 but lost in the Republican primary.",
    "My awakening became apparent to me that I needed to switch gears.",
    "Those who requested a mail-in ballot should receive those soon.",
    "She said she felt Democrats went too far in condemning police.",
    "Joe Biden is our president, Salvi said.",
    "We gotta get back to a path forward.",
    "Dorothy Tillman."
  ]
}