{
  "id": 889,
  "mediaId": 675,
  "date": "d2022-04-24T13:53",
  "headline": "Time for neutrality in Sweden and Finland may be ending",
  "image": "https://www.wnd.com/wp-content/uploads/2020/11/guns-ammo-ammunition-aiming-target-firing-bullets-weapons-execution-rifle-winter-snow-military-defense.jpg",
  "link": "https://www.wnd.com/2022/04/time-neutrality-sweden-finland-may-ending/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    1122,
    1168,
    1279,
    1449,
    2030,
    2171,
    2658,
    2888,
    2919,
    2923,
    2942
  ],
  "sentences": [
    "Health\nCommentary\nPatrice Lewis\nBrent Smith\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nU.S.\nWorld\nEducation\nMoney\nPolitics\nFaith\nDiversions\nMORE COMMENTARY\nCraige McMillan\nBarbara Simpson\nRead all of today's COMMENTARY...\nNew Section",
    "In the doorstep statement before the meeting of NATO Ministers of Foreign Affairs in Brussels, NATO Secretary-General Jens Stoltenberg told media that if Finland and Sweden applied to join the alliance, the other members would welcome them.",
    "The Swedish and Finnish governments quickly warmed to that position, likely because of a sense that neutrality will not offer them the same protection from Russia that it was at least thought to have before Feb. 24.",
    "Helsinki and Stockholm have both responded to say that they, not Moscow, determine their respective security policies, and they will decide to join or not join the alliance regardless of threats from Russia.",
    "During the Cold War, Finland feared that joining NATO would provoke rather than deter aggression from the Soviet Union, and Sweden feared suddenly having the Soviet Union next door.",
    "The invasion changed the strategic landscape of Europe so dramatically that conventions of political neutrality and aversion to conflict may soon become relics of the Cold War.",
    "Speaking at a joint press conference in Stockholm on the same day, Finnish Prime Minister Sanna Marin said that Finland would reach a final decision in the next few weeks.",
    "Echoing Putin's threat in 2016, more than one Kremlin spokesperson has threatened Finland and Sweden in recent weeks with severe consequences if the countries join NATO.",
    "If they decide to apply, I expect that all allies will welcome them, and that building on the fact that Sweden and Finland are our closest partners,? Stoltenberg said.",
    "We know that they can easily join this alliance if they decide to apply.?\nThese remarks echoed similar ones Stoltenberg issued in a press conference the day before.",
    "Marin held the press conference alongside Swedish Prime Minister Magdalena Andersson, who confirmed that Sweden was also re-evaluating its long-held neutrality.",
    "We have worked together for many years, we know that they meet the NATO standards when it comes to interoperability, democratic control over the armed forces.",
    "While NATO countries have often been less than cohesive, the Russian invasion of Ukraine has unified them to an unexpected degree against a common adversary.",
    "NATO has not described what an accelerated application process would look like, but the secretary-general's welcome of Finland and Sweden is unambiguous.",
    "We have to be prepared for all kinds of actions from Russia,\" she told media, adding that everything changed when Russia invaded Ukraine on Feb. 24.",
    "NATO membership is not a decision to be taken lightly, but neither is remaining neutral when Russian aggression may one day affect both countries.",
    "In a 2016 press conference in Helsinki, Vladimir Putin boldly implied that Finnish NATO membership would be met with a Russian military response.",
    "The reason has historically been rooted in the flexibility that neutrality could provide in a conflict, but it has everything to do with Russia.",
    "Despite close military coordination with the alliance for decades, the two Nordic countries long maintained a position of official neutrality.",
    "Undoubtedly we appreciate Finland's neutral status.?\nWell into the 21st century, NATO membership remained unpopular in both countries.",
    "Likewise, the current conversation around Finland and Sweden joining NATO would have been hard to imagine at the beginning of 2022.",
    "The secretary-general has also said that it would be possible for both countries to join quite quickly under current circumstances.",
    "It is the first time either Finland or Sweden has made a definitive statement about NATO membership since Russia invaded Ukraine.",
    "By Sarah White\nReal Clear World\nPreventing NATO expansion is one of Vladimir Putin's primary justifications for invading Ukraine.",
    "Before Russia invaded Ukraine this year, some polls showed that less than 30% of Finns and Swedes favored joining the alliance.",
    "After the March 13 announcement, Russia warned Finland and Sweden that it would move nuclear weapons to the Baltic region.",
    "Even Germany made the decision to order F-35 fighters from the United States and to supply weapons to Ukrainian fighters.",
    "Such was the case when Helsinki more seriously considered joining NATO after the illegal annexation of Crimea in 2014.",
    "On April 13, Finnish officials said there would be immediate debate in Helsinki about applying for NATO membership.",
    "For the first time since NATO's creation, a majority of Finns and Swedes support their countries becoming members.",
    "The war appears likely to backfire on this front, as Finland and Sweden seriously consider joining the alliance.",
    "Even if Russian forces had not invaded Ukraine, NATO membership was no longer unthinkable in the two countries.",
    "For Sweden, the concept of neutrality has been more absolute; it has not officially fought a war since 1814.",
    "Ultimately, there is no way to compromise between living with the status quo and attaining NATO membership.",
    "Russian threats will probably not be enough to prevent Finland and Sweden from pursuing NATO membership.",
    "Finland has done more to overtly align itself with NATO, purchasing the F-35 from the U.S. last year.",
    "The comments from both prime ministers indicate that neutrality is probably no longer an option.",
    "Regardless of membership prospects, the two countries are re-examining their security needs.",
    "How they assure the safety and independence of their own country is the Finns' choice.",
    "Whenever the possibility of joining NATO comes up, Moscow threatens retaliation.",
    "After all, Finland and Sweden's Cold War fears have never completely gone away.",
    "The most direct comments on the subject had previously come from NATO itself.",
    "[Editor's note: This story originally was published by Real Clear World.]",
    "[Editor's note: This story originally was published by Real Clear World.]",
    "However, the issue they now face is the irreversibility of the decision.",
    "is Senior Research Analyst and Editor at the Lexington Institute.",
    "We moved our forces back [from the border], 1500 kilometers away.",
    "What do you think we will do in this situation?",
    "Meanwhile, threats from Moscow are piling up.",
    "In Finland, that number has soared to 68%.",
    "The views expressed are the author's own.",
    "Will we keep our forces there?",
    "The invasion changed this.",
    "Sarah White, M.A."
  ]
}