{
  "id": 896,
  "mediaId": 675,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene warns Dems of 'another way to play this game'",
  "image": "https://www.wnd.com/wp-content/uploads/2021/05/marjorie-taylor-greene-maskless-house-congress-republicans.jpg",
  "link": "https://www.wnd.com/?p=4999344",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    2429,
    2429,
    2303,
    2303,
    2398,
    2398,
    1844,
    1844,
    1507,
    1507,
    1583,
    1583,
    683,
    683,
    651,
    651,
    1208,
    1208,
    773,
    773,
    713,
    713,
    895,
    883,
    883,
    895,
    428,
    428,
    200,
    200,
    2791,
    2791,
    2748,
    2748
  ],
  "sentences": [
    "They include that Iranian nationals hacked into a state computer election system and stole 100,000 voter registrations and used them to try to intimidate Republicans, a former state Supreme Court justice concluded there was bribery in Wisconsin's election count, there was illegal ballot harvesting in several states, vote signature requirements may have been violated involving 200,000 ballots in Arizona, the widely used ballot drop boxes were, in fact, illegal, foreign voters were found on voter rolls in Texas and Georgia, a number of mail-in ballot strategies were unconstitutional, voter roll laws were not followed and more.",
    "She made the comments in an appearance with Fox News' Tucker Carlson, where she said, \"These people hate the people in my district so much, they look down on them because they voted for me and sent me to Washington to fight for the things that most Americans care about like secure borders, stopping abortion, protecting our Second Amendment, stopping the out of control spending in Washington and stop funding never ending foreign wars and the insanity that takes place in Washington.\"",
    "IMPORTANT NOTE: While Joe Biden, Kamala Harris and Nancy Pelosi's \"House Select Committee on the January 6 Attack\" daily accuse law-abiding, patriotic, conservative Americans of being \"domestic terrorists,\" \"violent extremists\" and \"insurrectionists,\" a REAL INSURRECTION  indeed, a full-scale MARXIST \"RESET\" of the greatest nation on earth  is well underway in the United States of America, led by them.",
    "She said, \"You know, there's something that I have learned and I think that this is really important, you know if you can challenge any representative's candidacy or elected office holder, then I bet you we could round up some Republican voters who didn't like Kamala Harris funding rioters, criminal rioters out of jail or Ilhan Omar or Cori Bush or Maxine Waters inciting riots.",
    "She continued, \"Well, I went there and I have been fighting it, and now the progressives, the people who donate money to dark money groups, you know the 501(c)(3)s and the foundations, they've hired up some attorneys from New York who hate the people in my district and don't believe they should have the right to elect who they want to send to Washington which is me.",
    "One was the $420 million Mark Zuckerberg gave to mostly leftist election officials with instructions to recruit voters from Democrat districts, and the other was the collusion by legacy and social media companies that decided to suppress accurate, and damaging, reports about the Biden family international business scandals just before the election.",
    "\"Though there's more of a technical issue about whether the provision in the 14th Amendment, which was originally enacted in the context of the Civil War, whether Congress had sort of limited its effectiveness only to the Civil War, and Judge Totenberg does address that issue on the merits that that provision is still effective,\" he said.",
    "And the ruling said the state law violated federal law to the extent challenges are based upon the \"insurrection\" clause of the Fourteenth Amendment, because Congress removed that amendment's application to any current members of Congress in The Amnesty Act of 1872, the law firm reported.",
    "Rep. Cawthorn vigorously denies that he 'engaged in insurrection or rebellion' against the United States, and his suit sought to enjoin the NCSBE from employing unconstitutional and unlawful provisions of North Carolina election law to remove him from the ballot as a candidate.\"",
    "A campaign by Democrats to prevent U.S. Rep. Marjorie Taylor Greene, R-Ga., from seeking re-election  based on a Civil War provision that a judge already has ruled inapplicable to today's Congress  has been described by BizPacReview as \"as despicable and dastardly as it gets.\"",
    "The judge held that due to the substantial likelihood that Cawthorn's candidacy will be significantly impacted by the challenges before the upcoming primary, it was proper for the court to determine whether the board could proceed with the challenge.",
    "According to officials with the Bopp Law Firm, who have been working with Cawthorn, a group organized in the state against Cawthorn filed a complaint with the state board demanding that Cawthorn be prevented from running for his congressional seat.",
    "The reality of all this is stunningly documented and explored in the January 2022 issue of WND's acclaimed Whistleblower magazine, titled \"THE REAL INSURRECTION: Branding normal Americans as 'terrorists,' Democrats pursue total revolution.\"",
    "\"They alleged that Rep. Cawthorn does not meet the federal constitutional requirements for a member of the U.S. House of Representatives because he engaged in 'insurrection or rebellion' against the United States on January 6th.",
    "Constitutional expert Jonathan Turley pointed out that that position by North Carolina, which claimed the authority to determine Cawthorn guilty, \"is wholly outside of the language and intent of this provision.",
    "Moreover, there is a vast difference between enforcing an objective standard on the age of a candidate and enforcing the subjective standard whether that candidate's views make him an 'insurrectionist.'\"",
    "The legal claims allege the Republicans are \"part of a conspiracy theory and 'spreading their malicious falsehoods about a 'rigged election' through regular and social media and at public appearances.'\"",
    "The goal, however, was to use that long-dormant constitutional provision adopted after the Civil War that prevents members of Congress from having participated in an \"insurrection,\" like the Civil War.",
    "The fight that she's facing is that some Democrats claim a Civil War-era provision, intended at the time to keep officials from the Confederacy from returning to Congress in Washington, applies to her.",
    "WND previously reported when the Democrats adopted an agenda that defines the Jan. 6 riot as an insurrection, even though those arrested and charged generally are facing counts like trespassing.",
    "Courthouse News reported that it was U.S. District Judge Amy Totenberg, who owes her appointment to Barack Obama, who said the case filed against Greene's candidacy can continue  for now.",
    "However, WND already has reported on a federal judge's rejection of virtually the same allegations in a case involving Rep. Madison Cawthorn, a Republican from North Carolina.",
    "Remember the rule: Whatever today's Democrats are falsely accusing their critics of doing and planning, that is precisely what they themselves are ACTUALLY doing and planning.",
    "TRENDING: Kids of Michelle Obama's brother booted from school, lawsuit now filed\n\"I have overwhelming support in my district and I'm so thankful for all of them,\" she said.",
    "\"Well, now they've filed a lawsuit because they're trying to rip my name off of the ballot and steal my district's ability to reelect me and send me back to Congress.\"",
    "There, the state elections officials claimed they had the power to determine his \"eligibility\" based on that Civil War-era provision, and Cawthorn sued.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "Democrats for the last year have speculated that they would use \"lawfare,\" legal cases assembled for political purposes, to try to hurt Republicans.",
    "A coming documentary reveals hundreds of \"mules\" were hired to dump piles of mail-in ballots in drop boxes during election night's overnight hours.",
    "A federal judge issued an injunction against the Board of Elections that prohibits the board of hearing challenges on the basis of insurrection.",
    "They claim she participated in an \"insurrection\" by supporting some of the questions raised by those who rallied in Washington Jan. 6, 2021.",
    "Politics\nEducation\nMoney\nWorld\nMORE COMMENTARY\nLarry Elder\nMichael Brown\nMichelle Malkin\nRead all of today's COMMENTARY...\nNew Section",
    "In Wisconsin, a local report said the liberals continued to claim the Republicans \"are no longer qualified\" to seek re-election.",
    "The report said Clark Cunningham, professor of law at Georgia State, described the case against Green as mostly \"frivolous.\"",
    "Further, multiple state and local officials simply ignored their own state laws regarding the handling of mail-in ballots.",
    "He explained if that state board claim were to be adopted, it would \"invite partisan and abusive practices by such boards.",
    "Meanwhile, Just the News has compiled a list of 20 situations that suggest fraud or irregularities in the 2020 election.",
    "Diversions\nCommentary\nJack Cashill\nLt. Col. James Zumwalt\nBen Shapiro\nBetsy McCaughey\nRead all of today's COMMENTARY...",
    "And Dave Oedel, a law professor at Mercer University, said in the report Totenberg barely kept the case alive.",
    "WND reported earlier when the same claims were made by leftists in Wisconsin against that state's GOP members.",
    "But she's facing a lawsuit that she is, as Democrats define it, an \"insurrectionist\" and barred from Congress.",
    "Democrats and leftists say GOP members who even joined in the questioning of the 2020 results are guilty.",
    "Some of those thousands later went to the Capitol and rioted, inflicting mostly vandalism-type damage.",
    "It's not the first such case launched by Democrats in a \"lawfare\" campaign to take down Republicans.",
    "Also, independent analyses have concluded either of two ways likely \"bought\" the election for Biden.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "That action targets Republican Sen. Ron Johnson and U.S. Reps. Tom Tiffany and Scott Fitzgerald.",
    "Now Greene says she may be persuaded to suggest Republicans respond in kind.",
    "A long list of questions have, in fact, been raised about the 2020 election.",
    "What is known is that a number of issues remain under investigation.",
    "\"You know, I think there's another way to play this game,\" she said.",
    "Cawthorn is right to challenge any such action as unconstitutional.\"",
    "It is also wrong on the purpose of this constitutional provision.",
    "Faith\nHealth\nU.S."
  ]
}