{
  "id": 8970,
  "mediaId": 675,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "Pandemic's telehealth advances still waiting to be made permanent",
  "image": "https://www.wnd.com/wp-content/uploads/2022/01/doctors-nurses-telehealth-telemedicine-stethoscope-laptop-internet-physical-exam-pixabay.jpg",
  "link": "https://www.wnd.com/2022/06/pandemics-telehealth-advances-still-waiting-made-permanent/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    2171
  ],
  "sentences": [
    "By Diana Girnita\nReal Clear Health\nWhen the fear of getting COVID-19 was high and lock-down orders were in place, telehealth was an important resource, allowing patients to connect with doctors by live video, telephone, and remote patient monitoring without overcrowding hospitals and doctors' offices.",
    "This is done in the name of helping telehealth; however, researchers warn that such laws hinder providers and patients from enjoying the cost-savings of telehealth and could encourage the overconsumption of healthcare by paying providers based on the volume of services and not outcomes.",
    "From elderly individuals with mobility issues to rural families who are unable to make a longer commute to a doctor's office to those who need to receive care but worry about catching or spreading an illness to others, telehealth expands the ability of Americans to receive care.",
    "Elderly, low-income, medically underserved, and average Americans will all see improvement and better access to care by setting these changes in stone rather than relying on new extensions every few months or, even worse, letting them expire.",
    "The researchers found that telehealth has proven itself a viable supplement to an already strained health-care system and the pandemic not only demonstrated its worth but also proved it necessary in light of a strained system.",
    "Instead of seeking a return to the limited choices of the pre-pandemic healthcare landscape, Congress and state legislatures should look forward to the innovative and much-needed healthcare solutions provided by telehealth.",
    "These changes allowed more providers to adopt this technology and, as a result, the United States went from having 43% of community health centers using telehealth before the pandemic to 98% just months into the pandemic.",
    "Of the 114.3 million telehealth services utilized that year, 54.5 million were regular office visits, 14 million were behavioral health appointments, and 2.1 million were physical, occupational, or speech therapy.",
    "Some states have chosen to use this authority to regulate the price of telehealthcare by requiring payment paritythat is, insurers must pay the same for a telehealth service as they would for an in-person service.",
    "For example, Wyoming Medicaid does not cover phone calls with health providers or store-and-forward telehealth servicessharing patient information electronically among different healthcare professionals.",
    "A recent Department of Health and Human Services study of Medicare telehealth usage found 28 million people43% of all Medicare beneficiariesused telehealth during the first year of the pandemic.",
    "It also reinstated the CARES Act provision allowing high-deductible health plans (which are usually attached to health savings accounts) to provide pre-deductible coverage of telehealth visits.",
    "During this time of isolation and drastic increases in mental health challenges, telehealth services provided a lifeline of critical psychiatric and behavioral healthcare to people in need.",
    "Politics\nU.S.\nEducation\nHealth\nMoney\nWorld\nDiversions\nMORE COMMENTARY\nCraige McMillan\nLt. Col. James Zumwalt\nDaniel Joseph\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "When states pass laws regarding telehealth, they must make sure that they are the right laws that give patients freedom and choices rather than insurance and provider mandates.",
    "With innovation and quickly evolving technology, healthcare providers can deliver more high-quality services remotely, and our laws should make it easy to do so.",
    "A Brookings Institution paper recommends the promotion of telehealth to reduce service redundancies in primary care and to help reach the medically underserved.",
    "Diana Girnita MD, Ph.D. diagnoses and treats adult patients for a wide array of inflammatory arthritis, osteoarthritis, autoimmune diseases, and osteoporosis.",
    "Congress passed the 2022 omnibus spending bill in March that extended federal telehealth provisions through September, the end of the 2022 fiscal year.",
    "Another HHS study found that telehealth saw the broadest adoption among minorities as well as those earning under $25,000.",
    "Early in the pandemic, nearly half of all states and the federal government passed laws expanding access to telehealth.",
    "Faith\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nWayne Allyn Root\nRead all of today's COMMENTARY...",
    "In fact, over 25% of each of these groups had a telehealth visit within the previous month during the study.",
    "Congress and many state legislatures are moving in the right direction by extending telehealth provisions.",
    "As the fog of the pandemic begins to lift, the world is not exactly how we found it in March 2020.",
    "The law covers telehealth visits, including video and audio-only visits, for Medicare patients.",
    "Policies regarding telehealth coverage for Medicaid beneficiaries vary from state to state.",
    "MaineCare, however, does reimburse for phone consultations and store-and-forward services.",
    "These provisions are crucial to expanding care options for Americans across the country.",
    "In addition to Congress, state legislatures also have an important role to play.",
    "Yet, as of last year, only eight states have made telehealth changes permanent.",
    "[Editor's note: This story originally was published by Real Clear Health.]",
    "[Editor's note: This story originally was published by Real Clear Health.]",
    "It allows them to do so from the comfort and safety of their homes.",
    "There is no reason they should be limited to just six months.",
    "At the same time, states have authority over insurance rules.",
    "They would be wise to go all the way and make them permanent.",
    "It makes no sense to go back to limiting care options.",
    "These benefits extend well beyond the pandemic."
  ]
}