{
  "id": 912,
  "mediaId": 675,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Biden's resignation, a 'great reset' and the end of the Shemitah",
  "image": "https://www.wnd.com/wp-content/uploads/2021/08/joe-biden-lost-wandering-grass-secret-service-jpg.jpg",
  "link": "https://www.wnd.com/2022/04/bidens-resignation-great-reset-end-shemitah/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Lively",
  "authorUrl": "https://www.wnd.com/author/slively/",
  "termIds": [
    895,
    895,
    1647,
    1647,
    2087,
    2087,
    2429,
    2429
  ],
  "sentences": [
    "\"Anyone but Joey the Scapegoat would suffer severe consequences for screwing things up so colossally  even for what he has already done, let alone what comes next  but as I said in my Afghan hypothesis: 'My guess is that the Hollywood scriptwriter helping Barack Obama design his return-to-power strategy wants to give Joe  ever the faithful Waterboy for the Uniparty  a tragic exit designed to maximize public sympathy for him now and in the history books.",
    "On Aug. 20, 2021, I outlined a scenario by which \"Obama [would] be called out of retirement and retake the world stage  returning [him] to the White House by whatever sequence of resignation, appointments and resignations would best work to retire Biden, minimize a Harris presidency and place Obama back on the throne.",
    "I think my oft-repeated prediction of a winter 2021/22 \"great collapse\" to justify the \"great reset\" has partially come to pass, but I may have been wrong about a spring recovery because the pain and suffering still seems too minimal to drive people to their knees in surrender to the elites.",
    "And given that the start of this seven year \"peace\" period begins the countdown to the unveiling of the Antichrist (the first three and a half years of which he rules as a seemingly benign power), the return of Obama to the U.S. presidency in that context would seem especially significant.",
    "The elites will use the situation to put all the blame for everything on the guy who can't really be blamed because he's not mentally competent, and who \"nobly and sacrificially stepped aside to make way for the only person truly capable of fixing these problems: President Barack Obama.\"",
    "Faith\nCommentary\nJoseph Farah\nMychal Massie\nMichael Master\nRead all of today's COMMENTARY...\nEducation\nWorld\nU.S.\nMoney\nPolitics\nHealth\nDiversions\nMORE COMMENTARY\nRachel Alexander\nMichael Brown\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "If, as many believe, we are now in the period of time Jesus described in Matthew 24 as \"the beginning of sorrows,\" this coming seven-year Shemitah cycle could very well be the period of the \"seven-year peace treaty\" many believe is prophesied in Daniel 11.",
    " [Plus] whatever consequences and culpability there might be for the election fraud emerging from the shower of evidence that's about to begin, could be deflected to Biden as well, along with the mantra 'but hey, hasn't the poor guy suffered enough?'\"",
    "In my WND column of Oct. 25, 2021, I went further and predicted a scenario through which Biden could be removed with the least damage to the Democratic Party, writing, \"I've long predicted that Joe will be the scapegoat for whatever goes wrong.",
    "Vladimir Putin has publicly set May 9 as the end date of his \"Special Military Operation\" in Ukraine  to emphasize the anti-Nazi theme he has used to justify it (May 9 being the date of Russia's final victory over Nazi Germany in WWII).",
    "Speculation is rife that the elites are about to dump Joe Biden, given that the corporate media have begun to turn against him and the deep state is allowing the Hunter Biden laptop to go fully public.",
    "That battle would most certainly go to the Supreme Court, where, conveniently, Obama's main man John Roberts (the guy who killed all the pro-Trump election fraud lawsuits) is still Chief Justice.\"",
    "I personally have never scratched Obama from the top of my list of candidates for the Antichrist, and included him as a candidate in the introduction to my book-in-progress, \"Dynasty of Darkness.\"",
    "But the 2022 primary season is far less important than the November elections, and thus the game-changing impact of the great reset  a one-time event  would seem to be more useful in the fall.",
    "I hypothesized during the Afghanistan debacle that the elites might stage a Biden stroke during a staged hostage crisis (a la Benghazi) as part of an Obama return-to-power strategy.",
    "I could be wrong, but to my knowledge I was the first to suggest that a reinterpretation of the 22nd Amendment could be the vehicle for Obama's return to the presidency.",
    "IF Russia is able to pull that off, and IF the globalists don't force us into WWIII in the interim, we might still see a U.S. version of the \"great reset\" before summer.",
    "As quoted in Politico during the primary, 'One Democrat who spoke to Obama recalled the former president warning, \"Don't underestimate Joe's ability to f**k things up.\"'",
    "[But] today I think the most likely [is a] 'Great Reset' scenario [featuring a] 2021/22 winter collapse followed by a spring recovery that features Biden's removal.",
    "All accompanied by a unified chorus of legal experts and media pundits spinning a new interpretation of the 22nd Amendment regarding presidential term limits (e.g.",
    "Go here to get a free link to both \"Dynasty of Darkness\" and \"The Prodigal Son Prophecy\" (addressing the timing of the Rapture and other last days events).",
    "I still think its more likely they'll stage a stroke or similar sympathy-stirring health crisis that prompts him to resign \"for the good of the nation.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "For all those reasons I'm now leaning more toward a fall \"reset,\" a conclusion strongly bolstered by two additional reasons: politics and prophecy.",
    "Politically speaking, the timeline of the great collapse and reset has always been dictated by the U.S. election cycle, specifically 2022 and '24.",
    "First, I want to reiterate that I don't expect Biden to face a \"hostile takeover\" or removal through use of the 25th Amendment against his will.",
    "it only limits 'two elections' after all  not an appointment to VP by Harris, followed by her resignation and reappointment to VP by Obama).",
    "I had also suggested in the past that war could be the catalyst for collapse, but hadn't specifically predicted the Russia/Ukraine conflict.",
    "Given how close we seem to the outbreak of World War III, the possible need for such a treaty appears more and more plausible.",
    "The next one begins on the Feast of Trumpets, which runs from the evening of Sept. 25 through the 27th.",
    "Prophetically speaking, this is the seventh and final year of the current Shemitah cycle (2016-2022).",
    "Some have gone further and speculated that they intend to put Barack Obama back into the White House.",
    "Today I'd like to both update my predictions and bring them within the scope of biblical prophecy.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "But we know they really want this war because they really want, and need, a great collapse.",
    "I have been a card-carrying member of the latter group for a very long time.",
    "The globalists can't under any circumstances allow Trump to be reelected.",
    "Obama himself pretty much telegraphed Biden's usefulness as a scapegoat.",
    "We're suffering a serious decline, but not yet a real collapse."
  ]
}