{
  "id": 918,
  "mediaId": 675,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Text confirms Hillary's 'conspiracy' to steal election, says special counsel",
  "image": "https://www.wnd.com/wp-content/uploads/2022/04/hillary-clinton-meet-the-press.jpg",
  "link": "https://www.wnd.com/2022/04/text-confirms-hillarys-conspiracy-steal-election-says-special-counsel/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    2429,
    2429,
    1488,
    1488,
    2321,
    2321,
    1147,
    1098,
    1098,
    1158,
    1158,
    1147,
    182,
    182,
    2590,
    2590
  ],
  "sentences": [
    "It's a text message showing Clinton lawyer Michael Sussmann falsely told the FBI he was not working on behalf of any client when he delivered to the bureau the bogus claim that Donald Trump had a secret communication channel with the Kremlin at the Moscow-based Alfa Bank to hijack the election, Just the News reported\nIn his filing Monday, Durham wrote that the \"parties,\" referring to Sussman, the Clinton campaign and researchers, \" acted as 'joint venturer[s]' and therefore should be 'considered as co-conspirator[s].'\"",
    "In a court filing late Monday night, the special counsel probing the origins of the Obama administration's investigation of the now- debunked charge of Trump-Russia collusion clearly stated where all the evidence he has compiled is leading: Hillary Clinton, her operatives and her campaign formed a \"joint venture or conspiracy\" to undermine Donald Trump and bolster her chance of fulfilling her lifelong ambition to become president of the United States.",
    "The special counsel wrote that the \"evidence, public information, and expected testimony clearly establishes by a preponderance of the evidence that the defendant and Tech Executive-1 worked in concert with each other and with agents of the Clinton Campaign to research and disseminate the Russian Bank-1 allegations.\"",
    "The text message revealed Monday in the court filing  from Sussman to then-FBI General Counsel James Baker  will be used by prosecutors to show Sussmann lied to the FBI but then told the truth about working on behalf of the Clinton campaign when he later testified to Congress.",
    "\"In fact, the defendant had assembled and conveyed the allegations to the FBI on behalf of at least two specific clients, including (i) a technology executive (Tech Executive-1?) at a U.S.-based Internet company (Internet Company-1?), and (ii) the Clinton Campaign.\"",
    "\"Hard evidence, emails and text messages, showing the Clinton Campaign, Fusion GPS, Perkins Coie, Joffe, and the media were all synced in August of 2016 pushing the false Alfa Bank server story, while also all working on the Steele Dossier matter,\" Patel said.",
    "Faith\nCommentary\nMychal Massie\nScott Lively\nBrian Sussman\nRead all of today's COMMENTARY...\nEducation\nHealth\nMoney\nU.S.\nDiversions\nWorld\nPolitics\nMORE COMMENTARY\nOliver L. North & David Goetsch\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "\"We had a conversation, as lawyers do with their clients, about client 1 needs and objectives and the best course to take for a client,\" Sussmann told then House Intelligence Committee Republican investigative counsel Kash Patel.",
    "Durham said in the court filing he will present evidence that Sussmann worked with the Clinton campaign, tech executive Bruce Joffe, identified as Tech Executive-1, and others in a \"joint venture\" to promote the Alfa Bank hoax.",
    "The compendium of bogus, salacious claims against Trump  later shown to be sourced by anonymous Russian operatives  was the catalyst for Obama Justice Department's investigation of alleged Trump-Russia collusion.",
    "The claim about the Moscow bank wasn't the only bogus story Clinton's campaign was peddling to the Obama administration to further her alleged fraudulent \"joint venture\" to clear her way to the White House.",
    "Last week, the Federal Election Commission fined Clinton's 2016 presidential campaign and the Democratic National Committee for hiding its funding of the now-debunked, anti-Trump Steele dossier.",
    "Patel, the former House investigative counsel, worked with then Rep. Devin Nunes, R-Calif., to expose the Obama the fraudulent foundation of the Trump-Russia investigation.",
    "Durham's motion said Sussman \"lied in that meeting, falsely stating to the General Counsel that he was not providing the allegations to the FBI on behalf of any client.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "I mean, I don't want to imply that I was sort of directed to do something against my better judgment, or that we were in any sort of conflict.\"",
    "He told Just the News that the Durham \"has just shown the whole world what major pieces of our Russiagate investigation revealed.\"",
    "I have something time-sensitive (and sensitive) I need to discuss,\" Sussmann wrote to Baker on Sept. 18, 2016.",
    "It was the primary evidence presented to a secret FISA court to obtain warrants to spy on the Trump campaign.",
    "In House testimony one year later Sussmann admitted he was operating at the instruction of his client.",
    "Will Hillary Clinton ever face criminal charges for her role in the Trump-Russia collusion hoax?",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "\"Durham submits all this evidence as 'joint venture conspiracy' under the rules of evidence.\"",
    "U.S. Attorney John Durham's filing featured new evidence to back his operating thesis.",
    "I'm coming on my own  not on behalf of a client or company  want to help the Bureau.",
    "\"And so it may have been a decision that we came to together.",
    "TRENDING: April 14 is National Not Ashamed of Jesus Day!",
    "\"Do you have availability for a short meeting tomorrow?",
    "\"Jim  it's Michael Sussmann.",
    "Thanks.\""
  ]
}