{
  "id": 920,
  "mediaId": 195,
  "date": "4/3/2022 12:00:00 AM",
  "headline": "The Memo: Democrats pin hopes on Ketanji Brown Jackson to revive Black support",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/brownjacksonketanji_032322gn4_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/administration/3256890-the-memo-democrats-pin-hopes-on-ketanji-brown-jackson-to-revive-black-support/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage/",
  "termIds": [
    2347,
    2347,
    2034,
    2034,
    2081,
    2081,
    2030,
    2030,
    2087,
    2087,
    1536,
    1536,
    1978,
    1978,
    1147,
    1147,
    998,
    998,
    892,
    892,
    482,
    482,
    428,
    428,
    577,
    577,
    2791,
    2791,
    2910,
    2910,
    2958,
    2958
  ],
  "sentences": [
    "Glynda Carr, the president of Higher Heights for America, said that the likely confirmation of Jackon to the Supreme Court showed Biden living his values in terms of the importance of diversity and inclusion that he set forth as a candidate.?\nCarr, whose organization supports and promotes Black female leadership, acknowledged that voting rights had not been protected as she would like and that efforts at police reform have not yet succeeded.",
    "A White House fact sheet from late February asserted that from the first day in office and every day since? the administration had taken an historic approach to advancing racial equity.?\nThe president and his supporters point to the passage of the American Rescue Plan (ARP) roughly a year ago, which they say helped people with lower incomes  a demographic that is disproportionately Black  in numerous ways.",
    "In his recent State of the Union address, Biden pushed back against a central slogan of the left with a call to fund the police!?\nHow much more money could they possibly need?? asked Elzie, who first became politically active after the police shooting of Michael Brown in her hometown of Ferguson, Mo., in 2014. More training, blah blah blah.",
    "Cornel West, the prominent Black academic and author, told this column that Jackson was a brilliant, visionary judge of great integrity? who had been treated with ugly disrespect? by some of the Republican members of the Senate Judiciary Committee at her recent hearings.",
    "Around the same time, Elie Mystal wrote in The Naton that when he had voted for Biden in November 2020, he was hoping for actual policies, not merely appointments and platitudes.?\nFor the left, it's not only Biden's failure to make headway that causes frustration.",
    "When it comes to the politics of representation, Biden can point to Vice President Harris, Defense Secretary Lloyd Austin and Chair of the Council of Economic Advisers Cecilia Rouse, among others, as the first Black people to hold those posts.",
    "They also note efforts to address housing discrimination, a $5.8 billion investment in Historically Black Colleges and Universities (HBCUs), more money for education and a concerted attempt to avoid racial disparities in healthcare.",
    "We are living in a hyperpartisan, divisive time and policies that would impact African Americans and Black women have fallen short with the membership of our current Congress,? she said, urging people to stay engaged.",
    "But she praised the White House for its major legislative achievements, including the passage of a huge infrastructure bill late last year, and placed the blame for the other shortcomings at the feet of Congress.",
    "Sen. Susan Collins (R-Maine) became the first Republican to back her this week, while the most conservative Democrat in the upper chamber, Sen. Joe Manchin (D-W.Va.), also announced his support.",
    "How can't they afford more training with the money they are getting??\nBut the Biden administration, aware of the stakes, is sensitive to the suggestion that it has let down Black supporters.",
    "The nation's economic troubles and the lingering effects of the COVID-19 pandemic have pulled down his support among the broader Black community  even more so than with the nation at large.",
    "President Biden and his party have been grappling with a lack of enthusiasm among Black voters  and they're hoping the confirmation of Judge Ketanji Brown Jackson can turn things around.",
    "But when it comes to Biden, West said, He is making such a marvelous choice of Judge Jackson but not really fighting for voting rights that are disproportionately affecting Black voters.",
    "Progressive Black commentators suggest Biden bears at least some of the blame for the failure to achieve more  even as they celebrate Jackson's likely confirmation to the Supreme Court.",
    "I am hearing people who were super-enthusiastic last election now saying, Well, I haven't gotten anything for my vote,'? said one well-known Black activist, Johnetta Elzie.",
    "By contrast, Biden's approval numbers with Hispanic voters and white voters during the same period declined by just five points and 10 points, respectively.",
    "The share of Black adults approving of Biden's job performance fell a startling 32 points since July 2021, from 88 percent to 56 percent, the poll found.",
    "A Quinnipiac University poll in January showed Black approval of Biden having fallen by 21 points in a year, from 78 percent to 57 percent.",
    "Biden has signally failed to make much progress on two issues of particular importance to Black activists, police reform and voting rights.",
    "Those moves make it hard to see how Jackson, a former public defender now serving as a federal appellate court judge, can be thwarted.",
    "There are, too, some in the Black community who sound positive notes about Biden's record, even as they acknowledge its imperfections.",
    "We have got to look at both the best of Biden and the worst of Biden.?\nOther prominent Black voices have also been raised in dissent.",
    "A Marquette University Law School poll this week indicated that the erosion of support for Biden among Black voters has been stark.",
    "Biden promised shortly before the South Carolina primary to appoint a Black woman to the high court if he won the presidency.",
    "Whether those kinds of appeals are heeded could go a long way toward determining the outcome of November's midterm elections.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He held back in that fight, and he wouldn't push against the [Senate] filibuster and now it looks like it's too late.",
    "I know there is usually some disappointment, but this just seems different.?\nData backs up the anecdotal evidence.",
    "If she is confirmed, Biden will have kept a promise first made during the 2020 Democratic nomination process.",
    "Black people are weary of this political dance, of being drawn near and then pushed away,? Blow wrote.",
    "The potential for Ketanji Brown Jackson to boost Black enthusiasm should not be written off either.",
    "Jackson stands all but assured of making history as the first Black woman on the Supreme Court.",
    "It's the perception that he has pivoted to court white centrists and moderate conservatives.",
    "New York Times columnist Charles Blow penned an open letter to Biden in early March.",
    "But right now, the signs do not look promising for Biden and his party.",
    "Whether Jackson can do the same for his presidency remains to be seen.",
    "His victory in the Palmetto State resuscitated his candidacy.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Memo is a reported column by Niall Stanage."
  ]
}