{
  "id": 926,
  "mediaId": 675,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Biden and Harris 'incompetent'? See how many Americans think so",
  "image": "https://www.wnd.com/wp-content/uploads/2021/04/joe-biden-kamala-harris-flag-colonnade.jpg",
  "link": "https://www.wnd.com/2022/03/biden-harris-incompetent-see-many-americans-think/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    2087,
    2087,
    2030,
    2030,
    895,
    895,
    1147,
    1147,
    1335,
    1335,
    2945,
    2945
  ],
  "sentences": [
    "IMPORTANT NOTE: The latest issue of WND's critically acclaimed Whistleblower magazine (available in both print and digital versions) insightfully explores the rapidly growing runaway inflation being visited upon America by the Biden administration, and is titled \"THE LOOTING OF AMERICA: How the elites are robbing everyone else through runaway inflation and skyrocketing prices.\"",
    "Read all of today's COMMENTARY...\nHealth\nMoney\nWorld\nEducation\nPolitics\nDiversions\nU.S.\nMORE COMMENTARY\nMichael Brown\nPatrick J. Buchanan\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "He continued, \"The results follow a series of apparent mental flubs by the 79-year-old president, the latest being a flip, flop, flip on calling for the ouster of Russian President Vladimir Putin.",
    "25th Amendment chatter sparked by 'dangerous' remarks\nFurther, the polling shows that Americans are backing a brain test for House Speaker Nancy Pelosi, an octogenarian, too.",
    "A huge 68% of Republican primary voters want President Trump to return to the ballot for 2024, and if he runs, 82% of Republican primary voters promise to support him.",
    "Neither is it a secret that, based on his behavior that some consider indications of dementia, many would like Biden to take a cognitive test and release the results.",
    "Paul Bedard in his Washington Secrets column noted it was a \"growing sign of voter concern about the cognitive abilities of the nation's elderly leadership.\"",
    "The polling also revealed a huge reversal  about the time Biden launched his campaign  and COVID-19 hit  in those who believe the nation is in recession.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "The pollster explained in an analysis at Newsmax, \"This means six in 10 voters view either our president, the vice president or both as incompetent.",
    "Majorities also blame Biden more than Vladimir Putin for surging gas prices, and 68% said American should be expanding its oil and gas industry.",
    "It's no secret to anyone that many Americans disapprove of Joe Biden's performance in office, as well as the work attempted by Kamala Harris.",
    "But now a new poll from McLaughlin & Associates reveals that six of 10 Americans think either Biden or Harris  or both  are \"incompetent.\"",
    "On the question of competency, 15% say Biden is more incompetent, 11% say Harris is more incompetent, and 33% say both.",
    "Harris is viewed favorably by only 40%, but that was better than Pelosi, who is seen favorably by only 33%.",
    "This is a very disturbing result at a time when inflation is rampant and war is threatening the world.\"",
    "Sixty-five percent say the nation is on the wrong track; only 29% said it is the right direction.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "Republicans draw 48% of the support in a generic ballot for Congress, to the Democrats' 44%.",
    "Before that time, under President Trump's tenure, nearly 70% said there was no recession.",
    "Fifty-eight percent said Biden should take a cognitive test and release the results.",
    "Yesterday, his staff wrote him a notecard titled 'Tough Putin Q&A Talking Points.'\"",
    "In a hypothetical rematch between President Trump and Biden, Trump wins 49%-46%.",
    "The polling revealed virtually no bright spot for the Biden administration.",
    "And a full 55% said Biden won't even last to the end of his elected term.",
    "Faith\nCommentary\nScott Lively\nMychal Massie\nElizabeth Lee Vliet, M.D.",
    "Trump would beat Harris and Hillary Clinton by even larger margins.",
    "And worse is the 70% who say the economy is getting worse now.",
    "A minority of 35% said neither was incompetent.",
    "And 57% disapprove of Biden's job performance.",
    "TRENDING: Biden to get the hook?",
    "Currently 53% say there is."
  ]
}