{
  "id": 934,
  "mediaId": 129,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Beyond Beyonc Fame, Awol Erizku Expands What Black Art Can Be",
  "image": "https://static01.nyt.com/images/2022/03/08/arts/08erizku-2/merlin_203251992_96547c4a-2600-450a-bbd3-f217ce5a68d8-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/03/08/arts/design/awol-erizku-beyonce-photographer-gagosian.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    685,
    764,
    817,
    1265,
    1919,
    2171,
    2187,
    2330,
    65,
    205,
    2762
  ],
  "sentences": [
    "That's been the work of painting.?\nLast year, Public Art Fund featured 13 of Erizku's photographs on bus shelters across New York City and Chicago in a show called New Visions for Iris? that included a still-life addressing mass-incarceration and a portrait of Michael Brown Sr.\nHe's part of an art historical conversation,? said Daniel S. Palmer, the fund's curator, from old masters to the contemporary imagery of our current moment.?\nThe Gagosian exhibition is meaningful, Sargent said, in part because it expands the notion of what Black art can be at a time when Black portraiture has become the market rage.",
    "Erizku said he experienced an immediate comfort with him, feeling for the first time I didn't have to explain the work.?\nBorn in Ethiopia and raised in the South Bronx  Erizku describes himself as from the projects?  he got into trouble in junior high school and said, art was the only way out for me.?\nA sketcher and doodler, he went to the High School of Art and Design in Manhattan, started out doing medical illustrations and picked up a camera at Cooper Union, where in 2010 he received his bachelor's degree in fine arts.",
    "I'm not a photographer for hire.?\nThe desire to bring Erizku's work to the attention of the wider art world is part of what fueled the desire of Antwaun Sargent, a director and curator at the Gagosian, to give him the gallery's Park Avenue space for a show opening March 10.\nAwol is one of the photographers in the Black vanguard who are saying boundaries do not apply to the realities or the conditions in which we are making images,? Sargent said.",
    "But in a recent interview at his sprawling studio in Downtown Los Angeles, Erizku, 33  wearing Doc Martin boots on his feet and a floppy hat over his dreadlocks, as the Ethiopian pianist Emahoy Tsegu-Maryam Gubrou played on the speakers  said he considers himself first an artist, one who also works in painting, sculpture and video installation.",
    "In his third year at Cooper Union, Erizku riffed on Vermeer's Girl With the Pearl Earring,? creating the photograph Girl With the Bamboo Earring,? featuring a Black woman in a large heart-shaped hoop earring, which attracted public attention (an edition sold at Phillips auction house in 2017 for $52,500).",
    "There are a lot of barriers to entry when it comes to the art world.?\nErizku often incorporates wildlife in his images  he photographed the hip-hop star Nipsey Hussle with a horse, Michael B. Jordan with a falcon and a wolf; Gorman with a bird (that now chirps in a cage by the window in Erizku's studio).",
    "He added that it was a way to continue a conversation beyond some of the fashionable notions of the Black figure.?\nSargent pointed to long-overdue recognition of Black photographers such as Anthony Barboza as well as Ming Smith and the 1960s Kamoinge group, recently featured at the Whitney.",
    "With an exhibition at Gagosian, Erizku reaches a broad audience, and hopes he is seen as more than a photographer for hire.?\nLOS ANGELES  True, Awol Erizku may be best known for his beatific photograph of a pregnant Beyonc, which in 2017 was the most liked post in Instagram's history.",
    "If we're being honest about saying that we want to make sure that all voices are represented in the art world, we have to be serious about providing platforms for artists who are thinking in ways that are divergent from traditional notions around image making,? Sargent said.",
    "We need to use every strategy to make sure that our images are seen and appreciated,? he said, because frankly the art world did not care.?\nShowing Erizku in the Gagosian space Park & 75  a storefront visible from the street  gives the exhibition significant accessibility.",
    "For me, that is significant.?\nErizku's exhibition, Memories of a Lost Sphinx,? situates six light-box photographs in a black-painted interior along with a mixed-media sculpture that reimagines the Great Sphinx of Giza as an amalgam of Egyptian, Greek and Asian influences.",
    "Public Art Fund, in 2017, showed Erizku's work on Wi-Fi kiosks in all five boroughs as part of the exhibition Commercial Break.?\nIn 2019, the curator Allison M. Glenn included Erizku in her show Small Talk? at Crystal Bridges Museum in Bentonville, Ark.",
    "In 2012, he was featured in a group show at the Flag Art Foundation and then had two solo shows at the now closed Hasted Kraeutler gallery in Chelsea before joining Ben Brown in London and Hong Kong followed by the Night Gallery in Los Angeles.",
    "His primary interest, the artist said, is being able to communicate and elevate Black images, whether of the actress Viola Davis, African masks, nail salon hands, Ethiopian sex workers or the basketball player Kevin Durant.",
    "He said he was inspired early on by the radical 1974 performance of Joseph Beuys  I like America and America likes me''  in which the German artist spent a week in his dealer's gallery, fenced in with a live coyote.",
    "It's important for me to create confident, powerful, downright regal images of Black people.?\nSargent has known Erizku since interviewing him for Complex magazine about his exhibition The Only Way Is Up? in 2014.",
    "I want to be remembered for Black imagination,? Erizku said, to expand the limits of Black art.?\nAwol Erizku: Memories of a Lost Sphinx\nMarch 10-April 16, Gagosian Park & 75, 821 Park Avenue, Manhattan.",
    "You have photographers in Lagos, London, Johannesburg, New York and Los Angeles making images that defy easy categorization and that are emphasizing Black desire, Black beauty and Black community.",
    "And Erizku has taken many other memorable images of celebrities, including the young inauguration poet Amanda Gorman for the cover of Time and the Black Panther? actor Michael B. Jordan for GQ.",
    "That is a refreshing perspective to have, particularly when it comes to the extremely white history of photography.?\nHow are we, as an art world, going to ignore that?? Sargent continued.",
    "Erizku was particularly inspired by the work of artists like Richard Prince, Jeff Wall, Roe Ethridge, Marcel Duchamp and David Hammons  the ones who worked outside the margins,? he said.",
    "With more Black artists showing than ever, there is still a problem with museums and galleries attracting those audiences to see the work of members of their community,? he said.",
    "But early on he mastered the world of social media by treating Instagram as his gallery, selectively opening his feed for public viewing at appointed hours.",
    "The work has an aesthetic appeal  you want to look at it,? said the collector Glenn Fuhrman, a founder of Flag and longtime supporter of Erizku's work.",
    "Doing exhibitions like this one helps to expand beyond an overemphasis on figurative painting,? though he noted that figurative work is valid.",
    "The cost of Erizku's work is on the low end for a major gallerist like Gagosian, with pieces selling for about $40,000 to $60,000.",
    "To some extent, Erizku has bypassed the gatekeepers, given that he's been presenting his own shows on social media for years.",
    "The power of his practice is that it has an accessibility at multiple points for lots of different people,? Glenn said.",
    "But there is always a lot more going on beneath the surface.?\nSome members of the art world have already taken notice.",
    "From there it was on to Yale, where he studied with the photographer Gregory Crewdson and earned his MFA in 2014.",
    "There is also a golden spinning disco ball, Nefertiti  Miles Davis,? in the shape of the Egyptian queen.",
    "I'm deconstructing the mythological components that make up the Sphinx,? Erizku said.",
    "But Sargent said it is critical for blue-chip galleries to showcase new perspectives.",
    "The art world has flattened the ways in which Blackness operates,? Sargent said.",
    "It's something that I'm adamant about,? he said.",
    "He relies upon and shifts recognizable symbols.",
    "He is currently not represented.",
    "212-796-1228; gagosian.com.",
    "That is art history."
  ]
}