{
  "id": 939,
  "mediaId": 675,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "On Ukraine, NATO and environmentalists",
  "image": "https://www.wnd.com/wp-content/uploads/2020/03/warplanes-air-force-sky-jets-military-defense.jpg",
  "link": "https://www.wnd.com/2022/02/ukraine-nato-environmentalists/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Prager",
  "authorUrl": "https://www.wnd.com/author/dprager/",
  "termIds": [
    2171
  ],
  "sentences": [
    "If the strongest boy in high school, one whom the weakest boys and girls looked to for protection, decided one day to watch rather than to protect them as they were beaten by the school bully, even if there was good reason for the lack of intervention, wouldn't that be a very sad day?",
    "But the environmental movement, which dominates the Democratic Party and nearly every Western European country, has made Russia the major supplier of natural gas to Europe, and especially to the most important country on the European continent, Germany.",
    "The environmentalist movement uses climate change to achieve its primary objectives: undoing of the West's economic foundations, reshaping the Western way of life, dismantling capitalism and transferring wealth to the Third World.",
    "1: The NATO excuse\nA widely offered explanation for the Russian invasion of Ukraine is that Russia  which at this time essentially means President Vladimir Putin  fears the expansion of NATO to its borders, especially Ukraine.",
    "America is aiding Ukraine with arms and economic sanctions, but as I watch peaceful Ukraine devoured by aggressive Russia, I can't help but think that it appears that evil will triumph  and lead to more evil on Earth.",
    "TRENDING: Russian military has mobile crematoriums to 'evaporate' dead soldiers, civilian casualties: Report\nIt is even more absurd when one considers the countries Russia allegedly fears will invade them.",
    "It was Trump who had the courage to do what president after president and Congress after Congress called for but never acted on: moving the American embassy in Israel to Israel's capital city, Jerusalem.",
    "This was the excuse that many professional excuse makers made for the Soviet Union's shooting down  without any warning  Korean Air Lines Flight 007 in 1983, killing all 269 passengers and crew.",
    "One reason is that since World War II, the weaker nations of the world have all held onto the hope that should they be attacked by a stronger nation, Americans would come to their aid.",
    "A second explanation is that Russia is \"paranoid\" as a result of its having been devastated by the invasions of Napoleon's France in the 19th century and Hitler's Germany in the 20th.",
    "But every American should feel awful  morally and as an American  about America sitting by and watching the first major invasion of a peaceful country since Hitler and Stalin.",
    "We'll end the \"paranoid\" discussion with this rule of history: Generally speaking, wars are either between two police states or between a police state and a free state.",
    "That, of course, was the reason so many dismissed Donald Trump when he ran for president: \"He has no political experience, he's just a wealthy real estate developer.\"",
    "If you really believe climate change poses an \"existential threat\" to human life, there is no price too high to pay in order to eliminate fossil fuel-based energy.",
    "The argument is often presented as an analogy: How would the United States react if Mexico had a mutual defense pact with Russia and received weapons from Russia?",
    "By general consensus among the world's media and world's nations, Ukraine's President Volodymyr Zelenskyy is the most courageous leader in the world today.",
    "When I was a graduate student at Columbia University's Russian Institute, I regularly encountered the \"paranoid\" explanation for Soviet/Russian policies.",
    "Honest haters of Trump must at least acknowledge his courage  just as supporters must acknowledge his lack of a filter between his brain and his mouth.",
    "Biden is a lifelong politician and, as his behavior during COVID-19 showed, may well be the least courageous president in American history.",
    "When that fact is combined with Russia's vast nuclear weaponry, the \"paranoia\" explanation for Russian aggression is rendered absurd.",
    "They will pursue these aims at any cost  whether crippling inflation, energy blackouts, even the strengthening of Russia and China.",
    "Politics\nEducation\nMORE COMMENTARY\nPatrick J. Buchanan\nMichael Brown\nDennis Prager\nRead all of today's COMMENTARY...\nNew Section",
    "Which one of their Western-border countries  Latvia, Estonia, Lithuania, Moldova, Belarus, Ukraine  is likely to invade Russia?",
    "Seymour Hersh, the best-known New York Times investigative reporter for decades, wrote a book on the shooting down of KAL 007.",
    "It was Trump who had the courage to demand that our NATO allies live up to their obligations with regard to military spending.",
    "It was Trump who took on the mainstream media, regarded by half of America as little better than Pravda, the Soviet newspaper.",
    "It is overwhelmingly likely that American and European environmentalists made the Russian invasion of Ukraine possible.",
    "Diversions\nCommentary\nMychal Massie\nRachel Alexander\nRead all of today's COMMENTARY...\nWorld\nHealth\nFaith\nMoney\nU.S.",
    "For many people, this is particularly remarkable since Zelenskyy's professional background is that of a comedian.",
    "Russia is by far the largest country on Earth, spanning approximately one-ninth of all the world's land surface.",
    "It was Trump who uncovered a deep state of corruption in nearly every major American governmental institution.",
    "As described in a 1986 New York Times book review, \"On the Soviet side, writes Mr. Hersh, there was paranoia.\"",
    "I know of no American, on the right or the left, who has called for sending the U.S. military into Ukraine.",
    "It strikes most people as amazing that a comedian turns out to be the world's most inspiring leader.",
    "However, that real estate developer also turned out to be the most courageous leader in the world.",
    "Under Trump, America became energy independent and was even able to supply Europe with energy.",
    "He did this despite the opposition of almost every world leader and his own State Department.",
    "It is therefore not at all surprising that a comedian is the world's most courageous leader.",
    "It is surprising that people still think a lifelong political career produces leaders.",
    "I have never agreed with the throwaway line, \"America is not the world's policeman.\"",
    "And it remains a fact that Putin did not invade Ukraine while Trump was president.",
    "Most Americans see themselves as protectors of the weak against bully nations.",
    "This is the first time in our lifetime that America has abandoned that role.",
    "And the latter are nearly always initiated or provoked by the police state.",
    "It struck me then, and even more so now, as pathologic or false, or both.",
    "Ironically, thanks to Putin, the NATO countries are finally doing so.",
    "3: A comedian is the world's most courageous political leader.",
    "\"The Russians are paranoid\" became a widespread explanation.",
    "And wouldn't it affect the way the protector saw himself?",
    "Neither Putin nor anyone else fears President Joe Biden.",
    "Western environmentalists made the invasion possible.",
    "That includes empowering and enriching evil men.",
    "Russia has nothing to fear from its neighbors.",
    "Its neighbors have plenty to fear from Russia.",
    "Wasn't every one of them invaded by Russia?",
    "Shouldn't every one of them be paranoid?",
    "America is watching, not intervening.",
    "Does the world not need a policeman?",
    "If that's not courage, what is?",
    "And if not America, who?",
    "Putin feared Trump.",
    "The U.N.?",
    "Russia?",
    "China?",
    "No.",
    "No.",
    "2.",
    "4."
  ]
}