{
  "id": 940,
  "mediaId": 675,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "Pollster: Trump would win 2024 race in 'electoral landslide'",
  "image": "https://www.wnd.com/wp-content/uploads/2021/12/license-plates-florida-trump-47-donald-republicans-jk.jpg",
  "link": "https://www.wnd.com/?p=4985871",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    2087,
    2087,
    2188,
    2188,
    1669,
    1669,
    1147,
    1147,
    1155,
    1155,
    1158,
    1158,
    895,
    895
  ],
  "sentences": [
    "World\nCommentary\nMychal Massie\nRachel Alexander\nRead all of today's COMMENTARY...\nHealth\nFaith\nU.S.\nMoney\nEducation\nPolitics\nDiversions\nMORE COMMENTARY\nPatrick J. Buchanan\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "Columnist Paul Bedard at the Washington Examiner explained \"pollster John McLaughlin predicted an 'electoral landslide,' telling Secrets, 'Trump would win the needed battleground states by an even higher margin' than in 2020.\"",
    "And in a move that reversed the opinion of economic solidarity during President Trump's term, and coincided with Biden's move into the White House, 57% say the nation is in a recession, while only 38% say it isn't.",
    "Former President Donald Trump, if he moves forward with a 2024 run for the White House, would win an in \"electoral landslide,\" according to a new poll that looks at the politics of the coming presidential campaign.",
    "In fact, those Democrats who are \"undecided\" about their party's candidate for 2024, at 13%, outnumber those supporting any other candidate except Biden's 23% and Michelle Obama's 19%.",
    "President Joe Biden, who has just finished the first year of his term, would get only 23% of the vote in even his own party's primary, said the poll from McLaughlin & Associates.",
    "\"Notably, support for 2016 Democratic nominee Hillary Clinton, who has stirred new reports that she's eager to run again, came from just 4% of Democratic primary voters.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "Among other points that suggest a failing Biden term in office:\nA huge 64% say America, under Biden, is going the wrong direction.",
    "This is the worst economic result since the coronavirus pandemic caused the economic shutdown in March and April of 2020.\"",
    "On the other side of the political divide, 66% of respondents want to see Trump run again and 80% would support him.",
    "Two-thirds, 63%, of the voters say the economy is getting worse, and only 31% said that it is getting better.",
    "An overwhelming 61% insisted that Biden \"should take a cognitive health test and release it publicly.\"",
    "McLaughlin said driving the nation's dissatisfaction with Biden and Democrats is the failing economy.",
    "Kamala Harris is about as bad as Biden, with only 40% favorable to her, while 54% are unfavorable.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "And the poll showed Trump would beat Biden 48%-45%, Harris by 50%-43% and Clinton 50%-43%.",
    "McLaughlin wrote, \"Two-thirds, 64%, of all voters say that America is on the wrong track.",
    "Only 32% say, right direction.' As gas and food prices rise, the top issue is inflation.",
    "The Examiner described Biden's lack of support from within his own party as \"shocking.\"",
    "And Vice President Kamala Harris is also an afterthought at 7%,\" Bedard reported.",
    "House Speaker Nancy Pelosi is even worse off, with only 36% seeing her favorably.",
    "Biden's job approval is down to 41%, while a majority of 57% say they disapprove.",
    "Biden's agenda has only 32% believing the country is moving the right direction.",
    "Some 55% say they have an unfavorable opinion of Biden, while only 43% approve.",
    "The Democrats' big government socialism programs are preferred by only 16%.",
    "On a generic ballot for Congress, a Republican beats a Democrat 47%-45%.",
    "The number of voters saying the economy is in recession rose to 57%.",
    "The survey once a month looks at the prospects for the 2024 race.",
    "More Democrats are surveyed than Republicans.",
    "And 63% say it's getting worse."
  ]
}