{
  "id": 942,
  "mediaId": 675,
  "date": "d2022-02-28T13:01",
  "headline": "Mexican cartels get support from 13 AMERICAN states",
  "image": "https://www.wnd.com/wp-content/uploads/2020/11/guns-bullets-ammunition-ammo-trigger-firing-women-targets-police-military-defense.jpg",
  "link": "https://www.wnd.com/?p=4985832",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Norris",
  "authorUrl": "https://www.wnd.com/author/cnorris/",
  "termIds": [
    2171
  ],
  "sentences": [
    "Legendary southern rock group Lynyrd Skynyrd, which produced mega-hits like \"Sweet Home Alabama\" and \"Freebird,\" put it well in their song (and album of the same title), \"God and Guns\":\nGod and guns\nKeep us strong\nThat's what this country\nWas founded on\nWell we might as well give up and run\nIf we let them take our God and guns\n(For a better understanding about who America's founders were and what they really established for us, please see my New York Times bestseller, \"Black Belt Patriotism,\" in which I address modern-day problems with our founders' solutions.",
    "If we doubt the true meaning of the Second Amendment, consider the words of Thomas Jefferson, who wrote near the end of his life in 1823: \"On every question of construction [of the Constitution], carry ourselves back to the time when the Constitution was adopted, recollect the spirit manifested in the debates, and instead of trying what meaning may be squeezed out of the text, or invented against it, conform to the probable one in which it was passed.\"",
    "Please also pick up a copy of Dr. Thomas G. West's amazingly redemptive book, \"Vindicating Our Founders,\" and share the information with your family and friends)\nContent created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "So now, they attempt to cut off the lifeblood of firearms: Let's badly batter the biggest gun manufacturers by keeping them tied up in litigation with Mexico from now until the presidential election, and in so doing limit their influence, resources and money therein.",
    "Several years ago, I shot (no pun intended) an NRA public service announcement in which I shared my conviction (First Amendment right) about self-defense (Second Amendment right) by saying, \"If some thug breaks into my home, I could use my roundhouse kick.",
    "Liberal Democrats, who have intentionally failed at just about everything under a Biden administration, have one last strategy left to complete for their Great Reset by 2030: to demolish the Second Amendment and disarm law-abiding Americans.",
    "I hope the red-state attorneys general try and block this U.S. support of the Mexican lawsuit, because we already know blue-state AGs (like in New York) have already been on a warpath to cripple the NRA's ability to lobby and support us.",
    "More and more, the constitutional pillars of American life and liberty are being attacked and abandoned, not only out of sheer bias and disobedience but ignorance of our founders, the Revolutionary period and the founding documents.",
    "Rather than stand up to the Mexican government and cartels' corrupt partnership in trafficking guns into their own country, 13 U.S. governors are allowing their states to support and enable the blame against U.S. gun manufacturers.",
    "), have backed the Mexican government's lawsuit against a group of U.S. gun manufacturers, including Smith & Wesson Brands, Inc., Barrett Firearms Manufacturing, Inc., Ruger & Co., Colt's Manufacturing Company LLC, and Glock Inc.",
    "Progressives have done enough sin-casting with one of their latest trends to blame \"wild, unsafe, Trump-supporting and fear-mongering gun owners\" for the run on firearms and ammunition throughout the Wuhan virus pandemic.",
    "But how crazy is it that local law officials have to create \"Second Amendment sanctuaries\" when America's founders declared the entire United States a Second Amendment sanctuary through our Bill of Rights?",
    "There's a ton of foreign news I want to comment about, including the U.S. enabling Iran to build its nuclear arsenal and the federal government's extremely weak stand in the Russia-Ukraine crisis.",
    "These actions are being taken in various states because of local officials' anticipation of further unconstitutional legislation restricting gun sales and ownership at the state or federal level.",
    "Answer: To strip U.S. gun manufacturers of money and power to produce any firearms at all, and therein reduce the rights and resources of good Americans to bear arms under our Second Amendment.",
    "Just a few years back, the Supreme Court even wrangled over the question: Should the government allow private citizens or only public servants (\"state militias\") \"to keep and bear arms\"?",
    "Here goes the government merry-go-round again: Americans can't be trusted to handle firearms, just like we can't handle COVID-19 protection without government control and intervention.",
    "The fact is, in the early days of our country, many states had gun laws that aligned with the constitutional standard, so it was no big deal to announce the law on a national level.",
    "Greg Abbott or Lt. Col. Allen West, should he win the primary, better be ready for progressives like Beto O'Rourke because they are teeing up this narrative to drive the midterms.)",
    "The U.S. southern border war is back in the news big time with the Mexican government's lawsuit against a group of U.S. gun manufacturers over trafficked arms into their country.",
    "It is the first time a foreign nation has attempted to sue gun manufactures for our loose southern border and the criminal activity of cartels trafficking guns into Mexico!",
    "Instead, these pivotal American rights have become the brunt end of cultural jokes and are often regarded as biased lifestyle components of \"rednecks\" and rural citizens.",
    "The last thing Americans should need to worry about right now is losing their constitutional right to protect themselves, and yet that's exactly what concerns us.",
    "\"A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed\" (italics mine).",
    "They'd then declare martial law against all the \"domestic right-wing terrorists\" and call in INTERPOL and the International NATO military to disarm Americans.",
    "What most don't have a clue about is that the legal sale of firearms is severely restricted in Mexico and actually controlled by the U.S. Defense Department.",
    "The lawsuit, however, which was announced last August, has ratcheted up with the partnership of Mexico's newest allies, and you won't believe who they are!",
    "The timing and distraction are not coincidental either, but a part of the master plan to cripple conservatives and Independents in the upcoming elections.",
    "With the Biden administration's wide-open border policy, many libs are still hell-bent on defunding the police while violent crime is at an all-time high.",
    "That is why Jefferson even encouraged his young nephew Peter Carr in a letter, \"Let your gun therefore be the constant companion of your walks.\"",
    "As U.S. Chief Justice John Roberts asked several years ago, \"If it is limited to state militias, why would they say 'the right of the people'?",
    "Faith\nMoney\nHealth\nEducation\nPolitics\nDiversions\nMORE COMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Today, more and more states are having to create \"sanctuaries for the Second Amendment,\" just as was done in counties in Utah and Virginia.",
    "The reason I was so adamant in that PSA is because there has been some movement in our country to erode our Second Amendment rights.",
    "It would be their greatest dream to incite another civil war by further branding pro-Second Amendment Americans as extremists.",
    "The fact is, they are empowering Mexico's inept government and, worst of all, the Mexican cartels corruption and trafficking.",
    "Thirteen states in the United States, including Massachusetts, California and New York along with the District of Columbia (!",
    "Progressives have to create and stir up a Second Amendment hornet's nest, especially since they have nothing left to run on.",
    "And they want to blame the spike in gun purchases on American patriots who, they say, don't know anything about gun safety?",
    "This is complete insanity and runs in the opposite direction from the constitutional republic America's founders started.",
    "At the same time, I'm appallingly alarmed by the onslaught of assaults that grow every year to strip us of them.",
    "World\nCommentary\nMichael Brown\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nRead all of today's COMMENTARY...\nU.S.",
    "Daniel Webster once said, \"The contest for ages has been to rescue liberty from the grasp of executive power.\"",
    "Since the Revolution itself, I believe we have been in the fight of our lives to safeguard American freedoms.",
    "And is it not perfectly clear what the ultimate outcome of those 13 U.S. states supporting Mexico's lawsuit?",
    "Like a sunset dropping over the horizon of our founders' dreams, so our freedoms are vanishing from view.",
    "The Bill of Rights either encompasses the privileges of every citizen in every amendment or none at all.",
    "And M. Grundler: \"It is easy to take liberty for granted, when you have never had it taken from you.\"",
    "(Please see the most recent excellent edition of Whistleblower magazine: \"The Real Insurrection.\")",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "But has anyone created more fear and COVID-chaos then the federal government and liberal media?",
    "So, thousands of guns are smuggled into Mexico by their country's own powerful drug cartels.",
    "I don't know who said it, but I definitely prefer liberty with danger to peace with slavery.",
    "The indifference and lack of education about ALL of our Bill of Rights gravely concerns me.",
    "Talk about full-on wacky and bizarre anti-constitutional choices, did you hear this one?",
    "But we can't settle foreign crises when we are suffering from even bigger domestic ones.",
    "Legal gun purchases can only be made in a single store on a Mexico City army base.",
    "And the governors and governments of 13 U.S. states are now partnering with them?",
    "I'll say it 100 times: Could the 27 words of the Second Amendment be any clearer?",
    "I don't think I've ever been as thankful for American freedoms as I am now.",
    "That's not just stupid but pure idiocy and constitutional insanity!",
    " What is reasonable about a total ban on possession?\"",
    "But I prefer he look down the barrel of my gun.\"",
    "And yet, Mexico blames U.S. gun manufacturers?",
    "(Our own Lone Star state Republican Gov.",
    "But that is what we must not let happen.",
    "And there is nothing funny about it.",
    "And it wasn't, until today.",
    "Is someone joking?"
  ]
}