{
  "id": 943,
  "mediaId": 675,
  "date": "2/27/2022 12:00:00 AM",
  "headline": "Chris Christie promises GOP will fight Dems' 2022 attempt to influence elections",
  "image": "https://www.wnd.com/wp-content/uploads/2016/03/chris-christie-donald-trump-tw-600.jpg",
  "link": "https://www.wnd.com/2022/02/chris-christie-promises-gop-will-fight-dems-2022-attempt-influence-elections/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    1624,
    1624,
    2031,
    2031,
    1095,
    1095,
    761,
    761,
    714,
    714,
    1349,
    1349,
    428,
    428,
    417,
    417,
    146,
    146
  ],
  "sentences": [
    "The shape of Rep. Jerry Nadler's newly crafted district  New York's 10th  is downright serpentine, so much so that it was quickly dubbed the jerrymander,? which brings this issue back to its historic roots\nThe Atlantic put it this way: [The redrawn district] slices down the west side of Manhattan, takes a ferry ride across the East River, cuts a horseshoe-shaped path through a half dozen neighborhoods on its way to Prospect Park, then wraps around a cemetery containing the earthly remains of Boss Tweed and Horace Greeley before swallowing a huge section of central and south Brooklyn.?\nNadler's new district is the most egregious example, but there are plenty of others across the Empire State.",
    " They should not be allowed to rig elections for 10 years because they're worried about moving a deadline for candidate qualification for being on the ballot.?\nChristie and Pompeo serve as national co-chairs to the National Republican Redistricting Trust, or NRRT, an effort created in 2017 to counter a similar organization announced the year before and helmed by former Attorney General Eric Holder and other allies of Barack Obama.",
    "Now, all of a sudden, they don't want to do that.?\nChristie, who heads up national Republican redistricting efforts along with former Secretary of State Mike Pompeo, also suggested that Hochul is simply shoring up her Democratic Party credentials by signing off on the obviously rigged map.",
    "By Susan Crabtree\nReal Clear Politics\nIn recent years, Democrats have often accused Republicans of some of the most extreme forms of gerrymandering, arguing that GOP efforts to redraw congressional maps to their favor purposefully disenfranchises some of Democrats' most reliable voters.",
    "New York is one of those places where our national team is going to plant the flag  because this is so egregious, it defies every statistical analysis and commonsense political analysis.?\nSusan Crabtree is RealClearPolitics' White House/national political correspondent.",
    "I think New Yorkers will have their communities well represented in the maps the legislature has come up with.?\nOthers contend the new lines unwind the results of previous gerrymandering by Republicans and fairly reflect growing Democratic dominance across the state.",
    "al., they're on track to net 2-3 seats from new maps vs. old ones.?\nAfter months of Democratic complaints over new GOP state voting laws posing threats to democracy, Republicans are accusing Democrats of blatant hypocrisy, especially when it comes to New York.",
    "World\nCommentary\nMichael Brown\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nRead all of today's COMMENTARY...\nDiversions\nPolitics\nU.S.\nEducation\nMoney\nHealth\nFaith\nMORE COMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "In North Carolina, where Republicans are the ones defending creatively redrawn partisan maps amid Democrats' accusations of a rigged process, the courts have delayed a March primary for several months so the lines can be created more fairly.",
    "When a computer can't find one map to come up with randomly that's more favorable to Democrats than the one they came up with, I think that's the definition of pushing the edge of the envelope beyond where it's even plausible,? he said.",
    "The Cook Political Report's Dave Wasserman has given a recent edge to Democrats in the great gerrymandering sweepstakes of 2020, although this could change as more maps are drawn, including Florida's with its 28 congressional districts.",
    "The Democrats created this abomination of a redistricting scheme.?\nMoreover, he argued, other courts across the country have pushed back filing deadlines and even primaries in efforts to try to make the maps fairer and less partisan.",
    "TRENDING: The German who wants to rule the world\nNew York's new district lines, signed off by the Democratic legislature and governor, are so comically contorted they've generated jokes and criticism from the right to the far left.",
    "The Princeton group labeled the New York map as particularly egregious; noted that new lines in Illinois and Maryland have benefited Democrats; and leveled harsh criticism for initial GOP efforts in Texas, North Carolina and Ohio.",
    "In New York, as in several other states, a bipartisan commission was supposed to carefully craft the new map to avoid partisan rigging, but the members deadlocked, handing the job to the Democratic-controlled state legislature.",
    "Although Holder's organization, the National Democratic Redistricting Committee, or NDRC, did not respond to several RCP inquiries, Holder has publicly defended the efforts on grounds of racial equity and shifting demographics.",
    "The NRRT, he says, recently retained an expert who ran 500 computer models based on population groupings, and none of those versions were more partisan than the existing Democratic-drawn map, he asserted.",
    "That is debatable, but regardless, a jerrymandered? district like Nadler's isn't a good look for a party that has railed against GOP gerrymandering as a crime against the Constitution in places like Ohio.",
    "The new districts' strange twists and turns, they say, are simply a result of connecting like-minded groups, such as minority voters congregated in certain areas, to reflect, not drown out their voices.",
    "These maps reflect communities of interest across the state,? David Imamura, the Democrat who served as the chairman of the bipartisan redistricting commission, told the New York Times in an interview.",
    "Mike Pompeo and I came together to co-chair [this group] as a way to combat Barack Obama and Eric Holder  the guys who are raising all this money for Democrats to do this around the country,? he said.",
    "He charged Democrats with trying to run out the clock by arguing there's no time to redraw fairer lines because candidates have to start running for office with a June primary just months away.",
    "Just months ago in November, New York Democrats tried to pass a state proposal to remove the requirement that new district maps must receive some Republican support, but the voters defeated it.",
    "This is just Kathy Hochul trying to prove that she's a tough Democrat doing the bidding for [Senate Majority Leader] Chuck Schumer and the rest of the gang in the New York delegation,? he said.",
    "In a closer-than-expected November midterm election, it also could plausibly prevent the GOP from winning back the House majority  now held by Democrats with a margin of only five seats.",
    "A Republican-led group of voters filed a lawsuit in early February arguing that the lines violate a 2014 state constitutional amendment aimed at preventing partisan district drawing.",
    "Most observers believe the new map threatens half of the GOP's eight congressional seats in the state, enough to significantly offset expected GOP gains in the rest of the country.",
    "The new lines would make it nearly impossible for Republicans to win anywhere but upstate  and even there make it far more difficult for the GOP, except in one safe super district.",
    "Former Rep. John Faso, who represented New York's 19th district from 2017 to 2019 and lost a governor's race to Democrat Eliot Spitzer in 2006, is assisting in the GOP legal fight.",
    "For the first time, Dems have taken the lead on @CookPolitical's 2022 redistricting scorecard,? Wasserman tweeted in early Feb. After favorable developments in NY, AL, PA et.",
    "Kathy Hochul signed off on the new maps in early February, New York's redistricting process has attracted nationwide attention  as well as the biggest GOP legal guns.",
    "And some Democrats argue that some district lines in New York are drawn to protect moderate Democratic incumbents with others gaming the systems against Republicans.",
    "A CNBC report last week, citing internal GOP fundraising invitations, said Republican megadonors? want to raise at least $3 million to fight the New York maps alone.",
    "Along the Canadian border, Democrats dumped more Republicans into GOP Rep. Elise Stefanik's rural district, while dividing a large Army base between two districts.",
    "Democrats are completely ignoring the will of the voters  and changes that they themselves put on the ballot and advocated for at the time,? former New Jersey Gov.",
    "They're also preserving or increasing representation for communities of color.?\nChristie dismisses the argument, particularly when it comes to New York.",
    "That's kind of akin to the guy who murders his parents and throws himself on the mercy of the court on the basis that he's an orphan,? Faso told RCP.",
    "I mean, it's ridiculous.?\nChristie says Democrats started their national redistricting strategy 10 years ago and caught the Republicans off guard.",
    "To the south, it lumped Staten Island, the more conservative part of New York City, into a new district with its most liberal area, Park Slope.",
    "The Princeton Gerrymandering Project gave seven of the 12 new congressional district maps failing grades, including four passed by Democrats.",
    "New York's state constitution also has provisions to ensure redistricting conflicts are resolved expeditiously, Faso pointed out.",
    "With control of both the House and Senate at stake, redistricting court battles are playing out in several other states as well.",
    "The report didn't mention that the NDRC has raised $10 million since 2017, according to the Center for Responsive Politics.",
    "The new district makes it nearly impossible for the city's lone Republican, Rep. Nicole Malliotakis, to retain the seat.",
    "Both parties are engaged in forms of political gerrymandering while utilizing different tactics to achieve their goals.",
    "Republicans dismiss these arguments, pointing to Democratic efforts to roll back laws requiring GOP input as proof.",
    "Democrats are drawing maps that follow the census data and reflect population shifts,? he recently told reporters.",
    "The courts have to consider this expeditiously so there's plenty of time to hear this matter fully,? Faso said.",
    "Fair Lines America, the GOP funding arm for redistricting, is a nonprofit that does not disclose its donors.",
    "Christie and other Republicans, however, say the GOP is playing catch-up in the redistricting money chase.",
    "Hochul became governor last year after Andrew Cuomo's downfall over sexual harassment complaints.",
    "So for them to kind of act like there's gambling in this establishment  are you kidding me?",
    "Congressional lines are reapportioned every 10 years based on census population figures.",
    "(Courts have ordered North Carolina and Ohio to take another stab at fairer maps.)",
    "Both sides are raising millions of dollars for their redistricting legal battles.",
    "[Editor's note: This story originally was published by Real Clear Politics.]",
    "Still, those in charge of redrawing the lines claim they are legal and fair.",
    "[Editor's note: This story originally was published by Real Clear Politics.]",
    "Now we're not going to be [caught off guard],? he vowed.",
    "Chris Christie tells RealClearPolitics in an interview.",
    "Now the shoe is on the other foot.",
    "Well, they created this mess.",
    "Since Gov."
  ]
}