{
  "id": 944,
  "mediaId": 675,
  "date": "d2022-02-27T14:52",
  "headline": "Democrat candidates running hard  AWAY from Biden",
  "image": "https://www.wnd.com/wp-content/uploads/2019/03/beto-orourke-cbs-vid-600-jpg.jpg",
  "link": "https://www.wnd.com/2022/02/democrat-candidates-running-hard-away-biden/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    704,
    1139,
    1253,
    1459,
    2087,
    2171,
    2311,
    2416,
    146,
    2894,
    2934
  ],
  "sentences": [
    "According to February polling by the University of Texas, 43% of Texans disapprove strongly? of Biden while just 15% approve strongly.? A closer look at a key demographic in the cross tabs could also be concerning: 42% of Hispanic voters give the president a passing grade while 38% disapprove, a difference within the poll's margin of error.",
    "That is according to Chuck Rocha, a leading Democratic strategist and former adviser to Sen. Bernie Sanders, who is also urging his clients to lean into White House accomplishments, even if candidates talk about Democratic accomplishments generally rather than Biden's achievements specifically.",
    "As Democrats seek to defend their razor-slim congressional majorities, a number of vulnerable incumbents are keeping the president at arm's length in reliably Republican red Texas ahead of the state's March 1 primary, an awkward trend that is likely to continue as the midterm elections loom.",
    "Let me be clear,? he said, after insisting he was innocent of all wrongdoing, I'm running for reelection and I intend to win.? Challenger Jessica Cisneros has made the most of the moment, meanwhile, having previously won the endorsements of progressive heavyweights Sens.",
    "They should embrace him,? he told RCP, both because he has genuine and substantial accomplishments and because running away from a president of your own party never works.?\nThe battle for the House will be fought and won in many of the districts Biden carried.",
    "According to data compiled by Quorum, and first reported by Axios, many Democrats stopped mentioning Biden on their campaign accounts starting in September, a cold shoulder that coincided with the fallout from the chaotic U.S. withdrawal from Afghanistan.",
    "World\nCommentary\nMichael Brown\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nRead all of today's COMMENTARY...\nDiversions\nPolitics\nU.S.\nEducation\nMoney\nHealth\nFaith\nMORE COMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "The thing to do then, according to Bennett, is read the polls and react accordingly: Democrats should be focused on raising [Biden's] approval rating, because it's too low right now.?\nA lot can change between now and November.",
    "Incumbent presidents are normally power players in midterm elections, and Biden has already expressed an interest in getting outside the Washington Beltway to sell his agenda and offer his party a helping hand.",
    "Gonzalez is running for reelection in Texas' 34th Congressional District after redistricting by the state's Republican-controlled legislature softened up his old district for a Republican challenger.",
    "They have already added each of the three Texas districts to their offensive map, and they have every intention of publicly tying vulnerable Democrats, no matter how shy, to an unpopular president.",
    "Not only will the GOP do its best to ensure images of that mayhem are seared into the minds of voters, they will also make hay out of rising inflation, the economy and the pandemic.",
    "Asked if he would seek President Biden's help for his Texas gubernatorial campaign, O'Rourke told reporters he was not interested? in any kind of assist from the White House.",
    "Rep. Henry Cuellar said in a statement that he would welcome an opportunity to speak with either Biden or Vice President Harris about the situation on the southwest border.",
    "All the data suggests that they're probably not making a bad strategic calculation,? said Daron Shaw, a professor in the University of Texas Department of Government.",
    "Whenever they are free,? the Texas Democrat tweeted, my door is open.? That was December 23, and the last time Cuellar mentioned the president on social media.",
    "Judging by the radio silence from Rep. Vicente Gonzalez, though, the president might think twice before steering Air Force One toward the San Antonio suburbs.",
    "Barack Obama, even with his popularity, there wasn't a ton of Barack Obama,? he added pointing back to the midterm battles of the last Democratic president.",
    "Like Cuellar, Gonzalez also faces a challenge from his left flank in the form of AOC-endorsed Greg Casar, a progressive member of the Austin City Council.",
    "And in the district he left behind, Texas CD15, front-runner Michelle Vallejo has made no mention of the president either, not even once on social media.",
    "Reading too much into radio silence from a handful of regional candidates, even those in states with early primaries like Texas, may be misleading.",
    "The suburban voters who wrested control of the White House from Trump could now end up punishing the Democrats they put in power.",
    "The more pressing concern for Democrats, if they are going to mitigate losses in 2022 and win the White House again in 2024?",
    "They know that midterm elections seldom favor the party that controls the White House, and they are already hunkering down.",
    "In Texas, they will shine a particularly ceaseless spotlight on the influx of migrants coming across the southern border.",
    "Until the FBI raided his home and campaign headquarters, his reelection campaign wasn't considered an uphill battle.",
    "According to the national ad tracking firm AdImpact, Cuellar hasn't mentioned Biden on broadcast television once.",
    "They shouldn't either, says Matt Bennett, an executive vice president of the moderate think tank Third Way.",
    "It wasn't because of his air-drumming routine, like the one that went viral when he was running for Senate.",
    "It wasn't because of his skateboarding tricks he showed off to the press when he ran for president, either.",
    "By Philip Wegmann\nReal Clear Politics\nA month ago, Beto O'Rourke did what he does best: Make headlines.",
    "It is part of what you'd normally see in an off-year election,? Rocha said of Biden-avoidance thus far.",
    "The Cuellar campaign has cut nine different television ads so far this year to defend his seat.",
    "It doesn't look like the president has much political capital to offer in the Lone Star State.",
    "We have to get past being scared as s--- and lean into our accomplishments,? Rocha said.",
    "But in each of those 2022 advertisements, the president is conspicuously absent.",
    "Bernie Sanders and Elizabeth Warren, as well as Rep. Alexandria Ocasio-Cortez.",
    "[Editor's note: This story originally was published by Real Clear Politics.]",
    "Gonzalez has cut six television ads to stave off that primary challenge.",
    "Cuellar is well known and considered a political institution in Texas.",
    "This time, O'Rourke was national news because of an apparent snub.",
    "Democrats won't be able to avoid that broadside or duck Biden.",
    "Plus, Biden carried his district by seven points in 2020.",
    "Cuellar could use some star power these days.",
    "After the raid by the feds, he doubled down.",
    "Republicans smell blood in those numbers.",
    "It sounds harsh, but he isn't alone.",
    "None feature the president.",
    "All of this is unusual.",
    "The data in question?",
    "Democrats know this."
  ]
}