{
  "id": 945,
  "mediaId": 233,
  "date": "2/27/2022 12:00:00 AM",
  "headline": "An archive of Black newspapers is becoming more accessible at Howard. Here's why it's important.",
  "image": "https://www.gannett-cdn.com/presto/2022/02/25/USAT/951d2101-a130-4c85-af0f-33c9bae06a6f-AP_Howard_University-Archives_Donation.jpg?crop=8194,4610,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/nation/2022/02/27/howard-university-digitize-archives-black-newspapers-history/6882445001/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "N'dea Yancey-Bragg",
  "authorUrl": "https://www.usatoday.com/staff/2646700001/ndea-yancey-bragg/",
  "termIds": [
    2171
  ],
  "sentences": [
    "'It's like walking a tightrope':Critical race theory bans are adding more anxiety to stressed teachers\nOnly about 3% of professional archivists identify as Black, according to the latest data from the Society of American Archivists, and many recent efforts have been grassroots and community-based initiatives.",
    "Contact Breaking News Reporter N'dea Yancey-Bragg at nyanceybra@gannett.com or follow her on Twitter @NdeaYanceyBragg\nMore:K-12 students are becoming activists, drawing on lessons from historic fight for ethnic studies\nIt's not just Nikole Hannah-Jones: Black women are underrepresented among tenured faculty",
    "Many of the recent efforts to make historical documents by and about African Americans more readily available came after protests in the wake of George Floyd's murder in 2020, when people began searching for information to better understand the fight for racial justice, some for the first time.",
    "\"If we think the commonly held belief that journalism or newspapers write the first draft of history, if you don't have the Black press, you have a very incomplete understanding of American history and global history,\" said faculty member Nikole Hannah-Jones, who helped secure the grant.",
    "Berry spent nine months digitizing primary sources including documents from the Freedmen's Bureau, established during Reconstruction to assist formerly enslaved Black people in the South, and bills of sale from the slave trade, which she said can be useful for genealogical research.",
    "Capturing these online moments is also essential because the internet gives a platform to groups that have been traditionally marginalized by mainstream media, said Foster, also manager of the African American Research Library and Cultural Center in Fort Lauderdale, Florida.",
    "The effort is one of several by Black memory workers at universities, museums, libraries and grassroots organizations to preserve and increase access to material that documents Black history  material traditionally overlooked and undervalued by white institutions.",
    "Meanwhile, individuals like Miranda Mims addressed gaps in the industry by co-founding the Nomadic Archivists Project in 2017 to connect with communities that want to preserve their stories but don't know how to approach an institution or are hesitant to do so.",
    "Mims, who is the director of rare books, special collections and preservation at the University of Rochester, said working outside a university gives her freedom to help people without having to think about donations or focus on one geographic area.",
    "'On our own terms':How scholars of color are correcting the narrative of national tragedies\nThe collection is \"invaluable\" because white newspapers historically failed to document the everyday lives of Black Americans, Hannah-Jones told USA TODAY.",
    "Makiba Foster, manager of the African American Research Library and Cultural Center in Fort Lauderdale, Florida, launched a website, Archiving the Black Web, to document content produced by and about Black people online for future researchers.",
    "It was around that time Dorothy Berry asked to pause all of the digital projects at Harvard's Houghton Library and focus on highlighting material written by or about African Americans to rectify the university's history of ignoring such work.",
    "The work comes at a time when state legislatures and school boards are trying to restrict what lessons about history and race can be taught in schools, and as historically Black colleges and universities are being targeted by bomb threats.",
    "Conservatives have pushed to stop K-12 public schools from using federal funds to teach the project as well as the teaching of critical race theory  an academic framework that examines if, and how, systems and policies perpetuate racism.",
    "Today, a handful of libraries are solely dedicated to this work including New York's Schomburg Center for Research in Black Culture, the Auburn Avenue Research Library in Atlanta and the African American Museum and Library in Oakland.",
    "\"Having these archives readily available means that regular people, teachers, school children, families can get access to that information that is being increasingly restricted from their public education,\" Hannah-Jones said.",
    "Newspapers also portrayed the African American community in \"disparaging and often dangerous ways\" and ignored key events in American history, like the civil rights movement and violence against African Americans, she added.",
    "A massive effort is underway at Howard University to digitize thousands of Black newspapers in an effort to make the material more accessible and provide primary sources at a time when some are trying to whitewash history.",
    "The historically Black university recently received a $2 million grant that will allow it to scan microfilms and newspapers over the course of five years and make much of the collection available to the public.",
    "The work is \"hugely important because this is information about Black people globally that is owned and controlled by Black people,\" said Benjamin Talton, director of Howard's Moorland-Spingarn Research Center.",
    "As the Black Lives Matter movement began to take shape and people created educational material and public syllabi around the issue, Foster led an effort at the Schomburg Center to document that moment.",
    "Some have used Instagram accounts like the Black Archives, We The Diaspora as well as websites like the Black Beauty Archives and the Black Film Archive to highlight different facets of Black history.",
    "In 2020, volunteers collected hundreds of Black Lives Matter signs displayed on a fence near the White House and now two public libraries are working to make them all available online.",
    "Black memory workers are not only elevating historical content that may have been overlooked, but also working to document the major moments in Black history they are living through.",
    "The Black Press Archives housed at Howard include more than 2,000 newspaper titles from thousands of papers published in the United States, Africa, South America and the Caribbean.",
    "Foster said the project was inspired by her work documenting content produced during the protests in Ferguson, Missouri, following the police shooting of Michael Brown in 2014.",
    "\"This is cultural heritage and it needs to be made accessible to the people who are those inheritors,? said Berry, the digital collections program manager at the library.",
    "But experts said HBCUs have struggled with underfunding and public libraries may not have the resources or infrastructure to launch major digitization projects like this.",
    "William Henry Dorsey, who lived in Philadelphia in the 19th century, filled hundreds of scrapbooks with newspaper articles about African American history and culture.",
    "\"It gives us a lot of flexibility to really have honest conversations with people about their materials, and how they would like their materials to be preserved.\"",
    "Hannah-Jones is the creator of The New York Times' 1619 Project, a Pulitzer Prize-winning project that reframed the history of slavery in the United States.",
    "She also hired students and educational consultants to write interpretative essays and teaching guides for younger students to contextualize the material.",
    "Historically Black colleges and universities like Howard have similar archives often with material about the school itself and the surrounding community.",
    "\"It's incredibly important for predominantly white institutions to invest the time and energy to make their Black materials accessible,\" Berry said.",
    "It includes well-known papers like the Chicago Defender and the Pittsburgh Courier as well as records of Black editors, publishers and journalists.",
    "Foster said her work is important because the lifespan of digital content is only about 90 day, according to a study from the Internet Archive.",
    "At Howard in Washington, D.C., much of the collection is physically fragile and has only been accessible to those able to travel to there.",
    "\"If you weren't moneyed, rich, white your narratives often were excluded from what was collected and what was thought to be important.\"",
    "Marion Stokes recorded television news 24 hours a day for three decades and amassed a collection of more than 70,000 VHS tapes.",
    "\"But if we can create a strategy for these organizations who have committed their missions to documenting Blackness ...",
    "\"Having access to these archives and other works is going to be an important way to fight these memory laws.\"",
    "Berry said well-funded institutions like Harvard have a responsibility to make free resources like hers.",
    "\"We really try to be that sort of ungoverned link between content creators and institutions,\" Mims said.",
    "DEMOCRATS SAID THEY WERE ALL IN ON BLACK COLLEGES:So why doesn't Biden's bill do more for HBCUs?",
    "There is a long tradition of amateur and professional archival work in the Black community.",
    "She founded the Center for Journalism & Democracy that will launch at Howard in the fall.",
    "\"Traditionally, archives have been exclusive in a lot of ways,\" she said.",
    "\"The internet is so wide, we can't collect everything,\" she said.",
    "It's typically taught in graduate schools, not to K-12 students.",
    "But the university plans to make at least 60% available online.",
    "I think that we would be all better off as memory workers.\""
  ]
}