{
  "id": 946,
  "mediaId": 675,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "God doesn't need you  but He wants you",
  "image": "https://www.wnd.com/wp-content/uploads/2020/01/universe-galaxy-stars-space-person-God-atheist-meaning-life.jpeg",
  "link": "https://www.wnd.com/2022/02/god-doesnt-need-wants/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Laurie",
  "authorUrl": "https://www.wnd.com/author/glaurie/",
  "termIds": [
    1319,
    1788,
    2021,
    2171
  ],
  "sentences": [
    "Summary\nRecent Posts Contact\nPolitics\nCommentary\nMichael Brown\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nCraige McMillan\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "TRENDING: Hail to the Swedes  they did it right\nIf you don't believe that, then just take a look at the \"Guinness Book of World Records\" and the things people do to get noticed and to distinguish themselves from other people.",
    "They continue, \"Let them have dominion over the fish of the sea, over the birds of the air, and over the cattle, over all the earth and over every creeping thing that creeps on the earth.\"",
    "The Bible says that \"God has planted eternity in the human heart, but even so, people cannot see the whole scope of God's work from beginning to end\" (Ecclesiastes 3:11 NLT).",
    "And when we realize that God created us and start acting in ways that fulfill this purpose, we begin to experience joy and fulfillment that we've never known before.",
    "And though it's true that God doesn't needs us, it is also true that God wants us and that God loves us, because He has created us as humans for a special purpose.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "He will give eternal life to those who keep on doing good, seeking after the glory and honor and immortality that God offers\" (Romans 2:67 NLT).",
    "Since he is Lord of heaven and earth, he doesn't live in man-made temples, and human hands can't serve his needs  for he has no needs.",
    "God also said, \"Yes, I have loved you with an everlasting love; therefore with lovingkindness have I drawn you\" (Jeremiah 31:3 NKJV).",
    "There is something different in the hearts of human beings from any other creation, and I think God himself has built that into us.",
    "Deep within our souls we have a yearning to rise above the commonplace, because we have been uniquely created in the image of God.",
    "Here's what God said about man when he created him: \"Let Us make man in Our image, according to Our likeness\" (Genesis 1:26 NKJV).",
    "Some would say that after creating the world, after creating Earth, the solar system, the planets and animal life, God was lonely.",
    "As human beings, we stand apart from all of God's creation, because we have been uniquely created in the image of God himself.",
    "If we fulfill the primary purpose for which God created us, we will, as a byproduct, find what we are looking for in life.",
    "If he created humans to be personally happy or complete, it would mean that God is somehow dependent on us for something.",
    "Writing to the Christians in Rome, the apostle Paul said, \"He [God] will judge everyone according to what they have done.",
    "Check out Greg Laurie's books and movies in the WND Superstore\nYour life that you have right now is a gift from God.",
    "No one wants to be just another face in the crowd, just another statistic in the massive sea of humanity today.",
    "Paul summed it up so well when he made this statement: \"He is the God who made the world and everything in it.",
    "And when you give your life to him, you're essentially giving him something that belongs to him already.",
    "In other words, there is a recognition built within us that there is more to life than simply existing.",
    "They haven't discovered the reason God put them on this earth, which is to know him and walk with him.",
    "They are plans for good and not for disaster, to give you a future and a hope\" (Jeremiah 29:11 NLT).",
    "That is why so many people who are seeking happiness and fulfillment have such empty, futile lives.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "He himself gives life and breath to everything, and he satisfies every need\" (Acts 17:2425 NLT).",
    "It is in this commitment that our lives find the purpose, meaning and happiness that we want.",
    "Though it is not true that God needs us, it is true that God wants us and that he loves us.",
    "That is a nice sentiment and makes us feel good about ourselves, but it simply isn't true.",
    "Paul was speaking approvingly of those who do good and seek glory, honor and immortality.",
    "This desire for achievement, even greatness, is not necessarily wrong in and of itself.",
    "God has set eternity in our hearts, a recognition that there is a spiritual dimension.",
    "We also know that God said to Job, \"Who has given me anything that I need to pay back?",
    "That verse could be translated, \"I know the thoughts that I am thinking toward you.\"",
    "As we come into harmony with God's purpose for us, everything else falls into place.",
    "He has created us for a special purpose and is intensely interested in our lives.",
    "We are made in the image of God Almighty, and he created us for his own glory.",
    "Are you seeking God's will for your life and doing what he wants you to do?",
    "And here we see the Father, Son and Holy Spirit having a conversation.",
    "God is thinking about you all the time, and they are good thoughts.",
    "God would have done simply fine without humanity to contend with.",
    "God did not create us because he had to but because he chose to.",
    "The fact of the matter is that God is independent of humanity.",
    "So you might say that God has essentially wired us this way.",
    "He decided that you should exist, and therefore you exist.",
    "He deeply and tenderly loves us beyond our comprehension.",
    "Are you fulfilling the purpose for which God created you?",
    "He loves us and has a plan and a purpose for our lives.",
    "This is a statement that encompasses all of humanity.",
    "God does not need the rest of creation for anything.",
    "Everything under heaven is mine\" (Job 41:11 NLT).",
    "God says, \"For I know the plans I have for you.",
    "God did not create us because he was lonely.",
    "We want to be known for something special.",
    "We were created to bring glory to God.",
    "He is not dependent on any of us.",
    "But why did God create humanity?",
    "God doesn't need you or me.",
    "He isn't dependent on you.",
    "They are loving thoughts.",
    "But he doesn't need you.",
    "They are pure thoughts.",
    "Why did he put us here?",
    "So then he made man.",
    "But he isn't."
  ]
}