{
  "id": 952,
  "mediaId": 675,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "The real reason the left hates Donald Trump so much",
  "image": "https://www.wnd.com/wp-content/uploads/2021/07/donald-trump-cpac-2021-pointing-jpg.jpg",
  "link": "https://www.wnd.com/2022/02/real-reason-left-hates-donald-trump-much/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Hollis",
  "authorUrl": "https://www.wnd.com/author/laurahollis/",
  "termIds": [
    2171
  ],
  "sentences": [
    "The reality of all this and much more is devastatingly documented and explored in the February 2022 issue of WND's critically acclaimed Whistleblower magazine (available in print and digital editions), titled \"BIDEN'S BORDER BETRAYAL: Secret night flights, rampant criminality and 100,000 dead Americans.\"",
    "Trump's election peeled away the facade and revealed the incompetence and outright destructiveness of our government: Democrats, certainly; Republicans, often; and the massive bureaucracy in the D.C. swamp, almost always, regardless of nominal party affiliation.",
    "As unthinkable as their invade-America policy is, the reason Team Biden implements it is every bit as depraved: It's all so the Democratic Party  currently led almost entirely by deranged, lying, power-obsessed autocrats  can remain in power in America forever.",
    "Politics\nCommentary\nJoseph Farah\nPatrick J. Buchanan\nIlana Mercer\nDavid Harsanyi\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "To justify their existence, those profiting from the government racket need chaos; they need crime; they need violence; they need poverty; they need addiction; they need conflict; they need war.",
    "That  not his ego, or his mean tweets, or his phone call to the president of Ukraine, or his insistence that the 2020 election was stolen (it was)  was Trump's truly unforgivable sin.",
    "It was that he believed in taking a hands-off approach and letting Americans run our own country with far less interference from elected officials or unelected bureaucrats.",
    "Literally millions of migrants are crossing our borders illegally, unvaccinated and unvetted, and he is busing and flying them all across the country under cover of night.",
    "His Justice Department is calling irate parents at school board meetings and anyone questioning the government's COVID-19 propaganda \"domestic terrorists.\"",
    "Then they demand more of the same policies, more agencies to implement those policies, more money to fund those agencies, more taxes to provide the money.",
    "This translates at best to congressional hearings where culpable people can lie with impunity and without consequences  and that's if they show up at all.",
    "In the primary plot, a handful of grasshoppers bully and terrorize an ant colony into harvesting and providing food for them, year after year after year.",
    "IMPORTANT NOTE: It's hard to believe, but from day one the Biden-Harris administration has literally engineered a full-scale foreign invasion of the USA.",
    "Yet the devastating consequences and long-term repercussions of this ongoing national invasion remain virtually unreported by the establishment media.",
    "But the four years of peace and prosperity under Trump revealed that the racketeers and bureaucrats need us, but we don't need them.",
    "Instead of repealing bad laws or eliminating runaway bureaucracies, Republicans posture, demanding \"oversight\" and \"accountability.\"",
    "Putin is marching into Ukraine because he knows Europe is toothless, and Biden has, charitably speaking, diminished mental capacity.",
    "The economy boomed under Trump not because of the government but because of the inspiration and hard work of millions of Americans.",
    "His energy policies have crippled America's energy independence, sending oil prices, and therefore, all prices, skyrocketing.",
    "Contrast Trump's four years with the staggering pace of disintegration under President Joe Biden in just over one year.",
    "In truth, we shouldn't be surprised that the nation goes to hell in a handbasket when it's being run by Democrats.",
    "Meanwhile, the test scores of American students continue to decline relative to the rest of the developed world.",
    "Those in Congress routinely vote to exempt themselves from laws they pass that bind the rest of Americans.",
    "They and their family members buy and sell stock in companies that will be affected by laws they pass.",
    "Their crime rates are soaring, as they defund police and release criminals back into the population.",
    "Their streets are filled with the shantytowns of homeless people, drug addicts and the mentally ill.",
    "GOP candidates campaign promising to rein in out-of-control spending but don't do it once elected.",
    "This is just another form of insider trading  something that would send the rest of us to prison.",
    "Democrats want a 50% increase in spending on some boondoggle, so they'll ask for a 75% increase.",
    "And that is precisely what most Democrats  and a lot of Republicans  don't want Americans to do.",
    "When one ant, Flik, stands up for the ants, a couple of the grasshoppers want to shrug it off.",
    "Entire swaths of the cities they govern decay, while the wealthy live in gated communities.",
    "The level of panic and hysteria from the left during Trump's first term was inexplicable.",
    "Donald Trump's strength as a president was not that he was better at running the country.",
    "If Europe does not want Russia re-annexing Ukraine, Europe can fight Vladimir Putin off.",
    "Living in the United States at the moment feels like the 1998 Pixar film \"A Bug's Life.\"",
    "He pushes for the continuation of pandemic policies that have crushed small businesses.",
    "Predictably, Senate Minority Leader Mitch McConnell declares, \"We must arm Ukraine!\"",
    "And now, another pointless war looms that has nothing to do with the United States.",
    "At worse, it results in new agencies devoted to \"oversight\" and \"accountability.\"",
    "They defend porn and promote promiscuity and gender confusion in public schools.",
    "The difference between Democrats and Republicans has become one only of degree.",
    "\"You let one ant stand up to us,\" Hopper warns, \"then they might all stand up.",
    "They argue for the implementation of policies to solve a particular problem.",
    "Republicans then insist upon and get a 15% reduction in the spending demand.",
    "So, Democrats get a 60% increase, and both sides crow about their victories.",
    "Trump was the first president in years who did not launch a war of any sort.",
    "That is made worse because government has become pervasive and omnipresent.",
    "Until Trump, most Americans assumed that this was the only way it could be.",
    "So, which major defense contractors have been cozying up to McConnell?",
    "And if they ever figure that out, there goes our way of life.\"",
    "It bordered on insanity and was utterly unhinged from reality.",
    "Democrats and Republicans both know how this game works.",
    "Those puny little ants outnumber us a hundred to one.",
    "Inflation is roaring at levels not seen for 40 years.",
    "Just look at the states and cities run by Democrats.",
    "Government in America has become a lucrative racket.",
    "And who was going to get us into another crazy war?",
    "They refuse, unsurprisingly, to pass term limits.",
    "Meanwhile, the American taxpayers get screwed.",
    "Democrats have been doing this for decades.",
    "The head bully, Hopper, won't stand for it.",
    "That's the way America is supposed to be.",
    "Now it's clear why they were hysterical.",
    "Their policies make the problem worse.",
    "He was going to start some crazy war!",
    "He was going to destroy the country!",
    "\"He's just a puny ant,\" they scoff.",
    "That's how it was designed to be.",
    "Republicans are little better.",
    "They raise their own salaries.",
    "Or even remember how to do.",
    "Where are the Republicans?",
    "Ants of the world, unite.",
    "We've figured it out.",
    "Or insist upon doing.",
    "Their taxes are high.",
    "Trump was a fascist!"
  ]
}