{
  "id": 957,
  "mediaId": 675,
  "date": "2/23/2022 12:00:00 AM",
  "headline": "GOP gerrymandering is 'racist'  Obama-mandering is just politics",
  "image": "https://www.wnd.com/wp-content/uploads/2021/01/barack-obama-fingers-face-telephone.jpg",
  "link": "https://www.wnd.com/2022/02/gop-gerrymandering-racist-obama-mandering-just-politics/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Elder",
  "authorUrl": "https://www.wnd.com/author/lelder/",
  "termIds": [
    2171
  ],
  "sentences": [
    "Rather than jutting far to the west, like a long thin dagger, into a swath of poor black neighborhoods of bungalow homes, Obama's map now shot north, encompassing about half of the Loop, whose southern portion was beginning to be transformed by developers like Tony Rezko, and stretched far up Michigan Avenue and into the Gold Coast, covering much of the city's economic heart, its main retail thoroughfares, and its finest museums, parks, skyscrapers, and lakefront apartment buildings.\"",
    "Will Burns, then a young volunteer for Obama, said, \"(Petition-challenging is) one of the first things you do whenever you're in the middle of a primary race, especially in primaries in Chicago, because if you don't have signatures to get on the ballot, you save yourself a lot of time and effort from having to raise money and have a full-blown campaign effort against an incumbent.\"",
    "According to ProPublica, \"Two years later, with the Democrats in control of Illinois redistricting, Obama was apparently able to reshape his state senate district to his own specifications, which included drawing in wealthy supporters from Chicago's Gold Coast.\"",
    "The term \"gerrymander\" derives from Elbridge Gerry, a Founding Father and vice president who, as governor of Massachusetts, approved an oddly drawn state senate district to benefit his Democratic-Republican Party over the Federalist Party.",
    "Jack Cashill\nStephen Moore\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nEducation\nPolitics\nDiversions\nU.S.\nHealth\nWorld\nMoney\nMORE COMMENTARY\nLarry Elder\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "Because this new district helped Obama gain influential contacts and financial resources, Lizza said Obama's gerrymandering \"may have been the most important event in Obama's early political life.\"",
    "In 1999, Illinois state Sen. Barack Obama lost badly in the primary election for Chicago's South Side seat in the U.S. House to fellow Democrat and incumbent Rep. Bobby Rush.",
    "Obama challenged the legitimacy of the signatures on the petitions of his three rivals, including the incumbent, resulting in their disqualification.",
    "First, it retained Obama's Hyde Park base  he had managed to beat Rush in Hyde Park  then swooped upward along the lakefront and toward downtown.",
    "According to a CNN article about Obama's first race: \"If names were printed instead of signed in cursive writing, they were declared invalid.",
    "Former President Barack Obama accused Republicans of \"passing laws designed to prevent American citizens from exercising their right to vote.",
    "But today, about gerrymandering and alleged Republican \"voter suppression,\" Obama now says, \"That is not how democracy is supposed to work.\"",
    "Obama's new district was, according to The New Yorker's Ryan Lizza, \"wealthier, whiter, more Jewish, less blue-collar and better educated.\"",
    "Holder's former boss not only benefited from gerrymandering, but one could argue that without it, there would have been no President Obama.",
    "If signatures were good but the person gathering the signatures wasn't properly registered, those petitions also were thrown out.\"",
    "Former Obama attorney general and self-described Obama \"wingman\" Eric Holder also denounced the Republican maneuvers.",
    "Obama engaged in what Democrats today would call \"voter suppression\" to win his state senate seat in the first place.",
    "To qualify to run, Illinois state Senate candidates must obtain a specific number of valid signatures on a petition.",
    "By the end of the final redistricting process, his new district bore little resemblance to his old one.",
    "Their plan is to control state legislatures and congressional delegations before a single vote is cast.",
    "Gerrymandering was not the only hard-boiled tactic employed by the young, ambitious politician.",
    "Chicago Democrat John Corrigan, who worked on the redistricting, called it \"a radical change.\"",
    "Obama added: \"Rather than argue, based on ideas, they are trying to tilt the playing field.",
    "Holder called for \"fair line drawing\" while blasting Republicans who \"gamed\" the system.",
    "One of the candidates targeted and eliminated, Gha-is Askia, said, \"It wasn't honorable.",
    "Lizza wrote: \"Corrigan remembers two things about the district that he and Obama drew.",
    "And drawing congressional maps that drown out the voice of ordinary people.\"",
    "Both parties complain when the other party does it to them.",
    "Obama and Holder assume or hope we suffer from memory loss.",
    "And they aren't even waiting for Election Day to do it.",
    "But that is certainly how democracy worked in Chicago.",
    "That is not how democracy is supposed to work.\"",
    "Obama ran unopposed on the Democratic ticket.",
    "Consider recent GOP \"gerrymandering\" efforts.",
    "Faith\nCommentary\nJane M. Orient, M.D.",
    "This is exactly what team Obama did.",
    "I wouldn't have done it.\"",
    "Both parties do it."
  ]
}