{
  "id": 958,
  "mediaId": 675,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Barna's report on millennials' beliefs: Shocking",
  "image": "https://www.wnd.com/wp-content/uploads/2020/12/millennials-Pexels-copyright-free-image.jpg",
  "link": "https://www.wnd.com/2022/02/barnas-report-millennials-beliefs-shocking/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Tomczak",
  "authorUrl": "https://www.wnd.com/author/ltomczak/",
  "termIds": [
    1423,
    1423,
    1920,
    1920,
    2552,
    2552,
    2661,
    2661,
    2840,
    2840,
    2764,
    2764,
    2945,
    2945
  ],
  "sentences": [
    "More sobering data\nApart from deception assaulting the younger generation in the area of morality, Dr. Barna's research reveals chilling beliefs in the realm of spirituality:\nTwo out of three millennials believe they are \"Christians,\" yet their responses indicate they are not true disciples following Jesus as Lord.",
    "I've been to Bonnie Brae Street with revivalist Lou Engle where at the turn of the 20th century a handful of people gathered, and soon God poured out His Spirit in an unprecedented way in Los Angeles birthing the Pentecostal movement that today has reached almost a half billion people worldwide!",
    "Because many pastors decided to be \"seeker sensitive\" and play it safe, steering clear of controversy (\"We don't get into areas like abortion, living together, homosexuality, transgender stuff, voting, elections  you know, anything political\") we now have a generation like in the time of Judges.",
    "Inspiration from 5 divine interventions\nBefore anyone succumbs to cynicism and pessimism concerning the future of the millennial generation, let's remind ourselves of God's sovereign intervention in similar seasons of history where outpourings of His Spirit broke through the darkness.",
    "I've had the privilege of ministering repeatedly at Oberlin College, a ground zero destination where in the 1800s Charles Finney was catalytic with others in bringing sweeping revival fire to America in what is now known as another great awakening that revolutionized society.",
    "In one of the most turbulent times in America's history, God rescued me from a '60s \"Lost Souls\" rock band and swept me into a revolutionary youth-centered Jesus revolution that saw millions of sons and daughters converted and changed by the power of the living God!",
    "Revival broke out in Pensacola, Florida, and providentially God planted me in the midst of a divinely orchestrated move of His Spirit where in a five-year period 2 million came from across the world and 200,000 were converted  to the glory of God!",
    "Here's the deal: \"In the last days it shall be, says God, that I will pour out My Spirit on all flesh; your sons and your daughters shall prophesy, your young men shall see visions, and your old men shall dream dreams\" (Acts 2:17).",
    "A defining moment in my life\nYears ago when President Obama and LGBTQ activists were aggressively pushing for same-sex marriage, I partnered with a professional videographer on a biblical instructional video entitled \"Is Gay OK?\"",
    "I joined with Dr. Michael Brown, Mike Bickle, Greg Laurie, Keith Green and others in a heaven-sent move of God that birthed Calvary Chapel, The Vineyard, Contemporary Christian music and a cover story in Time magazine!",
    "Being \"born again\" doesn't result from repentance and faith in Christ's sacrificial, substitutionary death and Resurrection but refers to being a good person, doing good deeds to merit one's salvation.",
    "I've been to Northampton, Massachusetts, where Jonathan Edwards helped ignite God's miraculous intervention in the darkest period of the 1700s, which resulted in unbelievable societal transformation.",
    "A primary reason I worked on the resource video was to help rescue millennials being bombarded by an avalanche of deceitful propaganda on this and multitudes of cultural hot-button issues.",
    "Studying the sobering results of Dr. George Barna's research, \"Millennials in America,\" I felt fear for the future considering the views of the largest generation in our history.",
    "Previously, he'd warned me in no uncertain terms that to continue the project was a \"deal-breaker\" and \"we don't want to go there because we could incur death threats.\"",
    "The overwhelming majority reject the concept of an all-knowing, all-powerful Creator and do not accept the biblical/historical view of Scripture, sin and salvation.",
    "Faith\nDiversions\nPolitics\nWorld\nMoney\nU.S.\nEducation\nMORE COMMENTARY\nAndy Schlafly\nLarry Tomczak\nStar Parker\nRead all of today's COMMENTARY...\nNew Section",
    "In our day of comfortable, compromising and cowardly \"Christianity,\" it's refreshing to see a leader not being silent and submitting to the fear of man.",
    "(Nehemiah 13:23-24)\nUpon assessing the situation in his day, Nehemiah was definitely not complacent as he confronted some of them with righteous anger.",
    "He \"cursed\"  \"beat\"  and \"plucked out the hair\" of those responsible for \"doing all this great evil who are behaving unfaithfully against our God.",
    "Rekindling lifestyle evangelism and consistent, compassionate outreach to the lost and those suffering in poverty, persecution and exploitation.",
    "I was subsequently let go by the church where I served in leadership for five years, being told by the leader to \"just go and don't come back.\"",
    "Similar times in Scripture\nTwo portions of Scripture come to mind in light of the younger generation drifting dramatically from God.",
    "And God used a humble, one-eyed black man, ironically named William Seymour (\"see more\"), who wanted to see more of God in his day!",
    "\"That entire generation passed away, and after them grew up a generation who did not know the Lord or the deeds that He had done.",
    "Restoring a healthy fear of the Lord through a revelation of divine judgment and experience of Holy Spirit conviction.",
    "Half of their children spoke in the language of Ashdod, yet none of them could recognize the language of the Jews.\"",
    "Foundation of absolute truth has been replaced by relativism, with feelings and friends forming one's worldview.",
    "9 of 10 are syncretists, picking a mixture of beliefs from different religions so as not to appear \"intolerant.\"",
    "Health\nCommentary\nJoseph Farah\nJerry Newcombe\nBen Shapiro\nEmail to the Editor\nRead all of today's COMMENTARY...",
    "Most importantly, rekindling the fire of first-love zeal and simple devotion to Jesus as our Lord and Savior.",
    "\" (Judges 2:10)\n\"Moreover, in those days I also saw Jews who had married the women of Ashdod, Ammon and Moab.",
    "Here are some of the startling discoveries:\nAlmost one-half of young adults prefer socialism to capitalism.",
    "It's our time to seize the opportunity, remembering God's sovereignty and the church's responsibility.",
    "A high percentage identify themselves as \"DONTS,\" meaning they don't know or even care if God exists.",
    "\" (Nehemiah 13:25-7)\nScripture does not rejoice over Nehemiah's actions but does record them!",
    "A scant 4% of millennials hold to a biblical worldview regarding God, life and morality.",
    "From a biblically informed worldview it addressed questions like \"Is a person born gay?",
    "7 common denominators\nDr. Barna's excellent research revealed sobering data.",
    "Freedom for the Holy Spirit to move in spontaneity under godly oversight.",
    "Only one in four millennials believe they can trust Christian pastors.",
    "Three out of four believe all religious faiths are of equal value.",
    "The time has come  let's respond and see revival fire fall!",
    "Rediscovering the passionate preaching of the Word of God.",
    "I listened intently as he shared some of his key findings.",
    "Can someone be a Christian and practice homosexuality?",
    "Genuine repentance and living lives of happy holiness.",
    "Historically, we find common denominators to guide us.",
    "Only 28% believe the Bible is the Word of God.",
    "56% reject the existence of absolute truth.",
    "Is same-sex marriage allowed by God?\"",
    "Passionate and prevailing prayer.",
    "Second Great Awakening.",
    "First Great Awakening.",
    "Azusa Street Revival.",
    "Brownsville Revival.",
    "The Jesus Movement.",
    "2.",
    "1.",
    "3.",
    "4.",
    "6.",
    "5.",
    "7."
  ]
}