{
  "id": 960,
  "mediaId": 675,
  "date": "d2022-02-22T13:17",
  "headline": "Biden caught telling 'monster whopper'  again!",
  "image": "https://www.wnd.com/wp-content/uploads/2021/11/joe-biden-smiling-grinning-teeth-hhappy.jpg",
  "link": "https://www.wnd.com/2022/02/biden-caught-telling-monster-whopper/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    930,
    1328,
    1525,
    2087,
    2171,
    2672
  ],
  "sentences": [
    "Stephanopoulos said, regarding Biden's decision to pull all U.S. troops out of Afghanistan, leaving behind a collapsing government to be overcome by the terrorist Taliban, Americans behind enemy lines, and more than $80 billion in American war machinery in the hands of the terrorists, \"So no one told  your military advisors did not tell you, 'No, we should just keep 2,500 troops.",
    "He continued, \"Above all, Biden has made it clear, through an unrelenting fusillade of lies, that he does not consider himself to be the least bit accountable to the American people, does not think ordinary rules and norms apply to his administration, and does not think he owes anyone an honest word about anything that happens on his watch.",
    "\"While gasoline is abnormally expensive now, these spikes never happened during Biden's childhood, and as the charts make clear, they weren't a factor for the president until he was in his early thirties, at which point he was on the verge of winning a seat in the U.S. Senate.",
    "Faith\nCommentary\nJoel S. Hirschhorn\nScott Lively\nRachel Alexander\nRead all of today's COMMENTARY...\nU.S.\nMoney\nWorld\nDiversions\nPolitics\nHealth\nEducation\nMORE COMMENTARY\nDennis Prager\nPatrick J. Buchanan\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "He appears to be citing his mother to enhance his civil rights credentials  which we have noted he has exaggerated before  but too many elements do not add up to give this 'arrest' more credibility than his previous claims of getting in trouble with the law.\"",
    "In a report at Real Clear Markets, John Tamny, who also is vice president at FreedomWorks and a senior fellow at the Market Institute, cited Biden's claim, just days ago, that he \"grew up in a family where the price at the pump was felt in the kitchen.\"",
    "Kessler suggested Biden was \"referencing a story he told on a number of occasions about a conversation he had with his mother in 2008 when deciding whether he should accept former President Obama's offer to become his running mate,\" the report said.",
    "Fox News reported on the time Chairman of the Joint Chiefs of Staff Gen. Mark Milley and head of U.S. Central Command Gen. Kenneth F. McKenzie confirmed they recommended the U.S. should maintain a presence of at least 2,500 troops in Afghanistan.",
    "Further he claimed he was in law school of a full academic scholarship, when it actually was a half scholarship, took three degrees when it actually was one, and apparently falsely claimed to be named an outstanding political science student.",
    "In other words, the severing of the dollar's link to gold in 1971 was the inflationary outbreak that Americans endured in the 'Me Decade,' and the dollar's instability since then has explained gasoline's volatility over the last 51 years.",
    "Fact Checker: Biden claims yet another arrest for which there's little evidence https://t.co/tAFsyevN0i\n The Washington Post (@washingtonpost) January 13, 2022\nBut those incidents are far from all that contribute to Biden's reputation.",
    "Fox reported, \"In the story, Biden's mother reminded him of when he was a teenager and went to support a black family who purchased a home in a town not far from where the Bidens lived amid a protest against the family moving in.",
    "He explained, \"Voters are not buying President Joe Biden's claim that he didn't overpromise during the 2020 election but has been thwarted by the GOP, and they instead feel he lied just to get elected, according to a new survey.\"",
    "Kessler noted that Biden told the story with several variations over time, with some referencing him getting 'arrested' by the police, and others saying they brought him home to his parents to keep him from getting in trouble.\"",
    "TRENDING: Biden's ambassador to Germany in hot water for photo with man dressed as a suicide bomber\nHe cited evidence from NASDAQ as well as Statista in confirming the flat line of gas prices up until into the 1970s.",
    "Be advised about offensive language throughout:\n Maze (@mazemoore) January 25, 2022\nColumnist David Harsanyi recently described how Biden \"is compelled to lie about virtually every aspect\" of a Georgia election law.",
    "The comments came during Democrats' attempt to destroy the Senate filibuster and adopt their strategy to take over elections nationwide, and eliminate virtually all ballot integrity requirements from shore to shore.",
    "\"What we can conclude from this pattern of deception is simply that Biden does not feel the need to give straight answers about any decision he makes or policy he enacts,\" he wrote online at that time.",
    "With the dollar's price no longer stable, and with the dollar having suffered bouts of weakness at times, it's at times been the case that our dollars haven't stretched as far as they once did.",
    "\"To be honest, no one who has been paying any attention at all to politics for the last fifty years was surprised to hear our kind, unity-driven president call Peter Doocy a son of a b*tch.",
    "\"The polling analysis cited Biden's failure to end the COVID-19 crisis, but it also noted inflation and other problems that are driving key support groups into GOP arms,\" Bedard explained.",
    "But, the report explained, \"Biden didn't grow up in a family burdened by gasoline price spikes, and not just because he's long overstated the humble circumstances he emerged from.\"",
    "According to Fox News, the \"honor\" went to Biden \"over his false claim he was 'arrested' for the first time as a teenager while attending a civil rights protest in Delaware.\"",
    "Even MSNBC analyst Steve Rattner, a Democrat who worked in the Obama administration, said wages are decreasing when you factor in the inflation that has Biden has allowed.",
    "At that time, even the Washington Post took note of his falsehoods, with a \"Four Pinocchios\" for Biden's wild claim that he was \"arrested\" during a civil rights event.",
    "\"Biden never felt 'the price at the pump in the kitchen' growing up simply because a soaring price at the pump never factored in his childhood,\" the report explained.",
    "In the clip, the much younger Biden claims to have graduated \"in the top half of my class\" before he later admitted to having graduated 76th in a class of 85.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "Despite Biden's latest fib, the report explained, \"Biden didn't endure food shortages related to pricey gasoline simply because he was born in 1942.",
    "The posting warns the video compilation \"is truly not safe for work because he swears a LOT,\" and it \"isn't even every time he's bullied others.\"",
    "Pundits should hold Biden accountable for uttering a blatant falsehood simply because doing so would be a 'teachable moment' extraordinaire.\"",
    "In 2020, Biden was \"forced\" to admit that he made up a tale \"of once getting arrested while trying to see Nelson Mandela in South Africa.\"",
    "Kessler found, \"The primary source for this story is Biden  and we've learned over the years that he is not always a reliable source.",
    "WND reported Biden's ability to  and apparent decision to  lie directly to the American public has been in display again and again.",
    "Other lies cited include Biden's claim failed $3.5 trillion climate change and welfare bill actually would have cost zero dollars.",
    "He explained that until 1971, the dollar was defined as 1/35th of a gold ounce, so it was stable, and likewise were commodities.",
    "The poll analysis itself explained, \"There are more Democrats abandoning ship and calling for the president not to run in 2024.",
    "Actually, experts say inflation actually is costing Americans the purchasing power they used to have before Biden was elected.",
    "In fact, a recent polling revealed that a huge number of Americans think Biden lied during his campaign just to get elected.",
    "Things are so bad for the Democrats right now; you are starting to see Bill and Hillary Clinton reappear in public.",
    "Like that one about the Amtrak conductor he had a conversation with, long after the conductor was gone from Amtrak.",
    "Biden was also fact-checked by PolitiFact, a \"fact-checking\" site that has been slammed for its left-wing bias.",
    "The problem is that Biden told former Bill Clinton operative George Stephanopoulos on ABC something different.",
    "Political Editor John Daniel Davidson said it is a warning but lies share a lot of information with Americans.",
    "Biden claimed, \"Things are a hell of a lot better, and the wages have gone up higher, faster than inflation.\"",
    "\"He will not be honest about what his advisers tell him or about what he intends to do on any given issue.\"",
    "The Western Journal even reported when Biden claimed, falsely, about economic improvements under his watch.",
    "The editor of RealClearMarkets has revealed a \"monster whopper\" told by Joe Biden that \"both sides missed.\"",
    "Only weeks ago a report documented how Biden lies whenever he feels like telling one of his noted stories.",
    "The Gateway Pundit also reported now that as far back as 1987 a video showed \"the many lies of Joe Biden.\"",
    "The Post's Glenn Kessler explained, \"Biden claims yet another arrest for which there's little evidence.\"",
    "Further, Twitchy commented on a video in which Biden repeatedly lashes out at others for being liars.",
    "The polling showed that 38.2% of the respondents said Biden has \"delivered\" on his campaign promises.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "The claim from Biden was just another in a long list of his claims that are simply wrong.",
    "Gasoline used to be nominally cheap precisely because the dollar had a stable definition.",
    "\"I did not walk in the shoes of generations of students who walked these grounds.",
    "It seems like yesterday the first time I got arrested,\" Biden intoned in Atlanta.",
    "Paul Bedard in the Washington Examiner revealed the results of the Zogby poll.",
    "\"Which is why his flamboyant mis-statement is such a worthy teachable moment.",
    "Imagine, Democrats trotting out Hillary as the change candidate in 2024!",
    "So when specifically should Americans expect those prices to come down?\"",
    "But a plurality, 45.7%, said he was \"was lying just to get elected.\"",
    "And not just because politicians should have their fibs exposed.",
    "Since then, gasoline has bounced around wildly much as oil has.",
    "The least we can do, at this point, is be honest about that.\"",
    "That could make Donald Trump look appealing to swing voters!\"",
    "He's been attacking people verbally for a long, long time.\"",
    "When Biden was growing up, the price of gasoline was flat.",
    "The cost of everyday items are up,\" a reported asked him.",
    "It's been a stable situation for the last several years.",
    "He wrote Biden, ahem, is \"not always a reliable source.\"",
    "PolitiFact rated Biden's claim as \"mostly false.\"",
    "What Biden claims about his childhood is false.",
    "Because I'm so damn old, I was there as well.",
    "\"Inflation in the U.S. is at a 13-year high.",
    "\"He has decided, that is, to govern by lies.",
    "No one said that to me that I can recall.\"",
    "It appears his claim doesn't \"add up.\"",
    "Or his meeting with Nelson Mandela.",
    "\"Too bad no one's called him on it.",
    "Or his house erupting in flames.",
    "We can continue to do that'?\"",
    "Simple as that,\" Tamny wrote.",
    "But I walked other grounds.",
    "You think I'm kidding, man.",
    "It's really very basic.\"",
    "Biden confirmed, \"No.",
    "And it was cheap.\"",
    "We can do that.",
    "\"Rents are up.",
    "Exaggerations?",
    "Whatever."
  ]
}