{
  "id": 962,
  "mediaId": 675,
  "date": "2/21/2022 12:00:00 AM",
  "headline": "Parachute fails leaving skydiving instructor dead, female student survives",
  "image": "https://www.wnd.com/wp-content/uploads/2021/04/parachuters-jumping-tandem-whhite-men-happy-smiling-freefalling-flying-plunging-plummeting-waving-hello-military-defense-jpg.jpg",
  "link": "https://www.wnd.com/2022/02/parachute-fails-leaving-skydiving-instructor-dead-female-student-survives/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    2171
  ],
  "sentences": [
    "Skydive Houston, along with the greater skydiving community at large, is deeply saddened by the loss of our tandem instructor and friend,? the Skydive Houston skydiving center said in a statement Sunday, CNN reported.",
    "TRENDING: Biden's ambassador to Germany in hot water for photo with man dressed as a suicide bomber\nThe primary and secondary [parachutes] both just kind of swirled down,? Waller County Sheriff Troy Guidry told CNN.",
    "We continue to pray for a full recovery for the injured tandem student.?\nThe skydiving pair was spotted midair struggling to deploy their parachutes, local resident Alex Arias, who witnessed the incident, told KPRC.",
    "The cause of the accident is under investigation, Guidry said, and jump operations are suspended pending local law enforcement and Federal Aviation Administration (FAA) investigations, CNN reported.",
    "He let off his primary and then the secondary shoot like opened halfway up so he didn't fall like a straight fall, he was like 50 percent shoot, like a corkscrew,? Arias said, KPRC reported.",
    "By Harry Wilmerding\nDaily Caller News Foundation\nA Waller, Texas, skydiving instructor died Saturday during a jump after his parachute failed to open, multiple sources reported.",
    "Skydive Houston said there has been just one student fatality per 500,000 jumps in the last 10 years, according to the United States Parachute Association, KPRC reported.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "The victim, whose identity has not been released, suffered severe injuries during a tandem jump on Saturday, the New York Post reported.",
    "The victim's skydiving customer was reportedly taken to a nearby hospital suffering from severe injuries but expected to survive.",
    "The male instructor was reportedly unconscious after hitting the ground while the female student was awake and calling for help.",
    "Politics\nEducation\nMoney\nWorld\nHealth\nMORE COMMENTARY\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Diversions\nCommentary\nJoseph Farah\nPatrice Lewis\nBarbara Simpson\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Tandem skydiving accidents are extremely rare,? Skydive Houston told the NYP.",
    "This story originally was published by the Daily Caller News Foundation.",
    "Our sincerest condolences are extended to his friends and family.",
    "Faith\nU.S."
  ]
}