{
  "id": 969,
  "mediaId": 151,
  "date": "2/15/2022 12:00:00 AM",
  "headline": "Jan. 6 panel targets key players in false Trump elector strategy",
  "image": "https://static.politico.com/6e/6a/653bfaa24a0d9bd16c9c0992e442/220215-mark-finchem-ap-773.png",
  "link": "https://www.politico.com/news/2022/02/15/jan-6-panel-targets-key-players-in-false-trump-elector-strategy-00009222",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2171
  ],
  "sentences": [
    "The correspondence included emails from a National Archives inspector official that said the office was pursuing a case of potential fraud against a second slate of would-be Trump electors in Arizona who identified themselves as sovereign citizens.? Deputy Attorney General Lisa Monaco indicated in a CNN interview federal prosecutors were also scrutinizing the issue.",
    "| Steve Helber/AP Photo\nBy Nicholas Wu, Kyle Cheney and Betsy Woodruff Swan\n 02/15/2022 05:08 PM EST\nUpdated: 02/15/2022 05:21 PM EST\nJan. 6 investigators are targeting two state lawmakers who were instrumental in pushing Donald Trump's effort to overturn the 2020 election, as they dive deeper on Republican efforts to send false presidential electors to Washington.",
    "POLITICO reported last month that Michigan and Arizona had turned over copies of alternate certificates of ascertainment  which falsely said Trump won those states in the 2020 election  to the panel along with correspondence between the National Archives and state officials about the documents.",
    "We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,? Chair Bennie Thompson (D-Miss.)",
    "The panel said it had obtained communications indicating their involvement in a coordinated strategy? to pressure Republican state legislators in states Trump lost into sending alternate slates of pro-Trump electors to Congress.",
    "Individual electors who participated in the effort cited a 1960 precedent in which Hawaii Democrats sent unofficial electors to Washington amid a razor-close contest that was undergoing a recount.",
    "Mastriano is running for governor of Pennsylvania, and has polled in second place  behind former Rep. Lou Barletta  in multiple Republican primary polls, as City & State Pennsylvania has detailed.",
    "The panel subpoenaed two other officials  Michael Roman and Gary Michael Brown  the director and deputy director, respectively, of Election Day Operations for Trump's 2020 reelection campaign.",
    "As Trump's options for reversing his defeat dwindled, he increasingly focused his efforts on creating a conflict on Jan. 6, when Congress was required to meet to finalize Joe Biden's election.",
    "The select committee subpoenaed Pennsylvania State Sen. Doug Mastriano, who is running for governor; and Arizona State Rep. Mark Finchem, a Trump-endorsed candidate for secretary of state.",
    "Both played key roles and earned Trump's praise for pressing their colleagues to ratify alternate slates of electors in 2020  which would have thrown out millions of votes in their states.",
    "In the final frantic weeks of his presidency, Trump pushed a plan to have his vice president, Mike Pence  who presided over the Jan. 6 session  reject Biden's electors in key states.",
    "Citing an MLive story, the panel said she was a witness to efforts by Trump's personal attorney Rudy Giuliani to pressure state lawmakers into overturning the election results.",
    "The plan relied on having competing slates of illegitimate pro-Trump electors that Pence could seize on to declare the election results were in dispute.",
    "In addition to his efforts to overturn the 2020 election, Mastriano has also drawn attention for his vocal opposition to vaccine mandates.",
    "His first major event as a gubernatorial candidate, according to GoErie.com, was an appearance at a rally against vaccine mandates.",
    "The committee has asked the witnesses to provide documents by March 1 and appear for a deposition by the second week of March.",
    "Investigators also said they had evidence of Roman and Brown potentially directing Trump campaign staffers in the effort.",
    "She and her husband are already fighting a committee subpoena for their phone records, which was issued to Verizon.",
    "The select committee subpoenaed Arizona State Rep. Mark Finchem, a Trump-endorsed candidate for secretary of state.",
    "It's unclear if the Trump electors were aware of the campaign's broader effort to create a Jan. 6-related dispute.",
    "The panel sought to ask her about statements and communications with other officials related to the 2020 election.",
    "The panel has already heard from over 550 witnesses, he said, and investigators hope to speak with more.",
    "Others subpoenaed Tuesday included Laura Cox, the former chair of the Michigan Republican Party.",
    "Evidence of coordination by the Trump campaign could have significant implications.",
    "The committee is also deepening its investigation of Arizona GOP Chair Kelli Ward.",
    "The polls reported that Mastriano has high name ID among primary voters.",
    "said in a statement."
  ]
}