{
  "id": 970,
  "mediaId": 376,
  "date": "2/15/2022 12:00:00 AM",
  "headline": "Pennsylvania, Arizona state lawmakers among those subpoenaed by Jan. 6 panel",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/thompson_BC_076_020422.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/02/15/pennsylvania-arizona-state-lawmakers-among-those-subpoenaed-by-jan-6-panel/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Marquette",
  "authorUrl": "https://www.rollcall.com/author/chris-marquette/",
  "termIds": [
    708,
    1145,
    1147,
    1413,
    2087,
    2171,
    2478,
    154,
    2550,
    2791,
    2862
  ],
  "sentences": [
    "The panel says it has credible evidence? Michael A. Roman, the director of election day operations for Trump's 2020 reelection campaign, and Gary Michael Brown, the deputy director, were aware of and participated in efforts to promote unsupported voter fraud allegations in the presidential election and to encourage state legislators to change the results by appointing alternate slates of electors to deliver competing electoral votes to Congress.",
    "Kelli Ward, a former state senator and the chairwoman of the Arizona GOP who unsuccessfully challenged the late Sen. John McCain for Senate in the 2016 primary, and two years later lost to former Sen. Martha McSally in the GOP primary, reportedly spoke with Trump and his staff about election certification issues in Arizona.",
    "The House Jan. 6 select committee on Tuesday sent out subpoenas to individuals, including state lawmakers from Arizona and Pennsylvania, who were allegedly involved in efforts to overturn the 2020 presidential election results and who worked to appoint alternate Donald Trump electors in states Joe Biden won.",
    "The committee is demanding documents and testimony from six people, including campaign employees and someone who reportedly saw Trump's personal lawyer, Rudy Giuliani, tell state lawmakers in Michigan that if they certified the election results for Biden, who won the state, it would be illegal.",
    "The committee says it has communications that show Roman and Brown's involvement in a coordinated strategy to contact Republican politicians in particular state legislatures that Trump lost, urging them to reclaim? their authority by sending alternate electors that would be supportive of Trump.",
    "We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,? Chairman Bennie Thompson said in a statement.",
    "Douglas V. Mastriano, a Republican member of the Pennsylvania state Senate, participated in a plan to arrange an alternate slate of electors on Jan. 6 and spoke with Trump about his post-election activities, the panel's letter to him says.",
    "The Select Committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes.?",
    "After the November 2020 election, Giuliani went on a tour across the country to falsely claim the election was stolen, pursue legal challenges and to convince state legislators to try to overturn their states results.",
    "She also sent out messages the election had been stolen and posted a video containing unsubstantiated theories of election interference by Dominion Voting Systems, the committee said in its subpoena letter.",
    "Laura Cox was present when Giuliani pressured Michigan politicians to not accept the election results there and said certifying them would be a criminal act,? the committee says in its letter to Cox.",
    "Mark W. Finchem, a Republican member of the Arizona Legislature, advanced claims the election was rigged? and that the American people had been robbed? shortly after Arizona certified Biden's win.",
    "Finchem also communicated with leaders from the Stop the Steal organization leading up to and on Jan. 6 and indicated he was at the Capitol grounds on Jan. 6.",
    "On Dec. 14, 2020, Ward also acted as a purported Electoral College elector to meet and transmit to Congress an alternate slate of votes, the committee said.",
    "The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.",
    "Finchem also helped organize a hearing in Phoenix where unproven claims of election and voter fraud were advanced.",
    "Giuliani, along with other members of the Trump legal team, was subpoenaed by the panel in January.",
    "Send the elector choice back to the legislatures,? Ward tweeted during the Capitol attack.",
    "Mastriano was also was at the Capitol complex while the attack happened, the letter says.",
    "Congress is adjourned."
  ]
}