{
  "id": 974,
  "mediaId": 675,
  "date": "d2022-02-14T18:47",
  "headline": "The Richard Nixon his loyalists knew",
  "image": "https://www.wnd.com/wp-content/uploads/2015/08/President-Nixon-during-Watergate-scandal.jpg",
  "link": "https://www.wnd.com/?p=4982309",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick J. Buchanan",
  "authorUrl": "https://www.wnd.com/author/pbuchanan/",
  "termIds": [
    1099,
    1234,
    1280,
    1367,
    1630,
    1820,
    1930,
    2171,
    2272,
    2483,
    2945
  ],
  "sentences": [
    "TRENDING: Jaw-dropping satellite images show massive reason the Winter Olympics shouldn't be in China\nNarrowly defeated by JFK in 1960, Nixon, by 1968, had executed one of the greatest comebacks in U.S. political history and was poised to capture the Republican nomination a second time.",
    "U.S.\nCommentary\nJoseph Farah\nMychal Massie\nScott Lively\nRead all of today's COMMENTARY...\nMoney\nFaith\nWorld\nPolitics\nHealth\nEducation\nDiversions\nMORE COMMENTARY\nRachel Alexander\nMichael Brown\nPatrick J. Buchanan\nDennis Prager\nRead all of today's COMMENTARY...\nNew Section",
    "Through anecdote and story, he describes the brilliant complex man for whom he loyally labored all those years, up through the campaign of 1972, the triumph of Nixon's political life when he swept 60% of the vote and 49 states against Sen. George McGovern.",
    "Two months later, in June, Bobby Kennedy was assassinated in a Los Angeles hotel kitchen after winning the California primary,\nWith the Democratic Party torn over issues of race, riots and war, Nixon was elected with 43% of the vote.",
    "Indeed, if you would know what it was like to be at Nixon's side for five years, at the apex of American politics and at the beginning of the greatest fall of a president in American history, that, too, is a reason to read this book.",
    "Bedeviled by anti-war protests and bomb threats, Nixon's first year ended in triumph after his \"Silent Majority\" speech rallied the nation and rocked the left back on its heels, vaulting the president's approval rating to 69%.",
    "Chapin snapped the first photo of the president-elect in his suite at the Waldorf Astoria and was at the private emotional meeting in Key Biscayne between the president-elect and the defeated Vice President Hubert Humphrey.",
    "Through both, Nixon maintained the country's allegiance during his four-year effort to extricate America with honor from the war into which the U.S. establishment, the Best and the Brightest, had plunged the nation.",
    "As he declared his candidacy that first day of February 1968, the Communists' Tet Offensive, which would break the will of the liberal elites who were running America's war, had exploded all across South Vietnam.",
    "And no staff member was closer to Nixon in the campaign of 1968, or for the first four years of his presidency, than his personal aide Dwight Chapin, whose memoir, \"The President's Man,\" is published this week.",
    "The campaign of 1968 and Nixon's first term as president are at the heart of Chapin's book, as he spent that half decade at Nixon's elbow when he was on the road, and at the desk outside his Oval Office.",
    "The formats at which Nixon excelled were the presidential press conferences, adversary proceedings all, featuring a president baited by a hostile press, and the nationally televised prime-time address.",
    "There, Nixon negotiated the most sweeping arms control agreements  the Strategic Arms Limitation Treaty and the Anti-Ballistic Missile Treaty  since the Washington Naval Agreement of the early 1920s.",
    "Chapin was the staff man at Nixon's side when he went to Atlanta to visit Coretta Scott King and her children and Dr. King's father, \"Daddy King,\" days before they marched in the funeral procession.",
    "How he dealt with this personal disaster then and for the decades following is Chapin's life story, bravely told in this book\nIt is a story worth telling and worth hearing.",
    "Where Donald Trump used social media to communicate with his following, Nixon used national television to go over the heads of a hostile press and reach the country.",
    "Chapin was at Nixon's side every day of that trip and had negotiated with the Chinese to prepare the schedule for both the president and first lady Pat Nixon.",
    "He had recruited a friend from his college days to do for the Nixon campaign of 1972 what famed prankster Dick Tuck had routinely done for the Democrats.",
    "But, with the Watergate break-in of June 1972 and the unfolding scandal, some of the campaign pranks turned out to be violations of campaign law.",
    "Whenever America is polarized, as it is today, people go back in memory and history to recall other times their nation was so divided.",
    "Four days later, Martin Luther King Jr. was assassinated in Memphis, and 100 U.S. cities were burned and looted in a week of riots.",
    "Throughout the book, Chapin describes, from his unique vantage point, the Richard Nixon some of us yet personally recall.",
    "Coincidentally, this February of 2022 is the 50th anniversary of Nixon's trip to China that changed the world.",
    "The Civil War of the 1860s and the social revolution that tore us apart in the 1960s come instantly to mind.",
    "Chapin was with Nixon when he went to Moscow in 1972, the first-ever visit to the USSR by a U.S. president.",
    "In that latter time, there was no figure more central to the conflicts of his day than Richard M. Nixon.",
    "For Dwight Chapin, however, the triumph of 1972 ushered in the great personal crisis of his life.",
    "The investigation would cost Chapin his White House job and eventually land him in prison.",
    "Two months later, Lyndon Johnson, challenged in his party's primaries by Sens.",
    "Eugene McCarthy and Robert Kennedy, announced he would not run again."
  ]
}