{
  "id": 976,
  "mediaId": 675,
  "date": "2/14/2022 12:00:00 AM",
  "headline": "Trump hammers 'fake' polls showing his grip over GOP slipping",
  "image": "https://www.wnd.com/wp-content/uploads/2020/10/donald-trump-hands-up-arms-questioning-whats-up-puzzled-curious-why.jpg",
  "link": "https://www.wnd.com/?p=4982159",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    1147,
    2171,
    2475,
    428,
    2537,
    2672,
    2782,
    2791,
    2816,
    2818,
    2972
  ],
  "sentences": [
    "The Fake News does everything within their power to diminish and belittle but the people know, and the politicians seeking the Endorsement really know!?\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "U.S.\nCommentary\nJoseph Farah\nMychal Massie\nScott Lively\nRead all of today's COMMENTARY...\nMoney\nFaith\nWorld\nPolitics\nHealth\nEducation\nDiversions\nMORE COMMENTARY\nRachel Alexander\nMichael Brown\nPatrick J. Buchanan\nDennis Prager\nRead all of today's COMMENTARY...\nNew Section",
    "TRENDING: Jaw-dropping satellite images show massive reason the Winter Olympics shouldn't be in China\nAn NBC News poll from January found that Republicans were more supportive of the party than Trump by a 20-point margin, a 39-point swing from January 2021.",
    "Some, like Alabama Rep. Mo Brooks and former Georgia Sen. David Perdue, who are running for Senate and governor in their respective states, have failed to surge ahead of their competition or the incumbents whom they face.",
    "By Andrew Trunsky\nDaily Caller News Foundation\nSeveral new polls show that former President Donald Trump's grip over the Republican Party may be slipping as the 2022 election cycle prepares to kick into gear.",
    "Trump responded Sunday to allegations that his grip was loosening, saying that his endorsement is much stronger today than it was? even before the 2020 election.",
    "I am almost unblemished in the victory count, and it is considered by the real pollsters to be the strongest endorsement in U.S. political history,? Trump said.",
    "A YouGov poll from early February found that just 54% of Republicans had a very favorable? view of Trump, down nine points from October 2021.",
    "While the February poll shows Trump's overall approval among Republicans stood at 76%, that figure was down 10 points over the same period.",
    "There are plenty of existing politicians who wouldn't be in power now were it not for my Endorsement (like the Old Crow!",
    "These statistics come ahead of dozens of high-stakes primary elections, some of which feature Trump-endorsed candidates.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "),? he added, criticizing Senate Minority Leader Mitch McConnell."
  ]
}