{
  "id": 979,
  "mediaId": 675,
  "date": "d2022-02-12T13:45",
  "headline": "Healthcare middlemen facing new headwinds from entrepreneurs like Mark Cuban",
  "image": "https://www.wnd.com/wp-content/uploads/2021/12/doctor-physician-medicine-medical-health-care-treatment-Pixabay.jpg",
  "link": "https://www.wnd.com/?p=4980631",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    2171,
    2368
  ],
  "sentences": [
    "Politics\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Allowing a Trump-era executive order known as the rebate rule to take effect would do just that for Americans on Medicare Part D. Congress should then use that rule as a blueprint to draft legislation that benefits all patients.",
    "The workaround is constructive, but our elected leaders in Congress should address the root of the problem: Supply chain middlemen, armed with the government's stamp of approval, jacking-up the price of your medicine.",
    "It finds that 50 cents of every dollar spent on brand name medication doesn't actually go to the company that made it, but rather to middlemen, insurance companies, and other supply chain stakeholders.",
    "A broader solution is needed immediately to address out-of-control medicine costs for everyone  especially when high economy-wide inflation is squeezing household budgets to a pulp.",
    "TRENDING: Police make frantic arrest after 8 D.C. schools hit with bomb threats on same day\nA new 2022 report from the Berkeley Research Group reveals the extent of the scheme.",
    "And with little price transparency and government-approved immunity from federal anti-kickback laws, PBMs are able to sidestep free market mechanisms to game the system.",
    "The entrepreneur launched a platform that allows Americans to access medicine more directly from manufacturers  no insurance plan or healthcare middlemen required.",
    "Another good proposal is to expand personal health management accounts, which allow employers to contribute tax-free dollars to employee healthcare needs.",
    "But that process should be transparent and most of the discounts and rebates provided by drug manufacturers should flow to patients at the point of sale.",
    "Those funds can help cover direct primary care options that offer individuals and families routine medical services for a low monthly membership fee.",
    "They pocket discounts already provided by drug manufacturers rather than passing along those dollars to patients as savings at the pharmacy counter.",
    "In reality, the major drivers of skyrocketing consumer costs are the middlemen of the drug supply chain called Pharmacy Benefit Managers (PBMs).",
    "Mr. Cuban's pharmaceutical venture is one example of free market innovation helping to remedy a problem created by misguided government action.",
    "These practices also offer pharmaceuticals at transparent, reasonable prices without middlemen and insurance bloat getting in the way.",
    "By Elaine Parker\nReal Clear Policy\nBillionaire Mavericks owner Mark Cuban recently made a splash into the world of prescription drugs.",
    "To the chagrin of keyboard warriors on Twitter, the problem isn't as simple as placing the blame on greedy? corporations.",
    "In many cases, the prices are even lower than what many who have insurance would pay to cover deductibles and copays.",
    "The rise of companies like Mr. Cuban's  although a welcome workaround  should be a wake-up call for elected leaders.",
    "All of these proposals are part of the Job Creators Network Foundation's larger Healthcare for You reform framework.",
    "Elaine Parker is the President of the Job Creators Network Foundation, which manages HealthcareForYou.com.",
    "For example, a leukemia treatment that typically retails for $9,700 a month is only $47 on the website.",
    "Families shouldn't have to decide between putting food on their table or filling a prescription.",
    "Because Mr. Cuban's platform bypasses this mess, patients can access medicine at lower costs.",
    "They act as the gatekeepers between drug manufacturers, insurance companies, and consumers.",
    "Since 2000, expenditures on prescription drugs have nearly tripled in the U.S.",
    "Targeting the profiteering practices of PBMs should be at the top of the list.",
    "[Editor's note: This story originally was published by Real Clear Policy.]",
    "[Editor's note: This story originally was published by Real Clear Policy.]",
    "The result will be more affordable treatments and therapies for patients.",
    "Collecting fair compensation for services rendered is welcome.",
    "Think yearly check-ups, telemedicine, or mending broken bones.",
    "An ulcerative colitis drug is one-thirtieth of the cost.",
    "And a treatment for gout is $170 cheaper per month.",
    "The result is a higher price tag on medication.",
    "Drug costs have been ballooning for decades.",
    "Four PBMs control 85 percent of the market.",
    "And that proportion grows every year.",
    "The question is why?",
    "Cheers to that."
  ]
}