{
  "id": 982,
  "mediaId": 675,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Let's be known by our love  biblical love",
  "image": "https://www.wnd.com/wp-content/uploads/2021/09/license-plates-florida-love-now-luv-romance-peace-dating-jk.jpg",
  "link": "https://www.wnd.com/?p=4981778",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Laurie",
  "authorUrl": "https://www.wnd.com/author/glaurie/",
  "termIds": [
    691,
    1180,
    1740,
    1788,
    2171,
    2945
  ],
  "sentences": [
    "Summary\nRecent Posts Contact\nPolitics\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "In the New Testament book of Acts, we find four principles that guided those first believers: they were a learning church, they were a worshiping church, they were an evangelistic church, and they were a loving church.",
    "However, this doesn't mean that we are to isolate ourselves, because Jesus also said, \"Let your light so shine before men, that they may see your good works and glorify your Father in heaven\" (Matthew 5:16 NKJV).",
    "Any attempt to eradicate the church that Jesus established and maintains will meet with failure, because Jesus said of his church, \"the gates of Hades shall not prevail against it\" (Matthew 16:18 NKJV).",
    "The result is that people are looking for a place where they can belong, a community where they can feel safe, a family they can be part of, and somewhere they can genuinely love and be loved in return.",
    "And in 1 Corinthians 13, Paul's purpose isn't to give us a technical analysis of love but to instead break it into bite-sized pieces so we can more easily understand it and apply it in a practical way.",
    "TRENDING: Jonathan Edwards' famous sermon and oral sex lesson: Same town\nThe first-century church, the church Jesus began, turned their world upside down and dramatically impacted the culture.",
    "Check out Greg Laurie's books and movies in the WND Superstore\nThe apostle Paul tells us in the book of Romans that Christians are \"the called of Jesus Christ\" (1:6 NKJV).",
    "This is the same kind of love Jesus spoke of that turns the other cheek, the kind of love that has as its primary concern not its own welfare but the welfare of others.",
    "In fact, I don't know of a time, at least in my life, when our culture has been more divided in the United States, perhaps with the exception of the tumultuous 1960s.",
    "The Bible says, \"The love of God has been poured out in our hearts by the Holy Spirit\" (Romans 5:5 NKJV), and \"the fruit of the Spirit is love\" (Galatians 5:22 NKJV).",
    "And notice that Paul said, \"Love never gives up, never loses faith, is always hopeful, and endures through every circumstance\" (1 Corinthians 13:7 NLT).",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "Don't let secular thinking find its way into your mind and heart, where you start believing the entire planet revolves around you.",
    "Love never gives up, never loses faith, is always hopeful, and endures through every circumstance\" (1 Corinthians 13:47 NLT).",
    "Love is the glue that holds us all together, and 1 Corinthians 13 is basically the Bible's definitive chapter on love.",
    "Rather than celebrating what we have in common, it seems nowadays that we emphasize the things that separate us.",
    "But foibles and all, it's the only organization Jesus Christ himself ever started, and it's still going strong.",
    "In other words, God has called his people out of a world system that is hostile to the teachings of Scripture.",
    "Instead, we can find God's people going into these places to help, trying to show his love in a tangible way.",
    "When there are hurting people in the world, we don't see atheists leading the charge to reach out to them.",
    "God's love that we are to demonstrate to each other is not something that's a mere feeling or an emotion.",
    "We exalt vengeance as a virtue and scoff, even laugh, at people who forgive or turn the other cheek.",
    "Here the apostle Paul shines love through a prism, so to speak, where we see its colors and hues.",
    "Don't look out only for your own interests, but take an interest in others, too\" (verses 34 NLT).",
    "Paul doesn't focus so much on what love is; rather, he focuses on what love does and doesn't do.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "This fruit will be the result of abiding in Christ and seeking to be more like him every day.",
    "In the New Testament, the Greek word for \"church\" is ekklesia, which means \"called out ones.\"",
    "This is the kind of love that should work its way into our lives: \"Love is patient and kind.",
    "Can you imagine what kind of world we would live in if people operated by that principle?",
    "Other people are out for themselves, and if you lower your guard, they will rip you off.",
    "We live in a time when our society is becoming increasingly disjointed and divided.",
    "In Philippians 2, Paul wrote, \"Don't be selfish; don't try to impress others.",
    "It does not rejoice about injustice but rejoices whenever the truth wins out.",
    "In fact, it's the most comprehensive description of love in all of Scripture.",
    "Nor do we see hedonists leading the charge or Hollywood leading the charge.",
    "And God has a unique purpose and place for the church in the world today.",
    "But as I've said before, it seems today as though the opposite is true.",
    "God's love doesn't simply have kind feelings; it does kind things.",
    "Can you imagine what kind of churches, even, that we would have?",
    "However, we live in a culture that says, \"Forget about others.",
    "There is nothing in the world quite like Christian fellowship.",
    "It is not irritable, and it keeps no record of being wronged.",
    "Be humble, thinking of others as better than yourselves.",
    "Let that be said of us as the church and as individuals.",
    "God's love doesn't merely feel patient; it is patient.",
    "But don't let this world squeeze you into its mold.",
    "It is active, it engages, it works, and it moves.",
    "Love is not jealous or boastful or proud or rude.",
    "I know the church is made up of imperfect people.",
    "This means God's people have been called out.",
    "How could we ever live up to these standards?",
    "May our lives be characterized by this love.",
    "We know the early believers stuck together.",
    "This is what God wants us to strive for.",
    "If someone offends us, then we sue them.",
    "And that is exactly what the church is.",
    "But this is what we should aim toward.",
    "They helped and cared for each other.",
    "Love is fully love only when it acts.",
    "You have to look out for number one.",
    "Maybe you're thinking, \"Oh, please.",
    "In short, they loved one another.",
    "I know the church isn't perfect.",
    "It does not demand its own way.",
    "They'll take advantage of you.",
    "Revenge is the operative word.",
    "It isn't abstract or passive.",
    "That's all that matters.\"",
    "Think only of yourself.",
    "It's impossible!\"",
    "Yes, it is."
  ]
}