{
  "id": 991,
  "mediaId": 675,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Vet awarded Purple Heart at 99  and 31 fallen heroic cops",
  "image": "https://www.wnd.com/wp-content/uploads/2014/06/d-day.jpg",
  "link": "https://www.wnd.com/2022/02/vet-awarded-purple-heart-99-31-fallen-heroic-cops/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Norris",
  "authorUrl": "https://www.wnd.com/author/cnorris/",
  "termIds": [
    875,
    1659,
    2087,
    2171,
    357,
    413,
    542,
    550,
    2826,
    2896
  ],
  "sentences": [
    "John Lott, the president of the Crime Prevention Research Center , former senior adviser for research and statistics at the U.S. Department of Justice's Office of Legal Policy and most recently the author of \"Gun Control Myths,\" rightly pointed out this last week: \"But [Biden's] 'guns first' approach ignores a basic fact  over 92% of violent crimes in America do not involve firearms.",
    "Speak of injuries to the great defenders of the U.S., we were flabbergasted to also learn that 24 police officers were shot in the U.S, including five killed, in January alone, according to statistics compiled by the Gun Violence Archive, a nonprofit website that tracks shootings.",
    "Lott backed up his claims with the following evidence:\nThe U.S. Department of Justice's National Crime Victimization Survey, in the latest year available (2020), shows that there were 4,558,150 rapes, robberies, and aggravated assaults, and the FBI reports 21,570 murders.",
    "Three of the officer deaths were on-duty deaths, one was an off-duty officer shot and killed during an attempted robbery, and one was ambushed by gangs in East Los Angeles as he served in his hometown trying to bring more law and order.",
    "The New York Post reported, \"Fletcher, who served with the 254th Port Battalion, was working as a crane operator on D-Day when he was hit by a German missile that left him with leg injuries and a head gash that scarred him permanently.\"",
    "A World War II black veteran, 99-year-old Osceola \"Ozzie\" Fletcher, finally received his Purple Heart, an award presented to service members who have been wounded or killed as a result of enemy action while serving in the U.S. military.",
    "To add insult to injury, when addressing the rise in law enforcement shootings, all that President Biden could do this last week was to blame guns (and a lack of gun laws and regulations), and not blame the actual criminals.",
    "Gun violence occurs for the same reason that every other act of violence occurs: because human nature is bent to sin and evil, and when provided the right  or wrong  circumstances, human injury and tragedy often ensues.",
    "Thankfully, many large cities across the U.S. are realizing (the hard way) the folly behind those who pushed to defund our police departments over the last two years, including New York and San Francisco.",
    "They, as well as their active sisters and brothers serving right now in streets all across America, all prove what President Ronald Reagan once said: \"Evil is powerless if the good are unafraid.\"",
    "Gen. James McConville said at the Fort Hamilton Army base ceremony: \"He has spent his entire life giving to those around him whether they were brothers in arms, families, or his community.",
    "\"As crime rates continue to rise, the violence directed at law enforcement officers is skyrocketing,\" Patrick Yoes, the president of the Fraternal Order of Police said in a statement.",
    "I've said it before and will say it 100 times again: Blaming guns for shootings is like blaming beds or back alleys for rapes, crowbars for burglaries, and Slim Jims for car thefts.",
    "Politics\nEducation\nHealth\nWorld\nDiversions\nMoney\nFaith\nMORE COMMENTARY\nLaura Hollis\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Pray the rest come to their senses, and we as a nation reverse course immediately before one more great man or woman in blue has to die in the line of duty.",
    "\"I have worked in law enforcement for 36 years, and the current level of violence targeted at our law enforcement officers is the worst I have ever seen.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "My wife, Gena, and I were just ecstatic to learn that Fletcher finally received this great military award, even though it was 70 years too late!",
    "But while violent crime reported to police rose 5% in 2020, you can't blame that increase on guns because gun crimes actually fell by 27%.",
    "Speaking of fallen and fearless warriors, I want to conclude giving a shout out to one who passed recently in my wife's rural hometown.",
    "It was awarded to Fletcher at a ceremony at the Fort Hamilton Army base for wounds he suffered in the Battle of Normandy in 1944.",
    "But it's never too late to be patriotic and inspired, especially when it's being spurred on by one of our amazing U.S. veterans.",
    "Dave LaGroue and his biological brother Rick spent their whole lives serving our great country as California Highway Patrolmen.",
    "It reminds me of a billboard that was reported to be in Arizona that points to the very first murder as recorded in the Bible.",
    "After only 10 or so years in retirement, Dave suddenly and unexpectedly died a few weeks ago from an apparent heart attack.",
    "The then-22-year-old soldier was forced to trudge through the English Channel covered in blood, Gen. McConville explained.",
    "According to the Officer Down Memorial Page, 31 total law enforcement officers died in January alone serving our country.",
    "When asked how he felt to have received his Purple Heart, the 99-year-old patriot said that he was simply \"exhilarated.\"",
    "And while Biden blames guns for the increase in violent crime, the latest data show that gun crimes fell dramatically.\"",
    "Heaven's blessed to have a soul like him, and he will be greatly missed by his family, friends and church on earth.",
    "Of those, 350,460 rapes, robberies, and aggravated assaults (see Table 8) and 13,620 murders involved firearms.",
    "Even in the heart of winter and snow, roughly 400 people attended his outside service (in a town of 2,000!).",
    "U.S. Army officials said that Fletcher was \"overlooked\" because of racial inequalities in yesteryear.",
    "The primary cause of shootings, like other violent crimes, is the corrupt character of the criminal.",
    "Rest in peace, Dave, and the other valiant law enforcement mentioned above, until we see you again!",
    "His Celebration of Life, complete with the CHP Honor Guard, was held at an iconic barn in the area.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "U.S.\nCommentary\nPatrice Lewis\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...",
    "There are a few people that rise above the rest in a profound way, and Dave was certainly one.",
    "(Jeremiah 17:9 in the Bible states: \"The heart is deceitful above all things and beyond cure.",
    "Despite that we don't know for sure if Cain's weapon was a rock, the point is still made.",
    "Relying on public health researchers, Democrats blame increasing gun sales as the cause.",
    "We had heard about the Germans setting off missiles the size of asteroids.\"",
    "The National Crime Victimization Survey also finds a similar 27% drop.",
    "It's not the weapon or tool used in the crime that's to blame.",
    "The story was first reported last June in the New York Post.",
    "Adding those numbers up, 7.9% of violent crimes used guns.",
    "(Check out the photos and video of Ozzie's ceremony here.)",
    "\"Something, a missile, hit [our] tractor,\" he said.",
    "The billboard reads, \"Cain killed Abel with a rock.",
    "\"We're leaving the shoreline,\" Fletcher recalled.",
    "54 in my \"101 Favorite Chuck Norris Facts\" book.",
    "I can't believe I didn't catch this in the news.",
    "Well, today it's Ozzie's turn to receive.\"",
    "It's a heart problem, not a gun problem.",
    "You've got to hear it if you didn't.",
    "And we're going into the forest.",
    "What's wrong with this picture?",
    "America, this shouldn't be!",
    "I quoted Dave in entry No.",
    "\"We're leaving the water.",
    "\"That was an awful day.\"",
    "Who can understand it?\")",
    "Jeremiah 17:9.\""
  ]
}