{
  "id": 992,
  "mediaId": 409,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "How Michigan's Ballooning DEI Bureaucracy Stifled Speech and Divided the Campus",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/university-michigan-campus.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/how-michigans-ballooning-dei-bureaucracy-stifled-speech-and-divided-campus/",
  "sentiment": "0.0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Mills",
  "authorUrl": "https://www.nationalreview.com/author/ryan-mills/",
  "termIds": [
    2171
  ],
  "sentences": [
    "Last March, the Students of Color Liberation Front  a partnership of more than a half dozen campus racial-justice groups  released a 20-page list of anti-racist demands? from U-M leaders, including: decolonizing U-M's pedagogies and campus; divesting from companies that violate Palestinian human rights; ending all university-sponsored trips to Israel; declaring Indigenous People's Day a U-M holiday; cutting ties with the local police department and federal immigration agencies; and, of course, serving locally sourced, Arab-owned-brand hummus in the dining halls.",
    "In 2016, for example, a campus housing official reported a phallic-shaped snow sculpture as a bias incident.? In 2020, the university's Information and Technology Services department released a draft list of problematic words and phrases, including picnic,? sweetheart,? brown bag,? and hi guys!?\nLast fall, a celebrated composer and music professor ran afoul of U-M's DEI machine after he hosted a screening of the 1965 film Othello, in which the celebrated English actor Laurence Olivier portrays the title character in blackface.",
    "The Biggest Challenge\nIt was in that context that Schlissel, then the university's new president, announced his commitment to DEI across U-M. At a February 2015 breakfast with about 200 faculty, staff, and student and administrative leaders, Schlissel said that diversifying the campus would be the biggest challenge that we're going to confront together.?\nWe cannot neglect any group in our work,? he said, according to a report in the University Record.",
    "And so every time they look, of course, they're going to find it.?\nTogether, these trends have a blandifying? effect, just sort of grabbing and squishing out anything that's original, unusual or, God forbid, might expose things or expose students to things that bother them.?\nOf the university's efforts to create an inclusive environment, he said, I'm on board in principle, but then the weird thing that happens is that you build this machinery .",
    "They are instead paid sinecures for people who go and work for the government, and by the way, they have become among the biggest donors to Democrats.?\nOffended Students, Faculty on Edge\nU-M faculty who spoke to National Review said that the growth of the DEI bureaucracy, along with a student body that is increasingly sensitive to the smallest perceived microaggression, has made it harder to do their jobs.",
    "In 2018, U-M was sued by a conservative group, Speech First, which accused the university of creating an elaborate investigatory and disciplinary apparatus to suppress and punish speech other students deem demeaning,' bothersome,' or hurtful.'? The Trump Justice Department filed a statement of interest in the case, calling the university's policies against harassment, bullying, and bias overly broad.",
    "In 2014, U-M students protested the police killings of Michael Brown in Ferguson, Mo., and Eric Garner in New York City, holding campus vigils and so-called die-ins.? Ann Arbor had its own controversial police shooting in November 2014, when officers shot and killed Aura Rosser, a black woman, who confronted officers with a knife while in a rage after a domestic-violence incident with her boyfriend.",
    "To better understand how U-M's DEI bureaucracy has grown over the years, National Review obtained annual university staff lists going back to 2002 and used them to identify staff members with DEI-related job titles, or employees of the various diversity centers, units, and programs listed on the school's website under the Office of Diversity, Equity, and Inclusion umbrella.",
    "You have to tailor everything you say to how the most sensitive student on campus might interpret your comments.?\nCritics say U-M's DEI bureaucracy perpetuates itself by creating an environment where students are constantly told that bigotry is systemic, and that it is their duty to root it out, leading to more bias reports, and an ever greater need for more DEI staff.",
    "Five years ago, if you said DEI was a core value of this institution, you would have an argument.?\nRather than make U-M a more tolerant place, there's evidence that its DEI push has instead created a more culturally rigid campus, the kind of place where woke students and staff are forever on the lookout for offenses against the politically correct orthodoxy.",
    "The Toll of a Trial\nWhen the SVA trial began, student justices were charged with making a recommendation to a dean, who would decide the fate of the organization, which focused on community work, like laying wreaths on veterans' graves and working in food kitchens, in addition to cultivating a sense of belonging for student veterans.",
    "Minority admissions fell in the wake of the referendum, but a deeper dig into the data shows that the enrollment of black students had been declining for more than a decade at that point; black students were 8.9 percent of the student body in 1995, but dropped to 7.6 percent in 2006, and eventually dropped below 5 percent in 2010.",
    "Over the last decade, U-M's leaders have intentionally cultivated one of the nation's largest university DEI infrastructures  an effort they say is vitally important to ensure the university's excellence into the future,? but that critics say has created a campus climate that too often stifles debate and stunts creativity.",
    "One former editor at the Michigan Review, the right-leaning college newspaper in Ann Arbor, said that many students would refuse to write for the publication, ask for a pseudonym if they did, and even request that old articles be taken down, all for fear of backlash from their peers or the administration.",
    "the pressure groups to have a larger army of activists for their cause.?\nMulticultural Roots\nThe roots of U-M's diversity apparatus stretch back to the 1960s and early 1970s, a period when the campus was a key national hub of the decade's left-wing agitation, civil-rights protests, and anti-war activism.",
    "After the student raised her concerns, a bureaucrat inside the university's Office of New Student Programs  just one part of Michigan's sprawling diversity, equity, and inclusion infrastructure  filed a formal complaint accusing the group of discriminating against women, among other allegations.",
    "However, many of the accomplishments they cite in their progress reports and in news articles seem to be more about building out the DEI infrastructure itself  designing DEI-related trainings and programs, adding staff members  than about actually making the campus more diverse and tolerant.",
    "The analysis found that while employment in the university's multicultural centers has remained relatively consistent over the last 20 years, the DEI bureaucracy has rooted itself deeper at the administrative level, and it has begun branching out into U-M's various colleges and schools.",
    "The Heritage Foundation's Diversity University report released last summer found that U-M had by far the largest number of staff members whose jobs are based on propagating and promoting DEI of any of the 65 universities in the five power? athletic conferences the researchers reviewed.",
    "In one example, a student took issue with an anodyne line in the instructor's syllabus acknowledging his age and encouraging students to come to him with any concerns should he say anything out of touch in class; the aggrieved pupil misinterpreted it as a preemptive excuse.",
    "Students and faculty who spoke to National Review described a campus culture where people fear that committing even a minor slipup deemed insensitive by someone, somewhere, could put them in the crosshairs of DEI bureaucrats, whom activists are more than happy to weaponize.",
    "One of the core issues with the DEI machinery? is that it begins with this orientation that says, well if a student's feelings are offended, that's the biggest problem you could have,'? said the faculty member, who spoke on condition of anonymity for fear of retaliation.",
    "Rather than make U-M open to a wider range of ideas, conservative students and alumni who spoke to National Review said they believe the growing DEI bureaucracy has made the campus increasingly inhospitable to those who dissent from the mainstream political culture.",
    "U-M's women's center (now the Center for the Education of Women +) was established in 1964, followed in 1971 by what is now known as the Trotter Multicultural Center and the Spectrum Center, possibly the nation's oldest LGBTQ support center on a college campus.",
    "Those of different races and ethnicities, sexual orientations, gender identities, faiths, income levels, political perspectives, viewpoints, and disabilities all must feel welcome.?\nIn 2016, Schlissel announced that U-M would invest $85 million in DEI programs.",
    "Other professors, he said, have been referred to the OIE for crimes such as suggesting they have a quick powwow? with students or referring to excuses as lame.? Some students, suggested the faculty member, call the police first for every little thing.",
    "And there's no longer any charity, no longer any goodwill and no longer the presumption of good intent.? That tendency, he argued, combines with a DEI-focused administration constituted on the premise that a problem exists and must be rooted out.",
    "This incentive structure for DEI staff in the administration is accentuated by the culture among a narrow slice of the student body that wants to hijack this process,? a phenomenon the faculty member said he has observed over and over again.",
    "Jackowski argued that the whole thing was blown out of proportion, and he blames the university's DEI bloat, as well as the culture it perpetuates, for inflating what should have been a small internal spat into a formalized, Kafkaesque war.",
    "But, he said, the massive U-M DEI apparatus also incentivizes students to turn to the power of the bureaucracy to solve even minor conflicts with their peers or their professors, and creates odd power dynamics that govern those conflicts.",
    "It got far more tense, far more explosive, far more emotional, and the DEI resources that were made available on campus certainly didn't help.?\nSchlissel was fired last month for having an inappropriate relationship? with a subordinate.",
    "For example, after the 2016 election, Schlissel attended a vigil and told the 90 percent of the U-M community who cast ballots for Hillary Clinton that they had voted to reject hate? and fractiousness,? according to video of the vigil.",
    "In the early 2000s the university was at the center of the national debate over affirmative action and the use of racial preferences in college admissions, culminating in the landmark 2003 U.S. Supreme Court case Grutter v. Bollinger.",
    "The night before the trial began, the student who had originally raised concerns sent to every major member of the university's administration a 100-page document tearing apart preemptive witness statements and other documents.",
    "When people who are being told and educated that racism is pervasive in every aspect of the college experience, when they don't encounter it, they go and seek it out, or they sort of exaggerate instances,? Arm said.",
    "The data show DEI staffing soared beginning in 2015, the year then-president Mark Schlissel announced he was making DEI a major focus of my presidency.? Between 2002 and 2014, U-M averaged 67 DEI staffers per year.",
    "Instead of being referred to the OIE, the department chair approached him, reviewed his record, asked him about the comments, and recognized the complaints for the search-and-destroy mission they constituted.",
    "Instead, the report had a heavy focus on things like increasing DEI-related workshops and anti-racist programming, adding new staff members and interns, and establishing a new diversity-related career award.",
    "Students also noted that U-M's increased DEI commitment coincided with former president Donald Trump's election and four years in office, a period when some of U-M's top leaders clearly showed their biases.",
    "We are not the same institution that we were five years ago,? Sellers said at an October celebration of the first five years of the university's DEI commitment, according to the student-run Michigan Daily.",
    "The analysis found that U-M had at least 167 staff members dedicated to DEI and other multicultural initiatives in 2021, more than four times the approximately 40 DEI staffers working on campus in 2002.",
    "The analysis focused on U-M's main Ann Arbor campus and tried to include only university staff whose primary role is propagating DEI, not faculty who are ostensibly dedicated to teaching and research.",
    "National Review has identified more than 20 other current employees whose online bios indicate they are part of U-M's DEI bureaucracy but who are not identified as DEI staffers on the staffing lists.",
    "Jay Greene, one of the authors of the Heritage report, said there's little evidence that the growth of the DEI bureaucracy at universities like U-M leads to more racial and gender harmony on campus.",
    "Since then, DEI staffing has spread throughout the university, solidifying its space in the central administration, and branching off into various colleges and schools, and even into the library.",
    "One faculty member who has been affiliated with the university since the 1980s described a series of run-ins between instructors and the increasingly DEI-focused bureaucratic forces in Ann Arbor.",
    "If anything,? she said, it's made it a lot worse.? University students are intentionally steering clear of speaking out on sensitive topics to avoid running afoul of DEI bureaucrats, Neily said.",
    "Diversity and multiculturalism-related positions were not rare in U-M in the first decade of the 2000s, but they were generally contained to a small number of departments and diversity centers.",
    "It may seem like a lot, but the $14.3 million is a rounding error for a university as big as Michigan, which has more than 25,000 faculty and staff, said Greene with the Heritage Foundation.",
    "What it does is it allows ambitious, career-oriented administrators to satisfy a pressure group and rise in their status and pay in the academic administration world, and it also allows .",
    "A 2016 campus climate survey found that about 72 percent of U-M students were satisfied with the school, but it was lower among women, LGBTQ students, and underrepresented minorities.",
    "It started as a crude joke among friends at the University of Michigan's Student Veterans of America chapter, one member ribbing another in an online chat about her sexual proclivity.",
    "I don't think there's any evidence to support the claim that diversity, equity, and inclusion staff are actually promoting the fine words that might be in their titles,? Greene said.",
    "The university's five-year DEI progress report was similarly light on achievements regarding actual campus diversity, campus-climate data, and bias- and harassment-reporting trends.",
    "According to the data, the combined total salaries for all of U-M's DEI employees increased nearly seven-fold, from at least $2.1 million in 2002 to more than $14.3 million in 2021.",
    "In the end, the group escaped any official sanctions, but the ordeal still took a toll: Funding became harder to find, and group leaders struggled emotionally and academically.",
    "For months, they were ensnared in the web of U-M's increasingly powerful DEI bureaucracy, which Jackowski said exacerbated, rather than resolved, the underlying issues at hand.",
    "You've just created the means by which good and bad-meaning people can either stumble into a mistake on this, or malicious people can intentionally abuse that power,? he said.",
    "Jackowski said that certain university programs and staffers were helpful, even going so far as to call both himself and the SVA indebted? to parts of the administration.",
    "The DEI bureaucracy is more like a jobs program for political activists who want to impose a social-justice agenda on campus and enforce ideological conformity, he said.",
    "While there has been an increase in Asian, Hispanic, and LGBTQ students at U-M since 2016, there has been a slight decrease in black enrollment over the last four years.",
    "Wolverines Pathways, a college prep program for underserved high-school students, increased its staffing levels from seven employees in 2016 to at least twelve in 2021.",
    "Multiple attempts by National Review to reach Robert Sellers, U-M's vice provost and chief diversity officer, for comment on the phone and via email were unsuccessful.",
    "Speaking at a hearing about the increasing costs of a university education last summer, Senator Ted Cruz specifically called out the size of the U-M DEI bureaucracy.",
    "She went right to the university and tried to burn us down,? Joe Jackowski, a former member of the veterans' group, told National Review about the incident in 2018.",
    "Neily said she believes the growing university obsession with DEI initiatives has not made campuses open to more perspectives, more welcoming, or more inclusive.",
    "That's well short of the university's 50-year-old goal of reaching a 10 percent black student body, and it hasn't gone over well with racial-justice activists.",
    "Instead, the student opted to send a furious email to the professor and file an official complaint with the university's Office of Institutional Equity (OIE).",
    "The faculty member was urged by the OIE representative to direct students to report him to the OIE directly, rather than addressing the professor personally.",
    "In another instance, students who had been reprimanded for disruptive behavior during class enlisted their friends to enroll in that faculty member's course.",
    "A batch of Schlissel's emails released in 2017 also showed his disdain for Trump, and that he found it ironic? that U-M's Trump supporters felt marginalized.",
    "Last April, listing some of the accomplishments during U-M's first five-year DEI plan, Schlissel notably did not mention enrollment or campus-climate data.",
    "Black undergrad students made up less than 4 percent of the student body in 2021, down from 4.66 percent in 2016, according to university campus snapshots.",
    "U-M's DEI investment doesn't appear to have appeased campus radicals, who still complain that university leaders haven't done enough to extinguish racism.",
    "There's no reason to believe the campus climate at the University of Michigan is three or four times better today than it was 20 years ago,? Greene said.",
    "I just think part of this is the campus culture wars kind of exploded after Trump in a way they hadn't previously,? said Jesse Arm, a 2017 U-M graduate.",
    "In the early 2000s, U-M's DEI staff were primarily housed in the school's Office of Academic Multicultural Initiatives and in a few diversity centers.",
    "Later that year, the university unveiled a five-year DEI strategic plan, dubbed DEI 1.0,? and appointed Sellers U-M's first chief diversity officer.",
    "As part of the Heritage Foundation's study, researchers compared campus-climate survey results from universities with larger and smaller DEI staffs.",
    "The schools of nursing, of environment and sustainability, of public health, and of information all have dedicated DEI staff, the analysis found.",
    "A Changed Institution\nCampus DEI leaders have touted their successes over the last five years in making DEI a core principle of the university.",
    "The joke had been meant as a friendly play on the female student's own joking commentary about her sex life, but the apologies weren't enough.",
    "One former student, who worked at a campus recreation center, said staff were trained in how to implement DEI concepts into exercise classes.",
    "U-M eventually settled the case, agreeing to dismantle its Bias Response Team, which investigated claims of bias and doled out punishments.",
    "Nicole Neily, president of Speech First, said university initiatives that chill speech are the greatest threat to free speech on campuses.",
    "it has a weird dissonant harmony with this political urge to cancel or crush one's political opponents.?\nIs DEI Making a Difference?",
    "He was accused of violating U-M's commitment to anti-racist action, diversity, equity and inclusion,? and suspended for three weeks.",
    "Five years ago, if you said DEI,' people would've thought you were talking about the Digital Education Initiative.",
    "It was color-coded to reflect different kinds of grievances (red for misogyny, yellow for victim-blaming, etc.).",
    "The college of engineering and the college of literature, science, and arts each have at least 13 DEI staffers.",
    "Three years later, Michigan voters approved a referendum banning affirmative action in university admissions.",
    "Approached by the student, the faculty member  true to his word  offered to rewrite the line collaboratively.",
    "Attempts to reach Katrina Wade-Golden, U-M's deputy chief diversity officer, also were not successful.",
    "It's been increasing ever since, rising to at least 86 positions in 2015 and to at least 167 in 2021.",
    "So, has a half-decade's worth of massive DEI investment made U-M a more diverse and tolerant place?",
    "From 2010 to 2014, DEI staffing leveled off, with about 60 to 70 employees, the analysis found.",
    "Instead, he pointed to the development of the DEI bureaucracy itself as evidence of success.",
    "But the joke didn't land well, and the female student  the target of the joke  was angry.",
    "Suddenly, a wave of complaints mischaracterizing and outright lying about him rolled in.",
    "The veterans' group leaders worried that their organization might be forced to disband.",
    "Tripling or quadrupling your DEI staff doesn't make things three or four times better.",
    "Few institutions have seen their DEI infrastructure grow faster or larger than U-M's.",
    "National Review's analysis of U-M staffing data shows the impact of this commitment.",
    "They found little evidence that larger DEI staffs result in more satisfied students.",
    "The bad thing is the political orthodoxy that is strengthened on campus,? he said.",
    "There would be a trial with witnesses, and charges of misogyny and victim-blaming.",
    "The results of a follow-up survey conducted late last year haven't been released.",
    "Jackowski and others feared their organization might be shut down or defunded.",
    "The Office of Diversity, Equity, and Inclusion has about a dozen employees.",
    "These bureaucracies, at the end of the day, they scare students,? she said.",
    "Since 2015, it's been 129, almost double, and rising, the analysis found.",
    "The university's press office did not respond to emailed questions.",
    "The university's botanical gardens and arboretum has a DEI manager.",
    "Students complained, and the professor immediately apologized.",
    "The total of 167 DEI staffers in 2021 is likely an undercount.",
    "U-M's campus climate also was affected by national events.",
    "He was literally suggesting I encourage them to report me.",
    "The bad thing about this DEI growth is not the expense.",
    "You're encouraging students to report on each other.",
    "They left the class right before the drop deadline.",
    "It took my breath away,? said the faculty member.",
    "Our universities don't teach anymore,? Cruz said.",
    "Apologies were swift, effusive, and sincere.",
    "This time, things went differently, though.",
    "The U-M library employs a DEI specialist.",
    "They're intended to scare students.?",
    "This experience was not unique.",
    "But I witnessed it first hand.",
    "It's creepy,? she said.",
    "The matter was dropped.",
    ".",
    ".",
    ".",
    "."
  ]
}