{
  "id": 994,
  "mediaId": 675,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Massive exodus from Harris' office hits speechwriting staff",
  "image": "https://www.wnd.com/wp-content/uploads/2019/08/kamala_harris3.jpg",
  "link": "https://www.wnd.com/?p=4980109",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Unruh",
  "authorUrl": "https://www.wnd.com/author/runruh/",
  "termIds": [
    645,
    645,
    895,
    895,
    1154,
    1154,
    2826,
    2826,
    2725,
    2725,
    2945,
    2945,
    2959,
    2959
  ],
  "sentences": [
    "It was CNN where the first reports of Harris' dysfunctional office emerged, with its comment that, \"Many current and former West Wing aides say that Vice President Kamala Harris is not being adequately prepared or positioned, and instead is being sidelined, causing frustration among staffers.\"",
    "Reports have documented that there's also been conflicts between Harris and her staff and Joe Biden's staff, because he's given her assignments such as the crisis at the southern border that Biden created by canceling President Trump's border security programs.",
    "Harris' speeches have, in fact, created a ruckus even in her own party, with criticism from both insiders and outsiders to her recent comparison of the Jan. 6, 2021, riot at the Capitol to the Japanese attack on Pearl Harbor in 1941 where thousands died.",
    "Politics\nCommentary\nPatrice Lewis\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nLaura Hollis\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "It was the Daily Mail that concluded, \"Joe Biden's relationship with Kamala Harris is in crisis, with her staff furious that she is being sidelined,' while the president's team are increasingly frustrated by how she is playing with American public.\"",
    "The Daily Wire has reported one staff member anonymous told the Washington Post, \"With Kamala, you have to put up with a constant amount of soul-destroying criticism and also her own lack of confidence.",
    "It was last October that to mark Columbus Day, Harris blamed the U.S. for a \"shameful past\" that included European settlers ushering \"in a wave of devastation for tribal nations.\"",
    "But they also say the mainstream media is 'chasing incessantly negative stories and playing into undeniable structural issues of race and gender,' in the words of Politico.\"",
    "Last summer, Rep. Alexandria Ocasio-Cortez, D-N.Y., blasted Harris for telling people from Guatemala to \"not come\" to the United States and become illegal aliens.",
    "Not only is she less popular than her boss, but according to one recent poll, she even broke Dick Cheney's record for most unpopular sitting vice president.\"",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "Her failed presidential campaign seemed to be based on the assumption that Twitter and TikTok likes would win delegates in the Democratic primary.",
    "The departure is just the latest in a long list of staff members who have fled amid multiple reports of dysfunction and antagonism in the office.",
    "Then there also was the comparison to the Sept. 11, 2001 attacks on New York and Washington by Islamic terrorists, where thousands also died.",
    "This time, a report in the New York Post explains, it's Kate Childs Graham, the head of the speechwriting team, who is to \"leave the office.\"",
    "A column by Jonah Goldberg in the Los Angeles Times said bluntly, \"Things have not gone well for Vice President Kamala Harris.",
    "It continued, \"The White House insists there's nothing amiss in Harris-land, even as much of her senior staff is jumping ship.",
    "Whatever personal charm she has  or skills she had as a prosecutor or a senator  hasn't translated for a national audience.\"",
    "Festivus arrived early on HMS Harris with disgruntled and loyal staffers alike airing grievances on a daily basis.",
    "The report said those in the vice president's circle are fuming that she's not being \"positioned\" properly.",
    "One report, however, also noted insiders have called Harris a \"bully\" in her dealings with her staff.",
    "Former communications director Ashley Etienne departed last year to pursue \"other opportunities.\"",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "So you're constantly sort of propping up a bully and it's not really clear why.\"",
    "The exodus of talent from the staff of Vice President Kamala Harris continues.",
    "She doesn't do her homework and then blames the staff when she's unprepared.",
    "And her deputy director of public engagement, Vincent Evans, has left.",
    "They claim, predictably, that right-wing media is racist and sexist.",
    "\"The complaints cover the waterfront: Harris is no fun to work for.",
    "The commentary noted, \"Harris was a bad pick from the start.",
    "Graham is just the most recent staffer to leave Harris.",
    "She was accused of being no less than \"anti-American.\"",
    "For starters, Biden hasn't got her back.",
    " Her defenders blame everyone but her.",
    "And that ship is leaking like a sieve.",
    "And spokeswoman Symone Sanders left.",
    "And aide Gil Duran has left."
  ]
}