{
  "id": 999,
  "mediaId": 675,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "It's February: Did you abandon your New Year's Resolutions yet?",
  "image": "https://www.wnd.com/wp-content/uploads/2021/01/sparkler-fireworks-celebration-new-years-eve-pixabay.jpg",
  "link": "https://www.wnd.com/?p=4979318",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Tomczak",
  "authorUrl": "https://www.wnd.com/author/ltomczak/",
  "termIds": [
    1749,
    1749,
    2028,
    2028
  ],
  "sentences": [
    "Common reasons we fail\nBesides lack of good planning and not persevering when eventual difficulties and setbacks arise, I've found from 50 years of counseling that the other primary reasons for people abandoning resolutions are the following:\nNot taking quality time to get alone with God to seek His will and way regarding areas of change He's calling us to make.",
    "If you started 2022 with resolutions in the area of healthier eating, weight loss and getting in shape, let me prepare you that you will soon enter supermarkets and be assaulted by an avalanche of Super Bowl goodies that are not low-fat, gluten-free or helping you look like celebrities paraded on People magazine's \"Sexiest Man/Woman\" covers.",
    "One way to set yourself up to fail is to try to run a marathon if you currently struggle walking a mile; or having read a book entitled, \"God's Atomic Power Through Fasting,\" you decide you're going to launch into a 40-day fast like Jesus did.",
    "For centuries Jews have followed divine direction and affixed certain Scriptures to their doorposts and revisited them regularly to remind them of something extremely important (Deuteronomy 6:49 and 11:13-21).",
    "Inspired by an infomercial on late-night TV with Chuck Norris featured at age 80 with abs of steel may ignite a spark causing you to put down those wings smothered in ranch dressing, but will it sustain you?",
    "Starting is easy  sticking is hard\nA friend of mine who previously ran a health club confided in me that usually about 80% of people who take out memberships in January fizzle by February.",
    "A brother told me that he sensed God whisper to his heart a gentle reminder regarding his appearance: \"My son, your body is to be a temple of the Holy Spirit not a cathedral!\"",
    "Misery loves company\nStudies show that approximately 36% of people don't necessarily abandon all their New Year's resolutions within the first month but simply start failing.",
    "Getting alone with God to get His guidance is essential so you don't spontaneously make a costly investment in exercise equipment that later collects dust in your basement.",
    "Money\nCommentary\nJack Cashill\nJoseph Farah\nHanne Nabintu Herland\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nEducation\nFaith\nHealth\nDiversions\nWorld\nU.S.",
    "\"Resolve to perform what you ought; perform without fail what you resolve\" wrote wise old Ben so resolutions would remain at the forefront and not fade away.",
    "Millions make resolutions to reach goals to improve their lives, enjoy better health, find greater prosperity and success, launch into new ventures etc.",
    "I went from the meal to speak at a meeting where I was soon keeling over, needing an emergency muscle relaxant shot from medical personnel to rescue me!",
    "Reward yourself along the way, continually giving glory to God for the \"good work He began in you that He will bring to completion\" (Philippians 1:6).",
    "Knowing the road to hell is paved with good intentions, millions of us determine to upgrade our lives by making and keeping New Year's resolutions!",
    "Instead of bowing out and consoling ourselves with discouraging data, how about we dig deeper, draw on the grace of God and get back in the game?",
    "Founder Benjamin Franklin challenged people to develop a good life by writing down the key areas of virtue (patience, humility, purity, etc.)",
    "Early in my Christian life, I decided to try a seven-day fast and then I broke it abruptly with a huge buffet meal that could've killed me!",
    "Well-intentioned individuals who have similar goals but don't set resolutions fare even worse with only 4% success rate after six months!",
    "As multitudes pray for the next Great Awakening, let's start by embracing a \"personal awakening\" preparing us for the Big One to come.",
    "So we don't forget or become foggy on our resolutions, it's important to write them down, keep track of them and keep them before us.",
    "HABITS: Be more disciplined; stop smoking, biting nails, chewing lip, wasting time, speeding, procrastinating and arriving late.",
    "The Message paraphrase of the New Testament lays it on the line:\n\"You've all been to the stadium and seen the athletes race.",
    "The apostle Paul exhorted the Corinthian community, \"Exam yourselves, seeing whether you are in the faith; test yourself.",
    "The Bible has a wonderful way of bringing encouragement to us in every area of life, and this area is no exception.",
    "God instructed the prophet Habakkuk: \"Write the vision, and make it plain on tablets, that he who reads it may run.",
    "Politics\nMORE COMMENTARY\nStephen Moore\nMichelle Malkin\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "HEALTH: Eat healthy, lose weight, exercise more, get in shape, curb drinking (alcohol and sodas), reduce stress.",
    "That's why God wrote things down and calls us to repeat significant events and rehearse important Scriptures.",
    "I warn you that these are brutal realities not false promises like \"How I Lost 20 Pounds in 20 Days!\"",
    "WEALTH: Save money, invest money, earn money, tithe money, budget money and carefully spend money.",
    "So let me offer you what I pray will be helpful motivation to help you on a pathway to success.",
    "For the vision is yet for an appointed time; but it speaks of the end, and does not lie.",
    "If it delays, wait for it; it will surely come, it will not delay\" (Habakkuk 2:2-3).",
    "Forgetting \"the secret of success is not really a secret  it's called perseverance!\"",
    "where they wanted to grow and then focus for one year on developing those virtues.",
    "He stressed the importance of keeping them prominent on the pathway to progress.",
    "Making front-end mistakes (proving the maxim, \"Fail to plan  plan to fail\")\n2.",
    "Recent research brings this truth home in the area of New Year's resolutions.",
    "Here's the deal: Regarding resolutions, here's my counsel in a nutshell: 1.",
    "I don't know about you, but I am running hard for the finish line.",
    "I am giving it everything I've got\" (1 Corinthians 9:24-26).",
    "What are the top resolutions people make almost every year?",
    "Our Christian experience is a mix of amnesia and dj vu.",
    "; yet how many resolutions truly originated with God?",
    "They do it for a gold medal that tarnishes and fades.",
    "Not writing things down and keeping them before you.",
    "Having too many resolutions and/or unrealistic ones.",
    "Watch Larry's most recent \"Week in Review\" video.",
    "That's why we need fresh inspiration from God.",
    "Do you not know that Jesus Christ is in you?\"",
    "You're after one that's gold eternally.",
    "The problem is often twofold:\n1.",
    "All good athletes train hard.",
    "Everyone runs; one wins.",
    "Receive God's direction.",
    "Revisit them regularly.",
    "Reach out for a friend.",
    "Rebound when you fail.",
    "(2 Corinthians 12:5).",
    "I'm not kidding.",
    "Be realistic.",
    "Record them.",
    "Run to win.",
    "1.",
    "3.",
    "2.",
    "3.",
    "2.",
    "5.",
    "4.",
    "6.",
    "7."
  ]
}