{
  "id": 995,
  "mediaId": 8475,
  "date": "2022-02-14",
  "headline": "Arizona Rep. Schweikert agrees to $125,000 fine from FEC for campaign violations",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021422-sotu-wide.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021422_schweikert_campaign_funds/arizona-rep-schweikert-agrees-125000-fine-from-fec-campaign-violations/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Sacia",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110054",
  "termIds": [
    0
  ],
  "sentences": [
    "Norton has made an issue of the campaign finance problems for Schweikert, who presents himself as fiscally responsible, urging voters in campaign ads to fire “shady Schweikert.”\nJason Rose, a Republican political consultant in Arizona, called the second round of financial violations “compelling fodder for opponents in both the primary and the general.”\n“It’s confounding that someone who ran on fiscal responsibility and one time served as a Maricopa County Treasurer would have these types of issues,” Rose said.",
    "The Ethics Committee found in 2020, after its own three-year investigation, that Schweikert had violated House rules and committed “flagrant and egregious violations of campaign finance law.”\nAmong other charges, the committee said campaign funds were improperly paid to Chartwell Associates, of which Schwab was the only employee.",
    "“David Schweikert has proven beyond a shadow of a doubt that he can’t be trusted to follow the law, and now he is — or rather, his campaign donors are — paying the price for it,” said a statement from Monica Robinson, a spokesperson for the Democratic Congressional Campaign Committee.",
    "But in the conciliation agreement released Friday by the FEC, Schweikert’s campaign admitted to violating campaign finance law by misrepresenting the purpose of campaign payments and the recipients of those payments, some of which were converted to personal use.",
    "“So what was once his greatest strength, and that was financial acumen, is now becoming one of his biggest campaign weaknesses.”\nNoble said the $125,000 fine is another obstacle for Schweikert, who was already trailing Norton badly in campaign financing.",
    "The agreement, released Friday, comes 18 months after the House Ethics Committee fined Schweikert $50,000 for 11 counts of campaign finance violations, including the misuse of congressional office funds and filing inaccurate financial disclosures.",
    "The charges stem from the handling of campaign funds over several years by Oliver Schwab, who served as Schweikert’s campaign manager and congressional chief of staff until he resigned in 2018, during the House Ethics Committee investigation.",
    "In the agreement Schweikert acknowledges that the FEC “found reason to believe that these violations were knowing and willful, but (Schweikert) does not admit to the knowing and willful aspect of these violations.”\nLike what you're reading?",
    "The FEC investigation began in June 2018, when the Schweikert campaign brought the issue to the attention of the commission – but only after the House Ethics Committee advised him to do so as part of its probe.",
    "Rep. David Schweikert, R-Fountain Hills, has agreed to pay $125,000 to the Federal Election Commission for misuse of campaign funds, including charges that funds went to personal use of campaign staffers.",
    "The FEC allegations bring “more bad news” for Schweikert, who faces a “very serious primary challenger” in the GOP-leaning 1st District, said Mike Noble, chief pollster at OH Predictive Insights.",
    "But Noble and other analysts said it is still too early to count out Schweikert, who survived a well-funded Democratic challenge in 2020, after the House ethics violations were made public.",
    "But this year, in addition to new charges, Schweikert faces a well-funded Republican challenger, which means the GOP lean of the district cannot help as much as it did against Tipirneni.",
    "Republican challenger Elijah Norton had raised almost $2.5 million by the end of 2021, according to his latest FEC filing, and still had more than $2 million in cash on hand.",
    "Despite raising $5.4 million to Schweikert’s $2 million in that campaign, Tipirneni was not able to unseat him in the strong Republican district, losing by a 48-52 margin.",
    "It also said that money was used to reimburse staff and Schweikert for personal business and that congressional staffers were pressured to do campaign work.",
    "He’s been dancing around this stuff for years.”\nCalls to Schweikert’s offices in Washington and Phoenix were not immediately returned Friday evening.",
    "Democrats, who blasted Schweikert in 2020 after the ethics probe, were quick to jump on the latest findings by the FEC.",
    "Democratic challenger Hiral Tipirneni made the ethics complaint a focus of her 2020 campaign against Schweikert.",
    "“I would put a little caveat on that” FEC settlement, said Bob Grossfeld, a political strategist at Politicare.",
    "“So again, it gives his opponent ammunition and more areas to attack … it puts him in a tough spot.”\n- 30 -",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Schwab was also cited by the FEC and fined $7,500 for failure to maintain records.",
    "Both agreements were finalized on Jan. 11, but only released to the public Friday.",
    "Norton’s campaign is largely self-funded so far: He loaned himself $1.95 million.",
    "“So he goes from not having much money to even having less money,” Noble said.",
    "It will be a “true test for the 10-year incumbent,” he said.",
    "Like what you're reading?",
    "“This guy is slippery."
  ]
}