{
  "id": 1126,
  "mediaId": 2745,
  "date": "2022-02-18",
  "headline": "GOP lawmakers are pushing high-tech ‘fraud-proof’ ballots. A Texas company could be the only supplier.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5HN2FZTIZUI6ZE4Q5LRED5GIWE.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/18/authentix-fraud-proof-ballots-finchem-arizona/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3090,
    2765,
    2246,
    1126,
    126,
    6653
  ],
  "sentences": [
    "Authentix’s Mansfield said that cost “varies by solution and is based on many factors.”\nTony Poole, the president of the Document Security Alliance, a trade group, said the proposals would “result in over-secured and very expensive ballots that incorporate proprietary technologies that are not appropriate for a one-time use document and would unnecessarily cost localities millions of additional dollars.”\nNoting that there is no evidence that counterfeit ballots are a problem, he argued that the proposals would prevent leading companies in the document security industry other than Authentix from being able to supply ballots.",
    "“The only problem this would be solving — requiring a particular company with particular paper — is if you think that the taxpayers aren’t paying enough in taxes.”\nFinchem, who is also running for Arizona secretary of state with Trump’s endorsement, said he approached Authentix sometime after the 2020 election when he became concerned about reports of “fictitious ballots injected into the system.” He was put in touch with the company by a friend in Florida who Finchem said was familiar with the company’s work adding authenticating markers to other products, such as fuel and bank notes.",
    "He added that the company offers a “broad range of solutions” and that it is ultimately up to customers — in this case, states and localities — to decide on their preferred “level of security and subsequent resistance against counterfeiting.”\nIn Arizona, private contractors reviewing the election results in Maricopa County at the behest of the GOP-led state Senate last year pursued rumors that thousands of counterfeit ballots — potentially smuggled in from Asia — helped hand the swing state to Joe Biden.",
    "In a December presentation to a panel in Louisiana charged with making recommendations to revamp that state’s voting system, retired Army Col. Phil Waldron, who helped push false theories that the election was stolen in the weeks after the November 2020 vote, appeared to make a reference to Authentix as he pitched a plan to replace voting machines with a system that would rely entirely on hand-counted ballots.",
    "Those are among the high-tech security features that would be required to be embedded on ballots under measures proposed in at least four states by Republican lawmakers — all promoters of false claims that the 2020 election was marred by mass fraud — in an attempt to make the ballots as hard to counterfeit as passports or currency.",
    "Yet, when versions of the measure modeled on Finchem’s proposal were heard late last month by committees of the Virginia and Arizona state Senates, citizens lined up to tell lawmakers that they believed the 2020 presidential election had been rigged against Trump and that new measures were needed to prevent counterfeits.",
    "Only each state, based on their election processes, configuration and unique circumstances can describe how adding multiple security, anti-counterfeiting and traceability features to their ballots could bring advantages in terms of the administration of their elections.”\nSo far, the proposals have not advanced far.",
    "For another, the bills do not address what kind of devices would be needed to spot and authenticate the special holograms and inks they would require be embedded into ballots — a particularly pressing issue given the suspicion with which many ordinary citizens now view the vote-counting process.",
    "They also vividly illustrate how a loose network of die-hard Trump supporters is coordinating to push concerns about mass electoral fraud, including through conference calls that one participant said have included regular discussion of the nearly identically worded anti-counterfeit bills.",
    "“This has never been a problem in modern American history,” said David Becker, the executive director of the Center for Election Innovation & Research, noting that checks and balances built into the system would make it extremely difficult to pass off fake ballots as real ones.",
    "“No more complicated than that.”\nIn an email, Authentix marketing executive Kent Mansfield said Finchem was referred to the company by a person familiar with its reputation who was “formerly associated with Authentix decades ago” but has no current financial tie to the company.",
    "Mansfield said that Waldron was present at an October tour of the company organized by Finchem, but that Authentix has “no affiliation, agreement, or agency with him” and that any comments he made came “without any endorsement, guidance, or instruction” from the company.",
    "He described it as a “company in Texas” that could produce paper with “so many built-in anti-counterfeit measures.”\nAsked afterward by The Washington Post for the name of the company, Waldron said he would have to ask if the company wanted to be identified.",
    "Someone’s not going to be able to counterfeit this.’ … As soon as people saw it, they said, ‘This is a demonstrable measure that will help voters gain greater confidence in our elections.’ ”\nCurrent requirements for ballot paper differ around the country.",
    "Jeffery Magrum, a state representative in North Dakota, said he learned about the idea from Finchem when both attended a symposium on the election fraud claims hosted by Trump confidant and MyPillow chief executive Mike Lindell in South Dakota in August.",
    "But the specialized inks and watermarks also would limit the number of companies capable of selling ballot paper — potentially to just one Texas firm with no previous experience in elections that consulted with the lawmakers proposing the measures.",
    "The proposals face stiff battles before they can become law, but they demonstrate the potentially lucrative business opportunities created by suspicions that Donald Trump and his allies have spread about the security of elections.",
    "In October, Authentix hosted a tour of its corporate offices for Finchem and several other pro-Trump Republican state lawmakers and candidates for secretary of state, according to tweets posted by several attendees at the time.",
    "Even so, Finchem said that last year he asked Authentix to create a mock-up Arizona ballot containing any security measure the company could devise that would make the ballot difficult to reproduce by nefarious actors.",
    "And in Arizona, a Senate committee voted on party lines to advance the measure, but Republican state Sen. Paul Boyer, who has opposed Trump’s claims about the 2020 election, said he plans to vote against the measure.",
    "Mark Finchem, an Arizona state representative spearheading the initiative, said in an interview that he developed ideas for the proposals after discussions with executives of Authentix, a company in Addison, Tex.",
    "The contractors ultimately asserted that the paper used for ballots “made it difficult to identify any potential counterfeit ballots” — but they did not allege that they actually had turned up any fake ballots.",
    "Finchem and Chase both said they’ve been told by company officials that Authentix could sell ballots containing all the microscopic and holographic markers required by their legislation for 25 cents a ballot.",
    "He conceded that company officials “are not experts in state voting” but said their expertise in security made them well positioned to propose ideas to make ballot paper that would be difficult to replicate.",
    "She said the anti-counterfeit ballot measure has been a subject of repeated conversation on regular conference calls of an “election integrity caucus” of state lawmakers founded at the Lindell event.",
    "For one, it is not clear whether vote-tabulating machines currently in use and certified by federal regulators could read paper containing all the markers envisioned in the bills.",
    "The firm has since hosted other GOP lawmakers at its office and given presentations about the idea to legislators in two states, according to participants and social media posts.",
    "“Because counties don’t want to be in a position where we’re tabulating these things and then someone says, ‘Did you check for all 17 items?’ ”\nThere also is the issue of cost.",
    "During testimony in front of Wisconsin lawmakers in August, Mansfield said the company had been invited in Arizona to propose any new security measures it could envision.",
    "Authentix, he said, would not be able to overcharge for the special ballots because he said the company would otherwise lose the support of public officials.",
    "But no locality requires the specialized microscopic patterns, holograms and heat-sensitive inks included among the 19 specific items in Finchem’s proposal.",
    "Waldron worked closely after the election with a cybersecurity firm called Allied Security Operations Group that, like Authentix, is based in Addison, Tex.",
    "Boyer said he was concerned that the bill would hand Authentix a monopoly on ballot printing and allow the company to charge taxpayers as much as it wants.",
    "Still, Finchem said he thinks there will be a “foot race” among states to adopt the measures as a way to alleviate skepticism that elections are secure.",
    "But, he added, “it certainly does offer the opportunity for a company to engage in commerce.”\n“I’m not going to fault anyone for that,” he said.",
    "Election and document security experts said the proposals raise numerous practical problems, regardless of the company providing the technology.",
    "In response to Finchem’s inquiry, Mansfield said the company “presented various technologies” that could improve the security of ballot paper.",
    "“We are an authentication technology solutions provider that designs solutions based on the specific requirements set forth by our customer.",
    "The North Dakota legislature meets only once every other year, meaning the bill there will not be considered until next year, Magrum said.",
    "When she presented her bill to fellow lawmakers in Virginia last month, Finchem appeared by video from Phoenix to testify in support.",
    "Is it a black light?” asked Jen Marson, the executive director of the Arizona Association of Counties, which opposes the measure.",
    "In March, company executives presented the mock-up to Arizona lawmakers at an informational meeting hosted by Finchem in Phoenix.",
    "In October, Chase was part of the group that toured Authentix’s offices, according to a video she posted on Twitter at the time.",
    "Legislative staffers in Colorado estimated that the proposal there would nearly double the cost of ballots to $2.10 a piece.",
    "A committee of the Virginia Senate in January voted 9 to 6 along party lines to kill Chase’s bill for the year.",
    "Poole’s group includes 80 members representing government, academia and industry; Authentix is not a member.",
    "Chase’s bill contains language that closely matches an Authentix website advertising the company’s services.",
    "Magrum has proposed a nearly identical measure in North Dakota, using sample language provided by Finchem.",
    "Nearly invisible “stealth numbers” that can be located only using special ultraviolet or infrared lights.",
    "“It was like one of those holy cow moments,” Finchem said of the reaction to the company’s presentation.",
    "His opposition is likely to doom the proposal in Arizona, where Republicans hold a slim Senate majority.",
    "A committee of the Colorado House of Representatives declined to advance the proposal there on Monday.",
    "In Virginia, state Sen. Amanda F. Chase (R) said she, too, first learned of the idea from Finchem.",
    "There is no evidence that counterfeit or fake ballots have been a problem in American elections.",
    "Workers for a time shined UV lights at individual ballots in an attempt to spot frauds.",
    "“We are unaware of any legislation that would mandate use of our technology,” he added.",
    "“It was somebody who knew somebody,” said Finchem, who declined to name the friend.",
    "Officials with both companies said there is no connection between them.",
    "“They just said, ‘Surprise us,’ ” Mansfield told the lawmakers.",
    "Some states, including California, already require watermarks.",
    "Special ink designed to be sensitive to temperature changes.",
    "“It would be a fraud-proof ballot,” he said.",
    "He later stopped responding to questions.",
    "“What is that thing?",
    "Holographic foil.",
    "Is it a scanner?",
    "“We said: ‘Okay!"
  ]
}