{
  "id": 1226,
  "mediaId": 6656,
  "date": "2022-02-15",
  "headline": "Jan. 6 committee issues subpoenas seeking information on alternate elector plots",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/3471644969254/2022/1/9d58c49bcd442feebea4dc3cc22ce126/v1.5/Jan-6-committee-issues-subpoenas-seeking-information-on-alternate-elector-plots.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/02/15/Jan-6-committee-subpoenas-alternate-elector-plots/3471644969254/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Uria",
  "authorUrl": "https://www.upi.com/author/Daniel-Uria/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"For example, the Select Committee is in possession of communications involving you and other members of the Trump campaign reflecting a coordinated strategy to contact Republican members of state legislatures in certain states that former President Trump had lost and urge them to 'reclaim' their authority by sending an alternate slate of electors that would support former President Trump,\" the committee wrote in its letter to Brown.",
    "The committee said Arizona State Rep. Mark Finchem took part in organizing events to advance unsubstantiated claims of election and voter fraud and was in Washington, D.C., on Jan 6. as he said he \"had evidence to deliver to Vice President [Mike] Pence in an effort to postpone the awarding of electors.",
    "Cox and Republican National Committee Chairwoman Ronna McDaniel sent a letter to Michigan's Board of State Canvassers in November 2020 asking them to delay the certification of the election results for 14 days in order to conduct an audit of results from Wayne County, which includes Detroit.",
    "In its statement, the committee said Trump's campaign director, Michael A. Roman, and deputy director, Gary Michael Brown, took part in efforts to \"promote allegations of fraud in the November 2020 election and encourage state legislators to appoint false 'alternate' slates of electors.\"",
    "Feb. 15 (UPI) -- The House select committee investigating the Jan. 6 riots at the U.S. Capitol issued a new wave of subpoenas Tuesday seeking information about efforts to appoint illegitimate electors in states carried by President Joe Biden in the 2020 presidential election.",
    "Arizona Republican Party Chairwoman Kelli Ward was targeted by the committee as it said she reportedly spoke to Trump and members of his staff about \"election certification issues in Arizona and worked to transmit documents claiming to be an alternate elector from the state.",
    "Former Michigan GOP Chairwoman Laura Cox was also subpoenaed as the committee said she witnessed Trump attorney Rudy Giuliani \"pressure state lawmakers to disregard election results in Michigan and say that certifying the election results would be a 'criminal act.'\"",
    "Pennsylvania State Sen. Douglas Mastriano was subpoenaed as the committee said he was part of a plan to arrange for alternate electors from Pennsylvania and \"reportedly spoke with President Trump about post-election activities.\"",
    "\"The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,\" Chairman Rep. Bennie Thompson, D-Miss., said in a statement.",
    "\"We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans.\"",
    "The committee subpoenaed two members of former President Donald Trump's re-election campaign and three Republican officials from battleground election states.",
    "The committee had already subpoenaed the phone of Ward and her husband, prompting them to file a federal lawsuit to block the request.",
    "Both Mastriano and Finchem signed a letter to Pence on Jan. 5, 2021, asking him to delay the certification of the election results.",
    "Mastriano is currently running for governor in Pennsylvania.",
    "License Photo"
  ]
}