{
  "id": 12771,
  "mediaId": 2584,
  "date": "2022-02-28",
  "headline": "Giuliani’s legal problems deepen as ‘false electors’ scheme investigated",
  "image": "https://i.guim.co.uk/img/media/3d0aed20cc04c07c9de1f6c2382956eab280fa45/0_192_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=74f1648701c4bd83bb9b861ea6bccf58",
  "link": "https://www.theguardian.com/us-news/2022/feb/28/rudy-giuliani-legal-problems-false-electors-scheme",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Stone",
  "authorUrl": "https://www.theguardian.com/profile/peter-stone",
  "termIds": [
    4905,
    3037,
    2765,
    2445,
    4169,
    4539,
    2246,
    1433,
    5949,
    6175,
    6386
  ],
  "sentences": [
    "In a conspiracy, which DOJ could charge as to the fake electors, a conviction doesn’t require that he solicited, or even knew about the forgeries, but only that he participated in a conspiratorial plot involving fake electors to help overturn the election.”\nThe drive to assemble illegitimate electors occurred in December 2020 and was conducted state by state with the involvement of some Trump campaign officials and supporters, and reportedly spearheaded by Giuliani.",
    "“If Rudy provides significant cooperation (which is unlikely) he could help the panel unravel some of the major ways that Trump tried to thwart Biden’s election victory including, most significantly, whether there was any coordination or pre-planning between Trump and those who stormed the US Capitol.”\nStill, other ex-prosecutors say the fake electors scheme offers a rich target for investigators to unravel that could spell significant trouble for Giuliani.",
    "Ex-prosecutors say possible charges could include falsifying voting documents and even conspiracy to defraud the US\nLegal pressures are mounting for Donald Trump’s ex-lawyer Rudy Giuliani as the US justice department and the House panel investigating the January 6 assault on Congress are both investigating a “false electors” scheme which Giuliani reportedly helped lead to overturn Joe Biden’s 2020 election.",
    "Congressman Adam Kinzinger, one of two Republican members on the House panel, in February told CBS’ Face the Nation that “we fully expect that, in accordance with the law, we’ll hear from Rudy.”\nGiuliani’s lawyer Robert Costello told the Guardian that talks with the panel are ongoing, but would not offer any details, and scoffed at the justice department investigation into the fake elector certificates.",
    "“For Giuliani and his crew to have legal trouble, you don’t have to get much more into the facts than to understand that he was orchestrating fake slates of electors, based on fake reports of fraud, using faked documents, to fake the outcome of the election, and then submitting those fake documents to government officials,” said Michael Moore, a former US attorney in Georgia.",
    "“The four individuals we’ve subpoenaed today advanced unsupported theories about election fraud, pushed efforts to overturn the election results, or were in direct contact with the former President about attempts to stop the counting of electoral votes,” Democratic representative Bennie Thompson of Mississippi, who chairs the committee, said in a January statement.",
    "“If prosecutors determine that Giuliani improperly influenced or attempted to improperly influence the election, potentially, he could be charged with state and federal crimes including: falsifying voting documents, fraud, false statements, mail/wire fraud or even conspiracy to defraud the United States,” former federal prosecutor Michael Zeldin told the Guardian.",
    "As the investigations focus more closely on the people Giuliani recruited to change the election results on January 6 and before, his criminal exposure grows as the number of witnesses against him multiplies.”\nOther former prosecutors agree that Giuliani may be in serious legal jeopardy as the justice department proceeds with its fake electors inquiry.",
    "Michigan attorney general Nessel told Rachel Maddow of MSNBC that under state law “you have a forgery of a public record, which is a 14-year offense, and election law forgery, which is a five-year offense.” She alleged a “coordinated effort” by Republican parties in several states which prompted her request to DOJ to open a federal inquiry.",
    "Some state legislators who had contacts with Giuliani as part of the scam have been subpoenaed by the panel, such as Mark Finchem in Arizona and Doug Mastriano in Pennsylvania, who are, respectively, running in 2022 to be secretary of state and governor in moves that raise fears of future attempts to subvert American democracy.",
    "Michigan’s Democratic attorney general, Dana Nessel, who spent almost a year investigating 16 Republicans who submitted false certificates alleging they were the state’s presidential electors – notwithstanding Biden’s victory margin of 154,000 votes – asked federal prosecutors in January to start a criminal inquiry.",
    "Former prosecutors say the justice department inquiry announced last month could pose a serious legal threat to Giuliani, given his role in helping orchestrate an electoral ploy in seven states that Biden won, involving replacing slates of legitimate Democratic electors with bogus Trump slates.",
    "Giuliani, who was subpoenaed by the House panel in January and is in negotiations about providing some testimony and documents, is one of more than a dozen Trump loyalists the committee has subpoenaed who reportedly were central figures in the stealth electors’ plan to nullify Biden’s election.",
    "The false-electors gambit, which the watchdog group American Oversight helped reveal, has been under scrutiny since last year by state attorneys general in Michigan and New Mexico who have looked into the role of the Trump campaign and laws that may have been broken.",
    "The false-electors scheme is under growing scrutiny by federal and state investigators as one of the avenues Trump, Giuliani and other allies deployed in their aggressive drive to subvert the election result based on debunked charges of widespread voter fraud.",
    "The fake electors stratagem was a part of Trump’s discredited and fruitless effort to persuade vice-president Mike Pence to toss out Biden’s electors and substitute bogus Republican electors when Congress met on January 6 to tally up the electoral votes.",
    "But the new DOJ inquiry into the fake electors strategy could pose more serious legal threats to Giuliani, say ex-prosecutors, since he served as Trump’s right hand man and was involved with multiple schemes to overturn the election results.",
    "Separately, a Georgia special grand jury inquiry into Trump’s high pressure call on 2 January 2021 to secretary of state Brad Raffensperger asking him to just “find’ 11,780 votes to reverse Biden’s win, could ensnare Giuliani.",
    "“The submission of the pro-Trump fake elector certificates to the National Archives was about as smart as taking the note that you used to rob the bank to the frame shop.”\nThis article was amended on 28 February 2022.",
    "Last month the committee subpoenaed Giuliani and three other Trump allies he worked closely with on multiple fronts to overturn the election results by promoting baseless charges of widespread voter fraud.",
    "The phoney pro-Trump electoral certificates involved dozens of Trump loyalists in states such as Arizona, Georgia and Michigan and were sent to Congress in a brazen effort to thwart Biden’s certification.",
    "“Giuliani was the cog of Trump’s flywheel to overturn the election, getting other Trump allies to act and leaving his imprint for investigators to find,” said former federal prosecutor Dennis Aftergut.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "The call between Donald Trump and Brad Raffensperger that is being investigated by a Georgia special grand jury took place on 2 January 2021, not 2020 as an earlier version said.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "The Fulton county district attorney who launched the inquiry has indicated it is looking into false claims that Giuliani made before a Georgia state senate committee.",
    "Giuliani was hit last year with a $1.3bn defamation lawsuit from Dominion Voting Systems over bogus and conspiratorial claims that Dominion helped rig the election.",
    "For Giuliani, the latest legal threats come on top of several others that he faces due to his relentless and widely debunked efforts to help Trump win reelection.",
    "“Giuliani’s information about various schemes that Trump promoted to block Biden’s win could potentially be very helpful to the House inquiry,” Zeldin noted.",
    "Facing a subpoena and the prospect of a criminal referral to DOJ from the House panel if he doesn’t cooperate, Giuliani could wind up as a crucial witness.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "Former justice officials say that Giuliani now has several legal problems to worry about as federal and state inquiries expand.",
    "“The threats to Giuliani come from multiple directions,” said Michael Bromwich, a former justice department inspector general.",
    "“Evidence is growing that he was at the center of a series of schemes to change the election results – by fraud and by force.",
    "Dominion told a court in January there was “no realistic possibility” that it could reach a settlement with Giuliani.",
    "Subsequently, deputy attorney general Lisa Monaco announced an inquiry into “fraudulent elector certifications”.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "That’s dangerous for Giuliani, because forgeries disprove innocent intent.",
    "“That is a conspiracy that a kindergartener could unravel,” Moore added.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "“Obviously this is part of a much bigger conspiracy,” Nessel said.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "The House January 6 panel seems to share those views.",
    "If there were ever a time to join us, it is now.",
    "“He’s reportedly key in the bogus slate scheme.",
    "… we have a small favour to ask.",
    "Thank you.",
    "?"
  ]
}