{
  "id": 13423,
  "mediaId": 8475,
  "date": "2022-03-17",
  "headline": "Arizona bill would make bad Yelp and Google reviews a possible criminal act",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031722_yelp_review.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/031722_social_media_reviews_bill/arizona-bill-would-make-bad-yelp-and-google-reviews-possible-criminal-act/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\n“The fact of the matter is that teeth currently exist in the statute but it isn’t being used for whatever reason,” Rep. Melody Hernandez, D-Tempe said, adding that she was concerned that changing the law would sweep in people who were not bad actors.",
    "“I want a free X or I will leave a bad review,” Emmert said, “that by definition is theft by extortion.”\nEmmert claimed that “every retailer” has faced this issue in “some form or another” and admitted that existing state law against extortion likely covers the issue, but they are asking lawmakers to specifically add social media in order to help businesses that are being targeted.",
    "Finchem told the committee that his “six-figure” real estate business was destroyed three years ago by people leaving negative reviews on Angie’s List and Home Advisor calling him a “bigot.”\n“Using social media in an anti-social way, the fact that this happens makes my blood boil,” Finchem, who has attempted to silence his critics, said.",
    "“A one-star Google review can be extremely disastrous to us.”\nNewton said during her testimony that guests will leave the store and say a product is not to their liking and request additional items as a consolation, often threatening a bad review if they don’t get their demands met, Newton said.",
    "Local\nA bill brought to the legislature by business leaders would add social media messages to the state’s extortion law and could make it so those who leave bad reviews could be subject to a class 2 felony, the typical minimum sentence for which is 3 years in prison.",
    "“I feel like what we’ve learned is that we already have laws on the books,” Pawlik said, advising the Chamber of Commerce Alliance that possibly creating training for businesses to learn their rights is a better process.",
    "Eric Emmert of the East Valley Chamber of Commerce Alliance said that Senate Bill 1001 by Sen. Vince Leach, R-SaddleBrooke, would prevent people who extort businesses by leaving bad reviews.",
    "“Having some considerable personal experience with this, I’m not going to go as far as saying there should be no limit on punishment,” Rep. Mark Finchem, R-Oro Valley, said.",
    "She also said she has never tried to use the state’s existing extortion laws to pursue legal action against anyone that has attempted to do this at her store.",
    "One such business that came and spoke was Nothing Bundt Cakes, owned by Jan Newton, who also sits on the board of directors for the Mesa Chamber of Commerce.",
    "“I know I’m not the only person who this has happened to.”\nThe bill passed along party lines and will head next for a full vote by the House.",
    "Newton admitted that she has not seen a loss in revenue from this issue and that it happens only once every month to six months.",
    "“There are just a lot of unanswered questions.”\nHer colleague, Rep. Jennifer Pawlik, D-Chandler, echoed those sentiments.",
    "“Online reviews are very important to us,” Newton said before the House Judiciary committee Wednesday morning.",
    "The bill is supported by several different Chamber of Commerce groups.",
    "- 30 -"
  ]
}