{
  "id": 1419,
  "mediaId": 2741,
  "date": "2022-02-17",
  "headline": "Trump Continues Long Tradition of Endorsing the Worst Candidates Imaginable",
  "image": "https://media.vanityfair.com/photos/620eacebed59d0a499abfc31/16:9/w_1280,c_limit/963609516",
  "link": "https://www.vanityfair.com/news/2022/02/donald-trump-republican-endorsements-mark-finchem",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    0
  ],
  "sentences": [
    "As his profile grew from state lawmaker to statewide candidate, Finchem perhaps became best known for peddling lies about the 2020 election.… Finchem has also peddled the QAnon conspiracy theory, writing in one deleted 2019 tweet that Congress was implicated in child abuse, and was a member of the Oath Keepers back in 2014, though it’s unclear if he still affiliated with the group.",
    "And while you might think that demonstrating one is mildly to majorly off-kilter is the most important thing to do to secure that backing, it actually comes second to simply being willing to help Trump get revenge on the politicians who’ve had the temerity to note he was responsible for the January 6 insurrection, an offense he won’t be getting over any time soon.",
    "A CNN KFile review of Finchem’s social media postings on platforms popular with the extreme right wing found that he repeatedly promoted anti-vaccine rhetoric and other false claims about possible COVID-19 treatments, the efficacy of mask-wearing, and the severity of the virus.… CNN reached out multiple times to Finchem for comment but did not receive a response.",
    "Mark Finchem, the Arizona secretary of state candidate backed by former president Donald Trump, spread dangerous misinformation about the COVID-19 pandemic on social media, calling the vaccine a “crime against humanity,” implying it was a “bio-weapon,” and sharing an article last August that suggested COVID-19 did not exist in the Canadian province of Alberta.",
    "While Trump never officially endorsed Marjorie Taylor “Jewish Laser Beams/QAnon/Gazpacho Police” Greene, he was absolutely thrilled about her ascension within the party, tweeting after her 2020 primary win, “Congratulations to future Republican Star Marjorie Taylor Greene on a big Congressional primary win in Georgia against a very tough and smart opponent.",
    "Say what you will about Donald Trump, but the man has a sixth sense for identifying truly awful people, like a Doppler radar for individuals who fall under the umbrella of “the absolute worst.” Yet whereas another public figure might use this power for good, after Trump finds or is introduced to said awful people, he likes to endorse them for office.",
    "In July 2021, for example, Finchem shared a story that claimed, “the life expectancy of all who have taken the [vaccine] is only two years.” A month later, he wrote, of the vaccine Trump is constantly telling people he should be getting credit for, “It ain’t a vaccine!!!",
    "Marjorie is strong on everything and never gives up—a real WINNER!” And if you perhaps thought his year out of the White House had cooled the ex-president’s appetite for backing terrible candidates for office, we have some unfortunate news to share.",
    "In related news, last week the ex-president surpassed his 100th endorsement since leaving office, having backed candidates running in 43 House elections, 13 Senate races, and 14 gubernatorial contests, among others, per Insider.",
    "A brief, in no way comprehensive list of candidates Trump has backed since 2016 include Roy “Meet Me at the Mall” Moore; Lauren “Screw Cancer Patients” Boebert; and Mary “Here’s What Hitler Got Right” Miller.",
    "Call it what it is, a crime against humanity.” Elsewhere, Finchem dubbed mask-wearing “crap psudeosciene” and isolating a “disaster.”\nAnd he hasn’t restricted his conspiracy-theory-spreading to COVID-19.",
    "Finchem was one of six people who recently received a subpoena from the January 6 committee, the panel announced Wednesday.",
    "Yeah, someone should really look into that\nElsewhere!"
  ]
}