{
  "id": 1577,
  "mediaId": 2584,
  "date": "2022-02-15",
  "headline": "Capitol attack investigators target Trump circle over fake elector ploy",
  "image": "https://i.guim.co.uk/img/media/c9f5e33c26c9f08a6855d127910e6f0d4e30aa46/0_117_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e435859c0881828bc13923f13776f085",
  "link": "https://www.theguardian.com/us-news/2022/feb/15/capitol-attack-january-6-subpoenas-fake-electors",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hugo Lowell",
  "authorUrl": "https://www.theguardian.com/profile/hugo-lowell",
  "termIds": [
    0
  ],
  "sentences": [
    "Ward signed a fake election certificate, Cox was a witness to the Trump attorney Rudy Giuliani pressuring states to disregard Biden’s win in Michigan, Mastriano had knowledge of the fake electors scheme, and Finchem communicated with organizers of the Save America rally on 6 January, Thompson said.",
    "Congressman Bennie Thompson, the chairman of the select committee, suggested in a statement that the subpoenas aimed to compel cooperation from the key actors about whether the Trump White House oversaw the effort to have so-called alternate electors participate in the scheme.",
    "The second set of subpoenas to people involved in the scheme comes weeks after the deputy attorney general, Lisa Monaco, confirmed that the justice department had opened its own investigation into the matter, raising the stakes for the fake electors and the Trump White House.",
    "The House select committee investigating the Capitol attack issued subpoenas on Tuesday to top Trump campaign and Republican officials involved in the scheme to send false electors for Donald Trump in states won by Joe Biden, as it examines the coordination behind the effort.",
    "Trump’s plan to return himself to office rested on two elements: the existence, or possible existence, of alternate slates, that then-vice president Mike Pence could use to declare that “dueling slates” meant he was unable to certify those states in favor of Biden.",
    "The select committee also targeted four state Republican allies of Trump: the chair of the Arizona Republican party Kelli Ward, former Michigan Republican party chair Laura Cox, Pennsylvania state senator Douglas Mastriano, and Arizona house member Mark Finchem.",
    "The effort to subvert the results of the 2020 election at the joint session of Congress on 6 January fell apart after Pence refused to abuse his ceremonial role to certify the results, and it was clear the “alternate slates” were not legitimate certificates.",
    "In separate subpoena letters, Thompson said the panel had communications showing the pair coordinated a pressure campaign urging Republican members of state legislatures to send Trump slates, and oversaw Trump campaign staffers involved in the effort.",
    "The panel sent subpoenas to six individuals who were involved in a brazen attempt to meet and submit fake electoral college certificates that formed the backbone of a Trump-connected scheme to have Congress return the former president to office.",
    "The select committee subpoenaed two senior Trump campaign officials: Michael Roman and Gary Michael Brown, who served, respectively, as the director and deputy director for election day operations for the Trump 2020 re-election campaign.",
    "Both Trump campaign officials – Roman and Brown – participated in efforts to promote allegations of fraud in the November 2020 election and encourage state legislators to appoint false “alternate” slates of electors, Thompson said.",
    "“We’re seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,” Thompson said.",
    "The panel is seeking to examine whether the effort was coordinated by the Trump White House and whether it amounted to a crime, according to a source close to the investigation.",
    "The subpoenas compel the production of documents and testimony through March."
  ]
}