{
  "id": 1873,
  "mediaId": 2520,
  "date": "2022-02-10",
  "headline": "Want to quit APS? Legislators are backing a plan to make sure that can never happen",
  "image": "https://www.gannett-cdn.com/-mm-/404490515a407db5ff9de1eb943719342806fdaa/c=0-69-5184-2985/local/-/media/Phoenix/2015/04/19/B9317025787Z.1_20150419004547_000_G4VAHNAFJ.1-0.jpg?width=3200&height=1800&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/10/arizona-utilities-team-up-legislators-block-competition/6740768001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    1971,
    2855,
    1390,
    87,
    102,
    1051,
    565,
    5949,
    6653
  ],
  "sentences": [
    "Democratic Reps. Morgan Abraham of Tucson, Richard Andrade of Phoenix, Jasmine Blackwater-Nygun of Red Mesa, César Chávez of Phoenix, Andrea Dalessandro of Sahuarita, Diego Espinoza of Tolleson, Brian Fernandez of Yuma, Alma Hernandez of Tucson, Daniel Hernandez of Tucson, Chris Mathis of Tucson, Robert Meza of Phoenix, Marcelino Quiñonez of Phoenix, Lorenzo Sierra of Avondale, Myron Tsosie of Chinle\nSupport local journalism: Subscribe to azcentral.com today.",
    "Frank Carroll of Sun City West, Regina Cobb of Kingman, David Cook of Globe, Lupe Diaz of Benson, Tim Dunn of Yuma, John Fillmore of Apache Junction, Joel John of Yuma, Steve Kaiser of Phoenix, John Kavanagh of Fountain Hills, Teresa Martinez of Casa Grande, Quang Nguyen of Prescott, Joanne Osborne of Goodyear, Jennifer Pawlik of Chandler, Kevin Payne of Peoria, Ben Toma of Peoria, Michelle Udall of Mesa, Jeff Weninger of Chandler Justin Wilmeth of Phoenix.",
    "“Approval of this application is in the public interest,” the company wrote in its application, “because it will result in more options for customers and expand the availability of renewable energy in Arizona.”\nI picture the executives over at APS's parent company, Pinnacle West Capital Corp., fainting in a dead heap right there on their marble boardroom floor.",
    "During the recent hearing on the bill, a spokesman for Green Mountain brushed aside the utilities’ dire warnings of doom and gloom, saying its prices would be competitive and its customers still would have to pay for upkeep of the grid as well as a fee to the “native utillity” to serve as a backup provider.",
    "That’s because the law our leaders seek to repeal – the one mandating competitive markets – was recently cited by Ninth Circuit Court of Appeals when it ruled that Salt River Project risks antitrust trouble if it jacks up rates to price competing services (read: rooftop solar) out of the market.",
    "It's never bad to let APS know we have choice\nBut, as The Arizona Republic’s Robert Robb pointed out, California’s competitive setup contained flaws that don’t exist in Arizona and Arizona law requires the Corporation Commission to set rates within a range, preventing a Texas-style price spike.",
    "In fact, the law flatly says, “a competitive market shall exist.”\nIt just never materialized, thanks to a court decision challenging the rules to implement that law and a powerful utility lobby that would just as soon not have anyone intrude on its turf, thankyouverymuch.",
    "“Reliability is being used in this bill as a fig leaf by people who simply want to close off choice to their customers and retain a monopoly,” said Travis Kavulla, vice president of Regulatory Affair of NRG Energy Inc., the parent company of Green Mountain.",
    "“Reliability and affordability is really at the top of my concern,” House Natural Resources, Energy and Water Committee Chairwoman Gail Griffin, the sponsor of this drive to end competition before it can begin, said during a recent hearing on her bill.",
    "Without repeal, utilities warn us we may be subject to the woes of California when it had rolling blackouts two decades ago or the misery of Texas, where millions lost power during a deadly freeze last February and prices went soaring.",
    "In August, a Texas company applied to the Arizona Corporation Commission for permission to compete with Arizona Public Service and Tucson Electric Power, giving us captive customers a choice in who provides our electricity.",
    "Here are the legislators who voted for to HB 2101:\nRepublican Reps. Gail Griffin of Hereford, Rusty Bowers of Mesa, Brenda Barton of Payson, Leo Biasiucci of Lake Havasu City, Walter Blackman of Snowflake.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Fast forward to August, when Texas-based Green Mountain Energy applied to the commission to begin selling what they say will be100% renewable energy plans to APS and Tucson Electric customers.",
    "Back when phones were bolted to walls and had these strange curly wires attached to them, when you talked fast when calling long distance because of the resulting exodus from your wallet.",
    "Law says we 'shall' have competition\nFor two decades, Arizona has had laws in place to allow for competition in who provides the electricity that powers our homes and businesses.",
    "The bill (and its companion, Senate Bill 1631) would not only block Green Mountain from operating in Arizona but would threaten the rooftop solar industry as well.",
    "The company already operates in seven states, with licenses in four others, and estimates it’ll have 20,000 Arizona customers within five years.",
    "Utilities and their champions at the Legislature insist their monopoly status protects consumers, keeps rates low and electricity flowing.",
    "There was an attempt by the Arizona Corporation Commission to revisit deregulation in 2013 but it was abruptly shelved when APS frowned.",
    "It was defeated a few weeks ago on the House floor but after a little muscle was applied, was brought back this week and passed 37-21.",
    "Bill could end competition as we know it\nEnter House Bill 2101, which has the bipartisan support of a whopping 36 legislators.",
    "This, by repealing a state law that allows other electricity providers to give the big guys a run for their money.",
    "It is a necessary step, the monopoly utilities assure us, to ensure that service remains reliable and affordable.",
    "And so, as night follows day, the Arizona Legislature is now charging forth with a plan to block the competition.",
    "He says his study of price data from the Energy Information Administration suggests it would drive down rates.",
    "Opinion: Arizona's monopoly utilities don't want you ever to have a choice in where you get your electricity.",
    "Count Corporation Commissioner and free-market fan Justin Olson among those who support competition.",
    "It is never a bad thing for APS and other utilities to know that we have a choice.",
    "And the Arizona Legislature is working on a plan to make sure they get their wish.",
    "Funny, I’m pretty sure Ma Bell said the same thing a half century ago.",
    "The fact that the Legislature doesn’t see that is stunning.",
    "Data is mixed on that but one thing seems clear.",
    "Take away the law and well, you get the picture.",
    "The state’s monopoly utilities were not amused.",
    "Somebody should pull the plug on this bad plan.",
    "Who supports this bill?"
  ]
}