{
  "id": 1946,
  "mediaId": 2662,
  "date": "2022-02-08",
  "headline": "HUGE: Maricopa County – Investigation Finds Additional 740,000 Ballots Have No Documented Chain Of Custody",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/75F2707A-4F78-4523-A399-D8E43E7BD173.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/huge-maricopa-county-investigation-finds-additional-740000-ballots-no-documented-chain-custody/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3342,
    4267,
    1394,
    613,
    442,
    5949,
    6360
  ],
  "sentences": [
    "The SoS says the form must include four specific times that are important in documenting chain of custody:\nTime of arrival at the drop-off location or drop-box\nTime of departure from the drop-off location or drop box\nTime of arrival at the receiving site\nTime of inspection by the recorder or officer in charge of elections.The Maricopa County EVBTS form includes only one time - the time the seals are placed on the ballot box.Please see sample images of EVBTS forms used for ballot chain of custody in the 2020 General Election in Exhibit A.\nExhibit A\nElections Procedures Manual Requirement: “When the secure ballot container is opened by the County Recorder or officer in charge of elections (or designee), the number of ballots inside the container shall be counted and noted on the retrieval form.” Without this count, there is no way to determine if the transport staff retrieved one ballot or one thousand ballots.",
    "The violations identified are important because failure to maintain chain of custody and properly document ballot retrieval and transport makes it impossible to verify the origin of the ballots counted in an election.Arizona Law outlines specific requirements for secure ballot retrieval and chain of custody procedures for the transfer of voted ballots from drop boxes and vote centers.",
    "Maricopa County Chain of Custody Failure\n740,000 Ballots Have No Documented Chain of Custody\nVerity Vote has conducted an investigation of Maricopa County’s ballot chain of custody for the 2020 General Election.County records used to document retrieval of early voting ballots from vote centers and drop box locations reveal numerous violations of Arizona election law.",
    "Elections Procedures Manual Requirement: “For any election that includes a partisan race, at least two designated ballot retrievers of at least two differing party preferences shall be assigned to retrieve voted ballots from a ballot drop- off location or drop-box.”\n48 out of 1895 unique EVBTS had either one retriever signature or no signatures.",
    "View the full report here:\nMaricopa-Chain-of-Custody-Failure\nWith confirmation of receipt from the AZ Attorney General\nReceipt from the Attorney General’s Office\nArizona State Representative Mark Finchem told TGP that he was working on a resolution to reclaim Arizona’s fraudulent 2020 Presidential Electors, and he delivered.",
    "“Chain of custody documents provide evidence that can be used to authenticate election results, corroborate post-election tabulation audits, and demonstrate that election outcomes can be trusted.” The Arizona legislature understood the need for ballot chain of custody and included that requirement in Title 16.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nAs The Gateway Pundit reported, auditors have been chosen to analyze the routers and Splunk logs used in the 2020 election, and they are working to answer the Senate’s questions.",
    "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released\nThe “Maricopa County Chain of Custody Failure” report details Verity Vote’s investigation into 740,000 illegal ballots.",
    "Thedocuments include a record of the location, seal numbers removed from the drop box, new seal numbers placed on the drop box, date and time the seal was replaced, as well as signatures of the location staff and two transport staff members.",
    "80 PERCENT of Early Voting Ballot Transport Statements have defects that violate Arizona statutes pic.twitter.com/esj6yS0BTJ\n— Liz Harrington (@realLizUSA) February 7, 2022\nContact Attorney General Mark Brnovich to demand perp walks!",
    "As part of the requirement to develop and implement secure ballot retrieval and chain of custody procedures, the County Recorder must prescribe a retrieval form that meets the minimum standards established by the Secretary of State.",
    "According to the U.S. Election Assistance Commission, “keeping a proper chain of custody is more than a best practice - it is essential to encouraging trust in our democracy.” EAC advocates for thorough, detailed chain of custody.",
    "The EPM clearly says that when the secure ballot container is opened by the County Recorder or officer in charge elections (or designee), the number of ballots inside the container shall be counted and noted on the retrieval form.",
    "An officer of an election who knowingly fails or refuses to perform any duty required of him under this chapter is guilty of a class 2 misdemeanor unless another classification is specifically prescribed in this chapter (A.R.S.",
    "The Maricopa Elections departments said, “Our role as election administrators is guided by statute and our team follows those laws and procedures…”- but the critical laws regarding chain of custody were broken.",
    "Some of the most significant violations include documents with failure to record the number of ballots retrieved and documents that reveal a failure to assign two couriers for each ballot retrieval.",
    "The AZ Secretary of State, Governor, and the Attorney General agreed on the requirements for voted ballots deposited in Early Voting locations in the 2019 Elections Procedures Manual (EPM).",
    "Verity Vote representatives submitted several Public Records Requests for all ballot box retrieval and chain of custody forms utilized in Maricopa County during the 2020 General Election.",
    "Even if Maricopa had kept all of their promises for ballot security, the EVBTS forms fall short of the chain of custody requirements outlined in the 2019 Elections Procedures Manual.",
    "Arizona laws designates each violation as a class 2 misdemeanor: a person who violates any rule adopted pursuant to this section (EPM) is guilty of a class 2 misdemeanor (A.R.S.",
    "Maricopa County failed to record the number of ballots on 1,514 out of 1,895 unique chain of custody documents and failed to record signatures on 48 of these documents.",
    "In the cases where a single courier is recorded as retrieving ballots, the Recorder’s office was responsible for scheduling a two-person team for ballot retrieval.",
    "The Arizona Senate’s full forensic audit report has been delivered to the Arizona Attorney General, and we are awaiting the results of his criminal investigation.",
    "Notably, the most egregious violations were in MCTECs failure to count the ballots and record the number of ballots retrieved from each ballot drop box location.",
    "The Maricopa BeBallotReady website promises ballot security and proper chain of custody:\nCitizens play a vital role in the operation of county elections.",
    "Maricopa County officials report that EVBTS forms are completed by ballot couriers at least once every day that a vote center or drop box is open.",
    "The failure to maintain proper chain of custody was not limited to a single courier or team of ballot couriers who did not follow the law.",
    "The EPM identifies the County Recorder as the party responsible for implementing procedures to ensure proper chain of custody of ballots.",
    "Liz Harrington noted this finding in State Representative Mark Finchem’s resolution to decertify Arizona’s fraudulent 2020 election.",
    "The recorder is responsible for chain of custody of all ballots and the violations occurred across all vote centers and drop boxes.",
    "Verity Vote’s investigation found that Maricopa County lacks chain of custody documents for at least 740,000 of those EV ballots.",
    "In AZ law, the responsibility for the security of ballots is delegated to the County Recorder or officer in charge of elections.",
    "Early Voting Ballot Transport Statements (EVBTS) are required every time ballots are retrieved from a vote center or drop box.",
    "Of the 1895 unique EVBTSs turned over to Verity Vote, more than 80% of the documents have defects that violate Arizona law.",
    "Maricopa County officials violated Arizona law and do not have the required chain of custody for at least 740,000 ballots.",
    "The evidence shows that the Recorder failed in his duty to ensure the security of the ballots for Maricopa County voters.",
    "740,000 ballots were accepted and counted without the proper chain of custody documentation in violation of Arizona Law.",
    "There is no way of knowing how many ballots these invalid documents accounted for or inserted into the system.",
    "A new report from Verity Vote provides massive evidence of law violations in Maricopa County’s 2020 election.",
    "Maricopa County reported that 923,000 EV ballots were accepted at vote centers or drop box locations.",
    "This specific requirement of Arizona law was disregarded by the Maricopa County Recorder’s Office.",
    "These violations of the law are so egregious and so widespread that they demand accountability.",
    "The law also requires the county to record the number of ballots retrieved from each location.",
    "The law requires that two couriers from different political parties transfer the EV ballots.",
    "Today, we reported that Finchem dropped his resolution to decertify three counties.",
    "No criticism is being leveled at the citizens who participated.",
    "The citizens are trained by the county election officials.",
    "1514 out of 1895 unique EVBTS forms have no ballot counts.",
    "Recent Posts\nContact",
    "Title 16-184).",
    "Title16-452)."
  ]
}