{
  "id": 2053,
  "mediaId": 8475,
  "date": "2022-02-10",
  "headline": "Arizona Republicans kill off bill requiring all devices to have porn filters",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021022_online-porn-condom.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021022_gop_porn_filter_bill/arizona-republicans-kill-off-bill-requiring-all-devices-have-porn-filters/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "Dylan Hoffman, an executive for the tech policy group TechNet, said that the requirements of the bill are not “feasible or possible.”\n“The marketplace is trying to correct for this already,” Hoffman noted, as many phones come with parental controls already installed and there are many third-party applications parents can use to add more robust controls.",
    "Finchem also directly addressed the “tech industry,” saying that they need to work on something, adding “don’t make us do this.”\nRep. Jacqueline Parker, R-Mesa, said she was concerned about the government overreach of the bill but also worried about what she felt is “censorship” by “Big Tech.”\n“Right now, their software is filtering porn.",
    "“We have more protection for our kids against White Out then we do against pornography,” Udall, a Mesa Republican, told the committee, recalling a story of how a store clerk checked the age of her child when buying the popular writing correction fluid that has been abused as an inhalent for decades.",
    "An anti-LGBT and anti-porn activist known for his wild stunts appears to be the source of the bill, which shares almost identical language to the “Save Our Children Act.” Chris Sevier has drafted model anti-pornography legislation around the country, including in Arizona.",
    "The organization has gone after pornography, and earned notoriety decades ago for filing complaints against the Federal Communications Commission for George Carlin’s famous “7 words” radio show and trying to prevent Playboy magazines from being sold on military bases.",
    "Local\nA Republican bill that would have held companies criminally liable for selling any computer, smartphone or tablet in Arizona without a filter to block children from accessing “harmful content” was rejected by a legislative committee Wednesday morning.",
    "In 2019, a GOP lawmaker put forward one of Sevier’s bills that would have charged Arizona residents $20 to access pornographic material and used the money to fund construction of a border wall along the state’s southern border with Mexico.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nSome of Carter’s fellow Republican colleagues did not entirely agree with him.",
    "“I think it is a matter of parental choice.”\nOne faith-based group, with ties to a wave of bills that swept the nation declaring porn a public health crisis, praised the bill and said it would help prevent exploitation of children.",
    "“Instead of government mandates, we should have stakeholders come together to figure out how to best figure out how to use these tools to protect children,” Lisa McCabe of the Cellular Telecommunications Industry Association said.",
    "This year’s bill, from Rep. Michelle Udall, is similar in how it seeks to limit computer access to “material that is harmful to minors” on any device that can access mobile networks, wired networks or the internet.",
    "It also gives parents the right to sue the manufacturer if their child accesses “harmful material,” and anyone who removes a filter would face a class 6 felony and a $50,000 fine.",
    "An amendment added to ensure that such lawsuits could only be filed against adults, and not other children, was added but failed to convince lawmakers to support the proposal.",
    "“It is absolute the providence of this state to regulate pornography.”\nThe U.S. Supreme Court has repeatedly said that pornography is protected by the First Amendment.",
    "The legislation, seemingly the brainchild of an anti-LGBTQ activist, also would have allowed parents to sue anyone who helps their child bypass the internet filter.",
    "“This is in no way condoning this at all, but the thing that concerns me is, shouldn’t this be the parent’s responsibility?” said Rep. Mark Finchem, R-Oro Valley.",
    "Judiciary Committee Chairman Walt Blackman, a Republican from Snowflake, said the bill didn’t infringe on free speech and merely aided parental control.",
    "It first ruled in 1966 that a state effort to have a sexually explicit book declared obscene and therefore banned under state law was unconstitutional.",
    "GOP lawmakers opposed to it cited their belief that the bill was government overreach, despite their concerns about pornography and the tech industry.",
    "“Pornography is not protected speech, and once upon a time the United States used to prosecute pornography,” Rep. Neal Carter, R-Queen Creek, said.",
    "“That is a personal decision you are making with the flick of your thumb, and government has nothing to do with that.”\n- 30 -",
    "The National Center On Sexual Exploitation, which was previously named Morality in Media, supported the bill in committee.",
    "Sevier gained notoriety for a piece of legislation he drafted that used the name of kidnapping victim Elizabeth Smart.",
    "A number of members of the tech industry spoke in opposition of the measure at Wednesday’s committee meeting.",
    "Smart’s lawyers eventually sent Sevier a cease and desist after the bill had been filed in 18 states.",
    "Companies that don’t comply also can face criminal liability under the bill’s language.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "All three votes in favor were from Republicans, who were split on the measure.",
    "Tomorrow, it could be filtering conservative material,” Parker said.",
    "“The government isn’t filtering you from anything,” Blackman said.",
    "The bill, House Bill 2115, died on a 3-7 vote.",
    "She nonetheless voted against Udall’s bill.",
    "Who knows?"
  ]
}