{
  "id": 2300,
  "mediaId": 2689,
  "date": "2022-02-09",
  "headline": "ELECTION FRAUD UPDATE: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server (VIDEO)",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/election-fraud-update-maricopa-county-election-workers-caught-red-handed-deleting-archived-files-from-server-video-473256/",
  "mediaOutlet": "teaparty.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "1994), affirmed after remand, 37 F.3d 1487 (1994).”\nThe congressman then proceeded to point out, “That there is no process under current law for the Arizona Legislature to ‘decertify’ an election, does not mean that the Legislature cannot provide a remedy for outcome-determinative fraud and illegality in the conduct of the election, exercising powers it has directly from Article II of the federal Constitution, for as the Supreme Court stated in McPherson, ‘there is no doubt of the right of the legislature to resume the power [to appoint electors] at any time, for it can neither be taken away nor abdicated.’”\n“In the case of Maricopa, Pima and Yuma Counties, the fact that there is evidence showing illegal acts occurred, whether by intent or omission does not matter, the margin of error exceeds the margin of victory.",
    "State Representative @RealMarkFinchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections.https://t.co/yNnZjZpD10 #HCR2033 #azleg pic.twitter.com/Si7GjMAEeg\n— AZ House Republicans (@AZHouseGOP) February 7, 2022\n“The circumstances surrounding these elections undermine voter confidence in the election system, moreover, they ultimately translate into doubts about election integrity,” a statement from Finchem said.",
    "(TeaParty.org Exclusive) – According to a report from The Gateway Pundit, the full forensic audit of ballots in Maricopa County, Arizona concerning the 2020 presidential election concluded that there were thousands of discrepancies and election law violations, which included the deletion of election files before handing over the machines to be examined by auditors.",
    "“The Maricopa County full forensic audit found evidence of over 700,000 ballot discrepancies and an irredeemably compromised election.”\n“The historic resolution was introduced by Representatives Finchem, Barton, Biasiucci, Burges, Carter, Chaplik, Diaz, Fillmore, Martinez, Nguyen, Parker, Senators Borrelli, Rogers, and Townsend,” the report notes.",
    "“The Supreme Court of the United States has even noted that, ‘whatever provisions may be made by statute, or by the state constitution, to choose electors by the people, there is no doubt of the right of the legislature to resume the power at any time.’ McPherson, 146 U.S. at 35 (emphasis added, quoting with approval Sen. R., 1st Sess.",
    "Officials from Maricopa County already admitted to deleting the files in a Congressional hearing, but they then walked it back, claiming that the files weren’t deleted, but “archived.”\nThe Attorney General of Arizona is, as of this writing, conducting a thorough criminal investigation with the full, unredacted report.",
    "“Identities have been blurred to protect the integrity of the ongoing investigation.”\nKari Lake, a candidate in the Arizona gubernatorial race, called for those involved in this act to make the infamous “perp walk,” which means she wants to see them held accountable for their actions with arrests and convictions.",
    "Article II, Section 1, Clause 2 of the U.S. Constitution provides, in relevant part, ‘Each State shall appoint, in such Manner as the Legislature thereof may direct, a Number of Electors, equal to the whole Number of Senators and Representatives to which the State may be entitled in the Congress.’ U.S. Const.",
    "https://twitter.com/KariLake/status/1490801991169105921\n“We reported earlier that Arizona State Representative and candidate for Secretary of state Mark Finchem presented a bombshell resolution to decertify three county elections and reclaim Arizona’s electors,” GP’s report said.",
    "The Supreme Court has described the constitutional authority of the state legislatures to determine the manner of choosing electors as ‘plenary.’ See McPherson v. Blecker, 146 U.S. 1, 35 (1892); see also Bush v. Gore, 531 U.S. 98, 104 (2000),” Finchem added.",
    "395); see also Bush v. Gore, 531 U.S. at 104 (‘The State, of course, after granting the franchise in the special context of Article II, can take back the power to appoint electors’),” the congressman stated.",
    "“Today, We The People AZ Alliance released the actual footage from the Maricopa County Tabulation and Election Center server room when these exact files were deleted from the server,” the GP report said.",
    "The Gateway Pundit also recently reported that Arizona State Rep. Mark Finchem has introduced a brand new resolution that calls for three 2020 county elections to set aside and decertify results.",
    "The report goes on to reveal that the video footage of this happening was redacted from the public report in order to maintain confidentiality and to protect the people who deleted the files.",
    "This principle has been applied to reverse a fraudulent election even after the election was certified and the illegally certified candidate was sworn in and sitting in the legislature.",
    "We have debunked the ‘baseless claims’ narrative promoted by the propaganda pushing media and are now on to the business of providing specific relief to the People,” he continued.",
    "Evidence and testimony collected since November 3, 2020, has reached the point of clear and convincing and is now in the hands of the Arizona Attorney General for action.",
    "Finchem then went on to say, “One significant common law principle is that actions taken as the result of fraud or illegality are void ab initio, and can be rescinded.",
    "In that regard, the 2020 General Election is irredeemably compromised, and it is impossible to name a clear winner of the contest,” the statement concluded.",
    "“Arizona State Representative and Trump-endorsed Secretary of State candidate Mark Finchem introduced a resolution to decertify Maricopa,” the report says.",
    "“While some may say there is no valid constitutional, nor statutory grounds for such an action, they clearly are disregarding longstanding jurisprudence.",
    "If we are a nation governed by the ‘rule of law,’ as we so often espouse, then violations of the law must have consequences.",
    "“The questions first raised over a year ago about the legitimacy of the 2020 General Election persist.",
    "Citations of various elements justifying the Resolution can be found in the body of the Resolution.",
    "See, e.g., United States v. Bradley, 35 U.S. 343, 360 (1836) (citing Pigot’s Case, 11 Co. Lit.",
    "And this isn’t the only thing going on concerning the 2020 election in the state of Arizona.",
    "Pa. Feb. 18, 1994), vacated in part, 19 F.3d 873 (3d Cir.",
    "93-6157, 1994 WL 47710, at *15-*16 (E.D.",
    "You can read the text of HCR 2033 here.",
    "Marks v. Stinson, No.",
    "2 (emphasis added).",
    "Copyright 2022.",
    "TeaParty.org",
    "II, § 1, cl.",
    "27b (1614)).",
    "43rd Cong.",
    "Art.",
    "CIV.",
    "No.",
    "A."
  ]
}