{
  "id": 2907,
  "mediaId": 8450,
  "date": "2022-01-30",
  "headline": "Derecho al voto en Arizona: líderes religiosos y republicanos chocan por controversial iniciativa",
  "image": "https://media.telemundoarizona.com/2022/01/tlmd-iniciativa-de-ley-republicanos-arizona-derecho-al-voto.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.telemundoarizona.com/noticias/local/derecho-al-voto-en-arizona-lideres-religiosos-y-republicanos-chocan-por-controversial-iniciativa/2199371/",
  "mediaOutlet": "telemundoarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "La misiva también critica a la senadora demócrata de Arizona, Kyrsten Sinema, quien se negó a apoyar los esfuerzos de su partido en la cámara alta para desmantelar las reglas obstruccionistas que permiten a los republicanos obstruir repetidamente una votación sobre la legislación federal de derechos electorales que ella apoya.",
    "ARIZONA- Un grupo de más de 200 líderes religiosos de todo el país ha pedido al comisionado de la NFL, Roger Goodell, que retire el Super Bowl 2023 de Arizona debido a las leyes de votación restrictivas del estado y los intentos de los legisladores estatales republicanos de anular los resultados de las elecciones.",
    "El año pasado, los legisladores republicanos en 17 estados aprobaron al menos 32 nuevas leyes para cambiar las reglas de la administración electoral y despojar a los funcionarios electorales de la supervisión para ponerla en manos de las legislaturas controladas por el Partido Republicano.",
    "Arizona se encuentra entre varios estados dominados por el partido republicano que planean revisar las leyes electorales a raíz de las elecciones presidenciales de 2020 y la narrativa sin fundamento de Donald Trump de que los resultados le fueron \"robados\".",
    "En las primeras semanas de 2022, los republicanos de Arizona han presentado un proyecto de ley (HB2596) que impondría nuevas restricciones de votación significativas y permitiría que la legislatura estatal rechace los resultados de las elecciones.",
    "La carta invoca la condena de Martin Luther King Jr a los errores morales de la discriminación racial, “una enfermedad cancerosa que impide que se realice nuestra salud democrática”, y a los “espectadores” que se niegan a ejercer su influencia.",
    "También restringiría la votación al día de las elecciones y evitaría el uso de centros de votación, esencialmente mega recintos de votación donde cualquier persona en un condado puede votar, independientemente de dónde viva.",
    "Uno de los legisladores que promueven el proyecto de ley es Mark Finchem, un representante estatal que cree que las elecciones de 2020 fueron robadas, tiene vínculos con Oath Keepers y estuvo en el capitolio el 6 de enero.",
    "El grupo de líderes religiosos, varios de los cuales son de Arizona, incluye al reverendo Jesse Jackson y al reverendo William Barber, un destacado defensor del derecho al voto y copresidente de la Campaña de los Pobres.",
    "La iniciativa también requeriría que los votantes de Arizona den una excusa si quieren votar por correo, a pesar de que la gran mayoría de los votantes del estado ha utilizado durante mucho tiempo la votación por correo.",
    "La iniciativa requeriría que la legislatura estatal se reúna después de las elecciones primarias y generales para revisar el proceso de conteo de votos y “aceptará o rechazará los resultados de las elecciones”.",
    "La propuesta no requiere que los legisladores encuentren evidencia de fraude ni expongan los factores que tendrían que considerar para anular una elección.",
    "Si los legisladores rechazaran los resultados, cualquier votante en Arizona podría solicitar a un juez local que celebre una nueva elección.",
    "Finchem se postula para ser el principal funcionario electoral de Arizona.",
    "¿En qué consiste el proyecto de ley HB2596?"
  ]
}