{
  "id": 304,
  "mediaId": 2662,
  "date": "2022-02-24",
  "headline": "EXCLUSIVE: Arizona Senate President Karen Fann Claims “We Really Don’t Have a Mechanism To Decertify” – Mark Finchem Gave Us The Mechanism",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/08E0BB64-B7A3-489E-A0E6-0CF18AFFCBEC.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/exclusive-arizona-senate-president-karen-fann-claims-really-dont-mechanism-decertify-mark-finchem-gave-us-mechanism/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2246,
    4267,
    4066,
    3813,
    2765,
    3019,
    1477,
    94,
    102,
    6360
  ],
  "sentences": [
    "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”\nContact Arizona Senate President Karen Fann, Speaker Rusty Bowers, and Arizona legislators to strongly encourage their support for decertification.",
    "After the Maricopa County election audit discovered evidence of illegal activity during the 2020 election and hundreds of thousands of questionable ballots, Arizona State Representative Mark Finchem introduced a resolution to decertify Arizona’s irredeemably compromised election.",
    "Senate President Karen Fann played a major role in producing the first-ever full forensic election audit in history, but she has now taken the stance of AZ House Speaker Rusty Bowers, deeming this historic resolution to reclaim a stolen election unconstitutional.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nRepresentative Finchem challenged Rusty Bowers’ legal counsel to debate the legality of his resolution with his attorneys.",
    "— Rasmussen Reports (@Rasmussen_Poll) January 5, 2022\nRep Finchem recently told the War Room Posse that if Speaker Rusty Bowers refuses to hear his resolution, he will use a parliamentary tool to force the resolution to the floor and force a vote.",
    "The mechanism is, is that what we do is we do audits, and we find…\nConradson: So are you saying there’s no mechanism to decertify federally, are you saying the state legislature…\nFann: State legislature.",
    "I’m Waiting To See Yours.” (VIDEO)\nOn Tuesday, the Gateway Pundit correspondent Jordan Conradson spoke to Senate President Fann about her elections bill, SB1642, and decertification.",
    "So while we’re still fighting the 2020 battle, we need to make sure that you know the liberal media Democrats they are doing everything in their power to divide us Republicans.",
    "And let me tell you that the best thing that you can do on this one is because of those problems, and remember, even if Arizona had a mechanism to do that, it’s only Arizona.",
    "Conradson reached out to Fann after the interview to ask if there was a pathway to nullification of the stolen 2020 election and what that would potentially look like.",
    "Arizona Senate President Karen Fann recently told The Gateway Pundit that she does not believe the Arizona Legislature can decertify the fraudulent 2020 election.",
    "I’m listening to all of the attorneys and the judges that are telling me that no, we don’t, and they will give you the reasons why on this one.",
    "Fann: Well, first and foremost, we have to we have to reinstill voter confidence with the 2022 election because it’s coming up right now.",
    "Conradson: There’s no doubt that election laws were broken, the machines were connected to the Internet, files were deleted.",
    "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards.",
    "Fann: Well, as much as some of our people would not like to hear this, but we really don’t have a mechanism to decertify.",
    "Fann said she does not know the answer to that question and will need to consult attorneys on the matter.",
    "There is no mechanism to actually decertify as much as we would love Trump to be back in, there’s not.",
    "Look at all the horrible things that have happened in America over the last, you know, 14 months.",
    "Anybody watch House of Cards?…\nConradson: You said there’s not a mechanism to decertify.",
    "A Rasmussen poll shows that 59% of voters say cheating was likely in the 2020 election.",
    "It’s appalling, and I’d love to have him back, but we have to work within the system.",
    "And part of that system is is that we do not have in 2020 or even until now.",
    "What are your thoughts on representative Finchem’s resolution decertify?",
    "When they see us fighting each other when they see us attack each other.",
    "We must decertify the election to restore confidence in our elections.",
    "When you’re caught stealing something, you’re supposed to return it.",
    "Conradson: how do we restore voter confidence if we don’t fix 2020?",
    "Conradson: Do we not have the plenary power over our elections?",
    "Fann: But it’s past the time you can’t do retroactive.",
    "Perhaps Senate President Fann’s attorneys can join.",
    "According to all the attorneys, we can’t do that.",
    "Now here’s what will happen because this is new.",
    "Election cheating is a threat to our Republic.",
    "So let’s talk about, I know we would love to.",
    "Conradson: But you can reclaim the electors.",
    "Mark Finchem’s resolution is the mechanism.",
    "They are just rubbing their hands together.",
    "Fixing 2020 is not about Donald Trump.",
    "Nobody misses Trump more than I do.",
    "The scholars will tell you that.",
    "Not according to the attorneys.",
    "This is exactly what they want.",
    "It’s past the time to do that.",
    "So let’s move on on that one.",
    "Trust me on this one.",
    "I wish he was there.",
    "I’m not an attorney.",
    "Fann: No, you can’t.",
    "They are loving it.",
    "Good Morning !",
    "Fann: No."
  ]
}