{
  "id": 34,
  "mediaId": 2578,
  "date": "2022-02-21",
  "headline": "RINO Arizona House Speaker Rusty Bowers Files to Run for Senate After Turning On Constituents and Allowing Election Fraud",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/D7F9E2E1-7B93-4BC9-91D6-C6C40C0B257E.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/rino-arizona-house-speaker-rusty-bowers-files-run-senate-turning-constituents-allowing-election-fraud/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2157,
    2246,
    3813,
    4905,
    1489,
    94,
    5949,
    6360
  ],
  "sentences": [
    "Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nRusty Bowers will never win another Republican primary election after his efforts to cover up the stolen 2020 election.",
    "AZ Central reported,\nArizona House Speaker Rusty Bowers filed paperwork to run for the state Senate on Friday, setting up what may be an epic primary battle that highlights Republican divisions overthe 2020 presidential election results.",
    "Arizona House Speaker Rusty Bowers, one of the key RINOS in Arizona stonewalling decertification of the fraudulent 2020 election, filed to run for an Arizona State Senate seat last week.",
    "Arizona State Representative Mark Finchem recently presented a resolution to decertify the fraudulent election results, but Rusty Bowers lacks the courage to fight for Arizona voters.",
    "Since November 3rd, Bowers has sided with Democrats on election integrity despite massive findings of law violations and illegal ballots from the Maricopa County audit.",
    "The Gateway Pundit reported on Bowers’ opposition to critical election integrity bills and his plans to kill Representative Finchem’s resolution to decertify Arizona.",
    "Bowers has done everything in his power to surrender the fraudulent election results to Joe Biden and prevent justice from being served.",
    "Contact Rusty Bowers and encourage him to support decertification of the fraudulent 2020 election.",
    "Rusty Bowers is term limited and cannot run for re-election in the House.",
    "Bowers will make the next decision on this resolution.",
    "Phone Number: 602-926-3128\nEmail: RBOWERS@AZLEG.GOV",
    "Arizona House Speaker Turncoat Rusty Bowers: “Mr.",
    "He has not responded to request for comment."
  ]
}