{
  "id": 3686,
  "mediaId": 2578,
  "date": "2022-01-20",
  "headline": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Mark-Finchem-1.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/please-help-arizona-rep-mark-finchem-running-secretary-state-cover-expenses-pima-county-ad-hoc-hearing-election-integrity/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/joehoft/",
  "termIds": [
    2246,
    1394,
    94,
    1126,
    5949,
    6678,
    6517
  ],
  "sentences": [
    "Arizona State Representative Mark Finchem has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nHere is one of the findings from the work in Pima County.",
    "He has been in relentless pursuit of the evidence to turn over to the Arizona Attorney General to aid in the prosecution of those behind the violations of election law in Arizona.",
    "His dedication was first seen on November 30, 2020, when he not only chaired an Ad Hoc Public Hearing on Election Integrity but also covered the cost with his own AmEx card.",
    "Box 69344, Oro Valley, AZ 85755 520-808-7340 Visit https://VoteFinchem.com PAID FOR AND APPROVED BY MARK FINCHEM FOR ARIZONA SECRETARY OF STATE",
    "If you want to help make sure that hearings like this are held, visit https://givesendgo.com/G2ETE and help by making a modest contribution.",
    "This time Rep. Finchem stepped up and covered the cost of the December 13, 2021 Pima County Ad Hoc Public Hearing on Election Integrity.",
    "In a way, I suppose that it makes sense that someone would have to step forward as a champion for the People.”\nThen it happened again.",
    "Because he is in relentless pursuit of the evidence that the 2020 General Election is irredeemably compromised.",
    "Rep. Finchem has stood as a champion for those who believe the major problem with 2020 is justice denied.",
    "The cost is similar, and he is seeking help to once again retire the cost of doing the People’s business.",
    "Rasmussen recently reported that 58% of American’s believe cheating was involved in the 2020 Election.",
    "When champions stand up for us all, we must stand behind them.",
    "Mark Finchem Candidate for Arizona Secretary of State P.O.",
    "The Legislature did not pay for any portion of the cost.",
    "“Elections belong to the People, not the government.",
    "Why?",
    "Hon."
  ]
}