{
  "id": 400,
  "mediaId": 4032,
  "date": "2022-02-25",
  "headline": "2020 Presidential Election in Maricopa County Should Be Set Aside",
  "image": "https://thenewamerican.com/assets/sites/2/MarkFinchem-1.png",
  "link": "https://thenewamerican.com/2020-presidential-election-in-maricopa-county-should-be-set-aside/",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Newman",
  "authorUrl": "https://thenewamerican.com/author/alex-newman/",
  "termIds": [
    6653,
    6729,
    6360,
    6175,
    6239,
    6244,
    6279,
    6366,
    6614,
    5949
  ],
  "sentences": [
    "ERIC: THE ELECTRONIC REGISTRATION INFORMATION CENTER – A DREAM DATABASE FOR VOTER FRAUD\nI know you’re curious, so here is the membership list of states who have thrown away their sovereignty:\nAlabama, Alaska, Arizona, Colorado, Connecticut, Delaware, District of Columbia, Florida, Georgia, Illinois, Iowa, Kentucky, Louisiana, Maine, Maryland, Michigan, Minnesota, Missouri, Nevada, New Mexico, Ohio, Oregon, Pennsylvania, Rhode Island, South Carolina, Texas, Utah, Vermont, Virginia, Washington, West Virginia, and Wisconsin.",
    "Remember, they may be as clueless as to the electronic mole in their midst, ERIC, as the secretaries of states who are on its board, but it will be entertaining to find out.",
    "In the next piece, I will tell more of this Leftists’ dream data base, and how it is related to and developed from decades of dishonesty at the ballot box.",
    "I will also lay out an action plan for you to begin to reclaim your rights and secure your ballots.",
    "If so, your first call after reading this should be to your local board of elections.",
    "Assemble a community to attend the next meeting, and bring the matter to the floor.",
    "Make sure they know that YOU know, and forward them a copy of this article.",
    "Should be fun to watch reactions of your public officials.",
    "We have a country to save, and time is running very short.",
    "Kat Stansell\nhttps://americanpolicy.org/...",
    "We MUST get off the couch and out the door.",
    "Is your state among them??",
    "Ask them to verify."
  ]
}