{
  "id": 4831,
  "mediaId": 8251,
  "date": "2022-04-22",
  "headline": "Judge dismisses ballot challenges against Gosar, Biggs, Finchem",
  "image": "https://media.12news.com/assets/KPNX/images/c480f064-4617-486c-b355-6252967d3a7b/c480f064-4617-486c-b355-6252967d3a7b_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/elections/judge-dismisses-ballot-challenges-against-gosar-biggs-finchem-arizona/75-180aa2ab-d47e-4a1a-836a-d62d1dd5eb04",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2246,
    2426,
    2443,
    1433,
    1126,
    5949,
    6515,
    6360
  ],
  "sentences": [
    "PHOENIX — A Maricopa County judge has dismissed complaints attempting to remove Arizona Reps. Paul Gosar and Andy Biggs from the 2022 election ballot on the grounds that their alleged ties to the Jan. 6 insurrection should prevent them from holding federal office.",
    "The judge further noted that his ruling \"neither validates nor disproves Plaintiffs’ allegations against the candidates\" and that the court \"is not reaching the merits of the factual allegations in this case.\"",
    "\"Therefore, given the current state of the law and in accordance with the United States Constitution, Plaintiffs have no private right of action to assert claims under the Disqualification Clause.\"",
    "Plaintiffs tried to persuade the courts that the three Republican politicians were allegedly involved in the planning of rallies, events attached to the deadly Jan. 6 riot at the Capitol building.",
    "\"There may be a different time and type of case in which the Candidates’ involvement in the events of that day (Jan. 6) appropriately can and will be adjudicated in court,\" Judge Coury wrote.",
    "The lawsuits sought to disqualify Gosar, Biggs and state Rep. Mark Finchem by citing a section of the 14th Amendment to the U.S. constitution enacted after the Civil War.",
    "\"Plaintiffs have failed to cite persuasive legal authority or even include a developed legal argument about how they have a private right of action,\" the judge wrote.",
    "\"Legislation that proposes to enforce the Disqualification Clause currently is pending in the United States Congress, but has not yet been enacted,\" the judge wrote.",
    "Superior Court Judge Christopher A. Coury ruled against the plaintiffs Friday, finding that they had not shown why the courts should intervene in the matter.",
    "The section states no person shall sit in Congress if they \"have engaged in insurrection or rebellion\" or \"given aid or comfort to the enemies.\"",
    "But Judge Coury determined the plaintiffs did not have the legal authority to challenge their candidacy in court.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "Subscribe today."
  ]
}