{
  "id": 5004,
  "mediaId": 2643,
  "date": "2022-04-23",
  "headline": "Mike Lindell Touts 'Historical' New Voting Machine Lawsuit at Trump Rally",
  "image": "",
  "link": "https://www.newsweek.com/mike-lindell-touts-historical-new-voting-machine-lawsuit-trump-rally-1700355",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    0
  ],
  "sentences": [
    "Arizona state Representative Mark Finchem, a Republican, who is running to become the state's secretary of state in the 2022 midterms, and Kari Lake, a former television news journalist, who is running as a Republican to become the state's governor, filed the lawsuit with the backing of Lindell.",
    "Richer explained that the audit showed \"no evidence of routers, managed switches or tabulation equipment connected to the internet\" and that there was \"no evidence of data deletion, data purging, data overwriting, or other destruction of evidence or obstruction of the audit.\"",
    "Stephen Richer, a Republican and the Maricopa County Recorder, pointed out in an email in March that \"even if every single machine was hacked and manipulated (they weren't), we would still have the physical ballots to review.\"",
    "Former Attorney General William Barr, who was widely viewed as one of Trump's most loyal Cabinet members, has said repeatedly that there is \"no evidence\" to support claims of widespread voter fraud being behind Trump's loss.",
    "\"Yesterday was a historical day in history—in the history of America,\" Lindell asserted during an interview with Right Side Broadcasting Network (RSBN) ahead of former President Donald Trump's rally in Ohio on Saturday.",
    "While Lindell and his supporters contend that the machines \"flipped\" or \"changed\" votes due to being hacked or compromised, the paper ballots were recounted in Arizona and aligned with the initial machine tally.",
    "\"I'm not gonna give all the details, there's surprises, it's gonna shock the country as a matter of fact, how we're doing these and how they're going down,\" Lindell said last week before the lawsuit was filed.",
    "The pro-Trump businessman, who has been a key promoter of baseless claims that the 2020 election was \"rigged\" or \"stolen\" from the former president, said that this lawsuit was the first of \"many.\"",
    "MyPillow CEO Mike Lindell touted a new \"historical\" lawsuit he helped file in Arizona on Friday to prevent the southwestern state from utilizing machines to tabulate votes in upcoming elections.",
    "\"We know how tragic it was that this election [was] corrupted the way it was here in Arizona,\" Lake previously told Lindell in a recent interview, Tucson's Arizona Daily Star reported Saturday.",
    "In a segment of Lindell-TV uploaded to the businessman's website Frank Speech on Saturday, Lindell urged supporters to sign a petition in support of lawsuits targeting voting machines.",
    "Barr wrote in his memoir published in March that he told the former president directly to his face that the claims were \"bulls**t.\"\nNewsweek reached out to Lindell for comment.",
    "Dozens of election challenge lawsuits filed by the former president and his supporters failed in state and federal courts across the country after the 2020 results came in.",
    "\"This is so important because in this next election, besides the great candidates we're going to get, we have to have the machines gone,\" the MyPillow CEO said.",
    "Audits and recounts across the country, including in states where the election was overseen by pro-Trump Republicans, have consistently reaffirmed Biden's win.",
    "Maricopa County is led by Republicans, who have repeatedly rejected the allegations levied by Lindell and Trump that the results were fraudulent.",
    "He described the case against voting machines as \"historical,\" saying \"it's been worked on for I don't know how many months now.\"",
    "Multiple audits and recounts in the state's most populous county—Maricopa—have consistently reaffirmed Biden's win.",
    "\"We filed the first preliminary injunction in the state of Arizona to get rid of the machines once and for all.\"",
    "He sent that email to highlight the findings of an independent review of the county's voting machines.",
    "Arizona narrowly flipped blue for Biden by a margin of less than 10,000 votes in 2020.",
    "Lindell explained that he hopes to launch similar lawsuits in all 50 states.",
    "The machines were also audited and found not to be compromised.",
    "Even Trump-appointed judges dismissed the legal challenges.",
    "They contend that the machines are vulnerable to hacking.",
    "\"And we don't want it to happen again.\""
  ]
}