{
  "id": 5310,
  "mediaId": 2550,
  "date": "2022-04-18",
  "headline": "QAnon’s takeover of GOP nearly complete with 72 candidates ready to make ‘pedophilia’ claims",
  "image": "https://images.dailykos.com/images/914353/story_image/GettyImages-1294904312.jpg?1612563169",
  "link": "https://www.dailykos.com/stories/2022/4/18/2092685/-QAnon-s-takeover-of-GOP-nearly-complete-with-72-candidates-ready-to-make-pedophilia-claims?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Neiwert\nDaily Kos Staff",
  "authorUrl": "/users/david neiwert",
  "termIds": [
    5607,
    2246,
    3173,
    3111,
    1126,
    1101,
    6026
  ],
  "sentences": [
    "“Even though only 18 percent of Republicans had a positive view of QAnon (compared to 16 percent of all respondents), 30 percent of all respondents believed that ‘top Democrats are involved in elite child sex-trafficking rings,’ suggesting the wide reach of the conspiracy theory.”\nWhat all this tells us is that Democrats this fall will be facing a multipronged attack by Republicans, all based on hysterical fantasy: Democrats are soft on crime, they want to push critical race theory and “transgender ideology” on your kids, and they’re pro-pedophile.",
    "“Judge Jackson’s view is that we should treat everyone more leniently because more and more people are committing worse and worse child sex offenses,” he said, while also stating that “we’ve been told things like child pornography is actually all a conspiracy, it’s not real.” The lunatics who follow QAnon may just be onto something, in other words: The truth is out there.",
    "Most of all, QAnon at its core is deeply eliminationist, with an agenda calling for the mass imprisonment and execution of mainstream Democrats for ostensibly running a global child-trafficking/pedophilia cult—which seamlessly fits the people being targeted by Fox News and mainstream Republicans as “groomers” for opposing the right-wing attacks on the LGTBQ community.",
    "“They have raised over $20 million this cycle — and over $30 million since 2018.” Its simple summary: “QAnon appears to be a growing political movement with increasing clout and significant mainstream appeal.”\nThe highest concentration of these candidates is in Arizona, which has 13 of them; Florida is a close second with 12, while California has 10 and Texas has six.",
    "As Grid notes, “Q himself may be on the ballot this year.” In Arizona, Ron Watkins—the longtime 8kun site administrator who is believed to have authored at least some of the “Q drops” that fueled the cult between 2017 and 2020—is running in for the U.S. House in Arizona’s 2nd Congressional District, though his candidacy is considered a long shot at best.",
    "In a rational world, QAnon would have shriveled up and blown away after all of its cherished predictions and beliefs about “the Storm” led by Donald Trump and his allies that would sweep up these evil pedophiles and put them in prison to await execution were completely demolished by the cold reality of Joe Biden’s win in the 2020 election.",
    "Most of these candidates, indeed, have never held public office and have dubious (at best) records of achievement:\nShiva Ayyadurai, who has four degrees from MIT and is running for the Massachusetts governorship, runs a website claiming that he is the inventor of email.",
    "Carla Spaulding, a candidate seeking to be the GOP nominee to run against Democratic House whip Debra Wasserman Schultz for her Florida seat, pays herself a hefty $60,000 salary out of her campaign contributions while running up a six-figure campaign debt.",
    "The long-running gradual consumption of the Republican Party by the authoritarian QAnon conspiracy cult is nearing the terminal takeover phase: A recent survey by Grid found 72 Republican candidates with varying levels of QAnon affiliation.",
    "Ryan Dark White, who’s running for a U.S. Senate seat in Maryland and goes by the name Dr. Jonathan Ambrose McGreevey, has also pleaded guilty to illegal weapons charges and to fraudulently obtaining more than 80,000 doses of opioids.",
    "Grid’s survey was based on a review of “public records and reporting, social media posts, and campaign materials and events,” which its team of reporters used to identify and confirm QAnon-aligned candidates for public office in 2022.",
    "The most salient fact, however, is not only is the cult presence growing, but not a single Republican in any capacity can be found who either denounces the trend or works in any other way than in concert with it.",
    "“Nearly half of Republicans (49 percent) and 52 percent of Trump voters believe that Democrats run child sex-trafficking rings, per YouGov polling conducted during Jackson’s confirmation hearings,” he reports.",
    "One of the incumbents, Arizona House member Mark Finchem, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House Jan. 6 committee.",
    "As Alex Shepard observed at The New Republic, much of the questioning from Republicans revolved around the core QAnon beliefs:\nThe Q-inspired pedophile smear is consuming Republican politics.",
    "But instead, it kept spreading and growing, its fanaticism helping fuel the Jan. 6 insurrection, and providing a driving force for the ongoing anti-democratic insurgency that has followed.",
    "But “she ha[d] a chance to impose a sentence that would deter [child pornography], and she chose not to.” Senator Josh Hawley, meanwhile, referenced QAnon in his own remarks.",
    "“The phrase ‘child porn’ (or ‘pornography’ or ‘pornographer’)” was mentioned 165 times during Brown’s confirmation hearings, The Washington Post’s Dana Milbank tallied.",
    "That reality is terrifying not just because QAnon has a long record of inspiring unhinged, violent behavior with its fantastically vile beliefs and rhetoric.",
    "After the Jan. 6 insurrection, QAnon followers doubled down on their authoritarian beliefs and continued spreading within the ranks of the Republican Party.",
    "They found at least 78 of them in 26 states, all but six of them Republicans, mostly running against other Republicans in their state primaries.",
    "Shepard also notes that there are concrete reasons for Republicans to permit themselves to be subsumed by an authoritarian cult: It polls well.",
    "“They’re running for governorships, secretaries of state, seats in the Senate and House, and in state legislatures,” the study says.",
    "All three are designed to appeal to the lizard-brained lowest common denominators: the people inclined to violent eliminationism.",
    "Over a dozen of them are incumbents, including Congressmembers Marjorie Taylor Greene of Georgia and Lauren Boebert of Colorado.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "QAnon reared its ugly head in the U.S. Senate confirmation hearings for Supreme Court Justice Ketanji Brown-Jackson.",
    "“I’m not suggesting she likes what’s happening in child pornography,” Senator Lindsey Graham said Monday.",
    "Watkins vowed to raise $1 million for his bid, but so far appears only to have raised about $50,000.",
    "Nonetheless, she has far outraised her Republican competitors for the nomination; she’s No.",
    "In states like Oregon, it now fundamentally controls the Republican political apparatus.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Another 14 serve at the state level, mostly legislatures.",
    "This is a short blurb about Daily Kos.",
    "3 on Grip’s QAnon fundraising list.",
    "Candidates should come prepared.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}