{
  "id": 547,
  "mediaId": 2578,
  "date": "2022-02-21",
  "headline": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/77DE90C7-39EF-4D6E-B032-A582AB515475_4_5005_c.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/watch-candidate-az-secretary-state-mark-finchem-releases-new-ad-donald-trump-won-time-decertify/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2246,
    2765,
    3813,
    4066,
    94,
    102,
    1126,
    5949
  ],
  "sentences": [
    "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nEXCLUSIVE: Arizona State Representative Mark Finchem Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "You deserve a Secretary of State who will put your interests first, who will diligently promote voter list clean up, watermarks on ballots, a verifiable audit trail, and to refer criminality to the Attorney General’s office when it’s found.",
    "Finchem: When we strip away all of the various ways that cheating showed up in the 2020 election, when we consider both the criminality and the incompetence, the margin of error exceeds the margin of victory.",
    "pic.twitter.com/hqGHRzoLtF\n— Mark Finchem (@RealMarkFinchem) February 21, 2022\nThis is why the corrupt deep state January 6 Committee has subpoenaed Mark Finchem and Kelli Ward.",
    "Arizona State Representative Mark Finchem shared a new video on Monday highlighting the need to decertify the irredeemably compromised 2020 election in Arizona.",
    "Recently, Rep. Finchem introduced a resolution to decertify three 2020 county elections in Arizona and reclaim the state’s fraudulently certified electors.",
    "RINO Arizona House Speaker Rusty Bowers, who will decide whether or not this bill is assigned and voted on, immediately opposed Finchem’s resolution.",
    "It is time for us, the Arizona legislature, to move those counties which are irredeemably compromised into the ‘you’re decertified’ section.",
    "Rep. Finchem has challenged Rusty Bowers’ legal scholars to a debate with his attorneys on the resolution’s constitutionality.",
    "All Americans must contact Arizona legislators and House Speaker Rusty Bowers to strongly encourage decertification.",
    "It is a desperate attempt to silence him and prevent the truth about 2020 from coming to light.",
    "He then presents a plan to fix 2020 and secure elections as Arizona’s next Secretary of State.",
    "The Arizona Legislature must pass this resolution to restore voter confidence.",
    "Mark Finchem is the Trump-endorsed candidate for Arizona Secretary of State.",
    "It is time to decertify the counties that are irredeemably compromised.",
    "Ladies and gentlemen, we know it, and they know it, Donald Trump won.",
    "Elections belong to the people; they don’t belong to the government.",
    "Elections belong to the people, they don't belong to the government.",
    "This is how the people can get justice.",
    "TRENDING: BREAKING: IT'S OFFICIAL!",
    "We must fix our elections.",
    "Donald Trump won.",
    "TWITTER IS SOLD!"
  ]
}