{
  "id": 5894,
  "mediaId": 2822,
  "date": "2022-04-21",
  "headline": "Environmentalists sue to stop Interstate 11 through Arizona",
  "image": "https://bloximages.chicago2.vip.townnews.com/tucson.com/content/tncms/assets/v3/editorial/4/3b/43bf0afc-c1c3-11ec-b951-7f70a8a5a8bf/6261dcc197ea9.image.jpg?crop=644%2C362%2C0%2C218&resize=644%2C362&order=crop%2Cresize",
  "link": "https://tucson.com/news/local/environmentalists-sue-to-stop-interstate-11-through-arizona/article_b1916f50-c1b1-11ec-ac78-37f02c1e8a53.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Howard Fischer Capitol Media Services",
  "authorUrl": "",
  "termIds": [
    2246,
    478,
    245,
    6029,
    6667,
    6281,
    6383
  ],
  "sentences": [
    "“It skewed the comparison of alternatives against selection of a ‘no-build alternative’ by overestimated future travel demand based on inflated population growth and development projections, while ignoring the benefits of currently planned passenger rail and other projects on reducing congestion and the project’s potential to induce more congestion.’’\nPark said the environmental impact statement prepared by the federal agency about the project “failed to take a hard look’’ at potential for worsening air pollution, climate change, disrupting wildlife, increasing wildfire risks, contaminating water resources and degrading wilderness, recreation, scenic values, dark skies, soundscape and wildlife habitat in and around public lands.",
    "She said the decision to proceed with construction of I-11 before fully understanding the environmental consequences of part of the project is “in violation of NEPA’s directive that federal agencies analyze and disclose the environmental effects of their actions to the public and decisionmakers in an environmental impact statement before committing to those actions.’’\nThe lawsuit asks the court to void the decisions already made by the federal agency about construction of the road and preclude it from proceeding with the next phase until there is an adequate environmental impact statement.",
    "In a prepared statement, Park called the project “unnecessary’’ and a “road to climate catastrophe.’’\n“It’s despicable to see state and federal officials playing into the hands of private developers and ignoring the climate emergency to approve this boondoggle,’’ she said.",
    "Doug Ducey, who told Capitol Media Services years ago that the highway would “really benefit our state and allow us to be the player that we’re going to be in terms of economic growth and development and trade.’’ Ducey’s views have not changed, his press aide C.J.",
    "By contrast, she said, co-locating I-11 with the two existing interstate highways “would not create the massive impacts to wildlife that the West Option would.’’ Park said, though, there would need to be new and upgraded wildlife crossings.",
    "The lawsuit charges that the Federal Highway Administration, in approving one alternative route around the west side of Tucson, failed to consider the destruction to the Sonoran Desert, harm to wildlife and effects on air pollution.",
    "Environmental groups are going to court to stop further development of the proposed 280-mile Interstate 11 project from Nogales to Wickenburg, saying federal officials have not complied with legal requirements.",
    "But the project, which could cost anywhere from $3.1 billion to $7.3 billion, depending on the final path, is supported by local officials in Casa Grande and Maricopa who see it as aiding economic development.",
    "The National Park Service and the Arizona Game and Fish Department, Park said, expressed concerns that the West Option would permanently and severely harm Avra Valley wildlife populations and public lands.",
    "State Rep. Mark Finchem, R-Oro Valley, raised questions as far back as 2019 about the wisdom of constructing hundreds of miles of new freeway when the state can’t take care of the roads it already has.",
    "The Federal Highway Administration “cursorily rejected detailed consideration of a rail or multimodal alternative,’’ wrote Wendy Park, an attorney for the Tucson-based Center for Biological Diversity.",
    "Park said the route around Tucson would put the road through and near sensitive areas including Saguaro National Park, Ironwood Forest National Monument and Tohono O’odham Nation lands.",
    "That group, along with the Coalition for Sonoran Desert Protection, the Friends of Ironwood Forest and the Tucson Audubon Society, are asking a federal judge to intercede.",
    "And the Sahuarita Town Council voted last year to oppose what has been called the “West Option’’ that would build a new road from that community, around Tucson, to Marana.",
    "“In choosing to build the highway while deferring its decision on the route through Pima County, FHWA put the cart before the horse,’’ Park wrote in her legal filing.",
    "The act requires federal officials to prepare an environmental impact statement considering the effects of each major project, and includes considering alternatives.",
    "She said comments to both the Federal Highway Administration and the Arizona Department of Transportation as far back as 2016 questioned the need for a new highway.",
    "The lawsuit itself and the legal bid to stop construction, however, focus not on economic issues but through the lens of the National Environmental Policy Act.",
    "She said a stretch proposed between Casa Grande and Buckeye also would affect recreation areas as well as habitats for various endangered species.",
    "It isn’t just environmental groups that have expressed concern about the project that eventually would stretch north to Kingman and into Nevada.",
    "Park said even the U.S. Environmental Protection Agency recommended that federal officials consider potential rail and transit options.",
    "The claim, filed Thursday in federal court in Tucson, decries what it calls failure to consider other options to a new freeway.",
    "There also would be environmental effects from the final stretch from Buckeye to Wickenburg, Park said.",
    "He said there are far better alternatives for moving freight from Mexico to Canada, especially rail.",
    "Those effects would be less if the highway is co-located with Interstates 19 and 10, it says.",
    "A spokesman for the federal agency said it does not comment on pending litigation.",
    "The choice of the two options in Southern Arizona is only one issue.",
    "The agency violated environmental laws, the lawsuit states.",
    "Karamargin said Thursday.",
    "Ditto Republican Gov."
  ]
}