{
  "id": 5909,
  "mediaId": 2520,
  "date": "2022-04-11",
  "headline": "Honor the Constitution and ban Arizona's insurrectionists from holding public office",
  "image": "https://www.gannett-cdn.com/presto/2022/04/08/PPHX/f6384b03-4622-44b9-a1e0-25f04d8f8644-Representatives_Andy_Biggs_Paul_Gosar_Mark_Finchem.jpg?crop=1749,984,x1,y108&width=1749&height=984&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/04/11/ban-arizona-insurrectionists-biggs-gosar-finchem-public-office-lawsuit/7272852001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    5399,
    2246,
    2443,
    2426,
    2535,
    1433,
    1126,
    5949
  ],
  "sentences": [
    "It reads:\nNo person shall be a Senator or Representative in Congress, or elector of President and Vice President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "We four schemed up of putting max pressure on Congress while they were voting so that who we couldn’t lobby, we could change the hearts and the minds of Republicans who were in that body hearing our loud roar from outside.”\nAli gave a deposition to the House committee investigating the insurrection, and has also agreed to cooperate with a grand jury looking into the attack on the Capitol.",
    "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. Mark Finchem from holding office.",
    "If we believe in oaths – believe that those who swear to “preserve, protect and defend the Constitution of the United States” must be held to that promise – then none of the insurrectionists from Jan. 6, and none of those who gave them aid or comfort, would be permitted to hold elected office.",
    "Biggs, Gosar and Fichem played a part in Jan. 6\nYou may recall the now infamous video made by “Stop the Steal” organizer Ali Alexander in which he says, “I was the person who came up with the Jan. 6 idea with Congressman Gosar, Congressman Mo Brooks (R-Ala.) and then Congressman Andy Biggs.",
    "If words matter, if the Constitution mattered, “the party of the Constitution” would already have dumped these three Republican politicians from Arizona, as well as a number of others from different states, for their aid, comfort and support of those involved in the Jan. 6 insurrection.",
    "He spoke at a “pre-rally” event and had been introduced by Ali as a “friend.”\nOn Jan. 6 he tweeted a photo of demonstrators at the capitol and wrote, “What happens when the People feel they have been ignored, and Congress refuses to acknowledge rampant fraud.",
    "Unfortunately, a federal judge hearing that case ruled that an 1872 amnesty law, meant to allow politicians from the defeated Confederacy to continue to seek and hold office, somehow applied to the insurrection of 2022.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "The reason “the party of the Constitution” should already have sent these politicians packing is laid out, simply and succinctly, in Section 3 of the 14th Amendment of the Constitution.",
    "And most importantly, its decision on the 1872 amnesty act does not set future precedent for any court.”\nMeaning, another judge in another court could rule differently.",
    "An organization called Free Speech for People is helping citizens file lawsuits that would bar politicians who were linked to the insurrection from seeking office.",
    "Even so, Ron Fein, legal director for Free Speech for People, pointed out in a statement, “The court did not rule that Cawthorn is innocent of insurrection.",
    "With a campaign consultant for Gosar calling the lawsuit aimed at keeping his guy and the others off the ballot “frivolous.”\nBut it is not.",
    "Cawthorn was given a Civil War-era free pass\nOne of the first suits was filed against Republican Rep. Madison Cawthorn of North Carolina.",
    "And in the 245-year life of the United States of America, no words matter more than those in the Constitution.",
    "Opinion: Either Section 3 of the 14th Amendment of the Constitution means what it says or … what are we?",
    "Likewise, Finchem, running for secretary of state in Arizona, was at the Capitol that day.",
    "The fact is, no law passed by Congress can supersede something in the Constitution.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.",
    "It's laid out in the 14th Amendment, Section 3\nInstead, the party is silent.",
    "Because it is there in black and white in Section 3 of the 14th Amendment.",
    "#stopthesteal”\nEither we believe the Constitution or ... who are we?",
    "And either the words in the U.S. Constitution matter or they don’t.",
    "Still, the effort to stop Cawthorn, so far, has failed.",
    "Lately, however, that doesn’t seem to be the case.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "For more opinions content, please subscribe.",
    "That can only be done by another amendment.",
    "So, it’s simple.",
    "Words matter.",
    "None of them.",
    "Words matter.",
    "Or so we say.",
    "And should."
  ]
}