{
  "id": 6011,
  "mediaId": 2590,
  "date": "2022-04-09",
  "headline": "Court Revives Challenge To Madison Cawthorn's Reelection Effort",
  "image": "https://img.huffingtonpost.com/asset/625202ee1e0000d2731b2428.jpeg?cache=ahKSyfGWeR&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/cawthorn-candidacy-hearing-expedited-insurrectionist-ban-constitutiuon_n_6251efe0e4b0be72bfe9c1fd",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Papenfuss",
  "authorUrl": "",
  "termIds": [
    5399,
    2246,
    2765,
    1394,
    1126,
    5949
  ],
  "sentences": [
    "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and Mark Finchem, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "The clause bans those who, after previously taking an oath to “support the Constitution,” then “engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies.” The section was passed after the Civil War to prohibit lawmakers from representing a government they had worked to topple.",
    "The judge ruled that a federal Amnesty Act for those who participated in the Civil War against the government overrode the clause — though several attorneys have argued that a law cannot countermand the Constitution.",
    "A federal appeals court has revived a constitutional challenge to Rep. Madison Cawthorn’s (R-N.C.) right to run for reelection because of his support for insurrectionists who attacked the Capitol on Jan. 6, 2021.",
    "Advertisement\nVoters and the organization Free Speech for People have argued in court that Section 3 of the 14th Amendment bars lawmakers like Cawthorn from running again for office.",
    "Ruling by the U.S. Court of Appeals for the Fourth Circuit calls for expedited hearing concerning an injunction against the challenge to Rep. Madison Cawthorn's reelection.",
    "The U.S. Court of Appeals for the Fourth Circuit ordered earlier this week that a hearing against an injunction halting the challenge obtained by Cawthorn be held May 3.",
    "Cawthorn has declared that he did not participate in an insurrection — though he has repeatedly praised those who did — on Twitter and in speeches.",
    "Greene repeatedly refers to the insurrectionists as “patriots,” and has called those arrested for violence at the Capitol “political prisoners.”",
    "Advertisement\nThe Fourth Circuit court this week denied a stay in the case, but it granted an expedited appeal hearing.",
    "Cawthorn won an injunction from a Donald Trump-appointed federal judge last month against the challenge.",
    "He spoke at a rally preceding the storming of the Capitol on Jan. 6 last year.",
    "The Republican primary in Cawthorn’s district is May 17.",
    "Screen Shot/U.S."
  ]
}