{
  "id": 634,
  "mediaId": 2520,
  "date": "2022-02-22",
  "headline": "GOP legislators want new ballots that - surprise! - can only be made by one company",
  "image": "https://www.gannett-cdn.com/presto/2021/11/14/PPHX/7cac9fa5-f31e-4bde-8697-dc87d11ba318-cent02-7gnkvobtqa9jud5c837_original.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/22/arizona-bill-require-authentix-security-measures-ballots-election-fraud/6898187001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2706,
    2246,
    2443,
    1126,
    126,
    1466,
    5949,
    6159
  ],
  "sentences": [
    "The paper would have to contain watermarks, holograms and “thermochromic, tri-thermochromic, photochromic or optically variable inks.”\nIt would have to have stealth numbers printed in ultraviolet, infrared or taggant inks and “two-color rainbow print invisible ultraviolet numismatic designs with fine line security relief design that follows the primary images’ design exactly and with a minimum line weight of 0.0424 millimeters.”\nAnd it would have to have a “molecular level, forensic-covert security feature included in the infrared tagged ink” that “must be authenticated by laboratory analysis using gas chromatography mass spectrometry and the concentration in the related ink cannot be more than one part per million.”\nIn other words, the ballot paper would have to be provided by Authentix and equipment needed to authenticate the ballots would have to be provided by, you guessed it, Authentix.",
    "The bill is custom-made for their ballots\nAnd so comes a strike-everything amendment to House Bill 2726, requiring that ballots be printed on paper that contains 17 highly specific anti-fraud features and that they be of a certain size and weight (80 grams per square meter).",
    "Basically, Arizona would have the Buzz Lightyear of ballots, complete with holograms and invisible inks and stealth numbers and more than a dozen other whiz-bang, covert “countermeasures” designed to combat fraud.",
    "And it’s being promoted by Rep. Mark Finchem, a guy who is hoping that if he lies often enough about Arizona’s election being stolen that voters will install him as secretary of state to oversee future elections.",
    "Jen Marson, lobbyist for the Arizona Association of Counties, says there's no guarantee that the counties’ tabulation equipment will read the ballots, potentially requiring them to buy new equipment.",
    "In addition to raising money for his SOS campaign, he’s currently trying to raise $750,000 for a legal defense fund stemming from his recent subpoena to appear by the Jan. 6 congressional committee.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "He told the Washington Post that he was put in touch with the company after the 2020 election by a friend from Florida who was familiar with the company’s work adding security markers to products.",
    "You know, the stuff Republicans and their ninja auditors have been unable to find despite 16 months of searching and one massive UV-lighted, 5G photographed exercise in embarrassment.",
    "The only thing that is clear is that Finchem has been making the rounds, both inside and outside the state, over the last year, promoting a product that only Authentix can provide.",
    "He is lobbying hard for these security measures\nIt’s also unclear whether Finchem is getting anything for his promotion of a bill that would amount to a jackpot for Authentix.",
    "She also noted that a black light supplied by Authentix didn’t actually help in authenticating a sample ballot that contained the 17 security features required by the bill.",
    "But she called this bill, so clearly designed to benefit one company, “the worst example of a vendor bill I’ve ever seen.”\nWhich bothered her fellow Republicans not a whit.",
    "He won't say\nIt’s actually not a terrible idea to require more security features in ballots, if only so that Kari Lake and Wendy Rogers could sleep at night.",
    "No word as yet on what it would cost counties to print the ballots much less to buy whatever equipment would be needed to scan and authenticate the ballots.",
    "The Appropriations Committee passed it on an 8-5 vote with no debate about whether it’s a good idea to write a bill specifically to benefit one company.",
    "“That’s just the reality.”\nOnly 1 one Republican thinks this is fishy\nAmong Republicans, Rep. Michelle Mesa was the only one to oppose the bill.",
    "Company executives don’t show up as having donated last year to Finchem’s campaign and 2022 campaign finance reports won't be out for months.",
    "The House Appropriations Committee on Monday approved a plan to use special “anti-fraud” ballots in all future state and federal elections.",
    "But Finchem seems to perpetually have his hand out, in search of funds, and there's no way of knowing who may be filling his pockets.",
    "You know, to make it easier for the inevitable auditors to go back in time in their hunt for that thus-far elusive election fraud?",
    "It’s unclear how Finchem hooked up with Authentix, a company based in Addison, Texas, that has never before worked on elections.",
    "Or whether 17 – count ‘em, 17 – security features is enough to combat evil foreign actors trying to slip bamboo ballots by us.",
    "There is also a Free and Fair Elections Debt Fund and a Guardian Defense Fund for people who want to send Finchem money.",
    "Or what happens to a ballot if the county can authenticate only 16 of the 17 required security features.",
    "“When you have sole source (suppliers) they can charge you whatever they want,” she told the committee.",
    "This just in, from the front lines of the Republican Party’s epic battle against imagined ballot fraud.",
    "Opinion: GOP legislators are working on a plan to put 17 \"anti fraud countermeasures\" on every ballot.",
    "“It was somebody who knew somebody,” Finchem told the Post, while declining to name those somebodies.",
    "Finchem has estimated it would cost 25 cents to produce a ballot, up from the current nickel.",
    "She also warned about the consequences of tailoring a bill so that it fits only one company.",
    "It makes sense, she said, to print the ballots on something other than plain cardstock.",
    "But how much is too much given that they've never actually been able to find any fraud?",
    "Or whether we should add lasers or maybe even a flux capacitor to every ballot.",
    "The state is offering a one-time donation of $6 million to offset the cost.",
    "Since then, plenty of Republicans have joined him in supporting the plan.",
    "But this bill is written to benefit one specific company, based in Texas.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Count the counties among those who oppose the bill.",
    "Who told Finchem about Authentix?",
    "And do they even work?",
    "5 times the cost?"
  ]
}