[
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "Since endorsing <span class='selected-term'>Harriet Hageman</span>, an attorney and former Trump critic, to take on Cheney, Trump has been engrossed with even minor developments in the campaign.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 732,
    "mediaId": 195,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>, according to an invitation obtained by The Hill.",
    "author": "",
    "title": "Romney participating in fundraiser for Liz Cheney"
  },
  {
    "id": 698,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "She's set to face off against <span class='selected-term'>Harriet Hageman</span>, a former RNC official who has been endorsed by Trump, in an August primary.",
    "author": "Bryan Metzger",
    "title": "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski"
  },
  {
    "id": 705,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Cheney has drawn several Republican challengers for Wyoming's at-large House seat, chief among them <span class='selected-term'>Harriet Hageman</span>, a former Cheney supporter who won Trump's endorsement to take her on.",
    "author": "",
    "title": "George W. Bush sends cash to GOP impeachment voters facing challengers"
  },
  {
    "id": 708,
    "mediaId": 188,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "In Wyoming, Trump has publicly endorsed attorney <span class='selected-term'>Harriet Hageman</span>'s campaign to unseat Cheney.",
    "author": "Phil Shiver",
    "title": "George W. Bush donates to GOP lawmakers who voted to impeach Trump after Jan. 6 riot"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 678,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Trump endorsed <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, reported this week that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Andrew Mark Miller",
    "title": "George W. Bush donated thousands to Trump impeachment supporters Cheney, Murkowski"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\nLiz Cheney out-raises Trump-endorsed challenger <span class='selected-term'>Harriet Hageman</span>\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "AUGUST 16\nStates holding primaries: Alaska, Wyoming\nKey races to watch: In Wyoming, Representative Liz Cheney, the most visible anti-Trump Republican in Congress, faces Trump-endorsed GOP activist <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  }
]