[
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "She was ousted from her leadership post, ejected from the Wyoming Republican Party and targeted repeatedly by the former president, who has tried to unite Wyoming voters around the primary opponent he has endorsed, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Cheney faces a Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "It's like Magapalooza One.?\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina's 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; Loren Culp, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina's 7th Congressional District; John Gibbs, a former Housing and Urban Development official under Trump running to represent Michigan's 3rd Congressional District; <span class='selected-term'>Harriet Hageman</span>, candidate for Wyoming's only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; Max Miller, the former Trump White House aide and candidate for Ohio's 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee's 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin's 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana's only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Cheney is charging ahead with a reelection bid despite that internal party pushback and a Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>, for whom more than 100 GOP members held a fundraiser last week.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 240,
    "mediaId": 19,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "But before we can defeat the Democrat socialists and communists at the ballot boxes  we first have to defeat the RINOS and grandstanders in the primaries.?\nMeanwhile, Cheney has a tough primary challenge against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>, who has earned the support of Rep. Kevin McCarthy and Republican megadonor Peter Thiel, who reportedly dubbed Cheney the ringleader? of the treasonous ten.?\nMcCarthy's decision to support Hageman mirrors the overall criticism of Cheney.",
    "author": "Wendell Husebø",
    "title": "40 Percent of House Republicans Who Voted to Impeach Trump to Exit Congress, Fred Upton the Latest"
  }
]