[
  {
    "id": 806,
    "mediaId": 169,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "The Wyoming Republican Party even voted to stop recognizing the political scion as a member of the GOP last November, a firm rebuke as she faces a crowded primary against Trump-endorsed attorney <span class='selected-term'>Harriet Hageman</span>, among others.",
    "author": "Brett Bachman",
    "title": "Democrats embrace Dick Cheney during Jan. 6 remembrance event"
  },
  {
    "id": 739,
    "mediaId": 195,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "If you can find me five policy differences between <span class='selected-term'>Harriet Hageman</span> and Liz Cheney, I'll fall over dead.?\nHowever, even Cheney supporters say she risks having any policy message railroaded by the committee's inquiry.",
    "author": "Tal Axelrod",
    "title": "Jan. 6 probe roils Cheney race in Wyoming"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\nLiz Cheney out-raises Trump-endorsed challenger <span class='selected-term'>Harriet Hageman</span>\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 675,
    "mediaId": 19,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "As Breitbart News reported in January, a Wyoming straw poll has Cheney losing to the Trump-backed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Paul Bois",
    "title": "Republican National Committee Will Vote Friday to Censure Liz Cheney, Adam Kinzinger"
  },
  {
    "id": 667,
    "mediaId": 25,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "\"This is further proof that Liz Cheney has completely lost her ability to be effective in Congress for the people of Wyoming,\" <span class='selected-term'>Harriet Hageman</span>, the Trump-backed candidate running against Cheney, said in a statement.",
    "author": "Adam Brewster",
    "title": "RNC approves measure to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 460,
    "mediaId": 195,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, the Wyoming Republican waging a primary challenge against Rep. Liz Cheney (R-Wyo.).",
    "author": "Tal Axelrod",
    "title": "McCarthy endorses Cheney primary challenger"
  },
  {
    "id": 462,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy on Thursday endorsed attorney <span class='selected-term'>Harriet Hageman</span> in her primary race in Wyoming against Rep. Liz Cheney, a rebuke of the Republican incumbent and former member of House leadership who has denounced Donald Trump.",
    "author": "",
    "title": "McCarthy endorses Cheney's primary rival in rebuke of Republican incumbent who has denounced Trump"
  },
  {
    "id": 463,
    "mediaId": 65,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy is endorsing <span class='selected-term'>Harriet Hageman</span> in her Wyoming primary challenge to Rep. Liz Cheney, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "author": "Kelly Phares",
    "title": "McCarthy backs Cheney challenger Hageman in Wyoming House Republican primary"
  },
  {
    "id": 473,
    "mediaId": 558,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) has officially endorsed attorney <span class='selected-term'>Harriet Hageman</span>, the top challenger to incumbent GOP Rep. Liz Cheney, in the race for Wyoming's one and only House seat, The Federalist reports Thursday.",
    "author": "Brigid Kennedy",
    "title": "Kevin McCarthy endorses top Liz Cheney challenger in Wyoming House race"
  },
  {
    "id": 488,
    "mediaId": 188,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Republican Leader Kevin McCarthy of California endorsed <span class='selected-term'>Harriet Hageman</span> for the at-large seat for Wyoming in the U.S. House of Representatives.",
    "author": "Carlos Garcia",
    "title": "GOP leader Kevin McCarthy endorses pro-Trump primary challenger to Liz Cheney"
  },
  {
    "id": 450,
    "mediaId": 65,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Continue reading \nWEGMAN EARNS NOD - House Minority Leader Kevin McCarthy is endorsing <span class='selected-term'>Harriet Hageman</span> in her Wyoming primary challenge to Rep. Liz Cheney, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "author": "Jack Durschlag",
    "title": "California's 'endemic' approach"
  },
  {
    "id": 454,
    "mediaId": 124,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "In a highly unusual move, House Minority Leader Kevin McCarthy on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, the Trump-backed candidate challenging Rep. Liz Cheney in the Wyoming Republican primary.",
    "author": "",
    "title": "House GOP leader McCarthy endorses Cheney challenger in Wyoming primary"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, <span class='selected-term'>Harriet Hageman</span>, whose central message is that Ms. Cheney should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 396,
    "mediaId": 223,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "While Liz Cheney was cavorting with Never Trump sissies and squeezing donors, her opponent <span class='selected-term'>Harriet Hageman</span> was at CPAC and word is that the Beltway Cowgirl is doomed.",
    "author": "Kurt Schlichter",
    "title": "The Big News Out of CPAC 2022 Is That Trump Is Back"
  },
  {
    "id": 365,
    "mediaId": 238,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "), who would love crossover support from Democrats and independents in her primary against MAGA favorite <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Opinion: MAGA loyalists run into trouble"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Her main challenger in this race, <span class='selected-term'>Harriet Hageman</span>, went in the opposite direction: from fervent Never Trumper in 2016 to a fervent Trumper today.",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 297,
    "mediaId": 21,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to cohost a fundraiser for <span class='selected-term'>Harriet Hageman</span>, the leading primary challenger against GOP Rep. Liz Cheney, according to Politico.",
    "author": "John L. Dorman",
    "title": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger"
  },
  {
    "id": 300,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "I've endorsed [Cheney opponent <span class='selected-term'>Harriet Hageman</span>].",
    "author": "Juliegrace Brufke",
    "title": "McCarthy says GOP criticisms of Cheney and Kinzinger won't dissuade swing voters"
  },
  {
    "id": 289,
    "mediaId": 195,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Trump-backed primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Max Greenwood",
    "title": "House GOP keeps Trump at arm's length as it hones midterm strategy"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "McCarthy has thrown his political weight behind <span class='selected-term'>Harriet Hageman</span>, a Trump-backed congressional candidate who is challenging Cheney in Wyoming -- an endorsement that earned him plaudits on the right, a key constituency in a potential future bid for the speaker's gavel.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 283,
    "mediaId": 239,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "The three-term Wyoming Republican, whose father is former Vice President Dick Cheney, is seeking re-election and faces Trump-endorsed primary opponent <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Kerry Picket",
    "title": "Cheney spokesman says GOP lawmakers support Putin for endorsing her primary opponent"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The quarter one fundraising haul puts Cheney well ahead of her primary opponent, Wyoming attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 215,
    "mediaId": 118,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "On the other hand, Cheney's main opponent, <span class='selected-term'>Harriet Hageman</span>, has landed the coveted Trump stamp of approval, despite being an erstwhile Never Trumper who once tried to overturn the former president's victory in the 2016 primary.",
    "author": "Noah Y. Kim",
    "title": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her"
  },
  {
    "id": 166,
    "mediaId": 65,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Cheney's newfound unpopularity opened the door to a primary challenge from <span class='selected-term'>Harriet Hageman</span>, a 2018 Wyoming gubernatorial candidate who has earned the endorsements of Trump and House Minority Leader Kevin McCarty, R-Calif., with one poll showing the challenger up 20 points on the incumbent lawmaker.",
    "author": "Michael Lee",
    "title": "Liz Cheney raised more money from deep blue areas, states than from Wyoming: report"
  },
  {
    "id": 92,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "In Wyoming, Cheney is running for reelection against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating in Delaware Underwater by 3 Points"
  }
]