[
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50: The number of House Republicans who attended a fundraiser last night for <span class='selected-term'>Harriet Hageman</span>, the Republican (who is endorsed by former President Donald Trump) challenging Wyoming GOP Rep. Liz Cheney, per NBC's Vaughn Hillyard.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 248,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The North Carolina conservative appeared alongside other House Republicans at a fundraiser for <span class='selected-term'>Harriet Hageman</span>, the Trump-backed opponent of Rep. Liz Cheney (R-Wyo.).",
    "author": "",
    "title": "Cloud of notoriety builds over Cawthorn after sex-and-drugs claims"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, who is opposing Rep. Liz Cheney (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, who is opposing Rep. Liz Cheney (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 3124,
    "mediaId": 376,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "But Cheney remains formidable, with a powerful family name and more than a 6-1 cash-on-hand advantage as of March 31 over trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley\nNiels Lesniewski",
    "title": "Multiple threats mean there's no shortage of vulnerable House members"
  }
]