[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "He's come out in support of attorney <span class='selected-term'>Harriet Hageman</span>, and he is anticipated to make the race a top priority, including by holding rallies in the Cowboy State.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022"
  },
  {
    "id": 66,
    "mediaId": 238,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Even <span class='selected-term'>Harriet Hageman</span>, Trump's favorite to take out Wyoming Rep. Liz Cheney, brought in only $443,000.",
    "author": "",
    "title": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president."
  },
  {
    "id": 301,
    "mediaId": 63,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Polling suggests Trump-endorsed Republican <span class='selected-term'>Harriet Hageman</span> leads Rep. Liz Cheney (R-Wyo.)",
    "author": "Nicholas Reimann",
    "title": "Trump Rescinds Support For BrooksLatest Mishap In His Bid To Control Midterms"
  },
  {
    "id": 258,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Attorney <span class='selected-term'>Harriet Hageman</span>, the GOP primary contender Trump endorsed for Wyoming's lone, at-large congressional seat, enjoys strong establishment support, including from House Minority Leader Kevin McCarthy of California.",
    "author": "David M. Drucker",
    "title": "Trump's GOP stranglehold faces major test in four primary battles"
  },
  {
    "id": 193,
    "mediaId": 237,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It's possible he will turn his focus to the Wyoming House race next, where Rep. Liz Cheney, one of the former president's harshest critics within the GOP, is facing off against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Cami Mondeaux",
    "title": "Trump invests $500,000 in bid to unseat Georgia Gov. Kemp: Report"
  },
  {
    "id": 105,
    "mediaId": 223,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And, in the GOP House primary race in Wyoming, he has backed attorney <span class='selected-term'>Harriet Hageman</span> over Rep. Liz Cheney, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "author": "Salena Zito",
    "title": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down"
  },
  {
    "id": 89,
    "mediaId": 195,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "And perhaps most prominently in Wyoming, Rep. Liz Cheney (R) is in the fight for her political life in a primary against Trump-backed attorney <span class='selected-term'>Harriet Hageman</span> later in August.",
    "author": "Tal Axelrod",
    "title": "Pro-Trump candidates look to harness populist energy after Ohio"
  }
]