[
  {
    "id": 838,
    "mediaId": 129,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "But some, including <span class='selected-term'>Harriet Hageman</span>, who is mounting a primary challenge against Representative Liz Cheney of Wyoming, one of Mr. Trump's harshest Republican critics, and Kelly Tshibaka, who is running in the primary against Senator Lisa Murkowski, Republican of Alaska, have been asked to hold the date, according to a person familiar with the planning who was not authorized to discuss it.",
    "author": "",
    "title": "As Midterms and 2024 Loom, Trump Political Operation Revs Up"
  },
  {
    "id": 739,
    "mediaId": 195,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "If you can find me five policy differences between <span class='selected-term'>Harriet Hageman</span> and Liz Cheney, I'll fall over dead.?\nHowever, even Cheney supporters say she risks having any policy message railroaded by the committee's inquiry.",
    "author": "Tal Axelrod",
    "title": "Jan. 6 probe roils Cheney race in Wyoming"
  },
  {
    "id": 730,
    "mediaId": 234,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Billionaire Peter Thiel hosted about two dozen Republican donors at his 10,000-square-foot Miami compound on Wednesday night to raise money for Wyoming Republican <span class='selected-term'>Harriet Hageman</span>, the Donald Trumpbacked candidate running a primary challenge against GOP representative Liz Cheney.",
    "author": "Gabriel Sherman",
    "title": "It Was All About How the 2020 Election Was Stolen: Billionaire Peter Thiel Hosts Fundraiser for Liz Cheney Challenger"
  },
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Cheney released her fundraising figures a couple of hours after <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, announced that she raised roughly $745,000 from her campaign launch on Sept. 9 through the end of 2021, according to figures shared first with Fox News.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 721,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Rep. Liz Cheney as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid"
  },
  {
    "id": 572,
    "mediaId": 63,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "In January, Thiel and Donald Trump Jr. co-hosted two fundraisers for <span class='selected-term'>Harriet Hageman</span>, a Republican primary challenger to Rep. Liz Cheney (R-Wyo.",
    "author": "Zachary Snowdon Smith",
    "title": "Peter Thiel Leaving Meta Board To Focus On Pro-Trump Politics"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. Liz Cheney (R-WY), who is in a tough primary fight against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  },
  {
    "id": 3130,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: An outside group chaired by Donald Trump Jr. is going up with a three-week long ad blitz in Wyoming in support of <span class='selected-term'>Harriet Hageman</span>, the Republican congressional candidate who with former President Donald Trump's backing is primary challenging GOP Rep. Liz Cheney.",
    "author": "Paul Steinhauser",
    "title": "Donald Trump Jr. takes aim at Cheney, supports Hageman in new ad running in Wyoming's GOP House primary"
  },
  {
    "id": 3126,
    "mediaId": 136,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "To do so, he called on his supporters to rally behind one candidate, namely <span class='selected-term'>Harriet Hageman</span>, whom he endorsed last September.",
    "author": "Jon Jackson",
    "title": "Nebraska Primary Gives Trump Reason to Worry About Liz Cheney Race"
  }
]