[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "He's come out in support of attorney <span class='selected-term'>Harriet Hageman</span>, and he is anticipated to make the race a top priority, including by holding rallies in the Cowboy State.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022"
  },
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "Since endorsing <span class='selected-term'>Harriet Hageman</span>, an attorney and former Trump critic, to take on Cheney, Trump has been engrossed with even minor developments in the campaign.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 772,
    "mediaId": 124,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "And Rep. Liz Cheney, R-Wyo., who is serving on the Democratic-led House committee investigating the Jan. 6 attack on the Capitol, is in danger of losing a primary to Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Inside Trump's secretive endorsement operation"
  },
  {
    "id": 753,
    "mediaId": 151,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Cheney faces a Republican primary challenge from Donald Trump-backed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Joe Biden said he wants to break up his stalled $1.7T social spending bill into legislative \"chunks.\" That likely means one smaller bill."
  },
  {
    "id": 710,
    "mediaId": 33,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Among them: Rep. Jody Hice of Georgia, who voted against certifying the election on January 6 and is running in the Republican primary against Georgia Secretary of State Brad Raffensperger, who has defended the state's election results; and <span class='selected-term'>Harriet Hageman</span>, a Republican primary challenger to Wyoming Rep. Liz Cheney, who voted to impeach Trump for his actions on January 6 and is a member of the House select committee investigating the January 6 attack.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 679,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "And last September, after Trump endorsed <span class='selected-term'>Harriet Hageman</span>'s primary challenge against Rep. Liz Cheney in the race for Wyoming's at-large House seat, he and his allies successfully urged some, but not all, of the other anti-Cheney GOP candidates to drop out of the primary and coalesce around Hageman.",
    "author": "Paul Steinhauser",
    "title": "After meeting with Trump, Georgia's Vernon Jones likely to exit GOP gubernatorial primary"
  },
  {
    "id": 516,
    "mediaId": 193,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "In Wyoming, a slew of candidates dropped out after he announced his support for <span class='selected-term'>Harriet Hageman</span>'s bid against a top Trump critic, Rep. Liz Cheney.",
    "author": "Jill Colvin",
    "title": "Donald Trump turns to endorsements to keep bending GOP to his will"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "McCarthy has also endorsed Wyoming trial attorney <span class='selected-term'>Harriet Hageman</span>, who is challenging Cheney in her primary election.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "McCarthy has thrown his political weight behind <span class='selected-term'>Harriet Hageman</span>, a Trump-backed congressional candidate who is challenging Cheney in Wyoming -- an endorsement that earned him plaudits on the right, a key constituency in a potential future bid for the speaker's gavel.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 193,
    "mediaId": 237,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It's possible he will turn his focus to the Wyoming House race next, where Rep. Liz Cheney, one of the former president's harshest critics within the GOP, is facing off against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Cami Mondeaux",
    "title": "Trump invests $500,000 in bid to unseat Georgia Gov. Kemp: Report"
  },
  {
    "id": 188,
    "mediaId": 195,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "She faces Trump-endorsed Wyoming attorney <span class='selected-term'>Harriet Hageman</span>, who earned $1.3 million in the last quarter.",
    "author": "Lexi Lonas",
    "title": "Five takeaways from last quarter's fundraising"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "AUGUST 16\nStates holding primaries: Alaska, Wyoming\nKey races to watch: In Wyoming, Representative Liz Cheney, the most visible anti-Trump Republican in Congress, faces Trump-endorsed GOP activist <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  },
  {
    "id": 105,
    "mediaId": 223,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And, in the GOP House primary race in Wyoming, he has backed attorney <span class='selected-term'>Harriet Hageman</span> over Rep. Liz Cheney, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "author": "Salena Zito",
    "title": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down"
  },
  {
    "id": 89,
    "mediaId": 195,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "And perhaps most prominently in Wyoming, Rep. Liz Cheney (R) is in the fight for her political life in a primary against Trump-backed attorney <span class='selected-term'>Harriet Hageman</span> later in August.",
    "author": "Tal Axelrod",
    "title": "Pro-Trump candidates look to harness populist energy after Ohio"
  },
  {
    "id": 7288,
    "mediaId": 136,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The former president has endorsed a number of their challengers, including <span class='selected-term'>Harriet Hageman</span>, who is running against U.S. Representative Liz Cheney of Wyoming, one of Trump's most outspoken critics in the Republican Party.",
    "author": "Daniel Bush",
    "title": "Georgia Primaries Will Test Trump's Revenge Campaign Against GOP Incumbents"
  }
]