[
  {
    "id": 806,
    "mediaId": 169,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "The Wyoming Republican Party even voted to stop recognizing the political scion as a member of the GOP last November, a firm rebuke as she faces a crowded primary against Trump-endorsed attorney <span class='selected-term'>Harriet Hageman</span>, among others.",
    "author": "Brett Bachman",
    "title": "Democrats embrace Dick Cheney during Jan. 6 remembrance event"
  },
  {
    "id": 726,
    "mediaId": 19,
    "date": "1/29/2022 12:00:00 AM",
    "sentence": "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>, according to an invitation obtained by The Hill.",
    "author": "Joel B. Pollak",
    "title": "Report: Scooter' Libby, Pardoned by Trump, to Attend Liz Cheney Fundraiser"
  },
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Cheney released her fundraising figures a couple of hours after <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, announced that she raised roughly $745,000 from her campaign launch on Sept. 9 through the end of 2021, according to figures shared first with Fox News.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 698,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "She's set to face off against <span class='selected-term'>Harriet Hageman</span>, a former RNC official who has been endorsed by Trump, in an August primary.",
    "author": "Bryan Metzger",
    "title": "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski"
  },
  {
    "id": 705,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Cheney has drawn several Republican challengers for Wyoming's at-large House seat, chief among them <span class='selected-term'>Harriet Hageman</span>, a former Cheney supporter who won Trump's endorsement to take her on.",
    "author": "",
    "title": "George W. Bush sends cash to GOP impeachment voters facing challengers"
  },
  {
    "id": 706,
    "mediaId": 129,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Like Ms. Murkowski, Ms. Cheney out-raised her Trump-backed challenger, <span class='selected-term'>Harriet Hageman</span>, collecting $2 million to Ms. Hageman's $443,000 last quarter, though money is often not the determining factor in outcomes, especially in high-profile cases that garner significant media attention.",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 708,
    "mediaId": 188,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "In Wyoming, Trump has publicly endorsed attorney <span class='selected-term'>Harriet Hageman</span>'s campaign to unseat Cheney.",
    "author": "Phil Shiver",
    "title": "George W. Bush donates to GOP lawmakers who voted to impeach Trump after Jan. 6 riot"
  },
  {
    "id": 678,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Trump endorsed <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, reported this week that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Andrew Mark Miller",
    "title": "George W. Bush donated thousands to Trump impeachment supporters Cheney, Murkowski"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\nLiz Cheney out-raises Trump-endorsed challenger <span class='selected-term'>Harriet Hageman</span>\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Liz sadly belongs in an MSNBC or CNN news chair, not in Congress representing Wyoming,? Stefanik said in her endorsement statement for <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The quarter one fundraising haul puts Cheney well ahead of her primary opponent, Wyoming attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 209,
    "mediaId": 209,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "As she fends off challenger <span class='selected-term'>Harriet Hageman</span> (an attorney who's backed by former President Donald Trump), the Wyoming Republican has actually broken yet another personal fundraising record, having brought in an impressive $2.94 million in the first quarter of 2022, Politico reports Monday.",
    "author": "Brigid Kennedy",
    "title": "Liz Cheney rakes in cash in fight against Trump-backed challenger"
  },
  {
    "id": 210,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The Wyoming Republican is fighting off a serious challenge from <span class='selected-term'>HARRIET HAGEMAN</span>, a Cheyenne attorney, and the Aug. 16 primary has turned into the most important and closely watched contest between the MAGA and traditional wings of the GOP.",
    "author": "",
    "title": "POLITICO Playbook: SCOOP: Liz Cheney's record fundraising haul"
  },
  {
    "id": 215,
    "mediaId": 118,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "On the other hand, Cheney's main opponent, <span class='selected-term'>Harriet Hageman</span>, has landed the coveted Trump stamp of approval, despite being an erstwhile Never Trumper who once tried to overturn the former president's victory in the 2016 primary.",
    "author": "Noah Y. Kim",
    "title": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her"
  }
]