[
  {
    "id": 73,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Overnight News Digest February 1, 2022"
  },
  {
    "id": 63,
    "mediaId": 151,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "pulled in the most, with a staggering $2 million, nearly five times as much as challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "House Republicans close money gap in hunt for the majority"
  },
  {
    "id": 676,
    "mediaId": 188,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "While Kinzinger is not seeking re-election, Cheney is pursuing another term in office and will face Trump-backed <span class='selected-term'>Harriet Hageman</span> during the Republican primary.",
    "author": "Alex Nitzberg",
    "title": "Republican National Committee slated to vote on resolution to censure Reps. Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 429,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "In the final quarter of 2021, Cheney took in $2 millionbesting the haul of her Trump-backed challenger, <span class='selected-term'>Harriet Hageman</span>, by a whopping $1.6 million.",
    "author": "",
    "title": "Two Republicans who certified 2020 are winning money race against two"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, <span class='selected-term'>Harriet Hageman</span>, whose central message is that Ms. Cheney should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 368,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed <span class='selected-term'>Harriet Hageman</span> in her race against Rep. Liz Cheney in Wyoming.",
    "author": "",
    "title": "Elise Stefanik unveils new endorsements for 2022 midterm elections"
  },
  {
    "id": 297,
    "mediaId": 21,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to cohost a fundraiser for <span class='selected-term'>Harriet Hageman</span>, the leading primary challenger against GOP Rep. Liz Cheney, according to Politico.",
    "author": "John L. Dorman",
    "title": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50: The number of House Republicans who attended a fundraiser last night for <span class='selected-term'>Harriet Hageman</span>, the Republican (who is endorsed by former President Donald Trump) challenging Wyoming GOP Rep. Liz Cheney, per NBC's Vaughn Hillyard.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, Rep. Liz Cheney's challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  }
]