[
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "Since endorsing <span class='selected-term'>Harriet Hageman</span>, an attorney and former Trump critic, to take on Cheney, Trump has been engrossed with even minor developments in the campaign.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 838,
    "mediaId": 129,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "But some, including <span class='selected-term'>Harriet Hageman</span>, who is mounting a primary challenge against Representative Liz Cheney of Wyoming, one of Mr. Trump's harshest Republican critics, and Kelly Tshibaka, who is running in the primary against Senator Lisa Murkowski, Republican of Alaska, have been asked to hold the date, according to a person familiar with the planning who was not authorized to discuss it.",
    "author": "",
    "title": "As Midterms and 2024 Loom, Trump Political Operation Revs Up"
  },
  {
    "id": 772,
    "mediaId": 124,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "And Rep. Liz Cheney, R-Wyo., who is serving on the Democratic-led House committee investigating the Jan. 6 attack on the Capitol, is in danger of losing a primary to Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Inside Trump's secretive endorsement operation"
  },
  {
    "id": 753,
    "mediaId": 151,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Cheney faces a Republican primary challenge from Donald Trump-backed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Joe Biden said he wants to break up his stalled $1.7T social spending bill into legislative \"chunks.\" That likely means one smaller bill."
  },
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Cheney released her fundraising figures a couple of hours after <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, announced that she raised roughly $745,000 from her campaign launch on Sept. 9 through the end of 2021, according to figures shared first with Fox News.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 721,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Rep. Liz Cheney as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid"
  },
  {
    "id": 694,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Her Trump-backed rival, <span class='selected-term'>Harriet Hageman</span> (R), raised $443,000 and has less than that on hand.",
    "author": "Max Greenwood and Reid Wilson -",
    "title": "Five big takeaways from year-end FEC filings"
  },
  {
    "id": 702,
    "mediaId": 124,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And on the House side, Trump gave to <span class='selected-term'>Harriet Hageman</span>, who is running a primary challenge to Rep. Liz Cheney, R-Wyo.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 620,
    "mediaId": 112,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The move to withhold support for Cheney could benefit her primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "Associated Press",
    "title": "A defining moment': Kinzinger says Republican National Committee censure of him and Cheney shows McCarthy's weakness as House leader"
  },
  {
    "id": 666,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The party said the behavior of Cheney and Kinzinger has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? [...]\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize <span class='selected-term'>Harriet Hageman</span>, her challenger, as the party's presumptive nominee\nThis short commentary on Hageman appeared previously as part of the Jan. 20 Earth Matters:\n Harriet Hageman\nRight-wing land-use attorney Harriet Hageman is keen to export clean coal? from Wyoming and export Rep. Liz Cheney back to the private sector in the state's Republican primary next August.",
    "author": "",
    "title": "Nat'l GOP is funding this woman in Wyoming primary against Liz Cheney, whom the party condemned"
  },
  {
    "id": 604,
    "mediaId": 151,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "On Wednesday, the committee received a letter signed by Republican Party leaders in Wyoming allowing the RNC to fund Cheney's primary challenger, <span class='selected-term'>Harriet Hageman</span>, an RNC official said.",
    "author": "",
    "title": "Trump's circular firing squad' threatens GOP midterm gains"
  },
  {
    "id": 535,
    "mediaId": 21,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Rep. Liz Cheney of Wyoming, who has now been censured by state party officials and the Republican National Committee, is running for reelection against Trump pick <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Warren Rojas",
    "title": "Trump is on an endorsement spree and has now put his MAGA stamp on more than 100 political candidates since leaving the White House"
  },
  {
    "id": 507,
    "mediaId": 21,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "AP Photo/Mead Gruver, File\nRepublican <span class='selected-term'>Harriet Hageman</span>, during a recent New York Times interview, couldn't say who won the 2020 presidential election.",
    "author": "John L. Dorman",
    "title": "Rep. Liz Cheney's leading GOP primary challenger says she doesn't know who lawfully won the 2020 presidential election"
  },
  {
    "id": 509,
    "mediaId": 21,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "Trump has enthusiastically backed <span class='selected-term'>Harriet Hageman</span>, a water rights attorney, over the congresswoman in the GOP primary.",
    "author": "John L. Dorman",
    "title": "'I reject the crazies': Liz Cheney blasts Wyoming GOP leadership over notion that she prioritizes Trump battles over reelection bid"
  },
  {
    "id": 499,
    "mediaId": 234,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "As Vanity Fair reported last month, Thiel hosted a January fundraiser at his Miami compound for Wyoming Republican <span class='selected-term'>Harriet Hageman</span>, the Trumpbacked candidate running a primary challenge against Liz Cheney after Cheney refused to endorse Trump's big lie? and voted to impeach him.",
    "author": "Caleb Ecarma",
    "title": "Peter Thiel Is MAGA's Big Money Man"
  },
  {
    "id": 462,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy on Thursday endorsed attorney <span class='selected-term'>Harriet Hageman</span> in her primary race in Wyoming against Rep. Liz Cheney, a rebuke of the Republican incumbent and former member of House leadership who has denounced Donald Trump.",
    "author": "",
    "title": "McCarthy endorses Cheney's primary rival in rebuke of Republican incumbent who has denounced Trump"
  },
  {
    "id": 468,
    "mediaId": 376,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed <span class='selected-term'>Harriet Hageman</span>, the primary challenger of Wyoming Rep. Liz Cheney, a rare and significant move that is the latest Republican act of retribution directed at Cheney for her criticism of former President Donald Trump and her integral role on the Jan. 6 select committee.",
    "author": "Chris Marquette",
    "title": "McCarthy backs Cheney's challenger in Wyoming primary"
  },
  {
    "id": 485,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Trending News\n U.S. proposes limiting consideration of public benefits for green cards\n Information warfare expert says U.S. is finally countering Russia at its own game\n Kevin McCarthy backs Liz Cheney's primary challenger <span class='selected-term'>Harriet Hageman</span>\n Russia expels U.S. embassy's second-in-command amid Ukraine tensions\n Intel arm of DHS defends office amid GOP senator's criticism\n Kathryn Watson\nKathryn Watson is a politics reporter for CBS News Digital based in Washington, D.C.",
    "author": "Kathryn Watson",
    "title": "All members of Congress can attend Biden's State of the Union, with COVID-19 restrictions"
  },
  {
    "id": 446,
    "mediaId": 169,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "McCarthy's endorsement, first reported by The Federalist, came on Thursday for <span class='selected-term'>Harriet Hageman</span>, a pro-Trump candidate and former Republican candidate for the governor of Wyoming.",
    "author": "Jon Skolnik",
    "title": "Kevin McCarthy breaks political tradition, endorses Liz Cheney's pro-Trump primary challenger"
  },
  {
    "id": 447,
    "mediaId": 195,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "LEADING THE DAY\nPOLITICS: House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, the primary challenger looking to unseat Rep. Liz Cheney (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - One day, two continents, words of war"
  },
  {
    "id": 439,
    "mediaId": 112,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Associated Press\nA Cheney spokesperson was dismissive of the importance of McCarthy's endorsement of Cheyenne lawyer <span class='selected-term'>Harriet Hageman</span>: Wow, [Hageman] must be really desperate'\nWASHINGTON (AP)  House Republican leader Kevin McCarthy late this week endorsed a primary challenger to Rep. Liz Cheney, a remarkable step for a party leader that effectively lends his weight to the effort to purge a chief critic of former President Donald Trump's from Congress.",
    "author": "Associated Press",
    "title": "House Republican leader Kevin McCarthy backs primary challenger to Rep. Liz Cheney in Wyoming"
  },
  {
    "id": 436,
    "mediaId": 25,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "Last Thursday, just weeks after the RNC's resolution against Cheney and Kinzinger, House Republican Minority Leader Kevin McCarthy endorsed Cheney's primary challenger in Wyoming, trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Robert Costa",
    "title": "Trump's GOP critics to gather in Washington with an eye on 2024 presidential race"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "It's like Magapalooza One.?\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina's 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; Loren Culp, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina's 7th Congressional District; John Gibbs, a former Housing and Urban Development official under Trump running to represent Michigan's 3rd Congressional District; <span class='selected-term'>Harriet Hageman</span>, candidate for Wyoming's only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; Max Miller, the former Trump White House aide and candidate for Ohio's 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee's 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin's 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana's only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 424,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "3: The number of Trump-backed primary challengers speaking at the annual Conservative Political Action Conference this week including David Perdue, <span class='selected-term'>Harriet Hageman</span> and Kelly Tshibaka.",
    "author": "",
    "title": "Putin's Ukraine move raises new questions for Biden's presidency"
  },
  {
    "id": 421,
    "mediaId": 195,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "She faces an uphill reelection battle in her home state of Wyoming in November, with Trump and his allies moving to bolster her primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Brad Dress",
    "title": "Cheney: Trump's 'adulation' of Putin 'aids our enemies'"
  },
  {
    "id": 407,
    "mediaId": 238,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, <span class='selected-term'>Harriet Hageman</span>, whose central message is that [Representative Liz Cheney] should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries,? the NYT's Annie Karni and Jonathan Weisman report.",
    "author": "",
    "title": "After Afghanistan, Biden faces another wary public on Ukraine"
  },
  {
    "id": 391,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs Liz Cheney's primary challenger <span class='selected-term'>Harriet Hageman</span>\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "author": "",
    "title": "Biden's low approvals worry Democrats campaigning in midterm elections"
  },
  {
    "id": 363,
    "mediaId": 237,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "The paper noted that if the bill had become law, voters may not have known for certain who was running before having to register with a certain party.?\nSupporters of the bill, including Trump and attorney <span class='selected-term'>Harriet Hageman</span>, whom Trump has endorsed against Cheney in the primary, said it would have prevented Democrats and independents from changing their party registration on Election Day in order to vote in a Republican primary.",
    "author": "Kate Scanlon",
    "title": "Trump-backed Wyoming elections bill fails to pass, in boon to Liz Cheney"
  },
  {
    "id": 341,
    "mediaId": 65,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX - <span class='selected-term'>Harriet Hageman</span>, the GOP congressional candidate waging a primary challenge against Rep. Liz Cheney, R-Wyo., with the backing of former President Donald Trump, argues in a new digital campaign that the Republican incumbent is out of touch with voters and is \"obsessed with her personal war\" against Trump.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Wyoming GOP primary challenger Hageman urges sending Cheney home to Virginia'"
  },
  {
    "id": 343,
    "mediaId": 151,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Though there's been scant public polling of her primary campaign against Trump-backed <span class='selected-term'>Harriet Hageman</span>, it's apparent that Republicans in Wyoming  which voted for Trump over Joe Biden, 70 to 27 percent, in 2020  have turned against Cheney en masse since Jan. 6, 2021.",
    "author": "",
    "title": "Liz Cheney turns to Democrats to save her hide"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Her main challenger in this race, <span class='selected-term'>Harriet Hageman</span>, went in the opposite direction: from fervent Never Trumper in 2016 to a fervent Trumper today.",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 301,
    "mediaId": 63,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Polling suggests Trump-endorsed Republican <span class='selected-term'>Harriet Hageman</span> leads Rep. Liz Cheney (R-Wyo.)",
    "author": "Nicholas Reimann",
    "title": "Trump Rescinds Support For BrooksLatest Mishap In His Bid To Control Midterms"
  },
  {
    "id": 289,
    "mediaId": 195,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Trump-backed primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Max Greenwood",
    "title": "House GOP keeps Trump at arm's length as it hones midterm strategy"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 258,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Attorney <span class='selected-term'>Harriet Hageman</span>, the GOP primary contender Trump endorsed for Wyoming's lone, at-large congressional seat, enjoys strong establishment support, including from House Minority Leader Kevin McCarthy of California.",
    "author": "David M. Drucker",
    "title": "Trump's GOP stranglehold faces major test in four primary battles"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Liz sadly belongs in an MSNBC or CNN news chair, not in Congress representing Wyoming,? Stefanik said in her endorsement statement for <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50: The number of House Republicans who attended a fundraiser last night for <span class='selected-term'>Harriet Hageman</span>, the Republican (who is endorsed by former President Donald Trump) challenging Wyoming GOP Rep. Liz Cheney, per NBC's Vaughn Hillyard.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 253,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "If? because this week at a Washington fundraiser, over 100 House Republicans supported Cheney's main primary opponent, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Myra Adams",
    "title": "America needs Liz Cheney"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Cheney is charging ahead with a reelection bid despite that internal party pushback and a Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>, for whom more than 100 GOP members held a fundraiser last week.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 219,
    "mediaId": 223,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Cheney is facing a primary opponent, <span class='selected-term'>Harriet Hageman</span>, whom Trump endorsed last September.",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  },
  {
    "id": 205,
    "mediaId": 65,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Cheney released her fundraising figures a couple of days after <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Cheney, announced that she brought in roughly over $1.3 million the past three months, according to figures shared first with Fox News.",
    "author": "Paul Steinhauser",
    "title": "Targeted by Trump, Cheney hauls in nearly $3 million the past three months for her re-election run"
  },
  {
    "id": 208,
    "mediaId": 238,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "), who is facing a GOP primary challenge in her district from lawyer <span class='selected-term'>Harriet Hageman</span>, announced Monday that she raised nearly $3 million in the first quarter of the year and has $6.8 million on hand.",
    "author": "",
    "title": "Post Politics Now Biden wades back into politically fraught politics of gun control"
  },
  {
    "id": 211,
    "mediaId": 237,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "But Cheney could need every penny to defeat Republican primary challenger <span class='selected-term'>Harriet Hageman</span>, an attorney.",
    "author": "David M. Drucker",
    "title": "Liz Cheney raises $3 million in first quarter while under fire from Trump"
  },
  {
    "id": 193,
    "mediaId": 237,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It's possible he will turn his focus to the Wyoming House race next, where Rep. Liz Cheney, one of the former president's harshest critics within the GOP, is facing off against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Cami Mondeaux",
    "title": "Trump invests $500,000 in bid to unseat Georgia Gov. Kemp: Report"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. Liz Cheney (R-WY), who is in a tough primary fight against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "His fury at Wyoming Representative Liz Cheney, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 109,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "The former president, who last summer backed <span class='selected-term'>Harriet Hageman</span> in her bid to oust Cheney in this year's Republican primary and who has helped fundraise for Hageman, is now heading to Wyoming later this month to headline a rally for his endorsed candidate.",
    "author": "Paul Steinhauser",
    "title": "Trump to target Cheney at May 28 rally in Wyoming"
  },
  {
    "id": 114,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "The president is expected to rally with <span class='selected-term'>Harriet Hageman</span>, a Republican primary challenger to Rep. Liz Cheney (R-WY).",
    "author": "Charlie Spiering",
    "title": "Donald Trump Announces Rally with Liz Cheney Challenger Harriet Hageman in Casper, Wyoming"
  },
  {
    "id": 105,
    "mediaId": 223,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And, in the GOP House primary race in Wyoming, he has backed attorney <span class='selected-term'>Harriet Hageman</span> over Rep. Liz Cheney, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "author": "Salena Zito",
    "title": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down"
  },
  {
    "id": 91,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "The conservative group Wyoming Values PAC is plastering anti-Liz Cheney billboards across Wyoming, encouraging voters to support her Trump-backed challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Liz Cheney Aided in GOP Primary by Ad Agency Linked to Biden, BLM, Planned Parenthood"
  },
  {
    "id": 92,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "In Wyoming, Cheney is running for reelection against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating in Delaware Underwater by 3 Points"
  },
  {
    "id": 3131,
    "mediaId": 238,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "The Post's Isaac Stanley-Becker reports that the challenger, <span class='selected-term'>Harriet Hageman</span>, has posted feeble fundraising figures, raising about $2 million so far this cycle, compared to the $10 million Cheney has brought into her main committee.",
    "author": "",
    "title": "Post Politics Now Senate Democrats tee up a doomed vote to write abortion protections into law"
  },
  {
    "id": 3130,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: An outside group chaired by Donald Trump Jr. is going up with a three-week long ad blitz in Wyoming in support of <span class='selected-term'>Harriet Hageman</span>, the Republican congressional candidate who with former President Donald Trump's backing is primary challenging GOP Rep. Liz Cheney.",
    "author": "Paul Steinhauser",
    "title": "Donald Trump Jr. takes aim at Cheney, supports Hageman in new ad running in Wyoming's GOP House primary"
  },
  {
    "id": 3300,
    "mediaId": 65,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "You have to earn them,\" said Stefanik, who is backing Cheney's primary challenger in Wyoming, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Marisa Schultz",
    "title": "Elise Stefanik says Republicans are on track to win 'a historic majority'"
  }
]