[
  {
    "id": 635,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "As the party met in Salt Lake City this week, the leaders of the Wyoming GOP privately signed a special rule that would allow the national party to financially support <span class='selected-term'>Harriet Hageman</span>, Cheney's primary challenger.",
    "author": "",
    "title": "Ten questions for Steny Hoyer"
  },
  {
    "id": 638,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Post also reported that GOP officials in Wyoming struck a deal with the national party to financially support <span class='selected-term'>Harriet Hageman</span>, a former RNC committeewoman who's been endorsed by Trump, in her primary against Cheney this year.",
    "author": "Bryan Metzger",
    "title": "RNC Chairwoman Ronna McDaniel says January 6 committee is a 'Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse'"
  },
  {
    "id": 666,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The party said the behavior of Cheney and Kinzinger has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? [...]\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize <span class='selected-term'>Harriet Hageman</span>, her challenger, as the party's presumptive nominee\nThis short commentary on Hageman appeared previously as part of the Jan. 20 Earth Matters:\n Harriet Hageman\nRight-wing land-use attorney Harriet Hageman is keen to export clean coal? from Wyoming and export Rep. Liz Cheney back to the private sector in the state's Republican primary next August.",
    "author": "",
    "title": "Nat'l GOP is funding this woman in Wyoming primary against Liz Cheney, whom the party condemned"
  },
  {
    "id": 602,
    "mediaId": 223,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "11\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize <span class='selected-term'>Harriet Hageman</span>, her challenger, as the party's presumptive nominee.",
    "author": "Rebecca Downs",
    "title": "Rule Change Means Liz Cheney's Primary Challenger Could Receive Financial Support"
  },
  {
    "id": 526,
    "mediaId": 157,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Trump has endorsed Cheney's opponent in the GOP primary, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "John Wright",
    "title": "Trump is fuming over Scooter Libby attending a Liz Cheney fundraiser: report"
  }
]