[
  {
    "id": 732,
    "mediaId": 195,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>, according to an invitation obtained by The Hill.",
    "author": "",
    "title": "Romney participating in fundraiser for Liz Cheney"
  },
  {
    "id": 726,
    "mediaId": 19,
    "date": "1/29/2022 12:00:00 AM",
    "sentence": "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>, according to an invitation obtained by The Hill.",
    "author": "Joel B. Pollak",
    "title": "Report: Scooter' Libby, Pardoned by Trump, to Attend Liz Cheney Fundraiser"
  },
  {
    "id": 621,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Kinzinger is not running for reelection next year, while Cheney is fighting for her political life against a Trump-backed primary challenger in attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Tal Axelrod",
    "title": "RNC votes to censure Cheney, Kinzinger"
  },
  {
    "id": 625,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Romney, who tested positive for COVID-19 last week, is also set to participate in a fundraiser for Cheney in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Sarakshi Rai",
    "title": "Romney rips GOP censure effort against Cheney, Kinzinger"
  },
  {
    "id": 627,
    "mediaId": 675,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "There, however, the state party already has stripped her of party recognition and a straw poll among county GOP officials snubbed her recently, with six votes for Cheney and 59 for primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Bob Unruh",
    "title": "RNC votes to censure Cheney, Kinzinger over campaign against Trump"
  },
  {
    "id": 402,
    "mediaId": 124,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "It's roughly 10 times as much as her Trump-backed primary challenger <span class='selected-term'>Harriet Hageman</span> drew.",
    "author": "",
    "title": "With Liz Cheney's re-election prospects in doubt, her national profile grows"
  },
  {
    "id": 365,
    "mediaId": 238,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "), who would love crossover support from Democrats and independents in her primary against MAGA favorite <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Opinion: MAGA loyalists run into trouble"
  },
  {
    "id": 334,
    "mediaId": 25,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Cheney's primary race has a national following  she's facing a challenge from <span class='selected-term'>Harriet Hageman</span>, a Trump ally who has been endorsed by House Minority Leader Kevin McCarthy, of California.",
    "author": "Robert Costa",
    "title": "In private speech, Romney warns of 'extraordinary challenge' to preserve American democracy"
  },
  {
    "id": 336,
    "mediaId": 19,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "On Monday, Romney reportedly delivered an introductory speech at a closed fundraiser for embattled Cheney (R-WY), who is fending off attacks from GOP primary opponent Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Mitt Romney Lies About Supporting GOP Primary Candidates"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, Rep. Liz Cheney's challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 229,
    "mediaId": 19,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "McConnell and Cheney apparently believe the Wyoming member may lose her seat to Trump-endorsed <span class='selected-term'>Harriet Hageman</span>, a strong threat to the establishment Republican order in Washington, DC.",
    "author": "Wendell Husebø",
    "title": "Mitch McConnell Donates to Liz Cheney"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The quarter one fundraising haul puts Cheney well ahead of her primary opponent, Wyoming attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 212,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Trump, House Minority Leader Kevin McCarthy and GOP Rep. Elise Stefanik of New York, Cheney's replacement as House Republican conference chair, are backing one of her challengers, trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Aaron Navarro",
    "title": "Liz Cheney sets personal fundraising record ahead of August primary"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. Liz Cheney (R-WY), who is in a tough primary fight against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  },
  {
    "id": 130,
    "mediaId": 129,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "It was not clear why Mr. Trump considered Mr. McIntosh to be by his side in that fight, since he has previously been frustrated that the Club has not endorsed <span class='selected-term'>Harriet Hageman</span>, who is challenging Ms. Cheney.",
    "author": "",
    "title": "A big G.O.P. group amplifies its attacks on a Trump-backed Ohio candidate."
  }
]