[
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. Liz Cheney, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed <span class='selected-term'>Harriet Hageman</span> in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 716,
    "mediaId": 157,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And in Wyoming, GOP Rep. Liz Cheney raised $2 million in the last quarter, compared to Trump back challengers <span class='selected-term'>Harriet Hageman</span>'s $443,000.",
    "author": "John Wright",
    "title": "MAGA candidates getting trounced in fundraising -- and showing limits of Trump's power: report"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "McCarthy has also endorsed Wyoming trial attorney <span class='selected-term'>Harriet Hageman</span>, who is challenging Cheney in her primary election.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, who is opposing Rep. Liz Cheney (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, who is opposing Rep. Liz Cheney (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "His fury at Wyoming Representative Liz Cheney, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  }
]