[
  {
    "id": 729,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Venture capitalist and Republican megadonor Peter Thiel on Wednesday hosted a fundraiser for Democrat-allied Rep. Liz Cheney's (R-WV) primary opponent, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Big Money Donor Peter Thiel Hosts Fundraiser for Liz Cheney's Primary Opponent, Harriet Hageman"
  },
  {
    "id": 730,
    "mediaId": 234,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Billionaire Peter Thiel hosted about two dozen Republican donors at his 10,000-square-foot Miami compound on Wednesday night to raise money for Wyoming Republican <span class='selected-term'>Harriet Hageman</span>, the Donald Trumpbacked candidate running a primary challenge against GOP representative Liz Cheney.",
    "author": "Gabriel Sherman",
    "title": "It Was All About How the 2020 Election Was Stolen: Billionaire Peter Thiel Hosts Fundraiser for Liz Cheney Challenger"
  },
  {
    "id": 572,
    "mediaId": 63,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "In January, Thiel and Donald Trump Jr. co-hosted two fundraisers for <span class='selected-term'>Harriet Hageman</span>, a Republican primary challenger to Rep. Liz Cheney (R-Wyo.",
    "author": "Zachary Snowdon Smith",
    "title": "Peter Thiel Leaving Meta Board To Focus On Pro-Trump Politics"
  },
  {
    "id": 497,
    "mediaId": 129,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "In addition to <span class='selected-term'>Harriet Hageman</span>, the challenger to Ms. Cheney, he is backing Joe Kent and Loren Culp, both of whom are running against House Republicans in Washington State who voted to impeach Mr. Trump.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker"
  },
  {
    "id": 499,
    "mediaId": 234,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "As Vanity Fair reported last month, Thiel hosted a January fundraiser at his Miami compound for Wyoming Republican <span class='selected-term'>Harriet Hageman</span>, the Trumpbacked candidate running a primary challenge against Liz Cheney after Cheney refused to endorse Trump's big lie? and voted to impeach him.",
    "author": "Caleb Ecarma",
    "title": "Peter Thiel Is MAGA's Big Money Man"
  },
  {
    "id": 467,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "McCarthy's endorsement of <span class='selected-term'>Harriet Hageman</span>'s bid against Cheney, a colleague and a member of his caucus, is a highly unusual intervention into a primary for a House party leader that also highlights the wide rift between McCarthy and Cheney.",
    "author": "Grace Panetta",
    "title": "House Minority Leader Kevin McCarthy endorses Liz Cheney's Trump-backed primary challenger"
  },
  {
    "id": 349,
    "mediaId": 19,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "It's embarrassing.?\nAccording to the report, Republicans who oppose Cheney and likely support her GOP primary opponent, <span class='selected-term'>Harriet Hageman</span>, have bought about a quarter of the 350 available tickets to give the embattled congresswoman a piece of their minds.?\nCheney is in hot water after opposing American First policies, voting to impeach Donald Trump, and allying herself with House Speaker Nancy Pelosi's (D-CA) January 6 committee, which has sought to investigate the January 6 incident without focusing on the alleged FBI informants at the Capitol.",
    "author": "Wendell Husebø",
    "title": "Wyoming Voters Have to Pay for an Audience with Liz Cheney"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Rep. Liz Cheney as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 209,
    "mediaId": 209,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "As she fends off challenger <span class='selected-term'>Harriet Hageman</span> (an attorney who's backed by former President Donald Trump), the Wyoming Republican has actually broken yet another personal fundraising record, having brought in an impressive $2.94 million in the first quarter of 2022, Politico reports Monday.",
    "author": "Brigid Kennedy",
    "title": "Liz Cheney rakes in cash in fight against Trump-backed challenger"
  },
  {
    "id": 210,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The Wyoming Republican is fighting off a serious challenge from <span class='selected-term'>HARRIET HAGEMAN</span>, a Cheyenne attorney, and the Aug. 16 primary has turned into the most important and closely watched contest between the MAGA and traditional wings of the GOP.",
    "author": "",
    "title": "POLITICO Playbook: SCOOP: Liz Cheney's record fundraising haul"
  },
  {
    "id": 176,
    "mediaId": 151,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Thiel, a close Trump ally, earlier this year held a fundraiser for Wyoming Republican <span class='selected-term'>Harriet Hageman</span>, who is running to unseat GOP Rep. Liz Cheney, an outspoken Trump critic.",
    "author": "",
    "title": "Vance parlays Trump endorsement into new Thiel money"
  },
  {
    "id": 95,
    "mediaId": 33,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "And two congressional challengers whom Thiel has also supported -- Joe Kent in Washington and <span class='selected-term'>Harriet Hageman</span> in Wyoming -- have mounted competitive bids against incumbent Republicans who voted to impeach former President Trump.",
    "author": "Gabby Orr and Michael Warren",
    "title": "Peter Thiel plans to wind down his involvement in 2022 after Vance's victory in Ohio"
  }
]