[
  {
    "id": 700,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Cheney is up for reelection this November but will first have to face off against Trump-backed <span class='selected-term'>Harriet Hageman</span> in the GOP primary.",
    "author": "Mychael Schnell",
    "title": "RNC to debate Trump ally's resolution to expel Cheney, Kinzinger: report"
  },
  {
    "id": 675,
    "mediaId": 19,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "As Breitbart News reported in January, a Wyoming straw poll has Cheney losing to the Trump-backed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Paul Bois",
    "title": "Republican National Committee Will Vote Friday to Censure Liz Cheney, Adam Kinzinger"
  },
  {
    "id": 615,
    "mediaId": 151,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The move to withhold support for Cheney could benefit her primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "",
    "title": "GOP censures Cheney, Kinzinger, moves to pull out of debates"
  },
  {
    "id": 621,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Kinzinger is not running for reelection next year, while Cheney is fighting for her political life against a Trump-backed primary challenger in attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Tal Axelrod",
    "title": "RNC votes to censure Cheney, Kinzinger"
  },
  {
    "id": 623,
    "mediaId": 65,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The former president has endorsed Wyoming lawyer <span class='selected-term'>Harriet Hageman</span>, a former gubernatorial candidate who is primary challenging Cheney in the state's August GOP primary.",
    "author": "Paul Steinhauser",
    "title": "Republican National Committee overwhelming votes to censure Cheney, Kinzinger for sitting on Jan. 6 committee"
  },
  {
    "id": 624,
    "mediaId": 233,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Cheney is running for re-election via a Wyoming Republican primary against a Trump backed challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "David Jackson",
    "title": "GOP censures Reps. Liz Cheney and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'"
  },
  {
    "id": 625,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Romney, who tested positive for COVID-19 last week, is also set to participate in a fundraiser for Cheney in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Sarakshi Rai",
    "title": "Romney rips GOP censure effort against Cheney, Kinzinger"
  },
  {
    "id": 629,
    "mediaId": 165,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Washington Post reports that the Wyoming GOP has signed onto a letter allowing the national party to fund the campaign of Cheney's Trump-backed primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Ryan Bort",
    "title": "The Award for Political Euphemism of the Year Has Already Been Won"
  },
  {
    "id": 638,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Post also reported that GOP officials in Wyoming struck a deal with the national party to financially support <span class='selected-term'>Harriet Hageman</span>, a former RNC committeewoman who's been endorsed by Trump, in her primary against Cheney this year.",
    "author": "Bryan Metzger",
    "title": "RNC Chairwoman Ronna McDaniel says January 6 committee is a 'Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse'"
  },
  {
    "id": 653,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Perhaps even more significantly, leaders of the Wyoming Republican Party signed a letter calling Cheney's primary challenger, <span class='selected-term'>Harriet Hageman</span>, the presumptive nominee for the seat Cheney is running to retain.",
    "author": "Laura Clawson",
    "title": "Plan to censure Cheney and Kinzinger suggests Republicans are nervous about the Jan. 6 committee"
  },
  {
    "id": 654,
    "mediaId": 33,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Cheney's team also criticized a separate deal struck by Wyoming GOP chairman Frank Eathorne and the national party that would enable the RNC to fund Cheney's primary challenger, <span class='selected-term'>Harriet Hageman</span>, using a longstanding party rule known as Rule 11.",
    "author": "Gabby Orr",
    "title": "In censure of Cheney and Kinzinger, RNC calls events of January 6 'legitimate political discourse'"
  },
  {
    "id": 660,
    "mediaId": 129,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "G.O.P. Declares Jan. 6 Attack Legitimate Political Discourse'"
  },
  {
    "id": 662,
    "mediaId": 178,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "It sets in motion a way for the party to support Cheney's primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "SAM METZ Associated Press",
    "title": "GOP censures Cheney, Kinzinger as it assails Jan. 6 probe"
  },
  {
    "id": 665,
    "mediaId": 178,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "It sets in motion a way for the party to support Cheney's primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "SAM METZ Associated Press",
    "title": "GOP censures Cheney, Kinzinger as it assails Jan. 6 probe"
  },
  {
    "id": 667,
    "mediaId": 25,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "\"This is further proof that Liz Cheney has completely lost her ability to be effective in Congress for the people of Wyoming,\" <span class='selected-term'>Harriet Hageman</span>, the Trump-backed candidate running against Cheney, said in a statement.",
    "author": "Adam Brewster",
    "title": "RNC approves measure to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 602,
    "mediaId": 223,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "11\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize <span class='selected-term'>Harriet Hageman</span>, her challenger, as the party's presumptive nominee.",
    "author": "Rebecca Downs",
    "title": "Rule Change Means Liz Cheney's Primary Challenger Could Receive Financial Support"
  },
  {
    "id": 604,
    "mediaId": 151,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "On Wednesday, the committee received a letter signed by Republican Party leaders in Wyoming allowing the RNC to fund Cheney's primary challenger, <span class='selected-term'>Harriet Hageman</span>, an RNC official said.",
    "author": "",
    "title": "Trump's circular firing squad' threatens GOP midterm gains"
  },
  {
    "id": 570,
    "mediaId": 237,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "The Wyoming Republican Party Chair, Committeeman, and Committeewoman have signed a letter in accordance with the RNC's Rule No.11(a) to support the candidacy of <span class='selected-term'>Harriet Hageman</span> in the Republican Primary,? an RNC official said in a statement.",
    "author": "Emily Brooks",
    "title": "Wyoming GOP move to allow RNC to fund Cheney challenger spurs outrage"
  },
  {
    "id": 541,
    "mediaId": 223,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "Cheney, however, is facing a primary challenger, <span class='selected-term'>Harriet Hageman</span>, who was endorsed by former President Donald Trump last September and who may have an easier time getting financial backing thanks to a rule change.",
    "author": "Rebecca Downs",
    "title": "Some Laughably Irrelevant Figures Are Trying to Insert Themselves into the Liz Cheney Censure Conversation"
  },
  {
    "id": 500,
    "mediaId": 188,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "Cheney is seeking another term in office, but faces the added hurdle of competing against Trump-backed challenger <span class='selected-term'>Harriet Hageman</span> during the primary.",
    "author": "Alex Nitzberg",
    "title": "Former RNC chair Marc Racicot urges current chair Ronna McDaniel to pursue dismissal of recently approved censure resolution targeting Reps. Liz Cheney and Adam Kinzinger"
  }
]