[
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. Liz Cheney, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed <span class='selected-term'>Harriet Hageman</span> in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 77,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Trump has endorsed trial attorney <span class='selected-term'>Harriet Hageman</span> to challenge Cheney in the GOP primary this summer.",
    "author": "Cristina Marcos",
    "title": "The fates of the 10 House Republicans who voted to impeach Trump"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Cheney faces a Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 721,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: <span class='selected-term'>Harriet Hageman</span>, the leading Republican candidate challenging Rep. Liz Cheney as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid"
  },
  {
    "id": 699,
    "mediaId": 376,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "A Trump-backed opponent, <span class='selected-term'>Harriet Hageman</span>, raised $443,000 during the quarter and had $381,000 on hand Dec. 31.",
    "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
    "title": "House GOP feels no fundraising backlash for opposing electors"
  },
  {
    "id": 710,
    "mediaId": 33,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Among them: Rep. Jody Hice of Georgia, who voted against certifying the election on January 6 and is running in the Republican primary against Georgia Secretary of State Brad Raffensperger, who has defended the state's election results; and <span class='selected-term'>Harriet Hageman</span>, a Republican primary challenger to Wyoming Rep. Liz Cheney, who voted to impeach Trump for his actions on January 6 and is a member of the House select committee investigating the January 6 attack.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 63,
    "mediaId": 151,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "pulled in the most, with a staggering $2 million, nearly five times as much as challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "House Republicans close money gap in hunt for the majority"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\nLiz Cheney out-raises Trump-endorsed challenger <span class='selected-term'>Harriet Hageman</span>\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Her opponent, <span class='selected-term'>Harriet Hageman</span>, who has drawn the vociferous support of Mr. Trump and his family, raised $443,000 last quarter and has about $380,000 cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 672,
    "mediaId": 238,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "and moved to aid her primary opponent, <span class='selected-term'>Harriet Hageman</span>, who is former president Donald Trump's preferred candidate for Wyoming's lone congressional seat.",
    "author": "",
    "title": "Opinion: The Republican Party formally declares that truth is fiction and patriots are traitors"
  },
  {
    "id": 60,
    "mediaId": 237,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "History will be their judge.?\nWhile Kinzinger is retiring from Congress at the end of his term, Cheney faces a primary challenge from Trump-endorsed candidate <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Emily Brooks",
    "title": "Republican National Committee censures Liz Cheney and Kinzinger"
  },
  {
    "id": 615,
    "mediaId": 151,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The move to withhold support for Cheney could benefit her primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "",
    "title": "GOP censures Cheney, Kinzinger, moves to pull out of debates"
  },
  {
    "id": 620,
    "mediaId": 112,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The move to withhold support for Cheney could benefit her primary opponent, <span class='selected-term'>Harriet Hageman</span>, who has been endorsed by Trump.",
    "author": "Associated Press",
    "title": "A defining moment': Kinzinger says Republican National Committee censure of him and Cheney shows McCarthy's weakness as House leader"
  },
  {
    "id": 623,
    "mediaId": 65,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The former president has endorsed Wyoming lawyer <span class='selected-term'>Harriet Hageman</span>, a former gubernatorial candidate who is primary challenging Cheney in the state's August GOP primary.",
    "author": "Paul Steinhauser",
    "title": "Republican National Committee overwhelming votes to censure Cheney, Kinzinger for sitting on Jan. 6 committee"
  },
  {
    "id": 627,
    "mediaId": 675,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "There, however, the state party already has stripped her of party recognition and a straw poll among county GOP officials snubbed her recently, with six votes for Cheney and 59 for primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Bob Unruh",
    "title": "RNC votes to censure Cheney, Kinzinger over campaign against Trump"
  },
  {
    "id": 653,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Perhaps even more significantly, leaders of the Wyoming Republican Party signed a letter calling Cheney's primary challenger, <span class='selected-term'>Harriet Hageman</span>, the presumptive nominee for the seat Cheney is running to retain.",
    "author": "Laura Clawson",
    "title": "Plan to censure Cheney and Kinzinger suggests Republicans are nervous about the Jan. 6 committee"
  },
  {
    "id": 551,
    "mediaId": 129,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "They ended up choosing <span class='selected-term'>Harriet Hageman</span>, a Cheyenne land-use attorney and former Cheney adviser who was then a member of the Republican National Committee.",
    "author": "",
    "title": "Where's Liz Cheney? The Wyoming Republican's Exile From Wyoming Republicans"
  },
  {
    "id": 507,
    "mediaId": 21,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "AP Photo/Mead Gruver, File\nRepublican <span class='selected-term'>Harriet Hageman</span>, during a recent New York Times interview, couldn't say who won the 2020 presidential election.",
    "author": "John L. Dorman",
    "title": "Rep. Liz Cheney's leading GOP primary challenger says she doesn't know who lawfully won the 2020 presidential election"
  },
  {
    "id": 460,
    "mediaId": 195,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, the Wyoming Republican waging a primary challenge against Rep. Liz Cheney (R-Wyo.).",
    "author": "Tal Axelrod",
    "title": "McCarthy endorses Cheney primary challenger"
  },
  {
    "id": 463,
    "mediaId": 65,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy is endorsing <span class='selected-term'>Harriet Hageman</span> in her Wyoming primary challenge to Rep. Liz Cheney, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "author": "Kelly Phares",
    "title": "McCarthy backs Cheney challenger Hageman in Wyoming House Republican primary"
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, a primary challenger to GOP Rep. Liz Cheney of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 465,
    "mediaId": 593,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "McCarthy, who represents California, said in a statement he will back <span class='selected-term'>Harriet Hageman</span> in the Republican primary in Wyoming set for August.",
    "author": "Tyler Clifford",
    "title": "Top U.S. House Republican Endorses Cheney Challenger In Party Primary"
  },
  {
    "id": 467,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "McCarthy's endorsement of <span class='selected-term'>Harriet Hageman</span>'s bid against Cheney, a colleague and a member of his caucus, is a highly unusual intervention into a primary for a House party leader that also highlights the wide rift between McCarthy and Cheney.",
    "author": "Grace Panetta",
    "title": "House Minority Leader Kevin McCarthy endorses Liz Cheney's Trump-backed primary challenger"
  },
  {
    "id": 485,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Trending News\n U.S. proposes limiting consideration of public benefits for green cards\n Information warfare expert says U.S. is finally countering Russia at its own game\n Kevin McCarthy backs Liz Cheney's primary challenger <span class='selected-term'>Harriet Hageman</span>\n Russia expels U.S. embassy's second-in-command amid Ukraine tensions\n Intel arm of DHS defends office amid GOP senator's criticism\n Kathryn Watson\nKathryn Watson is a politics reporter for CBS News Digital based in Washington, D.C.",
    "author": "Kathryn Watson",
    "title": "All members of Congress can attend Biden's State of the Union, with COVID-19 restrictions"
  },
  {
    "id": 486,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Republican Minority Leader Kevin McCarthy has endorsed Congresswoman Liz Cheney's primary challenger in Wyoming, trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Robert Costa",
    "title": "House GOP Leader Kevin McCarthy backs Liz Cheney's primary challenger Harriet Hageman"
  },
  {
    "id": 454,
    "mediaId": 124,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "In a highly unusual move, House Minority Leader Kevin McCarthy on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, the Trump-backed candidate challenging Rep. Liz Cheney in the Wyoming Republican primary.",
    "author": "",
    "title": "House GOP leader McCarthy endorses Cheney challenger in Wyoming primary"
  },
  {
    "id": 456,
    "mediaId": 43,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "\"I am proud to endorse <span class='selected-term'>Harriet Hageman</span> for Congress,\" McCarthy said in a statement tweeted out by Hageman.",
    "author": "",
    "title": "Doing Trump's bidding, House GOP leadership endorses Liz Cheney's primary challenger"
  },
  {
    "id": 439,
    "mediaId": 112,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Associated Press\nA Cheney spokesperson was dismissive of the importance of McCarthy's endorsement of Cheyenne lawyer <span class='selected-term'>Harriet Hageman</span>: Wow, [Hageman] must be really desperate'\nWASHINGTON (AP)  House Republican leader Kevin McCarthy late this week endorsed a primary challenger to Rep. Liz Cheney, a remarkable step for a party leader that effectively lends his weight to the effort to purge a chief critic of former President Donald Trump's from Congress.",
    "author": "Associated Press",
    "title": "House Republican leader Kevin McCarthy backs primary challenger to Rep. Liz Cheney in Wyoming"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, <span class='selected-term'>Harriet Hageman</span>, whose central message is that Ms. Cheney should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 392,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Biden's low approvals worry Democrats campaigning in midterm elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs Liz Cheney's primary challenger <span class='selected-term'>Harriet Hageman</span>\n More\nIn:\ntexas\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "What to watch for in Texas' primary elections"
  },
  {
    "id": 368,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed <span class='selected-term'>Harriet Hageman</span> in her race against Rep. Liz Cheney in Wyoming.",
    "author": "",
    "title": "Elise Stefanik unveils new endorsements for 2022 midterm elections"
  },
  {
    "id": 363,
    "mediaId": 237,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "The paper noted that if the bill had become law, voters may not have known for certain who was running before having to register with a certain party.?\nSupporters of the bill, including Trump and attorney <span class='selected-term'>Harriet Hageman</span>, whom Trump has endorsed against Cheney in the primary, said it would have prevented Democrats and independents from changing their party registration on Election Day in order to vote in a Republican primary.",
    "author": "Kate Scanlon",
    "title": "Trump-backed Wyoming elections bill fails to pass, in boon to Liz Cheney"
  },
  {
    "id": 350,
    "mediaId": 409,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "The Trump-backed choice is <span class='selected-term'>Harriet Hageman</span>, a land-use attorney and former candidate for governor.",
    "author": "John Fund",
    "title": "Democratic Interlopers Could Diminish Trump's Clout in GOP Primaries"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Her main challenger in this race, <span class='selected-term'>Harriet Hageman</span>, went in the opposite direction: from fervent Never Trumper in 2016 to a fervent Trumper today.",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 297,
    "mediaId": 21,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to cohost a fundraiser for <span class='selected-term'>Harriet Hageman</span>, the leading primary challenger against GOP Rep. Liz Cheney, according to Politico.",
    "author": "John L. Dorman",
    "title": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger"
  },
  {
    "id": 299,
    "mediaId": 151,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans have signed on to host a fundraiser for <span class='selected-term'>Harriet Hageman</span>, who is waging a primary challenge to Cheney in Wyoming.",
    "author": "",
    "title": "More than 100 House Republicans to cohost fundraiser for Cheney challenger"
  },
  {
    "id": 289,
    "mediaId": 195,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Trump-backed primary challenger <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Max Greenwood",
    "title": "House GOP keeps Trump at arm's length as it hones midterm strategy"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "McCarthy has thrown his political weight behind <span class='selected-term'>Harriet Hageman</span>, a Trump-backed congressional candidate who is challenging Cheney in Wyoming -- an endorsement that earned him plaudits on the right, a key constituency in a potential future bid for the speaker's gavel.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 282,
    "mediaId": 223,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "You're not one of us anymore (via Daily Caller):\nHouse Minority Leader Kevin McCarthy said over 100 Republicans from Congress will be supporting Republican Wyoming Rep. Liz Cheney's primary opponent, <span class='selected-term'>Harriet Hageman</span>, in an exclusive interview with the Daily Caller.",
    "author": "Matt Vespa",
    "title": "Scores of Congressional Republicans Are Coming to Wyoming to Let Liz Cheney Know How Much She Sucks"
  },
  {
    "id": 255,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Dozens of House Republicans are expected to attend House Minority Leader Kevin McCarthy's fundraiser for Rep. Liz Cheney's Wyoming GOP primary opponent, <span class='selected-term'>Harriet Hageman</span>, on Wednesday evening in an increasingly bitter contest over fealty by party members to former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "Liz Cheney primary opponent fundraiser draws scores of GOP House incumbents"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for <span class='selected-term'>Harriet Hageman</span>, Rep. Liz Cheney's challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 249,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "And when Cawthorn attended a Wednesday night fundraiser for <span class='selected-term'>Harriet Hageman</span>, Rep. Liz Cheney's primary challenger, his own GOP colleagues spent some of the fundraiser, feet away, quietly joking at his expense, according to people in the room,? Politico's Olivia Beavers reports.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Cheney is charging ahead with a reelection bid despite that internal party pushback and a Trump-backed primary challenger, <span class='selected-term'>Harriet Hageman</span>, for whom more than 100 GOP members held a fundraiser last week.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 240,
    "mediaId": 19,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "But before we can defeat the Democrat socialists and communists at the ballot boxes  we first have to defeat the RINOS and grandstanders in the primaries.?\nMeanwhile, Cheney has a tough primary challenge against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>, who has earned the support of Rep. Kevin McCarthy and Republican megadonor Peter Thiel, who reportedly dubbed Cheney the ringleader? of the treasonous ten.?\nMcCarthy's decision to support Hageman mirrors the overall criticism of Cheney.",
    "author": "Wendell Husebø",
    "title": "40 Percent of House Republicans Who Voted to Impeach Trump to Exit Congress, Fred Upton the Latest"
  },
  {
    "id": 204,
    "mediaId": 136,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Trump endorsed attorney <span class='selected-term'>Harriet Hageman</span> last September in the race to unseat Cheney.",
    "author": "Jon Jackson",
    "title": "Trump's Fears About Liz Cheney Race May Be Coming True"
  },
  {
    "id": 212,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Trump, House Minority Leader Kevin McCarthy and GOP Rep. Elise Stefanik of New York, Cheney's replacement as House Republican conference chair, are backing one of her challengers, trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Aaron Navarro",
    "title": "Liz Cheney sets personal fundraising record ahead of August primary"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The most prominent member of this group is Rep. Liz Cheney, who faces Trump-endorsed attorney <span class='selected-term'>Harriet Hageman</span> and a few minor contenders in the August primary to serve as the sole representative for dark-red Wyoming.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "His fury at Wyoming Representative Liz Cheney, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 3130,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: An outside group chaired by Donald Trump Jr. is going up with a three-week long ad blitz in Wyoming in support of <span class='selected-term'>Harriet Hageman</span>, the Republican congressional candidate who with former President Donald Trump's backing is primary challenging GOP Rep. Liz Cheney.",
    "author": "Paul Steinhauser",
    "title": "Donald Trump Jr. takes aim at Cheney, supports Hageman in new ad running in Wyoming's GOP House primary"
  },
  {
    "id": 3124,
    "mediaId": 376,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "But Cheney remains formidable, with a powerful family name and more than a 6-1 cash-on-hand advantage as of March 31 over trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley\nNiels Lesniewski",
    "title": "Multiple threats mean there's no shortage of vulnerable House members"
  }
]