[
  {
    "id": 729,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Venture capitalist and Republican megadonor Peter Thiel on Wednesday hosted a fundraiser for Democrat-allied Rep. Liz Cheney's (R-WV) primary opponent, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Big Money Donor Peter Thiel Hosts Fundraiser for Liz Cheney's Primary Opponent, Harriet Hageman"
  },
  {
    "id": 725,
    "mediaId": 195,
    "date": "1/30/2022 12:00:00 AM",
    "sentence": "Cynthia Lummis refuses to say who she's for, but Donald Trump, whom she lavishly praises, says she's for his anti-Cheney primary candidate, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Albert Hunt",
    "title": "What do Republicans stand for?"
  },
  {
    "id": 702,
    "mediaId": 124,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And on the House side, Trump gave to <span class='selected-term'>Harriet Hageman</span>, who is running a primary challenge to Rep. Liz Cheney, R-Wyo.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Her opponent, <span class='selected-term'>Harriet Hageman</span>, who has drawn the vociferous support of Mr. Trump and his family, raised $443,000 last quarter and has about $380,000 cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 660,
    "mediaId": 129,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "challenger, <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "G.O.P. Declares Jan. 6 Attack Legitimate Political Discourse'"
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed <span class='selected-term'>Harriet Hageman</span>, a primary challenger to GOP Rep. Liz Cheney of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 436,
    "mediaId": 25,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "Last Thursday, just weeks after the RNC's resolution against Cheney and Kinzinger, House Republican Minority Leader Kevin McCarthy endorsed Cheney's primary challenger in Wyoming, trial attorney <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Robert Costa",
    "title": "Trump's GOP critics to gather in Washington with an eye on 2024 presidential race"
  },
  {
    "id": 424,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "3: The number of Trump-backed primary challengers speaking at the annual Conservative Political Action Conference this week including David Perdue, <span class='selected-term'>Harriet Hageman</span> and Kelly Tshibaka.",
    "author": "",
    "title": "Putin's Ukraine move raises new questions for Biden's presidency"
  },
  {
    "id": 429,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "In the final quarter of 2021, Cheney took in $2 millionbesting the haul of her Trump-backed challenger, <span class='selected-term'>Harriet Hageman</span>, by a whopping $1.6 million.",
    "author": "",
    "title": "Two Republicans who certified 2020 are winning money race against two"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, <span class='selected-term'>Harriet Hageman</span>, whose central message is that Ms. Cheney should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50: The number of House Republicans who attended a fundraiser last night for <span class='selected-term'>Harriet Hageman</span>, the Republican (who is endorsed by former President Donald Trump) challenging Wyoming GOP Rep. Liz Cheney, per NBC's Vaughn Hillyard.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 229,
    "mediaId": 19,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "McConnell and Cheney apparently believe the Wyoming member may lose her seat to Trump-endorsed <span class='selected-term'>Harriet Hageman</span>, a strong threat to the establishment Republican order in Washington, DC.",
    "author": "Wendell Husebø",
    "title": "Mitch McConnell Donates to Liz Cheney"
  },
  {
    "id": 206,
    "mediaId": 124,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The cash will likely all be needed as Cheney tries to fend off Trump-backed primary opponent <span class='selected-term'>Harriet Hageman</span>, who is hoping to unseat the incumbent by riding the former president's public disdain for her.",
    "author": "",
    "title": "Cheney capitalizes off national profile to raise $2.9 million in first quarter of 2022"
  }
]