[
  {
    "id": 751,
    "mediaId": 43,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "And soon the Earth was covered with plastic bags and aluminum cans and paper plates and disposable bottles and there was nowhere to sit down or walk, and Man shook his head and cried: Look at this Godawful mess'.? Art Buchwald\nECO-TWEET\nx\nThe green-light has been given for the massive ScotWind rollout\ng??????? 1st country in the g? to launch commercial scale opportunities for offshore wind power\nWorth 700m to g???????Gov &\nBillions more to supply chains & jobsg?g\nenough to power 8m g? in a country of 5m people pic.twitter.com/piMFfw5DVX\n Angus Robertson (@AngusRobertson) January 19, 2022\nSHORT TAKES\nMeet the anti-conservation Republican vying to unseat Liz Cheney\nRight-wing land-use attorney <span class='selected-term'>Harriet Hageman</span> is keen to export clean coal? from Wyoming and export Rep. Liz Cheney back to the private sector in the state's Republican primary next August.",
    "author": "",
    "title": "goes after Liz Cheney's seat"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Liz sadly belongs in an MSNBC or CNN news chair, not in Congress representing Wyoming,? Stefanik said in her endorsement statement for <span class='selected-term'>Harriet Hageman</span>.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "AUGUST 16\nStates holding primaries: Alaska, Wyoming\nKey races to watch: In Wyoming, Representative Liz Cheney, the most visible anti-Trump Republican in Congress, faces Trump-endorsed GOP activist <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  },
  {
    "id": 92,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "In Wyoming, Cheney is running for reelection against Trump-endorsed <span class='selected-term'>Harriet Hageman</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating in Delaware Underwater by 3 Points"
  }
]