{
  "id": 3293,
  "mediaId": 261,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac",
  "image": "https://www.gannett-cdn.com/presto/2020/06/25/PDTF/fac7a680-b741-40f9-991c-c90b4807a992-IMG_secondary_1_1_TAOVT80B_.JPG?crop=4715,2653,x0,y167&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/05/12/michigan-gop-governor-candidates-debate-mackinac/9749804002/",
  "sentiment": "0.0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boucher",
  "authorUrl": "https://www.freep.com/staff/5427986002/dave-boucher/",
  "termIds": [
    651,
    1682,
    1844,
    2002,
    2171,
    2298,
    3051,
    3075,
    3095,
    3099,
    308,
    428,
    2645,
    2791,
    3068
  ],
  "sentences": [
    "\"The Mackinac Policy Conference is pleased to welcome Michigan's Republican Gubernatorial hopefuls to Michigan's Center Stage as they present their vision for our state's future,\" Sandy K. Baruah, president and chief executive officer of the Detroit Regional Chamber, said in a statement.",
    "We look forward to the candidates for governor giving our attendees and a statewide audience their perspectives on Michigan's future beyond campaign soundbites.?\nEvery candidate invited to participate in the debate received at least 5% support in a recent poll conducted for the chamber.",
    "Dixon polled at less than 2%, despite being the only gubernatorial candidate named by former President Donald Trump during a recent visit to the state\nDixon earned the only praise among gubernatorial candidates when former President Donald Trump recently visited the state.",
    "In Michigan, gubernatorial candidates must submit nominating petitions with at least 15,000 signatures, but there are questions about the veracity of thousands obtained by the Craig and Johnson campaigns and an incorrect date that appeared on Dixon's nominating petitions.",
    "The chamber ultimately did not invite either of the two women running for the party's nomination to participate in the debate, instead opting to go by the most well-known and supported candidates among recently surveyed Republican primary voters.",
    "Only five of the 10 declared Republican candidates for governor were invited to participate in the Detroit Regional Chamber's primary debate, slated for early June at the organization's annual policy conference on Mackinac Island.",
    "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates James Craig, Perry Johnson, Ryan Kelley, Kevin Rinke and Garrett Soldano made the cut, according to a news release.",
    "But almost 43% of those surveyed said Trump's endorsement was not important in helping them decide their preferred candidate, despite 81% saying they had a favorable opinion of the previous president.",
    "The chamber indicated it may change the debate lineup if a candidate drops out, is disqualified from the ballot or if \"new, public, independent polling\" shows additional competitive candidates.",
    "Although almost 45% of those surveyed said they were undecided, former Detroit police chief Craig garnered the most support of those with a preferred candidate at 23%.",
    "The news comes the same day Republican candidates were set to square off in the first primary debate of the campaign season, hosted in Livingston County.",
    "The field is far from settled ahead of the Aug. 2 primary, but overcoming a substantial polling deficit at this point in the race could prove difficult.",
    "The party and chamber agreed to the questions in the poll and additional metrics used to set the debate field, according to the chamber's announcement.",
    "Bloomfield Hills businessman Rinke received 5.6%, Ottawa County realtor Kelley notched 5.4%, and Oakland County businessman Johnson obtained 5.2%.",
    "Craig, Johnson and Dixon all face challenges to the signatures collected by their campaigns to place their names on the primary ballot.",
    "But that means Tudor Dixon, Michael Brown, Donna Brandenburg, Ralph Rebandt and Michael Markey won't be onstage with their competitors.",
    "The poll was conducted by the Glengariff Group and surveyed 500 likely Republican primary voters between April 29 and May 1.",
    "Soldano, a Kalamazoo chiropractor who has frequently come in second in Republican primary polls, earned 8.2% support.",
    "The chamber worked with the Michigan Republican Party to set its debate lineup based on a poll it commissioned.",
    "The remaining candidates were invited to the conference, but not to take part in the debate.",
    "Contact Dave Boucher at dboucher@freepress.com or 313-938-4591.",
    "The margin of error was plus or minus 4.4 percentage points.",
    "The chamber's debate is scheduled for 4:30 p.m. on June 2.",
    "No other candidate earned more than 5% in the poll.",
    "Follow him on Twitter @Dave_Boucher1."
  ]
}