{
  "id": 10348,
  "mediaId": 8462,
  "date": "2022-03-29",
  "headline": "Ohio Democrat and Republican candidates for U.S. Senate discuss student debt, 2020 election in debate",
  "image": "https://www.thelantern.com/files/2022/03/eln_sen_rep_debates_JB_37-1.jpg",
  "link": "https://www.thelantern.com/2022/03/ohio-democrat-and-republican-candidates-for-u-s-senate-discuss-student-debt-2020-election-in-debate/",
  "mediaOutlet": "thelantern.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brody Serravalli",
  "authorUrl": "https://www.thelantern.com/author/brody-serravalli/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I think the colleges should be on the hook for a lot of this debt.”\nIn the Democratic debate, Harper pushed for broad student loan forgiveness, while U.S. Rep. Tim Ryan said the path forward involved de-emphasizing the need for every high school graduate to attend college, lowering interest rates on loans and increasing Pell Grants — subsidized grants from the U.S. government to help students pay for college.",
    "Much of the Democratic debate was consumed by a clash between Harper, the sole progressive in the race, and frontrunner Ryan — who received the Ohio Democratic Party’s official endorsement in February, according to a statement from the party’s chair, Elizabeth Walters.",
    "“The fact-checkers are actually helping spew and support lies, and we’ve got to be done with it.”\nBoth Republican and Democratic candidates discussed the Russia-Ukraine war during their debates, with each agreeing that the U.S. should not send troops to Ukraine.",
    "Similarly, Westerville-based businessman and Republican candidate Neil Patel said he would prefer the U.S. implement a “no-fly zone” — an area in which military planes are not allowed to fly — over Ukraine to prevent American troops from needing to be deployed.",
    "Key among the issues discussed during the Republican debate was the 2020 presidential election, with several candidates pledging to fight for a formal investigation into election fraud — which was disproved by fact checkers — if delivered to the Senate.",
    "“It gives candidates an opportunity to tell their stories, their visions for the state, and voters to actually have criteria for making decisions.”\nOne issue that candidates from both parties agreed on was the student debt crisis.",
    "Traci Johnson, Democratic candidate and Dublin-based IT executive, attacked Putin’s invasion of Ukraine, as well as his invasions of Georgia and the Ukrainian region of Crimea in 2008 and 2014, respectively.",
    "Republican State Sen. Matt Dolan took a similar position, pushing to expand Pell Grant eligibility to those attending trade schools and other non-academic professional training.",
    "Three Democratic candidates faced off in the morning, followed by seven Republicans in the evening, each vying for their respective party’s nomination to fill retiring Sen.",
    "“President Trump was absolutely right when he said, ‘It’s about our national sovereignty.’ If you don’t have a wall or a border, you don’t have a country,” Timken said.",
    "“We had some decorum and professionalism to it, without it being too stuffy, but it did bother me that we had so many interruptions about fact-checking,” Pukita said.",
    "The debates, hosted by the Ohio Debate Commission, presented candidates with questions submitted by voters from across the state ahead of the May 3 primary elections.",
    "Morgan Harper, a Columbus-based attorney running for the Democratic nomination, said the debate gave lesser-known candidates a chance to build rapport with Ohioans.",
    "“I like that because we don’t want to put our boys and girls to Ukraine right now, but we can support them financially, or weapons to give it to them,” Patel said.",
    "Republican candidate Mike Gibbons, a Cleveland-based entrepreneur, said he has family in the military and would not like to see them deployed for this conflict.",
    "The Republican candidates spent much of the debate sparring with moderator Karen Kasler, chief of the Ohio Statehouse News Bureau, rather than each other.",
    "Vance took issue with how his party has traditionally sidestepped the issue, saying Republicans need to actively address the root cause of the crisis.",
    "Intraparty tensions flared Monday as candidates in Ohio’s U.S. Senate race convened for two debates at Central State University in Wilberforce, Ohio.",
    "Ryan spent much of his time fending off Harper’s criticism over his history as a party insider and accepting campaign money from corporate donors.",
    "“It came from college administrators who sold a lot of students a bill of goods, who have inflated costs in the process,” Vance said.",
    "Mark Pukita, an IT entrepreneur running for the Republican nomination, took issue with Kasler’s frequent fact-checking.",
    "“I don’t think we should put any boots on the ground, any American boots on the ground in the Ukraine,” Gibbons said.",
    "Dolan was the only Republican candidate of the seven to acknowledge the legitimacy of President Joe Biden’s victory.",
    "“We need to have the Pell Grant be able to apply no matter what route you take to further your career,” Dolan said.",
    "Former Ohio Treasurer and Ohio State alumnus Josh Mandel said he firmly supports looking into this election.",
    "Republicans discussed immigration, with each candidate saying they would enforce stricter immigration laws.",
    "The Democratic candidates criticized Russian President Vladimir Putin’s decision to invade Ukraine.",
    "“One of the dumbest things we ever did was tell people everyone has to go to college,” Ryan said.",
    "Correction: This story previously stated Jane Timken is the chair of the Ohio Republican Party.",
    "Jane Timken, former chair of the Ohio Republican Party, said she endorses Trump’s border wall.",
    "“[Putin’s] gone basically unchecked, and we have to end his reign of terror,” Johnson said.",
    "“Let me be very clear here: Joe Biden is the legitimate president of the United States.",
    "For the Democrats, the debate marked the first time all three candidates met onstage.",
    "We cannot look forward or move forward until 2020 is investigated,” Mandel said.",
    "The election for the Ohio U.S. Senate seat will take place November 8.",
    "My problem is he’s a failed president,” Dolan said during the debate.",
    "“I think we’ve seen the power of debates,” Harper said.",
    "Republican candidate and venture capitalist J.D.",
    "Rob Portman’s seat in the November midterms.",
    "“We cannot move on from the 2020 election.",
    "She is the former chair."
  ]
}