{
  "id": 11627,
  "mediaId": 8413,
  "date": "2022-03-28",
  "headline": "Democrats running for Ohio U.S. Senate seat held their first debate. Here are 4 takeaways",
  "image": "https://www.gannett-cdn.com/presto/2022/03/28/NCOD/df6e018a-033d-45cd-9e52-657752741a75-eln_sen_dem_debates_JB_06.JPG?crop=8560,4815,x0,y419&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/congressional/2022/03/28/ohio-senate-race-democrats-hold-first-debate-head-primary/7132140001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    5443,
    1819,
    1489,
    392,
    259,
    875,
    1477,
    6474
  ],
  "sentences": [
    "You can watch the debate below:\nHaley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Differences over Ukraine\nRyan was the only candidate to say firmly that he would support the use of military force against Russia if a NATO ally is attacked in the war against Ukraine, invoking the alliance's defense pact.",
    "During Monday's debate, Harper attacked Ryan's previous \"A\" rating from the National Rifle Association and criticized him for taking money from defense contractors and other corporations.",
    "\"We need to tread lightly because if we expand the court as Democrats, then when Republicans come in, they'll expand the court, and then the court will lose its power,\" Johnson said.",
    "Student debt relief\nHarper said she supports canceling student loan debt and believes creating jobs in industries like clean energy can help people pay off what they have.",
    "Expanding the Supreme Court\nHarper called for the expansion of the U.S. Supreme Court, arguing Republicans have \"radicalized\" the court and left it in need of rebalancing.",
    "Ryan vs. Harper\nHarper spent much of her time Monday criticizing Ryan, who scooped up endorsements from key leaders and raised millions of dollars to propel his campaign.",
    "Democrats running in Ohio's U.S. Senate race met on stage for the first time Monday, highlighting rifts between the candidates after a heated party endorsement process.",
    "\"Are we going to continue to accept business as usual Washington special interest politics, or are we going to move toward the future together to really demand more?\"",
    "U.S. Rep. Tim Ryan, attorney Morgan Harper and tech executive Traci Johnson faced off at Central State University just weeks before the primary, slated for May 3.",
    "Ryan noted that many of those companies hire Ohio workers he wants to support, but he said he's spoken out against excess spending by the Department of Defense.",
    "\"How do we think we're going to outcompete China, grow the middle class, if we're strapping families with these huge amounts of debt?\"",
    "Ryan, for his part, argued people should pay off loans they take out but wants to allow people to renegotiate their interest rates.",
    "He said it's also important to invest in vocational training so people don't feel they must go to college to find work.",
    "Harper and her supporters contend the party needs a more progressive vision after years of Democratic losses in Ohio.",
    "He also called on the U.S. to help deliver planes Ukrainian President Volodymyr Zelenskyy has repeatedly requested.",
    "Seven Republicans running for the GOP nomination debated at Central State University later Monday.",
    "Ryan said eliminating the filibuster would address more of the problems in politics today.",
    "The three are vying for the Democratic nomination in the race to replace retiring Sen.",
    "Johnson said the court system should be examined but argued expansion goes too far.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"He’s a killer, he’s a war criminal and he’s slaughtering innocent people.\"",
    "\"We have a real decision to make right now as Ohioans,\" Harper said.",
    "Here are four takeaways from the Democrats' event.",
    "\"Putin is a butcher,\" Ryan said.",
    "Her opponents disagreed.",
    "Rob Portman.",
    "he said."
  ]
}