{
  "id": 11888,
  "mediaId": 8496,
  "date": "2022-03-28",
  "headline": "Ohio's Democratic, GOP candidates square off in U.S. Senate debates",
  "image": "https://media.wkyc.com/assets/WKYC/images/b56f97f0-3c59-462d-a17b-1f0ecf657c49/b56f97f0-3c59-462d-a17b-1f0ecf657c49_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/us-senate-democratic-republican-primary-debates/95-e259c688-5af7-4478-97fe-407a2a1909b6",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "She said Democrats will turn the U.S. into “a ditch.”\nFormer Ohio Treasurer Josh Mandel said, “Right now, what we need in Washington is to defeat the secular left, to defeat the radical left, to defeat Biden and (Senate President Chuck) Schumer and (House Speaker Nancy) Pelosi and save this country for our kids and grandkids.”\nGenerally, though, the candidates did more attacking of the moderator than of each other Monday — oftentimes, after a near physical altercation at one debate, concurring on or complimenting one another's answers.",
    "Watch the full debate:\nHere are some of the topics they discussed in the Democratic debate:\nWar in Ukraine\nUnited States Supreme Court\nVoting rights\nWhat they've done to qualify for the U.S. Senate seat\nEconomy and inflation\nStudent loan debt\nClimate change\nMorgan Harper is a 38-year-old progressive, Stanford-educated attorney who was a former senior policy adviser at the Consumer Financial Protection Bureau.",
    "“I think every time a lawyer goes into their office every day, they’re trying to figure out how to do something legally.”\nIn a race that Democrats see as one of their best chances nationally to flip a Senate seat, the Republican candidates described the contest as a fight to preserve American values that they believe are slipping, to protect U.S. security and to revive the economy.",
    "I want to go to Washington D.C. to help lead Ohio and lead this country.”\nWatch the full debate:\nA rundown of what happened during the debate:\nAll but one Republican seeking an open U.S. Senate seat in Ohio held fast to the disproven narrative Monday that the 2020 presidential election was either stolen from Donald Trump or fraught with irregularities, fraud or other problems.",
    "That’s why I want to be your next United States Senator, to make sure that we have Medicare for all, increase the minimum wage and protect our fundamental rights.”\nTraci \"TJ\" Johnson joined the race about two months, pledging to quell political division, address gun violence and fight for affordable wifi, voting rights and the environment.",
    "Cleveland investment banker Mike Gibbons said he does not believe recently discovered communications between Virginia Thomas, wife of Supreme Court Justice Clarence Thomas, and top aides to Trump are evidence of trying to inappropriately influence the 2020 election.",
    "Ohio has always been a leader in industry, service to the military, how we treat our veterans, research, manufacturing and so Ohio has to lead the way in bringing our supply chain back, taking on China, building the things that will build our future.",
    "What to know about the candidates:\nRepublican state Sen. Matt Dolan describes himself as a tough but pragmatic politician, adding a more centrist voice more like Portman's to a crowded, Trump-aligned field of GOP hopefuls.",
    "“I worry a little bit — and it's not about us, right, it's about voters — when you have a Republican debate and there's no Second Amendment question, there's no abortion question, there's no Big Tech question,” he said.",
    "When I got to Washington after the financial crisis working at the Consumer Protection Financial Bureau under the Obama administration, I started to understand why that has become less of a possibility than ever.",
    "Dolan is a partner in a Cleveland law firm, vice president of a business and real estate management firm, adjunct law professor and former assistant county prosecutor and assistant Ohio attorney general.",
    "“Because when he takes the time to look at all of us up on this stage and sees who's actually implemented the conservative Republican ideas that he brought to Washington, I've done it in Ohio,” he said.",
    "Ohio Public Radio's Karen Kasler pushed back during the 90-minute event, reminding audience members many of the claims they were hearing have been fact checked and found to be inaccurate.",
    "Last year, Harper presented veteran U.S. Rep. Joyce Beatty with her toughest competition in years, winning almost a third of the vote in Ohio's young, diverse 3rd Congressional District.",
    "Among author and venture capitalist JD Vance's items of 2020 concern were the large donations that Facebook founder Mark Zuckerberg and his wife gave to states for election operations.",
    "“My problem is he's a failed president.”\nDolan said he still holds out hope he can garner Trump's endorsement, which has become increasingly questionable as the May 3 primary nears.",
    "I started a successful information technology company and I invested the fruits to help my niece and nephews graduate from college because it takes a village to raise a family.",
    "We went through a lot early on, but with a strong community around us I was able to be in a position to get scholarships to go to Princeton University and Stanford Law School.",
    "His book, which was turned into a movie, tells his story of growing up in the struggling Ohio steel mill city of Middletown and his familial roots in Appalachian Kentucky.",
    "Candidate Matt Dolan, a Cleveland-area state senator, was the only one of seven candidates on the stage at Central State University not to embrace the allegations.",
    "Former Ohio Republican chair Jane Timken continued to tout her work on the ground in Ohio to elect Trump — who won the state by more than 8 percentage points.",
    "My mother was a passionate teacher, and after 30 years of service she retired and lived with me for 15 years until she passed away recently at the age of 91.",
    "It was the contentious, Trump-focused contest's first debate hosted by a mainstream journalist, who was tapped by the nonpartisan Ohio Debate Commission.",
    "Mark Pukita is the CEO and owner of Fast Switch, a company in Dublin that specializes in recruiting for information technology and healthcare services.",
    "“I don’t think questioning and trying to find a legal way of overturning the election is in any way treasonous, or even slightly illegal,” he said.",
    "After the event, Vance called the debate “pretty tame,” adding that it did not touch on a number of topics of interest to GOP primary voters.",
    "The Ohio Debate Commission is hosting a few debates this week, two of which come Monday for the candidates aiming to replace the seat of Sen.",
    "Gibbons and Mandel also got into a scuffle last week after the veteran accused Gibbons of \"making millions\" off stock in a Chinese company.",
    "The first debate was held from 11:30 a.m. to 12:30 p.m. with Democratic candidates Morgan Harper, Traci Johnson and Congressman Tim Ryan.",
    "“The Democrats are threatening the future of our country and I'm going to fight to make sure that we still have a country,\" said Timken.",
    "The Ohio elections chief identified 62 potential fraud cases from 2020 to authorities, a tiny fraction of nearly 6 million votes cast.",
    "As I watch the Republican primary debate, it is clear that they are unqualified to be able to address the issues we are facing today.",
    "For the past 20 years, I’ve been a ward community woman fighting for workers’ rights, a woman’s right to choose and justice reform.",
    "Patel's campaign claims to focus on the American worker, tax cuts and balancing the budget as well as constitutional rights.",
    "MORE HEADLINES:\nEditor's note: Video in the player above was originally published in a previous story on March 22, 2022.",
    "Gibbons is the former chairman of Ohio Strong Action, a conservative group that supports former President Donald Trump.",
    "He said his campaign will build on the experience and name recognition he gained after running unsuccessfully in 2018.",
    "We have to unify and uplift Ohio for a better tomorrow.”\nU.S. Rep. Tim Ryan announced his bid last year after Sen.",
    "That included, she said, catching a Democrat ballot harvesting, a case she referred to the state attorney general.",
    "His campaign will focus on common themes of economic freedom, individual liberty and the “America First” agenda.",
    "Jane Timken, the former chair of the Ohio Republican Party, describes herself as a \"conservative disruptor.\"",
    "This Senate race in Ohio is important to shift the national perspective on how we’re going to move forward.",
    "According to Pukita's campaign page, he is a constitutional conservative dedicated to \"beating the swamp.\"",
    "One final debate took place Tuesday night from 7-8:30 p.m. for candidates in the Ohio gubernatorial race.",
    "I lived in a foster home as an infant and then was adopted and raised by my mom, a public school teacher.",
    "That made me laser-focused on making sure -- just like I got -- that every Ohioan gets a fair shot.",
    "Opening debate statement: “I was born and raised in Toledo to a single mother with four children.",
    "JD Vance, known as the author of \"Hillbilly Elegy\", describes himself as a conservative outsider.",
    "Vance's campaign is focused on protecting conservative values and defending small businesses.",
    "“Let me be very clear: Joe Biden is the legitimate president of the United States,” he said.",
    "Neil Patel, of Westerville, is a businesses owner with companies in Ohio and West Virginia.",
    "That place has been infiltrated by special interest that prevented it from working for us.",
    "Opening debate statement: “We are at a very unique moment in the history of this country.",
    "We have to get people back to work so they can put more money in their pockets.",
    "Gibbons fired back, accusing Mandel of not understanding how investments work.",
    "Mike Gibbons, a pro-Trump Republican, is a former Cleveland investment banker.",
    "This week's debates are being held at Central State University in Wilberforce.",
    "The 43-year-old was the first statewide official who supported Trump in 2016.",
    "Portman said she is the best candidate to advance conservative policies.",
    "The debates are being held at Central State University in Wilberforce.",
    "During my journey as a caregiver, I remained a community activist.",
    "Josh Mandel is the state's former treasurer and a Marine veteran.",
    "Rob Portman, who decided not to run for another term and retire.",
    "Johnson is also a longtime Columbus activist and tech executive.",
    "Ryan has nearly two decades of experience in Washington D.C.",
    "Now Democrats, I know what’s at stake in this election.",
    "Rob Portman announced he would not run for reelection.",
    "I was the first in my family to graduate from college.",
    "Opening debate statement: “I was born in Columbus.",
    "We’re coming out of a global economic collapse.",
    "This is Mandel's third attempt at a Senate run.",
    "That’s going to happen right here in Ohio.",
    "WILBERFORCE, Ohio — Let the debate begin!",
    "Rob Portman who announced he will retire.",
    "Read on for a rundown of both debates.",
    "We’re coming out of a global pandemic.",
    "I’d appreciate your help and support.",
    "We have got to meet this moment.",
    "Things are messed up right now.",
    "At times, she was loudly booed.",
    "Timken has the backing of Sen.",
    "We have to defeat Trumpism.",
    "We have war in Ukraine.",
    "Given up for adoption."
  ]
}