{
  "id": 11957,
  "mediaId": 8494,
  "date": "2022-03-29",
  "headline": "Morning Headlines: Ohio Republicans abandon mapmakers' efforts on House, Senate maps... and more",
  "image": "https://npr.brightspotcdn.com/dims4/default/aeceb04/2147483647/strip/true/crop/1760x924+0+18/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F25%2Fe4%2Ffdbfd0c045b09c1cad1099716099%2Fredistrictcomm.png",
  "link": "https://www.wksu.org/2022-03-29/morning-headlines-ohio-republicans-abandon-mapmakers-efforts-on-house-senate-maps-and-more",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Eddings",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Tuesday, March 29th:\nOhio Republicans abandon the bipartisan process, approve own House, Senate maps\nDolan only GOP Senate candidate who says Trump lost in 2020\nRyan, Harper, spar over corporate donations in debate\nCavs beat Magic, lose Mobley to injury\nWeather: sunny, with rain later tonight\nOhio Republicans abandon the bipartisan process, approve own House, Senate maps\n(The Columbus Dispatch) - The Republican majority on the Ohio Redistricting Commission bypassed the work of two independent mapmakers and approved state legislative district maps of their own just hours before a court-imposed deadline.",
    "Ryan, Harper, spar over corporate donations in debate\n(Ideastream Public Media) – U.S. Rep. Tim Ryan and attorney Morgan Harper sparred over campaign contributions while political newcomer Traci Johnson sought to introduce herself to voters in an afternoon debate between the Democratic candidates for U.S. Senate at Central State University.",
    "Dolan only GOP Senate candidate who says Trump lost in 2020\n(AP) - False claims about the 2020 election dominated last night's debate between the seven Republican candidates for Ohio's open U.S. Senate seat.",
    "Commission co-chair and Senate president Matt Huffman (R-Lima) said he wanted a backup plan in place since independent mapmakers were unlikely to complete their work before the deadline.",
    "Cavs beat Magic, lose Mobley to injury\n(NBA.com) - The Cleveland Cavaliers snapped a three-game losing streak, edging the Orlando Magic, 107 – 101, at RocketMortgage Fieldhouse.",
    "Weather: sunny, with rain later tonight\n(National Weather Service) - Sunny today, a high of 37 for Cleveland, 41 degrees for Akron, and 40 degrees for Elyria.",
    "Republicans are hoping that, through an ongoing lawsuit in federal court, they will be able to bypass Ohio’s highest court and get the maps installed.",
    "Sen. Vernon Sykes (D-Akron) said the redistricting process had been “hijacked.” The Ohio Supreme Court will review the latest maps.",
    "Six of the seven candidates agreed with the lie that the election was riddled with fraud and stolen from former President Trump.",
    "Only State Senator Matt Dolan of Chagrin Falls acknowledge Joe Biden as the legitimate president.",
    "Dolan says his opponents on the debate stage were too focused on getting Trump's endorsement.",
    "Harper criticized Ryan for taking money from defense contractors and other corporations.",
    "Ryan said those contractors and businesses provide thousands of jobs for Ohioans.",
    "Wendell Carter Jr. was the high scorer for Orlando, with 15 points.",
    "The Cavs lost rookie man Evan Mobley to a sprained left ankle.",
    "Darius Garland led both teams with 25 points and 12 assists.",
    "Less than half an inch of snow accumulation is expected.",
    "He left the game before intermission and did not return.",
    "Rain, perhaps mixed with snow, tonight.",
    "Low around 32 in Cleveland."
  ]
}