{
  "id": 12413,
  "mediaId": 8498,
  "date": "2022-03-29",
  "headline": "Ohio Democratic hopefuls for Senate cover Supreme Court, Ukraine at Central State University debate",
  "image": "https://woub.org/wp-content/uploads/2022/03/eln-sen-dem-debates-jb-06-scaled-e1648571766596.jpg",
  "link": "https://woub.org/2022/03/29/ohio-democratic-hopefuls-for-senate-cover-supreme-court-ukraine-at-central-state-university-debate/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Castele | WCPN",
  "authorUrl": "https://woub.org/post_author/nick-castele-wcpn/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Ohio has always been a leader in industry, in service to the military, in how we treat our veterans, research, manufacturing,” Ryan said, “and so Ohio has to lead the way in bringing our supply chain back, taking on China, building the things that will build our future.”\nModerator Curtis Jackson of Spectrum News began the debate with Russia’s invasion of Ukraine.",
    "“And we need to be honest about the fact that that is happening, and that it no longer represents the majority of the will of the people living in the state of Ohio or across this country.”\nRyan and Johnson said they don’t support adding Supreme Court seats.",
    "The brisk midday debate saw Congressman Tim Ryan making workers the focus of his remarks while he tried to fend off challenges from Morgan Harper, who emphasized her experience as an attorney and senior advisor with the Consumer Financial Protection Bureau.",
    "0+1\n0Like\n0Share\n< < Back to\nWILBERFORCE, Ohio (ideastream) — Ohio’s three Democratic candidates for U.S. Senate met for a debate hosted by the Ohio Debate Commission at Central State University on Monday.",
    "“But I want you to know, from the bottom of my heart, that I want to be your next United States senator.”\nJohnson grew up in Toledo and has served as a ward committee woman in Franklin County.",
    "He asked candidates how they would respond if President Joe Biden requested permission from Congress to use military force against Russia in the event that a NATO ally is attacked.",
    "“To the workers of the state of Ohio, I want you to know very clearly: I stand on your side, and I don’t need to take money from management to do that,” Harper said.",
    "“We now have an institution of our government, the Supreme Court, that has been radicalized by the GOP that has pushed through these confirmations,” Harper said.",
    "“You want to bring jobs to Ohio and the United States, I’ll be your biggest friend.”\nBoth Ryan and Harper said they support scrapping the filibuster.",
    "That proposal has divided Democrats who are now wrestling with the reality of a 6-3 majority of Republican nominees on the high court.",
    "Even as they fielded questions about Ukraine and, later, the U.S. Supreme Court, Ryan and Harper sparred over campaign contributions.",
    "Ryan replied that the defense industry supports thousands of jobs in Ohio, and that he would work with those businesses.",
    "“This is my first time on a debate stage, this is my first time ever having an experience like this,” Johnson said.",
    "“You need somebody that’s going to listen to you and then go to Washington and work on your behalf,” she said.",
    "Businesswoman Traci “T.J.” Johnson stayed out of that fray while introducing herself to a statewide audience.",
    "“If you want to take jobs out of Ohio and out of the country, I’ll be your worst enemy,” he said.",
    "Receiving few mentions at the Democratic debate were the seven Republicans vying for the office.",
    "In his opening statement, he said Ohio’s Senate race could shift the national conversation.",
    "She has worked in state government and is president of an IT firm in the Columbus area.",
    "Rob Portman has left an open race to fill his seat in this year’s midterm elections.",
    "Harper criticized the congressman for accepting donations from defense contractors.",
    "Harper endorsed the idea of expanding the U.S. Supreme Court beyond nine justices.",
    "This was Johnson’s first TV debate, a point she made in her closing remarks.",
    "The winners of each primary will face each other on the ballot in November.",
    "Johnson said the legislative maneuver should be reformed or eliminated.",
    "We don’t need any arguing.”\nThe looming retirement of Republican Sen.",
    "Ryan has represented the Mahoning Valley in Congress since 2003.",
    "Harper said she’d be willing to consider it.",
    "Ryan said he would grant that request.",
    "“We don’t need any more divisiveness.",
    "We don’t need any more debating."
  ]
}