{
  "id": 13515,
  "mediaId": 8379,
  "date": "2022-03-20",
  "headline": "The Spectrum: Races for Attorney General, Senate",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2021/07/snapshot-2.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/the-spectrum/the-spectrum-races-for-attorney-general-senate/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colleen Marshall",
  "authorUrl": "https://www.nbc4i.com/author/colleen-marshall/",
  "termIds": [
    3235,
    1489,
    392,
    6077,
    6474,
    6164
  ],
  "sentences": [
    "On the all-star roundtable, President and CEO of Innovation Ohio Desiree Tims and Republican strategist Mark Weaver weigh in on what to expect as the Republican candidates for U.S. Senate meet on the debate stage for the first time Monday, the upcoming State of the State address from Gov.",
    "COLUMBUS, Ohio (WCMH) – This week on The Spectrum:\nFelony homicides, financial crimes, drug cartels, voter fraud and public corruption, all investigated by the Ohio Attorney General, and Ohio voters will decide this year who belongs in that office.",
    "Three Democrats are on the ballot in the primary race for United States Senate: Consumer protection attorney Morgan Harper, Youngstown area Congressman Tim Ryan, and a Franklin County community activist, Traci Johnson.",
    "Johnson said she has been active in Democrat politics for three decades and is ready to come from behind the scenes to a prominent place on the ballot, and eventually the U.S. Senate.",
    "Both are unopposed in the May primary, and both have very different views of what is sure to be a hot topic for a number of statewide campaigns: the House Bill 6 corruption scandal.",
    "Republican Attorney General David Yost is running for reelection, and he will be challenged in the fall by Democrat Jeff Crossman, a state representative from the Parma area.",
    "Mike DeWine, and the expanding role of the United States in the war in Ukraine."
  ]
}