{
  "id": 13592,
  "mediaId": 8497,
  "date": "2022-03-16",
  "headline": "Commitment 2022: Morgan Harper campaigning for US Senate",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap22028073719062.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/commitment-2022-morgan-harper-campaigning-for-us-senate/39398850",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    2736,
    2290,
    1819,
    392,
    1489,
    6077,
    6474
  ],
  "sentences": [
    "Harper hits at him for accepting PAC money and tells voters he represents the status quo while she's about progressive action and a new way of thinking about the problems of housing, health care, and education.",
    "\"I have committed to not take any money from corporations in the form of corporate PAC's which are bribes of our politicians in Washington, that I am not going to be a career politician.",
    "She is relying on everyday folks she meets to spread the word about her, her positions on the issues, and her campaign to go against the established grain.",
    "However, she has been showing signs of changing that as she travels the state presenting herself as a true progressive who wants to upset the applecart.",
    "\"And we need to have people that are unbought, unafraid, standing up for Ohioans to guarantee opportunity just like I got so early in my life.\"",
    "Harper has received more notice and media attention by engaging in debates with Josh Mandel, one of the Republican primary candidates.",
    "\"The possibility of my story being every child's story is slipping away for so many people in Ohio\", she stated with earnest fervor.",
    "Five of them are battling it out in the Republican primary while Democrats will choose between two very different hopefuls.",
    "COLUMBUS, Ohio —\nSeven candidates hope to become Ohio's next U.S. senator to fill the seat being vacated by Rob Portman.",
    "She takes every opportunity to point out that he has been a part of the elected political scene for 20 years.",
    "\"We need to be electing people like myself who have always been on the side of working people,\" she said.",
    "And once I identified that, I've been on a mission ever since then to make sure that every kid gets it.\"",
    "It calls for debt-free education and cutting property taxes for seniors, among numerous other things.",
    "She is the daughter of a Trinidad immigrant who got financial aid to earn an Ivy League education.",
    "Of the two, Tim Ryan is the most well-known in party circles and has the state party endorsement.",
    "She is proudly pro-choice and says she won't be blown off-course by shifting political winds.",
    "Harper is running hard, right down to the Nike footwear that fits her don't-ignore-me style.",
    "\"And at the root of it was one parent with a solid job, a strong community around us.",
    "She is running behind in fundraising and in polling but not in energy or enthusiasm.",
    "Harper hammered at special interests like the NRA, saying they distort the issues.",
    "And we need to make sure that we are ensuring and guaranteeing that opportunity.",
    "Her contention is that Ryan has had his time and failed to make the most of it.",
    "She has laid out in full what she labeled an \"Ohio Opportunity Guarantee.\"",
    "In a recent interview, she drew a sharp distinction between her and Ryan.",
    "Harper is a progressive in a state that doesn't lean that way.",
    "But her running shoes suggest she's in the race to win it.",
    "She served in Consumer Protection during the Obama years.",
    "\"You know, in many ways, we don't have a policy problem.",
    "The other candidate, Morgan Harper, is not as known.",
    "We have a politician problem,\" she tells us.",
    "\"It's Our Turn,\" her website states.",
    "That's what the people want.\"",
    "\"Morganize Your Community.",
    "That is all that it takes.",
    "Self-imposing term limits.",
    "And Turn Up.\""
  ]
}