{
  "id": 14208,
  "mediaId": 2658,
  "date": "2022-03-15",
  "headline": "Elizabeth Warren’s anti-crypto crusade splits the left",
  "image": "https://static.politico.com/7f/4c/68ed14bd4914b44182ba525a4166/ap22067783166596.jpg",
  "link": "https://www.politico.com/news/2022/03/15/democrats-divided-crypto-future-00015804",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We are already seeing some of the hopeful, optimistic possibilities in cryptocurrency,” Sen. Cory Booker (D-N.J.) said at a hearing last month, calling it a “democratizing” force that offers “a lot of hope.”\nMorgan Harper, a former senior adviser at the Consumer Financial Protection Bureau, an agency devised and launched by Warren, has touted crypto’s potential economic benefits for Ohio residents as she runs for the Democratic nomination in the state’s U.S. Senate race.",
    "... People are taking a parochial interest because while all of us sense we won’t know exactly what it will look like, there’s going to be jobs associated with this technology.”\nTorres, a freshman member of the Congressional Progressive Caucus, said New York City — which he represents — should embrace crypto if it wants to remain the financial capital of the world.",
    "However, substituting an unregulated, unverified system in which scammers and cheats and terrorists mix in with ordinary consumers and no one can tell who’s on the other side of a transaction is not a safe substitute.”\nThe clash can be explained in part by cryptocurrency’s growing influence in Washington and in members’ districts.",
    "Sen. Elizabeth Warren of Massachusetts — who has long led the left’s charge to crack down on banks and Wall Street — has emerged as one of the party’s most vocal cryptocurrency critics, warning that it exposes consumers to danger, is ripe for financial crimes and is an environmental threat because of its electricity usage.",
    "The emerging enthusiasm for crypto among many Democrats is in stark contrast to the views of senior progressive lawmakers such as Warren, Senate Banking Chair Sherrod Brown (D-Ohio) and Rep. Brad Sherman (D-Calif.), who have been ratcheting up criticisms about risks to consumers and the financial system.",
    "“It’s fair to say there’s different perspectives on how to handle the space overall,” said Rep. Josh Gottheimer (D-N.J.), who has authored industry-supported legislation that would establish rules for cryptocurrency known as stablecoins, whose value is tied to an underlying asset like the dollar.",
    "“Congress, which has a new generation of legislators, should have the final word.”\nA number of Democrats are focused on the possible opportunities crypto may have in reaching Americans — particularly people of color — who have traditionally been overlooked by the banking system.",
    "Crypto watchers got a preview of the split last year, when Democrats including Senate Finance Chair Ron Wyden of Oregon fought to scale back a tax provision in what became Biden’s bipartisan infrastructure law that imposed new reporting requirements on virtual currency trading.",
    "A survey commissioned late last year by venture capital giant Andreessen Horowitz — a major investor in crypto startups — found that 30 percent of Black Americans and 27 percent of Hispanic Americans said they owned cryptocurrency, compared to 20 percent of Americans overall.",
    "Torres said crypto and the underlying blockchain technology “have the potential to lead to a better and cheaper and faster payments system” that could, for example, help a Dominican immigrant in his South Bronx district send remittances with minimal fees and delays.",
    "Rep. Jim Himes (D-Conn.) said the crypto industry has become big enough that “some of us are taking a parochial notice of these businesses.” He cited the decision by Digital Currency Group — a so-called crypto conglomerate — to move its headquarters to his state.",
    "Questions around how to police digital currency and whether to support its adoption are driving a rift not just between the party’s liberal and centrist wings but also among progressives who often see eye-to-eye on financial regulation.",
    "He said regulation should be “surgical” and that significant moves by federal agencies without direction from Congress would be a “power grab.” There’s a “kind of anti-crypto xenophobia” among some regulators and lawmakers, he said.",
    "Warren, who has been looking at developing a comprehensive crypto bill, has recently warned that Russian leaders and billionaires may use digital currency to evade sanctions imposed after the invasion of Ukraine.",
    "Separately, Democratic lawmakers have started to draft a host of crypto regulation bills that are also exposing a wide range of views on the government’s role in the $1.7 trillion market for digital assets.",
    "President Joe Biden last week asked federal agencies to start solidifying the federal government’s approach to crypto, framing the step as supportive of innovation rather than an industry crackdown.",
    "“There’s a reason that crypto takes hold in some areas because the banks have continued to impose fees on transactions at a time when the cost of transactions should be dropping fast.",
    "The lack of consensus among Democrats means it’s unlikely Congress will act anytime soon to pass major legislation laying out the direction of regulation of the new market.",
    "They’re arguing against regulations that could stifle what proponents say is a new avenue for financial inclusion and a breakthrough alternative to traditional banks.",
    "She has argued that a decentralized financial system like the one powering crypto could be better for consumers than a system dominated by intermediaries like banks.",
    "... There’s more to crypto than ransomware, just like there’s more to money than money laundering.”\nThe simmering conflict is set to intensify in the coming months.",
    "“The project of radically decentralizing the internet and finance strikes me as a profoundly progressive cause,” Rep. Ritchie Torres (D-N.Y.) said in an interview.",
    "“The future of finance and the internet should not be left to a gerontocracy of regulators who appear to be on a personal crusade against crypto,” Torres said.",
    "Among local leaders, Mayor Eric Adams is one of the country’s most outspoken crypto backers — going as far as converting his salary into Bitcoin and Ether.",
    "It comes as crypto startups have set up shop across the country, with state and local leaders seeking to become the home for the businesses and the jobs.",
    "Warren led a letter to Treasury on the issue earlier this month and was joined by Brown, Sen. Mark Warner (D-Va.) and Sen. Jack Reed (D-R.I.).",
    "| J. Scott Applewhite/AP Photo\nBy Zachary Warmbrodt\n 03/15/2022 04:30 AM EDT\nDemocratic lawmakers are entering a crypto collision course.",
    "Treasury officials also say there’s been little evidence of Russians using the relatively small crypto market to sidestep sanctions.",
    "“The banks have not served the American public well,” Warren told reporters when asked if she sees any societal benefits to crypto.",
    "The industry is amassing an army of lobbyists and recruiting former Democratic lawmakers and regulators to advance its cause.",
    "But a new generation of progressives — and a number of other senior Democrats — are embracing the startup industry.",
    "It’s Warren’s latest attempt to highlight what she and other opponents see as a lack of regulation in the market.",
    "“But there are a lot of other people like me who are in learning mode.”\nSam Sutton contributed to this report.",
    "“We have some people in Washington who are already elected who have their views,” she said in an interview.",
    "Some Democrats and lobbyists had expected initial votes early this year, but that timeline has slipped.",
    "Sen. Elizabeth Warren joins Democratic senators for a weekly policy lunch at the Capitol on March 8.",
    "“There’s all kinds of well-funded cryptocurrency businesses popping up all over the country.",
    "“You should never define any technology by its worst uses.",
    "The industry counters that the risk is being overhyped.",
    "The price of Bitcoin surged on the news.",
    "“I’m not alone,” he said."
  ]
}