{
  "id": 17655,
  "mediaId": 8323,
  "date": "2022-02-28",
  "headline": "Ohio Senate poll: Gibbons over Mandel in GOP; Ryan dominates Democratic field",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/02/mike-gibbons-closeup.jpg?w=1280",
  "link": "https://fox8.com/news/ohio-senate-poll-gibbons-over-mandel-in-gop-ryan-dominates-democratic-field/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/?post_type=profile&p=455963",
  "termIds": [
    0
  ],
  "sentences": [
    "“Our numbers in the Republican Senate race show that there’s no clear frontrunner at this point,” Holloway said, with Gibbons and Mandel on top and “a couple of other candidates that are still kind of in that conversation.”\n“With a plurality of voters still undecided,” she said, “it’s clear that any of these candidates could make a move in the next two months.”\nMandel, the GOP nominee in 2012, has enjoyed good name recognition and has associated himself strongly with former President Donald Trump, but Gibbons’ blitz of TV ads since last year attacking other candidates and claiming he’s the most pro-Trump candidate could be helping him.",
    "“As we get closer towards the election, we use a higher sample size, which allows our margin of error to become smaller.”\nRyan would survive the Democratic race’s error margin, while a high margin in the close Republican race makes the nomination more up for grabs.",
    "The Emerson/FOX8 poll of Ohio’s 15th Congressional District race two weeks before last November’s election gave Republican Mike Carey an 11.1-point lead over Democrat Allison Russo with more than 1 in 10 voters still undecided.",
    "About this poll\nBetween Feb. 25 and 26, Emerson College Polling surveyed 723 likely voters – 313 for the Democratic primary and 410 for the Republican primary – using text-to-web, an online panel and automated phone calls.",
    "COLUMBUS, Ohio (WCMH) – In Ohio’s primaries for U.S. Senate, an independent poll commissioned by FOX8 News, finds a new leader in the crowded Republican race and a solidified frontrunner on the Democratic side.",
    "The polling results are brought to you by the Hill, Emerson College and your local election headquarters\nIt shows Gibbons, a Cleveland banker, with 22%, ahead of Mandel, a former state treasurer, with 15%.",
    "“The margin of error is higher because you’re dealing with such a small subset and we’re looking a couple of months out from the election,” Emerson’s director of survey operations Isabel Holloway said.",
    "Columbus lawyer Morgan Harper, who lost the Democratic primary Joyce Beaty in 2020 for Ohio’s 3rd Congressional District and has been seen as Ryan’s top opponent, finished last in Emerson’s poll.",
    "“Mandel has a lot of money and will throw a lot of money into this race.”\nOn the Democratic side, Beck described Ryan as the “hands-down favorite” with “fragmented” opponents.",
    "“There’s nobody who’s rising up there who looks like they are going to be able to position themselves to knock him off.”\nHow reliable is Emerson College?",
    "Mike Gibbons has leapfrogged longtime frontrunner Josh Mandel for the GOP nomination, per a late February survey by Emerson College pollsters.",
    "His 31% trumps three other candidates with at most 9%, although more than half of voters remain undecided two months from the May 3 election.",
    "Poll tracking website FiveThirtyEight gives them an overall A-minus after analyzing 201 polls from 2013 through the 2020 election cycle.",
    "As for Democrats, Youngstown area Congressman Tim Ryan is confirmed as the frontrunner in the first independent poll of that race.",
    "Two other independent polls of the race, both from the Trafalgar Group in December and February, had Mandel with an obvious lead.",
    "“That effect should diminish over time,” however, Ohio State University political science professor emeritus Paul Beck said.",
    "Joining her in the single digits are Columbus activist Traci Johnson and former Columbus social worker LaShondra Tinsley.",
    "The Republican question has a 4.8-point margin of error, and the Democratic question has a 5.5-point margin of error.",
    "That means a candidate could theoretically lose or gain 9.6% or 11%, respectively, if the poll were done again.",
    "Ryan, meanwhile, already has the endorsement of current Democratic Ohio U.S. Sen. Sherrod Brown.",
    "Results were weighted by gender, age, education, race and region based on 2020 election turnout.",
    "The most recent Trafalgar poll, though, showed Gibbons and Matt Dolan gaining on Mandel.",
    "“He has to be heartened by the fragmentation of the opposition to him,” Beck said.",
    "Carey won by 16.6 points, a result within the poll’s 4.6-point error margin.",
    "And a Co/Efficient poll in February gave Gibbons a slight edge on Mandel.",
    "Election implications\nGibbons is a new top candidate on Republican side.",
    "Monday’s Emerson poll indicates the nomination is there for the taking.",
    "Emerson has a long track record as a reliable, impartial pollster.",
    "They’re followed by six other candidates with at most 8%.",
    "Nearly 4 in 10 voters, however, are still undecided."
  ]
}