{
  "id": 1982,
  "mediaId": 2547,
  "date": "2022-02-07",
  "headline": "'Disturbing The Peace' Contest From Blue America",
  "image": "https://crooksandliars.com/files/primary_image/22/02/415_disturbing_the_peace_record_contest.png",
  "link": "https://crooksandliars.com/2022/02/disturbing-peace-contest-blue-america",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Howie Klein",
  "authorUrl": "https://crooksandliars.com/team/howie-klein",
  "termIds": [
    0
  ],
  "sentences": [
    "I asked each of these candidates to tell me who their favorite band or musician is:\nShervin Aazami (CA)- New Order\nSergio Alcubilla (HI)- The Temptations\nJason Call (WA)- Pink Floyd\nAlly Dalsimer (VA)- Carol King\nMelanie D'Arrigo (NY)- Smashing Pumpkins\nChris Deluzio (PA)- Lady Gaga\nCristina Garcia (CA)- Cyndi Lauper\nAlan Grayson (FL)- Joni Mitchell\nMorgan Harper (OH)- Lauryn Hill\nSteve Holden (NY)- U2\nLourin Hubbard- Kendrick Lamar\nAlexandra Hunt (PA)- Imagine Dragons\nDaniel Lee (CA)- Prince\nTom Nelson (WI)- AC/DC\nChristine Olivo (FL)- Janet Jackson\nMike Ortega (CA)- Pink Floyd\nChris Preece (IN)- Iron Maiden\nKylie Taitano (CA)- the Postal Service\nNeal Walia (CO)- Mos Def\nSome of these candidates are active fans of these artists.",
    "Since every candidate on the page supports the Green New Deal, Medicare for All, racial justice reform, women's choice and the other issues Blue America stands for, the way we're asking you to pick a candidate is based on... their favorite musical artist!",
    "One more thing, if you want to enter the contest but you're short on cash, just send a postcard and say you want to be entered in the 415 contest to:\nBlue America\nPO Box 27201\nLos Angeles, CA 90027\nYou'll have the same chance as anyone else to win.",
    "Also, life really is for learning, as Joni said in ‘Woodstock.’\"\nIf there's one candidate who talks to me more about musical performers than Grayson, it's another Senate candidate, Tom Nelson in Wisconsin, a huge AC/DC fan.",
    "Blue America wants to reward those who do: with a chance to win an autographed book, Disturbing the Peace-- 415 Records And The Rise of New Wave, and a companion CD, 415 Records-- Still Disturbing The Peace, to boot.",
    "The candidate who gets the most contributions-- not the most money necessarily, the most contributions-- wins the $1,000 check with a note saying it came to them because of you.",
    "I know that sounds different, but... since they are already all excellent candidates politically, why not pick one based on what you can glean about their choice of music.",
    "When I asked him why he picked her as his favorite artist, he said \"I’ve looked at life from both sides, now-- Joni Mitchell gave me an early warning.",
    "Meanwhile, your name gets entered in a drawing and next Monday we'll randomly pick two people to win a pack of a book and a CD each.",
    "And, on top of that, the candidate of your choice will get a $1,000 check from Blue America for their campaign.",
    "Florida Senate candidate Alan Grayson, for example, basically knows every word of every Joni Mitchell song!",
    "\"The good lord made the world with four elements and AC/DC made rock'n'roll with three chords.",
    "The contest ends next Monday at noon (your time), Valentine's Day-- that's February 14.",
    "Just contribute to the campaign of the candidate you like best on this page?.",
    "So... ready for a contest at the nexus of politics and pop culture?",
    "OK, so one more time: here's the page where you enter the contest.",
    "There are two books and two CDs, doubling your chance to win.",
    "He's been talking about her to me for almost 2 decades!",
    "You can find a copy of our general contest rules here.",
    "It needs to get to us by Monday, Feb. 14.",
    "Just \"vote\" one time per e-mail address.",
    "Do you support Progressive candidates?",
    "You can see, he's serious.",
    "Both were masterpieces.\"",
    "And here's the... quirk.",
    "But send it right away.",
    "Any amount is fine.",
    "Here's how to play."
  ]
}