{
  "id": 2195,
  "mediaId": 8491,
  "date": "2022-02-08",
  "headline": "Morgan Harper campaigns in Youngstown for Senate seat",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/morgan-harper.jpg?w=1280",
  "link": "https://www.wkbn.com/news/elections/morgan-harper-campaigns-in-youngstown-for-senate-seat/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stan Boney",
  "authorUrl": "https://www.wkbn.com/author/stan-boney/",
  "termIds": [
    0
  ],
  "sentences": [
    "He has collected more campaign cash, corporate PACs, lobby money than almost any other member of Congress.”\nAccording to the Tim for Ohio campaign, in the last quarter, Congressman Ryan raised $1.26 million “from small dollar grassroots donations.” The amount is more than Harper’s fundraising total in its entirety since her campaign began.",
    "He answers to the people of Ohio and he’ll always do what’s right for Ohio…A clear contrast with the clown car of anti-worker country club elitists running against him.”",
    "Harper says she’s pro-choice, supports the John Lewis Voting Rights Act, universal health care, expanding the Supreme Court and eliminating the Senate filibuster.",
    "“In fact, during his tenure, Ohio has lost thousands of manufacturing jobs, many of them right here in his own congressional district,” Harper said.",
    "“I will do whatever it takes to stop any one of the Republicans who is running from getting anywhere near the United States Senate,” she said.",
    "YOUNGSTOWN, Ohio (WKBN) – Come the May primary in Ohio, there will be four names on the ballot in the race for Democrat for the U.S. Senate.",
    "One of them is Congressman Tim Ryan, and one of his challengers, 38-year-old Morgan Harper, spent part of her day campaigning in Youngstown.",
    "“Then was adopted and raised by my mom who immigrated to Ohio from Trinidad and worked in the public school system,” Harper said.",
    "“We are going to make sure that young people and workers have debt-free training and education to work those jobs,” Harper said.",
    "She announced that one of her campaign goals would be to create 600,000 jobs over the next 10 years in the clean energy sector.",
    "Tuesday afternoon, Harper stood in front of the Mahoning County Courthouse to explain why Democrats should vote for her.",
    "“Tim is running for Senate to do what he’s always done, which is fight to cut Ohio workers in on the deal.",
    "They are looking to take down the entire Democratic experiment and they need to be stopped,” Harper said.",
    "Congressman Ryan’s campaign spokesperson Izzi Levy released the following statement on Harper’s visit.",
    "Should she lose the Democratic primary, Harper suggested she would support the winner.",
    "She was born in Columbus to a teenage mother who was not prepared to raise her.",
    "She also had strong words for some Ohio Republicans running for Senate.",
    "“But there is one thing Congressman Ryan has succeeded on.",
    "Harper spent part of her day visiting small businesses.",
    "“So these are not people that are on our side."
  ]
}