{
  "id": 3025,
  "mediaId": 8379,
  "date": "2022-01-27",
  "headline": "Columbus Police to start ‘Operation Broken Windows’ to address abandoned car issue",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/abandoned-cars.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/columbus/columbus-police-to-start-operation-broken-windows-to-address-abandoned-car-issue/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Halperin",
  "authorUrl": "https://www.nbc4i.com/author/eric-halperin/",
  "termIds": [
    267,
    314,
    6077
  ],
  "sentences": [
    "“The last thing we need is to have any vehicle in the literal and metaphorical sense, to be somewhere where that will attract the negativity and the potential for crime to happen,” said Sgt.",
    "Police will put notifications on vehicles they identified as abandoned and owners will have at least one week to move them before they are towed, according to Sgt.",
    "COLUMBUS, Ohio (WCMH) – The Columbus Division of Police (CDP) is about to start a new operation to tackle the issues abandoned cars across the city are causing.",
    "Some of the cars are stolen ones that have been ditched, and some are cars in need of repair which owners haven’t taken care of, according to Sgt.",
    "They talked about seeing cars that have not been moved in almost two years, and they’re worried the abandoned vehicles attract crime.",
    "“When you don’t have action on these things that seem small to some people, the little things become the big things,” said Boggs.",
    "“It’s a pretty big step I think because that’s the largest piece of trash, junk, to get that off the street is huge,” said Boggs.",
    "Fuqua explained the operation will be using community liaison officers so that resources are not taken away from patrol.",
    "“We’re not trying to get anyone, and we want everyone to have the opportunity to move it on their own,” he said.",
    "In 2021 there were 11,000 ‘311 requests’ about abandoned or inoperable vehicles, according to CDP.",
    "That’s where CPD has received a considerable amount of new complaints have been coming in from.",
    "CDP calls the operation, “Operation Broken Windows.” The program begins on Monday, January 31.",
    "Hilltop residents Lisa Boggs and Reba Schlosser are looking forward to the new operation.",
    "Fuqua called the abandoned vehicles a quality of life issue and a safety issue.",
    "Both police and neighbors hope the new operation brings improvements.",
    "“I make calls every week about abandoned cars,” said Schlosser.",
    "The operation will start in the Hilltop area.",
    "James Fuqua.",
    "Fuqua.",
    "Fuqua.",
    "Sgt.",
    "Sgt."
  ]
}