{
  "id": 3522,
  "mediaId": 8435,
  "date": "2022-02-02",
  "headline": "Mandel and Harper Debate During Virtual Townhall",
  "image": "https://i0.wp.com/wordpress.thetruthtoledo.com/wp-content/uploads/2020/07/cropped-T-truth-1.jpg?fit=32%2C32",
  "link": "http://wordpress.thetruthtoledo.com/index.php/2022/02/02/mandel-and-harper-debate-during-virtual-townhall/",
  "mediaOutlet": "Sojourner's Truth",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tricia Hall",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Harper sparred against Mandel while mentioning several talking points that align more with the progressive side of the Democratic Party like the six members of the U.S. House of Representatives known as ‘The Squad.’\nHarper challenged now-Congressional Black Caucus chair Joyce Beatty (D-Ohio) in a 2020 Democratic primary.",
    "The list of Republican candidates includes over 10 individuals and according to Ohio-based news sources Josh Mandel is the front-running GOP hopeful, and Morgan Harper is currently behind the Democratic front-runner Congressman Tim Ryan.",
    "Starting with the opening statement and through the 90-minute debate, Mandel called out Democratic candidate Tim Ryan repeatedly and mentioned the phrase, “America First,” which is one of former President Trump’s campaign slogans.",
    "Instead of hearing from just the two declared Democratic candidates who are running for the U.S. Senate seat to represent Ohio, or the host of Republicans vying for their party’s nomination, this debate offered an unusual lineup.",
    "Mandel continued to attack Ryan for his lack of participation in the debate, mentioned that race and gender was the underlying reason for Ryan’s absence and even claimed that Democrats in general mistreat black voters.",
    "Mandel, a former state treasurer, has tacked hard to the right in the primary, pushing election conspiracies and racist rhetoric to appeal to the Trumpers — and to Trump himself for a potential endorsement.",
    "Mandel continued repeating the same Ted Cruz and Newsmax talking points, with a personal story about his family, repeating the Cruz’ comments about completing the border wall and securing the nation.",
    "Sojourner’s Truth Reporter\nTraditionally, debates during the primary voting season are held within the same political party, but the hybrid debate held on January 27 didn’t follow that usual format.",
    "She ran with the backing of Justice Democrats, the group that helped Democrat Alexandria Ocasio-Cortez, a Squad notable, defeat a New York City incumbent to win her congressional seat in 2018.",
    "People who recognize economic opportunities and will create investments, who will create jobs, green energy jobs even for those with just a high school diploma,” said Harper.",
    "“We should finish the wall the former President Trump started, as long as there are veterans living under bridges we shouldn’t spend a penny to house immigrants.",
    "First, we need to elect officials that are focused on solving the climate crisis and not interested in taking the money from those who started this crisis.",
    "Yes, Josh, freedom is a value in this country and bedrock principal of what America is all about, but you have no idea what it’s all about,” she added.",
    "Harper never hesitated to speak over the permitted debate time and even directly responded to Mandel which wasn’t appreciated by the event moderators.",
    "“I’m pro-God, pro-gun, pro-Trump, and I will fight in Washington with the Constitution in one hand and the Bible in the other,” Mandel said.",
    "Every time illegals come into our country, it becomes harder for Americans especially blacks and Hispanics to get those jobs,” Mandel said.",
    "The debate was held hybrid on social media channels of the two moderators Cassie Young of Matter News and Don Wolvin of Awake America Ohio.",
    "However, her response to Mandel speaking for the Black community received a little bit of laughter and a large audience applause.",
    "There’s only one candidate that is standing up for human liberty, freedom of individuals and Trump’s America first,” said Mandel.",
    "The radical left is trying to erase American history and teach that America was founded to keep the history of slavery alive.",
    "“We need to be aware of the concerns as we extend into crypto currency and we need to understand the environmental impact.",
    "We need to ensure that there is comprehensive immigration reform that creates a path to citizenship, not building walls.",
    "For additional information about the two candidates, visit their website www.morganharper.org or www.joshmandel.com",
    "We don’t need to focus on who’s established or not, but what is the future for the state of Ohio,” said Harper.",
    "The founders of this county, the Founding Fathers, they did not believe in the separation of church and state.",
    "Last week’s debate featured Republican Josh Mandel, a diehard Trumper, and progressive Democrat Morgan Harper.",
    "This wall is a joke, go to YouTube, Josh will do whatever needs to be done as a mini-Trump,” replied Harper.",
    "When you read the United States Constitution, nowhere do you read about the separation of church and state.",
    "The established Democrats have taken Morgan for granted and have done this to black voters for generations.",
    "The first question that should be raised is how did we, the Ohio voters, end up with this debate pairing?",
    "“What we don’t need is Josh speaking for us, radical Republicans don’t have our best interest at heart.",
    "In Ohio and in our country, the radical Biden administration is attacking our freedom and liberty.",
    "His comments about this received little applause, but more shocked verbal responses.",
    "These established Democrats have trampled on black people and have left them behind.",
    "We need to stay focus on the reality that American is a country of immigrants.",
    "The same people who tried to stop Trump are trying to stop me,” said Mandel.",
    "“The real waste of money is the wall, that was a pet ego project of Trump.",
    "While Harper’s response received mix reviews from in-person attendees.",
    "Once I’m nominated, I plan to set records for black votes received.",
    "Both candidates stayed true to the core values of their voter base.",
    "Mandel has done much of his campaigning in evangelical churches.",
    "It does not exist,” he said, receiving a gasp from the audience.",
    "“The radical left is trying to teach our kids to hate America.",
    "If Morgan was a white male, Tim Ryan would have debated her.",
    "In 1776 our founders were promoting freedom and liberty.",
    "Tim Ryan ignoring Morgan is a perfect example of that.",
    "And he got more than a little weird during the debate.",
    "“I do not believe in separation of church and state.",
    "“Tim Ryan is a wimp and afraid to debate Morgan.",
    "“All of us should have an immigrant story.",
    "We care as Ohioans and as Americans.",
    "There’s no such thing."
  ]
}