{
  "id": 373,
  "mediaId": 2573,
  "date": "2022-02-22",
  "headline": "Mandel-Harper Ohio Senate debate goes off the rails in Cleveland",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Josh-Mandel.jpg",
  "link": "https://www.foxnews.com/politics/morgan-harper-josh-mandel-senate-debate",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    3049,
    2290,
    1819,
    1480,
    1489,
    1126,
    980,
    392,
    164,
    976
  ],
  "sentences": [
    "An Ohio Senate debate between Republican candidate Josh Mandel and Democrat Morgan Harper devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the incendiary Ohio Senate race.",
    "Among the insults, Mandel said Harper is \"like AOC only dumber,\" referring to Rep. Alexandria Ocasio-Cortez, D-N.Y. And Harper mocked Mandel for being on his third run for U.S. Senate, with unsuccessful efforts in 2012 and 2018.",
    "Harper didn't engage the insult, but argued that Medicare-for-All could help eliminate expenses for small businesses and allow people who want to start a business to leave their jobs without worrying about health care.",
    "After a moderator directed a question to Harper about her electability – compared to Ryan, a career politician – Mandel said she was \"out of touch\" with Ohio and would not be able to win an election in Ohio.",
    "\"Why is it fair to Teresa, that waitress at Waffle House,\" or other blue-collar workers, Mandel said, \"to have their tax dollars pay for someone like Morgan, who went to Princeton and Stanford.\"",
    "( Bill Clark/CQ-Roll Call, Inc via Getty Images)\n\"Interesting, because I do believe, third time running for the same seat, so let's talk about track record of winning elections,\" Harper said.",
    "Shortly thereafter the moderator gained control and asked Mandel if he would consider the people who attacked the Capitol on Jan. 6, 2021, to be \"thugs,\" like he called Black Lives Matter.",
    "\"No one is talking about,\" Harper responded, arguing that people care less about the regressive nature of student debt forgiveness than about the regressive nature of corporate tax cuts.",
    "I had young Black men put their life in my hands in the United States Marine Corps in two tours in Iraq, so don't stand there and lecture me,\" Mandel said, speaking over the moderator.",
    "Harper also got in a few digs aimed at Ryan, accusing him or being funded by \"big insurance companies and big pharma,\" \"special interests\" and \"corporate interests.\"",
    "The moderator asked Mandel about a previous comment calling Black Lives Matter \"thugs,\" after which an audience member interjected with a loud \"uhhhhuh.\"",
    "HOT-BUTTON ABORTION ISSUE LATEST BATTLE IN OHIO GOP SENATE PRIMARY AS VANCE, GIBBONS TRADE BARBS\nThat was not the only explosive exchange, however.",
    "\"Because the reality is if we had universal health care in this country it would bring down the quality of health care for every American citizen.",
    "\"I told the story earlier about being at a town hall, the bar and restaurant down the street, where I told folks I'm going to date Morgan Harper.",
    "Harper is a long shot Democrat in a primary against longtime Rep. Tim Ryan, who's considered the clear front-runner in the Democratic primary.",
    "She then detailed her history in an \"abusive household\" and how she had to \"work my butt off to get scholarships to Princeton and Stanford.",
    "After hearing that answer I actually think she's like AOC only dumber,\" Mandel said, to murmurs of \"whoah\" from audience members.",
    "Mandel is the former treasurer of Ohio and one of several leading Republican candidates running to succeed retiring GOP Sen.",
    "\"That's something you wouldn't know about,\" Harper continued, \"because you're just used to getting whatever you want.\"",
    "In fact, there are Canadians when they have heart problems have to come across to the Cleveland Clinic,\" Mandel added.",
    "But the debate still had more fireworks left between the candidates after Harper pushed for \"Medicare-for-All.\"",
    "\"Those were my brothers, whether they were Black or they were White or they were Hispanic or they were Asian.\"",
    "But to bring that White man in the Black community like that, I'm finished,\" the audience member said.",
    "Harper said the U.S. needs to \"cancel\" student debt and argued it would be good for the U.S. economy.",
    "Don't embarrass me,\" the moderator, who was Black, said to the audience member, who was also Black.",
    "The moderator then tried to calm down the audience member and Mandel, but again to no avail.",
    "Mandel responded by pointing out that student loan forgiveness is regressive by its nature.",
    "Mandel dodged the question, though he did say some Capitol attackers \"committed crimes.\"",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "The nastiest exchange happened between Mandel, an audience member and the moderator.",
    "Mandel started prodding Harper early in the debate on the issue of student loans.",
    "Mr. Mandel,\" the moderator said, trying to cut off that exchange but to no avail.",
    "\"Hey, hey, we're not doing that,\" the moderator shot at the audience member.",
    "\"I thought this was America where we debate freely,\" Mandel said.",
    "Harper shot back with an insult at Mandel's own electability.",
    "Harper refused to shake Mandel's hand when the debate ended.",
    "The debate Monday included only Harper and Mandel.",
    "\"You mean like put him out with a, with a bullet?",
    "Tyler Olson covers politics for Fox News Digital.",
    "I put my life in the hands of young Black guys.",
    "\"Ask him to leave,\" the audience member said.",
    "\"He don't belong in the Black community.\"",
    "\"You ain't coming in the Black community.",
    "Put 'em out,\" the audience member said.",
    "\"Let me tell you something ma'am.",
    "Don't do that… This is America.",
    "What do you mean put him out?\"",
    "But Mandel engaged him anyway.",
    "She's like AOC only smarter.",
    "\"Don't you suck up to him.\"",
    "\"I'm not embarrassing you.",
    "\"Hey sister, listen to me.",
    "\"No, no, no, Mr. Mandel.",
    "\"Why are you so angry?\"",
    "He can be here.",
    "Don't do that.",
    "Mandel said.",
    "Rob Portman.",
    "Mandel said.",
    "Mr. Mandel."
  ]
}