{
  "id": 3796,
  "mediaId": 2590,
  "date": "2022-01-21",
  "headline": "A 'Reset In Black Politics’: Retirements Set Up Battle Over Congressional Black Caucus’s Direction",
  "image": "https://img.huffingtonpost.com/asset/61e9e587260000e800fbe23b.jpeg?cache=XHqgKlUqYy&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/congressional-black-caucus-retirements-battle-for-future_n_61e9e4f3e4b01440a6897aa9",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Marans",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There is obviously an effort to make sure that that new generation has continuity with the older one, but that baton pass will be delicate.”\n- Senior aide to a Black House member\nBut depending on its outcome, the ideological battle over which kinds of Democrats replace departing CBC members could either reinforce the preferred, cautious approach of current caucus leadership or push it more in the direction of a younger crop of boundary-pushing progressives with strong ties to the Congressional Progressive Caucus.",
    "Clyburn announced his endorsement shortly after Turner appeared at an event with Killer Mike, where the rapper described Clyburn as “stupid.”\nLoadholt suggested that figures like Clyburn were most disposed to get involved in primaries against candidates who “almost reflexively attack establishment Democrats.”\n“If you’re going to attack them, they’ll respond,” he said.",
    "Advertisement\n“The diversity within the CBC is what gives the CBC its strength, its depth and its width.”\n- Antjuan Seawright, Democratic strategist\nThe CBC became so committed to beating back primary challenges that its PAC endorsed the 2020 reelection bid of then-Rep. Eliot Engel, a white New York Democrat representing a majority non-white district.",
    "In consultation with House Speaker Nancy Pelosi (D-Calif.), senior members of the Congressional Black Caucus came up with the compromise that ultimately brought enough progressives on board, according to The New York Times: Pass the infrastructure bill, then take a procedural vote to advance Build Back Better without actually voting on its passage.",
    "There have been a range of perspectives, from traditionally left-leaning foes of the military-industrial complex, including the late Rep. Ron Dellums and his Bay Area successor, Rep. Barbara Lee, to fiscal conservatives like Reps. Sanford Bishop and David Scott of Georgia, currently the sole Black members of the centrist Blue Dog Coalition.",
    "“I would love to see a CBC following the lead of the Pressleys, Omars and Bowmans.”\nSome moderate Democrats insist that there is no real conflict between progressive CBC members who see themselves as having sometimes divergent interests from party leaders and the more moderate or mainstream CBC members who prefer to work within the system.",
    "“Most CBC members might recognize that when they came in, they couldn’t do certain things and that they paved the way for the younger generation to be bolder.”\nSince its inception in 1971, the CBC has spoken with a united voice on core priorities, such as voting rights, while reflecting the ideological diversity of Black America.",
    "“You’re starting to kind of see this reset in Black politics.”\nAs part of the larger tide of Democratic retirements this election cycle, seven CBC members have either launched campaigns for another elected office or announced that they do not plan to run for reelection: Reps. Karen Bass (Calif.), Anthony Brown (Md.",
    "Michael M. Santiago/Getty Images\nPrimary Challenges Change The Terrain\nIn the aftermath of the 2016 election, a new generation of progressive groups and activists began a concerted effort to unseat incumbent Democrats of all races and backgrounds whom they deemed to be corrupt, complacent or insufficiently liberal.",
    "“There’s nothing wrong with a little R&B and a little hip-hop to make good music, and you see that within the newer faces and newer flavors that continue to make up the CBC.”\nIndeed, Clyburn co-authored a July op-ed with Jones, a progressive, in support of a filibuster carve-out for voting rights legislation.",
    "Many of these younger lawmakers, such as Reps. Colin Allred (Texas), Lauren Underwood (Ill.) and Antonio Delgado (N.Y.), have run and won in majority-white districts, potentially making them less averse to gerrymandering reforms that could produce districts with slightly smaller percentages of Black voters.",
    "Now a wave of retirements sweeping the CBC is set to inject young blood into an aging Democratic bloc - nearly half of its members are 65 or older - while pushing to the forefront a simmering internecine struggle for the caucus’s ideological direction and relationship to party leadership.",
    "These elected officials are also more likely to be social-media savvy and less likely to be explicitly hostile to progressive activists than were their predecessors, according to Loadholt, who advises Woodfin and Little Rock, Arkansas, Mayor Frank Scott, as well as corporate clients.",
    "When John Lewis died in July 2020, a panel of Georgia party officials ended up appointing then-state Democratic Party chair Nikema Williams, who formally recused herself from the selection process, to take over as Democratic nominee in his predominantly Democratic Atlanta district.",
    "“With the generation moving into Congress and … the mentoring that’s going on, it’s more of a succession plan, where we can actually work together in adopting progressive policies in the Black community and still be able to be a catalyst fighting for equality and inclusion.”",
    "“There is obviously an effort to make sure that that new generation has continuity with the older one, but that baton pass will be delicate,” said the senior aide to a Black member of Congress, who is hopeful that progressives are able to make gains in the CBC this cycle.",
    "“The CBC at one point was an institution that was trying to preserve the voices of the minority and create a space for people who didn’t have a proportional voice in Congress,” said a senior aide to a Black member of Congress who requested anonymity to speak freely.",
    "“Now it echoes the voice of leadership.”\nA spokesperson for the CBC disputed the idea that the CBC’s advocacy for passage of the bipartisan infrastructure package reflected a lack of commitment to other priorities, like voting rights and police accountability.",
    "Jose Luis Magana/Associated Press\n“The diversity within the CBC is what gives the CBC its strength, its depth and its width,” said Antjuan Seawright, a Democratic strategist based in Columbia, South Carolina, who is a political adviser to Whip Clyburn.",
    "Cherfilus-McCormick, who ran as a progressive proponent of Medicare for All and a $20 minimum wage, is an example of a new CBC member striking a balance between left-leaning policy views and a desire to work amicably with existing caucus leaders.",
    "“She stepped in in a controversial-type way, which is why she has competition coming up now,” said Atlanta City Councilman Antonio Lewis (D), who unseated a more moderate incumbent in 2021 but made it clear he has no plans to run for Congress.",
    "Indeed, two of its victorious candidates in 2018 were Rep. Ayanna Pressley, a Black progressive who unseated a white incumbent in Massachusetts, and Rep. Ilhan Omar, a Somali American who won a competitive primary for an open Minnesota seat.",
    "“The CBC is very much in a transitional phase right now after being really stable for a very long time,” said Jarrod Loadholt, an attorney, federal lobbyist and former aide to House Financial Affairs Committee chair Maxine Waters (D-Calif.).",
    "Advertisement\nThose retirements follow the April death of Rep. Alcee Hastings of Florida, whose successor, Rep. Sheila Cherfilus-McCormick, an attorney and health care executive, 42 years younger than Hastings, was sworn in on Tuesday.",
    "But she faces stiff competition from eight other Democrats, including former state Rep. Barbara Mallory Carraway, attorney Abel Mulugheta and Jane Hamilton, a former chief of staff to Rep. Marc Veasey (D-Texas), who has endorsed her.",
    "“The last few election cycles have shown for progressives that the Black Caucus has a long way to go to match the energy of the left base,” said Maurice Weeks, executive director of the Action Center on Race and the Economy.",
    "Advertisement\nBut members of the Congressional Progressive Caucus were still threatening to sink the bill absent a promise that both chambers of Congress would vote on the more ambitious Build Back Better budget legislation.",
    "Even if progressive groups’ preferred candidates do not win the primaries for open seats being vacated by departing CBC members, relatively moderate, young Black elected officials differ from their predecessors in key ways.",
    "It’s no coincidence that two of the most powerful Black lawmakers in the country are House Majority Whip Jim Clyburn (S.C.) and House Democratic Caucus chair Hakeem Jeffries (N.Y.), a favorite to succeed Pelosi as speaker.",
    "From the progressives to the moderates to the leadership, they all are really focused on getting the work done.”\nHouse Majority Whip Jim Clyburn (D-S.C.) endorses Joe Biden in the Democratic presidential primary.",
    "These Black progressives would rather have the CBC use its power to force the party’s hand on police reform, student debt cancellation or another cause that they see as a higher priority for Black Americans.",
    "But perhaps because CBC members overwhelmingly represent safe Democratic seats and Justice Democrats had already run a candidate against at least one of its members in 2018, the CBC responded with anger.",
    "“Instead of fighting Republicans and defeating Trump and holding on to our majority, they find it convenient to go after their own, which is to me a bunch of B.S.,” then-Rep. William “Lacy” Clay (D-Mo.)",
    "Rep. Mondaire Jones, who initially ran as a primary challenger in 2020 from the New York City suburbs but ended up winning an open seat, is another young and outspoken progressive addition to the CBC.",
    "The candidates tended to draw inspiration from the first presidential run of Sen. Bernie Sanders (I-Vt.) but were also often involved in the Black Lives Matter movement that began in earnest in 2014.",
    "Gerald Herbert/Associated Press\nStruggle For The Future Of The CBC\nWith 59 members in the House and Senate, the Congressional Black Caucus has never been so big, diverse and influential.",
    "Crockett, a civil rights attorney, is a co-founder of the progressive caucus in the state legislature and told HuffPost that she won’t be afraid of defying party leaders when necessary.",
    "Justice Democrats promised to keep going, saying it would be narrowing its focus to solid Democratic House districts where primary challenges wouldn’t risk empowering Republicans.",
    "Advertisement\nHowever, to a small but growing number of Black progressives - inside and outside the halls of Congress - the maneuver exemplified their disappointment with the CBC.",
    "In November, President Joe Biden and other Democrats felt a new urgency to push the infrastructure bill through after the party’s punishing losses in the Virginia elections.",
    "The CBC spokesperson called the caucus a “big tent” for Black lawmakers of varied ideologies united by their common commitment to advancing Black Americans’ interests.",
    "To that end, the Working Families Party announced Wednesday that it is endorsing state Rep. Jasmine Crockett to succeed retiring Rep. Eddie Bernice Johnson in Dallas.",
    "It had recruited Alexandria Ocasio-Cortez to run against then-House Democratic Caucus chair Joe Crowley in New York, and her upset victory shook the Democratic Party.",
    "CBC chair Joyce Beatty (D-Ohio), who survived a progressive primary challenge in 2020, campaigned for a more moderate Democrat in an August special election in Ohio.",
    "Bush and Bowman joined Pressley and Omar as members of both the CBC and the “Squad” of ultra-progressive Democrats who stand up to Democratic Party leadership.",
    "In their telling, the CBC chose to use its power to squander congressional progressives’ leverage over moderates to encourage passage of Build Back Better.",
    "“I don’t believe in waiting your turn.”\nRep. Jamaal Bowman (D-N.Y.) speaks out against Islamophobic comments made about Rep. Ilhan Omar (D-Minn.), right.",
    "And Black issues are not monolithic.”\nThe CBC has done more than just defend incumbents though, actively working against progressives in open primaries.",
    "Before Woodfin’s mayoral election, for example, “I don’t think the progressive groups in Birmingham had an audience or a table to be at,” Loadholt said.",
    "To the CBC’s supporters, it was a moment of triumph for the 59-member bloc, demonstrating Black lawmakers’ influential position in the Democratic Party.",
    "Elizabeth Frantz/Reuters\nFinding Areas Of Cooperation\nProgressives certainly aren’t waiting to try to take advantage of the wave of CBC retirements.",
    "and Gregory Meeks (N.Y.) - who chairs the CBC PAC - traveled to Cleveland to campaign for establishment favorite and Fudge protégée Shontel Brown.",
    "The generational turnover in the CBC alone is sure to change the style and tone of the caucus and, by extension, the Democratic Party as a whole.",
    "), who unseated a more moderate CBC member, camped outside the U.S. Capitol in August to demand an extension of the federal eviction moratorium.",
    "Two months later, another Justice Democrats endorsee, Black Lives Matter activist Cori Bush, unseated Clay in Missouri on her second attempt.",
    "Black progressives see an opportunity to get more of their own into the CBC without the politically fraught challenge of unseating members.",
    "CBC chair Joyce Beatty (D-Ohio) staunchly defended the compromise in public, making her a face of the historic infrastructure legislation.",
    "They have traditionally viewed ascending through the ranks of party leadership as the surest route to advance Black Americans’ interests.",
    "“I am the type of person that if I truly feel it is for the benefit of my district to hold out [for something better], I will,” she said.",
    "And in October 2017, attorney Randall Woodfin, a mainstream liberal, ousted Birmingham’s more conservative incumbent mayor in Alabama.",
    "The dominant voices in the caucus, however, tend to be somewhere in between: mainstream liberals who are masters of inside politics.",
    "Advertisement\nLike many young Black progressives, Lewis doesn’t hold it against the old guard that they want to hold on to power.",
    "“Just because it didn’t pass now, it doesn’t mean we’re not still fighting to get these things passed,” the spokesperson said.",
    "), G.K. Butterfield (N.C.), Val Demings (Fla.), Eddie Bernice Johnson (Texas), Brenda Lawrence (Mich.) and Bobby Rush (Ill.).",
    "Justice Democrats also made it clear at the time that it would prioritize racially diverse districts with white incumbents.",
    "When Marcia Fudge vacated her Ohio seat to become Biden’s housing secretary, Reps. Clyburn, Beatty, Bennie Thompson (Miss.)",
    "Some of the earliest progressive primary wins in this period were Black candidates unseating other Black incumbents.",
    "The most conservative House Democrats, meanwhile, refused to vote on the infrastructure bill on progressives’ terms.",
    "The bipartisan infrastructure package might never have become law if it weren’t for the Congressional Black Caucus.",
    "In May 2017, progressive attorney Chokwe Antar Lumumba defeated the more moderate mayor of Jackson, Mississippi.",
    "Establishment Democrats have also sometimes done what they can to anoint a successor to a departing CBC member.",
    "Engel lost to Jamaal Bowman, a progressive former middle school principal recruited by Justice Democrats.",
    "“I applaud Congresswoman Beatty for bringing everyone together” behind the infrastructure bill, she said.",
    "There is not currently any candidate challenging Williams for the Democratic nomination in her district.",
    "The foursome made up two-thirds of the group of six Democrats who voted against the infrastructure bill.",
    "Then in 2018, the left-wing group Justice Democrats broke into the national political world big time.",
    "Beatty handily defeated Justice Democrats-backed progressive challenger Morgan Harper in April 2020.",
    "“I sometimes will lead the holdouts.”\nIn addition to the WFP, Crockett has the blessing of Johnson.",
    "It was a direct repudiation of former Ohio state Sen. Nina Turner, a progressive star.",
    "Clyburn exemplifies the inside game played by many Congressional Black Caucus members.",
    "Prominent members of the CBC railed against the group and the far left more broadly.",
    "Their first test is in Texas, where voters cast ballots in primaries on March 1.",
    "“We brought in some pretty badass Black progressive leaders,” Weeks said.",
    "(Ocasio-Cortez and Michigan’s Rashida Tlaib were the other two.)",
    "“There is no chasm” in the CBC, the spokesperson said.",
    "Bowman won his 2020 primary without the CBC's backing.",
    "He’s just not asking for their permission to run.",
    "In the 2020 election cycle, the CBC struck back.",
    "“The CBC is not big on empty announcements.",
    "“Power is taken, not given,” he said.",
    "“The focus is on Black issues.",
    "Rep. Cori Bush (D-Mo.",
    "said in July 2019."
  ]
}