{
  "id": 4363,
  "mediaId": 8494,
  "date": "2022-01-25",
  "headline": "Morning Headlines: Today is the deadline for opponents of new Ohio legislative maps to object; Ohio Secretary of State tests positive for COVID-19",
  "image": "https://npr.brightspotcdn.com/dims4/default/ce77062/2147483647/strip/true/crop/4995x2622+0+354/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0a%2F9a%2Fbdd13fc74591af65262ece75c495%2Fshutterstock-764614840.jpg",
  "link": "https://www.wksu.org/2022-01-25/morning-headlines-today-is-the-deadline-for-opponents-of-new-ohio-legislative-maps-to-object-ohio-secretary-of-state-tests-positive-for-covid-19",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Meyer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Tuesday, January 25:\nToday is the deadline for opponents of new Ohio legislative maps to object\nOhio Secretary of State tests positive for COVID-19\nCleveland City Council passes bill to limit dollar stores\nTwo U.S. Senate candidates set debate prior to primaries\nOhio Turnpike snowplow damages 40 vehicles and injures 12\nCavs hold off Knicks in 95-93 win\nU.S. trains for World Cup qualifier in Columbus\nToday is the deadline for opponents of new Ohio legislative maps to object\n(AP) -- Voting rights and Democratic groups displeased with the latest redraw of legislative district maps have until today to file objections to the Ohio Supreme Court.",
    "U.S. trains for World Cup qualifier in Columbus\n(AP) -- Twenty U.S. players trained on a whitened field in 22-degree weather in Columbus as the United States began preparations for this week’s chilly World Cup qualifier against El Salvador.",
    "Two U.S. Senate candidates set bipartisan debate prior to primaries\n(AP) -- A Democrat and a Republican running in this year’s U.S. Senate race in Ohio will debate this week, even though a primary to pick the nominees is still months away.",
    "Ohio Turnpike snowplow damages 40 vehicles and injures 12\n(Cleveland.com) -- Slush and ice sprayed up by a snowplow on the Ohio Turnpike is blamed for causing damage to 40 vehicles near Sandusky on Sunday.",
    "Cleveland council passes bill to limit dollar stores\n(Cleveland.com) -- Cleveland City Council has approved new legislation to try and limit the spread of dollar stores in the city.",
    "Cavs hold off Knicks in 95-93 win\n(AP) -- Kevin Love scored 20 points and Darius Garland had 12 assists as the Cavs survived a late rally by New York to beat the Knicks 95-93.",
    "Ohio Secretary of State tests positive for COVID-19\n(Cleveland.com) -- Ohio Secretary of State Frank LaRose is in quarantine after he tested positive for COVID-19.",
    "Cleveland.com reports council unanimously approved a measure last night to limit new stores from being built within two miles of existing discount stores.",
    "The Ohio Turnpike Commission says it’s working with the Highway Patrol to get in touch with everyone involved in an accident because of the plow.",
    "Cleveland.com reports now-Council President Blaine Griffin first introduced legislation more than a year ago to curb the spread of these stores.",
    "Over the weekend, LaRose was in attendance at the meeting of the Ohio Redistricting Commission with the Governor and other elected officials.",
    "A Highway Patrol spokesman tells Cleveland.com about a dozen people were treated at area hospitals with non-life-threatening injuries.",
    "But the candidates said in an unconventional joint press release that they want the event to be about ideas, and informing voters.",
    "The wintery mix cracked windshields, triggered accidents, and caused at last one spinout captured by a video posted to Reddit.",
    "The odd match-up is between pro-Trump Republican Josh Mandel and Democrat Morgan Harper, a former consumer protection lawyer.",
    "Officials have raised concerns that dollar stores exacerbate the issues of food deserts, attract crime, and are an eyesore.",
    "Republicans defended the district lines crafted by their mapmakers as the only ones to fully meet the Ohio Constitution.",
    "The Ohio Redistricting Commission approved the new maps along party lines Saturday in the face of a court-set deadline.",
    "A spokesman tells Cleveland.com LaRose tested positive yesterday after experiencing “very minor” symptoms on Sunday.",
    "The court’s ultimate decision could affect the make-up of the Ohio House and Ohio Senate for the next 10 years.",
    "LaRose who is vaccinated and boosted according to the spokesman was not wearing a mask at the meeting.",
    "Cleveland has won seven of eight and played much better after a sloppy win over Oklahoma City.",
    "It’s unclear what purpose the event may serve beyond a bit of publicity.",
    "The expected temperature for kickoff Thursday night was 25 degrees.",
    "The team dubbed the conditions “Snowhio” on its Twitter account.",
    "He has postponed public events for the week."
  ]
}