{
  "id": 673,
  "mediaId": 8323,
  "date": "2022-02-21",
  "headline": "Senate candidates Morgan Harper, Josh Mandel clash in Cleveland debate",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/02/7D943F5F15899C9DCF2C605ABAE10258_1.jpg?w=1280",
  "link": "https://fox8.com/news/senate-candidates-morgan-harper-josh-mandel-clash-in-cleveland-debate/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Suzanne Stratford",
  "authorUrl": "https://fox8.com/author/suzannestratford/",
  "termIds": [
    0
  ],
  "sentences": [
    "As for why voters should choose them over the others, Mandel said, “The reality is we need to send fighters to Washington, pro-liberty, pro freedom, constitutional conservatives.”\nHarper responded, “We can do this, Ohio.",
    "“We need to have very clear solutions to support working people in our state and the federal minimum wage is one of those,” said Harper who also wants to create 600,000 new green energy jobs.",
    "CLEVELAND (WJW) – The May 3 primary is still months away, but two candidates for the U.S. Senate aren’t waiting to present their platforms to voters and held a second debate Monday night.",
    "Former consumer protection lawyer Attorney Morgan Harper (D) and former Ohio Treasurer Josh Mandel (R) held the event at City-God Baptist Fellowship on East 152nd Street in Cleveland.",
    "However, in a very unconventional move, the Trump-aligned Republican and progressive Democrat worked together organizing the debates which included an event on January 24 in Columbus.",
    "Mandel has said that he isn’t afraid to take on anyone from either party on any issue and thinks it benefits voters to see their different ideas and visions for Ohio and the country.",
    "The hour-long debate at times became heated with Mandel calling Harper an angry radical leftist and Harper calling him a bought and paid for career politician.",
    "Harper said she has been unsuccessful in getting U.S. Representative Tim Ryan (D) to participate in a debate, so she’s facing off against a Republican.",
    "The two squared off and expressed very different opinions on everything from universal healthcare to vaccine mandates and bail and elections reform.",
    "“Let’s drill for natural gas, creating jobs for our people, lowering energy costs and so they can hire more people and increase wages,” said Mandel.",
    "The field is wide open to replace the senate seat currently held by Rob Portman (R), who announced he would not be running for re-election.",
    "We need to put an end to career politicians who are about themselves and distraction and get one of us to Washington, D.C.”",
    "“I think the world is a safer place and America is a stronger place when America leads,” said Mandel.",
    "“Ohio needs a new path forward, new leadership and not more of the same old politics,” said Harper.",
    "Mandel discussed the importance of energy independence and Ohio’s natural resources.",
    "They also both talked about their plans to improve the economy."
  ]
}