{
  "id": 6787,
  "mediaId": 8496,
  "date": "2022-04-18",
  "headline": "Hilliard school district files police report against Ohio US Senate candidate",
  "image": "https://media.wkyc.com/assets/WBNS/images/f90c4ba1-7968-4ac9-852f-ec3108261d31/f90c4ba1-7968-4ac9-852f-ec3108261d31_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/hilliard-school-district-files-report-against-senate-candidate/530-00b0786c-c1c1-4e06-bd53-012b25513f36",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In her press conference Saturday, Harper emphasized that her campaign team was invited to the walkout by student organizers and that they had permission from school administrators to attend.",
    "Darby and district leaders were not notified of her intent to attend or her presence on school property, in clear violation of our visitor policies,\" the district letter stated.",
    "\"I'm happy to always be in touch with school administration and coordinate my appearances, and I have appeared during this campaign on school campuses before,\" Harper said.",
    "\"Without the consent of appropriate district personnel, an authorized person -- a candidate for political office - entered school property without permission to do so.",
    "Students walked out of Hilliard Darby High School Thursday to protest House Bill 616, which is considered by some as the equivalent to Florida's \"Don't Say Gay\" bill.",
    "The bill would restrict both instruction and materials about sexual orientation and gender identity until fourth grade in all public and most private schools.",
    "The Hilliard City School District filed the complaint against Democratic candidate Morgan Harper, who briefly attended a student walkout earlier this week.",
    "Harper's campaign said she was invited by student organizers who told the campaign that they had notified school administrators she would be attending.",
    "HILLIARD, Ohio — The Hilliard City School District filed a complaint against a Democratic candidate running for Ohio's U.S. Senate seat.",
    "\"This was a little different because it was a walkout led by students that was cleared by administration that we were invited to.\"",
    "School administrators were not participating in the event, rather were supervising at a distance within view of students.",
    "In an email to parents, the district said the candidate showed up to Thursday's student walkout without permission.",
    "Harper admitted that her campaign team members did not reach out directly to the high school for approval.",
    "The district notified Harper through their attorney that she is prohibited from being on school property.",
    "Harper is one of three Democratic candidates vying for the open U.S. Senate seat being vacated by Sen.",
    "A police report was filed with the Hilliard Division of Police, but it is not available yet.",
    "Harper's campaign said she was there for about 15 minutes, spoke to students and left.",
    "The district also plans on filing a complaint with the Ohio Elections Commission.",
    "The candidate was identified as Morgan Harper, according to her campaign team.",
    "She also said she was never told to leave the property.",
    "It would also ban critical race theory.",
    "Rob Portman."
  ]
}