{
  "id": 6998,
  "mediaId": 8362,
  "date": "2022-04-15",
  "headline": "155 Uplifting Self-Care Quotes for Mental Health",
  "image": "https://wealthofgeeks.com/wp-content/uploads/2022/04/1343627_selfcarequotesOption2_041422-1024x683.png",
  "link": "https://wealthofgeeks.com/uplifting-self-care-quotes/",
  "mediaOutlet": "lyingcrookedhillary.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Graber",
  "authorUrl": "https://wealthofgeeks.com/author/nicole-graber/",
  "termIds": [
    5749,
    5470,
    5548,
    4542,
    4475,
    4922,
    3051,
    3439,
    3307,
    3970
  ],
  "sentences": [
    "And then let your kindness flood the world.” – Pema Chodron\n“The relationship you have with yourself will determine what your relationships with others will be like.” – Akiroq Brost\n30 Self-Care Quotes About Treating Yourself Respectfully\n“The only person who can pull me down is myself, and I'm not going to let myself pull me down anymore.” – C. Joybell C.\n“Gard the doors of your temple, do not let anyone pollute it with their mess.” – Patricio Telman Chincocolo\n“Self-care is a deliberate choice to gift yourself with people, places, things, events, and opportunities that recharge our personal battery and promote whole health: body, mind, and spirit.” – Laurie Buchanan, PhD\n“Bathing is a basic need, but it doesn't have to be a forgettable moment in your routine.” – Amy Leigh Mercree\n“I want to be as healthy as I possibly can be.",
    "You get paid for the value you bring to the hour.” – Jim Rohn\n“Take time to deliberate, but when the time for action has arrived, stop thinking and go in.” – Napoleon Bonaparte\n“While one person hesitates because he feels inferior, the other is busy making mistakes and becoming superior.” – Henry C. Link\n“What looks like multitasking is really switching back and forth between multiple tasks, which reduces productivity and increases mistakes by up to 50 percent.” – Susan Cain\n“Productivity is the deliberate, strategic investment of your time, talent, intelligence, energy, resources, and opportunities in a manner calculated to move you measurably closer to meaningful goals.” – Dan S. Kennedy\n“The really happy people are those who have broken the chains of procrastination, those who find satisfaction in doing the job at hand.",
    "For the sun every morning is a beautiful spectacle, and yet most of the audience still sleeps.” – John Lennon\n“Stepping out of the busyness, stopping our endless pursuit of getting somewhere else, is perhaps the most beautiful offering we can make to our spirit.” – Tara Brach\n“It's not knowing what to do, it's doing what you know.” – Tony Robbins\n“If you feel “burnout” setting in, if you feel demoralized and exhausted, it is best, for the sake of everyone, to withdraw and restore yourself.” – Dalai Lama\n“Good well-being leads to good working performance.” – Lailah Gifty Akita\n“Though we all make mistakes, don't handicap yourself in difficult tasks; self-sabotage is not a strategy.",
    "My recovery from abuse, addiction, and a suicide attempt required dump truck loads of self-care.” – Steve Austin\n“We delight in the beauty of the butterfly, but rarely admit the changes it has gone through to achieve that beauty.” – Maya Angelou\n“Stopping takes courage, too.” – Emma Xu\n“Within you, there is a stillness and a sanctuary to which you can retreat at any time and be yourself.” – Hermann Hesse\n“Remember that failure is an event, not a person.” – Zig Ziglar\n“To accept ourselves as we are means to value our imperfections as much as our perfections.” – Sandra Bierig\n“Self-care is so much more than a beauty regimen or an external thing you do.",
    "Since you have a choice between taking care of someone else, or giving to yourself, try choosing yourself sometimes.” – Beverly Engel\n“When we self-regulate well, we are better able to control the trajectory of our emotional lives and resulting actions based on our values and sense of purpose.” – Amy Leigh Mercree\n“Self-care is a deliberate choice to gift yourself with people, places, things, events, and opportunities that recharge our personal battery and promote whole health- body, mind, and spirit.” – Laurie Buchanan, PhD\n“… don't worry too much about what someone else says you “should” do.",
    "It's the only place you have to live.” – Jim Rohn\n“When the well's dry, we know the worth of water.” – Benjamin Franklin\n“You don't have to love yourself in muttered whispers while loving everyone else with a megaphone.” – Jasmine Farrell\n“Self-care has become a new priority – the revelation that it's perfectly permissible to listen to your body and do what it needs.” – Frances Ryan\n“Our soul is like a soft and gentle flower; it needs to be nurtured, cared for, tended to, with sufficient sunlight, fresh air, and freedom to bloom into its most precious and beautiful form.",
    "To act as one thinks is the most difficult.” – Johann Wolfgang von Goethe\n“When we truly need to do is often what we most feel like avoiding.” – David Allen\n“One of the great challenges of our age, in which the tools of our productivity are also the tools of our leisure, is to figure out how to make more useful those moments of procrastination when we're idling in front of our computer screens.” – Joshua Foer\n“You don't have to see the whole staircase; just take the first step.” Martin Luther King\n“You don't get paid for the hour.",
    "And then let your kindness flood the world.” – Pema Chodron\n“When the body forces you to STOP, it's saying, hey buddy, you've gone too far.” – Jacqueline Escolme\n“Self-care sometimes is doing the things that will make your next 2 hours difficult, but your next ten years easier.” – Em.x.thoughts\n“Those who think they have not time for bodily exercise will sooner or later have to find time for illness.” – Edward Stanley\n“Lighten up on yourself.",
    "Self-sacrifice is NOT setting a good example.” – Miya Yamanouchi\n“Caring for myself is not self-indulgence, it is self-preservation, and that is an act of political warfare.” – Audre Lorde\n“We must take care of our minds because we cannot benefit from beauty when our brains are missing.” – Euripides\n“Self-care is never selfish, but it may feel that way when you live a frenzied life.” – Arthur P. Ciaramicoli\n“Self-care is not a waste of time.",
    "No one serves their friends by grinding themselves into dust on the altar of compassion.” – Seanan McGuire\n“For those of you who struggle with guilt regarding self-care, answer this question: What greater gift can you give to those you love than your own wholeness?” – Shannon Tanner\n“You can't really be present for the people in your life if you aren't taking care of yourself.” – Kerry Washington\n“An empty lantern provides no light.",
    "You can be, too.” – Norman Vincent Peale\n“The three great essentials to achieve anything worthwhile are hard work, stick-to-itiveness, and common sense.” – Thomas Edison\n“If you want an easy job to seem mighty hard, just keep putting it off.” – Richard Miller\n“Nothing in the world can take the place of persistence.” – Calvin Coolidge\n“Position yourself to succeed by doing the other things in your life that rejuvenate you.",
    "You need a commitment.” – Seth Godin\n“Until we can manage time, we can manage nothing else.” – Peter Drucker\n“If you spend too much time thinking about a thing, you'll never get it done.” – Bruce Lee\n“Once you have mastered time, you will understand how true it is that most people overestimate what they can accomplish in a year and underestimate what they can achieve in a decade!” – Tony Robbins\n“Don't wait.",
    "You are worth the deeper breaths, and you are worth the time it takes to slow down, be still, and rest.” – Morgan Harper Nichols\n“Keep taking time for yourself until you're you again.” – Lalah Delia\n“Saying no can be the ultimate self-care.” – Claudia Black\n“When you say ‘yes' to others, make sure you are not saying ‘no' to yourself.” – Paulo Coelho\n“Be enough for yourself first.",
    "You cannot serve from an empty vessel.” – Eleanor Brownn\n“Inner peace begins the moment you choose not to allow another person or event to control your emotions.” – Pema Chodron\n“Self-care is allowing yourself to appreciate the moment for what it is, instead of wishing it was something else.” – Sharon Pearson\n“When I loved myself enough, I began leaving whatever wasn't healthy.",
    "Know what you want to do and why it's important to you.” – Melissa Steginus\n“To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment.” – Ralph Waldo Emmerson\n10 Self-Care Quotes To Inspire A Positive Mindset\n“Each positive thought, every vibrant attitude, all purposeful activities water the seeds for success along your path.",
    "The secret to getting started is breaking your overwhelming tasks into small manageable tasks, and then starting on the first one.” – Mark Twain\n“Focus on being productive instead of busy.” – Tim Ferriss\n“If you don't pay appropriate attention to what has your attention, it will take more of your attention than it deserves.” – David Allen\n“Productivity is never an accident.",
    "You can prepare all you want, but if you never roll the dice, you'll never be successful.” – Shia LaBeouf\n“When you have to make a choice and don't make it, that in itself is a choice.” – William James\n“Your work is going to fill a large part of your life, and the only way to be truly satisfied is to do what you believe is great work.",
    "Because you deserve it.” – Unknown\n“Acknowledge, accept, and honor that you deserve your own deepest compassion and love.” – Nanette Mathews\n“When you recognize and reflect on even one good thing about yourself, you are building a bridge to a place of kindness and caring.” – Sharon Salzberg\n“Choose, every day, to forgive yourself.",
    "You are human, flawed, and most of all worthy of love.” – Alison Malee\n“People who love themselves come across as very loving, generous and kind; they express their self-confidence through humility, forgiveness, and inclusiveness.” – Sanaya Roman\n“Caring for your body, mind, and spirit is your greatest and grandest responsibility.",
    "A pedicure doesn't last, but meditating every day does.” – Carrie-Anne Moss\n“A person who is humble would never be abusive or selfish; so don't abuse yourself or withhold self-love or self-care.” – Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life\n“Setting boundaries is a way of caring for myself.",
    "And it should have room to evolve with you over time.” – Portia Jackson-Preston\n“No more martyring myself.” – Sharon E. Rainey\n“Our soul is like a soft and gentle flower; it needs to be nurtured, cared for, tended to, with sufficient sunlight, fresh air, and freedom to bloom into its most precious and beautiful form.",
    "Self-care is the fuel that allows your light to shine brightly.” – Unknown\n“Too many people overvalue what they are not and undervalue what they are.” – Malcolm S. Forbes\n“I found in my research that the biggest reason people aren't more self-compassionate is that they are afraid they'll become self-indulgent.",
    "Keep what is yours.” – C. JoyBell C.\n“Talk to yourself like you would to someone you love.” – Berne Brown\n“When you recover or discover something that nourishes your soul and brings joy, care enough about yourself to make room for it in your life.” – Jean Shinoda Bolen\n“Rest and self-care are so important.",
    "Once you've got your boat, you'll still be rocked by the waves of life, but you'll have a feeling of safety, and stability that means you can pick other people up on your way.” – Nadia Narain\n“I believe that self-care is a daily practice that should involve your interests, needs, and preferences.",
    "The rest of us just get up and go to work.” – Stephen King\n“Time is not refundable; use it with intention.” – Unknown\n“The key to productivity is to rotate your avoidance techniques.” – Shannon Wheeler\n“Starve your distraction and feed your focus.” – Unknown\n“Reflect on what you do in a day.",
    "I care about me too.” – Christine Morgan\n“Honoring your own boundaries is the clearest message to others to honor them, too.” – Gina Greenlee, Postcards and Pearls: Life Lessons from Solo Moments on the Road\n“Be kind to your body, gentle with your mind, and patient with your heart.",
    "Another way to use your favorite quotes is to write them down on Post-It notes, and stick them around your home, office, lunch box, in your fridge, or other random places to give yourself cute little love notes to uplift your mood, self-esteem, and confidence throughout the day.",
    "You may have never realized how some simple, harmless activities rob you of precious time.” – Vivek Naik\n“Start by doing what is necessary, then do what's possible, and suddenly you are doing the impossible.” – Saint Francis of Assisi\n“Time is an equal opportunity employer.",
    "You're just as important as anybody else.” – Stephanie Lahart\n“By taking care of myself, I have so much more to offer the world than I do when I am running on empty.” – Ali Washington\n“Life's too short to spend it at war with yourself.” – Unknown\n“Harmony begins within.",
    "You teach people how to treat you by deciding what you will and won't accept.” – Anna Taylor\n55 Self-Care Quotes To Inspire Productivity\n“The key is not to prioritize what's on your schedule, but to schedule your priorities.” – Stephen Covey\n“Stop what you are doing.",
    "'” – Izey Victoria Odiase\n“Whatever you are, be a good one.” – Abraham Lincoln\n“Doubt kills more dreams than failure ever will.” – Suzy Kassem\n“Happiness is the only thing that multiplies when you share it.” – Albert Schweitzer\n“There is enough time for self-care.",
    "It's the way you carry it.” – Lena Horne\n“Words may show a man's wit, but actions will show his meaning.” – Benjamin Franklin\n“Tomorrow hopes we have learned something from yesterday.” – John Wayne\n“I do not equate productivity to happiness.",
    "Eliminate the rest.” – Leo Babauta\n“If you have time to whine, then you have time to find a solution.” – Dee Dee Artner\n“When you waste a moment, you have killed it in a sense, squandering an irreplaceable opportunity.",
    "That is a truly revolutionary, celebratory mode of self-care.” – Sharon Salzberg\n“Self-care is giving the world the best of you, instead of what's left of you.” – Katie Reed\n“It is not the load that breaks you down.",
    "And you need both of those things.” – Tim Ferriss\n“The most beautiful people we have known are those who have known defeat, known suffering, known struggle, known loss, and have found their way out of the depths.",
    "It is always the result of a commitment to excellence, intelligent planning, and focused effort.” – Paul J. Meyer\n“The best way out is always through.” – Robert Frost\n“You don't need a new plan for next year.",
    "Make sure it's yours.” – Eleanor Brownn\n“How we care for ourselves gives our brain messages that shape our self-worth so we must care for ourselves in every way, every day.” – Sam Owen\n“Be kinder to yourself.",
    "Each human being has exactly the same number of hours and minutes in a day.” – Denis Waitley\n“He who is not courageous enough to take risks will accomplish nothing in life.” – Muhammad Ali\n“To think is easy.",
    "The other is as though everything is a miracle.” – Albert Einstein\n“A wise man makes his own decisions, an ignorant man follows the public opinion.” – Grantland Rice\n“Do something nice for yourself today.",
    "Using positive quotes helps you remember to make caring for yourself a priority, so you're living the best version of yourself instead of putting yourself through the wringer to accomplish your goals.",
    "The rest of the world can wait.” – Unknown\n“Sometimes the most important thing in a whole day is the rest we take between two deep breaths.” – Etty Hillesum\n“Love yourself enough to set boundaries.",
    "If we are to influence the world around us, even in minor ways, the real work begins inside and emanates outwards.” – Gudjon Bergmann\n“If you want to help her, you need to help yourself first.",
    "You have to win it” – Ralph Waldo Emmerson\n30 Self-Care Quotes To Promote Mental Health\n“The primary thing that people are going to try to take away from you— is the purity of your happiness.",
    "That is a truly revolutionary, celebratory mode of self-care.” – Sharon Salzberg\n“Be as kind to the person in the mirror as you are to others.” – Marilyn Suttle\n“Don't aim for perfection.",
    "Self-care is one of the most important things you can do in your daily routine to maximize your inner peace, increase your confidence and productivity, and improve your relationships.",
    "Parents and caregivers may also use quotes to teach their kids the importance of self-care and find self-care activities to do together that honor the meaning behind their selection.",
    "Without humble but reasonable confidence in your own powers, you cannot be successful or happy.” – Norman Vincent Peale\n“Simplicity boils down to two steps: Identify the essential.",
    "If some of us treated others as we treat ourselves, we would be jailed.” – Richard Paul Evans, The Mistletoe Promise\n“If we truly loved ourselves, we'd never harm another.",
    "But when you use the moment properly, filling it with purpose and productivity, it lives on forever.” – Menachem Mendel Schneerson\n“Amateurs sit and wait for inspiration.",
    "Self-care makes your use of time more sustainable.” – Jackie Viramontez\n“Doing something nice for myself is not selfish.” – Christine Morgan\n“Do something nice for you.",
    "You are worth the deeper breaths, and you are worth the time it takes to slow down, be still, and rest.” – Morgan Harper Nichols\n“It's okay to take time for yourself.",
    "However you practice them, these quotes will inspire you to take control of your self-care habits, and that will lead to a more sustainable future for you and yours.",
    "Applying those quotes to your life takes them to a whole new level, especially during life seasons that have you feeling overwhelmed, stressed out, and anxious.",
    "It's about listening to the needs of your soul and then honoring them.” – Kristi Ling\n“Learning self-care is like building your own lifeboat, plank by plank.",
    "Exhaustion affects your quality and productivity.” – Jeff VanderMeer\n“If you want something done, give it to a busy man.” – Preston Sturges\n“Grab a coffee.",
    "The world will not end if you take ten minutes for yourself.” – Fawn Germer\n“When you do something noble and beautiful and nobody notices, do not be sad.",
    "Surround yourself with people, color, sounds, and work that nourish you.” – Susan Ariel Rainbow Kennedy\n“The secret of getting ahead is getting started.",
    "These persons have an appreciation, a sensitivity, and an understanding of life that fills them with compassion, gentleness, and deep, loving concern.",
    "Sometimes all you need to do is protect yourself from your own self.” – Efrat Cybulkiewicz\n“If you do not respect your own wishes, no one else will.",
    "You teach people how to treat you by deciding what you will and won't accept.” – Anna Taylor\n“If we truly loved ourselves, we'd never harm another.",
    "Most people have gotten it wrong because our culture says being hard on yourself is the way to be.” – Kristen Neff\n“You only have one life to live.",
    "Choose one, write at the top of a new page in your journal, and write about what it means, how it applies to your life, and how it makes you feel.",
    "And then let your kindness flood the world.” – Pema Chodron\nApplying Self Care Quotes To Your Lifestyle\nReading a self-care quote is one thing.",
    "There is not enough time to make up for the life you'll miss by not filling yourself up.” – Jennifer Williamson\n“Be kinder to yourself.",
    "A less common use for your favorite positive quote is to use a dry erase marker to write it on your bathroom mirror each day or week.",
    "30 Self-Care Quotes To Remind You of The Importance Of Taking Care of Yourself\n“Exactly what are you wanting to teach your children?",
    "You deserve a break.” – Akiroq Brost\n“There is no cowardice in removing yourself from a wildly unhealthy and unwinnable situation .",
    "You are still becoming, my love, and there is no one more deserving of the nurturing grace of your love.” – Becca Lee\n“Be kind.",
    "A happiness so innocent, so spontaneous, and so raw… it is the way we are born, but it is most often not the way that we die.",
    "The question is: What are we busy about?” – Henry David Thoreau\n“There's a tendency to mistake preparation for productivity.",
    "Then maintain their beautiful growth through conscious self-care.” – Rebecca Gordon\n“The Golden Rule is a two-edged sword.",
    "To use your favorite inspirational quotes like taking mental vitamins, simply engage with them every day in various ways.",
    "You will simply attract people who disrespect you as much as you do.”– Vironika Tugaleva\n“Be patient with yourself.",
    "If we are in balance, it helps us in all our interactions.” – Faith Hill\n“Love yourself enough to set boundaries.",
    "For most people, happiness in life is a massive amount of achievement plus a massive amount of appreciation.",
    "Beautiful people do not just happen.” – Elizabeth Kubler-Ross\n“There are only two ways to live your life.",
    "Gently accept your humanness.” – Deborah Day\n“For me, recovery and self-care are inextricably connected.",
    "Self-care does not mean you stop caring about others; it just means you start caring more about you.",
    "As with all matters of the heart, you'll know when you find it.” – Steve Jobs\n“Believe in yourself!",
    "I want to pamper myself and do the best for my body.” – Kriti Kharbanda\n“Take care of your body.",
    "You can stop.” – Scaachi Koul\n“It is only when we feel deprived that we resent giving to others.",
    "We give so much of ourselves to others, and we need to be fueled both physically and mentally.",
    "When you take time to replenish your spirit, it allows you to serve others from the overflow.",
    "More Articles by Wealth of Geeks\nThis article was produced and syndicated by Wealth of Geeks.",
    "This, my friend, is self-love.” – Miya Yamanouchi\n“Respect, Love, and Value yourself.",
    "This meant people, jobs, my own beliefs, and habits – anything that kept me small.",
    "The time will never be just right.” – Napoleon Hill\n“It is not enough to be busy….",
    "It doesn't make me mean, selfish, or uncaring because I don't do things your way.",
    "You have to protect the purity of your happiness and the innocence of your joy.",
    "It has to start within your heart to know what you need to navigate your life.",
    "How to love and care for themselves, or how to neglect and abandon themselves?",
    "Now I see it as self-loving.” – Kim McMillen\n“You are worth the quiet moment.",
    "One popular way to use inspiring quotes is to journal what they mean to you.",
    "This, my friend, is self-love.” – Miya Yamanouchi\n“Be kinder to yourself.",
    "Still, as with so many aspects of life, it can be easier said than done.",
    "Create miracles.”– Elyse Santilli\n“Without ambition, one starts nothing.",
    "That is where it begins” – Seed & Song\n“You are worth the quiet moment.",
    "I just want to make sure that I do everything to take care of myself.",
    "Stay true to your spirit, cherish your soul and never doubt yourself.",
    "There's no greater investment.” – Stephen Covey\n“Invent your world.",
    "Always remember to be good to yourself by taking care of yourself.",
    "And the only way to do great work is to love what you do.",
    "The world comes in and tries to take that away from you.",
    "They believe self-criticism is what keeps them in line.",
    "I have learned not to jump into the pigsty with them.",
    "Start thinking about yourself more and others less.",
    "Pay attention to these and feed them appropriately.",
    "People come in and try to take that away from you.",
    "Make yourself a priority and know that it's okay.",
    "You will encounter many seeds for success today.",
    "Rare is it to find in someone a pure happiness.",
    "They're full of eagerness, zest, productivity.",
    "Don't feel guilty for loving yourself first!",
    "Find some quiet, sit in stillness, breathe.",
    "You don't have to be available to everyone.",
    "Featured Image Courtesy of Wealth of Geeks.",
    "You shouldn't feel like you have to play .",
    "If you haven't found it yet, keep looking.",
    "Self-growth is tender; it's holy ground.",
    "One is as though nothing is a miracle.",
    "Without work, one finishes nothing.",
    "Be all of these things to yourself.",
    "Your time and energy are precious.",
    "The prize will not be sent to you.",
    "Your time and energy are precious.",
    "You get to choose how you use it.",
    "You get to choose how you use it.",
    "So I want to do the best for me.",
    "People WILL try to take it away.",
    "Don't go there, don't let them.",
    "My judgment called it disloyal.",
    "Aim for ‘better than yesterday.",
    "you don't owe anyone anything.",
    "Have faith in your abilities!",
    "Put your problems on pause.",
    "Journal your intentions.",
    "Go outside and breathe.",
    "To act is difficult.",
    "No one is perfect.",
    "Be accepting.",
    "Don't settle.",
    "Get to work.",
    "Be generous.",
    "Be patient.",
    ".",
    ".",
    ".",
    "."
  ]
}