{
  "id": 7290,
  "mediaId": 2746,
  "date": "2022-04-04",
  "headline": "‘AOC of the Midwest’ seeks to battle Democratic establishment in bid for open Senate seat",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/28/Election_2022_Senate_Ohio_34015.jpg-f0721_c0-0-4552-2655_s1200x700.jpg?30b98800976764133191577aff68bd9f5a60faba",
  "link": "https://www.washingtontimes.com/news/2022/apr/4/morgan-harper-aoc-midwest-seeks-battle-democratic-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    3049,
    2765,
    4326,
    5408,
    1819,
    2290,
    1489,
    958,
    392
  ],
  "sentences": [
    "We need to be honest about who is winning in Ohio as a Democrat, and what that needs to look like and be about to have a shot at winning the seat in November.”\nMs. Harper, a consumer protection attorney, is one of many progressive candidates seeking to oust an incumbent or win an open seat across the nation in this election year.",
    "… It’s really from a lot of different types of Ohioans that I’m hearing frustration around the lack of movement on that issue.”\nIf elected, Ms. Harper would be the sole Black woman serving in the Senate — a feat that would reflect the growing diversity in the Democratic Party, both in representation and ideology.",
    "Ms. Harper has been using her personal story of living in foster homes and working her way up to eventually earn degrees from Tufts, Princeton, and Stanford universities and briefly serve as an adviser in the Obama administration, to inspire others.",
    "“In this moment, we need to have a U.S. senator who is going to be firm in what they believe in and really fight for implementing the policies we need.”\nMr. Ryan’s campaign defended the congressman’s record on gun control and abortion rights.",
    "But Ms. Harper, who is competing against tech executive Traci Johnson and 10-term Rep. Tim Ryan in the Democratic primary, said the chances of flipping Mr. Portman’s seat blue could increase if her party puts forward a fresh face.",
    "“Tim is proud of his record of fighting to expand health care access and bring down costs, protecting reproductive rights, and keeping our communities safe from gun violence,” said Izzi Levy, spokeswoman for Mr. Ryan’s campaign.",
    "Ms. Harper was highly critical of the Ohio Democratic Party’s decision to endorse Mr. Ryan before the primary election, accusing the lawmaker of having switched his views on abortion rights and supporting universal health care.",
    "Among her goals, Ms. Harper wants to spend more money on renewable energy, modernize and expand access to public transportation, boost rural communities through broadband expansion, and cancel student debt.",
    "Ms. Harper was endorsed by the youth climate advocacy group Sunrise Movement and Justice Democrats, a liberal political action committee that’s backed Rep. Alexandria Ocasio-Cortez of New York.",
    "The 38-year-old Senate candidate in Ohio champions ideas like Medicare-for-All and eradicating student debt, while being unafraid to criticize what she views as her party’s shortcomings.",
    "She’s sworn off corporate donations and has been knocking on doors in areas across the state where Democrats haven’t had much sway, including rural, conservative-leaning counties.",
    "Mr. Ryan is the heavy favorite among campaign donors, ending 2021 with $5 million in his war chest, more than 10 times the amount that Ms. Harper had on hand.",
    "Election forecasters say that Ohio, which voted twice for former President Donald Trump, is likely to elect another Republican to replace retiring GOP Sen.",
    "Aside from Mr. Brown’s reelection in 2018 and President Barack Obama’s victories in 2008 and 2012, no other Democrat has won statewide in Ohio since 2006.",
    "Part of Ms. Harper’s criticism includes the party’s failure to support left-wing candidates like herself over more moderate, establishment-type Democrats.",
    "Ms. Harper also hit at Mr. Ryan for once having an “A” rating from the National Rifle Association, a gun-rights group most often associated with the GOP.",
    "Ms. Harper’s grassroots approach to her campaign has become known as “Morganizing” to engage voters to seek an alternative option to the status quo.",
    "Mrs. Beatty, who chairs the Congressional Black Caucus in the House, got roughly 68% of the vote, compared with Ms. Harper, who got around 30%.",
    "The candidate called the lack of progress on eradicating student debt her “biggest point of frustration” with the Biden administration.",
    "“Look at the history of who the Ohio Democratic Party has chosen to run for open Senate seats,” Ms. Harper told The Washington Times.",
    "Vance, former state treasurer Josh Mandel, investment banker Mike Gibbons, and former Ohio GOP Party chairwoman Jane Timken.",
    "The state’s other senator, Democrat Sherrod Brown, is considered among the more liberal lawmakers in the Senate.",
    "“My main opponent in the primary has formerly been a member of the NRA and had an ‘A’ rating,” Ms. Harper said.",
    "In 2020, she primaried Democratic Rep. Joyce Beatty for Ohio’s third district, which includes Columbus.",
    "“That was a promise that was made during the election,” Ms. Harper said of canceling student debt.",
    "Embracing that, Ms. Harper says, could be the difference between winning and losing in November.",
    "We really have a chance and a mandate to not just do the same old thing and choose a better way.",
    "“In Ohio, we’ve been doing a lot of the same old thing and losing as Democrats,” she said.",
    "My campaign is about that.”\nOhio’s primary election will be held on May 3.",
    "Ms. Harper is no stranger to taking on longtime incumbents in Congress.",
    "Morgan Harper considers herself among the next generation of Democrats.",
    "Republicans in the crowded primary include Hillbilly Elegy author J.D.",
    "She’s even been coined the “AOC of the Midwest” by some media outlets.",
    "“It is a huge burden for all sorts of people.",
    "The general election is Nov. 8.",
    "He won a third term in 2018.",
    "“We can’t accept that.",
    "“They’ve all lost.",
    "Rob Portman."
  ]
}