{
  "id": 7797,
  "mediaId": 2745,
  "date": "2022-04-07",
  "headline": "The Trailer: Some called his anti-China ad dangerous. Here's why Tim Ryan kept running it.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ISO6S4VVWQI6ZA2YECVBMNK7WQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/07/trailer-trailer-some-called-his-anti-china-ad-dangerous-here-why-tim-ryan-kept-running-it/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    1819,
    2571,
    1126,
    392,
    6474
  ],
  "sentences": [
    "The repetition of the word China, the way he said it, so animated and angry — we worried it would stoke the same kind of fears that led to rises in Asian hate crimes as happened when Trump did it.”\nRyan first defended the ad in a statement to NBC News, explaining that he’d spent his “entire career sounding the alarm on China” and would “never apologize for doing everything in my power to take on China and fight for all Ohioans.” That ignored the main criticism from AAPI groups: That talking about China in this way, by definition, put Asian Americans at risk.",
    "Rob Portman (R-Ohio), who’s retiring this year, said he’d been “protecting Ohio jobs when China cheats.” Former governor Ted Strickland, the Democrat who lost to Portman, accused him of being “the best senator China’s ever had.” None of Ryan’s most prominent endorsers backed away from supporting him over the ad; the most they’d say was that he had other material he could have used.",
    "It got the attention of Fox News, which played up the twist that the anti-China rhetoric “comes from a Democrat, not a Republican.” It also surprised the members of an organization called Asian American Midwest Progressives, which put out a statement accusing Ryan of using “anti-Asian rhetoric popularized by extremist right-wing Republicans,” and urging him to take it down.",
    "Nobody is obligated to follow their recommendations, but I as governor, and I believe the legislature, as well as the news media, would all take them very seriously, since they could be the basis for a new consensus approach to the things that the legislature has struggled to gain consensus on like education, housing, energy, water and homelessness.",
    "Mike Durant, a retired Army pilot who was captured in Somalia during the “Black Hawk Down” incident, has poured resources into ads that tell that story, linking them to his politics — like this one, which tells the war story and says it's why the candidate will fight to end a ruling establishing a constitutional right to legal abortion.",
    "Citizens for Josh Mandel, “Equality.” This is one of two new ads in Ohio's GOP U.S. Senate primary, but only Mandel's features the candidate walking on the Edmund Pettus Bridge in Selma, Ala. (In Mandel's take, the Selma to Montgomery March was made “so skin color wouldn't matter,” not to get the Voting Rights Act passed.)",
    "In Ohio, GOP Rep. Bob Gibbs announced his retirement, citing exhaustion with the tangled and lengthy process by which the state redistricting commission finally produced its maps — and put him in a district with Trump-endorsed candidate Max Miller, most of which he'd never represented since arriving in D.C. 11 years ago.",
    "He created an economy pre-pandemic that was one of the strongest this nation has ever seen.”\nWhile Cotton focused most on the failures of liberalism, Noem talked about her experience in South Dakota, a “laboratory of democracy” that raced in the other direction when blue states were instituting covid-19 mandates.",
    "Biden won within the seat's current lines by 10 points, but Republicans believe that Democrats in places such as this are vulnerable now, and Green's pre-primary ad combines a general election-ready bio — her war experience — with appeals to the Republicans who make up a minority of the district's voters.",
    "“Radical woke professors” approved school textbooks, says a narrator, “pushing critical race theory.”\nMcSwain for Governor, “Don't Gamble for Governor.” The first negative ad from Bill McSwain's GOP gubernatorial campaign in Pennsylvania attacks three of his rivals as risky, unreliable and liberal.",
    "… 26 days until the next primaries\n… 47 days until Texas runoffs and the special primary in Minnesota's 1st Congressional District\n… 65 days until the special House primary in Alaska\n… 68 days until the special election in Texas's 34th Congressional District\n… 209 days until the midterm elections",
    "The knock on state Sen. Doug Mastriano (R) is that he voted for “unconstitutional mail-in voting,” a fundamental issue in the race that every rival has attacked; McSwain goes after businessman Dave White and former congressman Lou Barletta for, earlier in their political careers, raising taxes.",
    "She got more applause when she referred to “the strongest bill in the nation to protect girls' sports,” focusing on how a debate that started controversially — with Noem being criticized by conservatives for vetoing one version of a transgender sports bill — ended with her delivering for girls.",
    "Do you think President Biden should have said this, or not?” (Quinnipiac University, March 31-April 4, 1436 adults)\nThe president's comment that seemed to endorse regime change in Moscow got more sustained negative coverage than anything else he'd said about Russia's invasion of Ukraine.",
    "Former state legislator Connie Conway easily secured a spot in the June 7 runoff, but didn’t come close to the 50 percent needed to win outright; Democrat Lourin Hubbard captured 20 percent of the first ballots, with nearly 2,900 more votes than Matt Stoll, a first-time GOP candidate.",
    "Our efforts to create universal shelter, and medical treatment, will be the embryo of Cal-Psych, the statewide psychiatric and addiction care system we need, given the understandable failure of the counties to deal with the psychiatric and addiction disaster we call homelessness.",
    "Vance said that “more illegal drugs and more Democrat voters” were crossing the border, mocking the idea that it was “racist” to talk about it; and Republican Josh Mandel released an ad invoking Martin Luther King Jr., then argued with one of King's daughters for criticizing it.",
    "He should have included natural gas, which has helped cut U.S. emissions 22 percent between 2005 and 2020, and nuclear, a controversial technology but one that produces no air pollution or carbon emissions and is recognized by experts as necessary to decarbonize our economy.",
    "I don’t think Newsom is the same as the doctrinaire anarchists posing as homeless advocates in places like L.A. On the contrary, I think he’s really cynical, and doesn’t care that much about the impact of his policies, so long as they help him to grab the next brass ring.",
    "And I will make sure laws are being enforced equally and fairly, including laws against public camping, public drug use and public defecation, since law enforcement is necessary to have a functioning civilization, as well as to provide help to the people who need it.",
    "“\nMeng had passed, and Ryan had supported, a “Covid-19 Hate Crimes Act\" that linked a “dramatic increase in hate crimes and violence against Asian-Americans and Pacific Islanders” to how public figures talked about the pandemic and its origins in Wuhan, China.",
    "Morgan Harper, the consumer rights attorney challenging Ryan in the May 3 primary, responded to him with a 20-second video that clipped together his mentions of China with quotes from Trump, accusing the congressman of being “Trump-esque” in his word choice.",
    "We made huge progress as a society in reducing tobacco consumption by stigmatizing cigarette smoking but are now doing something closer to the opposite with marijuana, psychedelics and even harder drugs, with many people attempting to destigmatize their use.",
    "While the GOP dominated in the outer suburbs of Milwaukee, and won the county executive job in traditionally Democratic Kenosha, Democrats unseated a local legislator who’d posed as a 2020 elector for Trump and limited the GOP’s wins in school board races.",
    "That way, it wouldn’t look to us like you’re talking to an all-White audience about people who don’t look like them.”\nThe scene at a premiere of “Rigged,” including at least one Republican currently investigating 2020 with subpoenas in a swing state.",
    "“He believes the unborn deserve the same.”\nSchool Freedom Fund, “Textbook.” Most GOP attacks on former North Carolina governor Pat McCrory, making a comeback bid for U.S. Senate, have portrayed him as a liberal who'll betray true conservatives.",
    "Conservatives saw that as a Pyrrhic victory, with a Democrat who was already serving as mayor (former mayor Tom Barrett left for an ambassadorship) getting $100,000 from a state Democratic Party that could have spent that elsewhere.",
    "Some of her loudest applause came when she said South Dakota was the only state in the nation that never ordered businesses closed, though there was no mention of the state's death rate and how it compared with the lockdown states.",
    "That ad has little value if it’s not planted in the fertile soil of anti-Chinese sentiment.”\nRyan’s critics are effectively saying that he's not that he’s stoking anti-Asian racism, but that he’s picking fruit from a poisoned tree.",
    "Penn Progress, “Who Can Dems Trust?” If you read the last Trailer, you learned about the new, negative phase of Pennsylvania's Democratic U.S. Senate primary, with this PAC supporting Rep. Conor Lamb (D-Pa.) starting to mobilize.",
    "It’s understandable that a lot of people think that if you’re not a Democrat then you must be a Republican, since it has seemed like those are the only two options, but there’s a third option, which is the vision I’m offering.",
    "I will win by inspiring voters around my humanistic vision of solving the crisis by creating a cost-effective statewide psychiatric and addiction care system, a Shelter First, Housing Earned policy, and enforcing laws equally.",
    "That's roughly 10 times as much as Blake Masters, the Republican former president of the Thiel Foundation whose viral straight-to-camera ads have helped him gain a national audience and the endorsement of the Club for Growth.",
    "The result was a Democratic Senate hopeful deciding that claims of insensitivity and harm didn’t outweigh the risk if Republicans, and only Republicans, got to tell voters that a foreign enemy was responsible for their pain.",
    "A week after the “One Word” ad started running, it’s still on TV, with Ryan blowing off criticism from his Democratic primary opponent, other Asian American political groups and even one of his House Democratic colleagues.",
    "She stresses her bipartisan credentials and brings up former Republican governor Sam Brownback, who won two terms but passed tax cuts that alienated suburban voters once they started creating problems for public schools.",
    "That’s down 10 points from what Democrats won in elections there when Donald Trump was president, though the state will continue to count ballots, and accept mail ballots sent by Election Day, until the end of next week.",
    "But when he was running, Faulconer held an endorsement event with Michael Shellenberger, an author who wasn't even a Republican, and had run for governor as a Democrat in 2018, getting less than 1 percent of the vote.",
    "Increasing the availability, lowering the cost and promoting the use of drugs, including tobacco and alcohol, increases their use, and so restrictions on alcohol and marijuana sales and promotion make good sense.",
    "Shellenberger saw a different electoral landscape this year, and voters who might be open to the argument he made in his book “San Fransicko” — that well-intentioned progressive government had wrecked the state.",
    "A citizens jury would impanel several hundred representative citizens randomly selected to deliberate publicly on the big issues up and down the state over a period of a year, hearing from experts on all sides.",
    "Kristi L. Noem (R) headed to the Reagan Library on Wednesday for the latest in its “Time for Choosing” series, a set of speeches from Republicans with national — and, everyone assumes, presidential — ambitions.",
    "With no party infrastructure, and no fundraising network, he's tried to turn the attention he was already getting as a frustrated ex-liberal, like interviews with Joe Rogan, into promotions for his campaign.",
    "There is always the risk that if you make marijuana too expensive, through taxes or regulation, you’ll increase black market demand, and thus aid the hard drug trade, so we need to find the right balance.",
    "This PAC's ad does just that, highlighting the Democratic appointments McCrory made to the state education, and citing that as the reason so many things Republicans can't stand have been debated.",
    "In other midterm cycles, even when incumbents were unpopular, it was rare to see challengers in hard-to-flip seats identifying themselves strongly with the presidential nominees who'd just lost.",
    "In this edition: What Democrats learned from a much-criticized ad in Ohio, what happened in this week's elections, and why a contrarian author believes he can be the next governor of California.",
    "I have that vision, not just on solving homelessness, but also on dramatically improving California’s schools through greater parental choice, and creating abundant energy, housing and water.",
    "Swan, a retired Marine colonel running in Georgia's 10th Congressional District, begins talking about Russia's invasion of Ukraine, asking why a foreign power had the hubris to launch a war.",
    "“There are legitimate critiques to make of Chinese policies and officials, so it’s glaring that this ad doesn’t actually mention the corporations that are responsible for job losses in Ohio.",
    "“Republicans think they crush socialist Fetterman,” a narrator warns, referring to a Politico story that asked whether Fetterman's support for criminal justice reform was an electoral risk.",
    "Newsom’s focus is to become president, which is why he won’t stand up to the ACLU and George Soros, who donated $1 million to the campaign to defeat the proposed recall of Newsom last year.",
    "Senate Democrats knew the ad was coming and didn't like it; on the trail, Fetterman has begun saying that he won't spend his money “attacking fellow Democrats,” but he's criticized the ad.",
    "The party began prioritizing school board races again last year, with former lieutenant governor Rebecca Kleefisch, now a candidate for governor, endorsing 48 candidates around the state.",
    "One of McSwain's selling points: “Has never run for office.”\nLaura Kelly for Kansas, “Back on Track.” Red-state Republicans running for governor have run ad after ad on cultural issues.",
    "“I didn't do two tours in Anbar province, fighting along Marines of every color, to come home and be called a racist,\" says Mandel, as pictures from his time in Iraq appear on-screen.",
    "“The GOP tried to fire a silver bullet,” said Wisconsin Democratic Party chair Ben Wikler, “and got a mixture of buckshot, confetti and kickback.”\nStill, the GOP had the better night.",
    "Nobody has been a bigger champion of “Housing First” than Newsom, and yet it was obvious that simply giving away free apartment units to whoever demanded one was never going to work.",
    "The Committee to Elect Jennifer-Ruth Green, “Battle Proven.” Republicans don't usually compete for northwest Indiana's 1st Congressional District, but it's shifted right since 2016.",
    "Fear of a nuclear conflict with the Soviet Union faded after 1984, and the U.S.S.R. itself collapsed in 1991, so adults born after the mid-'70s have no real memory of the Cold War.",
    "But there is a lot we can do in the first two years through the highly selective use of emergency orders and legislation that we put in place working closely with the legislature.",
    "What's significant, they say, is that Ryan didn't change course after he got criticized — criticism rooted in a desire to abandon any campaign rhetoric that reminds them of Trump.",
    "Democrats everywhere have watched Republicans up and down the ballot use Trump-style rhetoric — with some even leaning in to the idea that what they're saying will offend people.",
    "MS: I voted first to medicalize and then decriminalize, and support the decriminalization of marijuana and other psychedelics, but not hard drugs, for medical and spiritual use.",
    "Republicans fared even better in Oklahoma’s Tuesday races, capturing the mayor’s office in Norman, home to the University of Oklahoma and a 9-point victory for Biden in 2020.",
    "After the pandemic began, Republicans circulated a 57-page talking point memo, the \"Corona Big Book,\" advising candidates on how to attack China when talking about covid-19.",
    "“I would've suggested that Tim introduce himself to voters with a more biographical ad,” Sen. Sherrod Brown (D-Ohio), who has endorsed Ryan, told Spectrum News on Tuesday.",
    "In California, Republican candidates dominated the race to fill the 22nd Congressional District, with Democrats getting just 35 percent of the vote as of Thursday morning.",
    "If I'm elected, I believe I will have a mandate to keep Diablo Canyon operating, but will need to build a wider and stronger societal consensus for energy going forward.",
    "It may be that we will need to change the constitution in order to create Cal-Psych, in which case I will return to voters in 2024 with one or more ballot initiatives.",
    "Few of Ryan's fellow Democrats have criticized the ad, or the China-focused strategy, as they try to reintroduce themselves to voters who left the party after 2016.",
    "“It’s important for us to hold lawmakers and candidates accountable for rhetoric, and actions they’re taking, that put our community in harm’s way,” Kulkarni said.",
    "MS: It will be necessary to use them to shut down the open air drug scenes we mislabel “homeless encampments” and get people the shelter and medical care we need.",
    "“Frankly, we didn’t think that Tim Ryan meant that Asians should be targeted,” said Shekar Narasimhan, chairman of the AAPI Victory Fund, which condemned the ad.",
    "While the legislation didn’t name the source, the data came from Stop AAPI Hate, a group formed in March 2020 that compiled evidence of anti-Asian harassment.",
    "Most of the GOP’s wins came in southeast Wisconsin, both in traditionally Republican places like Waukesha County and in places where the party had struggled.",
    "TT: I've heard a lot about a State of Emergency on homelessness recently, especially from candidates for Los Angeles mayor who are promising to declare one.",
    "Durant for Senate, “Life.” Donald Trump's endorsement in Alabama's U.S. Senate race is up for grabs, after he ditched Republican Rep. Mo Brooks (R-Ala.).",
    "For the last 60 years, environmental groups have sought to restrict energy, housing and water supplies as a way to reduce population growth in the state.",
    "Despite the grave danger of more blackouts, Newsom is moving forward with his utterly insane plan to shut down our largest nuclear plant, Diablo Canyon.",
    "TT: When you talked to Joe Rogan recently, you condemned the “radical woke ideology funded by George Soros and the ACLU over decades.” What do you mean?",
    "Ryan was shown in familiar campaign-style settings, including a union hall and a hometown diner, giving the same populist speech, all spliced together.",
    "Laura Kelly, a Democrat who's faced a GOP supermajority in Topeka, frames her reelection campaign as the best way to avoid a backslide to GOP control.",
    "It’s not a substitute for the legislative process, which must also occur, but a way of broadening the conversation and turning down the temperature.",
    "Our polling shows that we draw equal support from Democrats, independents and Republicans alike, and so when I win, I’ll have a governing majority.",
    "Michael Shellenberger: A lot of people understandably think Gavin Newsom is unbeatable, but they’re wrong: He’s hugely vulnerable on homelessness.",
    "It is us versus China.”\nRyan’s campaign announced a $3.3 million ad buy, putting the “One Word” spot on Ohio TV screens through the May 3 primary.",
    "MS: Newsom waived air pollution regulations so that California could use more diesel, our dirtiest way to make electricity, to prevent blackouts.",
    "MS: Newsom has spent the last 20 years advocating and implementing policies that made the open drug scenes, homelessness and crime crisis worse.",
    "It is our humanitarian duty, and legal obligation, as upheld by the Supreme Court, to provide clean, safe and basic shelter for all who need it.",
    "Gavin Newsom (D) easily defeated a recall attempt last year, the state's best-known Republicans decided not to challenge him for a second term.",
    "Ryan's campaign expressed openness to meeting with the groups that had condemned the ad, but it ruled out re-editing it to satisfy the critics.",
    "Republican-backed candidates ousted the Waukesha board’s Democrats, flipped the majority in Wausau and unseated Judge Lori Kornblum, whom Gov.",
    "Democrats are more likely than Republicans to praise Biden, but the gap between them is much smaller than on almost any other aspect of Biden.",
    "They believed that by mentioning “China” eight times in one ad, he was avoiding the real issues and bad actors for an easy, Trump-like insult.",
    "But a large group of individuals still receive large cash welfare benefits, and food stamps, if they claim to be volunteering for a nonprofit.",
    "Newsom started his career with the “Care Not Cash” campaign to reduce San Francisco's benefits to the homeless, so where does he fit in here?",
    "Newsom announced to combat homelessness, as I understand it, because he's pledging more money without a unified statewide plan to tackle it.",
    "I’d just say again: I think you want to introduce yourself with an ad about who you are and where you came from.”\nThat ad might come later.",
    "But I strongly favor restrictions on marijuana marketing, particularly marketing aimed at young people, such as flavored vapes and edibles.",
    "Every day I feel gratitude for the open space parkland protected near my house, where I can take long hikes and see relatively few people.",
    "The final disclosure deadline is eight weeks away, but candidates with fundraising hauls to brag about are jumping at the chance to do so.",
    "made at the library last month, Noem's didn't lay out an agenda for the party in 2023, or put Trump in a historical Republican context.",
    "Other Democrats offered a different theory as to why the ad sounded familiar — past Rust Belt candidates talked like this all the time.",
    "The bill aimed to deter and respond to hate crimes, citing “nearly 3,800 reported cases of anti-Asian discrimination” since March 2020.",
    "The result of those pro-scarcity policies is that we have protected a huge amount of land that might not have been protected otherwise.",
    "In Nevada, Sen. Catherine Cortez Masto (D) had a $4.4 million quarter, though it's not clear yet what her Republican opponents raised.",
    "I changed my party affiliation to independent because I was upset by the role my party had played in creating the homelessness crisis.",
    "“I knew that elections have consequences, and I did not want to wake up and have a leader who wouldn't put America first,” Noem said.",
    "Newsom pioneered the strategy of defunding shelters out of the notion that we could just put everybody into apartment units instead.",
    "The intent of the pushback was getting a populist Democrat to set a good example for other candidates, and make China-bashing toxic.",
    "The deal was called “Care Not Cash” and it cut welfare benefits for a small group who received unconditional Housing First housing.",
    "In two spots that debuted within hours of each other, and went on the same Ohio airwaves as Ryan, Republican Senate candidate J.D.",
    "What's your strategy for getting past the June primary and into the November runoff, and once there, your strategy for winning it?",
    "She mentioned the 45th president just once, saying that she campaigned for him in more states than any other Republican governor.",
    "Tony Evers had appointed to the second district court of appeals, which covers the southeast part of the state outside Milwaukee.",
    "Republicans found plenty to celebrate after Tuesday’s local elections in Wisconsin, but Democrats didn’t walk away with nothing.",
    "The vast majority, 34 of them, triumphed — an improvement from November, when attempts to recall liberal school members fizzled.",
    "The results speak for themselves.”\nDemocrats did better in the rest of the state, and Republicans made no headway in Milwaukee.",
    "Bob Donovan, a former alderman who’d lost the 2016 mayoral race by 40 points, lost this one, to Cavalier Johnson, by 43 points.",
    "We might need it or we might not, but it’s impossible to know so long as we don’t have a functioning mental health care system.",
    "Ryan’s critics, including Rep. Grace Meng (D-N.Y.), said that China-bashing led to \"increased violence against Asian Americans.",
    "California already has drug courts and mental health courts but Newsom wants to create yet another mental health care system.",
    "How has the overall trend toward decriminalization and harm reduction — for other, more dangerous drugs — affected the state?",
    "TT: Why did you run as a Democrat in 2018, and why are you running as an independent No Party Preference (NPP) candidate now?",
    "That proposition undermined the ability of law enforcement to shut down open drug scenes and get addicts the care they need.",
    "“It’s pretty heavy-handed,” said Sharon Kim, an organizer with AAMP, the group that first called for Ryan to scrap the ad.",
    "MS: Newsom defeated the recall because he didn’t face an opponent with a vision for solving the state’s biggest problems.",
    "“Wisconsin Democrats bragged extensively about their operation in the state,” Sen. Ron Johnson (R-Wis.) wrote on Twitter.",
    "He promised to be a moderate president but instead sought a radical agenda that was out-of-step with what voters wanted.",
    "I support the reform of Proposition 47, which decriminalized hard drugs and the shoplifting of items valued under $950.",
    "Sixty-six percent of voters say he’s doing a poor or very poor job on the issue, which is the top issue in the state.",
    "John Fetterman a “socialist” three times, once paraphrasing an article and once quoting a county GOP's attack on him.",
    "His administration's cleanup didn't help, with teeth-clenching insistence that Biden hadn't really said what he said.",
    "The last campaign for this Senate seat, six years ago, featured a flurry of attacks and counterattacks about China.",
    "He could have won historic climate and energy legislation had he not put all of his eggs in the renewables basket.",
    "So many of our problems are a result of artificial scarcity and the lack of vision and leadership to overcome it.",
    "But the first gut check with voters finds that the comment was more popular, by a few points, than Biden himself.",
    "Adults under 50 agree that Biden was right to say that Putin can't stay in power, while voters over 50 disagree.",
    "Sen. Mark Kelly (D-Ariz.) announced another eight-figure haul for the first three months of 2022: $11.3 million.",
    "The harassment that mentioned China specifically typically invoked the pandemic, not China’s economic strategy.",
    "“This was our message, until Trump stole it,” said one Democratic strategist who'd worked on Ohio campaigns.",
    "Former San Diego mayor Kevin Faulconer, who placed fourth on the recall ballot, ruled out another campaign.",
    "We need to regulate alcohol and marijuana alike in ways that prioritize public health over private profit.",
    "Newsom has long claimed to have stood up to the radical Left on homelessness when in truth he made a deal.",
    "“His administration restored America's dominance on the world stage and made the U.S. energy independent.",
    "The idea that gender talk will “destroy” the military is slowly moving from TV commentary into campaigns.",
    "Rising polarization and social media have made all sides too certain about their views and too dogmatic.",
    "None was linked specifically to campaign rhetoric, though one included a reference to President Biden.",
    "TT: Why, given that frustration with how the state is going, did Newsom defeat the recall so handily?",
    "“It's about fairness and about giving young women an opportunity to succeed.”\nAfter California Gov.",
    "It just embraces the China threat narrative.”\nThat narrative, as Kim described it, changed in 2020.",
    "But any amount of China-bashing, said Stop AAPI Hate co-founder Manjusha Kulkarni, was too much.",
    "Do you support the current 2024 timeline for a fracking ban, or would you change that/scrap it?",
    "“Mike Durant was saved by his brothers, his life spared by the grace of God,\" a narrator says.",
    "Biden could have created a broad coalition by endorsing some uses of natural gas and nuclear.",
    "The complexity of the issue makes drug regulation a good topic for a citizen’s jury process.",
    "TT: What's your four-year, first term time frame for expanding nuclear power in California?",
    "Mitchell Swan for Congress, “Insane.” It could have come straight from Fox News prime time.",
    "“If you’re going to mention China as the instigator of all this, then use some AAPI faces.",
    "“Our data shows that what they’re doing, whether intentional or not, is making that worse.",
    "We must defend the inherent dignity of all individuals, regardless of race, sex or class.",
    "Housing must be earned through sobriety or other goals toward recovery and independence.",
    "It’s definitely China,” Ryan says to different groups of voters at the start of the ad.",
    "He feels he needs them to win over Democratic primary voters in Iowa and New Hampshire.",
    "Everywhere he went, the Democrat talked about the threat China posed to American jobs.",
    "Protecting workers’ rights, raising the minimum wage — that’s not discussed in the ad.",
    "Most of that harassment, according to Stop AAPI Hate’s latest report, has been verbal.",
    "It was the same speech he’d been giving for years, with only his hair color changing.",
    "The warnings about Fetterman get alternated with the most electable facts about Lamb.",
    "“President Joe Biden said Russian President Vladimir Putin cannot remain in power.",
    "Activists wanted to leave this kind of messaging to former president Donald Trump.",
    "The idea behind Rep. Tim Ryan’s (D-Ohio) first U.S. Senate campaign ad was simple.",
    "Telling Ohio workers that he’d protect their jobs was fine, even to his critics.",
    "I voted for Joe Biden, but am very unhappy with his failure to lead the country.",
    "Wokeism is as serious of an attack on liberal democracy as radical conservatism.",
    "TT: How would the “citizens jury” on energy, one of your campaign planks, work?",
    "I am deeply disturbed by how radical some on the Left and Right have become.",
    "I will create the statewide psychiatric and addiction care system we need.",
    "“We don’t want another candidate to run off and do this,” said Narasimhan.",
    "And we should consider the positive role that pro-social stigma can play.",
    "We were feared by our adversaries, and we were respected by our allies.",
    "MS: I was inspired by the citizens jury model I saw in South Korea.",
    "“I'll advance President Trump's America First policies,” she says.",
    "We must defend our liberal democratic system from both extremes.",
    "But the cost of these pro-scarcity policies is also very high.",
    "I will reverse that decision and keep Diablo Canyon operating.",
    "I will put in place a Shelter First, Housing Earned policy.",
    "Few of the incidents, around 1.2 percent, occurred in Ohio.",
    "MS: I was a lifelong Democrat until April of last year.",
    "“I don't have an opinion on whether it should stay up.",
    "TT: Did you vote to legalize marijuana in California?",
    "“But this was clearly something we need to call out.",
    "“Make no mistake, it's about fairness,” Noem said.",
    "Gender dysphoria and woke training,” says Swan.",
    "Red-state Democrats aren't taking that route.",
    "Is it advisory or would it have power to act?",
    "This will be [the] place for a citizens jury.",
    "Nobody is essentially a victim or oppressor.",
    "Unlike the remarks Sen. Tom Cotton (R-Ark.)",
    "I will take responsibility for the crisis.",
    "TT: You've been critical of the plans Gov.",
    "The Trailer: How do you win this race?",
    "We should consider limits on potency.",
    "He didn’t, and thus the bill failed.",
    "Ryan wanted to take some of it back.",
    "It would then make recommendations.",
    "I can understand their motivations.",
    "So what's wrong with his strategy?",
    "Can you lay out how it would work?",
    "“Where's our military focused?",
    "Our party out-organized them.",
    "It’s harm reduction run wild.",
    "Its first ad calls Lt. Gov.",
    "“It failed them last night.",
    "We need carrots and sticks.",
    "Common sense is in order.",
    "Who can become a member?",
    "He didn’t take it down.",
    "We need tough love.",
    "South Dakota Gov.",
    "“One word: China.",
    "How big is it?",
    "Kansas Gov.",
    "“China.",
    "Sen.",
    "Why?"
  ]
}