{
  "id": 8155,
  "mediaId": 8331,
  "date": "2022-04-06",
  "headline": "How Tim Ryan, Morgan Harper are trying to energize Democrats in Ohio U.S. Senate race",
  "image": "https://www.gannett-cdn.com/presto/2022/03/28/NCOD/45b63369-6c49-4ac2-9017-66f5a1debc4c-eln_sen_dem_debates_JB_36.JPG?crop=4532,2550,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/04/06/ohio-senate-race-tim-ryan-morgan-harper-pitch-visions-democrats/7140022001/",
  "mediaOutlet": "Granville Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"In addition to being able to implement policies that are going to support people in Ohio getting a fair shot wherever they live,\" she said, \"I also entered this race because I know that it will take a different kind of candidate and campaign to be able to mobilize the turnout that we need to win.\"",
    "\"We need to be real about how many people are not checked into politics, and that once we post something on TikTok, that’s when people suddenly know that there is an open U.S. Senate seat, and anyone is running at all,\" Harper said in an interview.",
    "\"We’re still a pragmatic, middle-of-the road Midwestern state, and that’s true of the primary electorate and the general electorate,\" said Aaron Pickrell, a Democratic strategist who worked on campaigns for former President Barack Obama and Gov.",
    "\"If we want to sit around and pretend like we’re going to beat them because we’re America or we’re exceptional because we’re Americans today, it’s like, no, the guy who stormed the beach at Normandy was exceptional…what are we going to do?\"",
    "\"Whether or not they describe themselves as a progressive or centrist or conservative, most people are just ready for results and are over the obstructionism and the static quality of Washington,\" Harper said.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "But some observers argue a campaign focused on the economy – one currently plagued by inflation and worker shortages – will help Democrats reach more voters in a difficult election year.",
    "His first television ad, released last week, repeatedly said \"it's us versus China\" and drew swift rebuke from advocates and lawmakers who contend it fuels anti-Asian sentiment.",
    "Harper acknowledges that the Democratic Party isn't united behind these issues, but she said it's important for leaders to come to the table and discuss potential solutions.",
    "Health care, jobs and China\nRyan, Harper and Johnson debated for the first time at Central State University last month, and the differences between them were crystal clear.",
    "He's also pitching himself to voters in rural areas who supported Obama and former President Donald Trump, with the hope of encouraging them to vote for Democrats again.",
    "In Parma, he said the U.S. must compete with China's economy by investing in skilled workers and infrastructure to pave the way for more developments such as Intel.",
    "Republicans are quick to agree with that and cast Ryan as an ally of President Joe Biden or Speaker Nancy Pelosi who votes in step with Democratic interests.",
    "His vision for fixing the health care system involves a greater emphasis on prevention, like ensuring healthy food is widely available to prevent diabetes.",
    "\"To be an inclusive party, Democrats must not incite hate or fear just to whip up their base,\" said Shekar Narasimhan, chairman of the AAPI Victory Fund.",
    "Despite some differences, Harper and Ryan do agree on issues ranging from LGBTQ rights to abortion access – although Ryan opposed abortion until 2015.",
    "Ryan supports a public option for health care but said no one should be forced into it, noting that some Americans are happy with private insurance.",
    "Harper argues she's best positioned to achieve that goal, casting Ryan as a career politician who's accomplished little during his time in Congress.",
    "A few days later and 135 miles north, U.S. Rep. Tim Ryan walked around a church in Parma as people sold food and crafts to raise money for Ukraine.",
    "\"It’s not looking good for strong, blue people in tenuous red areas,\" said Brianna Mack, a political science professor at Ohio Wesleyan University.",
    "Ryan has condemned hate crimes against Asian Americans and Pacific Islanders, and his campaign said the ad was directed toward China's government.",
    "Ryan, Harper and tech executive Traci Johnson will face off in the May 3 Democratic primary for the chance to flip the seat held by retiring Sen.",
    "Universal health care, she contends, could help people who lose their jobs or encounter medical problems that aren't covered by their insurance.",
    "Unlike Ryan, Harper supports Medicare-for-all, canceling student loan debt and expanding the number of justices on the U.S. Supreme Court.",
    "Without more political and economic influence, Ryan argued, the U.S. will cede power to China and allow its leaders to shape global rules.",
    "Before buying a book on Ukrainian Easter egg coloring, Ryan talked to people about the war and China's influence on a global scale.",
    "But Ryan has doubled down on messages about workers and jobs, focusing much of the blame for America's economic woes on China.",
    "Pickrell, the strategist, said Ryan is far from a conservative Democrat and believes his overall message is a progressive one.",
    "By tailoring his message to the economy, Ryan is taking a page from the playbook of Ohio's top Democrat: Sen. Sherrod Brown.",
    "At a campaign event in Columbus, the progressive running for U.S. Senate explained why students should engage in politics.",
    "The winner will likely face a well-funded Republican opponent and an electorate that's become increasingly conservative.",
    "They both believe the U.S. should onshore jobs that went overseas as corporations looked for ways to cut costs.",
    "When one person complimented her sneakers, Harper knew she found her entry to a broader dialogue.",
    "\"That's been my message for 20 years plus being in Congress,\" Ryan told USA TODAY Network Ohio.",
    "He traveled to Fremont later that day to deliver his pitch for strengthening the middle class.",
    "I feel like a good economy, strong wage growth, good jobs solve a lot of problems.\"",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"I’m not particularly surprised that Ryan is trying to do this worker route.\"",
    "Intel plans to build two plants in New Albany to manufacture semiconductors.",
    "Some believed their votes don't count, and she could sense their skepticism.",
    "\"That’s what the Trump Republicans do and why we fight them everywhere.\"",
    "Morgan Harper likes to use her Air Jordans as an icebreaker.",
    "\"This is it for us, and we better step up.\"",
    "Who's the real progressive?",
    "This is what I focus on.",
    "But Harper isn't sold.",
    "\"This is who I am.",
    "Ted Strickland.",
    "Rob Portman.",
    "he said."
  ]
}