{
  "id": 8838,
  "mediaId": 2636,
  "date": "2022-04-06",
  "headline": "Tim Ryan Struggles to Reach Ohio’s Exhausted Majority",
  "image": "https://static01.nyt.com/images/2022/04/07/us/politics/07pol-ohioryan-4/merlin_204678354_0c3ed4c9-4e0f-449e-9630-e3305f5c1434-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/06/us/politics/tim-ryan-ohio-voters.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    4839,
    1728,
    1819,
    1937,
    6451,
    6474,
    6744,
    6666,
    6509
  ],
  "sentences": [
    "Outside the Hot Dog Shoppe in Warren, Royce VanDervort, 76, who worked for the Packard electric division at General Motors, said he understood why people grew tired of the Democratic political machine amid factory closures and job losses, but was surprised by just how strong and enduring the Trump appeal has been.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year’s map is poised to be surprisingly fair\nGovernors’ Races: Georgia’s contest will be at the center of the political universe, but there are several important races across the country.",
    "His problem in Trumbull exemplifies the larger problem for Democrats in the Midwest: The lingering appeal of Trumpism and the erosion of support for the party among the white working-class voters who once formed a loyal part of its base in the industrial heart of the country.",
    "The exodus of white blue-collar voters from the Democratic Party accelerated here with the arrival of Mr. Trump, who stirred populist anger as he pledged to bring back manufacturing jobs and companies, as well as to aid struggling workers who had been laid off or reassigned.",
    "David and Jennifer Raspanti, who are the owners of a painting company in Trumbull County and who are Republicans, said they did not care whether the next senator was a Republican or a Democrat as long as the candidate was not extreme and could make clearheaded decisions.",
    "The diminishing support for Mr. Ryan in 2020 in Trumbull County was part of a larger wave of enthusiasm for Mr. Trump that knocked out other well-known Democrats in the Mahoning Valley, said Bill Padisak, who works in Niles and serves as president of the A.F.L.-C.I.O.",
    "People, Mr. Ryan added, “just want to move on and actually focus on the things that are really important.”\nLike other Democrats in long-shot races, Mr. Ryan must stay firmly within a narrow lane as he vies to replace Senator Rob Portman, a Republican who is retiring.",
    "“I want to be in their communities.”\nMr. Ryan’s visit-every-county tactic echoes Beto O’Rourke’s driving tour of Texas in 2017 and 2018, when Mr. O’Rourke made campaign stops in all 254 counties in Texas during his unsuccessful bid to defeat Senator Ted Cruz.",
    "Interviews with voters, former elected officials and community leaders in Niles, Warren and other towns in the industrial region known as the Mahoning Valley showed just how hard the midterms will be for Democrats, and for Mr. Ryan.",
    "But as his Republican opponents have been veering farther to the right and aggressively pursuing former President Donald J. Trump’s endorsement, Mr. Ryan is betting voters have had enough of the extremism in American politics.",
    "Many Republican voters in this part of the Mahoning Valley were quick to dismiss any Democrat as unviable, citing gas prices, inflation and the U.S.-Mexico border as Democratic problems that needed Republican solutions.",
    "“I feel like I am representing the Exhausted Majority,” Mr. Ryan said in an interview, using a phrase coined by researchers to describe the estimated two-thirds of voters who are less polarized and who feel overlooked.",
    "Mr. Ryan, 48, the Ohio Democrat and one-time presidential candidate, was born and raised in Niles, a manufacturing city of roughly 18,000 that sits halfway between Youngstown and Warren in southern Trumbull County.",
    "Mr. Ryan, he added, had become “too much of a career politician.”\nAsked later about Mr. Garito’s comments, Mr. Ryan said Mr. Garito reflected those voters in the middle who are without a home politically.",
    "On a blustery, snowy day in early spring, Mr. Ryan sat in Giuseppe’s Italian Market, one of his favorite Italian delis in Niles, dressed down in jeans and a gray pullover with a United Steelworkers logo.",
    "Mr. Ryan condemned anti-Asian violence but said that he was speaking specifically about government policies of the Chinese Communist Party that have hurt Ohio workers and that he was not backing down.",
    "Mr. Ryan does not tout Medicare for All and other transformative policies that tend to energize progressives, and he does not want to talk about transgender women in sports and other divisive issues.",
    "Shekar Narasimhan, the chairman of AAPI Victory Fund, a political action committee that mobilizes Asian American and Pacific Islander voters, urged Mr. Ryan to not use hate or fear to win votes.",
    "“Right now, regardless of if you’re running for Senate or governor or any public office, I would feel the Democratic Party in general is leading the country down the wrong path,” Ms. Moll said.",
    "Ohio went to Mr. Trump in the past two presidential elections, and it appears to be trending in Republicans’ favor, as President Biden’s low approval ratings are expected to hurt Democrats.",
    "A place that was once a bastion of white blue-collar Democrats turned away from a white Democratic native son whose blue-collar grandfather had been a steelworker in Niles for four decades.",
    "But if State Senator Matt Dolan, a Republican less centered on Mr. Trump, wins the Republican primary and makes it on the ballot in November, Mr. Ryan will likely lose Mr. Garito’s vote.",
    "The Mahoning Valley where Mr. Ryan still lives stretches across northeastern Ohio and northwestern Pennsylvania, and was once a thriving zone of steel factories and manufacturing plants.",
    "His first television commercial — part of a $3.3 million ad buy — almost sounds like it came from a Republican, squarely centering on the nation’s fight to beat China on manufacturing.",
    "“We need to come back to the middle,” Ms. Raspanti, 44, said at a restaurant in Boardman Township, where the family was having breakfast with their two sons after church.",
    "The outrage, racial resentment and white grievances harnessed by Republicans have proven too salient for some voters who see their identity and way of life under attack.",
    "On the other, he has grown sick of far-right Republicans who argue, he said, like “kids fighting.”\nHe plans to vote for Mr. Ryan in the Democratic primary in May.",
    "But she said he could not win the seat without doing more to repel Republicans’ attempts to sow division, like proactively taking on issues of race and crime.",
    "Many of his promises never materialized, but that didn’t hurt the former president’s well of support among the workers who saw him as their champion.",
    "In the Democratic primary, Mr. Ryan is the front-runner, but he will face Morgan Harper, a progressive lawyer, and Traci Johnson, a tech executive.",
    "At her home, Charlene W. Allen, 76, a community activist and legislative aide to the Youngstown Warren Black Caucus, believed Mr. Ryan had a shot.",
    "His role model has been Senator Sherrod Brown, the Ohio Democrat who has weathered Republican waves by focusing on rebuilding the middle class.",
    "The ad has drawn criticism from some Asian advocacy groups and elected officials, who described it as racist and called on him to take it down.",
    "Democrats tended to be split between those who supported Mr. Ryan and those wary he had become too much a part of the Democratic establishment.",
    "His jobs-and-the-economy message clashes with the prices working-class voters have been paying at the grocery store and at the gas pump.",
    "“It’s us versus them,” he says in a digital one-minute version of the ad, during which he mentions “China” eight times in 60 seconds.",
    "On a visit to Warren for her 18-year-old daughter’s dance competition, Kristen Moll, 54, echoed a common refrain among Republicans.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle’s defining topics.",
    "But Mr. VanDervort’s friend and neighbor, Dennis Garito, 57, was the kind of voter Mr. Ryan has been trying to win back.",
    "He hosted round tables with business owners and home health care aides in Cincinnati, Cleveland and other cities.",
    "On the one hand, he said, he worries Mr. Ryan and other Democrats have lost touch with the people they represent.",
    "Others blame the Biden administration and Democrats for the troubles with the economy and illegal immigration.",
    "That number fell to just 48 percent in 2020, when he narrowly lost the county by roughly one percentage point.",
    "Now, Mr. Ryan is trying to win back his party’s voters in Trumbull and throughout Ohio as he runs for Senate.",
    "Many national Democratic pollsters and pundits have written off Mr. Ryan’s pursuit as a near-impossible task.",
    "A retired fabrication worker and a Democrat for 35 years, Mr. Garito now describes himself as an independent.",
    "Seven months before the November election, it is too early to say whether the Ryan playbook is working.",
    "He is focused on bringing back voters who feel forgotten by Democrats and turned off by Republicans.",
    "Mr. Ryan has been on a rigorous tour of the state, aiming to visit with voters in all 88 counties.",
    "But Mr. Ryan saw the region transform amid job losses, bad trade deals and disinvestment, he said.",
    "“If it comes down between Dolan and Ryan, I’m probably going to vote for Dolan,” Mr. Garito said.",
    "“I am telling everyone right now — ‘Just hear us out, come listen to us,’” the congressman said.",
    "“That’s what the Trump Republicans do and why we fight them everywhere,” he said in a statement.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "But he said it was too early to tell whether many of those people would remain Republicans.",
    "“Some of that Trump support has waned, but I don’t know if it has waned enough,” she said.",
    "“A lot of the union members I talk to, I think they will swing back,” Mr. Padisak said.",
    "He met with union workers in town halls, diners and factories along the Ohio River.",
    "Instead, he wants to campaign strictly on jobs, manufacturing and taking on China.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "Even anti-Trump voters have been in an anti-establishment frame of mind.",
    "Mr. Ryan had once won Trumbull with as much as 74 percent of the vote.",
    "NILES, OHIO — Representative Tim Ryan won re-election in 2020.",
    "They see Ohio as too red and too white to change course.",
    "He is a die-hard Democrat and said he supports Mr. Ryan.",
    "Central Labor Council in Mahoning and Trumbull Counties.",
    "He picketed with aerospace workers north of Dayton.",
    "But in one sharply personal way, he lost, too.",
    "Democrats’ struggles go far beyond Mr. Trump.",
    "“I want to see these folks,” Mr. Ryan said.",
    "Here are the four incumbents most at risk.",
    "“We need to listen to each other better.”",
    "“Too old to change now,” he added.",
    "See the full primary calendar.",
    "So far, he has hit 82."
  ]
}