{
  "id": 9317,
  "mediaId": 2640,
  "date": "2022-03-27",
  "headline": "Cleveland Is Trying to Gain a New Nickname",
  "image": "https://img2-azrcdn.newser.com/image/1405195-12-20220327183621.jpeg",
  "link": "https://www.newser.com/story/318539/cleveland-is-trying-gain-a-new-nickname.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike L. Ford",
  "authorUrl": "https://www.newser.com/bio/83631217/mike-l-ford.html",
  "termIds": [
    0
  ],
  "sentences": [
    "In Cleveland, it's the root of a brand, “Kindland,” launched in 2020 by an insurance salesman come social entrepreneur whose ultimate goal is “to make kindness the overriding, embedded, and unifying national value in America.” Writing for Politico Magazine, Kathy Gilsinan traces the roots and current status of the Kindland initiative.",
    "“I don’t think calling anybody a name ever accomplishes anything,\" says Gibbons, though Gilsinan notes he recently called GOP rivals “Washington wimps” and said Democrat Morgan Harper was “Like AOC, only dumber.” Thus, Gilsinan concludes: “That’s the other thing about kindness: People fall short.",
    "Critics call it “window dressing” and point to the obvious PR motive for corporations to adopt such “political neutral priorities.” One local said it “trivializes very serious, systemic issues,” which abound in Cleveland, where poverty and homicide rates are high.",
    "In her informal surveys around town, Gilsinan experienced a lot of street-level little kindnesses and found that most Clevelanders are familiar with the Kindland initiative.",
    "To demonstrate Kindland’s powerful bipartisan appeal, Gilsinan quotes Democratic Mayor Justin Bibb as a believer, as well as GOP Senate candidate Mike Gibbons.",
    "(Newser) – The concept of “kindness” is not hard to grasp, especially in contrast to things like cruelty, selfishness, and bullying.",
    "Then again, one principal said, “the kids, they grasp to it,” and kindness-focused programs have made a positive impact in schools.",
    "Occasional, even frequent, failure doesn’t make the ideal itself unworthy—it just makes it an ideal.” (Read the full story.)",
    "It markets itself like any brand—on billboards and in the media wherever it can—and features the “Just Be Kind” app.",
    "So far, per Cleveland.com, the app has tracked some 37 million good deeds around town.",
    "Overall, “it can’t hurt” is the common refrain.",
    "She also encountered some mixed reviews."
  ]
}