{
  "id": 904,
  "mediaId": 195,
  "date": "d2022-04-16T14:27",
  "headline": "Whitmer goes on offense amid barrage of GOP attacks in Michigan",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/whitmergretchen_012522_ap-Paul-Sancya_whitmer.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3269067-whitmer-goes-on-offense-amid-barrage-of-gop-attacks-in-michigan/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    773,
    1088,
    1147,
    2087,
    3075,
    146,
    307,
    428,
    482,
    2678,
    2791
  ],
  "sentences": [
    "We're delivering substantive progress on a litany of issues that affect the lives of everyday people.?\nMichigan's gubernatorial contest is set to be one of the most closely watched races in the midterms, with the Cook Political Report rating the race a toss-up.?\nAnd money inside and outside of the state has poured in ahead of the election.",
    "Everything costs more, and gas prices in Michigan are at record highs, inflation [is] at record highs, roads are the worst conditions they've been in decades.?\nBut Democrats push back on this notion, pointing to Whitmer's focus on state and local issues and drawing a contrast with the Republican field vying to challenge her in November.",
    "It's not something you want, but she's a proven tough and tested leader,? said one Democratic operative, referring to comments Whitmer made on Saturday at a Michigan Democratic Party event in which she said, tough times call for tough people.?\nIt just shows that her message is fitting for the times,? the operative added.",
    "At the time, Michigan had started the process of easing restrictions on nursing home visitations, allowing visitors who have tested negative for the virus to visit relatives in nursing homes as long as the facilities had not reported new coronavirus cases for two weeks.",
    "Whitmer has intentionally zeroed in on abortion recently ahead of the Supreme Court's decision later this year on Dobbs v. Jackson Women's Health Organization, which centers on the constitutionality of a Mississippi law that bans abortion after 15 weeks of pregnancy.",
    "As Republicans work to tie Whitmer to President Biden's low approval ratings, Whitmer's allies say the incumbent governor is working to highlight state and local issues, a strategy she successfully used during her first reelection bid.",
    "The Republican Governors Association ran one of the first ads of the cycle last May, while Put Michigan First, a group affiliated with the Democratic Governors Association, launched ads during college football season late last year.",
    "Whitmer advocating for President Biden, saying that he is the person that can solve the issues for Michigan and two years later we can look at that and say that is clearly not the case,? the strategist continued.",
    "Gretchen Whitmer broke nearly every promise she made to voters in 2018 and is now trying to deflect blame and divert focus from her failures,? said Republican Governors Association spokesman Chris Gustafson.",
    "However, Republicans argue that in addition to focusing on local issues like infrastructure, they are working to tie Whitmer to what they say are Biden's failures, such as rising inflation.",
    "We'll let the Supreme Court on where they decide on Roe v. Wade.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Voters are eager to elect a Republican governor in November to reverse Whitmer's failure.?\nBut Democrats point to Whitmer's approval ratings, which show an improvement from last year.",
    "Whitmer's allies also point to what they say are extreme positions the GOP candidates have taken on a host of issues, including abortion and the 2020 presidential election results.",
    "Republicans have also pointed to the criticism Whitmer received when her husband called a local marina asking if he could take his boat out on Memorial Day weekend of that year.",
    "Whitmer released a statement on Wednesday expressing her sorrow over the death of Patrick Lyoya, a Black man who was fatally shot by police in Grand Rapids earlier this month.",
    "Whitmer had previously warned Michiganders not to descend on the state's waterfronts as a means of stopping crowding during the first few months of the coronavirus outbreak.",
    "Whitmer failed to fix the roads, shuttered any semblance of transparency, and her full embrace of Joe Biden ensures she cannot hide from record inflation and gas prices.",
    "In February of 2020, she was tapped to deliver the Democratic response to then-President Trump's State of the Union address, catapulting her into the national spotlight.",
    "According to a WDIV/Detroit News survey released earlier this year, 66 percent of the state's general election voters said they support having Roe v. Wade left in place.",
    "And last week, two of four men were acquitted in a conspiracy to kidnap Whitmer in 2020, in a case that has raised questions over whether the FBI engaged in entrapment.",
    "Republicans have continuously criticized her pandemic response, pointing specifically to a March 2021 trip the governor took to Florida to see her elderly father.",
    "But Republicans appear to be brushing off Whitmer's moves on abortion, saying Michiganders are more concerned about kitchen table issues, like the cost of living.",
    "Additionally, the survey showed Whitmer with a 62-percent job approval from independent voters, while Biden had a 39-percent approval rating from the group.",
    "She's doing what she should be doing as the governor, which is focusing on the lives of everyday Michiganders,? said a Michigan-based Democratic strategist.",
    "If the high court rules in favor of Mississippi, GOP-led state legislatures have signaled they will begin the process of chipping away at abortion rights.",
    "Whitmer made headlines last week when she announced she's requesting that the state's Supreme Court make a decision on the constitutionality of abortion.",
    "Meanwhile, GOP gubernatorial candidate Kevin Rinke launched a $500,000 two-week ad buy late last month on television, radio, and digital platforms.",
    "With the national threats to Roe v. Wade and the legislature's refusal to act, she felt compelled to take action,? the Democratic operative said.",
    "But in 2022, Republicans are zeroing in on a host of local, state and national issues that they argue present vulnerabilities for Whitmer.",
    "Whitmer announced last week that she was requesting that Michigan's Supreme Court make a decision on the constitutionality of abortion.",
    "Republicans divide, Democrats deliver,? Michigan Attorney General Dana Nessel, who is also up for reelection this year, told The Hill.",
    "Other Democrats say there are political upsides to Whitmer's messaging on abortion, pointing to her success with women voters in 2018.",
    "The governor also frequently made news as Michigan became a coronavirus hotspot, resulting in Whitmer imposing tight restrictions.",
    "A WDIV/Detroit News poll released in January showed Whitmer with a 56-percent approval rating and a 38-percent disapproval rating.",
    "Democrats argue that the crowded nature of the primary will leave the eventual nominee weakened ahead of the general election.",
    "Candidates must get 15,000 valid signatures to get on the ballot and so far four candidates have submitted their petitions.",
    "In Michigan, a 1931 law criminalizing abortion, except when the life of the mother is at risk, is still on the books.",
    "But Whitmer has proven to be a fundraising powerhouse so far, raising $2.5 million in the last three months of 2021.",
    "However, the 1973 landmark abortion case Roe v. Wade blocks the 1931 law and legalizes abortion in the state.",
    "Gretchen Whitmer (D) is stepping up her appeals to voters as an energized GOP works to oust her in November.",
    "That's up from last fall when Whitmer had a 48-percent approval rating and a 44-percent disapproval rating.",
    "Whitmer's allies say the move could put her one step ahead of the state's GOP-controlled state legislature.",
    "On top of that, polling shows that the landmark law legalizing abortion is widely accepted in the state.",
    "But as her national profile grew, Whitmer increasingly became one of the GOP's biggest political foes.",
    "Whitmer was also one of the final contenders in then-candidate Joe Biden's 2020 running mate search.",
    "Whitmer was one of his biggest advocates on the campaign trail,? said one Michigan GOP strategist.",
    "Roughly six in ten Michigan female voters supported Whitmer in 2018, according to AP Vote Cast.",
    "The candidates are in the process of filing petition signatures in hopes of making the ballot.",
    "If that is not an impactful issue to women in our state, I don't know what is,? Nessel said.",
    "Whitmer was part of the Democratic wave in Michigan and across the country in 2018.",
    "But the governor has also faced her share of negative headlines in the state.",
    "A lot of the events they were doing that we were going up against were Gov.",
    "It's an issue she's trying to pivot to,? said the Michigan GOP strategist.",
    "Twelve Republicans are running in the state's GOP gubernatorial primary.",
    "Last I saw President Biden was in the low thirties and frankly, Gov.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Michigan Gov."
  ]
}