{
  "id": 12146,
  "mediaId": 8398,
  "date": "2022-03-22",
  "headline": "Farmers speak out on issues this growing season and beyond",
  "image": "https://www.perrysburg.com/sites/perrysburg.com/files/a9d92cb3ab_Ar00103002.jpg",
  "link": "https://www.perrysburg.com/news/farmers-speak-out-issues-growing-season-and-beyond",
  "mediaOutlet": "Perrysburg Messenger Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News Staff",
  "authorUrl": "https://www.perrysburg.com/news-staff",
  "termIds": [
    0
  ],
  "sentences": [
    "Perrysburg Township Trustee Joe Schaller opened the session telling the state senator that “prices are going crazy.”\nSen. Gavarone, who is running for U.S. Congress, noted that farmers are the backbone of America, and this “is just a really important conversation.”\n“Obviously everything is going up,” said Nathan Eckel of Luckey Farmers.",
    "If there is a bright side, the auditor said, “It won’t be the same burden as farmers experienced 10 years ago.”\nSen. Gavarone acknowledged the farmers provided her with a good deal of information to digest and will look into what can be done to ease their problems and improve supply chain problems.",
    "“FSA loans will be higher,” he said adding, “Overall, we couldn’t stay at 3.25 percent forever.”\nEven items obtained at farm auctions in 2021 went for a significantly higher amount with farmers paying a higher price for equipment because they “really needed it,” he said.",
    "“I think transportation this year will be the biggest hangup–getting the right product to the right place,” he added and pointed out that supply disruptions, coupled with demand, sent fertilizer prices soaring in 2021.",
    "But they point out, the number of residential subdivisions has increased dramatically and with that has been an increase in chemical lawn treatments–all of which run into storm sewer systems.",
    "Others expressed concern that farmers shoulder the blame for phosphorous in the rivers and Lake Erie, noting they have been using best practices for a number of years to reduce their impact.",
    "Tom Schaller said he recently had to buy a filter for his combine that he believes would have cost no more than $40 on an open market, but he paid $126 through the dealer.",
    "Getting high-protein soybeans–grown by northwest Ohio farmers–exported promptly would benefit third-world countries that rely on the grain to feed their people.",
    "Wood County Auditor Matt Oestreich acknowledged property values are going up and is looking at a $2,000 increase per acre for the 2023 property revaluation.",
    "Mr. Eckel acknowledged there is little farmers can do about feed and fertilizer prices, which are set at the federal level through the commodities exchange.",
    "And a group of them along with farming industry business leaders met with State Senator Theresa Gavarone on March 14 to voice their concerns and seek help.",
    "A large part of that increase can be attributed to the cost of pesticides such as Roundup, because manufacturers are encountering a shortage of chemicals.",
    "Motorists are not the only ones impacted by the price of fuel and other commodities or experiencing trouble with the purchase of new cars or replacement.",
    "He would like to see Toledo with its Lake Erie port be used along with other transportation systems to import and export supplies in a timelier fashion.",
    "The farmers also worry about taxation rates, especially in area school districts like Perrysburg where property values have escalated on farm acreage.",
    "Kirk Wehsink of Farmers and Merchants State Bank, said farmers will see an increased interest rate on loans they may need to take out.",
    "Mr. Eckel also noted that while Luckey Farmers’ currently has an adequate supply in house, they cannot guarantee the restock of items.",
    "Coupled with that, Josh Kieffer of Luckey Farmers explained, is that unlike a car, farmers must take everything to the dealer.",
    "And if supply deliveries run behind by two to four weeks, that could impact farmers’ abilities to plant crops, he explained.",
    "As an example of what farmers will face, Mr. Eckel said a 400-acre corn farm will see a cost increase of $47,028 this year.",
    "Another farmer believes that regulations also are a contributing factor to the higher costs of doing business.",
    "“Can you imagine not taking your car to a shop and having to go to a dealer?” Trustee Schaller asked.",
    "Fertilizer and seed are increasing and potash is in short supply due to the Russian/Ukraine conflict.",
    "“If we could just increase the export market, it would help farmers in northwest Ohio,” he added.",
    "The special meeting was hosted by Tom Schaller in his large storage facility on Oregon Road.",
    "The shortage entails both foreign- and domestic-made parts.",
    "There are problems obtaining parts for everything.",
    "Another problem plaguing farmers is equipment.",
    "“Parts [prices] are ridiculous,” he added.",
    "Farmers are taking it on the chin, too.",
    "“We all need our farmers.”\n~Jane Maiolo"
  ]
}