{
  "id": 2716,
  "mediaId": 8433,
  "date": "2022-01-28",
  "headline": "BG MARCS Tower ensures public safety for residents",
  "image": "https://bloximages.chicago2.vip.townnews.com/sent-trib.com/content/tncms/assets/v3/editorial/2/26/22628a2c-e401-11e7-b391-9ba4a5071e84/5a37d30e53c64.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.sent-trib.com/news/bg-marcs-tower-ensures-public-safety-for-residents/article_bf8970d4-7fc7-11ec-b666-fbb39f624370.html",
  "mediaOutlet": "sent-trib.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Unfortunately, there was a coverage gap that existed in Wood County, which initiated Moorman’s mission to obtain state funding for this much-needed improvement\nToday, fire code and ohio building code require building owners to ensure first responder radio coverage in their facilities by employing a supplemental Emergency Responder Radio System if there is a radio coverage issue.",
    "For years, there have been radio communication dead zones in and around Bowling Green, which could be problematic for many area agencies, especially in an emergency, according to a news release by the city.",
    "The 300-foot tower, located at the Bowling Green Ohio Department of Transportation facility, provides secure, reliable wireless communication for public safety and first responders throughout Wood County.",
    "With the help of Ohio Sen. Theresa Gavarone, R-Huron, and Ohio Rep. Haraz Ghanbari, R-Perrysburg, $500,000 was awarded to the city to install a Multi-Agency Radio Communication System Tower.",
    "MARCS is the statewide reliable communication system that enables state, local, and federal agencies to communicate instantly with one another during public safety events.",
    "Agencies who will benefit from the MARCS tower:\n· Bowling Green State University Police Division\n· Any municipal, state or federal agency that utilizes MARCS radios",
    "The quality of emergency communications for first responders has been a long-time concern of Bowling Green Fire Division Chief Bill Moorman.",
    "Many area businesses were facing necessary improvements to comply with the current code, which would have cost millions of dollars.",
    "The MARCS tower ensures excellent radio coverage, saving local companies money by no longer needing to make these investments.",
    "This upgrade will make everyone safer, not just students and residents of Bowling Green but also the surrounding communities.",
    "More than 2,300 Ohio public safety/public service agencies participate in MARCS, with over 300 MARCS towers.",
    "Moorman acted in 2019 and applied for state capital budget funding with the Toledo Chamber of Commerce.",
    "In emergencies, an essential tool for first responders is the ability to communicate reliably.",
    "It’s a win-win from a public safety and cost standpoint,” Moorman said.",
    "“This is a game-changer when it comes to communication in Wood County.",
    "This was the site of a previous communication tower of similar size."
  ]
}