{
  "id": 7453,
  "mediaId": 2537,
  "date": "2022-04-07",
  "headline": "Ohio would require photo ID for voters, provide free state IDs under new legislation",
  "image": "https://www.gannett-cdn.com/presto/2021/11/01/NCOD/0fb6bc92-65c4-4ff3-9d19-28929dfbe308-CEB_EARLY_VOTING_NJG_005.JPG?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/04/08/ohio-voting-new-bill-would-tighten-voter-id-requirements/9489394002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    3376,
    1710,
    1477,
    1489,
    823,
    1126,
    6474,
    6238
  ],
  "sentences": [
    "Ohio Republicans introduced two pieces of legislation last year that would limit or prohibit the use of drop boxes, reduce days for early voting and allow voters to request absentee ballots online, among other changes.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "A new bill introduced in Ohio this week would tighten the state's voter ID rules following a year of GOP-backed changes across the country that advocates say would disenfranchise minority voters.",
    "\"It’s something that got a lot of attention during the last election, and we just want to make sure that we’re continuing to look at our election laws and make sure we’re doing everything right.",
    "Those voting by mail would need to provide the last four digits of their Social Security number and either the number or a photocopy of their Ohio driver's license or state ID.",
    "The secretary of state's office referred 62 potential cases of voter fraud to law enforcement earlier this year, including a minuscule number of cases from the 2020 election.",
    "\"It seems as if the General Assembly wants to muddy the water or try to fix a problem that doesn't exist,\" said Collin Marozzi, deputy policy director for the ACLU of Ohio.",
    "Still, voting rights advocates argued the changes could make it more difficult for people of color, college students and overseas military voters to cast their ballots.",
    "If passed, Ohio voters would no longer be able to use utility bills, paychecks or other forms of ID currently permitted under state law.",
    "Groups like the League of Women Voters of Ohio, along with LaRose, frequently tout Ohio election security and say voter fraud is rare.",
    "\"I think people are concerned about election security,\" said Gavarone, who is also running for the U.S. House of Representatives.",
    "Senate Bill 320, sponsored by state Sen. Theresa Gavarone, R-Huron, would require people voting in-person to show a photo ID.",
    "A separate survey that year by Pew Research Center found 93% of Republicans and 61% of Democrats favor that policy.",
    "A 2021 poll from Monmouth University found 80% of Americans support requiring photo ID to vote.",
    "A spokesman for Secretary of State Frank LaRose said his team is reviewing the proposal.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "The bill would also allow Ohioans ages 17 and up to get a free state ID.",
    "\"This notion of rampant voter fraud has empirically been proven false.\"",
    "Neither proposal has been voted on by lawmakers.",
    "Ohio’s a really important state.\""
  ]
}