{
  "id": 7555,
  "mediaId": 3993,
  "date": "2022-04-05",
  "headline": "Editorial on bail reform gets something important right",
  "image": "https://media.townhall.com/townhall/reu/o/2014/340/64510a77-9afd-427d-a037-96fac8a551b2-1110x740.jpg",
  "link": "https://bearingarms.com/tomknighton/2022/04/05/bail-reform-n57121",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Knighton",
  "authorUrl": "https://bearingarms.com/author/tomknighton",
  "termIds": [
    2040,
    2666,
    3235,
    3376,
    6236
  ],
  "sentences": [
    "The problem is that when you arrest career violent criminals for a violent crime only to release them back into the wild, they’re going to commit more violent crimes.",
    "Rethinking bail reform efforts so that people with a history of violent offenses don’t walk right out and back onto the streets is a very good starting point.",
    "However, since I’m pretty sure violent crime will start dropping, there probably isn’t a whole lot else that would need to be done at that point.",
    "There’s a huge difference between an offender charged with minor and serious but nonviolent crimes and an individual accused of violent crimes.",
    "Innocent people are being killed as well, either as the intended victim of a violent crime or an innocent bystander caught in the crossfire.",
    "Unfortunately, as we’ve seen, putting career violent felons back out onto the streets isn’t really conducive to good public order.",
    "Swearingen (R., Huron), and others are on target proposing changes in the law to protect the public in bail determinations.",
    "All too often, we read of offenders with serious criminal records, charged once again with violent crime, let out on bail.",
    "It should be remembered that the surge in violent crime corresponds with the bail reform push throughout the nation.",
    "Bail laws must be fair yet also protect citizens from the danger of potentially violent offenders on the streets.",
    "The decision made it difficult, if not impossible, for judges to consider community safety in setting bail.",
    "While correlation doesn’t equal causation, it does suggest that one might want to take a deeper look.",
    "If an accused has violent offenses on their record they must be kept off the streets pending trial.",
    "That’s why Attorney General Dave Yost, State Sen. Theresa Gavarone (R., Huron), State Rep. D.J.",
    "We’ve seen far too many of these folks end up back on the streets without even a night in jail.",
    "After all, there’s something to be said about treating people as innocent until proven guilty.",
    "Someone with a history of violent crime is someone you need to treat like a violent criminal.",
    "That case made it difficult to keep those charged with violent offenses in jail.",
    "If it were just criminals killing criminals, I probably wouldn’t care that much.",
    "The subject of bail reform makes a lot of sense to the libertarian side of me.",
    "The Ohio Supreme Court went overboard in the case of DuBose vs. McGuffey.",
    "So, the editorial board at the Toledo Blade has thoughts on the subject.",
    "People who didn’t ask for any of it, yet they’re the ones being shot.",
    "The trash taking itself out sounds pretty good to me, truth be told.",
    "These are mothers and fathers, brothers and sisters, children.",
    "Unfortunately, as crime surges, we need to take action now.",
    "Look, as I said, I get the sentiment behind bail reform.",
    "From there, we can take a look and see what’s happening.",
    "Then, the obvious happens, they commit another crime.",
    "As such, something needs to be done.",
    "That is foolish and dangerous.",
    "People are being killed.",
    "But it’s not just them.",
    "That’s dangerous.",
    "Yes, it is."
  ]
}