{
  "id": 821,
  "mediaId": 2593,
  "date": "2022-02-22",
  "headline": "'LOL': Conservatives Tear Into Biden Over Past Tweet About Putin",
  "image": "https://ijr.com/wp-content/uploads/2022/02/GettyImages-1238601459-scaled.jpg",
  "link": "https://ijr.com/conservatives-tear-biden-past-tweet/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Savannah Rychcik",
  "authorUrl": "https://ijr.com/author/savannah/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Andy Biggs (R-AZ) reacted, saying, “You were saying…?”\n— Rep Andy Biggs (@RepAndyBiggsAZ) February 22, 2022\nFormer White House Press Secretary Sean Spicer asked, “How’s this tweet aging?”\n— Sean Spicer (@seanspicer) February 22, 2022\nCheck out more reactions below:\nAs Putin prepares to defy Joe Biden by sending troops into Ukraine, I am reminded of this tweet from two years ago: pic.twitter.com/kKw40cf4MX\n— Theresa Gavarone for Congress (@theresagavarone) February 22, 2022\nHow embarrassing https://t.co/VzWy56fB5V\n— Katie Pavlich (@KatiePavlich) February 21, 2022\nAlways remember that the DC media pushed this narrative.",
    "According to the White House, the order will “provide authority to impose sanctions on any person determined to operate in those areas of Ukraine.”\nWhite House Press Secretary Jen Psaki explained the U.S. “will also soon announce additional measures related to today’s blatant violation of Russia’s international commitments.”\nPsaki said the measures “are separate from and would be in addition to the swift and severe economic measures we have been preparing in coordination with allies and partners should Russia further invade Ukraine.”\nWe are committed to truth and accuracy in all of our journalism.",
    "https://t.co/EjOyRYqC7A\n— Sean Parnell (@SeanParnellUSA) February 21, 2022\nThe White House said Biden would issue an executive order “that will prohibit new investment, trade, and financing by U.S. persons to, from, or in” the two Ukrainian regions backed by Russian separatists, as ABC News reported.",
    "— Joe Biden (@JoeBiden) February 21, 2020\nOn Monday, Putin announced he would be sending troops into separatist-held territories in Ukraine, calling it a “peacekeeping” mission.",
    "Conservatives are mocking President Joe Biden over his previous claim that he is the only one who has ever gone “toe-to-toe” with Russian President Vladimir Putin.",
    "If you’re wondering why — it’s because I’m the only person in this field who’s ever gone toe-to-toe with him,” Biden explained.",
    "A reporter for The Daily Wire, Ryan Saavedra, tweeted, “LOL.”\nIs Biden the only one who has ever gone \"toe-to-toe\" with Putin?",
    "The order came just hours after Putin signed decrees recognizing the independence of the pro-Russian regions.",
    "If you’re wondering why — it’s because I’m the only person in this field who’s ever gone toe-to-toe with him.",
    "In February 2020, Biden tweeted a warning to Putin, suggesting he does not want Biden to be president.",
    "https://t.co/1Ruq0V8wJ3\n— Richard Grenell (@RichardGrenell) February 22, 2022\nYikes.",
    "Conservatives took to Twitter to go off on Biden as the events unfolded.",
    "Putin did it twice – when Obama and Biden were in charge.",
    "@maggieNYT led the way with this phony partisan message.",
    "Putin didn’t invade Ukraine when Trump was President.",
    "Vladimir Putin doesn’t want me to be President.",
    "“He doesn’t want me to be our nominee.",
    "He doesn’t want me to be our nominee.",
    "Read our editorial standards."
  ]
}