[
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Both businessman <span class='selected-term'>Kevin Rinke</span> and chiropractor Garrett Soldano each trail Whitmer by seven points, while conservative media personality Tudor Dixon is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman <span class='selected-term'>Kevin Rinke</span>; Norton Shores businesswoman and conservative commentator Tudor Dixon; Kalamazoo chiropractor Garrett Soldano; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Republican businessman <span class='selected-term'>Kevin Rinke</span> is leading the Republican gubernatorial field in fundraising, including a $2 million contribution to his own campaign.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "The poll also found that <span class='selected-term'>Kevin Rinke</span> holds five percent of the vote, Tudor Dixon and Ryan Kelly have four percent, and Perry Johnson and Mike Brown hold three percent.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman Tudor Dixon, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates James Craig, Perry Johnson, Ryan Kelley, <span class='selected-term'>Kevin Rinke</span> and Garrett Soldano made the cut, according to a news release.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac"
  }
]