[
  {
    "id": 1026,
    "mediaId": 19,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Craig led, with about 45 percent of respondents recognizing his name, followed by businessman <span class='selected-term'>Kevin Rinke</span> and chiropractor Garrett Soldano at about 20 percent name recognition each.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer"
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Both businessman <span class='selected-term'>Kevin Rinke</span> and chiropractor Garrett Soldano each trail Whitmer by seven points, while conservative media personality Tudor Dixon is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman <span class='selected-term'>Kevin Rinke</span>; Norton Shores businesswoman and conservative commentator Tudor Dixon; Kalamazoo chiropractor Garrett Soldano; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Republican businessman <span class='selected-term'>Kevin Rinke</span> is leading the Republican gubernatorial field in fundraising, including a $2 million contribution to his own campaign.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "The poll also found that <span class='selected-term'>Kevin Rinke</span> holds five percent of the vote, Tudor Dixon and Ryan Kelly have four percent, and Perry Johnson and Mike Brown hold three percent.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals"
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator Tudor Dixon, former Detroit Police Chief James Craig, businessman Perry Johnson and businessman <span class='selected-term'>Kevin Rinke</span>.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case"
  },
  {
    "id": 904,
    "mediaId": 195,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Meanwhile, GOP gubernatorial candidate <span class='selected-term'>Kevin Rinke</span> launched a $500,000 two-week ad buy late last month on television, radio, and digital platforms.",
    "author": "Julia Manchester",
    "title": "Whitmer goes on offense amid barrage of GOP attacks in Michigan"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman Tudor Dixon, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown; businesswomen Donna Brandeburg and Tudor Dixon; businessman Perry Johnson; real estate agent Ryan Kelley; financial advisor Michael Markey; pastor Ralph Rebandt, businessman <span class='selected-term'>Kevin Rinke</span>; and chiropractor Garrett Soldano.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The August primary also includes two wealthy businessmen, <span class='selected-term'>Kevin Rinke</span> and Perry Johnson.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor Garrett Soldano, businessman Perry Johnson, real estate broker and activist Ryan Kelley, conservative commentator Tudor Dixon, and former car dealership owner <span class='selected-term'>Kevin Rinke</span>.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Those qualifying for the ballot would be Dixon, a former conservative TV news host who netted the DeVos family endorsement earlier Monday; chiropractor and grass-roots activist Garrett Soldano; wealthy self-funding businessman <span class='selected-term'>Kevin Rinke</span>; real estate broker and anti-coronavirus lockdown activist Ryan Kelley; and pastor Ralph Rebandt.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures"
  }
]