[
  {
    "id": 1000,
    "mediaId": 237,
    "date": "d2022-02-01T15:47",
    "sentence": "Republican businessman <span class='selected-term'>Kevin Rinke</span> is leading the Republican gubernatorial field in fundraising, including a $2 million contribution to his own campaign.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy",
    "sentiment": "0.0"
  },
  {
    "id": 904,
    "mediaId": 195,
    "date": "d2022-04-16T14:27",
    "sentence": "Meanwhile, GOP gubernatorial candidate <span class='selected-term'>Kevin Rinke</span> launched a $500,000 two-week ad buy late last month on television, radio, and digital platforms.",
    "author": "Julia Manchester",
    "title": "Whitmer goes on offense amid barrage of GOP attacks in Michigan",
    "sentiment": "0.0"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "d2022-05-23T22:03",
    "sentence": "Those qualifying for the ballot would be Dixon, a former conservative TV news host who netted the DeVos family endorsement earlier Monday; chiropractor and grass-roots activist Garrett Soldano; wealthy self-funding businessman <span class='selected-term'>Kevin Rinke</span>; real estate broker and anti-coronavirus lockdown activist Ryan Kelley; and pastor Ralph Rebandt.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": "0.0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "d2022-05-24T00:00",
    "sentence": "Businessman <span class='selected-term'>Kevin Rinke</span>, chiropractor Garrett Soldano, far-right activist Ryan Kelley and the Rev.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "0.0"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "d2022-05-24T02:09",
    "sentence": "Also on the ballot, and suddenly in much stronger positions, are:Ottawa County real estate agent Ryan Kelley; Farmington Hills pastor Ralph Rebandt; Bloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>, and Kalamazoo chiropractor Garrett Soldano.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": "0.0"
  }
]