[
  {
    "id": 1025,
    "mediaId": 43,
    "date": "d2022-01-12T00:00",
    "sentence": "Gretchen Whitmer well ahead of four potential Republican foes:\n49-39 vs. former Detroit Police Chief James Craig\n50-33 vs. chiropractor Garrett Soldano\n50-33 vs. businessman <span class='selected-term'>Kevin Rinke</span>\n50-31 vs. conservative radio host Tudor Dixon\nPolling from reliable firms has been rare here so far.",
    "author": "",
    "title": "Morning Digest: We're looking back on Harry Reid's long and storied career on the campaign trail",
    "sentiment": "0.0"
  },
  {
    "id": 1026,
    "mediaId": 19,
    "date": "d2022-01-12T00:00",
    "sentence": "Craig led, with about 45 percent of respondents recognizing his name, followed by businessman <span class='selected-term'>Kevin Rinke</span> and chiropractor Garrett Soldano at about 20 percent name recognition each.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer",
    "sentiment": "0.0"
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "d2022-01-13T00:00",
    "sentence": "Both businessman <span class='selected-term'>Kevin Rinke</span> and chiropractor Garrett Soldano each trail Whitmer by seven points, while conservative media personality Tudor Dixon is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race",
    "sentiment": "0.0"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "d2022-01-27T19:49",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman <span class='selected-term'>Kevin Rinke</span>; Norton Shores businesswoman and conservative commentator Tudor Dixon; Kalamazoo chiropractor Garrett Soldano; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor",
    "sentiment": "0.0"
  },
  {
    "id": 1005,
    "mediaId": 43,
    "date": "d2022-01-28T00:00",
    "sentence": "A dozen Republicans are seeking their party's nod, including former Detroit Police Chief James Craig, chiropractor Garrett Soldano, businessman <span class='selected-term'>Kevin Rinke</span>, and conservative radio host Tudor Dixon.",
    "author": "",
    "title": "GOP primary for Wisconsin governor",
    "sentiment": "0.0"
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "d2022-02-02T00:00",
    "sentence": "Wealthy businessman <span class='selected-term'>Kevin Rinke</span>, by contrast, raised a mere $5,000 from donors but self-funded $2 million, and his $1.5 million war chest was the largest of anyone running in the August GOP primary.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote",
    "sentiment": "0.0"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "d2022-02-25T00:00",
    "sentence": "The poll also found that <span class='selected-term'>Kevin Rinke</span> holds five percent of the vote, Tudor Dixon and Ryan Kelly have four percent, and Perry Johnson and Mike Brown hold three percent.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals",
    "sentiment": "0.0"
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "d2022-04-01T00:00",
    "sentence": "Trailing Craig and Soldano were several other candidates in the packed primary race, including businessman Perry Johnson at eight percent, real estate broker and activist Ryan Kelly at six percent, conservative commentator Tudor Dixon at three percent, and former car dealership owner <span class='selected-term'>Kevin Rinke</span> at two percent, according to the poll.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary",
    "sentiment": "0.0"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "d2022-04-02T10:00",
    "sentence": "Also, as of Friday, Oakland County businessman and former auto dealer <span class='selected-term'>Kevin Rinke</span> said he hadn't made a decision as to whether to attend, a spokeswoman said.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0.0"
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "d2022-04-07T00:00",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator Tudor Dixon, former Detroit Police Chief James Craig, businessman Perry Johnson and businessman <span class='selected-term'>Kevin Rinke</span>.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case",
    "sentiment": "0.0"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "d2022-04-19T00:00",
    "sentence": "Mike Brown; businesswomen Donna Brandeburg and Tudor Dixon; businessman Perry Johnson; real estate agent Ryan Kelley; financial advisor Michael Markey; pastor Ralph Rebandt, businessman <span class='selected-term'>Kevin Rinke</span>; and chiropractor Garrett Soldano.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert",
    "sentiment": "0.0"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "d2022-04-19T18:39",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman Tudor Dixon, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says",
    "sentiment": "0.0"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "d2022-04-22T00:00",
    "sentence": "The August primary also includes two wealthy businessmen, <span class='selected-term'>Kevin Rinke</span> and Perry Johnson.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": "0.0"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "d2022-04-25T00:00",
    "sentence": "The August primary also includes two wealthy businessmen, <span class='selected-term'>Kevin Rinke</span> and Perry Johnson.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": "0.0"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "d2022-05-06T00:00",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor Garrett Soldano, businessman Perry Johnson, real estate broker and activist Ryan Kelley, conservative commentator Tudor Dixon, and former car dealership owner <span class='selected-term'>Kevin Rinke</span>.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race",
    "sentiment": "0.0"
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "d2022-05-12T20:36",
    "sentence": "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates James Craig, Perry Johnson, Ryan Kelley, <span class='selected-term'>Kevin Rinke</span> and Garrett Soldano made the cut, according to a news release.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac",
    "sentiment": "0.0"
  },
  {
    "id": 3292,
    "mediaId": 261,
    "date": "d2022-05-13T01:52",
    "sentence": "Mike Brown, of Stevensville; Norton Shores businesswoman Tudor Dixon; Oakland County \"quality guru\" and businessman Perry Johnson; Ottawa County real estate agent Ryan Kelley; Grand Haven financial adviser Michael Markey; Rebandt; Bloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>; and Kalamazoo chiropractor Garrett Soldano.",
    "author": "Paul Egan",
    "title": "Higher education funding highlights divisions among GOP candidates for governor at debate",
    "sentiment": "0.0"
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "d2022-05-16T23:30",
    "sentence": "Based on a poll the business group conducted of support for the 10 candidates who have submitted petition signatures to get on the primary ballot, the chamber invited former Detroit Police Chief James Craig, Oakland County businessman Perry Johnson, Kelley, Oakland County businessman <span class='selected-term'>Kevin Rinke</span>, and Kalamazoo chiropractor Garrett Soldano to participate in the June 2 debate.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements",
    "sentiment": "0.0"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "d2022-05-23T22:03",
    "sentence": "Those qualifying for the ballot would be Dixon, a former conservative TV news host who netted the DeVos family endorsement earlier Monday; chiropractor and grass-roots activist Garrett Soldano; wealthy self-funding businessman <span class='selected-term'>Kevin Rinke</span>; real estate broker and anti-coronavirus lockdown activist Ryan Kelley; and pastor Ralph Rebandt.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": "0.0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "d2022-05-24T00:00",
    "sentence": "Businessman <span class='selected-term'>Kevin Rinke</span>, chiropractor Garrett Soldano, far-right activist Ryan Kelley and the Rev.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "0.0"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "d2022-05-24T02:09",
    "sentence": "Also on the ballot, and suddenly in much stronger positions, are:Ottawa County real estate agent Ryan Kelley; Farmington Hills pastor Ralph Rebandt; Bloomfield Hills businessman <span class='selected-term'>Kevin Rinke</span>, and Kalamazoo chiropractor Garrett Soldano.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": "0.0"
  }
]