[
  {
    "id": 4044,
    "mediaId": 6746,
    "date": "2022-01-17",
    "sentence": "The Saturday event had Arizona state Representative <span class='selected-term'>Mark Finchem</span> address the audience as a \"special guest speaker.\"",
    "author": "Renz Soliman",
    "title": "Trump Supporters Believe Deceased JFK Jr. Is 'Coming Back' To Be Former President's VP"
  },
  {
    "id": 3574,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "Another speaker was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who is running to be Arizona’s secretary of state, has been linked to QAnon and has reportedly discussed conspiracies about a network of elected officials involved in a network of pedophilia.",
    "author": "",
    "title": "Trump superfans dream of a run again, and of JFK Jr. on the ticket"
  },
  {
    "id": 3686,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "author": "Joe Hoft",
    "title": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity"
  },
  {
    "id": 3595,
    "mediaId": 2578,
    "date": "2022-01-21",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Reads Whistleblower’s Email Dated 11/10/2020 Disclosing Plot By Dems To “Embed” Thousands of Fraudulent Votes Into Pima County’s Election\nInvestigations are still transpiring statewide while we await the results of the router and Splunk log analysis portion of Maricopa County’s full forensic audit.",
    "author": "Jordan Conradson",
    "title": "MUST SEE: Arizona Senate President Karen Fann Gives Exclusive Update On Maricopa County Router Audit – AZ Attorney General Has Pulled Numerous People For Questioning"
  },
  {
    "id": 3771,
    "mediaId": 2547,
    "date": "2022-01-23",
    "sentence": "He played a clip of <span class='selected-term'>Mark Finchem</span>, who is another Trump-backed lunatic who loves QAnon and is running for secretary of state in Arizona.",
    "author": "Red Painter",
    "title": "Acosta Drags DeSantis: He Should Send His Election Police To Mar-A-Lago"
  },
  {
    "id": 4063,
    "mediaId": 2550,
    "date": "2022-01-24",
    "sentence": "The emails show involvement by numerous MAGA crew, including <span class='selected-term'>Mark Finchem</span>, a candidate for secretary of State in Arizona, which is terrifying because should he win, he would oversee elections in Arizona.",
    "author": "Rebekah Sager",
    "title": "Newly uncovered MAGA emails show a sinister conspiracy to refute Biden's win and bestow it on Trump"
  },
  {
    "id": 3969,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 3636,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nArizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> told The Gateway Pundit that he is already working on a five-page resolution to reclaim Arizona’s electors.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)"
  },
  {
    "id": 3665,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 3167,
    "mediaId": 2578,
    "date": "2022-01-27",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Expects Arrests in Arizona: “Maricopa County Isn’t The Only County – We Are Waiting for Indictments”\nThe Gateway Pundit correspondent Jordan Conradson spoke to Senator Rogers about Arizona Attorney General Mark Brnovich’s investigation and decertification in Arizona.",
    "author": "Jordan Conradson",
    "title": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”"
  },
  {
    "id": 3216,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 3200,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "author": "",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 2728,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Fifteen Republican legislators have signed on to Fillmore's bill, including Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed candidate for Arizona secretary of state.",
    "author": "Chris Cillizza",
    "title": "An Arizona Republican just unveiled the most brazen election bill yet"
  },
  {
    "id": 3004,
    "mediaId": 2584,
    "date": "2022-01-29",
    "sentence": "One of the co-sponsors of the bill is <span class='selected-term'>Mark Finchem</span>, a state representative who believes the 2020 election was stolen, has ties to the Oath Keepers, and was at the Capitol on 6 January.",
    "author": "Sam Levine",
    "title": "Arizona Republicans introduce election subversion bill"
  },
  {
    "id": 3463,
    "mediaId": 2636,
    "date": "2022-01-30",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "",
    "title": "Campaigning to Oversee Elections, While Denying the Last One"
  },
  {
    "id": 3488,
    "mediaId": 6435,
    "date": "2022-01-31",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "Jennifer Medina",
    "title": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state"
  },
  {
    "id": 3270,
    "mediaId": 5308,
    "date": "2022-02-01",
    "sentence": "Watkins told VICE News that while at the rally he had tried to speak to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who has promoted QAnon conspiracies, and who is seeking election in November as secretary of state.",
    "author": "David Gilbert",
    "title": "QAnon Thought Leader Ron Watkins Is Running for Congress. It’s Going Terribly."
  },
  {
    "id": 3007,
    "mediaId": 2707,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 2751,
    "mediaId": 2520,
    "date": "2022-02-03",
    "sentence": "Here are the then-current and incoming Republican state legislators who signed the resolution asking Congress to accept Arizona’s fake electors: Sen. Kelly Townsend of Mesa, Rep. Bret Roberts of Maricopa, Rep. Kevin Payne of Peoria, Rep. <span class='selected-term'>Mark Finchem</span> of Oro Valley, Sen. David Farnsworth of Mesa, Sen. Sonny Borrelli of Lake Havasu City, Rep. Leo Biasiucci, of Lake Havasu City, Rep. Anthony Kern of Glendale, Rep. David Cook of Globe, Sen. Sylvia Allen of Snowflake, Rep. John Fillmore of Apache Junction, Sen. Nancy Barto of Phoenix, Rep. Travis Grantham of Gilbert, Senate Majority Leader Warren Petersen of Gilbert, Rep. Walter Blackman of Snowflake, Rep. Steve Pierce of Prescott, Rep. Shawnna Bolick of Phoenix, Rep. Tony Rivero of Peoria, Rep. Noel Campbell of Prescott.",
    "author": "Laurie Roberts",
    "title": "What is Arizona GOP Chair Kelli Ward hiding from the committee investigating Jan. 6?"
  },
  {
    "id": 1896,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nAZ Senate Republicans are pushing for serious election reform and decertification of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "TOMORROW: AZ Senate Government Committee Considers 14 Election Integrity Bills – Drive-Up Voting; Prohibition, Voting; One Day Only; Holiday"
  },
  {
    "id": 1934,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "On Monday, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (Trump’s endorsed candidate for secretary of state) introduced a resolution seeking to decertify the results in Maricopa, Pima and Yuma counties — more than a year after the presidential election and following numerous fruitless attempts at digging up evidence that a massive voter fraud scheme cost Trump the presidency.",
    "author": "Liz Skalka",
    "title": "Arizona Republican Says His Daughter Got Text Calling Him 'N-Word' RINO"
  },
  {
    "id": 1819,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "State Representative @RealMarkFinchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections.https://t.co/yNnZjZpD10 #HCR2033 #azleg pic.twitter.com/Si7GjMAEeg\n— AZ House Republicans (@AZHouseGOP) February 7, 2022\nNEWS RELEASE\nArizona House of Representatives Representative <span class='selected-term'>Mark Finchem</span> (R-11)\nRepresentative Finchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections\nSTATE CAPITOL, PHOENIX – State Representative Mark Finchem has introduced HCR 2033, a concurrent resolution calling for the elections of Maricopa, Pima and Yuma Counties to be set aside based on clear and convincing evidence that the elections in those counties were irredeemably compromised.",
    "author": "Jordan Conradson",
    "title": "BREAKING BIG: Arizona State Rep. Mark Finchem Introduces Resolution To SET ASIDE & DECERTIFY Three 2020 County Elections"
  },
  {
    "id": 1942,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 7, 2022\nAnd also on Monday video proof was released of Maricopa County election workers deleting “archived” files from servers before delivery to state auditors — a criminal offense.",
    "author": "Jordan Conradson",
    "title": "BREAKING – President Trump: “They Are So Desperate To Hide The Truth, They’ll Make It Criminal To Speak It!”"
  },
  {
    "id": 1946,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "View the full report here:\nMaricopa-Chain-of-Custody-Failure\nWith confirmation of receipt from the AZ Attorney General\nReceipt from the Attorney General’s Office\nArizona State Representative <span class='selected-term'>Mark Finchem</span> told TGP that he was working on a resolution to reclaim Arizona’s fraudulent 2020 Presidential Electors, and he delivered.",
    "author": "Jordan Conradson",
    "title": "HUGE: Maricopa County – Investigation Finds Additional 740,000 Ballots Have No Documented Chain Of Custody"
  },
  {
    "id": 1903,
    "mediaId": 2520,
    "date": "2022-02-08",
    "sentence": "Not former state Rep. <span class='selected-term'>Mark Finchem</span>, now running for Arizona secretary of state.",
    "author": "EJ Montini",
    "title": "Arizona's Jan. 6 insurrectionists should be barred from holding office"
  },
  {
    "id": 1923,
    "mediaId": 2520,
    "date": "2022-02-09",
    "sentence": "One conspiracy kook, Rep. <span class='selected-term'>Mark Finchem</span>, even tried to have the 2020 elections from Maricopa, Pima and Yuma counties set aside.",
    "author": "EJ Montini",
    "title": "Does the NFL have the guts to move the 2023 Super Bowl out of Arizona?"
  },
  {
    "id": 1882,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "RINO Arizona Speaker of The House Rusty Bowers told reporters yesterday that Arizona State Representative <span class='selected-term'>Mark Finchem</span>’s resolution to decertify three 2020 Arizona county elections is “obviously unconstitutional and profoundly unwise.”\nBowers has been no fan of election integrity or the full forensic of Maricopa County, which confirmed countless election law violations and hundreds of thousands of illegal or fraudulent ballots.",
    "author": "Jordan Conradson",
    "title": "Arizona House Speaker Turncoat Rusty Bowers: “Mr. Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”"
  },
  {
    "id": 1864,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "The Gateway Pundit reported that <span class='selected-term'>Mark Finchem</span> introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)"
  },
  {
    "id": 2595,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "The bill was introduced Monday by right-wing Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Trump-endorsed candidate for secretary of state.",
    "author": "John Wright",
    "title": "‘This is what we’ve been waiting for!’: Mike Lindell celebrates doomed Arizona decertification bill"
  },
  {
    "id": 2409,
    "mediaId": 2688,
    "date": "2022-02-09",
    "sentence": "Within hours of Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R) introducing his bill to “decertify” and “set aside” the 2020 election results in three of Arizona’s largest counties, two things happened.",
    "author": "Cristina Cabrera",
    "title": "Trump-Endorsed Arizona Secretary of State Candidate Has A Show Bill To ‘Decertify’ 2020"
  },
  {
    "id": 2452,
    "mediaId": 2594,
    "date": "2022-02-10",
    "sentence": "She also has pledged – if elected – to direct the state’s office of Attorney General to open a criminal investigation into the election, including seizing “all election material, all election equipment, and he should start questioning people immediately.”\nThe leading GOP candidate for Arizona’s secretary of state, state representative <span class='selected-term'>Mark Finchem</span>, filed legislation this week to decertify the state’s 2020 election results, baselessly asserting that “illegal acts occurred” and that the outcome is “irredeemably compromised, and it is impossible to name a clear winner of the contest.”\nHis fundraising has outpaced the two leading Democratic candidates combined.",
    "author": "Alex Woodward",
    "title": "They wanted to overturn 2020 election results. Now these candidates want to run the next elections"
  },
  {
    "id": 1873,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Laurie Roberts",
    "title": "Want to quit APS? Legislators are backing a plan to make sure that can never happen"
  },
  {
    "id": 1272,
    "mediaId": 2636,
    "date": "2022-02-11",
    "sentence": "“Not since Hitler himself have we seen evil come across the country,” said <span class='selected-term'>Mark Finchem</span>, an Arizona lawmaker who is running for secretary of state there.",
    "author": "",
    "title": "The Traveling Trump Show"
  },
  {
    "id": 1092,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 1332,
    "mediaId": 6509,
    "date": "2022-02-14",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 Panel Subpoenas 6 More in Fake GOP Electors Scheme"
  },
  {
    "id": 1402,
    "mediaId": 2594,
    "date": "2022-02-15",
    "sentence": "Two Republican state lawmakers — Pennsylvania senator Doug Mastriano and Arizona senator <span class='selected-term'>Mark Finchem</span> — also received subpoenas from Mr Thompson on Monday.",
    "author": "Andrew Feinberg",
    "title": "Capitol riot committee subpoenas Trump campaign officials and state lawmakers involved in sham elector plot"
  },
  {
    "id": 1445,
    "mediaId": 2707,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1446,
    "mediaId": 2728,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 1103,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "La nueva ola de objetivos de citaciones incluye a Kelli Ward, presidenta del Partido Republicano de Arizona, además de dos candidatos políticos republicanos en estados indecisos: el senador estatal Doug Mastriano es candidato a gobernador de Pennsylvania y el representante estatal <span class='selected-term'>Mark Finchem</span> se postula para ser el próximo secretario de estado en Arizona.",
    "author": "",
    "title": "Comité que investiga el asalto al Capitolio cita a supuestos “electores suplentes” de Trump"
  },
  {
    "id": 1166,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 1181,
    "mediaId": 2523,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1259,
    "mediaId": 2631,
    "date": "2022-02-15",
    "sentence": "The panel also issued a subpoena Tuesday to <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state in Arizona and has been endorsed by Trump.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers"
  },
  {
    "id": 1066,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 996,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nThis sham investigation is targeting Rep. <span class='selected-term'>Mark Finchem</span> and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 928,
    "mediaId": 2590,
    "date": "2022-02-15",
    "sentence": "“The select committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well.”\nAmong the six are two new celebrities among Trump followers: <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who is running to be the top elections official there, and Doug Mastriano, a Pennsylvania legislator who led the efforts to overturn Democrat Joe Biden’s victory in that state.",
    "author": "",
    "title": "Jan. 6 Committee Focuses On Trump Scheme To Solicit Slates Of Fake Electors"
  },
  {
    "id": 934,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "https://t.co/nDKQe9zCux\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 14, 2022\nNo matter where you live, sign Arizona State Rep. Mark Finchem’s petition to decertify the fraudulent 2020 election and strongly encourage your state legislators to sign State Senator Rogers’ letter to audit 50 states.",
    "author": "Jordan Conradson",
    "title": "204 Legislators Call For 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives"
  },
  {
    "id": 964,
    "mediaId": 2592,
    "date": "2022-02-16",
    "sentence": "Trump endorsed his vocal supporter Rep. Finchem in Sept. 2021\nFinchem has repeatedly shared COVID-19 conspiracies\nFinchem was also spotted near the Capitol during the Jan. 6 insurrection\nFormer President Donald Trump has chosen Rep. <span class='selected-term'>Mark Finchem</span>, R-AZ, as his top pick for Arizona’s secretary of state position — a lawmaker known for repeatedly spreading misinformation about the COVID-19 pandemic and vaccines.",
    "author": "Danielle Ong",
    "title": "Trump Picks Anti-Vaxxer Who Claims COVID-19 Doesn't Exist For Arizona Sec. Of State"
  },
  {
    "id": 1040,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "Among those subpoenaed are Arizona Republican Party Chairwoman Kelli Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, former Michigan Republican Chair Laura Cox and Pennsylvania GOP state Sen. Doug Mastriano.",
    "author": "Jennifer Shutt",
    "title": "Jan. 6 panel subpoenas six people tied to pro-Trump fake electors plan"
  },
  {
    "id": 1526,
    "mediaId": 2547,
    "date": "2022-02-16",
    "sentence": "[...] The other subpoenas were issued to Michael Roman and Gary Michael Brown, who led Election Day operations for Trump’s 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative <span class='selected-term'>Mark Finchem</span>.",
    "author": "Susie Madrak",
    "title": "Jan. 6th Committee Subpoenas Six GOPers In Fake Elector Plot"
  },
  {
    "id": 1354,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "The subpoenas went to Arizona Republican Party Chairwoman Kelli Ward, a longtime Trump supporter, as well as Pennsylvania state Sen. Doug Mastriano, now running for governor there, and Arizona State House Rep. <span class='selected-term'>Mark Finchem</span>, now running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "State officials pushing Trump alternate elector scheme come into focus"
  },
  {
    "id": 1707,
    "mediaId": 2580,
    "date": "2022-02-17",
    "sentence": "– I don’t think we should go backward in terms of voting even though we obviously recognize that voting is an incredibly crucial piece of the way our country functions.”\nAs previously reported by Human Events News, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> took his Arizona Ballot Integrity Project (BIP) national in October when he and approximately 30 others from around the country gathered at the suburban Dallas offices of international authentication leader, Authentix, to create a process for introducing a highly counterfeit-resistant paper ballot.",
    "author": "GOPUSA",
    "title": "BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts"
  },
  {
    "id": 962,
    "mediaId": 2578,
    "date": "2022-02-17",
    "sentence": "Arizona State Representative and American Hero <span class='selected-term'>Mark Finchem</span> recently introduced a resolution to set aside and decertify three 2020 county elections in Arizona.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Cyber Ninjas CEO Doug Logan Spoke Twice With Arizona Election Fraud Investigators: “Last Time I Spoke With Them They Indicated That They Were Starting To Wrap Up, We Should Have The Results Relatively Soon”"
  },
  {
    "id": 267,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 207,
    "mediaId": 2520,
    "date": "2022-02-21",
    "sentence": "These are the Republicans who voted no:\nBrenda Barton of Payson, Judy Burges of Skull Valley, Neal Carter of San Tan Valley, Joseph Chaplik of Scottsdale, Lupe Diaz of Benson, John Fillmore of Apache Junction, <span class='selected-term'>Mark Finchem</span> of Oro Valley.",
    "author": "Laurie Roberts",
    "title": "Shame on every Republican who voted to sabotage Arizona's schools"
  },
  {
    "id": 34,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> recently presented a resolution to decertify the fraudulent election results, but Rusty Bowers lacks the courage to fight for Arizona voters.",
    "author": "Jordan Conradson",
    "title": "RINO Arizona House Speaker Rusty Bowers Files to Run for Senate After Turning On Constituents and Allowing Election Fraud"
  },
  {
    "id": 300,
    "mediaId": 2528,
    "date": "2022-02-21",
    "sentence": "He also shared the link to a donation page titled \"Rep <span class='selected-term'>Mark Finchem</span> Legal Defense Fund\" on the Christian crowdfunding site GiveSendGo.",
    "author": "Kelsey Vlamis",
    "title": "A Trump-backed candidate in Arizona is trying to raise $750,000 for a legal defense fund after he was subpoenaed by the January 6 committee"
  },
  {
    "id": 547,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nEXCLUSIVE: Arizona State Representative <span class='selected-term'>Mark Finchem</span> Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”"
  },
  {
    "id": 634,
    "mediaId": 2520,
    "date": "2022-02-22",
    "sentence": "And it’s being promoted by Rep. <span class='selected-term'>Mark Finchem</span>, a guy who is hoping that if he lies often enough about Arizona’s election being stolen that voters will install him as secretary of state to oversee future elections.",
    "author": "Laurie Roberts",
    "title": "GOP legislators want new ballots that - surprise! - can only be made by one company"
  },
  {
    "id": 666,
    "mediaId": 2662,
    "date": "2022-02-23",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”"
  },
  {
    "id": 599,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 400,
    "mediaId": 4032,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Alex Newman",
    "title": "2020 Presidential Election in Maricopa County Should Be Set Aside"
  },
  {
    "id": 12771,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "Some state legislators who had contacts with Giuliani as part of the scam have been subpoenaed by the panel, such as <span class='selected-term'>Mark Finchem</span> in Arizona and Doug Mastriano in Pennsylvania, who are, respectively, running in 2022 to be secretary of state and governor in moves that raise fears of future attempts to subvert American democracy.",
    "author": "Peter Stone",
    "title": "Giuliani’s legal problems deepen as ‘false electors’ scheme investigated"
  },
  {
    "id": 17329,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "That was echoed by Gates, who pointed to Rep. <span class='selected-term'>Mark Finchem</span>, R-Tucson, a Trump-endorsed candidate for the elections job who Gates said “has made it very clear what his intent will be if he is elected secretary of state.”\nAll three panelists said they and their colleagues experienced threats on their homes, families and lives in the months following the election.",
    "author": "Camila Pedrosa",
    "title": "Gates expresses ‘great concerns’ about future of Arizona election integrity"
  },
  {
    "id": 11258,
    "mediaId": 2735,
    "date": "2022-03-07",
    "sentence": "Now, he’s trying to secure the election, this coming November, of <span class='selected-term'>Mark Finchem</span> as secretary of state.",
    "author": "Sasha Abramsky",
    "title": "Trump’s Pick for AZ Secretary of State Participated in January 6 Capitol Breach"
  },
  {
    "id": 15577,
    "mediaId": 8475,
    "date": "2022-03-07",
    "sentence": "Alexander is connected to another Arizona politician as well, state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "Jerod MacDonald-Evoy",
    "title": "New report highlights Roger Stone’s efforts on behalf of Trump allies in Arizona"
  },
  {
    "id": 11010,
    "mediaId": 2578,
    "date": "2022-03-07",
    "sentence": "Citing the massive evidence of fraud and doubt in elections, Arizona State Representative <span class='selected-term'>Mark Finchem</span> introduced a resolution to decertify the fraudulent 2020 election in Arizona last month.",
    "author": "Jordan Conradson",
    "title": "(VIDEO) Interview With Mike Lindell At Arizona Gubernatorial Candidate Kari Lake’s Rodeo Rally: “You Legislators Out there, You’re Going to Be a Traitor or a Hero”"
  },
  {
    "id": 11232,
    "mediaId": 2520,
    "date": "2022-03-15",
    "sentence": "The other group of fake electors, headed by Arizona GOP Chairwoman Kelli Ward, has also avoided any real trouble, although Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and a few others have been subpoenaed by the Select Committee to Investigate the January 6th Attack on the United States Capitol.",
    "author": "EJ Montini",
    "title": "Why aren't Arizona's treasonous fake electors in jail?"
  },
  {
    "id": 9079,
    "mediaId": 2662,
    "date": "2022-03-21",
    "sentence": "Despite the ongoing processes, The Arizona audit discovered over 700,000 ballot discrepancies, and Arizona State Representative <span class='selected-term'>Mark Finchem</span> has introduced a resolution to decertify the 2002 Presidential Election.",
    "author": "Jordan Conradson",
    "title": "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?"
  },
  {
    "id": 9739,
    "mediaId": 2560,
    "date": "2022-03-26",
    "sentence": "Lansing — <span class='selected-term'>Mark Finchem</span>, whom former President Donald Trump endorsed to be Arizona's next secretary of state, told a crowd in Michigan Saturday to \"fire\" lawmakers who were unwilling to consider claims of wrongdoing in the 2020 election.",
    "author": "Craig Mauger",
    "title": "Trump-backed candidates see 'movement' in Michigan despite small rally crowd"
  },
  {
    "id": 10029,
    "mediaId": 8475,
    "date": "2022-03-30",
    "sentence": "On paper, the Democratic advocacy group MoveOn has spent more than $1.4 million against Republican <span class='selected-term'>Mark Finchem</span> in his campaign to become Arizona’s next secretary of state.",
    "author": "Jeremy Duda",
    "title": "Reported spending not indicative of Dem campaign against Arizona Rep. Mark Finchem — yet"
  },
  {
    "id": 7421,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "\"Since the 2020 election, Rep. <span class='selected-term'>Mark Finchem</span> has alleged widespread voter fraud, arguing in part that too many mail-in ballots went to people not living at some Arizona addresses.",
    "author": "Bob Brigham",
    "title": "BUSTED: Trump-endorsed Secretary of State candidate does not live where he is registered to vote"
  },
  {
    "id": 7641,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "A group seeking to bar those it blames for the Jan. 6, 2021, riot at the U.S. Capitol from seeking further office helped file lawsuits Thursday against U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Ronald J. Hansen",
    "title": "Lawsuits aim to ban Andy Biggs, Paul Gosar and Mark Finchem from holding office"
  },
  {
    "id": 7730,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 6011,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 5909,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span> from holding office.",
    "author": "EJ Montini",
    "title": "Honor the Constitution and ban Arizona's insurrectionists from holding public office"
  },
  {
    "id": 5766,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 5989,
    "mediaId": 2594,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "Via AP news wire",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 6027,
    "mediaId": 2680,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5569,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5149,
    "mediaId": 8251,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4635,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4844,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "Representatives Paul Gosar and Andy Biggs and state Representative <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley, claim they violated section three of the 14th Amendment, which states no governmental official “shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.”\nAttorneys for the lawmakers argued before Maricopa County Superior Court Judge Christopher Coury on Wednesday.",
    "author": "Michael McDaniel",
    "title": "Arizona lawmakers connected to Jan. 6 riot seek dismissal of candidate disqualification case"
  },
  {
    "id": 4831,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "The lawsuits sought to disqualify Gosar, Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> by citing a section of the 14th Amendment to the U.S. constitution enacted after the Civil War.",
    "author": "",
    "title": "Judge dismisses ballot challenges against Gosar, Biggs, Finchem"
  },
  {
    "id": 4985,
    "mediaId": 8475,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Judge boots case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5255,
    "mediaId": 2562,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "NationalWatch",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5233,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeffrey Rodack",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 6051,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. <span class='selected-term'>Mark Finchem</span> (who’s running for Secretary of State) off the ballot in Arizona.",
    "author": "Nick Arama",
    "title": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat"
  },
  {
    "id": 5181,
    "mediaId": 8345,
    "date": "2022-04-23",
    "sentence": "The decision from Maricopa County Superior Court Judge Christopher Coury made public Friday means Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> remain on the primary ballot barring a reversal by the state Supreme Court.",
    "author": "Associated Press",
    "title": "Arizona judge nixes suit that seeks to keep Trump backers off ballot"
  },
  {
    "id": 4944,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The lawsuit issued by a voting rights group sought to prevent Rep. Paul Gosar, Rep. Andy Biggs, and State Rep. <span class='selected-term'>Mark Finchem</span> from running for reelection.",
    "author": "Laura Ramirez",
    "title": "Victory: Arizona judge dismisses lawsuit, allows pro-Trump candidates to stay on the ballot"
  },
  {
    "id": 4708,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The injunction plaintiffs include Kari Lake, the Republican and Trump-endorsed candidate for Arizona governor, and Rep. <span class='selected-term'>Mark Finchem</span>, R-Ariz., candidate for Arizona Secretary of State.",
    "author": "Summer Lane",
    "title": "Mike Lindell on injunctions to remove voting machines: ‘All machines have to go’"
  }
]