[
  {
    "id": 7641,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "A group seeking to bar those it blames for the Jan. 6, 2021, riot at the U.S. Capitol from seeking further office helped file lawsuits Thursday against U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Ronald J. Hansen",
    "title": "Lawsuits aim to ban Andy Biggs, Paul Gosar and Mark Finchem from holding office"
  },
  {
    "id": 6011,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 5909,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span> from holding office.",
    "author": "EJ Montini",
    "title": "Honor the Constitution and ban Arizona's insurrectionists from holding public office"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 4985,
    "mediaId": 8475,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Judge boots case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 4822,
    "mediaId": 2766,
    "date": "2022-04-23",
    "sentence": "They filed a lawsuit to stop Reps Paul Gosar, Andy Biggs, and State House Rep <span class='selected-term'>Mark Finchem</span> alleging that they participated in an “insurrection” stemming from the Jan 6 riot.",
    "author": "Faye Higbee",
    "title": "Democrats Attempt to Disqualify Reps Gosar, Biggs, Finchem; Court Dismissed the Attempt."
  }
]