[
  {
    "id": 3843,
    "mediaId": 2694,
    "date": "2022-01-15",
    "sentence": "Other speakers included secretary-of-state candidate <span class='selected-term'>Mark Finchem</span>, who was at the Capitol last January 6 and who often wears a cowboy hat and bolo tie despite being from Michigan; Paul Gosar, Andy Biggs, and Debbie Lesko, three Trump-loving members of Congress who voted against certifying Biden’s win in 2020; and Arizona GOP chair Kelli Ward, who has embraced numerous conspiracy theories and recently received a cease-and-desist notice from Dominion Voting Systems after accusing the company of changing 6,000 Trump votes to Biden votes.",
    "author": "Elaine Godfrey",
    "title": "Trump Soft-Launches His 2024 Campaign"
  },
  {
    "id": 4044,
    "mediaId": 6746,
    "date": "2022-01-17",
    "sentence": "The Saturday event had Arizona state Representative <span class='selected-term'>Mark Finchem</span> address the audience as a \"special guest speaker.\"",
    "author": "Renz Soliman",
    "title": "Trump Supporters Believe Deceased JFK Jr. Is 'Coming Back' To Be Former President's VP"
  },
  {
    "id": 3574,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "Another speaker was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who is running to be Arizona’s secretary of state, has been linked to QAnon and has reportedly discussed conspiracies about a network of elected officials involved in a network of pedophilia.",
    "author": "",
    "title": "Trump superfans dream of a run again, and of JFK Jr. on the ticket"
  },
  {
    "id": 4338,
    "mediaId": 2741,
    "date": "2022-01-18",
    "sentence": "Another speaker was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who is running to be Arizona’s secretary of state, has been linked to QAnon and has reportedly discussed conspiracies about a network of elected officials involved in a network of pedophilia.",
    "author": "Bess Levin",
    "title": "A Not-Insignificant Number of Trump Supporters Think JFK Jr. Is Alive, Going to Run on the 2024 Ticket"
  },
  {
    "id": 3686,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "author": "Joe Hoft",
    "title": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity"
  },
  {
    "id": 3595,
    "mediaId": 2578,
    "date": "2022-01-21",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Reads Whistleblower’s Email Dated 11/10/2020 Disclosing Plot By Dems To “Embed” Thousands of Fraudulent Votes Into Pima County’s Election\nInvestigations are still transpiring statewide while we await the results of the router and Splunk log analysis portion of Maricopa County’s full forensic audit.",
    "author": "Jordan Conradson",
    "title": "MUST SEE: Arizona Senate President Karen Fann Gives Exclusive Update On Maricopa County Router Audit – AZ Attorney General Has Pulled Numerous People For Questioning"
  },
  {
    "id": 3771,
    "mediaId": 2547,
    "date": "2022-01-23",
    "sentence": "He played a clip of <span class='selected-term'>Mark Finchem</span>, who is another Trump-backed lunatic who loves QAnon and is running for secretary of state in Arizona.",
    "author": "Red Painter",
    "title": "Acosta Drags DeSantis: He Should Send His Election Police To Mar-A-Lago"
  },
  {
    "id": 4063,
    "mediaId": 2550,
    "date": "2022-01-24",
    "sentence": "The emails show involvement by numerous MAGA crew, including <span class='selected-term'>Mark Finchem</span>, a candidate for secretary of State in Arizona, which is terrifying because should he win, he would oversee elections in Arizona.",
    "author": "Rebekah Sager",
    "title": "Newly uncovered MAGA emails show a sinister conspiracy to refute Biden's win and bestow it on Trump"
  },
  {
    "id": 3969,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 3665,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 3703,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "Incredible speakers, including Arizona State Representative <span class='selected-term'>Mark Finchem</span> and General Michael Flynn, will headline the three-day event at the U.S.-Mexico border.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Women Fighting For America’s Jan. 28-30 Border Event Comes Under Attack from Angry Leftists and Big Tech – Organizers Vow to Push Forward — REGISTER HERE"
  },
  {
    "id": 3636,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nArizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> told The Gateway Pundit that he is already working on a five-page resolution to reclaim Arizona’s electors.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)"
  },
  {
    "id": 4458,
    "mediaId": 2540,
    "date": "2022-01-26",
    "sentence": "Instead, she posted the CNN reporter’s business card on her Facebook page, writing, “I will not be intimidated.”\nIn Arizona, another Trump-endorsed candidate, <span class='selected-term'>Mark Finchem</span>, is also running for secretary of state.",
    "author": "Anna-Maja Rappard",
    "title": "2020 sore losers look to run the 2024 vote"
  },
  {
    "id": 4040,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Women System",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 3216,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 3167,
    "mediaId": 2578,
    "date": "2022-01-27",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Expects Arrests in Arizona: “Maricopa County Isn’t The Only County – We Are Waiting for Indictments”\nThe Gateway Pundit correspondent Jordan Conradson spoke to Senator Rogers about Arizona Attorney General Mark Brnovich’s investigation and decertification in Arizona.",
    "author": "Jordan Conradson",
    "title": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”"
  },
  {
    "id": 3971,
    "mediaId": 2549,
    "date": "2022-01-27",
    "sentence": "The “We Stand America” event is scheduled to feature speeches from a host of luminaries in the stolen election/QAnon/anti-vaccine/MAGA universe/build-the-wall universe, including disgraced former National Security Advisor Michael Flynn, “Stop the Steal” advocate Rep. <span class='selected-term'>Mark Finchem</span> (R-Ariz.), stolen election figurehead Patrick Byrne, and QAnon promoter Mel K.\nThe email from the Center makes it clear that the grounds themselves are in direct danger from conference attendees who intend to form a “rolling car protest,” described as a ’Trump Train’-style “caravan to the border” that will likely make a stop at the National Butterfly Center.",
    "author": "Mike Rothschild",
    "title": "Butterfly sanctuary closes as QAnon believers, thinking it’s home to sex trafficking ring, plot caravan there"
  },
  {
    "id": 3553,
    "mediaId": 2528,
    "date": "2022-01-28",
    "sentence": "Arizona Rep. <span class='selected-term'>Mark Finchem</span> and former Immigration and Customs Enforcement Director Tom Homan are scheduled to attend.",
    "author": "Jake Epstein",
    "title": "The National Butterfly Center along the Texas-Mexico border is shutting down for 3 days, citing threats and a nearby MAGA rally"
  },
  {
    "id": 2792,
    "mediaId": 2590,
    "date": "2022-01-28",
    "sentence": "Other QAnon-supporting, pro-Trump personalties are also expected to attend, including <span class='selected-term'>Mark Finchem</span>, the Arizona state lawmaker running for Arizona secretary of state.",
    "author": "Josephine Harvey",
    "title": "Texas Butterfly Sanctuary Closes Due To 'Credible Threats' From Pro-Trump Event"
  },
  {
    "id": 3200,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "author": "",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 2840,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> told The Gateway Pundit that he is already working on a resolution to reclaim Arizona’s electors.",
    "author": "Sean Campbell",
    "title": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”"
  },
  {
    "id": 2862,
    "mediaId": 2662,
    "date": "2022-01-28",
    "sentence": "These letters were good for election integrity and the Arizona audit, but since 2020 we haven’t seen Blackman on the frontlines like Rep. <span class='selected-term'>Mark Finchem</span>, Senator Wendy Rogers, Senator Sonny Borrelli and other election integrity heros.",
    "author": "Jordan Conradson",
    "title": "“I See You Are Wendy’s Puppet!” – AZ State Rep Walt Blackman and Triggered WIFE, Kristi Blackman Psycho Text TGP’s Conradson Following TGP Article on Decertification"
  },
  {
    "id": 3421,
    "mediaId": 5308,
    "date": "2022-01-28",
    "sentence": "The event is being headlined by Trump’s disgraced former national security adviser, Michael Flynn, along with a number of QAnon influencers like Ann Vandersteel, Mel K, and Doug Billings as well as <span class='selected-term'>Mark Finchem</span>, the QAnon-supporting Arizona lawmaker who’s running for secretary of state.",
    "author": "David Gilbert",
    "title": "On Thursday, QAnon conspiracy theories about the National Butterfly Center became real-world threats."
  },
  {
    "id": 3166,
    "mediaId": 2596,
    "date": "2022-01-28",
    "sentence": "It's scheduled to feature speeches from a mix of various individuals from QAnon, anti-vaxx, and Trump supporters with appearances from National Security Advisor Michael Flynn, Rep. <span class='selected-term'>Mark Finchem</span> (R-Ariz.), Patrick Byrne, and QAnon promoter Mel K.\nIn the past, the center has been a target for right-wingers, specifically the Trumpist group, “We Build the Wall” campaign.",
    "author": "",
    "title": "How a butterfly sanctuary was forced to close because of a QAnon conspiracy"
  },
  {
    "id": 2728,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Fifteen Republican legislators have signed on to Fillmore's bill, including Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed candidate for Arizona secretary of state.",
    "author": "Chris Cillizza",
    "title": "An Arizona Republican just unveiled the most brazen election bill yet"
  },
  {
    "id": 3480,
    "mediaId": 8475,
    "date": "2022-01-28",
    "sentence": "Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley, responded by asking if it was moral to hold someone’s job “hostage” until they were vaccinated against their will.",
    "author": "Gloria Gomez",
    "title": "Arizona businesses with vaccine mandates would face $500K lawsuits under GOP proposal"
  },
  {
    "id": 3004,
    "mediaId": 2584,
    "date": "2022-01-29",
    "sentence": "One of the co-sponsors of the bill is <span class='selected-term'>Mark Finchem</span>, a state representative who believes the 2020 election was stolen, has ties to the Oath Keepers, and was at the Capitol on 6 January.",
    "author": "Sam Levine",
    "title": "Arizona Republicans introduce election subversion bill"
  },
  {
    "id": 3346,
    "mediaId": 2589,
    "date": "2022-01-29",
    "sentence": "Arizona Rep. <span class='selected-term'>Mark Finchem</span> and former Immigration and Customs Enforcement Director Tom Homan are scheduled to attend.",
    "author": "Karen Townsend",
    "title": "\"Credible threats\" force three-day shut down of National Butterfly Center"
  },
  {
    "id": 3463,
    "mediaId": 2636,
    "date": "2022-01-30",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "",
    "title": "Campaigning to Oversee Elections, While Denying the Last One"
  },
  {
    "id": 2907,
    "mediaId": 8450,
    "date": "2022-01-30",
    "sentence": "Uno de los legisladores que promueven el proyecto de ley es <span class='selected-term'>Mark Finchem</span>, un representante estatal que cree que las elecciones de 2020 fueron robadas, tiene vínculos con Oath Keepers y estuvo en el capitolio el 6 de enero.",
    "author": "",
    "title": "Derecho al voto en Arizona: líderes religiosos y republicanos chocan por controversial iniciativa"
  },
  {
    "id": 3324,
    "mediaId": 8268,
    "date": "2022-01-31",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 2911,
    "mediaId": 8268,
    "date": "2022-01-31",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 3407,
    "mediaId": 2898,
    "date": "2022-01-31",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "Jennifer Medina",
    "title": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state"
  },
  {
    "id": 3356,
    "mediaId": 6602,
    "date": "2022-01-31",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "Jennifer Medina",
    "title": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state"
  },
  {
    "id": 3488,
    "mediaId": 6435,
    "date": "2022-01-31",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "Jennifer Medina",
    "title": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state"
  },
  {
    "id": 3238,
    "mediaId": 2660,
    "date": "2022-01-31",
    "sentence": "State Rep. <span class='selected-term'>Mark Finchem</span>, Trump’s endorsed candidate for secretary of state, is one of the co-sponsors.",
    "author": "Amy Sherman",
    "title": "The battleground states where Republicans want to overhaul voting laws"
  },
  {
    "id": 3415,
    "mediaId": 2629,
    "date": "2022-01-31",
    "sentence": "And <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who stood near the Capitol as insurrectionists smashed windows on January 6, is running to be Arizona's next secretary of state.",
    "author": "Josh Axelrod",
    "title": "Nevada Candidate For Secretary Of State Vows To ‘Fix 2020 Like Trump Said'"
  },
  {
    "id": 2769,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "Dan Patrick, Senate candidate Herschel Walker and two candidates for secretary of state, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and Rep. Jody Hice (R-GA) -- in the final half of 2021, according to a campaign finance report filed with the Federal Election Commission.",
    "author": "Travis Gettys",
    "title": "Trump super PAC gave $1 million to Mark Meadows nonprofit just after Jan. 6 panel created"
  },
  {
    "id": 3007,
    "mediaId": 2707,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 2978,
    "mediaId": 2523,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 3336,
    "mediaId": 2677,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "CNN.com Wire Service",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 3505,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "For example, Trump gave $5,000 to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a secretary of state candidate who has called for the decertification of the 2020 election, and a matching amount to Rep. Jody Hice, R-Ga., who voted against certifying the election and is now running for secretary of state in Georgia.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 3270,
    "mediaId": 5308,
    "date": "2022-02-01",
    "sentence": "Watkins told VICE News that while at the rally he had tried to speak to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who has promoted QAnon conspiracies, and who is seeking election in November as secretary of state.",
    "author": "David Gilbert",
    "title": "QAnon Thought Leader Ron Watkins Is Running for Congress. It’s Going Terribly."
  },
  {
    "id": 3077,
    "mediaId": 2532,
    "date": "2022-02-01",
    "sentence": "Trump's PAC has also contributed to candidates who have spread his unfounded claims of widespread fraud in the 2020 election, including Arizona gubernatorial candidate Kari Lake, Arizona state Senator Wendy Rogers, Arizona Secretary of State candidate <span class='selected-term'>Mark Finchem</span>, Michigan Secretary of State candidate Kristina Karamo and Michigan Attorney General candidate Matthew DePerno.",
    "author": "Aaron Navarro",
    "title": "Trump groups head into 2022 with $122 million on hand"
  },
  {
    "id": 3144,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates -- gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> -- who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 3101,
    "mediaId": 8475,
    "date": "2022-02-01",
    "sentence": "Oro Valley Republican Rep. <span class='selected-term'>Mark Finchem</span> called mayors who closed businesses “petty tyrants” and said it was hypocritical to be worried about superspreader events when large retailers where lots of people could congregate were kept open.",
    "author": "Gloria Gomez",
    "title": "New Arizona legislation would limit mayoral power to shut down businesses in emergencies"
  },
  {
    "id": 3187,
    "mediaId": 8268,
    "date": "2022-02-01",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 3020,
    "mediaId": 8476,
    "date": "2022-02-01",
    "sentence": "",
    "author": "",
    "title": "No title"
  },
  {
    "id": 3482,
    "mediaId": 8350,
    "date": "2022-02-02",
    "sentence": "“And it was selective.”\nThere’s a difference between a life-threatening situation and “something that will go on for years under the guise of a pandemic,” said Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "ASSOCIATED PRESS",
    "title": "Arizona Republicans look to curb government’s emergency powers"
  },
  {
    "id": 2887,
    "mediaId": 8268,
    "date": "2022-02-02",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 3218,
    "mediaId": 8416,
    "date": "2022-02-02",
    "sentence": "“And it was selective.”\nThere’s a difference between a life-threatening situation and “something that will go on for years under the guise of a pandemic,” said Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "Jonathan J. Cooper | Associated Press",
    "title": "Arizona lawmakers look to curb government’s emergency powers"
  },
  {
    "id": 3487,
    "mediaId": 8476,
    "date": "2022-02-02",
    "sentence": "Oro Valley Republican Rep. <span class='selected-term'>Mark Finchem</span> called mayors who closed businesses “petty tyrants” and said it was hypocritical to be worried about superspreader events when large retailers where lots of people could congregate were kept open.",
    "author": "Gloria Gomez",
    "title": "Mayoral Power To Shut Down Businesses in Emergencies Limited by New Legislation"
  },
  {
    "id": 3192,
    "mediaId": 8345,
    "date": "2022-02-02",
    "sentence": "“And it was selective.”\nThere’s a difference between a life-threatening situation and “something that will go on for years under the guise of a pandemic,” said Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "",
    "title": "Arizona lawmakers look to curb government's emergency powers"
  },
  {
    "id": 2783,
    "mediaId": 2520,
    "date": "2022-02-02",
    "sentence": "Here is a list of Republican legislators who signed on as co-sponsors to Rep. Fillmore’s bill:\nReps. Brenda Barton of Payson, Leo Biasiucci of Lake Havasu City, Walter Blackman of Snowflake, Judy Burges of Skull Valley, Neal Carter of Queen Creek,\nJoseph Chaplik of Scottsdale, David Cook of Globe, Lupe Diaz of Benson, <span class='selected-term'>Mark Finchem</span> of Oro Valley, Jake Hoffman of Mesa, Teresa Martinez of Casa Grande, Jacqueline Parker of Mesa and Beverly Pingerelli of Peoria.",
    "author": "Laurie Roberts",
    "title": "House Speaker Rusty Bowers didn't just kill a bill to veto our vote. He stoned the thing"
  },
  {
    "id": 2751,
    "mediaId": 2520,
    "date": "2022-02-03",
    "sentence": "Here are the then-current and incoming Republican state legislators who signed the resolution asking Congress to accept Arizona’s fake electors: Sen. Kelly Townsend of Mesa, Rep. Bret Roberts of Maricopa, Rep. Kevin Payne of Peoria, Rep. <span class='selected-term'>Mark Finchem</span> of Oro Valley, Sen. David Farnsworth of Mesa, Sen. Sonny Borrelli of Lake Havasu City, Rep. Leo Biasiucci, of Lake Havasu City, Rep. Anthony Kern of Glendale, Rep. David Cook of Globe, Sen. Sylvia Allen of Snowflake, Rep. John Fillmore of Apache Junction, Sen. Nancy Barto of Phoenix, Rep. Travis Grantham of Gilbert, Senate Majority Leader Warren Petersen of Gilbert, Rep. Walter Blackman of Snowflake, Rep. Steve Pierce of Prescott, Rep. Shawnna Bolick of Phoenix, Rep. Tony Rivero of Peoria, Rep. Noel Campbell of Prescott.",
    "author": "Laurie Roberts",
    "title": "What is Arizona GOP Chair Kelli Ward hiding from the committee investigating Jan. 6?"
  },
  {
    "id": 2112,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Among the Republicans who attended John Sabal's Patriot Voice event, were Arizona State Senator Wendy Rogers and Arizona State Representative <span class='selected-term'>Mark Finchem</span>, both of whom continue to push the baseless claim that the 2020 election was stolen.",
    "author": "Anders Anglesey",
    "title": "QAnon in 2022: Conspiracy Followers Focus on Controlling Elections and School Boards"
  },
  {
    "id": 2313,
    "mediaId": 2528,
    "date": "2022-02-06",
    "sentence": "The coalition includes at least six candidates, including Jim Marchant in Nevada, <span class='selected-term'>Mark Finchem</span> in Arizona, and Jody Hice in Georgia, who have all made election denial key parts of their campaign.",
    "author": "Alia Shoaib",
    "title": "Election-denying Trump loyalists are running for obscure offices to influence future elections in battleground states"
  },
  {
    "id": 1896,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nAZ Senate Republicans are pushing for serious election reform and decertification of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "TOMORROW: AZ Senate Government Committee Considers 14 Election Integrity Bills – Drive-Up Voting; Prohibition, Voting; One Day Only; Holiday"
  },
  {
    "id": 1819,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "State Representative @RealMarkFinchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections.https://t.co/yNnZjZpD10 #HCR2033 #azleg pic.twitter.com/Si7GjMAEeg\n— AZ House Republicans (@AZHouseGOP) February 7, 2022\nNEWS RELEASE\nArizona House of Representatives Representative <span class='selected-term'>Mark Finchem</span> (R-11)\nRepresentative Finchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections\nSTATE CAPITOL, PHOENIX – State Representative Mark Finchem has introduced HCR 2033, a concurrent resolution calling for the elections of Maricopa, Pima and Yuma Counties to be set aside based on clear and convincing evidence that the elections in those counties were irredeemably compromised.",
    "author": "Jordan Conradson",
    "title": "BREAKING BIG: Arizona State Rep. Mark Finchem Introduces Resolution To SET ASIDE & DECERTIFY Three 2020 County Elections"
  },
  {
    "id": 1934,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "On Monday, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (Trump’s endorsed candidate for secretary of state) introduced a resolution seeking to decertify the results in Maricopa, Pima and Yuma counties — more than a year after the presidential election and following numerous fruitless attempts at digging up evidence that a massive voter fraud scheme cost Trump the presidency.",
    "author": "Liz Skalka",
    "title": "Arizona Republican Says His Daughter Got Text Calling Him 'N-Word' RINO"
  },
  {
    "id": 1851,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "",
    "author": "",
    "title": "$1 for 6 Months."
  },
  {
    "id": 1903,
    "mediaId": 2520,
    "date": "2022-02-08",
    "sentence": "Not former state Rep. <span class='selected-term'>Mark Finchem</span>, now running for Arizona secretary of state.",
    "author": "EJ Montini",
    "title": "Arizona's Jan. 6 insurrectionists should be barred from holding office"
  },
  {
    "id": 2605,
    "mediaId": 2601,
    "date": "2022-02-08",
    "sentence": "National File: Arizona State Representative <span class='selected-term'>Mark Finchem</span> has introduced HCR 2033, which calls for the elections of Maricopa, Pima and Yuma Counties to be set aside and ultimately decertified based on “clear and convincing evidence that the elections in those counties were irredeemably compromised.”\n“The circumstances surrounding these elections undermine voter confidence in the election system, moreover, they ultimately translate into doubts about election integrity,” Finchem said in a statement.",
    "author": "MJA",
    "title": "‘Set Aside And Decertify’: AZ Rep. Mark Finchem Introduces Resolution That Disputes 2020 Election Results"
  },
  {
    "id": 2471,
    "mediaId": 8428,
    "date": "2022-02-08",
    "sentence": "State Rep. <span class='selected-term'>Mark Finchem</span>, R-Ariz., introduced a resolution Monday to “set aside” and decertify the 2020 presidential election in three central Arizona counties.",
    "author": "Laura Ramirez",
    "title": "Arizona lawmakers introduce resolution to decertify the 2020 election in three counties"
  },
  {
    "id": 2511,
    "mediaId": 2591,
    "date": "2022-02-08",
    "sentence": "Arizona Republican State Rep. <span class='selected-term'>Mark Finchem</span> introduced a bill Monday to decertify the 2020 election in three counties.",
    "author": "Human Events Staff",
    "title": "Arizona State Rep. Mark Finchem Introduces Resolution to Decertify 2020 Election in 3 Counties"
  },
  {
    "id": 1946,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "View the full report here:\nMaricopa-Chain-of-Custody-Failure\nWith confirmation of receipt from the AZ Attorney General\nReceipt from the Attorney General’s Office\nArizona State Representative <span class='selected-term'>Mark Finchem</span> told TGP that he was working on a resolution to reclaim Arizona’s fraudulent 2020 Presidential Electors, and he delivered.",
    "author": "Jordan Conradson",
    "title": "HUGE: Maricopa County – Investigation Finds Additional 740,000 Ballots Have No Documented Chain Of Custody"
  },
  {
    "id": 1942,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 7, 2022\nAnd also on Monday video proof was released of Maricopa County election workers deleting “archived” files from servers before delivery to state auditors — a criminal offense.",
    "author": "Jordan Conradson",
    "title": "BREAKING – President Trump: “They Are So Desperate To Hide The Truth, They’ll Make It Criminal To Speak It!”"
  },
  {
    "id": 2202,
    "mediaId": 8268,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 1882,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "RINO Arizona Speaker of The House Rusty Bowers told reporters yesterday that Arizona State Representative <span class='selected-term'>Mark Finchem</span>’s resolution to decertify three 2020 Arizona county elections is “obviously unconstitutional and profoundly unwise.”\nBowers has been no fan of election integrity or the full forensic of Maricopa County, which confirmed countless election law violations and hundreds of thousands of illegal or fraudulent ballots.",
    "author": "Jordan Conradson",
    "title": "Arizona House Speaker Turncoat Rusty Bowers: “Mr. Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”"
  },
  {
    "id": 2300,
    "mediaId": 2689,
    "date": "2022-02-09",
    "sentence": "https://twitter.com/KariLake/status/1490801991169105921\n“We reported earlier that Arizona State Representative and candidate for Secretary of state <span class='selected-term'>Mark Finchem</span> presented a bombshell resolution to decertify three county elections and reclaim Arizona’s electors,” GP’s report said.",
    "author": "",
    "title": "ELECTION FRAUD UPDATE: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server (VIDEO)"
  },
  {
    "id": 2348,
    "mediaId": 2591,
    "date": "2022-02-09",
    "sentence": "Arizona House Speaker Rusty Bowers criticized Rep. <span class='selected-term'>Mark Finchem</span>’s legislation to decertify the 2020 election results in three counties on Monday, signifying a split among the chamber’s Republicans.",
    "author": "Human Events Staff",
    "title": "Arizona GOP House Speaker Criticizes Finchem’s Election Decertification Bill"
  },
  {
    "id": 1864,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "The Gateway Pundit reported that <span class='selected-term'>Mark Finchem</span> introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)"
  },
  {
    "id": 1923,
    "mediaId": 2520,
    "date": "2022-02-09",
    "sentence": "One conspiracy kook, Rep. <span class='selected-term'>Mark Finchem</span>, even tried to have the 2020 elections from Maricopa, Pima and Yuma counties set aside.",
    "author": "EJ Montini",
    "title": "Does the NFL have the guts to move the 2023 Super Bowl out of Arizona?"
  },
  {
    "id": 2409,
    "mediaId": 2688,
    "date": "2022-02-09",
    "sentence": "Within hours of Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R) introducing his bill to “decertify” and “set aside” the 2020 election results in three of Arizona’s largest counties, two things happened.",
    "author": "Cristina Cabrera",
    "title": "Trump-Endorsed Arizona Secretary of State Candidate Has A Show Bill To ‘Decertify’ 2020"
  },
  {
    "id": 2595,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "The bill was introduced Monday by right-wing Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Trump-endorsed candidate for secretary of state.",
    "author": "John Wright",
    "title": "‘This is what we’ve been waiting for!’: Mike Lindell celebrates doomed Arizona decertification bill"
  },
  {
    "id": 1873,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Laurie Roberts",
    "title": "Want to quit APS? Legislators are backing a plan to make sure that can never happen"
  },
  {
    "id": 2452,
    "mediaId": 2594,
    "date": "2022-02-10",
    "sentence": "She also has pledged – if elected – to direct the state’s office of Attorney General to open a criminal investigation into the election, including seizing “all election material, all election equipment, and he should start questioning people immediately.”\nThe leading GOP candidate for Arizona’s secretary of state, state representative <span class='selected-term'>Mark Finchem</span>, filed legislation this week to decertify the state’s 2020 election results, baselessly asserting that “illegal acts occurred” and that the outcome is “irredeemably compromised, and it is impossible to name a clear winner of the contest.”\nHis fundraising has outpaced the two leading Democratic candidates combined.",
    "author": "Alex Woodward",
    "title": "They wanted to overturn 2020 election results. Now these candidates want to run the next elections"
  },
  {
    "id": 2053,
    "mediaId": 8475,
    "date": "2022-02-10",
    "sentence": "“This is in no way condoning this at all, but the thing that concerns me is, shouldn’t this be the parent’s responsibility?” said Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Arizona Republicans kill off bill requiring all devices to have porn filters"
  },
  {
    "id": 1508,
    "mediaId": 5308,
    "date": "2022-02-11",
    "sentence": "I never expected in my life I’d get a call like this.”\nLast week we introduced you to Arizona GOP State Rep <span class='selected-term'>Mark Finchem</span>, the Q-adjacent conspiracy theorist who wants to run elections as Arizona’’s next secretary of state (yup, the guy who “La la la’d!” VICE News Tonight’s Liz Landers).",
    "author": "Todd Zwillich",
    "title": "The RNC Put Its Jan. 6 Policy in Writing—and It’s Officially Pro-Coup"
  },
  {
    "id": 1272,
    "mediaId": 2636,
    "date": "2022-02-11",
    "sentence": "“Not since Hitler himself have we seen evil come across the country,” said <span class='selected-term'>Mark Finchem</span>, an Arizona lawmaker who is running for secretary of state there.",
    "author": "",
    "title": "The Traveling Trump Show"
  },
  {
    "id": 1092,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 1267,
    "mediaId": 4032,
    "date": "2022-02-12",
    "sentence": "Conservative “superstars” such as Lt. General Michael Flynn, former national security advisor to President Donald Trump and retired chief of military intelligence; conservative rock star Ted Nugent; Colonel Allen West, former congressman and Texas GOP chief; libertarian business magnate and Overstock.com founder Patrick Byrne; former Immigration and Customs Enforcement chief Tom Hohman; former Customs and Border Protection head Mark Morgan; celebrity actress and author Sam Sorbo; Arizona State Representative <span class='selected-term'>Mark Finchem</span>; many sheriffs and lawmen; and leading conservative media personalities.",
    "author": "Alex Newman",
    "title": "Shadowy Forces Sabotage Key Border Event Hosted by Patriots"
  },
  {
    "id": 1746,
    "mediaId": 2716,
    "date": "2022-02-13",
    "sentence": "Running in Arizona is <span class='selected-term'>Mark Finchem</span>, a member of the Oath Keepers militia who was present at the Capitol insurrection and has links to QAnon.",
    "author": "The Week Staff",
    "title": "Starting the steal?"
  },
  {
    "id": 1332,
    "mediaId": 6509,
    "date": "2022-02-14",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 Panel Subpoenas 6 More in Fake GOP Electors Scheme"
  },
  {
    "id": 994,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 996,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nThis sham investigation is targeting Rep. <span class='selected-term'>Mark Finchem</span> and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 1631,
    "mediaId": 2539,
    "date": "2022-02-15",
    "sentence": "In a letter to Mastriano, Thompson wrote, “we understand that you spoke with former President Trump about your post-election activities.”\nCNBC Politics\nRead more of CNBC’s politics coverage:\nThe U.S. wants to see Russia ‘weakened’; Blinken says Moscow has ‘already failed’\nNew York judge holds Donald Trump in contempt for failing to comply with subpoena for business documents\nPennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races\nThe other subpoenas were issued to Michael Roman and Gary Michael Brown, who led Election Day operations for Trump’s 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative <span class='selected-term'>Mark Finchem</span>.",
    "author": "Kevin Breuninger",
    "title": "House probe of Jan. 6 Capitol riot subpoenas Arizona GOP leader Kelli Ward, 5 others over ‘alternate electors’"
  },
  {
    "id": 1598,
    "mediaId": 2570,
    "date": "2022-02-15",
    "sentence": "The committee also subpoenaed Pennsylvania gubernatorial candidate and state Sen. Doug Mastriano (R), Arizona GOP chairwoman Kelli Ward, former Michigan Republican State Committee chairwoman Laura Cox and Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R), who is also a member of the far-right militia group the Oath Keepers.",
    "author": "Nicholas Reimann",
    "title": "Jan. 6 Committee Subpoenas Trump Campaign Officials Over Fake Electors Scheme"
  },
  {
    "id": 1482,
    "mediaId": 2822,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri The Associated Press",
    "title": "Jan. 6 panel subpoenas Arizona's Finchem, Ward in fake GOP electors scheme"
  },
  {
    "id": 1518,
    "mediaId": 2716,
    "date": "2022-02-15",
    "sentence": "The subpoenas were sent to Michael Roman, director of Election Day operations for former President Donald Trump's 2020 re-election campaign; his deputy, Gary Brown; Pennsylvania state Sen. Douglas Mastriano (R); Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R); Arizona Republican Party Chairwoman Kelli Ward; and Laura Cox, the former chair of the Michigan Republican Party.",
    "author": "Catherine Garcia",
    "title": "Jan. 6 committee issues subpoenas to 6 people tied to fake elector plan"
  },
  {
    "id": 1706,
    "mediaId": 2632,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 Panel Subpoenas 6 More in Fake GOP Electors Scheme"
  },
  {
    "id": 1116,
    "mediaId": 2632,
    "date": "2022-02-15",
    "sentence": "The other subpoenas were issued to GOP State Sen. Doug Mastriano of Pennsylvania; Michael Roman and Gary Michael Brown, who led Election Day operations for Trump's 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative <span class='selected-term'>Mark Finchem</span>.",
    "author": "Kevin Breuninger",
    "title": "House Probe of Jan. 6 Capitol Riot Subpoenas Arizona GOP Leader Kelli Ward, 5 Others Over ‘Alternate Electors'"
  },
  {
    "id": 1384,
    "mediaId": 2654,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in review of efforts to falsify 2020 election results"
  },
  {
    "id": 1259,
    "mediaId": 2631,
    "date": "2022-02-15",
    "sentence": "The panel also issued a subpoena Tuesday to <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state in Arizona and has been endorsed by Trump.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers"
  },
  {
    "id": 1402,
    "mediaId": 2594,
    "date": "2022-02-15",
    "sentence": "Two Republican state lawmakers — Pennsylvania senator Doug Mastriano and Arizona senator <span class='selected-term'>Mark Finchem</span> — also received subpoenas from Mr Thompson on Monday.",
    "author": "Andrew Feinberg",
    "title": "Capitol riot committee subpoenas Trump campaign officials and state lawmakers involved in sham elector plot"
  },
  {
    "id": 1577,
    "mediaId": 2584,
    "date": "2022-02-15",
    "sentence": "The select committee also targeted four state Republican allies of Trump: the chair of the Arizona Republican party Kelli Ward, former Michigan Republican party chair Laura Cox, Pennsylvania state senator Douglas Mastriano, and Arizona house member <span class='selected-term'>Mark Finchem</span>.",
    "author": "Hugo Lowell",
    "title": "Capitol attack investigators target Trump circle over fake elector ploy"
  },
  {
    "id": 1675,
    "mediaId": 2532,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Zak Hudak",
    "title": "January 6 committee subpoenas others tied to false elector scheme"
  },
  {
    "id": 934,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "https://t.co/nDKQe9zCux\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 14, 2022\nNo matter where you live, sign Arizona State Rep. Mark Finchem’s petition to decertify the fraudulent 2020 election and strongly encourage your state legislators to sign State Senator Rogers’ letter to audit 50 states.",
    "author": "Jordan Conradson",
    "title": "204 Legislators Call For 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives"
  },
  {
    "id": 1378,
    "mediaId": 2688,
    "date": "2022-02-15",
    "sentence": "House investigators also want to speak with <span class='selected-term'>Mark Finchem</span>, an Arizona state representative and current candidate for Arizona secretary of state, who was in D.C. on Jan. 6.",
    "author": "Josh Kovensky",
    "title": "Jan. 6 Committee Subpoenas Republican State Lawmakers, Trump Campaign Officials"
  },
  {
    "id": 1166,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 1702,
    "mediaId": 2790,
    "date": "2022-02-15",
    "sentence": "State Sen. Doug Mastriano is a candidate for Pennsylvania governor, and state Rep. <span class='selected-term'>Mark Finchem</span> is running to be the next secretary of state in Arizona.",
    "author": "Claudia Grisales",
    "title": "GOP candidates and leaders subpoenaed as Jan. 6 panel dives into fake electors scheme"
  },
  {
    "id": 1446,
    "mediaId": 2728,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 1103,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "La nueva ola de objetivos de citaciones incluye a Kelli Ward, presidenta del Partido Republicano de Arizona, además de dos candidatos políticos republicanos en estados indecisos: el senador estatal Doug Mastriano es candidato a gobernador de Pennsylvania y el representante estatal <span class='selected-term'>Mark Finchem</span> se postula para ser el próximo secretario de estado en Arizona.",
    "author": "",
    "title": "Comité que investiga el asalto al Capitolio cita a supuestos “electores suplentes” de Trump"
  },
  {
    "id": 1445,
    "mediaId": 2707,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1066,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 1181,
    "mediaId": 2523,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 928,
    "mediaId": 2590,
    "date": "2022-02-15",
    "sentence": "“The select committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well.”\nAmong the six are two new celebrities among Trump followers: <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who is running to be the top elections official there, and Doug Mastriano, a Pennsylvania legislator who led the efforts to overturn Democrat Joe Biden’s victory in that state.",
    "author": "",
    "title": "Jan. 6 Committee Focuses On Trump Scheme To Solicit Slates Of Fake Electors"
  },
  {
    "id": 1416,
    "mediaId": 8345,
    "date": "2022-02-15",
    "sentence": "According to a news release, candidates for Secretary of State that have been invited to debate include Michelle Ugenti-Rita, <span class='selected-term'>Mark Finchem</span>, Shawna Bolick and Beau Lane.",
    "author": "",
    "title": "Debate set for Secretary of State and Attorney General candidates in Kingman"
  },
  {
    "id": 1129,
    "mediaId": 8475,
    "date": "2022-02-15",
    "sentence": "Two Arizona Republicans are among six people issued subpoenas Tuesday by the House Jan. 6 Committee, with state Rep. <span class='selected-term'>Mark Finchem</span> and state GOP Chair Kelli Ward told to turn over documents and appear for depositions next month.",
    "author": "Dylan Smith",
    "title": "Finchem, Ward subpoenaed by Congress over Trump efforts to overturn election"
  },
  {
    "id": 1328,
    "mediaId": 8350,
    "date": "2022-02-15",
    "sentence": "State Rep. <span class='selected-term'>Mark Finchem</span> and GOP Chair Kelli Ward were among the six former Trump campaign members as well as state elected officials singled out in the latest round of subpoenas.",
    "author": "KTAR.COM",
    "title": "Jan. 6 panel subpoenas Arizona Republicans Finchem, Ward in fake electors scheme"
  },
  {
    "id": 1590,
    "mediaId": 8350,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "ASSOCIATED PRESS",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 1226,
    "mediaId": 6656,
    "date": "2022-02-15",
    "sentence": "The committee said Arizona State Rep. <span class='selected-term'>Mark Finchem</span> took part in organizing events to advance unsubstantiated claims of election and voter fraud and was in Washington, D.C., on Jan 6. as he said he \"had evidence to deliver to Vice President [Mike] Pence in an effort to postpone the awarding of electors.",
    "author": "Daniel Uria",
    "title": "Jan. 6 committee issues subpoenas seeking information on alternate elector plots"
  },
  {
    "id": 1219,
    "mediaId": 8295,
    "date": "2022-02-16",
    "sentence": "WASHINGTON – The committee investigating the Jan. 6 attack on the Capitol subpoenaed Arizona Republican leader Kelli Ward and Rep. <span class='selected-term'>Mark Finchem</span> for “information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.”\nBesides public statements by the two that the election was stolen, the committee said it is interested in Ward’s communications with the White House, and Finchem’s involvement in the planning of the Jan. 6 rally that led to the attack.",
    "author": "Emily Sacia",
    "title": "Finchem, Ward targets of new subpoenas by committee probing Jan. 6 attack"
  },
  {
    "id": 912,
    "mediaId": 8345,
    "date": "2022-02-16",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 1425,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. <span class='selected-term'>Mark Finchem</span> (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate Doug Mastriano (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trump’s reelection campaign\n“The committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,” Tom and Jacqueline write.",
    "author": "",
    "title": "The cyber fight in Ukraine is getting more serious"
  },
  {
    "id": 1399,
    "mediaId": 2520,
    "date": "2022-02-16",
    "sentence": "The U.S. House committee investigating the Jan. 6, 2021, incursion of the U.S. Capitol issued subpoenas on Tuesday to state Rep. <span class='selected-term'>Mark Finchem</span> and Kelli Ward, the chair of the Republican Party of Arizona, asking for documents and testimony related to their efforts to upend the 2020 election results.",
    "author": "Richard Ruelas",
    "title": "Jan. 6 congressional committee subpoenas Kelli Ward, Mark Finchem"
  },
  {
    "id": 1526,
    "mediaId": 2547,
    "date": "2022-02-16",
    "sentence": "[...] The other subpoenas were issued to Michael Roman and Gary Michael Brown, who led Election Day operations for Trump’s 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative <span class='selected-term'>Mark Finchem</span>.",
    "author": "Susie Madrak",
    "title": "Jan. 6th Committee Subpoenas Six GOPers In Fake Elector Plot"
  },
  {
    "id": 1354,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "The subpoenas went to Arizona Republican Party Chairwoman Kelli Ward, a longtime Trump supporter, as well as Pennsylvania state Sen. Doug Mastriano, now running for governor there, and Arizona State House Rep. <span class='selected-term'>Mark Finchem</span>, now running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "State officials pushing Trump alternate elector scheme come into focus"
  },
  {
    "id": 1040,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "Among those subpoenaed are Arizona Republican Party Chairwoman Kelli Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, former Michigan Republican Chair Laura Cox and Pennsylvania GOP state Sen. Doug Mastriano.",
    "author": "Jennifer Shutt",
    "title": "Jan. 6 panel subpoenas six people tied to pro-Trump fake electors plan"
  },
  {
    "id": 964,
    "mediaId": 2592,
    "date": "2022-02-16",
    "sentence": "Trump endorsed his vocal supporter Rep. Finchem in Sept. 2021\nFinchem has repeatedly shared COVID-19 conspiracies\nFinchem was also spotted near the Capitol during the Jan. 6 insurrection\nFormer President Donald Trump has chosen Rep. <span class='selected-term'>Mark Finchem</span>, R-AZ, as his top pick for Arizona’s secretary of state position — a lawmaker known for repeatedly spreading misinformation about the COVID-19 pandemic and vaccines.",
    "author": "Danielle Ong",
    "title": "Trump Picks Anti-Vaxxer Who Claims COVID-19 Doesn't Exist For Arizona Sec. Of State"
  },
  {
    "id": 1682,
    "mediaId": 6746,
    "date": "2022-02-16",
    "sentence": "The list of state officials identified Douglas Mastriano, a state senator from Pennsylvania, <span class='selected-term'>Mark Finchem</span>, a state legislator from Arizona, who is also running for the job that oversees state elections, and Kelli Ward, the current chair of the Arizona Republican Party.",
    "author": "Renz Soliman",
    "title": "House Select Committee Subpoenas 6 Individuals Involved in Trump's Schemes, Including State Officials"
  },
  {
    "id": 1785,
    "mediaId": 2591,
    "date": "2022-02-16",
    "sentence": "– I don’t think we should go backward in terms of voting even though we obviously recognize that voting is an incredibly crucial piece of the way our country functions.”\nAs previously reported by Human Events News, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> took his Arizona Ballot Integrity Project (BIP) national in October when he and approximately 30 others from around the country gathered at the suburban Dallas offices of international authentication leader, Authentix, to create a process for introducing a highly counterfeit-resistant paper ballot.",
    "author": "Brent Hamachek",
    "title": "BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts"
  },
  {
    "id": 1282,
    "mediaId": 2748,
    "date": "2022-02-16",
    "sentence": "Trump campaign official Michael Roman, in charge of Election Day operations in 2020, and his deputy Gary Michael Brown, will receive a subpoena, as will Republican state lawmakers from Pennsylvania and Arizona – Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively.",
    "author": "",
    "title": "Biden rejects Trump's executive privilege claim and orders the release of ALL White House visitor logs to the January 6 committee"
  },
  {
    "id": 1707,
    "mediaId": 2580,
    "date": "2022-02-17",
    "sentence": "– I don’t think we should go backward in terms of voting even though we obviously recognize that voting is an incredibly crucial piece of the way our country functions.”\nAs previously reported by Human Events News, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> took his Arizona Ballot Integrity Project (BIP) national in October when he and approximately 30 others from around the country gathered at the suburban Dallas offices of international authentication leader, Authentix, to create a process for introducing a highly counterfeit-resistant paper ballot.",
    "author": "GOPUSA",
    "title": "BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts"
  },
  {
    "id": 962,
    "mediaId": 2578,
    "date": "2022-02-17",
    "sentence": "Arizona State Representative and American Hero <span class='selected-term'>Mark Finchem</span> recently introduced a resolution to set aside and decertify three 2020 county elections in Arizona.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Cyber Ninjas CEO Doug Logan Spoke Twice With Arizona Election Fraud Investigators: “Last Time I Spoke With Them They Indicated That They Were Starting To Wrap Up, We Should Have The Results Relatively Soon”"
  },
  {
    "id": 1752,
    "mediaId": 4032,
    "date": "2022-02-17",
    "sentence": "In this episode of Unsilenced, host Heather Hobbs interviews Arizona State Representative <span class='selected-term'>Mark Finchem</span> in the border town of McAllen, Texas.",
    "author": "Heather Hobbs",
    "title": "At US-Mexico Border, Rep. Mark Finchem Stands Up for the Defenseless"
  },
  {
    "id": 1032,
    "mediaId": 2598,
    "date": "2022-02-17",
    "sentence": "Republican <span class='selected-term'>Mark Finchem</span>, a member of the Arizona House of Representatives, announced in early 2021 that he would run for Secretary of State of Arizona.",
    "author": "",
    "title": "Mark Finchem Called Covid Vaccines 'Crime Against Humanity'"
  },
  {
    "id": 1516,
    "mediaId": 4040,
    "date": "2022-02-17",
    "sentence": "And we the people working with our sheriffs to do this training and this convention will be the seminal moment for restoring liberty to America.”\nMack has also endorsed Oath Keeper, QAnon promoter, and Stop the Steal activist <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state.",
    "author": "Kristen Doerer",
    "title": "‘Constitutional Sheriff’ Richard Mack to Meet With Illinois Gubernatorial Candidate Gary Rabine"
  },
  {
    "id": 1419,
    "mediaId": 2741,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Bess Levin",
    "title": "Trump Continues Long Tradition of Endorsing the Worst Candidates Imaginable"
  },
  {
    "id": 1126,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "GOP lawmakers are pushing high-tech ‘fraud-proof’ ballots. A Texas company could be the only supplier."
  },
  {
    "id": 1761,
    "mediaId": 5308,
    "date": "2022-02-18",
    "sentence": "This week in subpoenas (and speaking of statewide GOP figures from key swing states), on Tuesday the Jan. 6 committee subpoenaed a half-dozen Trump allies who the committee thinks may have “information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.”\nThat list includes Trump’s endorsed candidate for Arizona secretary of state, <span class='selected-term'>Mark Finchem</span>; Pennsylvania state Sen. Doug Mastriano, who’s running for governor; Arizona Republican Party Chairwoman Kelli Ward; and former Michigan Republican Party Chairwoman Laura Cox.",
    "author": "",
    "title": "T.W.I.S.™ Notes"
  },
  {
    "id": 267,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 34,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> recently presented a resolution to decertify the fraudulent election results, but Rusty Bowers lacks the courage to fight for Arizona voters.",
    "author": "Jordan Conradson",
    "title": "RINO Arizona House Speaker Rusty Bowers Files to Run for Senate After Turning On Constituents and Allowing Election Fraud"
  },
  {
    "id": 547,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nEXCLUSIVE: Arizona State Representative <span class='selected-term'>Mark Finchem</span> Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”"
  },
  {
    "id": 309,
    "mediaId": 2720,
    "date": "2022-02-21",
    "sentence": "Ask Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Mike Landry",
    "title": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6"
  },
  {
    "id": 207,
    "mediaId": 2520,
    "date": "2022-02-21",
    "sentence": "These are the Republicans who voted no:\nBrenda Barton of Payson, Judy Burges of Skull Valley, Neal Carter of San Tan Valley, Joseph Chaplik of Scottsdale, Lupe Diaz of Benson, John Fillmore of Apache Junction, <span class='selected-term'>Mark Finchem</span> of Oro Valley.",
    "author": "Laurie Roberts",
    "title": "Shame on every Republican who voted to sabotage Arizona's schools"
  },
  {
    "id": 614,
    "mediaId": 2520,
    "date": "2022-02-21",
    "sentence": "A month after the election, it was Bowers who refused to entertain the schemes of the Trump team, along with then-Rep. Kelly Townsend and Rep. <span class='selected-term'>Mark Finchem</span>, to overturn the results of the election.",
    "author": "Laurie Roberts",
    "title": "Can a Republican who believes the 2020 election wasn't stolen win in Arizona?"
  },
  {
    "id": 300,
    "mediaId": 2528,
    "date": "2022-02-21",
    "sentence": "He also shared the link to a donation page titled \"Rep <span class='selected-term'>Mark Finchem</span> Legal Defense Fund\" on the Christian crowdfunding site GiveSendGo.",
    "author": "Kelsey Vlamis",
    "title": "A Trump-backed candidate in Arizona is trying to raise $750,000 for a legal defense fund after he was subpoenaed by the January 6 committee"
  },
  {
    "id": 634,
    "mediaId": 2520,
    "date": "2022-02-22",
    "sentence": "And it’s being promoted by Rep. <span class='selected-term'>Mark Finchem</span>, a guy who is hoping that if he lies often enough about Arizona’s election being stolen that voters will install him as secretary of state to oversee future elections.",
    "author": "Laurie Roberts",
    "title": "GOP legislators want new ballots that - surprise! - can only be made by one company"
  },
  {
    "id": 244,
    "mediaId": 2688,
    "date": "2022-02-22",
    "sentence": "The scheme didn’t end up really going anywhere substantial for the broader Big Lie effort, but the Jan. 6 committee recently subpoenaed Republican state lawmakers and Trump campaign officials who were allegedly involved in the alternate electors plot, like Doug Mastriano, Kelli Ward and <span class='selected-term'>Mark Finchem</span>.",
    "author": "John Judis",
    "title": "Where Things Stand: New Report Reveals More Details Of Ginni Thomas’ Involvement In Election-Subverting Schemes"
  },
  {
    "id": 599,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 666,
    "mediaId": 2662,
    "date": "2022-02-23",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”"
  },
  {
    "id": 304,
    "mediaId": 2662,
    "date": "2022-02-24",
    "sentence": "WATCH: AZ State Representative <span class='selected-term'>Mark Finchem</span> On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”\nContact Arizona Senate President Karen Fann, Speaker Rusty Bowers, and Arizona legislators to strongly encourage their support for decertification.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona Senate President Karen Fann Claims “We Really Don’t Have a Mechanism To Decertify” – Mark Finchem Gave Us The Mechanism"
  },
  {
    "id": 400,
    "mediaId": 4032,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Alex Newman",
    "title": "2020 Presidential Election in Maricopa County Should Be Set Aside"
  },
  {
    "id": 12771,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "Some state legislators who had contacts with Giuliani as part of the scam have been subpoenaed by the panel, such as <span class='selected-term'>Mark Finchem</span> in Arizona and Doug Mastriano in Pennsylvania, who are, respectively, running in 2022 to be secretary of state and governor in moves that raise fears of future attempts to subvert American democracy.",
    "author": "Peter Stone",
    "title": "Giuliani’s legal problems deepen as ‘false electors’ scheme investigated"
  },
  {
    "id": 13155,
    "mediaId": 2520,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "$1 for 6 Months."
  },
  {
    "id": 12910,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "",
    "author": "",
    "title": "$1 for 6 Months."
  },
  {
    "id": 13071,
    "mediaId": 4032,
    "date": "2022-03-02",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> talked with The New American’s election integrity expert Kurt Hyde.",
    "author": "Kurt Hyde",
    "title": "Bill in Arizona State Legislature Would Decertify Arizona’s Presidential Election Results"
  },
  {
    "id": 17508,
    "mediaId": 8295,
    "date": "2022-03-02",
    "sentence": "That was echoed by Gates, who pointed to Rep. <span class='selected-term'>Mark Finchem</span>, R-Tucson, a Trump-endorsed candidate for the elections job who Gates said “has made it very clear what his intent will be if he is elected secretary of state.”\nAll three panelists said they and their colleagues experienced threats on their homes, families and lives in the months following the election.",
    "author": "Camila Pedrosa",
    "title": "Gates expresses ‘great concerns’ about future of Arizona election integrity"
  },
  {
    "id": 17583,
    "mediaId": 8268,
    "date": "2022-03-02",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  },
  {
    "id": 17329,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "That was echoed by Gates, who pointed to Rep. <span class='selected-term'>Mark Finchem</span>, R-Tucson, a Trump-endorsed candidate for the elections job who Gates said “has made it very clear what his intent will be if he is elected secretary of state.”\nAll three panelists said they and their colleagues experienced threats on their homes, families and lives in the months following the election.",
    "author": "Camila Pedrosa",
    "title": "Gates expresses ‘great concerns’ about future of Arizona election integrity"
  },
  {
    "id": 15577,
    "mediaId": 8475,
    "date": "2022-03-07",
    "sentence": "Alexander is connected to another Arizona politician as well, state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "Jerod MacDonald-Evoy",
    "title": "New report highlights Roger Stone’s efforts on behalf of Trump allies in Arizona"
  },
  {
    "id": 11010,
    "mediaId": 2578,
    "date": "2022-03-07",
    "sentence": "Citing the massive evidence of fraud and doubt in elections, Arizona State Representative <span class='selected-term'>Mark Finchem</span> introduced a resolution to decertify the fraudulent 2020 election in Arizona last month.",
    "author": "Jordan Conradson",
    "title": "(VIDEO) Interview With Mike Lindell At Arizona Gubernatorial Candidate Kari Lake’s Rodeo Rally: “You Legislators Out there, You’re Going to Be a Traitor or a Hero”"
  },
  {
    "id": 11258,
    "mediaId": 2735,
    "date": "2022-03-07",
    "sentence": "Now, he’s trying to secure the election, this coming November, of <span class='selected-term'>Mark Finchem</span> as secretary of state.",
    "author": "Sasha Abramsky",
    "title": "Trump’s Pick for AZ Secretary of State Participated in January 6 Capitol Breach"
  },
  {
    "id": 15980,
    "mediaId": 8476,
    "date": "2022-03-08",
    "sentence": "",
    "author": "",
    "title": "No title"
  },
  {
    "id": 15698,
    "mediaId": 8476,
    "date": "2022-03-08",
    "sentence": "",
    "author": "",
    "title": "No title"
  },
  {
    "id": 10893,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Speakers scheduled to address the gathering include Roger Stone, Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>, Pastor Greg Locke, and Pastor Mark Burns.",
    "author": "Bob Brigham",
    "title": "Eric Trump praises huge portrait of his dad at conspiracy theorist conference: ‘I love that’"
  },
  {
    "id": 10737,
    "mediaId": 2664,
    "date": "2022-03-12",
    "sentence": "Other speakers scheduled to address the conference include Eric Trump, Roger Stone, Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>, Pastor Greg Locke, and Pastor Mark Burns.",
    "author": "Bob Brigham",
    "title": "Mike Flynn describes battle against school boards like a military action: 'We're gonna counter-attack'"
  },
  {
    "id": 11405,
    "mediaId": 2520,
    "date": "2022-03-12",
    "sentence": "Had someone like Arizona state Rep. <span class='selected-term'>Mark Finchem</span> been handling things in Georgia, 2020 would have ended with substantially more drama.",
    "author": "Matt Grodsky",
    "title": "I'm a Democrat who infiltrated the Republicans"
  },
  {
    "id": 11003,
    "mediaId": 2584,
    "date": "2022-03-12",
    "sentence": "While Trump did not endorse any candidates for secretary of state in 2020, he has already endorsed three in the 2022 cycle: Hice in Georgia, <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan.",
    "author": "Joan E Greve",
    "title": "‘Arsonists with keys to the firehouse’: once-obscure state races fuel fears for US democracy"
  },
  {
    "id": 11296,
    "mediaId": 2859,
    "date": "2022-03-14",
    "sentence": "What they’re looking for is an 1-inch stack of transcripts and memos delivered to him by <span class='selected-term'>Mark Finchem</span>, a fellow Republican member of the Arizona House.",
    "author": "Christian Sagers",
    "title": "Arizona’s last Republican maverick"
  },
  {
    "id": 11232,
    "mediaId": 2520,
    "date": "2022-03-15",
    "sentence": "The other group of fake electors, headed by Arizona GOP Chairwoman Kelli Ward, has also avoided any real trouble, although Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and a few others have been subpoenaed by the Select Committee to Investigate the January 6th Attack on the United States Capitol.",
    "author": "EJ Montini",
    "title": "Why aren't Arizona's treasonous fake electors in jail?"
  },
  {
    "id": 14237,
    "mediaId": 8251,
    "date": "2022-03-15",
    "sentence": "Trump has made several other Arizona endorsements, including Kari Lake for governor and <span class='selected-term'>Mark Finchem</span> for secretary of state, as well as two Republicans running for the state Senate, Wendy Rogers and Anthony Kern.",
    "author": "",
    "title": "Trump backs Arizona Republican Debbie Lesko for re-election"
  },
  {
    "id": 13423,
    "mediaId": 8475,
    "date": "2022-03-17",
    "sentence": "“Having some considerable personal experience with this, I’m not going to go as far as saying there should be no limit on punishment,” Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley, said.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Arizona bill would make bad Yelp and Google reviews a possible criminal act"
  },
  {
    "id": 14204,
    "mediaId": 8443,
    "date": "2022-03-18",
    "sentence": "Featured guest speakers are Christina Spurlock, candidate for Clerk of Mohave Superior Court; Bill Hardt, candidate for State Representative; Abraham Hamadeh, candidate for Arizona Attorney General; and <span class='selected-term'>Mark Finchem</span>, candidate for Arizona Secretary of State.",
    "author": "tsn-thestandard",
    "title": "London Bridge Republican Women meet Monday, April 4"
  },
  {
    "id": 9753,
    "mediaId": 2754,
    "date": "2022-03-19",
    "sentence": "Arizona Rep. <span class='selected-term'>Mark Finchem</span>’s (R-Oro Valley) House Concurrent Resolution 2033 seeking to nullify the state’s 2020 election was buried at introduction when House Speaker Rusty Bowers (R-Mesa) assigned it for approval to all 12 House committees.",
    "author": "Tyler Durden",
    "title": "2020 Election Nullification, Audit Bills Dead Or Dying In State Legislatures"
  },
  {
    "id": 9079,
    "mediaId": 2662,
    "date": "2022-03-21",
    "sentence": "Despite the ongoing processes, The Arizona audit discovered over 700,000 ballot discrepancies, and Arizona State Representative <span class='selected-term'>Mark Finchem</span> has introduced a resolution to decertify the 2002 Presidential Election.",
    "author": "Jordan Conradson",
    "title": "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?"
  },
  {
    "id": 9187,
    "mediaId": 2520,
    "date": "2022-03-24",
    "sentence": "Ward, Townsend were quick to dismiss that\nAfter Wednesday’s release of the special master’s report, Rep. <span class='selected-term'>Mark Finchem</span> – after more than a year of spouting conspiracy theories about the routers – was curiously radio silent.",
    "author": "Laurie Roberts",
    "title": "Latest election audit says no hacking, so, of course, Sen. Wendy Rogers decries hacking"
  },
  {
    "id": 9577,
    "mediaId": 2710,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "Keith Mines: To protect democracy we must protect our institutions"
  },
  {
    "id": 9739,
    "mediaId": 2560,
    "date": "2022-03-26",
    "sentence": "Lansing — <span class='selected-term'>Mark Finchem</span>, whom former President Donald Trump endorsed to be Arizona's next secretary of state, told a crowd in Michigan Saturday to \"fire\" lawmakers who were unwilling to consider claims of wrongdoing in the 2020 election.",
    "author": "Craig Mauger",
    "title": "Trump-backed candidates see 'movement' in Michigan despite small rally crowd"
  },
  {
    "id": 9735,
    "mediaId": 2658,
    "date": "2022-03-28",
    "sentence": "And you know, in the land of the blind, the one-eyed man is king.”\nThe base’s devotion to Trump was on display at a small rally in blistering cold at the state capitol building on Saturday, where “Trump won” was emblazoned on a flag and where a woman held a sign demanding a “full forensic audit.” Also in attendance was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a leading proponent of the conspiracy-tinged vote audit in Arizona’s largest county.",
    "author": "",
    "title": "Trump turns Michigan into MAGA proving ground"
  },
  {
    "id": 9585,
    "mediaId": 2902,
    "date": "2022-03-29",
    "sentence": "A.C. THOMPSON: Yeah, and <span class='selected-term'>Mark Finchem</span> is a guy who has been a member of the Oath Keepers, the militia group.",
    "author": "",
    "title": "“Plot to Overturn the Election”: Frontline/ProPublica Report Shows How Trump’s Lies Became GOP Dogma"
  },
  {
    "id": 10029,
    "mediaId": 8475,
    "date": "2022-03-30",
    "sentence": "On paper, the Democratic advocacy group MoveOn has spent more than $1.4 million against Republican <span class='selected-term'>Mark Finchem</span> in his campaign to become Arizona’s next secretary of state.",
    "author": "Jeremy Duda",
    "title": "Reported spending not indicative of Dem campaign against Arizona Rep. Mark Finchem — yet"
  },
  {
    "id": 7421,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "\"Since the 2020 election, Rep. <span class='selected-term'>Mark Finchem</span> has alleged widespread voter fraud, arguing in part that too many mail-in ballots went to people not living at some Arizona addresses.",
    "author": "Bob Brigham",
    "title": "BUSTED: Trump-endorsed Secretary of State candidate does not live where he is registered to vote"
  },
  {
    "id": 7326,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 7745,
    "mediaId": 2664,
    "date": "2022-04-02",
    "sentence": "A.C. THOMPSON: Yeah, and <span class='selected-term'>Mark Finchem</span> is a guy who has been a member of the Oath Keepers, the militia group.",
    "author": "Amy Goodman",
    "title": "'Plot to Overturn the Election': New report shows how Trump’s lies became GOP dogma"
  },
  {
    "id": 7795,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "There are Republican candidates like <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan who are running on the QAnon brand.",
    "author": "Sarah K. Burris",
    "title": "Florida GOP candidate runs from QAnon after he got burned: 'You guys are stupid'"
  },
  {
    "id": 7831,
    "mediaId": 5308,
    "date": "2022-04-05",
    "sentence": "During the Trump presidency, the QAnon movement gained significant steam, and several candidates who outright believe in the conspiracy, like <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan, are running for office in 2022.",
    "author": "Trone Dowd",
    "title": "Ex-WWE Ref Drake Wuertz Running for Florida GOP Turns Babyface Against QAnon"
  },
  {
    "id": 7595,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement,\" The New York Times reports.",
    "author": "Sky Palma",
    "title": "Six more Republicans sued over Constitution’s ban on insurrectionists running for office: report"
  },
  {
    "id": 7927,
    "mediaId": 2679,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Arizona, voters and the progressive group, Free Speech for People, targeted Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald Trump’s endorsement.",
    "author": "Jonathan Weisman",
    "title": "Legal effort expands to disqualify Republicans as ‘insurrectionists’"
  },
  {
    "id": 8231,
    "mediaId": 8475,
    "date": "2022-04-07",
    "sentence": "A trio of lawsuits seek to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Group aims to disqualify Biggs, Gosar and Finchem from ballot for Capitol insurrection"
  },
  {
    "id": 7641,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "A group seeking to bar those it blames for the Jan. 6, 2021, riot at the U.S. Capitol from seeking further office helped file lawsuits Thursday against U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Ronald J. Hansen",
    "title": "Lawsuits aim to ban Andy Biggs, Paul Gosar and Mark Finchem from holding office"
  },
  {
    "id": 7730,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 7305,
    "mediaId": 2688,
    "date": "2022-04-08",
    "sentence": "The group filed separate state lawsuits in Arizona against Reps. Paul Gosar (R-AZ), Andy Biggs (R-AZ), and <span class='selected-term'>Mark Finchem</span> (R-AZ) on Thursday.",
    "author": "Cristina Cabrera",
    "title": "Manhattan DA Wants You To Know His Trump Probe Isn’t Dead, Okay???"
  },
  {
    "id": 7349,
    "mediaId": 2746,
    "date": "2022-04-08",
    "sentence": "Free Speech For People filed lawsuits on behalf of voters in Arizona’s Maricopa County that challenge the eligibility for the office of GOP Reps. Paul Gosar and Andy Biggs, and state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Seth McLaughlin",
    "title": "Liberals push legal effort to block Republican ‘insurrectionists’ from the ballot"
  },
  {
    "id": 6011,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 5555,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "In a separate suit, Free Speech for People (FSFP), an organization formed in 2010, committed to getting money out of politics and securing and protecting the right of all citizens to vote – a right guaranteed by the 14th amendment – filed suit in Maricopa County against US Representatives Paul Gosar (R-AZ), Andy Biggs (R-AZ), and former GOP state Rep. <span class='selected-term'>Mark Finchem</span> to prevent each of them from running for re-election.",
    "author": "Ty Ross",
    "title": "DISQUALIFIED: Pro-coup Republicans face ban from seeking re-election"
  },
  {
    "id": 5909,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span> from holding office.",
    "author": "EJ Montini",
    "title": "Honor the Constitution and ban Arizona's insurrectionists from holding public office"
  },
  {
    "id": 6964,
    "mediaId": 8350,
    "date": "2022-04-11",
    "sentence": "On behalf of several Arizona voters in each case, Free Speech for People filed separate complaints last week against the candidacies of U.S. Reps. Andy Biggs and Paul Gosar, who are seeking reelection, and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state.",
    "author": "KEVIN STONE",
    "title": "Legal challenges seek to keep Biggs, Gosar, Finchem off Arizona ballots"
  },
  {
    "id": 5766,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 5535,
    "mediaId": 5308,
    "date": "2022-04-15",
    "sentence": "Q’ing up for the coup — <span class='selected-term'>Mark Finchem</span> isn’t just Donald Trump’s hand-picked, QAnon-addled GOP candidate for Arizona secretary of state who yells; he’s also a key part of how Trump tried to infect the Department of Homeland Security with his plot to stay in power.",
    "author": "Todd Zwillich",
    "title": "The DOJ Is Up Against the Clock to Prosecute Trump for Jan. 6"
  },
  {
    "id": 5310,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House Jan. 6 committee.",
    "author": "David Neiwert\nDaily Kos Staff",
    "title": "QAnon’s takeover of GOP nearly complete with 72 candidates ready to make ‘pedophilia’ claims"
  },
  {
    "id": 5622,
    "mediaId": 2629,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House January 6 committee.",
    "author": "David Neiwert",
    "title": "QAnon’s Takeover Of GOP Surging With 72 Candidates Pushing 'Pedophilia' Lies"
  },
  {
    "id": 5687,
    "mediaId": 2689,
    "date": "2022-04-19",
    "sentence": "https://t.co/FimoHLFNpm https://t.co/5eH3DmZYSA\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) April 7, 2022\nSpecial Counsel Michael Gableman says Facebook CEO's $8.8 million into Wisconsin's Democrat cities was election bribery in violation of the law pic.twitter.com/pDBzOpZulG\n— Liz Harrington (@realLizUSA) March 1, 2022\nIt’s frustrating to read, isn’t it?",
    "author": "",
    "title": "Dems Already Infiltrating For 2024 Election"
  },
  {
    "id": 4899,
    "mediaId": 8295,
    "date": "2022-04-19",
    "sentence": "But legal experts said that even if the cases are allowed to proceed, it will be difficult to show that the targeted lawmakers – including Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and U.S. Reps. Andy Biggs and Paul Gosar – actively participated in an insurrection that would make them ineligible to hold office.",
    "author": "Camila Pedrosa",
    "title": "Court allows Jan. 6 suit against Georgia lawmaker; could affect 3 in Arizona"
  },
  {
    "id": 4775,
    "mediaId": 8475,
    "date": "2022-04-20",
    "sentence": "But legal experts said that even if the cases are allowed to proceed, it will be difficult to show that the targeted lawmakers – including Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and U.S. Reps. Andy Biggs and Paul Gosar – actively participated in an insurrection that would make them ineligible to hold office.",
    "author": "Camila Pedrosa",
    "title": "Court allows Jan. 6 suit vs. Georgia rep.; could thwart 3 Az members of Congress"
  },
  {
    "id": 5149,
    "mediaId": 8251,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4635,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4648,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Biggs, Gosar, Finchem off Arizona ballots"
  },
  {
    "id": 5383,
    "mediaId": 2781,
    "date": "2022-04-20",
    "sentence": "Free Speech For People also serves as co-lead counsel in the challenge to Rep. Cawthorn’s eligibility to appear on the 2022 ballot, and in similar challenges filed last week in Arizona against Rep. Andy Biggs, Rep. Paul Gosar, and State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Secretary of State.",
    "author": "Free Speech for People",
    "title": "Federal Judge Allows Georgia Voters to Challenge Rep. Marjorie Taylor Greene’s Candidacy for Re-Election Under Fourteenth Amendment’s Insurrectionist Disqualification Clause"
  },
  {
    "id": 5398,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 5569,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5989,
    "mediaId": 2594,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "Via AP news wire",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 6027,
    "mediaId": 2680,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5894,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "State Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley, raised questions as far back as 2019 about the wisdom of constructing hundreds of miles of new freeway when the state can’t take care of the roads it already has.",
    "author": "Howard Fischer Capitol Media Services",
    "title": "Environmentalists sue to stop Interstate 11 through Arizona"
  },
  {
    "id": 4607,
    "mediaId": 8326,
    "date": "2022-04-21",
    "sentence": "More recently, Bowers has refused to allow a bill pushed by Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley, to set aside the 2020 results in three Arizona counties.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Arizona House Speaker Rusty Bowers honored with John F. Kennedy Profile in Courage Award"
  },
  {
    "id": 4844,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "Representatives Paul Gosar and Andy Biggs and state Representative <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley, claim they violated section three of the 14th Amendment, which states no governmental official “shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.”\nAttorneys for the lawmakers argued before Maricopa County Superior Court Judge Christopher Coury on Wednesday.",
    "author": "Michael McDaniel",
    "title": "Arizona lawmakers connected to Jan. 6 riot seek dismissal of candidate disqualification case"
  },
  {
    "id": 4846,
    "mediaId": 8345,
    "date": "2022-04-21",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4831,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "The lawsuits sought to disqualify Gosar, Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> by citing a section of the 14th Amendment to the U.S. constitution enacted after the Civil War.",
    "author": "",
    "title": "Judge dismisses ballot challenges against Gosar, Biggs, Finchem"
  },
  {
    "id": 4636,
    "mediaId": 8350,
    "date": "2022-04-22",
    "sentence": "Maricopa County Superior Court Judge Christopher Coury issued a ruling ordering the dismissal of the complaints filed earlier this month against U.S. Reps. Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span>, leaving them eligible for the Aug. 2 primary.",
    "author": "KEVIN STONE",
    "title": "Judge dismisses attempt to keep 3 Arizona Republicans off ballot"
  },
  {
    "id": 4980,
    "mediaId": 8326,
    "date": "2022-04-22",
    "sentence": "",
    "author": "",
    "title": "The \"Just Because\" Flash Sale."
  },
  {
    "id": 4985,
    "mediaId": 8475,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Judge boots case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 4868,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Howard Fischer",
    "title": "Judge allows Finchem, Gosar, Biggs to stay on ballot"
  },
  {
    "id": 5045,
    "mediaId": 8326,
    "date": "2022-04-22",
    "sentence": "As Greene testified in Georgia, a judge in Phoenix dismissed lawsuits seeking to disqualify three Republicans – Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> – from ballots in Arizona on the same grounds.",
    "author": "Ella Lee",
    "title": "'Never mean anything for violence': Marjorie Taylor Greene testifies on Jan. 6 in eligibility case"
  },
  {
    "id": 6051,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. <span class='selected-term'>Mark Finchem</span> (who’s running for Secretary of State) off the ballot in Arizona.",
    "author": "Nick Arama",
    "title": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat"
  },
  {
    "id": 5406,
    "mediaId": 2746,
    "date": "2022-04-22",
    "sentence": "The decision from Maricopa County Superior Court Judge Christopher Coury made public Friday means Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> remain on the primary ballot barring a reversal by the state Supreme Court.",
    "author": "Bob Christie",
    "title": "Arizona judge tosses lawsuits aiming to boot Trump backers off ballot"
  },
  {
    "id": 5255,
    "mediaId": 2562,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "NationalWatch",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5233,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeffrey Rodack",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5478,
    "mediaId": 5308,
    "date": "2022-04-22",
    "sentence": "So Madison Cawthorn, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] <span class='selected-term'>Mark Finchem</span> are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "‘Insurrectionist’ Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5004,
    "mediaId": 2643,
    "date": "2022-04-23",
    "sentence": "Arizona state Representative <span class='selected-term'>Mark Finchem</span>, a Republican, who is running to become the state's secretary of state in the 2022 midterms, and Kari Lake, a former television news journalist, who is running as a Republican to become the state's governor, filed the lawsuit with the backing of Lindell.",
    "author": "Jason Lemon",
    "title": "Mike Lindell Touts 'Historical' New Voting Machine Lawsuit at Trump Rally"
  },
  {
    "id": 5028,
    "mediaId": 2730,
    "date": "2022-04-23",
    "sentence": "On Friday, however, an Arizona judge ruled against one of the latest rounds of lawsuits, this time from voting groups seeking to prevent Reps. Paul Gosar and Andy Biggs, both Republicans from Arizona, as well as State Rep. <span class='selected-term'>Mark Finchem</span>, a fellow Republican from the state, from appearing on the ballot.",
    "author": "Rebecca Downs",
    "title": "Judge Dismisses Lawsuits Trying to Bar Reps. Paul Gosar, Andy Biggs from Running for Re-Election"
  },
  {
    "id": 4822,
    "mediaId": 2766,
    "date": "2022-04-23",
    "sentence": "They filed a lawsuit to stop Reps Paul Gosar, Andy Biggs, and State House Rep <span class='selected-term'>Mark Finchem</span> alleging that they participated in an “insurrection” stemming from the Jan 6 riot.",
    "author": "Faye Higbee",
    "title": "Democrats Attempt to Disqualify Reps Gosar, Biggs, Finchem; Court Dismissed the Attempt."
  },
  {
    "id": 4708,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The injunction plaintiffs include Kari Lake, the Republican and Trump-endorsed candidate for Arizona governor, and Rep. <span class='selected-term'>Mark Finchem</span>, R-Ariz., candidate for Arizona Secretary of State.",
    "author": "Summer Lane",
    "title": "Mike Lindell on injunctions to remove voting machines: ‘All machines have to go’"
  },
  {
    "id": 4944,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The lawsuit issued by a voting rights group sought to prevent Rep. Paul Gosar, Rep. Andy Biggs, and State Rep. <span class='selected-term'>Mark Finchem</span> from running for reelection.",
    "author": "Laura Ramirez",
    "title": "Victory: Arizona judge dismisses lawsuit, allows pro-Trump candidates to stay on the ballot"
  },
  {
    "id": 4655,
    "mediaId": 8326,
    "date": "2022-04-23",
    "sentence": "State Rep. <span class='selected-term'>Mark Finchem</span>, R-Oro Valley, also was on the call asserting fraud in the election.",
    "author": "Ronald J. Hansen",
    "title": "Testimony: Rep. Debbie Lesko was at White House planning meeting to avert 2020 Trump loss"
  },
  {
    "id": 5181,
    "mediaId": 8345,
    "date": "2022-04-23",
    "sentence": "The decision from Maricopa County Superior Court Judge Christopher Coury made public Friday means Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> remain on the primary ballot barring a reversal by the state Supreme Court.",
    "author": "Associated Press",
    "title": "Arizona judge nixes suit that seeks to keep Trump backers off ballot"
  },
  {
    "id": 4700,
    "mediaId": 8268,
    "date": "2022-04-23",
    "sentence": "",
    "author": "",
    "title": "Accurate. Credible. Reliable."
  }
]