[
  {
    "id": 2751,
    "mediaId": 2520,
    "date": "2022-02-03",
    "sentence": "Here are the then-current and incoming Republican state legislators who signed the resolution asking Congress to accept Arizona’s fake electors: Sen. Kelly Townsend of Mesa, Rep. Bret Roberts of Maricopa, Rep. Kevin Payne of Peoria, Rep. <span class='selected-term'>Mark Finchem</span> of Oro Valley, Sen. David Farnsworth of Mesa, Sen. Sonny Borrelli of Lake Havasu City, Rep. Leo Biasiucci, of Lake Havasu City, Rep. Anthony Kern of Glendale, Rep. David Cook of Globe, Sen. Sylvia Allen of Snowflake, Rep. John Fillmore of Apache Junction, Sen. Nancy Barto of Phoenix, Rep. Travis Grantham of Gilbert, Senate Majority Leader Warren Petersen of Gilbert, Rep. Walter Blackman of Snowflake, Rep. Steve Pierce of Prescott, Rep. Shawnna Bolick of Phoenix, Rep. Tony Rivero of Peoria, Rep. Noel Campbell of Prescott.",
    "author": "Laurie Roberts",
    "title": "What is Arizona GOP Chair Kelli Ward hiding from the committee investigating Jan. 6?"
  },
  {
    "id": 928,
    "mediaId": 2590,
    "date": "2022-02-15",
    "sentence": "“The select committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well.”\nAmong the six are two new celebrities among Trump followers: <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who is running to be the top elections official there, and Doug Mastriano, a Pennsylvania legislator who led the efforts to overturn Democrat Joe Biden’s victory in that state.",
    "author": "",
    "title": "Jan. 6 Committee Focuses On Trump Scheme To Solicit Slates Of Fake Electors"
  },
  {
    "id": 1378,
    "mediaId": 2688,
    "date": "2022-02-15",
    "sentence": "House investigators also want to speak with <span class='selected-term'>Mark Finchem</span>, an Arizona state representative and current candidate for Arizona secretary of state, who was in D.C. on Jan. 6.",
    "author": "Josh Kovensky",
    "title": "Jan. 6 Committee Subpoenas Republican State Lawmakers, Trump Campaign Officials"
  }
]