[
  {
    "id": 3686,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "author": "Joe Hoft",
    "title": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity"
  },
  {
    "id": 3969,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 3665,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 3216,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 3200,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "author": "",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 2728,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Fifteen Republican legislators have signed on to Fillmore's bill, including Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed candidate for Arizona secretary of state.",
    "author": "Chris Cillizza",
    "title": "An Arizona Republican just unveiled the most brazen election bill yet"
  },
  {
    "id": 3004,
    "mediaId": 2584,
    "date": "2022-01-29",
    "sentence": "One of the co-sponsors of the bill is <span class='selected-term'>Mark Finchem</span>, a state representative who believes the 2020 election was stolen, has ties to the Oath Keepers, and was at the Capitol on 6 January.",
    "author": "Sam Levine",
    "title": "Arizona Republicans introduce election subversion bill"
  },
  {
    "id": 2783,
    "mediaId": 2520,
    "date": "2022-02-02",
    "sentence": "Here is a list of Republican legislators who signed on as co-sponsors to Rep. Fillmore’s bill:\nReps. Brenda Barton of Payson, Leo Biasiucci of Lake Havasu City, Walter Blackman of Snowflake, Judy Burges of Skull Valley, Neal Carter of Queen Creek,\nJoseph Chaplik of Scottsdale, David Cook of Globe, Lupe Diaz of Benson, <span class='selected-term'>Mark Finchem</span> of Oro Valley, Jake Hoffman of Mesa, Teresa Martinez of Casa Grande, Jacqueline Parker of Mesa and Beverly Pingerelli of Peoria.",
    "author": "Laurie Roberts",
    "title": "House Speaker Rusty Bowers didn't just kill a bill to veto our vote. He stoned the thing"
  },
  {
    "id": 2751,
    "mediaId": 2520,
    "date": "2022-02-03",
    "sentence": "Here are the then-current and incoming Republican state legislators who signed the resolution asking Congress to accept Arizona’s fake electors: Sen. Kelly Townsend of Mesa, Rep. Bret Roberts of Maricopa, Rep. Kevin Payne of Peoria, Rep. <span class='selected-term'>Mark Finchem</span> of Oro Valley, Sen. David Farnsworth of Mesa, Sen. Sonny Borrelli of Lake Havasu City, Rep. Leo Biasiucci, of Lake Havasu City, Rep. Anthony Kern of Glendale, Rep. David Cook of Globe, Sen. Sylvia Allen of Snowflake, Rep. John Fillmore of Apache Junction, Sen. Nancy Barto of Phoenix, Rep. Travis Grantham of Gilbert, Senate Majority Leader Warren Petersen of Gilbert, Rep. Walter Blackman of Snowflake, Rep. Steve Pierce of Prescott, Rep. Shawnna Bolick of Phoenix, Rep. Tony Rivero of Peoria, Rep. Noel Campbell of Prescott.",
    "author": "Laurie Roberts",
    "title": "What is Arizona GOP Chair Kelli Ward hiding from the committee investigating Jan. 6?"
  },
  {
    "id": 1934,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "On Monday, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (Trump’s endorsed candidate for secretary of state) introduced a resolution seeking to decertify the results in Maricopa, Pima and Yuma counties — more than a year after the presidential election and following numerous fruitless attempts at digging up evidence that a massive voter fraud scheme cost Trump the presidency.",
    "author": "Liz Skalka",
    "title": "Arizona Republican Says His Daughter Got Text Calling Him 'N-Word' RINO"
  },
  {
    "id": 1903,
    "mediaId": 2520,
    "date": "2022-02-08",
    "sentence": "Not former state Rep. <span class='selected-term'>Mark Finchem</span>, now running for Arizona secretary of state.",
    "author": "EJ Montini",
    "title": "Arizona's Jan. 6 insurrectionists should be barred from holding office"
  },
  {
    "id": 1092,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 996,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nThis sham investigation is targeting Rep. <span class='selected-term'>Mark Finchem</span> and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 994,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 1066,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 928,
    "mediaId": 2590,
    "date": "2022-02-15",
    "sentence": "“The select committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well.”\nAmong the six are two new celebrities among Trump followers: <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who is running to be the top elections official there, and Doug Mastriano, a Pennsylvania legislator who led the efforts to overturn Democrat Joe Biden’s victory in that state.",
    "author": "",
    "title": "Jan. 6 Committee Focuses On Trump Scheme To Solicit Slates Of Fake Electors"
  },
  {
    "id": 1378,
    "mediaId": 2688,
    "date": "2022-02-15",
    "sentence": "House investigators also want to speak with <span class='selected-term'>Mark Finchem</span>, an Arizona state representative and current candidate for Arizona secretary of state, who was in D.C. on Jan. 6.",
    "author": "Josh Kovensky",
    "title": "Jan. 6 Committee Subpoenas Republican State Lawmakers, Trump Campaign Officials"
  },
  {
    "id": 964,
    "mediaId": 2592,
    "date": "2022-02-16",
    "sentence": "Trump endorsed his vocal supporter Rep. Finchem in Sept. 2021\nFinchem has repeatedly shared COVID-19 conspiracies\nFinchem was also spotted near the Capitol during the Jan. 6 insurrection\nFormer President Donald Trump has chosen Rep. <span class='selected-term'>Mark Finchem</span>, R-AZ, as his top pick for Arizona’s secretary of state position — a lawmaker known for repeatedly spreading misinformation about the COVID-19 pandemic and vaccines.",
    "author": "Danielle Ong",
    "title": "Trump Picks Anti-Vaxxer Who Claims COVID-19 Doesn't Exist For Arizona Sec. Of State"
  },
  {
    "id": 1126,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "GOP lawmakers are pushing high-tech ‘fraud-proof’ ballots. A Texas company could be the only supplier."
  },
  {
    "id": 267,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 207,
    "mediaId": 2520,
    "date": "2022-02-21",
    "sentence": "These are the Republicans who voted no:\nBrenda Barton of Payson, Judy Burges of Skull Valley, Neal Carter of San Tan Valley, Joseph Chaplik of Scottsdale, Lupe Diaz of Benson, John Fillmore of Apache Junction, <span class='selected-term'>Mark Finchem</span> of Oro Valley.",
    "author": "Laurie Roberts",
    "title": "Shame on every Republican who voted to sabotage Arizona's schools"
  },
  {
    "id": 300,
    "mediaId": 2528,
    "date": "2022-02-21",
    "sentence": "He also shared the link to a donation page titled \"Rep <span class='selected-term'>Mark Finchem</span> Legal Defense Fund\" on the Christian crowdfunding site GiveSendGo.",
    "author": "Kelsey Vlamis",
    "title": "A Trump-backed candidate in Arizona is trying to raise $750,000 for a legal defense fund after he was subpoenaed by the January 6 committee"
  },
  {
    "id": 547,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nEXCLUSIVE: Arizona State Representative <span class='selected-term'>Mark Finchem</span> Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”"
  },
  {
    "id": 634,
    "mediaId": 2520,
    "date": "2022-02-22",
    "sentence": "And it’s being promoted by Rep. <span class='selected-term'>Mark Finchem</span>, a guy who is hoping that if he lies often enough about Arizona’s election being stolen that voters will install him as secretary of state to oversee future elections.",
    "author": "Laurie Roberts",
    "title": "GOP legislators want new ballots that - surprise! - can only be made by one company"
  },
  {
    "id": 599,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 11405,
    "mediaId": 2520,
    "date": "2022-03-12",
    "sentence": "Had someone like Arizona state Rep. <span class='selected-term'>Mark Finchem</span> been handling things in Georgia, 2020 would have ended with substantially more drama.",
    "author": "Matt Grodsky",
    "title": "I'm a Democrat who infiltrated the Republicans"
  },
  {
    "id": 11232,
    "mediaId": 2520,
    "date": "2022-03-15",
    "sentence": "The other group of fake electors, headed by Arizona GOP Chairwoman Kelli Ward, has also avoided any real trouble, although Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and a few others have been subpoenaed by the Select Committee to Investigate the January 6th Attack on the United States Capitol.",
    "author": "EJ Montini",
    "title": "Why aren't Arizona's treasonous fake electors in jail?"
  },
  {
    "id": 9585,
    "mediaId": 2902,
    "date": "2022-03-29",
    "sentence": "A.C. THOMPSON: Yeah, and <span class='selected-term'>Mark Finchem</span> is a guy who has been a member of the Oath Keepers, the militia group.",
    "author": "",
    "title": "“Plot to Overturn the Election”: Frontline/ProPublica Report Shows How Trump’s Lies Became GOP Dogma"
  },
  {
    "id": 10029,
    "mediaId": 8475,
    "date": "2022-03-30",
    "sentence": "On paper, the Democratic advocacy group MoveOn has spent more than $1.4 million against Republican <span class='selected-term'>Mark Finchem</span> in his campaign to become Arizona’s next secretary of state.",
    "author": "Jeremy Duda",
    "title": "Reported spending not indicative of Dem campaign against Arizona Rep. Mark Finchem — yet"
  },
  {
    "id": 7326,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 7795,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "There are Republican candidates like <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan who are running on the QAnon brand.",
    "author": "Sarah K. Burris",
    "title": "Florida GOP candidate runs from QAnon after he got burned: 'You guys are stupid'"
  },
  {
    "id": 7595,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement,\" The New York Times reports.",
    "author": "Sky Palma",
    "title": "Six more Republicans sued over Constitution’s ban on insurrectionists running for office: report"
  },
  {
    "id": 7641,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "A group seeking to bar those it blames for the Jan. 6, 2021, riot at the U.S. Capitol from seeking further office helped file lawsuits Thursday against U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Ronald J. Hansen",
    "title": "Lawsuits aim to ban Andy Biggs, Paul Gosar and Mark Finchem from holding office"
  },
  {
    "id": 7730,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 7349,
    "mediaId": 2746,
    "date": "2022-04-08",
    "sentence": "Free Speech For People filed lawsuits on behalf of voters in Arizona’s Maricopa County that challenge the eligibility for the office of GOP Reps. Paul Gosar and Andy Biggs, and state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Seth McLaughlin",
    "title": "Liberals push legal effort to block Republican ‘insurrectionists’ from the ballot"
  },
  {
    "id": 6011,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 5555,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "In a separate suit, Free Speech for People (FSFP), an organization formed in 2010, committed to getting money out of politics and securing and protecting the right of all citizens to vote – a right guaranteed by the 14th amendment – filed suit in Maricopa County against US Representatives Paul Gosar (R-AZ), Andy Biggs (R-AZ), and former GOP state Rep. <span class='selected-term'>Mark Finchem</span> to prevent each of them from running for re-election.",
    "author": "Ty Ross",
    "title": "DISQUALIFIED: Pro-coup Republicans face ban from seeking re-election"
  },
  {
    "id": 5909,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span> from holding office.",
    "author": "EJ Montini",
    "title": "Honor the Constitution and ban Arizona's insurrectionists from holding public office"
  },
  {
    "id": 5766,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 5310,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House Jan. 6 committee.",
    "author": "David Neiwert\nDaily Kos Staff",
    "title": "QAnon’s takeover of GOP nearly complete with 72 candidates ready to make ‘pedophilia’ claims"
  },
  {
    "id": 5622,
    "mediaId": 2629,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House January 6 committee.",
    "author": "David Neiwert",
    "title": "QAnon’s Takeover Of GOP Surging With 72 Candidates Pushing 'Pedophilia' Lies"
  },
  {
    "id": 5398,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 5569,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4635,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 6051,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. <span class='selected-term'>Mark Finchem</span> (who’s running for Secretary of State) off the ballot in Arizona.",
    "author": "Nick Arama",
    "title": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat"
  },
  {
    "id": 4831,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "The lawsuits sought to disqualify Gosar, Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> by citing a section of the 14th Amendment to the U.S. constitution enacted after the Civil War.",
    "author": "",
    "title": "Judge dismisses ballot challenges against Gosar, Biggs, Finchem"
  },
  {
    "id": 5233,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeffrey Rodack",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5255,
    "mediaId": 2562,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "NationalWatch",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5181,
    "mediaId": 8345,
    "date": "2022-04-23",
    "sentence": "The decision from Maricopa County Superior Court Judge Christopher Coury made public Friday means Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> remain on the primary ballot barring a reversal by the state Supreme Court.",
    "author": "Associated Press",
    "title": "Arizona judge nixes suit that seeks to keep Trump backers off ballot"
  },
  {
    "id": 4822,
    "mediaId": 2766,
    "date": "2022-04-23",
    "sentence": "They filed a lawsuit to stop Reps Paul Gosar, Andy Biggs, and State House Rep <span class='selected-term'>Mark Finchem</span> alleging that they participated in an “insurrection” stemming from the Jan 6 riot.",
    "author": "Faye Higbee",
    "title": "Democrats Attempt to Disqualify Reps Gosar, Biggs, Finchem; Court Dismissed the Attempt."
  },
  {
    "id": 4944,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The lawsuit issued by a voting rights group sought to prevent Rep. Paul Gosar, Rep. Andy Biggs, and State Rep. <span class='selected-term'>Mark Finchem</span> from running for reelection.",
    "author": "Laura Ramirez",
    "title": "Victory: Arizona judge dismisses lawsuit, allows pro-Trump candidates to stay on the ballot"
  },
  {
    "id": 5028,
    "mediaId": 2730,
    "date": "2022-04-23",
    "sentence": "On Friday, however, an Arizona judge ruled against one of the latest rounds of lawsuits, this time from voting groups seeking to prevent Reps. Paul Gosar and Andy Biggs, both Republicans from Arizona, as well as State Rep. <span class='selected-term'>Mark Finchem</span>, a fellow Republican from the state, from appearing on the ballot.",
    "author": "Rebecca Downs",
    "title": "Judge Dismisses Lawsuits Trying to Bar Reps. Paul Gosar, Andy Biggs from Running for Re-Election"
  }
]