[
  {
    "id": 2783,
    "mediaId": 2520,
    "date": "2022-02-02",
    "sentence": "Here is a list of Republican legislators who signed on as co-sponsors to Rep. Fillmore’s bill:\nReps. Brenda Barton of Payson, Leo Biasiucci of Lake Havasu City, Walter Blackman of Snowflake, Judy Burges of Skull Valley, Neal Carter of Queen Creek,\nJoseph Chaplik of Scottsdale, David Cook of Globe, Lupe Diaz of Benson, <span class='selected-term'>Mark Finchem</span> of Oro Valley, Jake Hoffman of Mesa, Teresa Martinez of Casa Grande, Jacqueline Parker of Mesa and Beverly Pingerelli of Peoria.",
    "author": "Laurie Roberts",
    "title": "House Speaker Rusty Bowers didn't just kill a bill to veto our vote. He stoned the thing"
  },
  {
    "id": 1864,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "The Gateway Pundit reported that <span class='selected-term'>Mark Finchem</span> introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)"
  },
  {
    "id": 2409,
    "mediaId": 2688,
    "date": "2022-02-09",
    "sentence": "Within hours of Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R) introducing his bill to “decertify” and “set aside” the 2020 election results in three of Arizona’s largest counties, two things happened.",
    "author": "Cristina Cabrera",
    "title": "Trump-Endorsed Arizona Secretary of State Candidate Has A Show Bill To ‘Decertify’ 2020"
  },
  {
    "id": 2595,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "The bill was introduced Monday by right-wing Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Trump-endorsed candidate for secretary of state.",
    "author": "John Wright",
    "title": "‘This is what we’ve been waiting for!’: Mike Lindell celebrates doomed Arizona decertification bill"
  },
  {
    "id": 1092,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 934,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "https://t.co/nDKQe9zCux\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 14, 2022\nNo matter where you live, sign Arizona State Rep. Mark Finchem’s petition to decertify the fraudulent 2020 election and strongly encourage your state legislators to sign State Senator Rogers’ letter to audit 50 states.",
    "author": "Jordan Conradson",
    "title": "204 Legislators Call For 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives"
  },
  {
    "id": 547,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nEXCLUSIVE: Arizona State Representative <span class='selected-term'>Mark Finchem</span> Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”"
  },
  {
    "id": 34,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> recently presented a resolution to decertify the fraudulent election results, but Rusty Bowers lacks the courage to fight for Arizona voters.",
    "author": "Jordan Conradson",
    "title": "RINO Arizona House Speaker Rusty Bowers Files to Run for Senate After Turning On Constituents and Allowing Election Fraud"
  },
  {
    "id": 599,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 666,
    "mediaId": 2662,
    "date": "2022-02-23",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”"
  },
  {
    "id": 304,
    "mediaId": 2662,
    "date": "2022-02-24",
    "sentence": "WATCH: AZ State Representative <span class='selected-term'>Mark Finchem</span> On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”\nContact Arizona Senate President Karen Fann, Speaker Rusty Bowers, and Arizona legislators to strongly encourage their support for decertification.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona Senate President Karen Fann Claims “We Really Don’t Have a Mechanism To Decertify” – Mark Finchem Gave Us The Mechanism"
  },
  {
    "id": 9753,
    "mediaId": 2754,
    "date": "2022-03-19",
    "sentence": "Arizona Rep. <span class='selected-term'>Mark Finchem</span>’s (R-Oro Valley) House Concurrent Resolution 2033 seeking to nullify the state’s 2020 election was buried at introduction when House Speaker Rusty Bowers (R-Mesa) assigned it for approval to all 12 House committees.",
    "author": "Tyler Durden",
    "title": "2020 Election Nullification, Audit Bills Dead Or Dying In State Legislatures"
  }
]