[
  {
    "id": 3636,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nArizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> told The Gateway Pundit that he is already working on a five-page resolution to reclaim Arizona’s electors.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)"
  },
  {
    "id": 3216,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 3167,
    "mediaId": 2578,
    "date": "2022-01-27",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Expects Arrests in Arizona: “Maricopa County Isn’t The Only County – We Are Waiting for Indictments”\nThe Gateway Pundit correspondent Jordan Conradson spoke to Senator Rogers about Arizona Attorney General Mark Brnovich’s investigation and decertification in Arizona.",
    "author": "Jordan Conradson",
    "title": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”"
  },
  {
    "id": 1332,
    "mediaId": 6509,
    "date": "2022-02-14",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 Panel Subpoenas 6 More in Fake GOP Electors Scheme"
  },
  {
    "id": 1445,
    "mediaId": 2707,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1181,
    "mediaId": 2523,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 11232,
    "mediaId": 2520,
    "date": "2022-03-15",
    "sentence": "The other group of fake electors, headed by Arizona GOP Chairwoman Kelli Ward, has also avoided any real trouble, although Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and a few others have been subpoenaed by the Select Committee to Investigate the January 6th Attack on the United States Capitol.",
    "author": "EJ Montini",
    "title": "Why aren't Arizona's treasonous fake electors in jail?"
  }
]