[
  {
    "id": 3686,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "author": "Joe Hoft",
    "title": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity"
  },
  {
    "id": 3703,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "Incredible speakers, including Arizona State Representative <span class='selected-term'>Mark Finchem</span> and General Michael Flynn, will headline the three-day event at the U.S.-Mexico border.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Women Fighting For America’s Jan. 28-30 Border Event Comes Under Attack from Angry Leftists and Big Tech – Organizers Vow to Push Forward — REGISTER HERE"
  },
  {
    "id": 2112,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Among the Republicans who attended John Sabal's Patriot Voice event, were Arizona State Senator Wendy Rogers and Arizona State Representative <span class='selected-term'>Mark Finchem</span>, both of whom continue to push the baseless claim that the 2020 election was stolen.",
    "author": "Anders Anglesey",
    "title": "QAnon in 2022: Conspiracy Followers Focus on Controlling Elections and School Boards"
  },
  {
    "id": 1267,
    "mediaId": 4032,
    "date": "2022-02-12",
    "sentence": "Conservative “superstars” such as Lt. General Michael Flynn, former national security advisor to President Donald Trump and retired chief of military intelligence; conservative rock star Ted Nugent; Colonel Allen West, former congressman and Texas GOP chief; libertarian business magnate and Overstock.com founder Patrick Byrne; former Immigration and Customs Enforcement chief Tom Hohman; former Customs and Border Protection head Mark Morgan; celebrity actress and author Sam Sorbo; Arizona State Representative <span class='selected-term'>Mark Finchem</span>; many sheriffs and lawmen; and leading conservative media personalities.",
    "author": "Alex Newman",
    "title": "Shadowy Forces Sabotage Key Border Event Hosted by Patriots"
  },
  {
    "id": 1425,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. <span class='selected-term'>Mark Finchem</span> (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate Doug Mastriano (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trump’s reelection campaign\n“The committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,” Tom and Jacqueline write.",
    "author": "",
    "title": "The cyber fight in Ukraine is getting more serious"
  },
  {
    "id": 11258,
    "mediaId": 2735,
    "date": "2022-03-07",
    "sentence": "Now, he’s trying to secure the election, this coming November, of <span class='selected-term'>Mark Finchem</span> as secretary of state.",
    "author": "Sasha Abramsky",
    "title": "Trump’s Pick for AZ Secretary of State Participated in January 6 Capitol Breach"
  },
  {
    "id": 10893,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Speakers scheduled to address the gathering include Roger Stone, Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>, Pastor Greg Locke, and Pastor Mark Burns.",
    "author": "Bob Brigham",
    "title": "Eric Trump praises huge portrait of his dad at conspiracy theorist conference: ‘I love that’"
  },
  {
    "id": 9577,
    "mediaId": 2710,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "Keith Mines: To protect democracy we must protect our institutions"
  },
  {
    "id": 5569,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5398,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 5478,
    "mediaId": 5308,
    "date": "2022-04-22",
    "sentence": "So Madison Cawthorn, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] <span class='selected-term'>Mark Finchem</span> are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "‘Insurrectionist’ Marjorie Taylor Greene Goes Under Oath Today"
  },
  {
    "id": 4708,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The injunction plaintiffs include Kari Lake, the Republican and Trump-endorsed candidate for Arizona governor, and Rep. <span class='selected-term'>Mark Finchem</span>, R-Ariz., candidate for Arizona Secretary of State.",
    "author": "Summer Lane",
    "title": "Mike Lindell on injunctions to remove voting machines: ‘All machines have to go’"
  }
]