{
  "id": 3352,
  "mediaId": 195,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report  Primary night: All eyes on Pennsylvania",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_ozmehmetpennsylvania_040222_ap-Matt-Rourke.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3490891-the-hills-morning-report-primary-night-all-eyes-on-pennsylvania/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    821,
    2303,
    3094,
    3102
  ],
  "sentences": [
    "The White House, in its statement today, criticized the legislative branch: Due to Congress's failure to provide additional funding for the nation's COVID-19 response, the Administration cannot continue making the types of federal investments needed to sustain domestic testing manufacturing capacity, and this may jeopardize the federal government's ability to provide free tests moving forward.?\nTotal U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University (trackers all vary slightly): 999,824.",
    "LEADING THE DAY\n? PRESIDENT, CONGRESS, MASS SHOOTINGS\nPresident Biden and first lady Jill Biden will fly to Buffalo, N.Y., today to console grieving families and offer reassurances to a predominantly Black community that the government is intent on preventing, if possible, and investigating and punishing any accused mass shooters, such as the white teenager who traveled to an east Buffalo supermarket on Saturday and killed 10 people and injured three others with an assault rifle while live streaming the murders.",
    "The government on Monday said the FDA's best current assessment is that with all of the current actions  and the potential for Abbott Nutrition's Sturgis, Michigan, facility to safely resume production in the near-term, the supply of infant formula will continue to improve over the next couple of months.?\nThe White House last weekend offered formula manufacturers and retailers transportation and logistics support with encouragement to all major formula producers to boost production.",
    "Writing for the majority, Chief Justice John Roberts said that the provision burdens core political speech without proper justification.? Justice Elena Kagan wrote in dissent that the decision greenlights all the sordid bargains Congress thought right to stop? with the 2002 law, adding that it can only bring this country's political system into further disrepute.? The Biden administration had defended it on an anti-corruption basis (The Associated Press).",
    "IN FOCUS/SHARP TAKES\n? ADMINISTRATION\ng? The Food and Drug Administration and infant formula maker Abbott reached an unspecified agreement on Monday to soon restart production at Abbott's largest domestic factory, which is in Michigan, a key step toward easing a nationwide shortage tied to the plant's shutdown earlier this year for safety problems after two babies died.",
    "THE CLOSER\nAnd finally  The Rolling Stones's 60th anniversary tour through Europe beginning June 1 and into July is not without merch, mega-promotion, fans' Tokyo fireworks extravaganza (sans an actual Stones concert) in July, and some newly released 1977 music from the band's El Mocambo club performance wayback machine (Variety and Rolling Stone).",
    "Oz with a slim lead, but he's by no means out of the woods,? one Keystone State-based GOP operative told the Morning Report on Monday, adding that the worst-case scenario involves Barnette and state Sen. Doug Mastriano (R), the Trump-endorsed candidate for governor, emerging victorious and handing Democrats a lifeline in November.",
    "Now that some of her negatives are coming out, some are less inclined to support [her].?\nIn his final pitch to voters, Trump on Monday recorded a robocall intended to boost Oz and criticize Barnette and McCormick, saying that the latter two are not candidates who put America first? (The Washington Post).",
    "The president's message is that racism, hate crimes and domestic terrorism will be prosecuted to the full extent of federal and state laws and that Americans everywhere must counter the radicalization of individuals who act out their hatreds and fears of Blacks, Latinos and Jews, among other victims.",
    "Outside of today's primary contests, there was some major political news emanating from the Supreme Court on Monday as justices sided with Sen. Ted Cruz (R-Texas) and struck down a portion of the McCain-Feingold campaign finance law that caps loan repayments to candidates at $250,000.",
    "However, if Cawthorn holds on, it might be because of Trump's help, as the former president on Monday reiterated his endorsement for the 26-year-old lawmaker, saying that the incumbent has made foolish mistakes, which I don't believe he'll make again? (The Wall Street Journal).",
    "In California, authorities on Monday said a Las Vegas gunman who shot and killed an Orange County physician and injured five other people at a Taiwanese Presbyterian Church was a Chinese immigrant and U.S. citizen who was motivated by hatred of Taiwanese (The Associated Press).",
    "The 18-year-old shooter in Buffalo, who surrendered to police and has pleaded not guilty, posted a lengthy manifesto describing his plans for a mass attack and his fears that whites in America are being replaced? by Blacks and Jews, according to authorities (The Hill).",
    "Rep. Brad Schneider (D-Ill.) urged House leadership on Monday to schedule a vote on the Domestic Terrorism Prevention Act, which calls for the creation of new domestic terrorism offices in the departments of Homeland Security and Justice and at the FBI.",
    "With Barnette and Mastriano at the top of the ticket, every seat in Pennsylvania is more up for grabs.?\nIn the last two weeks, the lion's share of scrutiny has fallen on Barnette as she has surged amid the two-way ad war between Oz and McCormick.",
    "The Associated Press reports today that efforts are still underway to try to rescue the last of Mariupol's defenders inside the plant who remained behind after Ukraine conceded there was no military way to retake the plant from Russian troops.",
    "He meets with Yemeni Foreign Minister Dr. Ahmed Awad Bin Mubarak at 3:15 p.m.\nEconomic indicators: Federal Reserve Chairman Jerome Powell at 2 p.m. will discuss the economy in New York at the Wall Street Journal Future of Everything Festival.",
    "Voters will also take to the polls in North Carolina and determine the future of Rep. Madison Cawthorn (R) after a never-ending string of unflattering stories and questionable remarks turned his race into a competitive one (NBC News).",
    "The work continues to bring the guys home and it requires delicacy and time.?\n Reuters: Zelensky and German Chancellor Olaf Scholz met today to discuss the war and the possibility of increasing sanctions pressure on Russia.",
    "They will return to the White House and, alongside Vice President Harris and second gentleman Doug Emhoff, host a Rose Garden reception at 4 p.m. to mark Asian American, Native Hawaiian and Pacific Islander Heritage Month.",
    "It's primary night in America, and all eyes are on a spate of GOP contests that could determine the future of the Senate in November and former President Trump's impact on the Republican Party for the foreseeable future.",
    "? TECH\nElon Musk this morning said that his deal to acquire Twitter for $44 billion cannot move forward? unless the company paints a clearer picture about how many daily active users are bots (The Wall Street Journal).",
    "Twitter CEO Parag Agrawal on Monday sought to quell the Tesla CEO's concerns after Musk said last week that he is putting his $44 billion acquisition on hold,? a remark that tanked the company's share price (The Hill).",
    "In Ukraine's southern port city of Mariupol, Ukrainian troops holed up in the last stronghold began evacuating a steel plant on Monday, ceding control of the once-prosperous city to Russia after months of bombardment.",
    "Chief among the states to watch is Pennsylvania, which features the event of the evening: a rough-and-tumble Senate GOP primary among Mehmet Oz, Kathy Barnette and David McCormick, all of whom have a shot at victory.",
    "Touring: Mick Jagger, who will be 79 in July; Keith Richards, 78; Ronnie Wood, who will be 75 the day the tour starts, and drummer Steve Jordan, 65, (joining the tour in place of Charlie Watts, who died last summer).",
    "According to strategists and the latest polling, Oz is considered the slight favorite, but Barnette's late charge has changed the calculus and thrown a fresh sense of uncertainty into what will be the final result.",
    "Cawthorn is facing an eight-way primary tonight, including a challenge from state Sen. Chuck Edwards, who has earned the support of Sen. Thom Tillis (R-N.C.) and other influential figures in the Tar Heel State.",
    "Sweden, long a neutral country, today signed its application for NATO membership (The Washington Post), following in the footsteps of Finland to seek security from Russia, the aggressor on Finland's border.",
    "? ECONOMY\nDuring his first term at the Fed, Powell faced a president who sought to remove him, a COVID-19-induced economic downturn and the subsequent inflation the country has experienced in the past year.",
    "However, rising costs could make vacation plans prohibitively expensive, as airfares experienced the largest-ever annual increase in April and rental car, hotel and vacation rental prices continue to rise.",
    " So you could call that stagflation.?\nAs The Hill's Karl Evers-Hillstrom writes, the continued climb of costs is also expected to create more problems for U.S. families this summer who want to travel.",
    "McConnell has assumed a prominent role in maintaining Republican support for Ukraine's fight for independence, arguing publicly that the U.S. must do its utmost to help Ukraine win against Russia.",
    "The 68-year-old suspect drove from Nevada to the Southern California church, where he was not a regular attendee, secured the doors with chains, fast-drying glue and nails, and started shooting.",
    " Associated Press / Chris Seward | GOP Rep. Madison Cawthorn in Selma, N.C., April 9.\n The New York Times: Rep. Ted Budd (R) thrives in North Carolina Senate primary as two key backers squabble.",
    " We cannot continue making excuses.?\n? UKRAINE CRISIS\nWill the Senate, after a delay last week, follow the House and approve $40 billion in additional U.S. assistance to Ukraine on Wednesday?",
    "The president and the first lady will depart at 8:10 a.m. to Buffalo to meet with community members impacted by the mass shooting deaths on Saturday of 10 people and injuries to three others.",
    "Former Fed Chair Ben Bernanke, who led the bank during the Great Recession, suggested that the nation might be in for a period of stagflation? not unlike the U.S. experienced in the 1970s.",
    "gConsumers trying to locate infant formula can refer to information compiled by the Department of Health and Human Services HERE or tips from The New York Times published on Monday HERE.",
    "ELSEWHERE\n? CORONAVIRUS\nTesting: The White House today announced another distribution round of free, at-home rapid COVID-19 tests available to U.S. households through COVIDTests.gov.",
    "https://wapo.st/3FOKIYk\n After three stormy decades, some reasons to still find optimism, by Gerald F. Seib, executive Washington editor, The Wall Street Journal (final column).",
    "Ukraine's deputy defense minister said more than 260 fighters, including some badly wounded, were evacuated from the plant Monday and taken to areas under Russia's control.",
    "Senate Republican Leader Mitch McConnell (Ky.), just back from a visit to Kyiv with Senate colleagues, predicts the answer will be yes, reports The Hill's Alexander Bolton.",
    "ET\nThe pandemic and its toll on the mental health of Americans is often described as a dual crisis.? What is being done to address the mental health crisis in our country?",
    "They will pay their respects and meet with families, law enforcement and community members at 11 a.m. Biden will make remarks at 1 p.m. at Delavan Grider Community Center.",
    "Top on the list for the immediate future: leading a successful effort to raise interest rates high enough to curb inflation without derailing an otherwise strong economy.",
    "During Mental Health Awareness Month, The Hill hosts a discussion on policy recommendations that promote prevention and care for Americans experiencing mental illness.",
    "At commissaries on U.S. military bases, stock levels of baby formula are at 50 percent domestically and 70 percent at bases overseas, the Pentagon said on Monday.",
    "The government and law enforcement have failed to catch these signs, just as Congress has failed to appropriately combat domestic terrorism,? Schneider said.",
    "His challenger calls him a fossil.?\n The New York Times: There is a fracture in Idaho's GOP as the far right seeks control in the state's governor's race.",
    "Rep. Tony Crdenas (D-Calif.), Rep. John Katko (R-N.Y.), National Institute of Mental Health Director Dr. Joshua Gordon, Headspace CEO Russ Glass and more.",
    "The third distribution makes available an additional eight test kits, bringing the total available free since the start of the government's program to 16.",
    "Both nations have run into a problem that surprised Western allies: vehement opposition from NATO member Turkey (The Associated Press and Reuters).",
    "The FDA also is working to ease import rules to bring in supplies from overseas if instructions are in languages U.S. consumers can safely follow.",
    "We are not immune to the same supply chain problems that other families across America are experiencing,? spokesman John Kirby told reporters.",
    "In Congress on Monday, lawmakers accused some GOP colleagues of fomenting violence by condoning or espousing divisive white nationalist views.",
    "So there should be a period in the next year or two where growth is low, unemployment is at least up a little bit and inflation is still high.",
    "Ukrainian President Volodymyr Zelensky said the withdrawal of forces to separatist-controlled territory was intended to save their lives.",
    "Separately, House members have been advised to anticipate taking up two measures this week that deal with the infant formula shortage.",
    "A House Intelligence subcommittee will question Pentagon witnesses at 9 a.m. about years of evidence of unidentified aerial sightings.",
    "Musk added during a tech event Monday in Miami that purchase of Twitter at a lower price is not out of the question? (Bloomberg News).",
    "OPINION\n Gun rights advocates do themselves no favors by not addressing gun violence, by Henry Olsen, columnist, The Washington Post.",
    "g Hill.TV's Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "As The Hill's Sylvan Lane writes, the issues are unlikely to get easier for Powell, who was reconfirmed to the post last week.",
    "The company seeks a buyer who will employ its 62,000 workers there and will continue to pay those workers until a deal closes.",
    " The Associated Press: The accused Buffalo gunman scoped out Saturday's supermarket target and plotted an attack for months.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Secretary of State Antony Blinken meets with Greek Foreign Minister Nikos Dendias at 1:30 p.m. at the State Department.",
    "It will host a joint session of Congress at 11 a.m. to hear an address by Greek Prime Minister Kyriakos Mitsotakis.",
    " NBC New York: Reps. Jerry Nadler (D-N.Y.), Carolyn Maloney (D-N.Y.) to face off in blockbuster Manhattan primary.",
    "Abbott has said it will take at least eight weeks to begin shipping new product to stores (The Associated Press).",
    " The Associated Press: McDonald's said on Monday it will sell its 850 restaurants in Russia and exit the country.",
    "Current average U.S. COVID-19 daily deaths are 263, according to the Centers for Disease Control and Prevention.",
    "John Fetterman is expected to win handily in the state's Senate Democratic primary over Rep. Conor Lamb (Pa.).",
    "A number of those individuals were later arrested for breaking into the Capitol and attacking police officers.",
    "Fetterman announced on Sunday that he suffered a minor stroke on Friday and has been off the campaign trail.",
    " The Hill: Senate Majority Leader Charles Schumer (D-N.Y.) will accompany Biden and others to Buffalo today.",
    "NBC News on Monday unearthed photos that showed Barnette marching with members of the Proud Boys on Jan. 6.",
    "\nThe Senate convenes at 2:30 p.m. and will resume consideration of the Ukraine Supplemental Aid Package.",
    " Associated Press / Martin Meissner | Swedish flag and Russian double-headed eagle, Helsinki, May 13.",
    "In 2018, Cruz loaned his campaign $260,000 and was suing to be able to recoup the additional $10,000.",
    "Even under the benign scenario, we should have a slowing economy,? Bernanke told The New York Times.",
    "The Hill: Here are 11 Republicans who vote against a motion to advance the Ukraine aid bill.",
    "The House Rules Committee made it possible for the bill to come to a vote today (The Hill).",
    " Associated Press / Matt Rourke | Buffalo, N.Y., supermarket following Saturday's shooting.",
    "It's why he sought the presidency for a third time in 2020, he says (The Associated Press).",
    "Abbott is one of just four companies that produce roughly 90 percent of U.S. baby formula.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "Economists expect to see retail sales growth in today's report (The Wall Street Journal).",
    " The Census Bureau at 8:30 a.m. reports on U.S. retail sales and food services in April.",
    "The Associated Press explainer: Next steps for Finland and Sweden and NATO membership.",
    "She may have peaked a little too early,? one GOP operative told the Morning Report.",
    "The vice president will attend Mitsotakis's address to a joint session of Congress.",
    " The Hill: Facing geopolitical pressure, chipmakers look to expand U.S. production.",
    "g? Introducing NotedDC, The Hill's curated commentary on the beat of the Beltway.",
    "Republicans, in turn, accused their critics, including Rep. Liz Cheney (R-Wyo.",
    "As a result, 10 people, most of them Black, are dead at a Buffalo supermarket.",
    " Hanna Trudo, The Hill: Democrats brace for uncertain House primary in Oregon.",
    "Biden often warns that white supremacy and America's democracy cannot coexist.",
    "Related Articles\n The Hill: Proposed New York maps create House battleground.",
    "The prime minister will also meet today with Speaker Nancy Pelosi (D-Calif.).",
    " Idaho Statesman: Rep. Mike Simpson (R-Idaho) says record speaks for itself.",
    "The gunman also placed four Molotov cocktail-like devices inside the church.",
    " The Hill: Five things to watch in North Carolina, Pennsylvania primaries.",
    " The Hill: President Biden's job approval hits another low in new survey.",
    "Ukraine is avoiding the word surrender? (Reuters and The New York Times).",
    "All 30 current NATO countries must agree to open the door to new members.",
    " Niall Stanage, The Memo: Democrats cross their fingers in Pennsylvania.",
    "Information about ordering by phone in multiple languages is HERE (NPR).",
    "She had floated under the radar for so long that no one attacked her.",
    "He said the heavily wounded? were getting medical help near Mariupol.",
    "https://on.wsj.com/3Nzde39\nWHERE AND WHEN\nThe House meets at 10 a.m.",
    " The Washington Post: Russian oligarchs loved luxe Sardinia, Italy.",
    "Virtual Event Invite\nThe Hill's Mental Health Summit, Today, 1 p.m.",
    " The Hill: Fetterman stroke throws curve into Pennsylvania primary.",
    " Politico: Trump works overtime to push Oz over the finish line.",
    "We invite you to join the discussion on Facebook and Twitter.",
    " The Hill: Here's why gasoline prices are spiking again.",
    "Outside observers are skeptical this can be done.",
    "Click here to subscribe to our latest newsletter.",
    "And inflation's still too high but coming down.",
    "Let's give Madison a second chance!? he added.",
    "Ukraine needs Ukrainian heroes to be alive.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Across the aisle, Pennsylvania Lt. Gov.",
    "Stay Engaged\nWe want to hear from you!",
    "Now they're frozen out of paradise.",
    "), of playing politics (The Hill).",
    "It's our principle,? he said.",
    "RSVP today.",
    "ET."
  ]
}