{
  "id": 3393,
  "mediaId": 25,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "2022 primaries: The statewide races to watch Tuesday",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/05/16/59103745-d20d-4962-9ade-d18654b28fbc/thumbnail/1240x826/71704ca3831f46eaccdd7045710ff0db/ap22125008425718.jpg",
  "link": "https://www.cbsnews.com/news/2022-primaries-pennsylvania-north-carolina-oregon-statewide-races/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster",
  "authorUrl": "",
  "termIds": [
    1896,
    3102
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n 2022 primaries: The statewide races to watch Tuesday\n Sen. Chris Van Hollen hospitalized after suffering \"minor stroke\" during speech\n John Fetterman, Pennsylvania lieutenant governor running for Senate, suffers stroke\n Pence campaigns for Kemp against Trump-backed primary challenger\n Florida's GOP-friendly congressional map thrown out by judge\n More\nIn:\nPennsylvania\nIdaho\nNorth Carolina\noregon\nKentucky\n Adam Brewster\nCBS News political reporter.",
    "Here are the key races to watch:\nPennsylvania\nRepublican Senate primary\n FILE: Kathy Barnette, Mehmet Oz, moderator Greta Van Susteren, Carla Sands, David McCormick, and Jeff Bartos, (left to right) pose for photo before they take part in a debate for Pennsylvania U.S. Senate Republican candidates, Wednesday, May 4, 2022, in Grove City, Pa. Keith Srakocic / AP\nPennsylvania has one of the hottest Senate races this fall.",
    "While the bitter battle between Oz and McCormick raged, Kathy Barnette, a conservative who former top Trump aide Steve Bannon characterized as \"ultra-MAGA,\" and who has spent months criss-crossing the state, has been ascending in the polls, and she nowfindes herself in the top tier of the race.",
    "Aimee Dilger/SOPA Images/LightRocket via Getty Images\nThat poll, along with a public poll from the Trafalgar Group and other private polling, raised concerns among some establishment Republicans that Mastriano could be a headache for Republicans in November if he's the nominee.",
    "Barnette's social media posts indicate she has held extremist views  she has attacked Islam and said that the religion \"should be banned\" in the U.S., and she has also falsely claimed in a number of tweets that former President Obama is Muslim.",
    "Pennsylvania Senate President Pro Tempore Jake Corman dropped out of the race on Thursday and threw his support behind Barletta, saying in a statement, \"the time has come for me to show leadership and support someone who can win in November.\"",
    "McCormick and other opponents have slammed Oz over past comments he made about abortion, including a 2019 interview with The Breakfast Club, when he said he was \"really worried about\" an Alabama law that amounted to a near-total abortion ban.",
    "Idaho\nIdaho's Republican gubernatorial primary features an intriguing matchup between the state's incumbent Governor Brad Little and Lieutenant Governor Janice McGeachin, who has Trump's endorsement and is running to the right of Little.",
    "\"I was there to hear my president speak and then I was invited to speak at two locations, exercising my constitutional rights and shame on the media and the Democrats for painting anyone down there as a villain,\" Mastriano said.",
    "Pennsylvania's Senate GOP primary race Tuesday features a tight three-way battle between two wealthy candidates who fiercely batttled for Trump's endorsement and a further right candidate who has been described as \"ultra-MAGA.\"",
    "The Republican primary has been incredibly expensive, with two headlining candidates worth tens of millions of dollars, and a more extreme candidate who has less money but has been surging in the final stretch of the race.",
    "Fetterman (Tom Williams/CQ-Roll Call, Inc via Getty Images), Kenyatta (AP Photo/Matt Rourke), Lamb (Andrew Harrer/Bloomberg via Getty Images)\nFetterman said Sunday that he is recovering after suffering a stroke on Friday.",
    "Barnette has also expressed antipathy toward LGBTQ people, saying in 2015, \"Two men sleeping together, two men holding hands, two men caressing, that is not normal,\" according to reporting by CNN's KFile.",
    "The committee said it wanted information from Mastriano about a plan to \"arrange for an alternate slate of electors\" and his public statements that suggested he was \"present during the attack on the U.S.",
    "On the issues, the candidates share similar views, including expanding Pennsylvania's natural gas industry, eliminating the state's no-excuse mail-in voting law and adding new restrictions on abortion.",
    "North Carolina\nSenate\n FILE: Rep. Ted Budd, R-N.C., does a television news interview outside the Capitol before the vote on the George Floyd Justice in Policing Act of 2020 on Thursday, June 25, 2020.",
    "Janice McGeachin Little (Jim Watson/AFP via Getty Images); McGeachin (Otto Kitsinger/AP)\nLast May, McGeachin issued an executive order banning mask mandates in schools and public buildings.",
    "FILE: Cheri Beasley, a Democratic U.S. Senate candidate, speaks with Leonardo and Zweli Williams, co-owners of Zwelis, a Zimbabwean restaurant, in Durham, North Carolina on July 7, 2021.",
    "Fetterman has brushed aside some of those concerns  at the same debate, he countered, \"I'm the only candidate on this stage or on the Republican side who has won a statewide election.\"",
    "In his final debate remarks, Oz said Trump picked him because \"he felt I was the most capable of doing what we have to do as a party: carry populations that have forgotten about us.\"",
    "The other candidate in the race, Ada County Clerk Phil McGrane, acknowledged Biden's win, saying during that debate that \"Joe Biden was elected president during the (2020) election.\"",
    "Governor\nPennsylvania Democratic Governor Tom Wolf is term-limited, creating an open seat that Republicans are hoping to flip to help them tighten their grip on power in Harrisburg.",
    "The race had appeared to be relatively close between Budd and McCrory, but recent polling from Emerson and Trafalgar showed Budd up by more than 20 points over the former governor.",
    "After losing Pennsylvania's Trump endorsement sweepstakes, McCormick released an ad featuring Fox News host Laura Ingraham saying \"it was a mistake (for Trump) to endorse Oz.\"",
    "Thirty-seven percent of respondents in that Fox News poll said Trump's endorsement made them more supportive of Oz, while the same percentage said it had no effect on them.",
    "Former Pennsylvania Congressman Tom Marino, who was an early supporter of Trump in 2016 and has backed Barletta in the primary, criticized Trump's endorsement of Mastriano.",
    "A Fox News poll released last week found state Senator Doug Mastriano, who has resonated with base Republican voters and was endorsed by Trump, leading the field with 29%.",
    "The race has also revived a 2013 incident when Fetterman, as mayor of Braddock, Pennsylvania, grabbed a shotgun and chased down a man after what he thought was a shooting.",
    "It's one of several closely watched races Tuesday, which will finalize general election matchups in two major battleground Senate races: North Carolina and Pennsylvania.",
    "Oz's Turkish citizenship was also a flashpoint at multiple points during the campaign, but he said in March that he would renounce his Turkish citizenship if elected.",
    "\"She was tested in the last 24 months in a congressional seat, but she lost by 20 points,\" McCormick told CBS News after an event in Lititz, Pennsylvania, on Friday.",
    "They entered the race after Sean Parnell, the candidate who first won Trump's endorsement for the Senate seat, dropped out of the race after losing a custody battle.",
    "When pressed about his past statements on abortion at a recent debate, Oz said he's proud to have an endorsement from his mother-in-law, who is an ordained minister.",
    "But in a sign that McCormick understands Trump's influence, another ad featured a clip of Trump complimenting McCormick, followed by photos of the two men together.",
    "Barnette has raised $1.8 million during the primary campaign, a fraction of the $11 million that McCormick and $12 million that Oz have poured into their campaigns.",
    "When Little traveled to Texas in October, McGeachin signed an executive order related to preventing businesses from requiring employees to get the COVID-19 vaccine.",
    "Two of the three Republican candidates running to be Idaho's chief elections officer have falsely claimed that President Biden didn't fairly win the 2020 election.",
    "Fetterman, who supported Senator Bernie Sanders' presidential bid in 2016, refutes critics who say he's too progressive to win the general election in November.",
    "Mastriano was a loyal supporter of Trump's 2020 campaign and a vocal opponent of COVID restrictions and mandates, giving him credibility with base Republicans.",
    "Tuesday's voting is also expected to provide insights into the direction Democratic candidates will be taking in the general election campaign before November.",
    "Lieutenant Governor John Fetterman has been the frontrunner for much of the race against Representative Conor Lamb and state Representative Malcolm Kenyatta.",
    "\"He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it,\" Trump wrote in his statement.",
    "He supports a $15-per-hour minimum wage, bashes the filibuster and wants to lower the Medicare eligibility age and add vision, dental and hearing coverage.",
    "\"I'm the only one standing in front of you tonight who has ever beaten a Republican in a head-to-head situation like this,\" Lamb said at an April debate.",
    "In his pitch to voters at the last debate, McCormick highlighted his childhood roots in Pennsylvania and said he's been \"'America first' my entire life.\"",
    "But she also received a boost last week from the Club for Growth, which placed at least $2 million in advertisements backing her, according to AdImpact.",
    "In early March, when polling was closer, Trump told donors at a Republican National Committee retreat that he wanted to get Walker \"out of that race.\"",
    "Trump went to North Carolina to rally for Budd in April, calling him \"an unrelenting champion for your North Carolina values and for America First.\"",
    "\"In the end, it confirms so many people's suspicions that there is a political establishment that tries to pick winners and losers,\" Mastriano said.",
    "Ben Hasty/MediaNews Group/Reading Eagle via Getty Images\nPennsylvania Attorney General Josh Shapiro is running unopposed for his party's nomination.",
    "\"Senator Mastriano has appeal to base Republicans but I fear the Democrats will destroy him with swing voters,\" she said in a statement on Facebook.",
    "\"I support whatever means gets us there, whether that's the Affordable Care Act, whether that's the public option, whether that's Medicare for All.\"",
    "Idaho, Kentucky and Oregon are also holding primaries that are the next tests of former President Trump's influence over Republican primary voters.",
    "Allison Lee Isley/The Washington Post via Getty\nDemocrats are expected to nominate former North Carolina Supreme Court Chief Justice Cheri Beasley.",
    "He recounted operating on newborns and said, \"I would never think of harming that child or nine months earlier because life starts at conception.\"",
    "Trump on Thursday issued a statement urging Pennsylvanians not to vote for Barnette, an indication that candidates are taking her rise seriously.",
    "He also said that he wouldn't \"want anyone in my family to have an abortion,\" but added, \"I don't want to interfere with everyone else's stuff.\"",
    "Little repealed the order about 24 hours later, calling it an \"irresponsible, self-serving political stunt,\" according to the Associated Press.",
    "Barletta and McSwain said at a recent debate that they would allow exceptions for abortion in the case of rape, incest or the mother's health.",
    "Trump endorsed Oz in April and came to Pennsylvania for a rally on March 6, where Trump called McCormick a \"liberal Wall Street Republican.\"",
    "Trump endorsed Mastriano days before the primary, citing his support for Trump's baseless claim that the 2020 election was stolen from him.",
    "Little never issued a statewide mask or vaccine requirement but did have a temporary stay-at-home order in the early days of the pandemic.",
    "Democratic Senate primary\nPennsylvania is one of the only battleground Senate races that has a competitive primary on the Democratic side.",
    "Television personality Dr. Mehmet Oz and former hedge fund manager Dave McCormick have spent millions attacking each other on television.",
    "Bill Clark/CQ-Roll Call, Inc via Getty Images\nRepresentative Ted Budd was the first non-incumbent Senate Republican who Trump endorsed.",
    "Moon and state Senator Mary Souza said at a recent debate that Mr. Biden didn't win that election, according to the Idaho Capitol Sun.",
    "He was followed by former Representative Lou Barletta (17%), former U.S. Attorney Bill McSwain (13%) and businessman Dave White (11%).",
    "State Representative Dorothy Moon signed on to a letter from an Arizona lawmaker calling for a \"50-state audit\" of the 2020 election.",
    "Fetterman tweeted a statement saying doctors were able to remove the clot, reversing the stroke and \"got my heart under control.\"",
    "On the debate stage, Fetterman said that the people of Braddock knew his character and chose to reelect him after that happened.",
    "He has campaigned on keeping the veto pen in Democratic hands to block attempts to restrict abortion or roll back voting access.",
    "\"I am very disappointed in the former president, because apparently the loyalty doesn't go as far as he says his loyalty does.\"",
    "In Idaho, when the governor leaves the state, the lieutenant governor serves as acting governor and can issue executive orders.",
    "\"He is a fighter like few others, and has been with me right from the beginning, and now I have an obligation to be with him.\"",
    "He has pushed back against some of the Biden administration's COVID-related policies and touted cutting taxes and regulations.",
    "Reporters, including CBS News' Robert Costa, were banned from attending by guards, with no explanation from either campaign.",
    "And although Trump endorsed Oz, Barnette said at an April debate that Trump doesn't have a monopoly on the MAGA movement.",
    "Winning the primary and losing the general because the candidate is unable to get the voters in the middle, isn't a win.\"",
    "After the election, Mastriano organized a hearing in Gettysburg that featured unsubstantiated claims of widespread fraud.",
    "\"Dr. Oz is the only one who will be able to easily defeat the Crazed, Lunatic Democrat in Pennsylvania,\" Trump said.",
    "2022/05/13: Far Right candidate for Pennsylvania Governor Doug Mastriano speaks to his supporters in Wilkes-Barre.",
    "McCormick has alleged that Oz isn't a true conservative, based on his past statements about issues like abortion.",
    "An Emerson poll released on Sunday showed Oz leading with 28% followed by Barnette at 24% and McCormick at 21%.",
    "Democrats hope she has a shot at picking up the seat being vacated by retiring Republican Senator Richard Burr.",
    "On two separate occasions, while Little was out of the state, McGeachin issued COVID-related executive orders.",
    "Lamb has argued that Fetterman has taken positions that are out of line with key swing voters in Pennsylvania.",
    "During that event, Trump's daughter-in-law Lara Trump said that she wouldn't run for the state's Senate seat.",
    "FILE: Reading, PA - April 13: Pennsylvania Attorney General Josh Shapiro speiaks during the press conference.",
    "He was subpoenaed in February by the House Select Committee investigating the Jan. 6 attack at the Capitol.",
    "Real estate developer Jeff Bartos and former Trump Ambassador to Denmark Carla Sands are also in the race.",
    "She has also said that she wants to ban vaccine and mask mandates and expand Second Amendment protections.",
    "When he returned, Little rescinded that order, too, saying McGeachin had acted \"without legal authority.\"",
    "Budd is running against former North Carolina Governor Pat McCrory and former Representative Mark Walker.",
    "The former president made the surprise announcement in his return to the political stage in June 2021.",
    "In that interview, Oz said a fetus has \"electrical changes at six weeks, but the heart's not beating.\"",
    "\"He is absolutely the candidate of special interests and globalists and the Washington establishment.\"",
    "Oz has used that rally in some of his advertising to remind voters that he's Trump's chosen candidate.",
    "A Fox News poll released last week showed Oz, McCormick and Barnette in a statistical three-way tie.",
    "Barnette has not shied away from attacking Oz and McCormick when the candidates have shared a stage.",
    "He says his experience winning three difficult House races proves he's the most electable candidate.",
    "Both McCormick and Oz have warned that Barnette could be a risky bet for the party in November.",
    "Oz led the field with 22%, followed by McCormick at 20% and Barnette at 19% and 18% undecided.",
    "Both men have been criticized by their opponents for only recently returning to Pennsylvania.",
    "\"Condemning all of those people that did nothing wrong, that's an injustice to our freedom.\"",
    "Another top Republican in the state Senate, floor leader Kim Ward, backed White last Monday.",
    "Mastriano brushes off these concerns, telling WHTM last week that \"it helps\" his campaign.",
    "Republican Senator Pat Toomey is retiring and Democrats are hoping they can flip the seat.",
    "\"Every time she answers a question, she raises a bunch more questions,\" Oz told CBS News.",
    "Beasley lost her bid to stay on the state Supreme Court in November 2020 by 401 votes.",
    "It was not exactly a high-turnout race he received 186 votes in the primary election.",
    "She held a rally Saturday with leading GOP gubernatorial candidate Doug Mastriano.",
    "At a recent debate, Lamb asked Fetterman whether he supports \"Medicare for All.\"",
    "\"I support healthcare as a basic fundamental human right,\" Fetterman responded.",
    "John Fetterman, Pennsylvania state Rep. Malcolm Kenyatta, U.S. Rep. Conor Lamb.",
    "Her most credible opponents dropped out of the race as the campaign progressed.",
    "\"A vote for anyone else in the Primary is a vote against Victory in the Fall!\"",
    "The jogger said Fetterman pointed the gun at him, but Fetterman denies it.",
    "In a debate last month, Mastriano defended being in Washington on Jan. 6.",
    "Kenyatta has asked Fetterman to apologize for his role in that incident.",
    "\"She's not transparent about so many aspects of her basic biography.\"",
    "\"He may be a nice guy, but he's not MAGA,\" Trump said at the rally.",
    "\"Sadly, in the Republican establishment, they tend to pick losers.\"",
    "McGeachin has falsely claimed that the 2020 election was stolen.",
    "\"And everywhere I go, the voters are zeroed in on key questions.",
    "It was President Trump who shifted and aligned with our values.\"",
    "He said doctors told him he didn't suffer any cognitive damage.",
    "He added that she \"certainly understands that I'm pro-life.\"",
    "he said according to a video obtained by The New York Times.",
    "Fetterman says he considers healthcare to be a human right.",
    "\"MAGA does not belong to President Trump,\" Barnette said.",
    "Oz has hit McCormick over his business dealings in China.",
    "When Oz asked at a forum \"why is everyone attacking me?\"",
    "Our values never shifted to President Trump's values.",
    "The person turned out to be an innocent Black jogger.",
    "At a debate in May she called both men \"globalists.\"",
    "Trump won North Carolina in 2020 by 1.3 points.",
    "Cook Political Report rates it lean Republican.",
    "Several other candidates are also in the race.",
    "Barnette exclaimed \"because you're a liberal.\"",
    "The two have been at odds over the past year.",
    "Mastriano and White said they would not.",
    "\"Where in the hell is the loyalty?\"",
    "Who can win this general election?\"",
    "\"The goal isn't to win the primary.",
    "Who shares my conservative values?",
    "The Republican field is crowded.",
    "\"MAGA belongs to the people.",
    "Brad Little; Idaho Lt.-Gov.",
    "L-R: Pennsylvania Lt. Gov.",
    "L-R: Idaho Gov.",
    "Capitol.\"",
    "Twitter"
  ]
}