{
  "id": 3401,
  "mediaId": 151,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Clarence Thomas speaks",
  "image": "https://www.politico.com/dims4/default/09d2f63/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F9f%2Fbd%2F846d9b214cb39ff38d64c29263bc%2F20220328-clarencethomas-ap-773.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/05/14/clarence-thomas-speaks-00032535",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    680,
    812,
    982,
    1501,
    1765,
    2095,
    2182,
    2373,
    3102,
    4246,
    403,
    2744
  ],
  "sentences": [
    "Pic\nHAPPY BIRTHDAY: Mark Zuckerberg  Reps. Jackie Speier (D-Calif.) and Gary Palmer (R-Ala.)  Tom Donilon of OMelveny & Myers  former Sen. Byron Dorgan (D-N.D.), now at Arent Fox  J.B. Poersch of Senate Majority PAC  Susie Wiles  ABCs Karen Travers and Alexandra Svokos  CNNs David Gelles  POLITICOs Carly Sitrin, David Guide and Emily Golden  Sam Newton  Jon Vogel of MVAR Media  Sydney Thomas of the Joint Economic Committee  College to Congress Audrey Henson  Aneiry Batista ... former Reps. Erik Paulsen (R-Minn.), Mimi Walters (R-Calif.) (6-0) and Alan Mollohan (D-W.Va.) ... Cassie Scher of Rational 360... Elizabeth Kilgallin Harnik ... Bloombergs Josh Eidelson  Robert Levinson  Jesse Meisenhelter ... Kara Allen ... Judith Barnett  Brian Canfield  Todd Reid  Elizabeth Mulkey  former DHS Secretary Kirstjen Nielsen  Jill Stein  Howard Wolfson  Lenwood Brooks  Caleb Randall-Bodman of Rep. Adam Smiths office (D-Wash.)  Gavin Smith of the Inspyre Group (3-0)  Erwin Chemerinsky  Nellie Mitchell ... Samuel Greer\nTHE SHOWS (Full Sunday show listings here):\nFOX Fox News Sunday, guest-anchored by Shannon Bream: Oklahoma Gov.",
    "I wonder how long were going to have these institutions at the rate were undermining them and then I wonder when theyre gone or destabilized what we will have as a country and I dont think the prospects are good if we continue to lose them.\nKEYING IN ON THE KEYSTONE STATE  New this morning: Trump endorsed Doug Mastriano in the Pa. governors race, a late boost for the far-right front-runner, by the Philly Inquirers Andrew Seidman\nA batch of good stories out today digging into the wild, must-watch GOP Senate primary Tuesday in Pennsylvania, where largely unvetted conservative commentator KATHY BARNETTE is mounting a late surge against celebrity doctor MEHMET OZ and hedge fund exec DAVID MCCORMICK:\n On what it will say about Trumps sway over the GOP: Trump is increasingly finding that his grip and ability to clear the field may be waning.",
    "PUTINS PRIVACY: Vladimir Putin, Family Man, by NYTs Jason Horowitz in Voorschoten, Netherlands: As Western nations place sanctions on people close to the Russian leader, including family members, the strict secrecy surrounding his private life is being punctured.\nCLICKER  The nations cartoonists on the week in politics, edited by Matt Wuerker  15 keepers\nGREAT WEEKEND READS, curated by Ryan Lizza:\n The Woman Who Killed Roe, by N.Y. Mags Kerry Howley: Marjorie Dannenfelsers single-minded pursuit of an end to abortion.\n How George Floyd Spent His Final Hours, by WaPos Robert Samuels and Toluse Olorunnipa\n As a Seismic Shift Fractures Evangelicals, an Arkansas Pastor Leaves Home, by NYTs Ruth Graham in Fort Smith, Ark.",
    "While its too early to compare the GOPs plight to the debacles in 2010 and 2012 that frittered away competitive Senate races, Burgess Everett reports, theres a rising sense of unease among party insiders that Republicans could end up with candidates who make a Senate takeover more difficult.\n On whether voters can separate Trump from Trumpism: In interviews with more than two dozen Republican voters in western Pennsylvania, many [voiced] ambivalence and uncertainty about Dr. Oz  despite Mr. Trumps backing, they view him with suspicion, call him too Hollywood and question his ties to the state.",
    "He had a stroke in his sleep Sunday night, according to his son Jonathan, a news industry veteran and former executive producer at both NBC News and MSNBC.\nOUT AND ABOUT  SPOTTED at the RNCs Mothers for Mary Prayer Breakfast, a celebration of the Feast Day of Our Lady of Fatima, at the Capitol Hill Club: Reps. Mariannette Miller-Meeks (R-Iowa), Ronny Jackson (R-Texas) and Alex Mooney (R-W.Va.), Newt and Callista Gingrich, Kellyanne Conway, Marjorie Dannenfelser, George Glass, Robert OBrien, Joe Grogan and Ashley Hayek.",
    "NEW NOMINEES  The White House announced several new nominees, including David Pressman as ambassador to Hungary, Heide Fulton as ambassador to Uruguay, Calvin Smyre as ambassador to the Bahamas, Yohannes Abraham as U.S. representative to ASEAN, Stacy Dean as undersecretary of Agriculture for food nutrition and consumer services, Alexis Taylor as undersecretary of Agriculture for trade and foreign agricultural affairs and Laura Taylor-Kale as assistant secretary of Defense for industrial base policy.",
    "Those Republicans  said they were instead voting for or considering voting for Kathy Barnette, the far-right author and conservative-media commentator who has surged in the polls on a shoestring budget, NYTs Jennifer Medina reports from Laughlintown, Pa.\nIn a race that could determine control of the Senate, many Republicans in the state find themselves deeply devoted to Mr. Trump yet, at the same time, less swayed by his guidance.\nGood Saturday morning.",
    "Now its at war with itself.\n The inside story of Chernobyl during the Russian occupation, by Wendell Steavenson with Marta Rodionova for The Economists 1843 Magazine: Staff were trapped between two sources of volatility: enemy soldiers and radioactive waste.\n The Untold Story of the White Houses Weirdly Hip Record Collection, by Washingtonians Rob Brunner: Jimmy Carters grandson is unlocking its mysteries.\n Butt Lifts Are Booming.",
    "A family friend, Bill Greener, said the death stemmed from an unspecified previous lung condition.\n Richard Wald, former NBC News president and ABC News executive, dies at 92, by NBCs Daniel Arkin: Richard Wald, a respected television executive who served as president of NBC News in the 1970s, helped steer coverage at ABC News for decades and taught media industry practices at Columbia Journalism School, died Friday.",
    "Susan Collins (R-Maine), Tina Smith (D-Minn.), Joni Ernst (R-Iowa), Amy Klobuchar (D-Minn.) and Debbie Stabenow (D-Mich.), Reps. Pete Aguilar (D-Calif.), Gary Palmer (R-Ala.), Buddy Carter (R-Ga.), Val Demings (D-Fla.), Nikema Williams (D-Ga.), Cheri Bustos (D-Ill.), David Cicilline (D-R.I.), Joe Morelle (D-N.Y.), Deborah Ross (D-N.C.), Scott Peters (D-Calif.), Ashley Hinson (R-Iowa), Jamie Raskin (D-Md.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    " Mr. Woods, 38, is a vice president for policy, research, and membership at the Pharmaceutical Research and Manufacturers of America  The couple married April 23 at the Yale Club of New York City.\nWELCOME TO THE WORLD Jason Resendez, president and CEO of the National Alliance for Caregiving, and Brian Pierce, a teacher at Center City Public Charter School, recently welcomed Felix.",
    "ENGAGED  Suzanne Kianpour, a longtime BBC foreign affairs and political journalist now working on a BBC documentary she's hosting and season two of the \"Women Building Peace\" podcast she hosts, and Jamie Angus, outgoing senior controller of BBC News, announced their engagement in London at a boat dinner party on Friday night with friends and colleagues.",
    "IN MEMORIAM  Robert C. McFarlane, Top Reagan Aide in Iran-Contra Affair, Dies at 84, by NYTs Neil Lewis: Robert C. McFarlane, a former decorated Marine officer who rose in civilian life to be President Ronald Reagans national security adviser and then fell from grace in the Iran-contra scandal, died on Thursday in Lansing, Mich.",
    "The White House, meanwhile, is scrambling to help ramp up production while fellow Democrats in Congress are raising potential antitrust concerns about the infant formula sector, which is dominated by four companies. Related read: GOPs new midterm attack: Blaming Biden for formula shortage, by APs Paul Weber\n3.",
    " Even after the bleeding stops, stock market investors, who include more than 50 percent of Americans, could face years of relatively meager returns that will leave them with substantially less money to pay for their childrens college education and support themselves in retirement, NYTs Michael Corkery writes.",
    "), Jennifer Bendery, Seung Min Kim, Kevin Corke, Caroline McKee, Mark Lima, Nikole Killian, Robert Costa, Rebecca Kaplan, Manu Raju, Kristin Wilson, Amanda Terkel, Igor Bobic, Jennifer Haberkorn, Kimbrill Kelly, Jeff Dufour, Josh Kraushaar, Tamara Keith, Deirdre Walsh, Mary Bruce, Rick Klein and Rachel Scott.",
    "In several cases, some of Trumps own Cabinet members and advisers, along with other longtime allies in the Republican Party, are working or stumping for candidates running against Trump-endorsed candidates. In Pennsylvania, Trumps former Secretary of State MIKE POMPEO and Sen. TED CRUZ have backed McCormick.",
    "THE CRYPTO CAMPAIGNS: Some candidates in the midterm elections are experimenting with NFTs to help raise money and spark interest in their campaigns, following the lead of artists as well as big consumer brands, even as the broader market for such items has cooled, WSJs Teresa Mettela writes.",
    "Zelensky said on his Instagram account that the visit is a strong signal of bipartisan support for Ukraine from the United States Congress and the American people. Also seen meeting [Zelenskyy] in video and photographs on the president's official social media accounts are Republican Sens.",
    " SPOTTED at the Washington Press Club Foundations 76th Annual Congressional Dinner on Wednesday night: HUD Secretary Marcia Fudge, Speaker Nancy Pelosi, Senate Majority Whip Dick Durbin (D-Ill.), House Majority Leader Steny Hoyer, House Assistant Speaker Katherine Clark (D-Mass.",
    "POLITICO Playbook: Clarence Thomas speaks\nBy GARRETT ROSS\n05/14/2022 10:11 AM EDT\nPresented by\nDRIVING THE DAY\nMCCONNELL VISITS UKRAINE  Senate Minority Leader MITCH MCCONNELL led a delegation of Senate Republicans to Kyiv to meet with Ukrainian President VOLODYMYR ZELENSKYY.",
    "PROGRESSIVES PLIGHT: Progressive Dems are finding themselves set back on their heels across the map  in a heavily contested Pennsylvania House primary, but also in hotly contested primaries in other states  battered by millions of dollars pouring in from outside interests.",
    "Healing Is No Joke, by Sandra Garcia for NYT Magazine: Beauty, pain, race and money play out in Miamis post-surgical recovery houses.\nPLAYBOOKERS\nJeff Bezos took to Twitter to criticize the president, his new Disinformation Board and inflation.",
    "From Nebraska and Idaho to Pennsylvania and Georgia, Republicans have been actively campaigning  or quietly maneuvering  against Trumps picks in a way that could undermine his sway over the party, WaPos Michael Scherer and Josh Dawsey write.",
    "Video of the visit, via Christopher Miller\nTREMENDOUSLY BAD  Supreme Court Justice CLARENCE THOMAS, a man of few words from the bench, did not hold back Friday about the publication of a draft opinion that would strike down Roe v. Wade.",
    "Republicans are blaming President Joe Biden for the shortage, claiming its part of the fall-out from his economic policies  and that his administration was too slow to act when problems with the formula supply first materialized.",
    "Members of the select committee declined to say whether they had also subpoenaed telecom companies to obtain the phone and email records of the GOP lawmakers  a step theyve taken with dozens, if not hundreds, of other witnesses.",
    "SPOTTED: David Rhodes, Yalda Hakim, Gordon Corera, Jake Cusack, Sam McAlister, Sodaba Haidare, Victoria Wakely, Jim Naughtie, John Humphrys, Ian Sherwood, Jo Carr, Liz Gibbons, Vara Szajkowaki, Aleem Maqbool and Ed Foy.",
    "HOW WE GOT HERE: The NYT a harrowing look at the United States steady march to 1 million Covid deaths, a grim milestone that the country passed this week: How America Lost One Million People\n2.",
    "THE BIG ISSUE:Helena Bottemiller Evich and Meredith Lee have the download on the national shortage of infant formula that has grown over months to become the issue in Washington this week.",
    "I do think that what happened at the court is tremendously bad, Thomas declared during a discussion at a conference for Black conservatives in Dallas, per our colleague Josh Gerstein.",
    "WHERE ARE THE WEAPONS: The U.S. is preparing to deliver more military supplies to Ukraine in the coming days and weeks, once Biden signs off on a new multibillion-dollar aid package.",
    "The overall value of those funds cant be determined as values are reported in ranges. WSJs Alex Leary has more, including figures from first lady JILL BIDEN and VP KAMALA HARRIS\n5.",
    "Its a sign of the fierce intraparty competition on a playing field opened up by redistricting and more than 30 Democratic House retirements across the nation, David Siders reports.",
    "Biden disclosed a modest $29,500 income from book sales and reported numerous other assets, including several bank accounts with holdings up to $500,000, and investment funds.",
    "But what remains unclear is Washingtons ability to keep track of the powerful weapons as they enter one of the largest trafficking hubs in Europe, WaPos John Hudson writes.",
    "Then came Trump and everything after.\n How Politics Poisoned the Evangelical Church, by The Atlantics Tim Alberta: The movement spent 40 years at war with secular America.",
    " On Senate Republicans electability dilemma: McConnell has given his lieutenants a clear marching order: Embrace electable candidates who can reclaim the majority.",
    "Ukraines illicit arms market has ballooned since Russias initial invasion in 2014, buttressed by a surplus of loose weapons and limited controls on their use.\n7.",
    "CBS Face the Nation: Transportation Secretary Pete Buttigieg  Mark Esper  Scott Gottlieb  Lloyd Blankfein  Robert Costa reporting from Pennsylvania.",
    "Playbook couldnt happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Bethany Irvine, Eli Okun and Garrett Ross.",
    "BEHIND THE SUBPOENAS: The striking subpoenas that were issued to House GOP lawmakers this week are shrouded in a bit of secrecy.",
    "And they wouldnt specify whether the subpoenas demand their Republican colleagues documents, in addition to their testimony.\n4.",
    "He most recently was a manager of government affairs at the Consumer Technology Association, and is a Mitch McConnell alum.",
    "), Dina Titus (D-Nev.), Michael Burgess (R-Texas), Stephanie Bice (R-Okla.), Dean Phillips (D-Minn.) and Jason Smith (R-Mo.",
    "THE VIEW FROM WALL STREET: During the height of the pandemic, the stock market seemed to buck all conventional wisdom.",
    "You can find me on email here, or get in touch with the rest of the team: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "MSNBC The Sunday Show: Rachel Bitecofer  Eric Holder  Glenn Kirshner  Rep. Joe Neguse (D-Colo.)  Alfre Woodard.",
    "Now, after six consecutive weeks of market losses, it appears that the high-wire act may be coming to an end.",
    "And there are fears that Barnette  and a handful of contenders in other states  could blow winnable races.",
    "It's unclear whether the meeting took place Saturday and whether the delegation is still in Kyiv, per CNN.",
    "And even his former VP, MIKE PENCE, is embracing one of Trumps biggest political targets in Georgia Gov.",
    "Smith, 38  is currently pursuing a second masters degree in health systems administration at Georgetown.",
    "CNN Inside Politics: Panel: Astead Herndon, Margaret Talev, Asma Khalid, Alex Burns and David Sanger.",
    "Very little is known about the scope or contents of the requests, Kyle Cheney and Nicholas Wu report.",
    "A PEEK INSIDE BIDENS WALLET: The White House released Bidens financial disclosure forms on Friday.",
    "At the same time, the party apparatus has adopted a posture of not picking favorites in primaries.",
    "The couple, who have been friends for years, will be celebrating with D.C. friends next month.",
    ": Kevin Thompson thought he would lead his hometown church for the rest of his life.",
    "Mr. McFarlane, who lived in Washington, was visiting family in Michigan at the time.",
    "Panel: Michigan state Sen. Mallory McMorrow, Mia Love, Paul Begala and David Urban.",
    "The upshot: The GOP has little control over who emerges as their standard bearer.",
    "She previously was a legislative assistant for the Congressional Western Caucus.",
    "The market stayed high even when the collective spirit of the country plummeted.",
    "NBC Meet the Press: Panel: Matt Bai, Al Cardenas, Susan Page and Ashley Parker.",
    "TRANSITIONS  Na Eng is now chief comms officer at People for the American Way.",
    "ABC This Week: Speaker Nancy Pelosi  Ukrainian Deputy PM Olga Stefanishyna.",
    "Send Playbookers tips to playbook@politico.com or text us at 202-556-3307.",
    "SUSAN COLLINS of Maine, JOHN BARRASSO of Wyoming and JOHN CORNYN of Texas.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n9 THINGS WE READ THAT STUCK WITH US \n1.",
    "Melania Trumpsat for her first interview since leaving the White House.",
    "Peter Doocywished Jen Psaki well as she steps down as press secretary.",
    " Makenzie Shellnutt is joining NTCA as director of government affairs.",
    " Quentin Scholtz will be federal government relations manager at HP.",
    "Panel: Charles Hurt, Guy Benson, Catherine Lucey and Mo Elleithee.",
    "BIDENS SATURDAY: The president has nothing on his public schedule.",
    "Panel: Chris Christie, Donna Brazile, Molly Ball and Julie Pace.",
    "She most recently was comms director at the McKnight Foundation.",
    "CNN State of the Union: Speaker Nancy Pelosi  Nebraska Gov.",
    "Pic\nWEDDING  Ryan Smith and Scott Woods, via NYT: Mr.",
    "Pete Ricketts  Finland President Sauli Niinist.",
    "Did someone forward this email to you?",
    "Jared Polis  Kathy Barnette.",
    "Thanks for reading Playbook.",
    "Kevin Stitt  Colorado Gov.",
    "Sign up here.",
    "BRIAN KEMP.",
    "He was 84.",
    "He was 92.",
    "), Sens.",
    "8.",
    "9.",
    "6."
  ]
}