{
  "id": 3407,
  "mediaId": 323,
  "date": "d2022-05-17T09:30",
  "headline": "Pennsylvania Senate GOP Contest Headlines Crucial Slate of Primaries",
  "image": "https://images.wsj.net/im-545496/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/pennsylvania-senate-gop-contest-headlines-crucial-slate-of-primaries-11652779802",
  "sentiment": "0.523",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Zitner",
  "authorUrl": "https://www.wsj.com/news/author/aaron-zitner",
  "termIds": [
    1147,
    1653,
    2087,
    2303,
    2491,
    3102,
    146,
    428,
    571,
    2862
  ],
  "sentences": [
    "Brad Little is seeking a second term, but Mr. Trump has endorsed his challenger, the current lieutenant governor, Janice McGeachin, who has called herself an early supporter of Mr. Trump's first presidential campaign and practiced a controversial style of politics, twice issuing executive orders to loosen Covid-19 regulations while Mr. Little was out of the state.",
    "Mr. Fetterman, who is 52 years old, said over the weekend that doctors informed him that he didn't suffer cognitive damage from his stroke and that he was on my way to a full recovery.? His campaign said Monday that he would remain hospitalized through Election Day and wouldn't attend a Tuesday night party to watch the voting results.",
    "Josh Shapiro, the state's attorney general, is unopposed for the Democratic nomination, while state Sen. Doug Mastriano, a leading figure in pushing the state to review Mr. Biden's victory in the state's 2020 vote count over Mr. Trump, holds a lead in public opinion surveys for the GOP nomination over seven other candidates.",
    "In western Pennsylvania, state Rep. Summer Lee has been endorsed by the liberal group Justice Democrats in her bid for an open seat in the Pittsburgh area, as well as by Sen. Bernie Sanders and members of the squad'' of progressives in Congress, such as Reps. Ilhan Omar of Minnesota and Alexandria Ocasio-Cortez of New York.",
    "And contests in Kentucky include re-election bids by Sen. Rand Paul and Rep. Thomas Massie, both iconoclastic Republicans who have at times halted or voted against efforts to speed support to Ukraine in its defense against Russian invasion, arguing that the measures risk escalating the war or wasting U.S. tax dollars.",
    "Mr. Greiner, a Trump supporter, said he was puzzling over how to weigh the former president's endorsement of Mr. Oz, given that Mr. Trump had also endorsed state Sen. Doug Mastriano in the Republican primary for governorand that Mr. Mastriano had endorsed Ms. Barnette for the Senate nomination over Mr. Oz.",
    "Mr. Cawthorn, who is now running in a different district, has since made a series of headline-grabbing missteps, such as twice having a gun confiscated at an airport, and has said that House colleagues had used drugs and invited him to an orgy, assertions that House GOP leadership denounced as untrue.",
    "Her leading opponent, Steve Irwin, a lawyer who led the Pennsylvania Securities Commission, is backed by a number of longtime Democratic officeholders, among them Rep. Mike Doyle, who holds the seat now, and Rich Fitzgerald, the county executive of Allegheny County, which includes Pittsburgh.",
    "Voters in five states are casting ballots in primary elections on Tuesday, with several contests providing the latest tests of former President Donald Trump's influence within the Republican Party and others offering Democrats a choice between their party's liberal and centrist wings.",
    "The most prominent on Tuesday is the Senate race in Pennsylvania, where the former president waded into a GOP primary that had seemed to narrow into a contest between Messrs. Oz and McCormick, both wealthy candidates who have built resumes stocked with professional success.",
    "In the Republican Senate primary, polls have found that a little-funded candidate, conservative commentator Kathy Barnette, has pulled within reach of two leading contenders who spent tens of millions of dollars and until recently dominated news coverage of the campaign.",
    "In North Carolina, polling shows Rep. Ted Budd, who has Mr. Trump's endorsement, holding a formidable lead over Pat McCrory, a former governor of the state, and others in a crowded GOP primary for the nomination to succeed Republican Sen. Richard Burr, who is retiring.",
    "But Ms. Barnette appears to be surging, thanks to her performance in a recent debate and to tens of millions of dollars in TV ads from the McCormick and Oz campaigns and their allies, much of it aimed at painting the opposing candidate as insufficiently conservative.",
    "The Pennsylvania Senate race likely offers Democrats their best opportunity to pick up a seat now held by a Republican, as the current officeholder, Sen. Pat Toomey, is the only Republican senator retiring in a state that President Biden carried in 2020.",
    "Those two candidates, celebrity surgeon Mehmet Oz and former hedge-fund manager David McCormick, and allied groups have been running TV ads and using public appearances in the final days of the race to raise questions about Ms. Barnette's electability.",
    "Everybody tries to bring up everybody's dirty laundry, and I'm trying to sort through what's accurate and what's false,'' said Rob Greiner, an undecided voter and nuclear plant security worker in York County, in the state's southeast.",
    "By tarnishing each other, the two campaigns created a lane for a third candidate to rise, said Joseph DiSarro, a Republican State Committee member and political science professor at Washington & Jefferson College in Washington, Pa.",
    "Mr. McCormick, who until recently led Bridgewater Associates, the world's largest hedge fund, was ahead in most publicly available polls until Mr. Trump endorsed Mr. Oz, star of the recently ended The Dr. Oz Show'' on television.",
    "Mr. Schrader has drawn protests from his party's liberal wing for several actions in the current Congress, including his vote in committee against a measure allowing the government to negotiate the price of prescription drugs.",
    "In Pennsylvania, Mr. Fetterman and his leading opponent, Rep. Conor Lamb, agree on most issues but have struck different profiles, with Mr. Fetterman aligning more with progressives and Mr. Lamb with centrists.",
    "Party leaders have been even further splintered in their endorsements, as Mike Pompeo, the former secretary of State under Mr. Trump, backed Mr. McCormick in the Senate race, as did Sen. Ted Cruz (R., Texas).",
    "Mr. Schrader said that provision, which was part of the Democrats' package of spending on social programs and efforts to reduce climate change, would die in the Senate, and he proposed an alternative.",
    "Mr. Cawthorn dismissed the criticism as attacks from the political left, but several local groups and political leaders have endorsed his leading opponent in the eight-candidate primary field.",
    "In other highlights of Tuesday's primary elections, House races in Oregon and Pennsylvania will test the power of the Democratic Party's liberal wing to overtake centrist candidates.",
    "Pennsylvania is the scene of late drama as both parties prepare to select nominees for an open Senate seat in one of the nation's most politically competitive states.",
    "Many states also have competitive contests for state legislative seats, mayor's offices and other posts, including a race in Pennsylvania to succeed Democratic Gov.",
    "Mr. Trump on Monday said he still supported Mr. Cawthorn, saying in a social media post that the candidate had made foolish mistakes'' but deserved a second chance.",
    "Ms. McGeachin has also called for audits of the 2020 election results in all 50 states, despite Mr. Trump's lopsided, 30-percentage-point win in Idaho.",
    "Mr. Biden, in a rare endorsement, is backing Mr. Schrader, while several county Democratic groups in the district have endorsed Ms. McLeod-Skinner.",
    "Voters have said the negative ads left them confused, because they had little prior knowledge of the candidates to help them judge the claims.",
    "John Fetterman, said that he was recovering from a stroke that would keep him in the hospital at least through Election Day.",
    "The Senate is now divided 50-50, with Democrats controlling the chamber because Vice President Kamala Harris can break ties.",
    "Democratic voters in several races have a choice between candidates aligned with the party's centrist wing and liberal wing.",
    "In Oregon, Rep. Kurt Schrader, a member of the centrist group known as Blue Dog Democrats, is running for an eighth term.",
    "Idaho's Republican governor is defending his seat against a challenge from the state's Trump-backed lieutenant governor.",
    "He said it was unclear, however, that voters were ready to elevate Ms. Barnette from commentator and author to senator.",
    "Another Trump-backed candidate, Rep. Madison Cawthorn, is in a challenging race for the nomination for a House seat.",
    "Mr. Irwin would lower the age of eligibility for Medicare, a position identified with centrists in the party.",
    "Those and several other contests will test Mr. Trump's ability to shape the Republican Party's future.",
    "I'm trying to figure out who's best for Pennsylvania, and they're making it tough,'' Mr. Greiner said.",
    "In early 2021, he gave a complete and total'' endorsement to Mr. Cawthorn, a 26-year-old freshman.",
    "Ms. Lee backs the Green New Deal, Medicare for All and other elements of the progressive agenda.",
    "Eliza Collins, John McCormick and Natalie Andrews contributed to this article.",
    "Mr. Trump has endorsed dozens of candidates this year in addition to Mr. Oz.",
    "The Democratic race was shaken on Sunday when the front-runner, Lt. Gov.",
    "His challenger, Jamie McLeod-Skinner, is running to his political left.",
    "Critics said Mr. Schrader was too close to the pharmaceutical industry.",
    "Mr. Oz took the lead in many polls after the endorsement.",
    "He also has Mr. Trump's endorsement.",
    "Both orders were later reversed.",
    "Tom Wolf, who is term-limited.",
    "In Idaho, Republican Gov."
  ]
}