{
  "id": 3410,
  "mediaId": 129,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries",
  "image": "https://static01.nyt.com/images/2022/05/17/multimedia/17pol-whattowatch-photo/17pol-whattowatch-photo-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/live/2022/05/17/us/pa-primary-elections-nc",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    821,
    2303,
    3102,
    3103
  ],
  "sentences": [
    "We're losing our freedoms.?\nThe bitter intraparty contest between Ms. McGeachin and Mr. Little, set to be settled Tuesday in the state's primary election, reflects the intensifying split that is pitting Idaho's conventional pro-gun, anti-abortion, tax-cut conservatives against a growing group of far-right radicals who are agitating to seize control of what is already one of the most conservative corners of the Republican Party in the country.",
    "Wrenn said he didn't think transgender rights were a major issue in the primary because the top candidates most likely agree with McCrory's actions in 2016.\nObviously none of his opponents are attacking him for it in the primary,? Wrenn said, because if you attack Pat for what he did in the past, it would probably help him.?\n Blake & Leah\nIs there anything you think we're missing?",
    "At one debate, Dr. Oz, who has won Mr. Trump's endorsement, plaintively asked, Why is everyone attacking me?? Ms. Barnette shot back: Because you're a liberal.''\nThe Republican race, with five major candidates, has been dominated by nearly $40 million in television ads spent by the two early front-runners, Mr. Oz and Mr. McCormick, and their allies.",
    "They include Clay Aiken, an American Idol? runner-up; Valerie Foushee, a state General Assembly member; and Nida Allam, a Democratic up-and-comer armed with heavyweight endorsements from such progressives as Senator Elizabeth Warren of Massachusetts, Representative Alexandria Ocasio-Cortez of New York and Senator Bernie Sanders of Vermont.",
    "To a degree surpassing any other contest in the 2022 midterms so far, Donald Trump has poured his personal prestige into Pennsylvania's Republican Senate primary race, which is going through a final spasm of uncertainty as Kathy Barnette, an insurgent candidate with a sparse rsum, gives a last-minute scare to Trump's pick, Dr. Mehmet Oz.",
    "Ms. Barnette, on only a shoestring budget, vaulted into contention by emphasizing her personal story  she revealed she was born after her mother was raped at age 11, galvanizing anti-abortion voters  and by emerging as an alternative for Republicans unconvinced that Dr. Oz or Mr. McCormick were authentic conservatives.",
    "The current stalemate is plenty demoralizing, but if a Republican wins the governor's office, we're toast.?\nStill, dissatisfaction with the way things are seems to be particularly fervid among Republican voters, in part because of the traditional midterm recoil against the party that controls the White House.",
    "North Carolina is also holding primaries that will decide the fate of Representative Madison Cawthorn, who has been plagued by scandals and made many enemies among fellow Republicans, as well as whether Mr. Trump's support can lift a 26-year-old former football player and political novice in a House G.O.P.",
    "Mr. Cawthorn, who has seven challengers, has been in the news for all the wrong reasons: for possessing a firearm in an airport (again), for driving with a revoked license (again) and for being rebuked by House Republican leaders for his comments suggesting that lawmakers had used cocaine and held orgies.",
    "In the governor's race, Republicans aligned with the party establishment are desperate to stop Mastriano from winning the nomination, and have urged other candidates to unite around former Representative Lou Barletta, who is running for governor with the help of several former top Trump campaign aides.",
    "When the governor just simply says, I don't care what it is, I'm going to veto it,' you might as well not be in power.?\nAcross the state in the Philadelphia suburbs, Babs Klein, who has been active in Democratic politics since the 2016 election, voiced the same frustration  but from the other side.",
    "Senate primary in Pennsylvania in a statistical three-way tie between Dr. Mehmet Oz, the celebrity physician; David McCormick, a former hedge fund executive; and Kathy Barnette, a far-right commentator who has surged in the campaign's final days thanks to a compelling biography and sharp debating.",
    "Brad Little had worked in recent years to slash taxes and ban abortion, but for Ms. McGeachin and the hundreds gathered at a candidates' forum sponsored by the John Birch Society in late March, the governor was at cross purposes with their view of just how conservative Idaho could and should be.",
    "Who in the hell are they to determine what type of conservative I am??\nCarter Wrenn, a longtime Republican strategist in North Carolina, said the Club for Growth's spending might be the biggest factor in the Senate race, and he agreed with McCrory that the top issue for voters was inflation.",
    "Representative Mike Simpson's support for a $34 billion plan to remove four dams from the lower Snake River to help the threatened salmon population has pitted him against a familiar foe in the Second District primary: Bryan Smith, a challenger from the Republican Party's far-right flank.",
    "The problem for Republicans, however, is that there are so many candidates in the party appealing to this buffet of frustrations, from far-flung conspiracies about the 2020 elections to legitimate disagreements on energy policy, that very little consensus about the ticket has emerged.",
    "But it's an issue, if asked, I'll state where I am.?\nMcCrory's bid to replace Senator Richard Burr, who is retiring, has been complicated by the strength of Representative Ted Budd, who has support from both Trump and the conservative Club for Growth and seems to be leading the race.",
    "One veteran Republican operative in Pennsylvania who is not aligned with any Senate campaign likened McCormick to Hans Gruber, the villain in the movie Die Hard,? who tries to fire upward at Bruce Willis's character even as he is falling from the top of Nakatomi Plaza.",
    "In North Carolina, the Republican primary for Senate is the most prominent contest, though most eyes are likely to be elsewhere: on whether the explosively controversial Representative Madison Cawthorn, 26, will be renominated in his district in the state's far west.",
    "That gap has now been cut in half, partly driven by an accelerating surge of party-switching: For every Republican who re-registered as a Democrat in 2022, more than four voters switched the other way, a trend that holds in urban, suburban and rural counties.",
    "Mr. Simpson's campaign distributed a mailer with an altered photo of Mr. Smith in a #NEVERTRUMP hat, claiming that Mr. Smith had opposed Mr. Trump as the Republican presidential nominee during the party's national convention in 2016, The Idaho Press reported.",
    "In a follow-up interview, Marino said he hadn't been planning to endorse anyone in the race, but decided to back Barletta because he felt that Barletta had earned Trump's support by risking his career to throw his lot in with Trump early in the 2016 campaign.",
    "The turbulence also has major implications for Trump's hold on the party, which is growing more alarmed that the former president's involvement in primaries could scupper Republicans' chances of reclaiming the Senate despite President Biden's unpopularity.",
    "The anti-tax Club for Growth has brought millions of dollars in TV attack ads down on his head, accusing him of being a liberal faker.?\nThe presumptive Democratic nominee is Cheri Beasley, a former chief justice of the North Carolina Supreme Court.",
    "Or we're trying to anyhow.?\nPennsylvania and North Carolina usher in a particularly arduous stretch of the midterm election calendar, a crucible of bitter and costly primaries that will help determine control of Congress and governors' offices.",
    "Others were part of the backlash to state-ordered business closures and masking rules during the Covid-19 pandemic, a reaction that was both organic and fostered by conservative activists working on Facebook to reach voters across the state.",
    "Fearing that a Mastriano victory would put an unelectable hard-right nominee on the ticket, some prominent Republicans have coalesced in a Stop Mastriano effort behind Lou Barletta, a former congressman who appears second in most polls.",
    "Representative Conor Lamb, who won three races in districts thick with Trump supporters, has used that as a calling card to win the backing of many elected Democrats in the state, who believe he would be the most electable in November.",
    "A local pastor began the meeting with an invocation, asking for God to bless the American Redoubt  a movement to create a refuge anchored in northern Idaho for conservative Christians who are ready to abandon the rest of the country.",
    "Janice McGeachin regaled a crowd with stories of her feuds with the current governor, a fellow Republican, including the time when he briefly left the state and she issued a mutinous but short-lived ban on coronavirus mask mandates.",
    "In all but one of his 12 campaigns for Congress, Mr. Simpson has received at least 60 percent of the general election vote in the Second District, which encompasses eastern and central Idaho, including most of the capital, Boise.",
    "John Fetterman, suffering a stroke on Friday, plugged-in observers in both parties used words like gobsmacked? and stunned.?\nIt's just bang-bang crazy here,? said Christopher Nicholas, a Republican consultant based in Harrisburg.",
    "Mr. Smith, 59, a lawyer from Idaho Falls who unsuccessfully challenged Mr. Simpson in 2014, has been a staunch critic of the project, which he has contended will hurt grain growers in the region and increase electricity rates.",
    "PITTSBURGH  The run-up to the Democratic and Republican primaries in Pennsylvania on Tuesday has brimmed with intrigue, but there is some clarity about the general mood of the electorate: the state of the Commonwealth is sour.",
    "In a poll this month by Franklin & Marshall College, more than 40 percent of those surveyed said they were worse off financially than they were a year ago, and only one in four said the state was headed in the right direction.",
    "Mr. McCrory, whose conservative credentials include signing the infamous 2016 bathroom bill? that targeted transgender people  and drew a major backlash upon his state  is no longer conservative enough for some Republicans.",
    "John Fetterman, the front-runner for Pennsylvania's Democratic Senate nomination, is still recovering from a stroke in the hospital, but his wife, Gisele, has arrived at a polling site in their hometown of Braddock to vote.",
    "It's not clear how late-deciding Republicans will ultimately vote, although a new poll by Susquehanna University found that 45 percent of respondents who had made up their minds in the last few days? were backing Barnette.",
    "One of the first members of Congress to embrace Trump, former Representative Tom Marino of Pennsylvania, blasted the former president at a news conference this weekend for what he said was a lack of loyalty? to Barletta.",
    "Many of Trump's own voters have expressed skepticism of Oz, who has fended off millions of dollars in negative advertising highlighting his past Republican heterodoxies on issues as varied as abortion and gun rights.",
    "And while the public's anger over inflation and supply-chain disruptions is weighing in the G.O.P.'s favor, Democrats hope to compete in the fall against candidates they perceive as easier to defeat, like Barnette.",
    "contest for governor, is threatening to implode the state's Republican Party  with a blast radius that might be felt in states as far away as Arizona, Georgia and North Carolina over the coming weeks and months.",
    "In addition to selecting a nominee for governor, Republicans have been grappling with internal tensions and the influence of former President Donald J. Trump, who made a string of endorsements in House races.",
    "A late endorsement\nOn Saturday, Trump finally endorsed Doug Mastriano, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "The most hotly anticipated event so far in the 2022 primary season will unfold today in Pennsylvania, where voters of both parties will make crucial decisions in competitive races for Senate and governor.",
    "The leading candidates support ending abortion rights; some have amplified former President Donald J. Trump's lies about a stolen 2020 election; and all seek to persuade voters of their MAGA bona fides.",
    "The Democratic Senate primary in Pennsylvania has revealed that many Democratic voters, like their Republican counterparts, increasingly desire political brawlers and reject consensus-seeking centrists.",
    "And Val Foushee is the definition of a public servant, working in the community her whole life.?\nAccording to a recent report, Ms. Foushee is being backed by a handful of outside PACs and super PACs.",
    "Circle these dates:\nMay 24: Georgia\nGeorgia, which helped Democrats flip the Senate in 2021 and delivered a victory to Joseph R. Biden Jr. in 2020, features marquee contests for governor and Senate.",
    "The press paid very little attention to Barnette until the last two weeks,? said G. Terry Madonna, an expert on Pennsylvania politics who ran polling at Franklin and Marshall College for many years.",
    "National Democrats are watching the events in Pennsylvania closely, and many predicted that the results of Tuesday's contests would affect other Republican primaries for Senate in the weeks to come.",
    "As of Monday, Oz is leading by nearly three percentage points in the RealClearPolitics average of polls in the primary, which roughly matches the Oz campaign's latest daily tracking poll, I'm told.",
    "He chartered buses to the Jan. 6 protests in Washington and has made false claims of election fraud a central plank of his bid to lead a state that will be central to the 2024 presidential race.",
    "The approval rating of the governor, Tom Wolf, a Democrat finishing his second and final term, had fallen to 40 percent, and only a third ranked President Biden's performance as good or better.",
    "While Mr. Simpson and Mr. Smith have sparred over infrastructure and environmental stewardship, the candidates have also traded barbs in their primary race over who is more loyal to Mr. Trump.",
    "He's clearly upset that it's not going his way,? said David Urban, a political operative and early Trump backer who led the former president's efforts to win Pennsylvania in the 2016 election.",
    "For more than a decade, Republicans in Pennsylvania have been closing the party registration gap, which had ballooned to a Democratic advantage of 1.2 million voters in the early Obama years.",
    "Senator Ron Johnson, a Republican whose approval rating has cratered as television ads barrage him with criticism for casting doubts about Mr. Biden's election, is a top target of Democrats.",
    "The number to keep in mind is 30: The top finisher in North Carolina primaries must gain a plurality of more than 30 percent of the vote or face a runoff against the second-place candidate.",
    "The sun was barely up when Margaret Campion lined up as the first voter outside the clubhouse at the University of North Carolina at Chapel Hill's Finley Golf Course, her polling location.",
    "The fate of the dams is the focus of a federal lawsuit, which Mr. Simpson has said could leave no other option than to demolish the barriers in accordance with the Endangered Species Act.",
    "What to read\nNicholas Confessore and Karen Yourish explain the origins of replacement theory,? a once-fringe ideology that was espoused by the suspect in the Buffalo massacre on Saturday.",
    "For Republicans in one Idaho congressional district, a different kind of watershed moment has arrived, and it has more to do with salmon than loyalty to former President Donald J. Trump.",
    "The seat being vacated by Representative David Price, a Democrat who is retiring after having served since 1997 and before that from 1985 to 1995, is one of the ballot's marquee races.",
    "In North Carolina, Representative Ted Budd is proving the political potency of pairing endorsements from Donald Trump and the Club for Growth, Jazmine Ulloa and Michael Bender report.",
    "Over the past two years, the Republican-controlled state legislature has passed measures overhauling election procedures or curtailing the governor's authority to manage the pandemic.",
    "Ms. Campion was most concerned with environmental issues, how candidates have promised to combat climate change, the state of the district's schools and support for public education.",
    "Jazmine just returned from North Carolina's mountainous west, where she found strong opinions about Madison Cawthorn, the troubled first-term congressman facing a primary challenge.",
    "The law, which required transgender people to use public restrooms that matched their birth gender, drew protests from major businesses and athletic powerhouses including the N.B.A.",
    "Ballots have already been printed, fueling despair among party insiders that the efforts to unify the party against one or both outsider candidates might ultimately prove futile.",
    "Although Mr. Simpson originally envisioned that the project would be funded by President Biden's infrastructure program, it was dropped from the version that was signed into law.",
    "This dyspeptic mood is bipartisan, with Democrats and Republicans both exasperated that a divided and polarized state government has thwarted the progress they see as necessary.",
    "Oz, who if elected would become America's first Muslim senator, called those comments disqualifying? and reprehensible? in an interview on Saturday with The Associated Press.",
    "But McCrory, running for Senate in North Carolina, is floundering in his attempted return to electoral politics, trailing heavily in polls to a rival backed by Donald Trump.",
    "Recriminations are flying over why the Pennsylvania Republican Party failed to appreciate the rise of Barnette and Mastriano until it was too late to arrest their momentum.",
    "Trump has slammed the establishment candidate, Attorney General Mark Brnovich, for failing to overturn Biden's victory there in 2020, but has not yet chosen an alternative.",
    "She sees this election as a chance to push the profile of North Carolina's leadership in a direction that more accurately reflects its voter base, at least in this region.",
    "Should Roe be overturned and abortion become an issue decided state by state, Pennsylvania's Republican-led legislature is expected to pass a bill with sharp restrictions.",
    "Two big issues will overshadow Pennsylvania's open race for governor in the fall: voting access and the future of abortion, should the Supreme Court overturn Roe v. Wade.",
    "Mr. Simpson, 71, a fixture in the House since 1999, proposed the infrastructure project, a transformation that Native Americans and environmental groups have long sought.",
    "The McCormick camp is hoping the fireworks between Barnette and Oz will earn him a second look from voters, who seem to be wavering between the three leading contenders.",
    "A militia activist, who was once prosecuted for his role in an infamous 2014 standoff with federal agents in Nevada, promised to be a true representative of the people.",
    "The former president has thrown his weight behind a former college football player, Bo Hines, 26, who is also being backed by the Club for Growth's political committee.",
    "A third candidate, Malcolm Kenyatta, a young left-leaning state lawmaker from Philadelphia, would be the first Black and openly gay nominee should he pull off an upset.",
    "primary for a new North Carolina congressional district, the 13th, which is south of Raleigh and is likely to be the state's only competitive House seat in the fall.",
    "North Carolina is an in-between state, and it's been really sad, the state of things here.?\nBONNERS FERRY, Idaho  At a school gymnasium in northern Idaho, Lt. Gov.",
    "Eight Democratic candidates are competing for the nomination for Mr. Price's seat in central North Carolina's typically progressive Fourth Congressional District.",
    "primary for Senate will have less than two months to mount a general election campaign against Senator Maggie Hassan, a Democrat, who is considered vulnerable.",
    "The Snake River flows more than 1,000 miles in the Pacific Northwest, from Wyoming to Washington State, where the four dams proposed for removal are situated.",
    "Some states don't hold their primaries until August and September, ensuring a summer filled with attack ads and stump speeches in several battleground states.",
    "Some in the party fear that a raw and undisciplined hunger for a change could result in not much change at all  or even a change that benefits the other side.",
    "There's a roadblock to accomplishing anything,? said Dave Ball, the chairman of the Washington County Republican Party, in the southwest corner of the state.",
    "Barnette has endorsed Mastriano and vice versa, and the two have held events together  almost as if they are running together as a kind of super-MAGA ticket.",
    "June 14: Nevada\nThe last time Catherine Cortez Masto, the first Latina senator, was on the ballot, outside groups flooded Nevada with more than $90 million.",
    "In Pennsylvania, Mr. Trump's blessing of Dr. Oz met with major pushback pointing out that the doctor was a Hollywood liberal? and friend of Oprah Winfrey's.",
    "rights that brought him to national prominence back in 2016.\nIt's not an issue that drives me, never was,? McCrory said in a telephone interview on Monday.",
    "In Idaho, a feud between the state's governor and its lieutenant governor is coloring the Republican Party as the far right seeks to take over the state.",
    "Aug. 2: Arizona and Michigan\nArizona has emerged as one of the top prizes this year, with an open seat for governor and a fiercely contested Senate race.",
    "Mr. Simpson twice voted against the impeachment of Mr. Trump, but opposed a measure seeking to overturn the election of Joseph R. Biden Jr. as president.",
    "I've got these outside special interest groups trying to give me a false identity,? he said, taking particular issue with the Club for Growth's attacks.",
    "Urban is supporting Dave McCormick, a fellow West Point graduate, in the Senate race, and said he had not spoken to Trump recently about the primary.",
    "But when national politicians come to your town, they don't really know who these people are and tell us how to vote  that was really annoying to me.",
    "He has appealed to rank-and-file Democrats who want a progressive in office  as well as one they believe will appeal to working-class white voters.",
    "The results will help clarify the mood of the country: Pennsylvania, a longtime swing state, has often signaled what American voters are thinking.",
    "Loyalty is important to me.?\nWatching the events in Pennsylvania, which included the leading candidate in the Democratic race for Senate, Lt. Gov.",
    "Fast-forward six years, and Republicans are pushing anti-transgender legislation across the country and punishing companies that dare to object.",
    "The race will test the power of the Trump endorsement, even more than was the case in Ohio two weeks ago, where the former president pulled J.D.",
    "In the Senate race, for an open seat, Representative Ted Budd, also endorsed by Mr. Trump, has made a late surge, seeming to surpass former Gov.",
    "He describes himself as a Ronald Reagan Republican who's interested in national defense, fighting crime, cutting taxes and balancing budgets.",
    "She has fended off questions about her background in recent days, including about her military service and her past Islamophobic comments.",
    "He has said he will campaign on voting rights and on protecting abortion access, which could turn the race into a referendum on the issue.",
    "Aug. 9: Wisconsin\nWisconsin has potential for both parties, with contests for governor and Senate drawing a crowded field of candidates.",
    "They clapped as one candidate advocated machine guns for everyone? and another called for the state to take control of federal lands.",
    "Some of these party-switchers are voters who had long ago broken with the Democratic Party and are only now formalizing the divorce.",
    "Discontent runs deep in Pennsylvania, driven largely by economic concerns like inflation but fed by a host of other frustrations.",
    "It is unclear, however, if these antics will allow any of his rivals, most likely State Senator Chuck Edwards, to force a runoff.",
    "The Senate seat is held by Mark Kelly, a Democrat who won a special election in 2020 to fill the seat once held by John McCain.",
    "David Bergstein, the communications director at the Democratic Senate campaign committee, said that Trump's meddling in G.O.P.",
    "At the time, Mr. Simpson was a pledged delegate for Senator Ted Cruz, Republican of Texas and the winner of Idaho's primary.",
    "Pat McCrory of North Carolina signed legislation that critics called the bathroom bill? in 2016, it set off a firestorm.",
    "That's why John Fetterman, the state's iconoclastic 6-foot-8 lieutenant governor, has held a big polling lead for weeks.",
    "Democrats are making a mockery of campaign finance laws through the use of little red boxes,? Shane Goldmacher reports.",
    "The party's high-octane primaries for governor and the Senate have grown increasingly turbulent in the final stretch.",
    "front-runner in polls, was a key figure in Mr. Trump's effort to overturn the 2020 election results in Pennsylvania.",
    "Gretchen Whitmer, a Democrat and focus of conservatives' ire over pandemic restrictions, is running for re-election.",
    "Adam Laxalt, a former Nevada attorney general who ran unsuccessfully for governor in 2018, must get past the G.O.P.",
    "and the N.C.A.A., which withdrew their All-Star Game and March Madness basketball tournament games from the state.",
    "The other chief contenders in the race are Bill McSwain, a former U.S. attorney, and Dave White, a businessman.",
    "Trump endorsed Oz, a celebrity physician, over the advice of many Republicans inside and outside Pennsylvania.",
    "We are literally frozen out of our own legislature, so that's why the governorship is so important,? she said.",
    "McCrory supports the recently enacted Florida law that restricts discussion of sexual orientation in schools.",
    "But as he seeks the Senate nomination in Tuesday's primary, he's more interested in talking about inflation.",
    "Mr. Smith has called Mr. Simpson a radical environmentalist? who is out of step with grain growers in Idaho.",
    "We're losing our state,? said Ms. McGeachin, who is now seeking to take over the governor's job permanently.",
    "And right now, a forceful centrifuge seems to be spinning Pennsylvanians further toward the partisan edges.",
    "The greatest impact of Trump's meddling might be felt in Arizona, where he has yet to issue an endorsement.",
    "Mr. Shapiro won multiple lawsuits brought by Trump supporters falsely claiming fraud in the 2020 election.",
    "primaries was having an even greater effect on the Republican Party than many Democrats had anticipated.",
    "The state once took pride in electing center-left or center-right politicians to its highest offices.",
    "I did what I did because I was just so outraged? over Trump's endorsement of Mastriano, Marino said.",
    "The Snake River sockeye salmon, which swims upstream to spawn, is listed as an endangered species.",
    "Wind and solar power, he has said, cannot replace the electricity produced by the system of dams.",
    "Here's what we're watching for:\nCan Trump again pull a struggling candidate over the finish line?",
    "At a rally Mr. Trump held in Pennsylvania 11 days ago, boos greeted the mention of Mr. Oz's name.",
    "The legislature here has not been amenable to progressive issues here for a long time,? she said.",
    "His main opponent, Kelly Daughtry, is the daughter of a former majority leader of the statehouse.",
    "For Ms. Campion, a 67-year-old retired preschool teacher, this election has extra importance.",
    "This should be a year where the Republican Party cleans house, really should,? Mr. Ball said.",
    "For Ms. Campion, it was those outsider voices that pushed her toward voting for Ms. Foushee.",
    "In the Democratic primary, Josh Shapiro, the state's attorney general, is running unopposed.",
    "McCrory also isn't talking on the campaign trail about the hot-button issue of L.G.B.T.Q.",
    "His predecessor in the Second District was Senator Michael D. Crapo, also a Republican.",
    "He said that he had been told before that he was the Ron DeSantis before Ron DeSantis.",
    "Over the weekend, he announced that he had had a stroke on Friday and was recovering.",
    "Pennsylvania voters will decide consequential primaries for Senate and governor.",
    "But at least on the Republican side, that history counts for little right now.",
    "The top four Republicans vying for the nomination all support abortion bans.",
    "Mr. Trump weighed in on Saturday with a late endorsement of Mr. Mastriano.",
    "MAGA does not belong to President Trump,? Ms. Barnette said at one debate.",
    "Cawthorn is still a national MAGA celebrity with Mr. Trump's endorsement.",
    "That argument has not been embraced by rank-and-file Democrats, however.",
    "He also described himself as the Jason Bourne of the Republican Party.",
    "The power of Mr. Trump's endorsement will also be tested in a G.O.P.",
    "Many Republican officials in the state are pulling for Ms. Daughtry.",
    "Vance, who had been polling in third place, over the finish line.",
    "Most of their TV spots have been attacks bludgeoning one another.",
    "He later supported Mr. Trump and was a delegate for him in 2020.",
    "Will Democrats choose an outsider for Pennsylvania senator?",
    "Both states have noteworthy secretary of state races, too.",
    "Stacey Abrams, a Democrat running for governor, is back.",
    "The governor has responded by issuing dozens of vetoes.",
    "Madison Cawthorn is on the ballot in North Carolina.",
    "The outcome of that election, as well as the G.O.P.",
    "The bill is coming due, those Republicans now say.",
    "And the secretary of state's race is notable, too.",
    "Republicans are focused on taking the seat of Gov.",
    "How will Madison Cawthorn fare in North Carolina?",
    "Sept. 13: New Hampshire\nThe winner of the G.O.P.",
    "how they run\nA new day for Pat McCrory\nWhen Gov.",
    "He previously served as Idaho's House speaker.",
    "Oregon, Idaho and Kentucky have primaries too.",
    "A few months later, McCrory lost re-election.",
    "governor's race, extremism is on the ballot.",
    "And I'm sure Nida's fine,? Campion said.",
    "Mr. Shapiro has said he would veto it.",
    "And it's all happening in plain sight.",
    "And don't forget this House primary.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "Doug Mastriano, the clear G.O.P.",
    "Now, she is up for re-election.",
    "Chaos begets chaos,? he said.",
    "And yet we've screwed it up.",
    "We'd love to hear from you.",
    "primary to challenge her.",
    "Not everyone's buying it.",
    "I like Bernie, of course.",
    "Polling shows the G.O.P.",
    "Tony Evers, a Democrat.",
    "Mike Baker was there.",
    "In Michigan, Gov.",
    "Today will tell.",
    "Sound familiar?",
    "In the G.O.P.",
    "Pat McCrory.",
    "Lt. Gov.",
    "race.",
    "Gov."
  ]
}