{
  "id": 3422,
  "mediaId": 129,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "A Republican megadonor scrambled to stop Doug Mastriano in the Pennsylvania governor's race.",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/05/16/us/primary-elections-pennsylvania-midterm",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    641,
    821,
    1147,
    1282,
    1713,
    1997,
    2303,
    3102,
    3103,
    4451,
    4482,
    146,
    428,
    2862
  ],
  "sentences": [
    "Doing Muslim like THINGS!?\nAt first, Ms. Barnette blamed former President Barack Obama and the people who had fled the civil war in Syria, telling Ms. Bream, In almost all of those tweets, when you look at the time frame we were living in at that particular time, we had the Obama administration bringing in a lot of Syrian refugees at that time.?\nMs. Barnette was spreading the toxic brew of misinformation that Donald J. Trump helped popularize among Republicans before his successful presidential run in 2016, including the false claim that Mr. Obama is Muslim.",
    "His opponent, Ms. McLeod-Skinner, said in a statement, How can our party credibly argue that we will get big money out of politics in November with candidates like Schrader on the ballot??\nShe has her own red box, seeking television ads in Portland about Mr. Schrader's contributions and votes, along with mailers targeting women especially? in Multnomah, Clackamas and Deschutes counties.?\nBut so far, the pro-Schrader side has vastly outspent Ms. McLeod-Skinner's allies: nearly $2.1 million to around $275,000, as of Friday.",
    "Mr. Fetterman had been scheduled to host a meet-and-greet in Lancaster County, Pa., on Friday morning, but his spokesman, Joe Calvello, said at the time that the team decided to cancel the event because John was not feeling well this morning so we are taking the necessary precautions.?\nThe campaign canceled events across the state on Friday evening, Saturday morning and again on Sunday, but gave scant information about the state of Mr. Fetterman's health over the weekend.",
    "In Texas, Mr. Cuellar updated his red box in April to request that his backers tell voters in the Harlingen and Laredo media markets? that Cisneros would defund the police and border patrol which would make us less safe and wreck our local economy.?\nOn April 28, a new television ad from a pro-Cuellar group began making exactly that case, exclusively in the Harlingen and Laredo media markets, at a cost of roughly $150,000, according to AdImpact, the ad-tracking firm.",
    "Ms. Foushee is running against, among others, Nida Allam, a Durham County commissioner who promotes herself as the first Muslim woman elected in North Carolina, and who has been critical of U.S. military aid to Israel being used to oppress the Palestinian people.?\nThe super PAC that Mr. Bankman-Fried is bankrolling, Protect Our Future, has spent more than $11 million in another open Oregon House race  an astounding sum to lift a political newcomer, Carrick Flynn.",
    "Mr. Mastriano wouldn't be able to govern? even if he won, Mr. Brouillette added, pointing to the candidate's poisonous relationship with many in the Pennsylvania Republican Party as well as his role in helping organize and attend the protests leading up to the attack on the Capitol in 2021. He wouldn't get anything done.?\nIn a statement issued after the Commonwealth Partners' endorsement of Mr. Barletta, the McSwain campaign said he planned to stay in the race.",
    "We're losing our freedoms.?\nThe bitter intraparty contest between Ms. McGeachin and Mr. Little, set to be settled in the state's primary election on Tuesday, reflects the intensifying split that is pitting Idaho's conventional pro-gun, anti-abortion, tax-cut conservatives against a growing group of far-right radicals who are agitating to seize control of what is already one of the most conservative corners of the Republican Party in the country.",
    "There is a trend line of missteps and indiscipline,? Mr. Honeycutt said, adding: It's really a distraction right now when we should be focused on kitchen-table issues like the cost of gas, or inflation, or what is going on with the war in Ukraine.?\nAt Bethany Bible Church, Christine Tuttle, 61, a bookkeeper, and her daughter, Lizzie, 20, said they remembered Mr. Cawthorn as respected, outgoing and popular among the home-school families.",
    "If traditional Republican principles in Idaho want to survive, then the traditional Republicans are going to have to work harder,? said Jack Riggs, a former lieutenant governor who recently joined with other former elected officials to form a separate association, the North Idaho Republicans, to challenge what he sees as a dangerous shift within the existing party leadership in Kootenai County.",
    "In interviews with more than 30 voters in Mr. Cawthorn's 11th Congressional District, including nearly two dozen registered Republicans, it was clear that his support had weakened, even among hard-right Trump followers who said Mr. Cawthorn's immaturity and lack of focus on his constituents had led them to disregard his endorsement by the former president and give one of his rivals their vote.",
    "And that was a plus for me.?\nKathy Barnette, a Republican Senate candidate in Pennsylvania who has climbed in the polls against two big-spending rivals, on Sunday sought to downplay her past Islamophobic messages on social media, telling a Fox News host that some of them were not even full thoughts,? nor even full sentences? but rather, prompts intended to facilitate a conversation.",
    "Former President Donald J. Trump, who has endorsed Dr. Oz, said in a public statement last week, Kathy Barnette will never be able to win the general election against the radical left Democrats.?\nOn Sunday, Ms. Barnette sought to distance herself from her previous messages, saying they were incomplete thoughts and that she cannot explain them because she wrote them years ago.",
    "Red boxes are typically hidden in plain sight in Media Center? or Media Resources? sections of campaign websites that operatives know how to find, and often use thinly veiled terms to convey their instructions: Saying voters need to hear? something is a request for radio ads, see? means television, read? means direct mail, and see while on the go? usually means digital ads.",
    "But these margins look pretty big, especially considering he's running against a former governor and a former congressman.?\nMr. McCrory disputed the polling and criticized the Club for Growth, a 23-year-old conservative outfit he described as a political gun-for-hire that had strayed from its original mission of promoting low-tax, limited-government policy.",
    "On April 29, Mr. Schrader issued a not-quite-private directive inside a red-bordered box on an obscure corner of his website, sketching out a three-pronged takedown of what he called his toxic? challenger, Jamie McLeod-Skinner  helpfully including a link to a two-page, opposition-research document about her tenure as a city manager.",
    "And there are eye-rolls and shrugs from his die-hard supporters, America First? conservatives after the fashion of Donald J. Trump, who chalk up Mr. Cawthorn's controversies to youthful indiscretion and instead reserve their opprobrium for the liberal media, Democrats, his Republican opponents and political groups with deep pockets.",
    "Ms. Allam used on the go? in an April 20 red box update to request online ads telling voters  especially women, Democrats under 50 and progressives?  that she would be an unapologetic progressive.?\nThe Working Families Party used those exact words  along with other verbatim phrases  in a Facebook ad that began running on May 5.",
    "Ms. Giddings ended her campaign speech at the Bonners Ferry forum with an ominous message, saying that if she did not win, people should plant your gardens and keep buying ammo.?\nAround northern Idaho, it is not hard to find people who worry about the future of the country and are prepared for the possibility of civil conflict.",
    "I look forward to seeing him back on the campaign trail soon.?\nAnd Mehmet Oz, the celebrity doctor and Republican Senate candidate, said that he had cared for atrial fibrillation patients and witnessed the miracles of modern medicine in the treatment of strokes.?\nI am thankful that you received care so quickly,? he said.",
    "State Representative Priscilla Giddings, who was censured by her colleagues after she publicly identified a state Capitol intern who reported being raped by a state lawmaker, is running for lieutenant governor against the State House Speaker, Scott Bedke, an anti-abortion, pro-gun constitutional conservative.",
    "The amazing doctors here were able to quickly and completely remove the clot, reversing the stroke, they got my heart under control as well.?\nThe incident has kept him off the campaign trail for the final weekend before Tuesday's primary election in one of the nation's most closely watched Senate contests.",
    "Meanwhile, Ammon Bundy, who led an armed takeover of an Oregon wildlife refuge in 2016, is also running for governor, but doing so as an independent after calling the current Republican Party corrupt and wicked.?\nAt the event in Bonners Ferry, speakers decried the work of Republicans at the State Capitol.",
    "Brad Little had worked in recent years to slash taxes and ban abortion, but for Ms. McGeachin and the hundreds gathered at a candidates' forum sponsored by the John Birch Society in late March, the governor was at cross purposes with their view of just how conservative Idaho could and should be.",
    "Referring to his wife, he continued, Hayley and I are keeping John and his family in our prayers and wishing him a full and speedy recovery.?\nState Representative Malcolm Kenyatta, a Senate candidate from Philadelphia, said his prayers are with him and his family as he recovers from this stroke.",
    "In text messages after the election that were obtained by CNN, Mr. Budd inaccurately suggested to Mark Meadows, then the White House chief of staff, that Dominion Voting Systems might have had a connection to the liberal billionaire George Soros, a bogus claim pushed by multiple Trump allies.",
    "Many Republican leaders and donors have worried that if Mr. Mastriano wins the nomination, he would saddle the Republican Party with a candidate who might easily be defeated by Josh Shapiro, the attorney general of Pennsylvania, who is running uncontested on the Democratic side of the race.",
    "With Mr. Trump's endorsement, Ms. McGeachin has tried to portray Mr. Little, a third-generation sheep and cattle rancher who has worked to position Idaho as a low-regulation state friendly to businesses and small-government conservatives alike, as unwilling to uphold Idaho's true values.",
    "Red-boxing spans the ideological spectrum of the Democratic Party, from Blue Dog Democrats like Mr. Schrader to progressives like his challenger and Ms. Cisneros, who has the backing of the Working Families Party and Justice Democrats as she tries to unseat Representative Henry Cuellar.",
    "But the explosion of red boxes and their unabashed specificity is the latest example of how America's system of financing political campaigns  and the restrictions put in place to curb the power of the wealthy in the wake of Watergate a half-century ago  is teetering toward collapse.",
    "Perhaps the most frequently cited objections to Mr. Cawthorn, however, were his track record of missing important votes in Congress and reports that he had moved into a newly-drawn conservative district nearby before deciding to run for re-election to his seat in the 11th District.",
    "Mr. Brouillette urged Mr. McSwain and another candidate, Dave White, to withdraw from the primary for the good of our commonwealth and our country.?\nIn an interview, Mr. Brouillette said that his organization had concluded that Mr. Mastriano would lose to Mr. Shapiro in November.",
    "One of the growing powers in the region is the John Birch Society, which dominated the far right in the 1960s and 1970s by opposing the civil rights movement and equal rights for women while embracing conspiratorial notions about communist infiltration of the federal government.",
    "At that time, I was hosting a show called Truth Exchange' and I would have all kinds of ideas and was leaning in to helping the public begin to have those conversations, and so those were some of the  that's the context around a lot of those tweets,? Ms. Barnette said on Sunday.",
    "We wanted to put out something once we had a clearer picture of his health.?\nIn the statement and in a brief accompanying video, Mr. Fetterman said he had been feeling unwell and that his wife, Gisele Barreto Fetterman, had insisted he go to the hospital to get checked out.",
    "I am not voting for him to be my best friend or date my daughter.?\nLess easily brushed away were Mr. Cawthorn's attempts to bring guns through airport security and his traffic violations, which many saw as irresponsible considering the crash that left him in a wheelchair.",
    "In this southwestern corner of the state, a largely working-class and Republican stronghold set against the Blue Ridge and Smoky Mountains, it seems as if nearly everyone has made up his or her mind on the young firebrand once seen as the future of the Republican Party.",
    "From Oregon to Texas, North Carolina to Pennsylvania, Democratic candidates nationwide are using such red boxes to pioneer new frontiers in soliciting and directing money from friendly super PACs financed by multimillionaires, billionaires and special-interest groups.",
    "The coordination of super PACs and candidates is the primary mechanism for corruption of federal campaigns in 2022.?\nIn Democratic primaries, the biggest money is often aligned with the more moderate wing of the party, and sometimes with very specific interest groups.",
    "In North Carolina, Mr. Budd is proving the potency of pairing the former president's endorsement with another from one of Mr. Trump's on-again, off-again allies: the Club for Growth, an influential anti-tax group that has spent $32 million on federal races this year.",
    "And while the tactic is not new to 2022, it is becoming so widespread that a New York Times survey of candidate websites found at least 19 Democrats deploying some version of a red box in four of the states holding contested congressional primaries on Tuesday.",
    "On May 3, a super PAC that has received all its money from a secret-money group with ties to the pharmaceutical industry began running television ads that did little more than copy, paste and reorder the precise three lines of attack Mr. Schrader had outlined.",
    "He hasn't really done anything for this district that I can think of,? said Scott Tekavec, 59, a maintenance technician who said he did not usually vote Republican but decided to cast a ballot for Mr. Edwards as an expression of his disdain for Mr. Cawthorn.",
    "From the very start, we have been focused on firing Cawthorn, but firing him in a way that was factual and honest,? said David Wheeler, a Democrat who co-founded the group, American Muckrakers Inc., with Mr. Cawthorn's 2020 Democratic opponent, Moe Davis.",
    "HENDERSONVILLE, N.C.  When Representative Madison Cawthorn's name comes up in this city of 14,000, where he was born and raised and it is not difficult to bump into someone who knew him from his home-schooling days, there tends to be a visceral reaction.",
    "Elected in 2020 as the youngest member ever to serve in the House, he helped spread Mr. Trump's stolen-election lies and aligned himself with other incendiary far-right representatives, Marjorie Taylor Greene of Georgia and Lauren Boebert of Colorado.",
    "There are sighs from Republicans who elected him to his first term in November 2020 and met his meteoric rise in Washington with the praise and excitement reserved for a hometown hero  only to be disappointed by his behavior and bad press ever since.",
    "He voted to overturn presidential election results after a mob of Trump supporters rioted in the Capitol on Jan. 6, 2021, and signed a letter in the days after the election urging the Justice Department to investigate voter fraud and irregularities.",
    "The state has long been a draw for ultraconservatives disillusioned with the liberal drift in other parts of the nation, many of them settling off the grid in the mountains of northern Idaho or among like-minded people in towns like Bonners Ferry.",
    "They are led by Chuck Edwards, a state senator who has the endorsements of most members of the Legislature from his district, and Michele Woodhouse, the elected Republican chair of Mr. Cawthorn's district who once was among his staunch supporters.",
    "My whole family is praying for your speedy recovery.?\nThroughout the campaign, Mr. Fetterman's blunt-spoken liberal politics and penchant for wearing shorts and hoodies at public events appear to have resonated with much of the Democratic base.",
    "In Idaho, where Mr. Trump won 64 percent of the vote in 2020, carrying 41 of the state's 44 counties, many longtime Republicans fear the party's name, identity and deep conservative values are being commandeered by the state's fringe elements.",
    "Mr. Little signed some of the nation's most restrictive abortion laws, including a provision that prohibits abortion after about six weeks of pregnancy and allows people, including the family members of rapists, to sue the abortion provider.",
    "Mr. Yass urged Mr. McSwain to consider the risk that if he stayed in the race, his candidacy could split the vote in a way that would help a polarizing far-right Republican candidate and put Democrats on a sure path to victory in the fall.",
    "Depending on whom you ask, they are either importing some of their home state's liberal values  Californians face particular scorn  or they are bringing new money and energetic grievances that could help drive Idaho further to the right.",
    "In an NBC interview on Friday she falsely denied writing a statement that is still on her Twitter timeline from 2015: Pedophilia is a Cornerstone of Islam.?\nMs. Barnette describes herself as an author, social conservative and Christian.",
    "When Mr. Little left the state to participate in a meeting of Republican governors in Tennessee last year, Ms. McGeachin issued an executive order banning mask mandates from government entities in the state, including school districts.",
    "Asked why the campaign waited days to share the news that a major Senate candidate had been hospitalized with a stroke, a matter of intense public interest, Mr. Calvello replied, John's condition was evolving in real time since Friday.",
    "Then, they add instructions that can be extremely detailed: Steering advertising spending to particular cities or counties, asking for different types of advertising and even slicing who should be targeted by age, gender and ethnicity.",
    "A local pastor began the meeting with an invocation, asking for God to bless the American Redoubt  a movement to create a refuge anchored in northern Idaho for conservative Christians who are ready to abandon the rest of the country.",
    "Party leaders have scrambled to coalesce around the candidate thought to be in second place behind Mr. Mastriano, former Representative Lou Barletta, but many fear it may be too late to stop Mr. Mastriano from winning the nomination.",
    "The Pharmaceutical Research and Manufacturers of America, according to its most recent tax filings, reported $6.9 million in contributions to Center Forward from 2017 to 2020, accounting for nearly 25 percent of the group's revenues.",
    "Janice McGeachin regaled a crowd with stories of her feuds with the current governor, a fellow Republican, including the time when he briefly left the state and she issued a mutinous but short-lived ban on coronavirus mask mandates.",
    "It's become abundantly clear in recent days that nominating Lou Barletta for governor is Republicans' best chance to defeat Josh Shapiro in November,? Matt Brouillette, the pro-business group's chief executive, said in a statement.",
    "The winner of the state's Republican Senate primary will head into the November general election with a distinct advantage over the Democratic nominee, who polls indicate will be Cheri Beasley, a former State Supreme Court justice.",
    "Mr. Riggs said the local party has been increasingly taken over by zealots motivated by a desire to limit the influence of government, sometimes at the expense of the traditional Republican goals of promoting business and growth.",
    "While political reformers question the legality of these wink-and-nod arrangements, past complaints to the Federal Election Commission about illegal coordination involving public materials posted online have mostly gone nowhere.",
    "Adav Noti, the legal director of the watchdog group the Campaign Legal Center, said that red boxes were erasing the very barriers that were erected to make politicians feel less indebted to their biggest financial benefactors.",
    "Last week, the Club for Growth threw at least $2 million in advertising behind Kathy Barnette, an insurgent candidate in Pennsylvania's Republican primary for an open Senate seat to replace Senator Pat Toomey, who is retiring.",
    "Campaign watchdogs complain that the practice further blurs the lines meant to keep big-money interests from influencing people running for office, effectively evading the strict donation limits imposed on federal candidates.",
    "Mr. McIntosh, meanwhile, has said privately that he hoped the group's recent endorsement of Kathy Barnette in Pennsylvania would help exact some revenge on Mr. Trump, according to people with knowledge of the conversations.",
    "But a super PAC created to oust Mr. Cawthorn, which has held itself out as a clearinghouse of damaging information about him, said the tips it has received have largely come from Mr. Cawthorn's former aides and supporters.",
    "There are groans and looks of utter disgust from people with Democratic and independent leanings  some of whom have chosen to cast a ballot in a Republican primary for the first time in hopes of removing him from office.",
    "Mr. Little has sought to tout his other conservative credentials, reminding voters that since he took office in 2019, he has slashed taxes, pursued deregulation and sent National Guard members to the U.S.-Mexico border.",
    "He had been involved in several businesses after divesting in 2003 from the Budd Group, a company started by his father that provides janitorial, landscaping and other corporate facility maintenance, a spokesman said.",
    "A few weeks before she traveled to the gymnasium event in northern Idaho, she made a video address to the America First Political Action Conference, an event organized by a prominent white nationalist, Nick Fuentes.",
    "If somebody thinks I'm smarter if I'm in a suit, so be it,? Mr. Fetterman said in an interview on Thursday after an event in York, his hometown, where he had given an energetic stump speech and worked a crowded bar.",
    "Similar debates are playing out across the country, as more moderate Republicans confront challenges from an increasingly powerful segment energized by the continuing influence of former President Donald J. Trump.",
    "In Henderson, Transylvania and Haywood counties, many voters recalled how Mr. Cawthorn won the seat  replacing Mark Meadows, who became chief of staff in the Trump White House  by modeling himself after Mr. Trump.",
    "But his re-election campaign has been marred by a seemingly endless series of embarrassing reports  beginning when he claimed that people he looked up to? in Washington had invited him to orgies and used cocaine.",
    "His allied super PAC, funded by $15 million from the Silicon Valley investor Peter Thiel, posted troves of internal and polling data on an unpublicized Medium page that campaign officials used to guide decisions.",
    "Black voters ages 45+ in Durham and white women ages 45+ in Orange? was the recent directive from Valerie Foushee, a Democratic House candidate in North Carolina locked in a competitive primary for an open seat.",
    "Earl Borer, 72, who attended the Birch Society event, said he saw this year's election as a make-or-break moment and added that people would need to pick up arms if the right conservatives did not get elected.",
    "In recent years, much of the super PAC's funding has come from Uline Inc., a shipping company owned by Dick and Liz Uihlein, and Susquehanna International Group, an investment company co-founded by Jeff Yass.",
    "Ms. McGeachin has become a standard-bearer for the party's right wing, using her office to create a task force to examine indoctrination in Idaho education? and touting her support for militias in the state.",
    "The Vance super PAC was so central to the campaign that when Mr. Vance walked onstage at a rally with Donald J. Trump, the cameraman filming him from behind worked for the super PAC, not the Vance campaign.",
    "In that race, their support for Representative Alex Mooney helped him coast to an 18-point victory over his House colleague David McKinley, who had support from much of the state's political establishment.",
    "Mr. Cawthorn, 26, who was injured in a car crash at 18, has seldom been out of the headlines since making his first run for Congress in 2020, when it emerged that he had made up parts of his autobiography.",
    "If I was a young kid with a cellphone, I wouldn't have a job either,? said David Roberts, 33, an engineer and unaffiliated voter in Hendersonville who planned to cast a ballot for Mr. Cawthorn on Tuesday.",
    "I would rather have people know what they're getting and this is who I am.?\nSenator Ben Ray Lujn, a New Mexico Democrat, had a stroke earlier this year and has spoken about his difficult path to recovery.",
    "That amount is twice as much as that by any other outside group  and much of that spending has been against candidates Mr. Trump has endorsed, according to campaign finance data compiled by Open Secrets.",
    "On Saturday, former President Donald J. Trump endorsed Mr. Mastriano, roiling the fractious Republican Party establishment in Pennsylvania, which is alarmed by the former military officer's rapid ascent.",
    "Last week, Mr. Budd was 27 percentage points ahead of the rest of the field, according to a poll from Emerson College, The Hill and WNCN-TV, the CBS affiliate in the Research Triangle of North Carolina.",
    "I don't care what he's done,? said Moiena Gilbert, 77, a retired certified nursing assistant who pulled up in an old Ford pickup to cast an early vote this week at Henderson County's Board of Elections.",
    "In November, Mr. Little tweeted a photo of himself at an event at Mr. Trump's Mar-a-Lago resort in Florida, saying that he and the former president were able to accomplish many great things? together.",
    "In northern Idaho's Kootenai County, the disputes have led to a formal rift, with two Republican Party factions separately battling to convince voters that they represent the true nature of the party.",
    "To work around the prohibition on directly coordinating with super PACs, candidates are posting their instructions to them inside the red boxes on public pages that super PACs continuously monitor.",
    "As a state lawmaker, Mr. Shapiro voted against tuition vouchers for private schools, but has spoken in favor of the principle of allowing parents to have choices about where to send their children.",
    "In the House, both political parties have entire websites that are the equivalent of red boxes, with searchable databases of guidance for races across the country that will be updated by the fall.",
    "Ms. McGeachin has pushed to go further, calling for a special session to remove exemptions offered in a state law limiting abortions and saying Idaho's law should be the strictest in the country.",
    "Electability Concerns: Starting with Pennsylvania, the coming weeks will offer a window into the mood of Democratic voters who are deeply worried about a challenging midterm campaign environment.",
    "And while Mr. Little has won an endorsement from the National Rifle Association, Ms. McGeachin said she wants to offer incentives to increase production of firearms and ammunition in the state.",
    "Dorothy Moon, a candidate for secretary of state, called for Idaho, which has one of the nation's highest concentrations of public lands, to reclaim control of them from the federal government.",
    "Mr. Fetterman's leading rival, Representative Conor Lamb, used his own red box earlier this year to outline the attacks he hoped his supportive super PAC would broadcast against Mr. Fetterman.",
    "HENDERSONVILLE, N.C.  Rick Griswold, a 74-year-old lifelong Republican, doesn't know much about Ted Budd, the congressman he plans to support on Tuesday in the party's Senate primary election.",
    "On Sunday night, the Commonwealth Partners Chamber of Entrepreneurs, a powerful Pennsylvania organization that is the top financial backer of Mr. McSwain's campaign, endorsed Mr. Barletta.",
    "Liberals, voters under 50 and women  across only San Antonio, Guadalupe and Atascosa counties,? reads the targeting guidance from Jessica Cisneros, a Democratic challenger in South Texas.",
    "Such groups and their allies have been particularly wary of the changing nature of Idaho's cities, including the legions of other newcomers responding to a booming job market in Boise.",
    "Democratic Senate Race: Representative Conor Lamb had all the makings of a front-runner, but John Fetterman, the state's shorts-wearing lieutenant governor, is resonating with voters.",
    "Facing a threat from his left flank, Representative Kurt Schrader of Oregon wanted to send an urgent message to allies ahead of his upcoming primary: It was time to go on the attack.",
    "I think there is a lot of support for Madison  they just may be afraid to tell you,? said one Baptist deacon leaving the Bethany Bible Church after a Wednesday night Bible study.",
    "Her sudden rise, and the accompanying scrutiny, have worried Republican leaders, who believe she may cost the party a chance to win an open Senate seat in the November election.",
    "In her race in North Carolina, Ms. Foushee, a state legislator, has been aided by more than $3 million in spending from two of the bigger new players in Democratic House races.",
    "One is a super PAC funded by an arm of the American Israel Public Affairs Committee, the pro-Israel lobbying group (a separate pro-Israel group has spent nearly $300,000 more).",
    "If you drop out, we have a better chance of beating? what he called wealthy Democrats like Josh Shapiro.?\nIn the end, Mr. McSwain decided to stick with his long-shot candidacy.",
    "Mr. Budd appeared to separate from the pack, helped by an $11 million advertising campaign from the Club for Growth mostly revolving around the former president's endorsement.",
    "Mr. Yass, an intensely private player in Republican politics who co-founded the Susquehanna International Group, an investment firm, is a leading donor to libertarian causes.",
    "In short order, a television ad appeared warning Democrats that Mr. Fetterman had once been called a Silver Spoon Socialist? and that Republicans think they could crush? him.",
    "End runs around campaign limits are themselves nothing new: For years, candidates have posted flattering pictures and videos of themselves for super PACs to download and use.",
    "Despite that endorsement, Ms. McGeachin has struggled to keep pace with the fund-raising of Mr. Little, who has accumulated more than $2 million, compared with her $700,000.",
    "The challenge: Campaign finance rules bar candidates from directly coordinating with the very outside groups that Mr. Schrader, a top moderate in Congress, needed to alert.",
    "A complaint about a top adviser to Pete Buttigieg's 2020 campaign tweeting a request for specific television ads, which a super PAC then produced, was recently dismissed.",
    "Hard-Liners Gain: Republican voters appear to be rallying behind far-right candidates in two pivotal races, worrying both parties about what that could mean in November.",
    "A militia activist, who was once prosecuted for his role in an infamous 2014 standoff with federal agents in Nevada, promised to be a true representative of the people.",
    "And nude photos and videos have circulated showing him in sexually suggestive antics, in what appeared to be attempts to raise questions about Mr. Cawthorn's sexuality.",
    "However, operatives working in Senate campaigns this year said that playing up Donald J. Trump's imprimatur is the single most effective message in intraparty battles.",
    "At the Birch Society event, she crossed the gymnasium to give a hug to Todd Engel, an activist with the Three Percenters militia who is running for the State House.",
    "John Fetterman of Pennsylvania, the front-runner for his state's Democratic Senate nomination, said on Sunday that he had had a stroke on Friday and was recovering.",
    "I had a stroke that was caused by a clot from my heart being in an A-fib rhythm for too long,? he said in a statement from Penn Medicine Lancaster General Hospital.",
    "Jeff Yass, a Pennsylvania-based financier and a major Republican donor, had a straightforward request for Bill McSwain, a trailing candidate in that state's G.O.P.",
    "Sure enough, a super PAC ran a positive ad employing some of those arguments  like the fact that he had refused to live in a state mansion to save taxpayers money.",
    "With two more weeks remaining in the first full month of primary contests this year, the Club for Growth super PAC has already spent $32 million on federal races.",
    "Mr. Budd compiled a staunchly conservative voting record during his six years in the House, one that aligned closely with both Mr. Trump and the Club for Growth.",
    "Understand the Pennsylvania Primary Election\nThe crucial swing state will hold its primary on May 17, with key races for a U.S. Senate seat and the governorship.",
    "And Rodd Honeycutt, a retired Army colonel, said he had voted for Mr. Cawthorn in 2020 but felt the need to challenge him this year over his lack of leadership.",
    "Doug Heye, a Republican who has worked on three North Carolina Senate campaigns, said Mr. Budd was a strong but relatively unknown candidate across the state.",
    "But he allowed cities and school districts to issue mask mandates of their own, and that became a point of contention between him and the lieutenant governor.",
    "And despite Mr. Obama's pledge to welcome 10,000 Syrian refugees, only a fraction of them had entered the United States when Ms. Barnette posted her message.",
    "The Club for Growth was among the first outside groups to endorse Mr. Trump's 2016 presidential campaign, but in primary races, they are not always aligned.",
    "Mr. Little angered many in the medical community by refusing to issue a statewide mask mandate and by fighting President Biden's vaccine mandates in court.",
    "In 2014, Ms. Barnette wrote, If you love freedom, Islam must NOT be allowed to thrive under any condition.? In 2016, Ms. Barnette wrote, Obama is aMuslim.",
    "But just a few days later, Mr. Trump endorsed Ms. McGeachin, who has portrayed herself standing next to Mr. Trump in many of her campaign advertisements.",
    "The boxes highlight the aspects of candidates' biographies that they want amplified and the skeletons in their opponents' closets that they want exposed.",
    "Senate Race: Kathy Barnette, a conservative commentator, is making a surprise late surge against big-spending rivals, Dr. Mehmet Oz and David McCormick.",
    "He isn't doing his job,? Lynn Cagle, 47, a truck driver in Haywood County, said of Mr. Cawthorn as he left a senior center after voting for Mr. Edwards.",
    "In the Alabama Senate contest next week, Mr. Trump rescinded his endorsement for Representative Mo Brooks, while the Club for Growth has stood by him.",
    "He has visited all 100 counties during the campaign, which his team said was a factor behind Mr. Budd's skipping all four Republican primary debates.",
    "Heading out of her local polling place during early voting on Thursday, Cyndi Glass, 63, said she was aware of just two Senate Republican candidates.",
    "The revelations ranged from traffic violations, like driving with a revoked license, to two incidents in which he brought a loaded gun to an airport.",
    "We've determined mathematically he can't win because he won't appeal to key swing voters, given some of his extreme behavior,? Mr. Brouillette said.",
    "Idaho is in the midst of dramatic change, recording some of the nation's fastest population growth in recent years, especially during the pandemic.",
    "Center Forward Committee's funds this year have come exclusively from an affiliated nonprofit, Center Forward, that does not disclose its donors.",
    "Whether Mr. Cawthorn can dodge a runoff has been a constant source of debate in his hometown among friends, co-workers and in Christian circles.",
    "The doctors have assured me that I'll be able to get back on the trail, but first I need to take a minute, get some rest, and recover,? he said.",
    "The National Republican Congressional Committee posts at democratfacts.org; the Democratic Congressional Campaign Committee uses dccc.org/races.",
    "John Fetterman of Pennsylvania, a leading candidate in Tuesday's Democratic Senate primary, posted this year to make suggestions to super PACs.",
    "I'm well on my way to a full recovery.?\nThey're keeping me here for now for observation, but I should be out of here sometime soon,? he added.",
    "Eric Parker, who was also involved in the 2014 standoff and has founded a Three Percenters group in Idaho, is running for a State Senate seat.",
    "Abortion Battleground: Pennsylvania is one of a handful of states where abortion access hangs in the balance with midterm elections this year.",
    "Scott Trotter, a candidate for U.S. Senate, promised to sing a Christian worship song on the floor of the chamber on his first day in office.",
    "Mr. Cawthorn needs to garner only 30 percent of the vote on Tuesday to avoid a runoff in a crowded field split among seven other challengers.",
    "The Washington Examiner reported his involvement in a cryptocurrency scheme and suggested it may have violated federal insider trading laws.",
    "This year, the group has spent $11 million supporting Mr. Budd, roughly 57 percent of the outside spending in the Republican Senate primary.",
    "The phone call was described by five people who had been briefed on its contents and insisted on anonymity to discuss private conversations.",
    "Over the years, the Idaho panhandle has been home to white supremacist groups and people ready to take up arms against the U.S. government.",
    "He was previously sentenced to 14 years in prison for his role in the 2014 armed standoff in Nevada, but his conviction was later tossed.",
    "Many compared his brashness to Mr. Trump's and brushed away the photos of him partying or goofing off as the digressions of a young man.",
    "Federal candidates can legally raise only $2,900 for a primary per donor; super PACs can receive donations of $1 million  or even more.",
    "We've been focused on the fundamentals, like getting organized in all 100 counties,? said Jonathan Felts, a senior adviser to Mr. Budd.",
    "He falsely claimed his injuries had kept him from attending the Naval Academy, but admitted in court that it had already rejected him.",
    "She has recently surged in public polling against her two rivals in the Republican Senate primary, Dr. Mehmet Oz and David McCormick.",
    "Still, he has been leading his most prominent Democratic rival, Representative Conor Lamb, by double digits in sparse public polling.",
    "Republicans already hold supermajorities in the State House and State Senate, and a Democrat has not won a statewide race since 2002.",
    "Many of the issues up for debate are highly local, ranging from the fees imposed by local water districts to books kept in libraries.",
    "They clapped as one candidate advocated machine guns for everyone? and another called for the state to take control of federal lands.",
    "That's how far they have to go back to find anything on me.?\nBONNERS FERRY, Idaho  At a school gymnasium in northern Idaho, Lt. Gov.",
    "The group was purged from the conservative movement decades ago but has found a renewed foothold in places like the Idaho panhandle.",
    "The commission has given wide leeway to publicly available internet materials,? saying they do not constitute illegal coordination.",
    "Mr. Fetterman was not above providing guidance: His site asked only for positive ads and included some biographical bullet points.",
    "Meanwhile, the Club for Growth endorsed Ms. Barnette, a conservative author and political commentator who has surged in the polls.",
    "It is not clear why Democratic candidates have so thoroughly embraced the red box tactic in primaries while Republicans have not.",
    "At a Hendersonville rally, Ms. Woodhouse presented herself as a true America First? conservative and Mr. Cawthorn as unelectable.",
    "I like Trump.?\nThe former president's branded complete and total endorsement? doesn't guarantee victory in a Republican primary.",
    "Mr. Yass is a donor to Dave McCormick, a former hedge fund executive who is running in the Senate primary against Ms. Barnette.",
    "The far-right candidate, Doug Mastriano, a conspiracy-theory-minded state senator, leads polls ahead of the Tuesday primary.",
    "Trump endorsed him,? Mr. Griswold, an Army veteran, said as he collected tools at his part-time job at O'Reilly Auto Parts.",
    "In 2014, some Republican groups tried using anonymous Twitter accounts to share internal polling data through coded tweets.",
    "Earlier in his race in Oregon, Mr. Schrader posted his congressional vote ratings by a number of different interest groups.",
    "Mr. Schrader was one of three House Democrats to vote down a Democratic plan to control prescription drug prices last year.",
    "Idaho endured some particularly challenging waves during the coronavirus pandemic that led hospitals to a state of crisis.",
    "The Club for Growth has also curtailed its spending on the race, signaling its calculation that Mr. Budd is safely ahead.",
    "The super PAC that also leveled the attacks he wanted, Center Forward Committee, ran an ad playing up those very ratings.",
    "They said their image of him was tainted when young women came forward with accusations that he had forcibly kissed them.",
    "Spencer Hutchings, a candidate for the State House, was the one who advocated making machine guns generally available.",
    "Republicans have won the last four North Carolina Senate races and the past three presidential contests in the state.",
    "During a heated battle in the Ohio Senate primary, the group aired a TV spot of Mr. Trump's choice in that race, J.D.",
    "In the Pennsylvania Senate primary on Tuesday, Mr. Trump supports Dr. Mehmet Oz, the longtime television personality.",
    "Still, the Club for Growth and Mr. Trump were on the same side in a contested West Virginia House primary this month.",
    "Candidates update their messaging guidance, essentially scripting super PAC ads for different stages of the campaign.",
    "That's twice as much as any other outside group and already half of what the group spent in the 2020 election cycle.",
    "The group's most-watched TV spot of the race was footage of Mr. Trump's announcement of his endorsement of Mr. Budd.",
    "The ballots were printed long ago, and it is unlikely that many voters would be aware if Mr. McSwain left the race.",
    "Young women at the conservative Christian college he attended before dropping out accused him of sexual harassment.",
    "She was endorsed by the anti-tax group Club for Growth, which committed $2 million for advertising to support her.",
    "The good news is I'm feeling much better, and the doctors tell me I didn't suffer any cognitive damage,? he said.",
    "The Fox News Sunday? host, Shannon Bream, asked Ms. Barnette about specific messages she had written on Twitter.",
    "Chip Worrell, 62, a charter member of the same church and a woodworker who helped erect its building, disagreed.",
    "Mr. McSwain, a former U.S. attorney who has been fielding many such calls lately, said he would think about it.",
    "Overwhelmed facilities in northern Idaho were forced to redirect some patients to neighboring Washington State.",
    "Many of the new activists, he said, express a willingness to fight the U.S. government, with arms if necessary.",
    "They're not even full sentences and yet people take it and they begin to build their own narrative around it.",
    "I just found out on live TV that Lieutenant Governor Fetterman suffered a stroke,? Mr. Lamb wrote on Twitter.",
    "Mr. Trump ordered an aide to text the group's president, David McIntosh, telling him off in a vulgar message.",
    "In 2016, the Club for Growth endorsed Mr. Budd and spent $500,000 to help him emerge from a crowded primary.",
    "The Club for Growth spent more than $1 million in that House race, twice as much as any other outside group.",
    "We're losing our state,? said Ms. McGeachin, who is now seeking to take over the governor's job permanently.",
    "The development upended his ability to engage voters in-person during the most intense stretch of the race.",
    "In Ohio, the group spent $8 million for Josh Mandel, while Mr. Trump backed the eventual winner, Mr. Vance.",
    "Fearing the growth of the party's extremist wing, some Republicans are waging a Take Back Idaho? campaign.",
    "In the governor's race, he said he preferred Ms. McGeachin or Mr. Bundy and was leaning toward the latter.",
    "The lax enforcement has emboldened candidates and parties to publish more and more specific instructions.",
    "And we're trying to do everything we can to stop them.?\nA Club for Growth spokesman declined to comment.",
    "Mr. Yass is a prominent supporter of charter schools, which are a major plank of Mr. McSwain's campaign.",
    "For many of the races on the ballot, the winner of Tuesday's primary will coast to victory in November.",
    "Ms. Barnette continued: So, I can't provide a lot of context because, again, it's almost 10 years ago.",
    "And the other is a super PAC financed chiefly by the 30-year-old crypto billionaire Sam Bankman-Fried.",
    "Ms. Barnette has spread falsehoods on social media and in public speeches aimed at Muslims for years.",
    "Yet Mr. Trump, whose name appears on oversize signs across the state, carries substantial influence.",
    "This page only exists because of our broken campaign finance system,? reads a web page that Lt. Gov.",
    "Pat McCrory and former Representative Mark Walker after Mr. Trump announced his endorsement in June.",
    "Mr. Budd, 50, promoted himself as a gun shop owner during his first congressional campaign in 2016.",
    "In Idaho, we cherish our liberty, and we fight for our jobs,? Mr. Little says in a new campaign ad.",
    "Ms. McGeachin, the lieutenant governor, has angled to seize the support of that wing of the party.",
    "Facebook records show that 95 percent of the ad's impressions were with women and people under 54.",
    "Writing on Twitter, he told supporters that he and a friend had simply been joking around crassly.",
    "Mr. Cawthorn's opponents lack his ability to draw attention, but they see an opening nonetheless.",
    "The overwhelming majority of the tweets that are now being presented are not even full thoughts.",
    "The most important thing, as Mr. Borer saw it, was that Republican voters needed to oust Gov.",
    "His rise, Mr. Heye noted, showed the power of a well-funded, Trump-endorsed primary campaign.",
    "Supporters in Mr. Cawthorn's district see the leaks as the work of his opponents or of G.O.P.",
    "One was Mr. McCrory, but she said she wanted something different.?\nThe other was Mr. Budd.",
    "It was not immediately clear what Mr. Fetterman's rehabilitation process would look like.",
    "At least one of the many ads run in the race echoes the language in Mr. Flynn's red box.",
    "The Club for Growth is trying to buy the North Carolina Senate race,? Mr. McCrory said.",
    "Mr. Trump has been furious about the Club for Growth's campaigning against his picks.",
    "Mrs. Tuttle said she still voted for him in 2020. He had so much promise,? she said.",
    "It also echoed verbatim the recommended talking points about Mr. Lamb's background.",
    "Republicans work hand in glove with their super PACs, too, but in different ways.",
    "During a phone call last Tuesday, Mr. Yass asked: Will you consider dropping out?",
    "What little advertising money remained left was already spent on pro-McSwain ads.",
    "He is also a major funder of the Club for Growth, the influential anti-tax group.",
    "We will.?\nDemocrats have criticized some of the attacks for stirring homophobia.",
    "She and her daughter said they would not be voting for Mr. Cawthorn this time.",
    "(The remark drew a scolding from the House Republican leader, Kevin McCarthy.)",
    "Mr. Schrader's campaign and Center Forward declined to comment on his red box.",
    "The only exemptions in the law are for rape, incest and the life of the woman.",
    "I am going to vote for the man.?\nWhat there is not a lot of is indifference.",
    "This is about the cause, not about you,? Mr. Yass said he told Mr. McSwain.",
    "Vance outsourced some of his Ohio Senate campaign's most basic operations.",
    "If we don't get rid of him, then Idaho is no longer a paradise,? he said.",
    "Ms. Barnette and Mr. Mastriano have held joint campaign events together.",
    "(Like some others, he did not surround his instructions in a red box.)",
    "In an interview, Ms. McGeachin said she had no regrets about doing so.",
    "She cites the governor's actions during the pandemic as an example.",
    "Mr. Cawthorn's campaign did not respond to requests for comment.",
    "The measure was heavily opposed by the pharmaceutical industry.",
    "Disgrace,? immature? and embarrassment? were common refrains.",
    "It was unclear when he would return to in-person campaigning.",
    "Mr. McSwain did not respond to multiple requests for comment.",
    "He had hung in thus far, and with a week to go, why quit now?",
    "But he knows exactly why he'll cast his ballot for Mr. Budd.",
    "The Budd family later donated at least $50,000 to the group.",
    "Ms. McGeachin was among those who advocated for his release.",
    "What the newcomers mean to Idaho politics remains unclear.",
    "I told you there would be a drip drip campaign,? he wrote.",
    "It's my job to listen to a broad perspective,? she said.",
    "But in North Carolina, Mr. Budd was battling former Gov.",
    "The practice is both brazen and breathtakingly simple.",
    "Mr. Schrader said he preferred an alternative measure.",
    "Politico published photos of Mr. Cawthorn in lingerie.",
    "I don't think he is going to be re-elected,? he said.",
    "But they said they knew plenty of people who would.",
    "This year, Mr. Budd has mostly kept his head down.",
    "It's not surprising Budd is emerging,? he said.",
    "He favors increased funding for public schools.",
    "Mr. Little reversed the order upon his return.",
    "Vance, criticizing the former president.",
    "So instead, he used a little red box.",
    "We're keeping score,? the ad began.",
    "Some believed them to be fake.",
    "Trump endorsed him,? she said.",
    "The primary is on Tuesday.",
    "leaders like Mr. McCarthy.",
    "Red boxes aren't static.",
    "It's a joke,? he said.",
    "primary for governor.",
    "Blackmail won't win.",
    "He's broken the law.",
    "More recently, J.D.",
    "He is a Christian.",
    "Lt. Gov.",
    "Little.",
    "G.O.P.",
    "Gov."
  ]
}