{
  "id": 3447,
  "mediaId": 195,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Sunday shows preview: Democrats' abortion rights bill blocked; Pennsylvania, N.C. primaries near",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/pelosinancy_051122arl6_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/sunday-talk-shows/3488550-sunday-shows-preview-democrats-abortion-rights-bill-blocked-pennsylvania-n-c-primaries-near/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    1253,
    1282,
    1878,
    2303,
    3102,
    146,
    482,
    571,
    2834,
    2862
  ],
  "sentences": [
    "Sanders said earlier this month that if the Senate could not marshal enough support for legislation codifying Roe v. Wade to meet the 60-vote threshhold required for most legislation, the upper chamber must end the filibuster to pass it with 50 votes.? However, Manchin and Sen. Kyrsten Sinema (D-Ariz.) have reiterated their opposition to changing filibuster rules.",
    "Democrats' efforts to defend abortion rights ahead of the Supreme Court potentially overturning Roe v. Wade, which saw legislation to codify such rights on a federal level blocked in the Senate earlier this week, are expected to dominate this week's Sunday show circuit, along with the upcoming primary elections in Pennsylvania and North Carolina.",
    "Meanwhile, in the GOP primary for the state's gubernatorial race, Sen. Doug Mastriano (R), who Trump endorsed Saturday, is up against former Rep. Lou Barletta (R-Pa.), Montgomery County commissioner Joseph Gale, former U.S. Attorney William McSwain and Ridley Township Commissioner Dave White, among other candidates.",
    "Although the bill was expected to fail, Senate Majority Leader Chuck Schumer (D-N.Y.) brought it to the floor following the leak of a Supreme Court draft majority opinion that showed the high court is poised to overturn Roe v. Wade, the landmark 1973 decision that established the federal right to abortion.",
    "I was hopeful for that, but I found out yesterday in caucus that that wasn't going to be.?\nManchin's vote against the bill sparked renewed anger from his progressive colleagues, who have been similarly frustrated in the past by the West Virginia senator stymieing key pieces of the Democrats' agenda.",
    "Barnette, who former President Trump on Thursday warned voters against, will be on Fox News Sunday,? while McCormick is set to appear on Fox's Sunday Morning Futures.?\nIn the Democratic Senate primary, Pennsylvania voters will choose between candidates including frontrunner Lt. Gov.",
    "To the Supreme Court, to the Republicans in Congress, to state governments across the country; we want you to know we fully intend to protect Roe v. Wade and we will be doing it every single day to protect those who seek care and those who provide care,? Pelosi said.",
    "Fox News's Sunday Morning Futures?  Sen. Bill Hagerty (R-Tenn.); Devin Nunes, CEO of Trump Media & Technology Group; former Department of Defense Chief of Staff Kash Patel; Rep. Jim Jordan (R-Ohio); David Mccormick, Pennsylvania Senate Candidate.",
    "House Democrats are here on the steps of the United States Capitol, across from the Supreme Court, to say to the Supreme Court and to the Senate, hands off women's reproductive health care,? Pelosi said during an event held on the Capitol steps.",
    "Speaker of the House Nancy Pelosi (D-Calif.), who is set to be on ABC's This Week? and CNN's State of the Union? on Sunday, foreshadowed this weekend's abortion rights protests and pledged to counter efforts to overturn Roe v. Wade on Friday.",
    "We need a Democratic Majority where all members believe in economic, racial, social and environmental justice,? progressive Sen. Bernie Sanders (I-Vt.), who is slated to appear on NBC's Meet the Press? on Sunday, tweeted after the vote.",
    "Below is the full list of guests scheduled to appear on this week's Sunday talk shows:\nABC's This Week?  House Speaker Nancy Pelosi, D-Calif.; Ukrainian Deputy Prime Minister Olga Stefanishyna.",
    "Pennsylvania is gearing up for a vote in a hotly contested Republican Senate primary between celebrity physician Mehmet Oz, former hedge fund manager David McCormick and Kathy Barnette.",
    "If Roe v. Wade is overturned by the Supreme Court and Congress does not pass a law codifying federal abortion protections, authority over abortion access could shift to the states.",
    "Jared Polis (D), who signed legislation the same month saying women have the fundamental right? to choose if they have an abortion, will be on Fox News Sunday.? Gov.",
    "If you can't stand up for a woman's right to choose, for voting rights, for an economy that works for all, why are you caucusing with the Senate Democrats?",
    "will be on CNN's State of the Union.?\nOn a state level, eyes are also on Pennsylvania and North Carolina as they prepare for primary elections this week.",
    "CBS's Face the Nation?  Transportation Secretary Pete Buttigieg; former Defense Secretary Mark Esper; Lloyd Blankfein, senior chairman of Goldman Sachs.",
    "On Wednesday, Senate Republicans and Democratic Sen. Joe Manchin voted against advancing a bill intended to enshrine abortion protections into law.",
    "Ahead of the court's decision on the matter, a number of states have passed laws either restricting or enshrining abortion access.",
    "We're going to be voting for a piece of legislation that I will not be voting for today,? Manchin said before voting on the bill.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Kevin Stitt, R-Okla., and Jared Polis, D-Colo.; Kathy Barnette, a Republican candidate for the Senate in Pennsylvania.",
    "Pat McCrory, a Republican candidate for the Senate in North Carolina; National Economic Council Director Brian Deese.",
    "McCrory will be on NBC's Meet the Press.? On the Democratic side, Cheri Beasley is expected to come away with a win.",
    "North Carolina Rep. Madison Cawthorn (R) is set to face primary voters as well following a series of controversies.",
    "Pat McCrory are the main competitors in the GOP race, with Budd surging ahead of McCrory days before the vote.",
    "Kevin Stitt (R), who in April signed a bill making abortion illegal in the state, and Colorado Gov.",
    "John Fetterman (D), Rep. Conor Lamb (D-Pa.) and state Rep. Malcolm Kenyatta (D).",
    "North Carolina voters will also cast ballots in their state's Senate primaries.",
    "But I would vote for a Roe v. Wade codification if it was today.",
    "NBC's Meet the Press?  Sen. Bernie Sanders, I-Vt.; former Gov.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Rep. Ted Budd (R-N.C.) and former North Carolina Gov.",
    "CNN's State of the Union?  Pelosi; Gov.",
    "; Finnish President Sauli Niinist.",
    "Fox News Sunday?  Govs.",
    "Pete Ricketts (R-Neb.)",
    "Pete Ricketts, R-Neb.",
    "Oklahoma Gov."
  ]
}