{
  "id": 3494,
  "mediaId": 234,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Doug Mastrianos GOP Primary Victory Puts Democracy on the Ballot in Pennsylvania",
  "image": "https://media.vanityfair.com/photos/628539e545605d6f125a49b0/master/w_2240,c_limit/1397825643",
  "link": "https://www.vanityfair.com/news/2022/05/doug-mastriano-pennsylvania-republican-primary-democracy",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    661,
    1147,
    1158,
    1713,
    2250,
    3102,
    392,
    428,
    2862
  ],
  "sentences": [
    "Such pressure likely wouldnt even be necessary the next time around; Mastriano, who has said he would try to purge voter rolls to start all over,? believes the Republican-controlled legislature has the sole authority? to appoint its own electors if he deems the results to be compromised.? Its easy to envision a scenario in which a Democratic presidential victory wouldnt be certified in Pennsylvania, should Mastriano win, as Trump himself alluded to in endorsing him in the final stretch of the primary.",
    "That ribbing speaks to the extraordinary danger of a Mastriano victory: Republican governors like DeSantis and Greg Abbott have enthusiastically carried on the project of Trumpism, using the former presidents rigged? election lies to usher in voting restrictions and his culture wars to rally the base and inflict pain on their enemies.",
    "He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election,? Trump said in an endorsement statement last week, and will do something about it.?\nThe stakes of this election are too high,? Pennsylvania Attorney General Josh Shapiro, the Democratic nominee for governor, wrote after Mastrianos victory.",
    "We have to beat him in November.?\nSome in the GOP fear Shapiro is likely to win; in the lead-up to Mastrianos commanding win Tuesday, there was some familiar hemming and hawing about whether a Christian nationalist Big Lie-proponent who rubs elbows with QAnon adherents can win a general election in November.",
    "In a party rank with grifters, opportunists, and craven enablers, Mastriano has cast himself as a true believer: a man not only selling culture war grievance and outlandish 2020 election conspiracy theories, but one who appears to personally subscribe to it all himself.",
    "He uses people like you and me to change history,? he told supporters in a victory speech Tuesday evening, shortly after dispatching his Republican rivals in Pennsylvanias gubernatorial primary by more than twenty points.",
    "The Shapiro campaign seems to be confident in Mastrianos political liability, too; the Democrat clearly viewed the unapologetic radical as his preferred opponent and all but campaigned on his behalf in the GOP primary.",
    "Hes not only the guy whipping his extremist supporters into a frenzy; hes among the frenzied, an insurrectionist who seems convinced of his righteousness and who has promised to make Ron DeSantis look like a moderate.",
    "Theres this movement here thats gonna shock the state here November 8,? he told supporters Tuesday night, bragging not just of a primary victory, but of a mandate? from Republicans to pursue his extremist vision.",
    "They may all be right, that a guy whose election campaign is centered around the idea that election results can be overruled by state leaders wouldnt seem an appealing choice for voters.",
    "In addition to exacerbating those already inflamed culture wars, he has indicated he and the secretary of state hed appoint could disregard the outcome of a 2024 election.",
    "But thatll be up to voters in a state that swung to Trump in 2016, even though polls and conventional wisdom suggested its 20 electoral votes would go to Hillary Clinton.",
    "The GOPs radicals have been pounding on the doors of the establishment for years; with his commanding win, Mastriano has made clear that theyve made it inside.",
    "Trump and his allies failed to overthrow the election in 2020 because enough people in positions of power did their jobs and refused to bend to the pressure.",
    "Amateur,? he said of the Florida governor, an icon of Republican extremism in the age of Donald Trump, during a rally earlier this month.",
    "But voters chose just such a man in 2016 when they elected Trump; it would be recklessly naive to think the same couldnt happen again.",
    "Indeed, Mastrianos rise in Pennsylvania has loud echoes of Trumps rise nationally.",
    "That a proud insurrectionist has gotten this far is disturbing enough.",
    "Both built movements by playing on the same prejudices and paranoias.",
    "Both were initially dismissed by members of the party brass.",
    "But Mastriano has vowed to push those efforts even further.",
    "Its gonna be beautiful, and its gonna be nothing but good.?",
    "That he stands a real shot to take over is even scarier.",
    "This is our day.?\nThe messianic language is no accident.",
    "Doug Mastriano is on a mission from God  or so he says.",
    "Both exploited power vacuums in crowded primaries.",
    "The similarities could end there.",
    "This is our time, right?",
    "This is our hour."
  ]
}