{
  "id": 3671,
  "mediaId": 157,
  "date": "d2022-05-12T00:00",
  "headline": "Pennsylvania's primaries are getting crazier by the day -- and here are some highlights",
  "image": "https://www.rawstory.com/media-library/meet-the-far-right-pennsylvania-republican-who-believes-that-god-was-behind-trumps-attempted-coup.jpg?id=27255006&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/pennsylvania-primary-election-2022/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    661,
    1092,
    1147,
    1622,
    3102,
    428,
    2862
  ],
  "sentences": [
    "This is where the light of liberty was set in 1776, where this nation was born.?\nTrump 'nervous' he picked the wrong GOP Senate candidate\nThe Republican Senate party has also set conservatives against one another, with right-wing commentator Kathy Barnette surging against the Trump-endorsed celebrity surgeon Mehmet Oz and fellow MAGA candidate David McCormick, and the anti-tax Club for Growth has plastered the airwaves with ads on her behalf.",
    "Republicans freak out over gubernatorial frontrunner\nGOP leaders are trying to persuade all but one of Mastriano's four leading rivals to drop out with less than a week before the May 17 election and endorse the candidate with the best poll numbers in hopes of sending a more electable candidate to face Democratic state attorney general Josh Shapiro in November.",
    "GOP frontrunner brags about being further right than Ron DeSantis\nMastriano has GOP leadership nervous because of his past efforts to overturn Trump's election loss, his association with QAnon conspiracists, his opposition to abortion even in cases of rape and incest, and his presence at the U.S. Capitol on Jan. 6, 2021.\nYou guys think Ron DeSantis is good?",
    "Democrats take aim at Senate frontrunner\nWhoever wins that primary will most likely face the hulking and casually dressed John Fetterman, the state's lieutenant governor and the Democratic frontrunner who leads both centrist Rep. Conor Lamb and state Sen. Malcolm Kenyatta -- both of whom have smacked him in an increasingly nasty campaign.",
    "The former president took about a third of the vote in his first Republican primary in the state, with a gaggle of opponents splitting up the rest, and Trump-loving election conspiracist Doug Mastriano might do the same thing in his GOP gubernatorial primary.",
    "Its very rare we get John at an event, and so Ill say directly to the lieutenant governor,\" Kenyatta said at a recent debate, when he demanded an explanation for a 2013 incident when Fetterman pulled a shotgun on a Black man.",
    "The right-wing Mastriano is considered a long shot in November, and his Republican rivals are trying to rally behind a single candidate in last-ditch effort to prevent the state senator from winning the nomination.",
    "Donald Trump narrowly won Pennsylvania in 2016 but lost there in 2020, and his refusal to accept that loss has thrown this year's primary elections into chaos.",
    "That's just one of the crazy things that's happened in this year's Pennsylvania primaries -- and here's a list of some of the wildest.",
    "\"For somebody who has cut an image as an incredibly tough guy, youre so afraid of two little words: Im sorry.?\nStories Chosen For You",
    "Everyone is coming to the realization we should have come to two months ago,? said a source close to one of those campaigns.",
    "\"[Trump is] nervous about Oz's prospects,\" said one adviser to the former president.",
    "This article was paid for by Raw Story subscribers.",
    "We love you, Ron, but this is Pennsylvania.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Amateur,? Mastriano said.",
    "Not a subscriber?",
    "Click here."
  ]
}