{
  "id": 4458,
  "mediaId": 129,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/05/19/us/primary-elections-pennsylvania-midterm",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    821,
    2095,
    2303,
    3102
  ],
  "sentences": [
    "Listing his early priorities as governor, he said, mandates are gone,? any jab for job requirements are gone,? critical race theory is over,? only biological females can play on biological female teams? and you can only use the bathroom that your biological anatomy says.?\nThe Mastriano matchup also plays to Shapiros carefully cultivated image as a fighter for democracy, though his campaign plans to focus primarily on bread-and-butter economic issues such as jobs, taxes and inflation.",
    "In North Carolina, Mr. Budd, who objected to the 2020 results after the Jan. 6 attack on the Capitol, began his campaign by calling Mr. Bidens victory legitimate.? After a year of the primary campaign and following Mr. Trumps endorsement, hed backtracked and on Tuesday said he had constitutional concerns about 2020.?\nEven Republican candidates who dont subscribe to the most radical theories aiming to overturn past elections are playing political footsie with those who do.",
    "Some in Pennsylvania blame Jeff Yass, a billionaire options trader and the states most powerful donor, for sticking with Bill McSwain for governor despite Donald Trumps blistering anti-endorsement; others point the finger at Lawrence Tabas, the state party chairman, for failing to clear the field; still others say that Trump should have stayed out of the race altogether instead of endorsing Mastriano.",
    "And Ive seen some people, theyve had some tough times, but I always said, No matter what, tough times make tough people.?\nGeorgia is among several states that have passed stringent abortion restrictions that currently could not pass constitutional muster, but would take effect if the Supreme Court, as expected, overturns Roe v. Wade, the landmark case that legalized abortion in the United States.",
    "On the other side of the state, the editorial page of The Pittsburgh Post-Gazette has already all but officially endorsed Shapiro as the only statewide candidate who did everything the Pennsylvania way.?\nOperatives in both parties expect Shapiro to blitz Mastriano with advertising portraying him as a dangerous extremist while Mastrianos shoestring organization struggles to raise money.",
    "Standing outside a gun shop in Butler County, just north of Pittsburgh, Mike Ackelson, 57, said he saw voter fraud as the biggest issue by far.? Mr. Ackelson, a local sports broadcaster, said he was convinced Mr. Trump had won the 2020 contest because early vote counts on election night favored him  even though votes are routinely counted for many hours or even days after polls close.",
    "A judge in Wayne County Circuit Court had already found Ms. Carones claims  made in an affidavit seeking to stop the certification of votes  were not credible.?\nAt times combative and glib, Ms. Carones performance was widely mocked, including by Saturday Night Live.?\nTo be honest with you, I didnt watch it for a really long time,? she said on Wednesday.",
    "I condemn open borders and the fact that were losing the sanctity of our nation by not enforcing immigration laws at the border.?\nOn Tuesday night, at a shuttered mechanics shop in Hendersonville that was converted into an event space for Mr. Cawthorns election party, the mood had started upbeat as people mingled over snow cones and games of cornhole.",
    "In Pennsylvania, Republican voters united behind a nominee for governor, Doug Mastriano, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "So, that candidate, whoever gets elected in Pennsylvania, will have to show that theyre going to make it a good race.?\nIn primaries so far, Republican voters have appeared willing to nominate proponents of Donald Trumps election falsehoods, making clear that this years races may well affect future elections, Reid Epstein writes.",
    "Ive dedicated my entire career to working in the interests of marginalized Black communities.?\nHerschel Walker, the former football star leading the race for the Republican nomination for a Georgia Senate seat, said that a ban on abortion should have no exceptions  presumably even for rape, incest or the health of the mother.",
    "In the states Senate race, the leading Republican candidate, the Trump-backed former football star Herschel Walker, said on Wednesday that he wasnt sure if Mr. Biden had been lawfully elected in 2020.\nI dont know,? Mr. Walker told a New York Times reporter after a speech in Macon, Ga. I do think there was problems.",
    "Melissa Carone was supposed to be a star witness for Rudolph W. Giuliani on his election denial tour, but she is perhaps better known as a caricature on Saturday Night Live?  a mercurial purveyor of wild conspiracy theories about fraud and miscounted ballots whom Mr. Giuliani shushed in the middle of her testimony.",
    "And,? Mr. Ready added, I dont think anyone in the world worries about his sex life or how fast he drives.?\nThe aftershocks of Tuesdays big primaries are still rumbling across Pennsylvania, but one impact is already clear: Republican voters choice of Doug Mastriano in the governors race is giving the G.O.P.",
    "Once in office, Trump-backed candidates are likely to try to follow through on promises to alter election law  in some cases, by simply making voting more difficult, but in others, by going so far as to give Republican-controlled state legislatures the right to overturn election results.",
    "He has said he would seek to end no-excuse absentee voting in the state, appoint a secretary of state focused on election fraud, add to the number of poll watchers in Pennsylvania, enact a universal voter identification law, and end the states contracts with voting machine operators.",
    "Josh Shapiro, the states attorney general who ran unopposed for the Democratic nomination for governor, spent more than $530,000  more than Mr. Mastriano spent on television in his entire campaign  on a single TV ad designed to lift the far-right Republicans standing among the G.O.P.",
    "I will still be exposing these establishment sellout RINOs in the Michigan G.O.P.?\nAnthony G. Forlini, a Republican who is the Macomb County clerk, said on Wednesday that his office had been following the law and that the disqualification of Ms. Carone was not politically motivated.",
    "The argument Kenyatta would make to young voters who might be souring on the Democratic Party, he said, was that when you elect a bigger, bolder Democratic majority,? it makes it easier to pass major progressive priorities like universal prekindergarten and student debt relief.",
    "An 11th-hour effort to stop Mastriano failed when both McSwain and Dave White, a self-funding candidate who spent at least $5 million of his own money, refused to drop out and support former Representative Lou Barletta, whose supporters insisted he was the more viable option.",
    "A Senate Judiciary Committee report said that video footage had confirmed that Mr. Mastriano had passed through breached barricades and police lines? near the Capitol, though he has denied that he breached the lines and there is no evidence that he entered the Capitol itself.",
    "He said the criticism was coming largely from consultants and rent-seekers who dont like us as we disrupt their gravy trains.?\nThe state senator and retired U.S. Army colonel has taken a hard line on abortion, which he has said should be illegal under all circumstances.",
    "She likes the drama, and shes been feeding on it.?\nMr. Forlini said that he could not speak to the specifics of Ms. Carones recent disqualification by the Michigan Department of State, a separate agency headed by Jocelyn Benson, a Democrat who is secretary of state.",
    "During an election oversight hearing held by legislators in Michigan in December 2020, she testified that she had observed over 20 acts of fraud  not counting ballots found in rivers and under a rock  and that at least 30,000 ballots had been counted multiple times.",
    "In some Philadelphia neighborhoods that are home to high percentages of Black voters, he appeared to trail State Representative Malcolm Kenyatta, who represents Philadelphia in the statehouse and was vying to be the states first Black and first openly gay senator.",
    "Im excited for the opportunity to unify the Republican Party, put the primary behind us and focus our attention towards the real issues,? Mr. Edwards said on Wednesday, seated at a sleek mahogany conference table at his campaign office in downtown Hendersonville.",
    "He appeared to struggle with two key demographics: unaffiliated voters, who make up more than 40 percent of his district, and those in Henderson County, which includes his hometown of Hendersonville and helped carry him to victory in the last Republican primary.",
    "Asked about his plans for ensuring Black voters turn out for him in November, Mr. Fetterman said he would do so by championing issues that are important in the Black community, by running on our record,? he said, noting that Braddock is a majority Black city.",
    "Mr. Walker, a political newcomer who returned to the state where he won the Heisman Trophy in 1982 to run at the encouragement of former President Donald J. Trump, called for more money to promote adoption and to support single fathers and single mothers.",
    "If Mastriano wins, it's a win for what Donald Trump stands for.?\nMany political observers, including some worried Republicans, view Mr. Mastriano as an underdog to the better-funded Mr. Shapiro  but the current environment is far friendlier to the G.O.P.",
    "A spokeswoman for that agency said on Wednesday that she could not further discuss the nature of the false statements that led to Ms. Carones disqualification, which was announced in conjunction with the other candidates who were barred on Tuesday.",
    "We have got to understand the different ways where cheating occurred.?\nIn interviews before Pennsylvanias primary, Republican voters made an array of false election claims and said they wanted their nominees to pass new voting laws once in office.",
    "And in Idaho, which Mr. Trump won overwhelmingly in 2020, 57 percent of voters backed two Republican candidates for secretary of state who pushed election falsehoods, though they lost a three-way race to a rival who accepts Mr. Biden as president.",
    "And I think everybody else thinks there was problems, and thats the reason right now everybodys so upset.?\nBut no Republican nominee for a major swing-state office has done more to amplify bogus election claims than Mr. Mastriano in Pennsylvania.",
    "Rebecca Kleefisch, a former lieutenant governor of Wisconsin who has long been the establishment Republican preference in the states August primary for governor, has migrated from saying last year that Mr. Biden had won the states contest fairly.",
    "I told him that Id like to work with him on trying to increase the diverse content of his campaign,? the official, Jeffrey Kirkland, said last Thursday, noting in an interview that he was one of the few people of color in attendance at the event.",
    "So it didnt surprise me when Kenyatta urged his followers to unite behind Fetterman, who also swims in many of the same leftward circles, but has tried to transcend his image as a Bernie Sanders-style progressive as the general election ramps up.",
    "He wrote that it was time for Republicans in the district to rally behind the Republican ticket to defeat the Democrats nominee this November.?\nMr. Cawthorns spokesman said on Wednesday that the tweet was the congressmans only statement for now.",
    "In most Republican primaries across the country, old-fashioned establishment candidates in the Romney and Bush mold have been on the run amid intraparty battles and challenges from a far-right wing energized by former President Donald J. Trump.",
    "Ms. Carone, who was played by the Saturday Night Live? cast member Cecily Strong in the shows cold open in December 2020, blamed the situation on a former campaign manager whom she said in an interview on Wednesday did not file the paperwork.",
    "Mr. Edwards, 61, a three-term state senator and business owner, thwarted Representative Madison Cawthorns turbulent re-election bid in North Carolina, beating him in Tuesdays primary in a rare defeat of a Trump-backed Republican incumbent.",
    "Her next move was to run for the legislature in Michigan, joining a host of election deniers across the nation who have sought public office since former President Donald J. Trump lost the 2020 presidential election to Joseph R. Biden Jr.",
    "Milton Ready, a North Carolina historian who identified himself as an unaffiliated voter who leans Democratic, said he cast a ballot for Mr. Edwards because he seemed like an establishment Republican  but not one obsessed with publicity.",
    "Many Republicans thought that idea was futile and far too late; several said a serious effort to prevent Mastriano from winning should have begun last summer, while others said that Yass and his allies could have dropped McSwain sooner.",
    "Had they kept their powder dry, they could have seen the lay of the land, when Mastrianos lead was 8-10, and backed Barletta,? said Sam Katz, a former Republican candidate for governor who now backs Josh Shapiro, the Democratic nominee.",
    "I dont care.?\nHENDERSONVILLE, N.C.  In his campaign headquarters the morning after his electoral victory, Chuck Edwards showed no interest in dissecting one of the biggest political upsets so far in this years Republican primary season.",
    "Mr. Cawthorn, 26, had alienated two powerful Republicans with a litany of political and personal errors and scandals: Representative Kevin McCarthy of California, the House minority leader, and Senator Thom Tillis of North Carolina.",
    "Republicans trying to reclaim governors mansions and take over top offices overseeing elections have fallen over one another for the last year and a half to cater to voters who believe myriad false claims about the 2020 contest.",
    "Mr. Edwards, who owns several McDonalds franchises and has served in the state legislature since 2016, has built a staunch conservative brand to the right of what used to be considered the traditional establishment Republican.",
    "When she signed the affidavit, Ms. Carone had owed at least $125 in late fees for missing the deadline twice for quarterly campaign filings in 2021, according to a letter from the clerk that was obtained by The New York Times.",
    "Mastrianos name has appeared in documents released by the committee investigating the Capitol riot, and he claims to have been in close personal contact with Trump about their shared drive to overturn President Bidens victory.",
    "The strong showings on Tuesday by election deniers, who have counterparts running competitively in primaries across the country over the coming months, were an early signal of the threat posed by the Trump-inspired movement.",
    "Republican voters in this weeks primary races demonstrated a willingness to nominate candidates who parrot Donald J. Trumps election lies and who appear intent on exerting extraordinary political control over voting systems.",
    "Mr. Cawthorn had been accused of engaging in insider trading, was pulled over for speeding, charged with driving with a revoked license and had been stopped for trying to bring a gun through airport security a second time.",
    "But her plans were short-circuited on Tuesday, when the Michigan Department of State disqualified Ms. Carone, 35, a former election contractor, as a Republican primary candidate for a State Senate seat outside of Detroit.",
    "In the run-up to Tuesday night, Republicans openly used words and phrases like suicide mission,? disaster? and voyage of the Titanic? to convey just what a catastrophe they believed his candidacy will be for their party.",
    "Still, Mr. Fetterman performed strongly in other counties that are home to significant Black populations, including Pittsburghs Allegheny County and Harrisburgs Dauphin County, and he was ahead in Philadelphia County.",
    "The biggest single test will be next Tuesday in Georgia, where Mr. Trump has backed a slate of candidates running on election-denial platforms against the incumbent governor, secretary of state and attorney general.",
    "In late April, with three primary rivals running to her right, Ms. Kleefisch said, I feel like it was rigged.?\nReporting was contributed by Jennifer Medina, Michael C. Bender, Maggie Haberman and Jonathan Weisman.",
    "In the Senate primary, Mr. Fetterman won every county in the state, according to the available data on Wednesday, though without exit polling, it is difficult to gauge precisely how he performed with Black voters.",
    "Mr. Cawthorn abruptly conceded the race to Mr. Edwards, shortly after praising Mr. Trump for his endorsement and expressing confidence that the final results would break in his favor to the cheers of supporters.",
    "A receipt filed with the secretary of states office showed that Ms. Carone had paid $125 in late fees with a check on March 24, three days after she signed the affidavit attesting that she did not owe anything.",
    "In his campaign office Wednesday, days after a racist mass shooting at a Buffalo supermarket, Mr. Edwards said he did not believe limiting gun ownership for law-abiding citizens would solve societal problems.",
    "Even before Mastriano clinched the nomination, Shapiros campaign aired an ad highlighting his views on abortion and the 2020 election as well as his ties to Trump, who lost the state to Biden by 80,000 votes.",
    "It was the second time in recent months that Ms. Carone had been disqualified as a candidate: The Macomb County Clerk & Register of Deeds barred her in March from the Aug. 2 primary for state representative.",
    "Mr. McCarthy, for his part, told reporters in March that he had spoken to Mr. Cawthorn after the freshman congressman had implied members of his own party invited him to orgies and to use cocaine with them.",
    "Conversations with Republican strategists, donors and lobbyists in and outside of Pennsylvania in recent days reveal a party seething with anxiety, dissension and score-settling over Mastrianos nomination.",
    "Mastriano has appeared at events linked to QAnon, the amorphous conspiracy theory that alleges there is a secret cabal of elite pedophiles running the federal government and other major U.S. institutions.",
    "They note that Shapiro performed better than Biden did in Pennsylvania during his re-election race as state attorney general, and expect Shapiro to be flooded with donations from in and outside the state.",
    "Brian Kemp in 2019, would ban abortion around six weeks, with exceptions for pregnancies that cannot come to term, that resulted from rape or incest or that must be ended because of a medical emergency.",
    "The only fault line that exists is between people who care about democracy and those who are autocratic, racist fascists who want to turn this nation into something that its never been,? Kenyatta said.",
    "But as Mr. Edwardss low-key postelection demeanor suggested, the states establishment seemed unwilling to claim victory when the word establishment itself has become an insult in Republican politics.",
    "As attorney general, Shapiro was directly involved in the Pennsylvania governments litigation after the 2020 election, and oversaw at least 40 cases of alleged voter fraud  winning every single one.",
    "This March, Mr. Mastriano held a campaign event in Gettysburg at which attendees signed a petition calling on Pennsylvania to decertify the states 2020 results, according to The York Daily Record.",
    "On one of the forms that was signed by Ms. Carone, she had attested that she did not have any unpaid fines for election law violations and that all of her public campaign filings were up-to-date.",
    "Ms. Carone claimed she was contracted by Dominion Voting Systems, an election technology company that has been the target of a baseless pro-Trump conspiracy theory about rigged voting machines.",
    "It has also rattled Republicans in Wisconsin, where one of the partys four major candidates for governor has made undoing Mr. Bidens 2020 victory in the state the central plank of his campaign.",
    "Some Republicans believe the national tailwinds? blowing in their favor might help Mastriano win despite all of his weaknesses, but for now, Democrats are thrilled to be facing him in November.",
    "And engaging and turning out Black voters in this falls general election will be among his campaigns biggest imperatives as he competes in one of the most closely divided states in the nation.",
    "voters are showing a willingness to nominate candidates who parrot Donald J. Trumps 2020 lies, making clear that this years races may affect the fate of free and fair elections in the country.",
    "In what could be a dangerous maneuver, Pennsylvania Democrats encouraged and tried to help Mr. Mastrianos candidacy, despite his election stance and his calls to make voting more difficult.",
    "The question haunts many party leaders, who worry that widespread disillusionment with President Biden and with politics more broadly will lead many younger voters to stay home in November.",
    "Mr. Perdue and Representative Jody Hice, who is challenging Brad Raffensperger, the secretary of state, have each falsely argued that rampant voter fraud marred the 2020 Georgia contests.",
    "The office said that Ms. Carone, along with 10 other legislative candidates, had made false statements on an affidavit that candidates were required to submit to election administrators.",
    "Matthew Brouillette, head of Commonwealth Partners, which bankrolled McSwains campaign, noted that his organization also backed Carrie DelRosso, who won the lieutenant governors race.",
    "In Pennsylvania, Kathy Barnette, a Jan. 6 rally attendee who pushed many false stolen-election claims and campaigned on a slate with Mr. Mastriano, placed third in the states G.O.P.",
    "And the two men locked in a photo finish for first place, Dr. Mehmet Oz and David McCormick, have also cast doubt on the 2020 election results, refusing to say Mr. Biden won fairly.",
    "John Fetterman of Pennsylvania in the states Democratic primary for an open Senate seat, went straight to that point when I met him at his watch party last night in Philadelphia.",
    "He has pushed measures to overhaul tax laws, enact a constitutional amendment for voter identification and require county sheriffs to work with immigration enforcement agencies.",
    "When Mr. Fetterman was the mayor of Braddock, Pa., he brandished a shotgun to stop and detain an unarmed Black jogger, telling police he had heard gunshots in his neighborhood.",
    "Senate nominee, Representative Ted Budd, who voted in Congress against certifying the 2020 results and who continues to refuse to say that Mr. Biden was legitimately elected.",
    "Asked Wednesday if he wanted a more total ban on abortion than the six-week prohibition passed by the Republican-controlled state legislature, Mr. Walker was unequivocal.",
    "remains committed to engaging in competitive gubernatorial contests where our support can have an impact.?\nThe statement left room for the possibility that the G.O.P.",
    "Gustavo Portela, a spokesman for the Michigan Republican Party, rejected Ms. Carones assertions that there was a concerted effort to keep her off the primary ballot.",
    "He organized buses to Washington for the Jan. 6, 2021, rally in Washington and can be seen on video crossing police lines at the Capitol as the rally became a riot.",
    "I believe in life.? He did not single out exceptions for rape, incest or the life of the mother specifically, but he said repeatedly that he wanted no exceptions.",
    "Mr. Perdue began a debate with Mr. Kemp by declaring: The election in 2020 was rigged and stolen.? Mr. Hice said he would not have certified Mr. Bidens victory.",
    "The former president has conditioned his endorsement, the most valuable seal of approval in Republican politics, on amplifying false claims about the election.",
    "What went unspoken was that many voters saw him as the establishment candidate who benefited from the boost of old-guard Republicans at home and in Washington.",
    "Its leftist politics are vastly different from Bidens centrism, but the group tends to rally behind the Democratic Partys official nominees once primaries end.",
    "On Tuesday night, the Republican Governors Association issued a lukewarm statement acknowledging Mastrianos victory, but suggesting he was on his own for now.",
    "An adviser to several Republican governors, speaking on the condition of anonymity, said there was wide displeasure with the outcome, calling him unelectable.",
    "Im tired of this big cloud of smoke about whats been going on.?\nThat ballot-counting phenomenon may, however, replay itself in Pennsylvanias Senate primary.",
    "And he declined to condemn the racist conspiracy theory that police say motivated the Buffalo gunman  and that has been echoed by members of his own party.",
    "Of the many unknowns hanging over the general election contests across the country this fall, a big one for Democrats is: Will young progressives turn out?",
    "Kenyatta, a gay Black man who recently married his longtime partner, said he was confident that Republican candidates were out of the cultural mainstream.",
    "Many said in interviews that they still supported Mr. Trump, but that they viewed Mr. Cawthorn as irresponsible, immature and unbecoming of public office.",
    "Yet throughout the primary campaign, Mr. Fetterman was dogged by a 2013 incident that could continue to shape how Black voters across the state view him.",
    "Pressed on Monday during an interview with the conservative network Real Americas Voice, Dr. Oz declined to say the election had been rigged or stolen.",
    "But he stressed that it would behoove Mr. Fetterman to try to do something to motivate the African American vote.?\nTurnout will be the key,? he added.",
    "He has declined to apologize or say he did anything wrong, and some party strategists worry that episode could affect turnout in the general election.",
    "A political group supporting Mr. Tillis, who endorsed Mr. Edwards, poured money into an ad campaign that painted Mr. Cawthorn as a fame-seeking liar.",
    "That unfounded theory essentially holds that elites are using immigration and falling birthrates to replace white people and destroy white culture.",
    "Terrible candidates seem to find it hard to take accountability for themselves so they pass the blame to others,? he said in an email on Wednesday.",
    "It makes it much harder for them to cheat with the ballots they just happened to find,? Mr. Trump wrote on Truth Social, his social media platform.",
    "Dr. Oz, who was endorsed by Mr. Trump, has said in his stump speech that we cant leave 2020 behind,? without articulating precisely what he means.",
    "I dont think were seeing enough of that right now.?\nWhile election issues have dominated several high-profile Republican primaries so far, G.O.P.",
    "In February, the committee demanded documents and information that are relevant to the select committees investigation? in a letter to Mastriano.",
    "More Takeaways: Democratic voters are pushing for change over consensus, nominating a left-leaning political brawler for Senate in Pennsylvania.",
    "Ive established that I can pass bills to outlaw sanctuary cities.?\nOf course, Mr. Cawthorns defeat was not solely the work of the establishment.",
    "She had also failed to file an annual statement for 2022 for her campaign and an amendment to a quarterly report last October, the letter said.",
    "Kenyatta had the backing of the Working Families Party, a scrappy progressive outfit centered in New York that supports like-minded candidates.",
    "A group is seeking to disbar Senator Ted Cruz of Texas for his involvement in the effort to overturn the 2020 election, Maggie Haberman scoops.",
    "He is likely to be an especially weak candidate in the crowded suburbs around Philadelphia, the states most important political battleground.",
    "By February, she was saying that she didnt know if Mr. Biden had won and she didnt know if she would have certified the states 2020 results.",
    "Jazmine Ulloa spoke with Chuck Edwards, the state lawmaker who ousted Representative Madison Cawthorn last night in western North Carolina.",
    "Mastriano gave scant indication during Tuesdays victory speech that he was ready to shift toward a more palatable general election message.",
    "But a Republican majority in Congress might find itself under pressure to pass national restrictions that could affect Democratic states.",
    "When talking to voters, many Republican candidates have focused heavily on a broader list of promises to restore conservative governance.",
    "Asked about those who saw him as the establishment figure in the race, Mr. Edwards said people had different definitions of the label.",
    "Had they spent $5 million in three weeks, they might have forced Trump to make a different choice and changed everything,? Katz added.",
    "He has refused to say whom he would appoint as secretary of state, a critical position overseeing election infrastructure and voting.",
    "Instead, fomenting doubts about Mr. Bidens victory is often the table stakes of Republican primaries that can tilt hard to the right.",
    "He said instead that he hoped a Republican governor would properly investigate the 2020 election and change the states voting laws.",
    "Mr. Cawthorn ended up changing his mind and returning to his old district after the new district was redrawn and tilted Democratic.",
    "Right now, the major players in governors races appear to be waiting to see how the race develops before making that determination.",
    "Republican voters in Pennsylvania have chosen Doug Mastriano as their nominee for governor,? Executive Director Dave Rexrode said.",
    "Other top North Carolina Republicans, including the states House speaker and State Senate leaders, also came to Mr. Edwardss side.",
    "As in the past, Mr. Trump has shown no desire to wait until one candidate has a decisive advantage before declaring a winner.",
    "Theres no exception in my mind,? he told reporters after a campaign speech in Macon, Ga., at the Georgia Sports Hall of Fame.",
    "A state senator and retired Army colonel, he spent $3,354 in campaign funds to charter buses to Washington on Jan. 6, 2021.",
    "Mr. Edwards jumped into the race after Mr. Cawthorn announced last year that he would run in a new district near Charlotte.",
    "Mr. Forlini said that it is a felony in Michigan to make a false statement on affidavits like those signed by candidates.",
    "But with tens of thousands of votes left to be counted, Mr. McCormicks campaign has expressed confidence he will prevail.",
    "And in many general-election races, candidates from both major parties are likely to focus on inflation and the economy.",
    "The Make America Great Again movement is dominating Republican primaries, Michael C. Bender and Maggie Haberman write.",
    "Thats the traditional pattern in midterm elections, and it is what happened in the Virginia governors race last year.",
    "The results make clear that the November midterms may well affect the fate of free and fair elections in the country.",
    "Up Next: Closely watched races in Georgia and Alabama on May 24 will offer a clearer picture of Mr. Trumps influence.",
    "Trumps Limits: The MAGA movement is dominating Republican primaries, but Mr. Trumps control over it may be slipping.",
    "Its a big problem,? said former Representative Charlie Dent, a Pennsylvania Republican, who added that the G.O.P.",
    "Mr. Trump has encouraged the decertification effort in Wisconsin and offered a late endorsement to Mr. Mastriano.",
    "There were party favors for guests: cupcakes, star-shaped sunglasses and beaded necklaces in red, white and blue.",
    "Outside Mr. Edwardss campaign headquarters, people strolling a shop-lined street were unsurprised by his win.",
    "From our standpoint, she was kicked off the ballot because she basically perjured herself,? Mr. Forlini said.",
    "Late Tuesday night on Twitter, Mr. Cawthorn congratulated Mr. Edwards on securing the Republican nomination.",
    "She accused Republican election officials and the partys leaders of conspiring to keep her off the ballot.",
    "It is true I have established conservative principles and a track record of getting things done,? he said.",
    "He has also been a leading advocate of the baseless claims that the 2020 election was stolen from Trump.",
    "The county clerk where Ms. Carone was running for office said on Wednesday that had not been the case.",
    "Mr. Trumps choice for governor, former Senator David Perdue, appears likely to fall short against Gov.",
    "A barrage of bad press and personal and political mistakes helped turn voters against Mr. Cawthorn.",
    "Most damaging were reports that he frequently missed votes and had abandoned constituency offices.",
    "All three races could wind up in runoffs if no candidate secures a majority of the primary vote.",
    "Its a constant source of frustration for Democratic strategists, since younger voters lean left.",
    "This is how our elected officials keep good candidates from getting elected,? Ms. Carone said.",
    "He wants to end vote by mail, and he led the fight to audit the 2020 election,? the ad says.",
    "Mr. Edwards said that when the two spoke that night, Mr. Cawthorn offered his full support.",
    "If elected, Mr. Walker would have no control over state-level abortion policy as a senator.",
    "Pete Ricketts of Nebraska, the co-chairman of the governors group, said on CNN on Sunday.",
    "Trump Endorsements: Most of the candidates backed by the former president have prevailed.",
    "candidates do not always place 2020 objections at the center of their pitches to voters.",
    "Most Americans think thats ridiculous.?\n Blake\nIs there anything you think were missing?",
    "His Democratic opponent this November, Senator Raphael Warnock, favors abortion rights.",
    "Still, the election issue hangs over several races in presidential battleground states.",
    "The decertification push has become the latest litmus test in 2020 election denialism.",
    "People wearily chatted around the foldout tables and compared results on their phones.",
    "Malcolm Kenyatta, a dynamic 31-year-old state representative who lost to Lt. Gov.",
    "governors might help Mastriano should the Pennsylvania race be close in the fall.",
    "Most people do not want to ban books and cancel Elmo and Mickey Mouse,? he said.",
    "John Fetterman of Pennsylvania at a campaign event here with a pressing message.",
    "The company called her claims defamatory and sent her a cease and desist letter.",
    "and Democrats across the country are dogged by Mr. Bidens low approval ratings.",
    "Dr. Oz on Wednesday morning had a lead of about 2,500 votes over Mr. McCormick.",
    "Mr. Kirkland supports Mr. Fetterman, and said that the candidate was receptive.",
    "Foldout tables were decked with small candy bowls and flower-vase centerpieces.",
    "Less than a week later, Mr. Fetterman is his states Democratic Senate nominee.",
    "Candidates who avoid the subject risk losing credibility with the partys base.",
    "YORK, Pa.  Last week, a leader of a historic Black cemetery cornered Lt. Gov.",
    "Our policy has long been we get involved in races where we think we can win.",
    "We make those decisions based on where we think we can be effective,? Gov.",
    "Photos and videos of him partying and emulating sexual antics circulated.",
    "On Wednesday, he urged Dr. Oz to declare victory and get on with things.",
    "Brian Kemp, whom Mr. Trump still blames for his 2020 loss in Georgia.",
    "Kenyatta told me he would do his level best? to help unite the party.",
    "You never know what a child is going to become,? Mr. Walker said.",
    "The Mastriano campaign did not respond to a request for comment.",
    "I dont focus on rhetoric, I focus on results,? Mr. Edwards said.",
    "How does someone gain that much overnight?? Mr. Ackelson said.",
    "Even if I dont end up on the ballot, my voice will be heard.",
    "Tabas did not respond to a request for comment on Wednesday.",
    "He also has made statements that veer into Islamophobia.",
    "A face painter waited for children to stop by her stand.",
    "Were just sticking to the letter of the law,? he said.",
    "But as night fell, the crowd grew larger and antsier.",
    "Will national Republicans help Mastriano or shun him?",
    "needs to show an alternative vision for the party.",
    "Senate primary with about 25 percent of the vote.",
    "But is the former president in control of it?",
    "Ive established that I can balance budgets.",
    "However, there are some noteworthy losses.",
    "In North Carolina, voters chose a G.O.P.",
    "That kind of stuff doesnt make me mad.",
    "Ive established that I can cut taxes.",
    "Theres so many questions,? he said.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "Like I say, I believe in life.",
    "It all comes down to turnout.",
    "Heres what else weve learned.",
    "Georgias law, signed by Gov.",
    "Wed love to hear from you.",
    "Im not going anywhere.",
    "Im going to fight it.",
    "The Stakes: G.O.P.",
    "I think its funny.",
    "Young turnout.",
    "The R.G.A.",
    "fits.",
    "base."
  ]
}