{
  "id": 4483,
  "mediaId": 238,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Opinion Republicans have only themselves to blame for unelectable big lie candidates",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/17/republicans-mastriano-barnette-unelectable-candidates/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Henry Olsen",
  "authorUrl": "https://www.washingtonpost.com/people/henry-olsen/",
  "termIds": [
    2095,
    3102
  ],
  "sentences": [
    "These candidates are not people who were duped by disinformation and have since moved on; they are active propagandists of a myth that serves no purpose other than to undermine faith in American democracy.",
    "Republican leaders in Pennsylvania are freaking out about the possibility that GOP voters on Tuesday might nominate candidates whose election denialism could lead to defeat in November.",
    "Trumps continued fixation on 2020 is obvious to all, yet no one in any leadership position will push back when he tries to make his toxic claims the central issue of the midterms.",
    "If they choose the former, they raise the profile of an issue they know will push moderates away from the GOP, even if those voters disapprove of President Bidens performance.",
    "Now Republican leaders might have to face their worst nightmare: having to choose between backing prominent election denialists or running away from their own nominees.",
    "Thats what could happen in Pennsylvania, where state Sen. Doug Mastriano and Kathy Barnette could capture the partys nods for governor and U.S. senator, respectively.",
    "In private, Republican leaders, including House Minority Leader Kevin McCarthy (Calif.), have angrily denounced former president Donald Trumps fevered fulminations.",
    "Many did that in private, including Senate Minority Leader Mitch McConnell (Ky.), who lobbied his caucus against challenging the electoral college results.",
    "Both candidates attended the Jan. 6, 2021, rally that preceded the Capitol riot, although theres no evidence that either participated in the violence.",
    "These people are not a majority; if they were, former senator David Perdue of Georgia would be winning his challenge against incumbent Republican Gov.",
    "Republican leaders could have come out publicly in December 2020 after Trumps court challenges failed to produce even the slightest evidence of fraud.",
    "Still, the 20 to 30 percent of the party dedicated to the untruths of a stolen election can carry the day in multicandidate races with no runoff.",
    "If they choose the latter, they do so without any plausible explanation for voters who have been allowed to believe the lie of a stolen election.",
    "They could have united to say that voters have spoken and that its our patriotic duty to rally behind the result, even if we disagree with it.",
    "They also organized buses for others to attend, and Mastriano has continued to agitate for audits of the election in Pennsylvania and Arizona.",
    "Winston Churchill is often quoted as saying that Americans can be trusted to do the right thing only after they have tried everything else.",
    "In public, however, few say what they know to be true: Trump lost because he alienated too many GOP-leaning, college-educated suburbanites.",
    "Republican voters widely believe the myth that the 2020 election was stolen despite an utter lack of convincing evidence.",
    "But most Republicans shrank from an open challenge to Trump, wrongly believing his anger would eventually subside.",
    "Trump once said he would love to debate someone on 2020 fraud; imagine the ratings bonanza that could have been.",
    "No third party has been surreptitiously engaged to fight the battle for public opinion in conservative media.",
    "Why should they believe party leaders who belatedly declare such beliefs as beyond the pale for the party?",
    "Imagine if Fox News had invested resources into reviewing Trumps claims and showed how spurious they are.",
    "The result is that a vocal minority of Republicans want to rectify 2020 in the coming midterms.",
    "Republican leaders have tried everything else and failed to suppress the stolen election myth.",
    "No GOP leader has made speeches from the floor presenting evidence to disprove Trumps lies.",
    "No major conservative media outlet has systematically tried to push back against the lies.",
    "Imagine if one of its hosts had commissioned an investigative report airing these facts.",
    "Most have demurred from confronting Trump, allowing election lies to spread.",
    "Even the Capitol riot failed to roust them from their stupor.",
    "If that happens, they have only their cowardice to blame.",
    "The fault does not simply lie with political leadership.",
    "Brian Kemp rather than trailing him badly in the polls.",
    "Maybe its time for them to do the right thing.",
    "No one on the right took up the offer.",
    "It didnt have to be that way."
  ]
}