{
  "id": 5470,
  "mediaId": 132,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "GOP voters aren't Trump zombies",
  "image": "https://www.newsday.com/_next/image?url=https%3A%2F%2Fcdn.newsday.com%2Fimage-service%2Fversion%2Fc%3ANWQ0MmMyYzUtZTcxZi00%3AOTMzMjAx%2Fus-news-ohiosenate-primary-jpg.jpg%3Ff%3DLandscape%2B16%253A9%26w%3D770%26q%3D1&w=3840&q=60",
  "link": "https://www.newsday.com/opinion/commentary/republican-primaries-rpp18ksi",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Bernstein",
  "authorUrl": "",
  "termIds": [
    1106,
    1147,
    1801,
    1813,
    2303,
    2524,
    3102,
    3103,
    3995,
    428,
    571
  ],
  "sentences": [
    "So when the Washington Post's Annie Linskey says that \"Trumpism is having a better record than Trump himself tonight,\" I'd say that the strain of the party that emerges as Trumpism or Tea Partyism or Gingrichism or Nixonism or McCarthyism  and yes, there are differences among those incarnations of right-wing radicalism but it's not hard to see continuity as well  is particularly dominant within the party now, but it just doesn't have all that much to do with Trump.",
    "What I'd add is that party actors  the Club for Growth, big individual funders such as the Silicon Valley billionaire and Vance backer Peter Thiel, politicians with local clout such as Republican Senator Thom Tillis in North Carolina, a big player in Cawthorn's defeat, and most of all Republican-aligned media such as Fox News and talk radio hosts  are probably a much bigger story in terms of actually moving votes than Trump is.",
    "So while these primary results will have some diminishing effect on Trump's clout within the party, and that's important too, do not imagine that today's Republican Party will become anything like the one led by Ronald Reagan or Bob Dole or Howard Baker, regardless of what happens in the rest of this year's primaries.",
    "Sure, he's successfully pushed candidates to talk about fictional fraud in the 2020 election, but Republicans were obsessed with fictional voter fraud long before Trump began his 2016 campaign, and resentment has been a winning theme in Republican politics far longer than that.",
    "Let's be clear about the lessons that can be drawn so far from this year's Republican midterm primary elections: Republican voters are not behaving like zombies who automatically do what former President Donald Trump tells them to do.",
    "In North Carolina, Ted Budd won the Senate primary with almost 60% of the vote, but experts attributed that more to heavy spending from the conservative Club for Growth than to Trump's endorsement, which was one of many for Budd.",
    "But McGeachin is lieutenant governor of Idaho and the radical portion of the party that backed her challenge to the sitting governor is strong in that state; it seems likely that Trump added very little there.",
    "On the other hand, while many House incumbents Trump endorsed won easily, as incumbents almost always do in primary elections, one of them lost: North Carolina's Madison Cawthorn, with 32% of the vote.",
    "Moreover, while it's convenient to slap the Trumpism label on the radicalism of the dominant coalition within the party, it's far from clear that Trump has much say in what Trumpism actually means.",
    "And Trump jumped very late onto the bandwagon of gubernatorial hopeful Doug Mastriano in Pennsylvania, but I doubt many will attribute much of his 44% showing to the last-minute endorsement.",
    "But the Republican Party was dysfunctional before Trump joined it, and if he decided tomorrow to quit politics, the party would still be dysfunctional and a threat to U.S. democracy.",
    "And should he regain the presidency, he remains dangerous to democracy precisely because he's so bad at normal politics, not to mention unusually contemptuous of the rule of law.",
    "But I'll disagree with elections analyst Nathan Gonzalez, who tweeted on Wednesday, \"This is still Trump's GOP whether his endorsed candidates win or not.\"",
    "I think political scientist Nadia Brown is closer to the mark in her comment about Pennsylvania: \"The hot takes will all be about Trump & his influence.",
    "A former professor of political science at the University of Texas at San Antonio and DePauw University, he wrote A Plain Blog About Politics.",
    "With Pennsylvania, Idaho and North Carolina speaking on Tuesday, a strong pattern regarding candidates endorsed by Trump has emerged.",
    "That's not nothing, but it does mean that two-thirds of Republican primary voters are either ignoring or opposing his wishes.",
    "There's more to the story of Trump's influence than the fact that most Republican voters ignore or oppose his endorsement.",
    "His endorsement may not be treated as holy writ, but it doesn't have to be to make a difference in close primaries.",
    "In Pennsylvania this week, Mehmet Oz has 31% of the vote in a Senate primary that's still too close to call.",
    "And in Idaho, also this week, Janice McGeachin lost the nomination for governor with around 29% of the vote.",
    "Surely Oz's fame as a celebrity TV doctor would have won him some votes in Pennsylvania, Trump or no Trump.",
    "This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.",
    "Trump is the kingmaker because everything he does is covered & less attention is paid to the candidate.\"",
    "Yes, there's a good chance Vance would have wound up as a single-digit also-ran without the endorsement.",
    "In Nebraska a week later, Charles Herbster lost the gubernatorial nomination with 29% of the vote.",
    "Jonathan Bernstein is a Bloomberg Opinion columnist covering politics and policy.",
    "He's probably the single Republican most able to focus resentment and grievance.",
    "Win or lose, then, Trump's candidates are winning about a third of the vote.",
    "None of which is to dismiss Trump as a major player in Republican politics.",
    "Trump's endorsed candidates did better in two other contests.",
    "He may well win the party's presidential nomination in 2024.",
    "Vance won the Senate nomination with 31% of the vote.",
    "Trump's real effect is surely smaller than that.",
    "He's popular among Republican voters.",
    "I'm so over this angle of reporting.",
    "In Ohio on May 3, J.D."
  ]
}