{
  "id": 5475,
  "mediaId": 233,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Fetterman wins Pennsylvania Democratic Senate primary; NC polls close; live primary results",
  "image": "https://www.gannett-cdn.com/presto/2022/05/15/PSAL/889e7ba7-4f31-4c3c-bc8e-4e852ee9cbf7-electionvoters_bch114.jpg?crop=5471,3078,x0,y278&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/elections/2022/05/17/primaries-pennsylvania-nc-live-updates/9570502002/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    821,
    2303,
    3102,
    3103
  ],
  "sentences": [
    "Election officials scrambling amid paper shortage\n34 candidates for Oregon governor's mansion\nIn one of the most competitive Oregon gubernatorial primaries in decades, 34 candidates from both sides of the aisle will find out after Tuesday night who will move on to November's general election with a chance to secure Oregon's governorship.",
    "There are growing conspicuous problems in the state (such as homelessness) and rising daily expenses due to national inflation they can try to pin on Democrats, as well as the historical advantage the out-of-power party has during a midterm election and the unknown impact of nonaffiliated candidate, former Sen. Betsy Johnson.",
    "Cawthorn faces primary challenger backed by Tillis in crowded field\nGOP Rep. Madison Cawthorn, who has run afoul of his party's leadership during his first term in Congress, now faces a jumbled primary field that includes a candidate with the backing of one of North Carolina's top Republicans.",
    " Orlando Mayorquin\nIn Kentucky, eyes on races for Yarmuth, Paul congressional seats\nThe headliners of Kentucky's congressional races this year are the competition to succeed U.S. Rep. John Yarmuth, who's retiring, and U.S. Sen. Rand Paul's reelection bid.",
    "-- Candy Woodall\nResults: Cheri Beasley wins North Carolina Democratic Senate primary\nFormer chief justice of the North Carolina Supreme Court Cheri Beasley easily won the Democratic primary to replace retiring GOP Sen. Richard burrs Senate seat Tuesday.",
    "But because of this, we're not going to have final election results from these mail ballots for probably several days, so that is very, very frustrating to us.?\n-- Candy Woodall\nPennsylvania's Fetterman to undergo medical procedure\nPennsylvania Lt. Gov.",
    " Rick Rouan\nNorth Carolina primaries set up general election battleground for Senate control\nThe candidates who emerge from North Carolina's major party primaries for U.S. Senate will be on the frontline in the fight for control over the upper chamber.",
    " Adam Duvernay, The Register-Guard\nTrump influence on the ballot in Pennsylvania GOP Senate primary\nFormer President Donald Trump's hold over the Republican Party again will be tested in Pennsylvania's GOP primary for an open U.S. Senate seat.",
    "The Republican governor's race in Pennsylvania was too close to call in early voting\n-- David Jackson\nA first for the AAPI community in Pennsylvania\nThe primary election Tuesday marked a first for the Asian American community in Pennsylvania.",
    "State political analysts believe the top candidates in the race on the Republican side are: conservative writer Bridget Barton, former Oregon House Republican Leader Christine Drazan, tech CEO Jessica Gomez, Salem oncologist Dr.",
    "After the poll was released, Trump released a statement saying Barnette didn't have a chance to win the general election but praised her as having \"a wonderful future in the Republican Party\" if she goes on to win the primary.",
    "Though Sabatos Crystal Ball has predicted Republicans to win the majority of U.S. Senate races, forecasters there said outlooks in Arizona and Pennsylvania are admittedly murkier.?\n-- Candy Woodall\nWhen do the polls close?",
    "-- Candy Woodall\nResults: Josh Shapiro wins Democratic nomination for governor of Pennsylvania\nAttorney General Josh Shapiro won the Democratic nomination for governor of Pennsylvania on Tuesday, according to CNN and NBC.",
    "Senate race will be a toss up? regardless who wins primary, analyst says\nThe U.S. Senate race in Pennsylvania will be a toss up? regardless of who wins the Democratic and Republican primaries Tuesday, an analyst said.",
    "Fetterman has polled double-digits ahead of the competition for months and attracted more than 200,000 individual donors throughout his campaignthe most of any candidate in either party in the states U.S. Senate race.",
    "Republican strategists said the midterms will ultimately be a referendum on the past two years of Democratic control, with voters more concerned about rising inflation and an influx of migrants at the southern border.",
    " Candy Woodall\nThe Roe v. Wade decision could upend the midterms\nThe blockbuster leak of a draft Supreme Court opinion overturning the landmark Roe v. Wade decision jolted a midterm election season already underway.",
    ":What to know about open and closed congressional primaries\nThe day in photos:Voters head to the polls for primary elections in five states\nJohn Fetterman wins Dem nomination for U.S. Senate\nPennsylvania Lt. Gov.",
    "Party feuds mark races in Idaho  the Republican governor faces the Republican lieutenant governor  and Oregon, where two well-funded Democrats face off for nomination in a newly created congressional district.",
    " Katie Wadington\nSome Pennsylvania ballots could take longer to read\nAt least 21,000 mail-in ballots in Pennsylvania are unreadable and will take several days to process, officials in Lancaster County said.",
    "-- Candy Woodall\nPennsylvanias Democratic Senate primary a contrast in styles\nThe Democratic primary for Pennsylvanias open U.S. Senate seat pits a pair of politicians building different kinds of support.",
    "On the Democratic ballot is only Stephen Heidt, an English as a Second Language teacher at Idahos state prisons who filed his candidacy the day before the state deadline, the Idaho State Journal reported.",
    "A printing error is the cause of the problem and seems to only be affecting ballots in Lancaster County, where voters are choosing candidates to compete for governor, lieutenant governor and U.S. Senate.",
    " Mabinty Quarshie\nKentucky election : Rand Paul wins re-nomination as U.S. senator\nThe first call of the night has been made, and it is not a shock: U.S. Sen. Rand Paul of Kentucky has won re-nomination.",
    "His experience in Congress and prior election victories in Pennsylvania have made him the preferred candidate of major organizations like the Philadelphia Inquirer and the Philadelphia Democratic Party.",
    "Trump endorsed celebrity television star and surgeon Mehmet Oz, also known as Dr. Oz, in the race over Dave McCormick, a former hedge fund manager, and conservative political commentator Kathy Barnette.",
    "The 6 foot 9 inch Fetterman whose preference for collared work shirts over suits first drew national attention for his role as mayor of Braddock, a hollowed-out steel town he is credited with reviving.",
    "The endorsement came shortly after Cawthorn was scolded by House Minority Leader Rep. Kevin McCarthy over Cawthorn's claim on a podcast that members of Congress were engaging in cocaine-fueled orgies.",
    "A gubernatorial race hasn't been this unsettled since 2002, when three viable candidates each from both sides of the aisle battled it out in the two primaries, the Salem Statesman-Journal reported.",
    "Leading the Republican primary is state Sen. Doug Mastriano, whose efforts to overturn the 2020 election in favor of Trump and ties to QAnon have raised concerns both in and outside the party.",
    "Most of the attention is on the Republican primary for a U.S. Senate seat in Pennsylvania, where Dr. Mehmet Oz battles conservative commentator Kathy Barnette and businessman David McCormick.",
    "Experts fear it will drive them away\nBig race for Wyden's Senate seat in Oregon\nThere are 10 candidates in the running to get the job of U.S. Sen. Ron Wyden, D-Ore., including the incumbent.",
    "Citizens deserve to have accurate results from elections and they deserve to have them on election night, not days later,? County Commissioner Josh Parsons said during a news conference.",
    "Scandal-plagued U.S. Rep. Madison Cawthorn, R-N.C., faces primary challengers who include state senator Chuck Edwards, who has the backing of prominent Republicans in the Tar Heel State.",
    "Republicans seek voting extension\nPennsylvania Republicans in Allegheny County, where Pittsburgh is located, are in court to seek a voting extension, according to the Associated Press.",
    "The biggest and most publicized primary action of the 2022 mid-term election year so far takes place Tuesday with contests in Pennsylvania, North Carolina, Kentucky, Idaho and Oregon.",
    "Oz hopes Trumps influence will come to bear in the same way it did in the Ohio Senate race, where the former president lifted conservative commentator and political outsider J.D.",
    "John Fetterman, a Democratic frontrunner in the U.S. Senate primary race, said Tuesday evening his medical procedure to implant a pacemaker with a defibrillator was successful.",
    "Democrats believe public opinion is on their side, and President Joe Biden set out to frame the potential Roe decision as the latest example of an extreme \"ultra MAGA agenda.\"",
    "A Republican hasn't held the state's top elected office in 35 years, but most of the 19 candidates have said this year could represent a perfect storm for the Oregon GOP.",
    "- Rick Rouan\nGovernor's races in Pennsylvania, Oregon, Idaho\nThree states  Pennsylvania, Oregon and Idaho  will on Tuesday select their party's candidates for governor.",
    "Short answer is well see how the cards fall after the primary, but Leans R seems a likelier potential move than Leans D, *if* we had to change it,? he said on Twitter.",
    "Paul defeated five little-known challengers in the Republican primary Tuesday, and the Associated Press called the race just ten minutes after all the polls closed.",
    "They both have been deeply engaged in Oregon politics for years, but say the problems the state faces now can be attributed to failures outside of their control.",
    "Nonetheless, McCormick, who headed a hedge fund before his Senate run, has tried to assure voters that he is the closest aligned to Trumps America First? agenda.",
    "He is also most-known for signing North Carolinas bathroom bill\" in 2016, which prohibited trans people from using restrooms that matched their gender identity.",
    "Kathy Barnettes late surge alarmed many in the GOP, including Trump, who in a statement last week said he believed Barnette could not win a general election.",
    "John Fetterman, a front runner for the Democratic nomination for U.S. Senate, will undergo a medical procedure to receive a pacemaker with a defibrillator.",
    "Lancaster County, another large county in Pennsylvania, earlier reported that at least 21,000 mailed ballots could not be read because of a printing error.",
    "And if there are any changes, the political pendulum is more likely to swing toward leaning Republican? than leaning Democrat,? especially if Lt. Gov.",
    "In addition to Pennsylvania, Sabatos Crystal Ball has three other states rated as toss ups? in the 2022 U.S. Senate race: Arizona, Georgia and Nevada.",
    "-- Mabinty Quarshie\nResults: Rep. Ted Budd wins North Carolina GOP Senate primary\nRepublican Rep. Ted Budd bested 14 opponents including former Gov.",
    "Kentucky's polls close first, at 6 p.m. local time (with the state divided in half by time zones, that means polls will close at both 6 and 7 p.m.",
    "Despite his lead throughout the campaign, questions mounted in recent days about whether a recent stroke would change the trajectory of the race.",
    "John Fetterman, who is recovering from a stroke and subsequent surgery to implant a pacemaker, won the Democratic nomination for U.S. Senate.",
    "Now back to resting + recovering!?\nFetterman shared the update on his health an hour and 40 minutes before the polls closed in Pennsylvania.",
    "A former George W. Bush administration official, McCormick had spent the earlier part of the race jockeying with Oz for Trumps endorsement.",
    "Thats a significant amount in a state with a crowded field of contestants and the lower turnout that tends to accompany primary elections.",
    "John Fettermans storied rise through politics may reach a new milestone today as he enters the Democratic Senate primary a heavy favorite.",
    "Its the state that delivered President Joe Biden the White House in 2020 and helped to send a record number of women to Congress in 2018.",
    "In Yarmuth's district, Democrats Kentucky Senate Minority Leader Morgan McGarvey and state Rep. Attica Scott are vying for the open seat.",
    "The winner is likely to face former North Carolina Supreme Court Justice Cheri Beasley, who is running in a large field of Democrats.",
    "Paul will be opposed by Charles Booker, an unsuccessful 2020 Senate candidate who won the Democratic primary in Kentucky on Tuesday.",
    "Now the previously little-known conservative commentator is in a virtual three-way tie atop the polls heading into todays primary.",
    "The pacemaker will help to protect his heart and treat the atrial fibrillation that led to his stroke, his campaign said Tuesday.",
    "They contend their particular backgrounds and understanding of how state government functions have prepared them to lead Oregon.",
    "On the Democratic side, former Oregon House Speaker Tina Kotek and Oregon Treasurer Tobias Read lead a field of 15 candidates.",
    "He has faced criticism for trying to bring a gun through airport security and for charges of driving with a revoked license.",
    "This year, the U.S. Senate race in Pennsylvania could determine which party controls the upper chamber of Congress in 2023.",
    "He hasnt managed to put much distance between him and his opponents in the polls in what has come down to a three-way race.",
    "Pennsylvania is always a major battleground and one of the most consequential states in midterm and presidential elections.",
    "Voters answered those questions Tuesday when they delivered a win for Fetterman and put his name on the ballot in November.",
    "Paul is a lock to win his primary, and Democrat Charles Booker of Louisville is likewise expected to sail through his own.",
    "The governor and lieutenant governor of Idaho don't run for office on a joint ticket, according to the Idaho Capital Sun.",
    "This primary Election Day is the first this cycle to cover several time zones, so results will roll in through the night.",
    "He remains hospitalized at Penn Medicine Lancaster General Hospital, but said doctors expect him to make a full recovery.",
    "He currently leads the nine-person field by an average of 10 points, according to Real Clear Politics' latest polling.",
    "Donald Trump tapped TV host Mehmet Oz, better known as Dr. Oz, to be his candidate in the Senate race in Pennsylvania.",
    "Still, Lamb has lagged in the polls behind Fetterman and will need to defy expectations to become his partys nominee.",
    "Here's where it might matter most\n-- Joey Garrison\nThe news comes to you:Sign up for the OnPolitics newsletter\nPenn.",
    "\"It's kind of a sleepy primary,\" Secretary of State Michael Adams said of Kentucky's congressional races this year.",
    " Morgan Watkins, Louisville Courier-Journal\nSupply chains hit the midterms:An election without 'I voted' stickers?",
    "The contest will pit political novices against several candidates who have run for or held public office before.",
    "U.S. Sen. Thom Tillis endorsed Cawthorn's most well-funded primary opponent, state Sen. Chuck Edwards, in March.",
    "Hes doing great and will have a full recovery,? his wife, Gisele Fetterman, said to USA TODAY Tuesday afternoon.",
    "Pittsburgh-area Rep. Conor Lamb has built a wave of support among his partys elected officials in Pennsylvania.",
    "Fetterman has largely eschewed endorsements from the states top Democrats while rising to the top of the polls.",
    "We got the all-clear that it was successful, and that Im on track for a full recovery,? he said in a statement.",
    "Budds victory, called by the AP shortly after polls closed, is another notch in Donald Trumps endorsement belt.",
    "If Beasley is elected in the general election in November, she will be the Tarheel States first black senator.",
    "Fetterman said his stroke was caused by a blood clot from his heart being in an irregular rhythm for too long.",
    "Beasleys top competitor state Sen. Jeff Jackson dropped out the race last year and threw his support for her.",
    "The county is Pennsylvanias second-largest population base, and multiple precincts there ran out of ballots.",
    "Polls have now closed in Pennsylvania, Kentucky and North Carolina, with some election results trickling in.",
    "John Fetterman said in a statement Sunday he went to the hospital Friday, where he was treated for a stroke.",
    "A former steel town mayor, Fetterman unseated an incumbent in 2018 to become the states lieutenant governor.",
    "John Fetterman won the Pennsylvania Senate Democratic primary; he suffered a stroke just a few days ago.",
    "Shapiro tweeted earlier in the day that he has COVID and was unable to appear in public on primary day.",
    "Pat McCrory and state Rep. Mark Walker to win North Carolinas open Senate primary seat Tuesday night.",
    "Vance from his middling showing in polls to winning a crowded race for Ohio's GOP Senate primary.",
    "Pat McCrory, former Rep. Mark Walker and a host of other candidates in Republican primary polls.",
    "The doctors quickly treated him and removed the clot, effectively reversing the stroke, he said.",
    "An astonishing 15 Democrats and 19 Republicans are running to replace incumbent Democratic Gov.",
    "She raised over $3.6 million in the first three months of this year, according to her campaign.",
    "Beasley has been amassing a war chest to help propel her in the primary and general elections.",
    "It is a standard procedure? used to regulate heart rate and rhythm, according to the campaign.",
    "Oz is trying to capture some of the same magic from Trump's backing that propelled author J.D.",
    "The Cook Political Report and Sabato's Crystal Ball both rate the seat as \"leans Republican.\"",
    "The states Democratic Party backed him in the primary alongside throngs of elected Democrats.",
    "Oz has the backing of former President Donald Trump, but Barnette has surged in recent polls.",
    "The winner of the Republican primary will be qualified for the general election in November.",
    "Oz still had a small lead over McCormick in the poll, 22% to 20%, but Barnette was surging.",
    "It will take election workers there days to redo the ballots that cant be read by machines.",
    "Former President Donald Trump is backing Rep. Ted Budd, who has surged ahead of former Gov.",
    "In Pennsylvania, just one Democrat is seeking to take the spot of incumbent Democratic Gov.",
    "Voters have picked Democratic House Rep. Conor Lamb over a Republican opponent three times.",
    "After capturing only 9% in a March survey, Barnette was up to 19% in the latest Fox poll.",
    "He has fended off attacks from Lamb and other candidates in the race that he is extreme.",
    "Beasley has also consistently out fundraised both Republican and Democratic candidates.",
    "McCrory was painted as a Republican in name only by the conservative Club for Growth.",
    "Trump narrowly edged out President Joe Biden in North Carolina in the 2020 election.",
    "Out of the 67 counties in Pennsylvania, Lancaster County is the sixth most populous.",
    "He cast his vote Tuesday from his hospital room using an emergency absentee ballot.",
    "A Fox News poll released May 10 showed a tight three-way race in the GOP primary.",
    "Budd will likely face Democrat Cheri Beasley in the general election in November.",
    "The Republican incumbent is also favored to win the general election in the fall.",
    "Janice McGeachin, who will face off in the state's Republican primary Tuesday.",
    "For the first time, voting materials were offered in Chinese in Philadelphia.",
    "Read the whole story here:The Roe v. Wade decision could upend the midterms.",
    "Three candidates, including Wyden, are competing in the Democratic primary.",
    "At the primary level, though, politicos don't expect to see any big upsets.",
    "Vance from the middle of the pack in the polls to the GOP primary victory.",
    " Ella Lee\nMidterms:Election workers faced new threats after 2020 election.",
    "Tom Wolf, who is term-limited: Pennsylvania Attorney General Josh Shapiro.",
    "That's followed by North Carolina at 7:30 p.m. then Pennsylvania at 8 p.m.",
    "It was the first time Asian language appeared on any Pennsylvania ballot.",
    "Bud Pierce, Sandy Mayor Stan Pulliam and former Oregon Rep. Bob Tiernan.",
    "That winning candidate will face the winner of the Democratic primary.",
    "Miles Coleman, associate editor of Sabatos Crystal Ball, said Tuesday.",
    "The other candidates in the race all have polled in the single-digits.",
    "Lamb flipped a Republican House seat blue in a 2018 special election.",
    "John Fetterman substantially in the public polling done on the race.",
    "In the Mountain Time Zone, Idaho's polls close at 8 p.m., or 10 p.m.",
    "And on the West Coast, Oregon's polls close at 8 p.m. PT, or 11 p.m.",
    "Voters were previously able to vote in English and Spanish only.",
    "-- David Jackson\nFetterman says surgery was successful\nLt. Gov.",
    "In Oregon's Republicans primary, seven candidates in the hunt.",
    "And in Idaho, a bitter civil war stirs between sitting Gov.",
    "Thank yinz for the well-wishes  it means the world to me.",
    "The former president endorsed Budd nearly a year ago.",
    "Fetterman added that he suffered no cognitive damage.",
    "At 26, Cawthorn is the youngest member of Congress.",
    "John Fetterman wins the Democratic nomination, J.",
    "People are also keeping an eye on North Carolina.",
    "Western states Oregon and Idaho will close next.",
    "Oregon's gubernatorial race is a crowded field.",
    "But Oz is far from a comfortable favorite.",
    " Connor Radnovich, Salem Statesman-Journal",
    " Orlando Mayorquin\nWho is Dave McCormick?",
    " Orlando Mayorquin\nWho is Kathy Barnette?",
    "They will take several days to process.",
    " Rick Rouan\nWho is John Fetterman?",
    "Brad Little and sitting Lt. Gov.",
    "Kate Brown, who is term-limited.",
    "What to know about Fetterman.",
    "But Lamb has trailed Lt. Gov.",
    " Rick Rouan\nWho is Mehmet Oz?",
    "What to know about McCormick.",
    "A bid that ultimately failed.",
    "What to know about Barnette.",
    "-- Candy Woodall\nU.S. Penn.",
    "What is a primary election?",
    "What to know about Lamb.",
    "What to know about Oz.",
    "Pennsylvania Lt. Gov.",
    "Who is Conor Lamb?",
    "He ran unopposed.",
    "Lt. Gov.",
    "ET).",
    "ET.",
    "ET."
  ]
}