{
  "id": 6557,
  "mediaId": 129,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Johnny Depp and Other Pirates",
  "image": "https://static01.nyt.com/images/2022/05/21/opinion/21Dowd/21Dowd-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/21/opinion/johnny-depp-george-w-bush.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    913,
    1539,
    2030,
    2087,
    3102,
    5262,
    5312,
    2558,
    2590,
    2942,
    2959
  ],
  "sentences": [
    "As Reid Epstein wrote in The Times, Republican voters in Pennsylvania anointed right-wing gubernatorial candidate Doug Mastriano, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.?\nMastriano spread conspiracies about 2020 phantom ballots, hacked machines and dead voters.",
    "He denounced the decision of one man to launch a wholly unjustified and brutal invasion of Iraq.? He quickly corrected himself and clarified that he was talking about Vladimir Putin, saying, I mean of Ukraine.? But then added, shaking his head, Iraq, too.?\nThe Bushes always told me that they did not like to be put on the couch.? But this time, W. put himself on the couch.",
    "I could decertify every machine in the state with a stroke of a pen via the secretary of state.?\nHe also appeared at a far-right Christian conference organized by QAnon prophets that started with a video about ritual child sacrifice? and a global satanic blood cult.?\nIn another shameful spectacle, truth is a matter of no importance to the rabid fans of Johnny Depp.",
    "The anchors with him looked uncomfortable as he spilled the tea and warned Russians not to take informational sedatives.?\nWe are in total geopolitical isolation and the whole world is against us, even if we dont want to admit it,? said the colonel, Mikhail Khodaryonok, who is now a conservative columnist and TV analyst on military affairs.",
    "But Disney honchos told me the Mouse House was already turned off by a 2015 incident when Heard falsified documents to smuggle their Yorkshire terriers into Australia, where the fifth installment of the Pirates of the Caribbean? franchise was being filmed, and then, when caught, sent the pups back to California on a private plane.",
    "A few days later, he came back on TV to change his tune and denounce Western-made weapons, even though the pathetic spectacle of outdated and ineffective Russian weapons in Ukraine has given American military officials a snazzy new sales pitch to sell our weapon systems.",
    "He bragged that he would be happy to purloin the 2024 election, noting: I get to appoint the secretary of state whos delegated from me the power to make the corrections to elections, the voting logs and everything.",
    "For the 75-year-old former president, it was a moment of self-incrimination worthy of Dostoyevsky  a display of conscience and a swerve into truth in a time when truth seems lost in the mist.",
    "When a retired colonel blurted out the truth Monday on Russian state television, saying the situation for us will clearly get worse,? it was another uncommon confessional moment.",
    "They call Heards claims of domestic violence a hoax and cheer on Depp lawyer Camille Vasquez, in a sort of online Roman coliseum, whenever she asks a tough question of Heard.",
    "His former business manager testified that the star was throwing away money, spending $300,000 a month on staff and thousands a month on prescription drugs.",
    "He blamed Heards op-ed in The Washington Post, in which she said she was a victim of domestic abuse without naming Depp, for hurting his career as a pirate.",
    "Depp is locked in a lurid showdown with ex-wife Amber Heard in a courtroom in a Washington suburb, a trial that an insider described to me as O.J.",
    "Heard and Depp have shared the most debasing, sickening stories from a relationship where they clearly brought out the worst in each other.",
    "Surrounded by sycophants, Depp deceived himself that his alcohol and drug use was not upending his career, relationships and life.",
    "Putin has pulled the wool over the eyes of a nation, deceiving Russians about the Ukraine war the same way he deceived himself.",
    "Whatever the jury decides, a man who was once the King of Cool now seems like a washed-up, abrasive shell of his former self.",
    "Disney was also upset about the incident where part of Depps finger got cut off during a marital fight and delayed filming.",
    "Depp fans resemble Trump fans in their blind loyalty and willingness to set aside ugly facts about their hero.",
    "Everybody wants something.?\nAnd Depp stans at the courthouse will hear no evil about Captain Jack Sparrow.",
    "Theyll try, but they dont want to lose their job.? He added: Its a strange thing around people like him.",
    "During a speech at his presidential library in Dallas, Bush made the mother of all Freudian slips.",
    "Contrary to his insouciant image, he was angry and jealous, those who knew him testified.",
    "WASHINGTON  We got a rare glimpse of the tortured soul of George W. Bush this past week.",
    "Bruce Witkin, a former Depp friend, described the veil of pretense around him.",
    "Heard added to the circus atmosphere when she fired her well-respected P.R.",
    "guru who has been accused of inappropriate sexual behavior himself.",
    "on cocaine.?\nLike Trump fans, Depp fans act like theyre in a cult.",
    "Everywhere we look, we are deluged with deception and Big Lies.",
    "The people on the payroll wont really say much,? he said.",
    "All across the world, customized facts are the rage.",
    "primaries Tuesday, lies were rewarded.",
    "Truth has left the building.",
    "firm and hired a P.R.",
    "In the G.O.P."
  ]
}