{
  "id": 6561,
  "mediaId": 195,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Pa. GOP governor hopeful Mastriano wrote thesis warning of left-wing Hitlerian Putsch",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/mastrianodoug_051822_ap-Carolyn-Kaster_electiondeniers.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3496019-pa-gop-governor-hopeful-mastriano-wrote-thesis-warning-of-left-wing-hitlerian-putsch/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    3102,
    5374,
    428,
    542,
    5171,
    2862,
    2945
  ],
  "sentences": [
    "The assault? on the miltiary, according to Mastriano, began with the insertion of homosexuality into the military.?\nThe paper was posted on a website affiliated with the Department of Defense, although the paper said its content does not represent the views of the U.S. government.",
    "The thesis, first reported by The Washington Post, is titled The Civilian Putsch of 2018: Debunking the Myth of a Civil-Military Leadership Rift.? Mastriano was a U.S. Army major at the Air Command and Staff College at the time.",
    "The moral underpinnings of the US military were replaced by a neo-pagan worldview, transforming it into a docile social service institution unable to pose any of the imagined threats to the republic,? Mastriano wrote.",
    "In the paper, written from the perspective of a military colonel hiding in a forest, a dictator has gotten rid of the Constitution and declared martial law in the U.S., and millions have perished in a purge.",
    "Mastriano suggested in the paper that left-wing elites supposing a rift between civil-military leadership are aiming to get safeguards? put in place to limit the power of the military.",
    "This research project asserts that these safeguards will set the stage for a Hitlerian Putsch, which leaves the military on the sidelines unwilling to save the republic,? he wrote.",
    "The paper asserts the military was the only one who could have stopped the dictator but instead sat back and watched the country crumble due to the putsch against the institution.",
    "Dictator Aurelius form of political correctness was then imposed upon the populace with scores being sent to reeducation camps to adapt their views to his,? the paper reads.",
    "Pennsylvania Republican gubernatorial candidate Doug Mastriano wrote a thesis in 2001 saying a left-wing putsch? against the U.S. military would destabilize the country.",
    "In this, the military was powerless to defend the republic with only a handful of military officers opposing the putsch,? it continued.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "His win came at the behest of some in his party who believe Mastrianos views are too radical to win the swing state.",
    "During his primary race, he peddled former President Trumps false claim that the 2020 election was rigged.",
    "The rest of the paper details a fantasy world where in 2018 a left-wing dictator takes over the country.",
    "The unearthed paper comes after Mastriano easily won the Pennsylvania primary on Tuesday.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}