{
  "id": 6574,
  "mediaId": 234,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Louisiana Senator Bill Cassidy: Our Maternal Death Rates Are Only Bad If You Count Black Women",
  "image": "https://media.vanityfair.com/photos/628811eb0545d9cf47337047/master/w_2240,c_limit/1231082102",
  "link": "https://www.vanityfair.com/news/2022/05/bill-cassidy-maternal-mortality-rates",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    3102
  ],
  "sentences": [
    "Just days after media organizations called the race for Biden in Arizona and nationwide, Thomas urged the lawmakers to stand strong in the face of political and media pressure.? She told the lawmakers the responsibility to choose electors was yours and yours alone? and said they have power to fight back against fraud.?\nThe news of Thomass overtures to the Arizona lawmakers comes less than two months after the revelation that she bombarded former White House chief of staff Mark Meadows with texts urging him to overturn the results of the 2020 election, which itself was preceded by Thomas admitting in an interview that she attended the Stop the Steal? rally that preceded the attack on the Capitol; The New York Times Magazine reporting that she sits on the board of a group that circulated a document in November 2020 telling its members to pressure Republican lawmakers into challenging the election results and appointing alternate slates of electors?; and a massive profile by The New Yorker detailing how years of Ginnis work has ultimately made its way into Clarences work.",
    "Oracles Larry Ellison joined Nov. 2020 call about contesting Trumps loss (Washington Post)\nGroup Chat Linked to Roger Stone Shows Ties Among Jan. 6 Figures (NYT)\nPA governor nominee Doug Mastriano warned of left-wing Hitlerian Putsch? in masters thesis (Washington Post)\nUterus surveillance?: The scramble to keep abortion data from prying eyes (Politico)\nBroken adoptions, buried records: How states are failing adoptees (USA Today)\nNancy Pelosi banned from receiving communion in San Francisco archdiocese over her position on abortion (CNN)\nMark Zuckebergs Meta tells employees to stop discussing abortion at work (The Verge)\nRussias Gazprom to cut off Finland from natural gas (Washington Post)\nInflation: Teen Babysitters Are Charging $30 an Hour Now, Because They Can (WSJ)",
    "For one, if more pregnant people cant get the abortions they seek, theyd shoulder the risk of the U.S.s relatively highand risingrate of death from pregnancy-related causes, which is particularly elevated among people of color.? As Dr. Amy Addante, an ob-gyn in Illinois, bluntly put it: There are going to be women that will die from pregnancy because of this decision, period.?\nAnd in other war-on-women news, via HuffPost:\nDonald Trumps pick for a Michigan state Senate seat is promising to ban all birth control if she gets the chance.",
    "They are high because of the devastating impacts of structural racism and individual bias.? As Politico notes, Black mothers are three times more likely to die from a pregnancy-related cause than white mothers in the U.S., which has the worst mortality rate among developed nations and where 17 mothers die for every 100,000 pregnancies in the country.? In Louisiana, Black mothers are four times as likely to die than white mothers.",
    "Report: Ginni Thomass attempts to overturn the election were even worse than previously thought\nVirginia Ginni? Thomas, the conservative activist and wife of Supreme Court justice Clarence Thomas, pressed Arizona lawmakers after the 2020 election to set aside Joe Bidens popular-vote victory and choose a clean slate of Electors,? according to emails obtained by The Washington Post.",
    "NICHOLAS KAMM\nAs conservatives across the country wage war on reproductive rights, demanding by law that women be forced to carry any pregnancy to term, regardless of the circumstances, they frequently (slash always) like to forget that they do absolutely nothing to support these people during said pregnancies or after.",
    "In March, Senator Marsha Blackburn called Griswold v. Connecticutthe 1965 ruling that struck down a state ban on contraceptivesconstitutionally unsound,? while Idaho plans to hold a hearing to ban emergency contraception and potentially IUDs as well.",
    "Earlier this month, Clarence Thomas declared that the leak of the courts draft opinion overturning Roe v. Wadeand not a justice being married to someone who tried to overturn the results of a free and fair electionhas eroded trust in the institution.",
    "Mississippi, for example, where abortion will immediately become illegal if Roe v. Wade is overturned, has the highest rate of child poverty in the country and recently rejected a bid to extend postpartum Medicaid coverage.",
    "Sex ought to be between one man and one woman in the confines of marriage.?\nWhile Eubankss comments are completely disturbing, shes far from the only Republican whos suggested they want to see contraceptives banned.",
    "Others have claimed that anyone worried about a ban on birth control (or gay marriage, or interracial marriage) is being hystericalwhich, incidentally, is what many said about the prospect of Roe being overturned.",
    "But according to GOP senator Bill Cassidy, the rate at which women die during pregnancy or shortly after is not as bad as it seemsif you subtract the deaths of Black women, which apparently dont count.",
    "Lets start with the idea that Cassidywho wants to defund Planned Parenthood is all, Yes, on its face, our maternal mortality rates are abysmal, but if you only count white women, theyre not that bad!",
    "In an interview with Politico, the following words came out of Cassidys mouth: About a third of our population is African American; African Americans have a higher incidence of maternal mortality.",
    "The emails, sent by Ginni Thomas to a pair of lawmakers on November 9, 2020, argued that legislators needed to intervene because the vote had been marred by fraud.",
    "And in Louisiana, which has a similar trigger law that will go into effect upon Roe being reversed, maternal mortality rates are among the worst in the nation.",
    "Its no mystery why maternal mortality rates are so high among Black women,? Michelle Williams, the dean of Harvards School of Public Health said in response.",
    "And if it should, I would have to side with it should not be legal,? Republican Jacky Eubanks said in a recent interview with the site Church Militant.",
    "People believe that birth controlits better, like you said, oh, because then you wont get pregnant and you wont need to have an abortion,? she added.",
    "But I think it gives people the false sense of security that they can have consequence-free sex, and thats not true and thats not correct.",
    "As NBC News reported earlier this month, Research suggests the bans and restrictions would have manifold effects on maternal health.",
    "Then theres the phrase for whatever reason.? In fact, there is one very big reason in particular perhaps you can take a guess?",
    "Asked what how Roe v. Wade being overturned would affect maternal mortality rates, Cassidy dismissed the question.",
    "For whatever reason, people of color have a higher incidence of maternal mortality.?\nTheres a lot to unpack here.",
    "If were using abortion to limit maternal deaths, thats kind of an odd way to approach the problem,? he said.",
    "I guess we have to ask ourselves, would that ever come to a vote in the Michigan state legislature?",
    "So, if you correct our population for race, were not as much of an outlier as itd otherwise appear.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "Now, I say that not to minimize the issue but to focus the issue as to where it would be.",
    "Though she did not mention either candidate by name, the context was clear.",
    "Ginni Thomas did not respond to the Posts requests for comment.",
    "That, of course, is total bullshit.",
    "Today in: Is this real life?",
    "Elsewhere!"
  ]
}