{
  "id": 6576,
  "mediaId": 33,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "ANLISIS | Los golpes econmicos siguen llegando mientras el regreso a la normalidad prometido por Biden sigue eludiendo Estados Unidos",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220519111642-baby-formula-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/05/20/golpes-economicos-prometido-regreso-a-la-normalidad-de-biden-eludiendo-estados-unidos-trax/",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    3102,
    106,
    2945
  ],
  "sentences": [
    "Cmo el gobierno de Biden est analizando silenciosamente las relaciones con Arabia Saudita y los Emiratos ?rabes Unidos para contrarrestar el aumento de los precios del petrleo\nEstos puntos brillantes en un pas que trata de encontrar su lugar nuevamente tienden a exacerbar la sensacin de que estamos viviendo una poca de extremos, un estado de ser que en s mismo es inquietante y estresante.",
    "Esta fue la semana en que la inflacin finalmente alcanz al mercado de valores, que es fundamental para los ahorros para la jubilacin de los estadounidenses de clase media, ya que las ganancias inferiores a las esperadas de los minoristas afectadas por los recortes de los consumidores hicieron que Wall Street diera un vuelco.",
    "Todo destila una sensacin de pesimismo y agotamiento entre el pueblo estadounidense, segn una encuesta de CNN publicada esta semana que mostr claras mayoras preocupadas por cmo van las cosas y quemadas por una poltica txica que parece incapaz de resolver las cuestiones ms fundamentales que enfrenta el pas.",
    "Sin embargo, el ndice de aprobacin del presidente languidece alrededor del 40% en la mayora de las encuestas, en medio de preguntas sobre si su administracin realmente comprende los desafos que enfrentan los estadounidenses y si su gobierno est haciendo lo suficiente para solucionarlos.",
    "The Conference Board, una asociacin de miembros empresariales sin fines de lucro, advirti esta semana que el 68% de los directores ejecutivos encuestados piensa que la estrategia de la Reserva Federal de aumentar las tasas de inters para combatir la inflacin provocar una desaceleracin.",
    "Sin embargo, existe una sensacin creciente de que las crisis se acumulan a medida que las ondas de choque de un perodo de agitacin global inusual, incluida una pandemia nica en un siglo y la peor guerra en Europa desde 1945, se entierran en el tejido de la vida cotidiana.",
    "En respuesta a la creciente ira del pblico, la Cmara de Representantes, controlada por los demcratas, aprob el jueves un proyecto de ley que otorga a la Comisin Federal de Comercio la autoridad para investigar a las empresas de energa por supuesto aumento de precios.",
    "Algunos de ellos, por ejemplo, el recin nombrado candidato republicano a gobernador de Pensilvania, Doug Mastriano, han adoptado posiciones extremas sobre el fraude electoral de 2020 que plantean serios desafos para el propio sistema poltico de Estados Unidos.",
    "Y los estadios deportivos bajo techo de la nacin estn llenos de fanticos que animan los juegos de la NBA y la NHL que hacen que las \"burbujas\" estriles de los playoffs de la era covid sean un recuerdo horrible, a medida que las ciudades vuelven a la vida.",
    "La perspectiva desalentadora para la Casa Blanca es que, aunque hay seales de que la inflacin (que aument un 8,3 % en los 12 meses que terminaron en abril) se est desacelerando, no hay garanta de que las cosas no empeoren en los meses venideros.",
    "Tambin hay pocas seales de que fijar precios a los verdaderos culpables, como los problemas de la cadena de suministro relacionados con la pandemia y la guerra en Ucrania, lo reducirn con votantes cansados de los golpes econmicos.",
    "El impacto poltico de la situacin actual no se limita al destino del partido de Biden en las elecciones de mitad de perodo de noviembre, que la historia sugiere que sera un viaje difcil incluso sin tiempos econmicos difciles.",
    "Si el panorama no fuera lo suficientemente sombro, la Corporacin de Confiabilidad Elctrica de Amrica del Norte advirti este jueves que las temperaturas extremas y la sequa podran hacer que la red elctrica colapsara.",
    "Pero cuatro demcratas se unieron a los republicanos para votar en contra, con la representante Stephanie Murphy, una demcrata de Florida que no se postula para la reeleccin, critic la medida como una fachada.",
    "Luego, la llam temporal; y ahora, es culpa de Putin\", dijo el representante Jason Smith de Missouri, el principal republicano en el Comit de Presupuesto de la Cmara, dijo en una audiencia esta semana.",
    "La prdida de una parte sustancial de la cosecha de Ucrania a finales de este verano podra tener un impacto devastador en los precios y podra hacer que algunos alimentos bsicos escasearan.",
    "Si bien es probable que el problema sea ms grave en los pases en desarrollo, e incluso podra causar hambrunas, es poco probable que los estadounidenses se salven de las consecuencias.",
    "Los altos precios de la gasolina son un golpe particularmente doloroso para la billetera, especialmente en las reas rurales donde muchas personas manejan kilmetros para ir al trabajo.",
    "Sin embargo, a pesar de todo el pesimismo, este tambin es un momento de extraa dualidad en una economa que, en muchos sentidos, se ha recuperado bien de los cierres por la pandemia.",
    "Una ola roja en las elecciones intermedias podra llevar al poder a una creciente cosecha de candidatos extremistas pro-Trump de una manera que podra remodelar el pas a largo plazo.",
    "Una crisis clsica que hace tambalearse a la Casa Blanca\nLa crisis de la frmula para bebs es un ejemplo clsico de los problemas en cascada que pueden consumir las presidencias.",
    "Y para Biden y los demcratas, que ya se enfrentaban a un insoportable ao electoral de mitad de perodo, la perspectiva de repudio por parte de votantes enojados est creciendo.",
    "Aparte de los cereales, Ucrania tambin es una fuente principal de fertilizantes y aceites de girasol, cuya escasez tendr un impacto directo en los precios de los alimentos.",
    "En la ltima semana, por ejemplo, el presidente ha promocionado los xitos de su plan de rescate estadounidense y ha anunciado medidas para reducir el costo de la vivienda.",
    "Incluso una recesin leve podra tener consecuencias negativas para muchos estadounidenses, sin mencionar las repercusiones devastadoras para los demcratas en noviembre.",
    "Es una posicin poltica peligrosa cuando un presidente trata de resaltar los aspectos positivos de una economa que muchos estadounidenses creen que est funcionando mal.",
    "Por qu la inflacin significa un desastre poltico\nLa alta inflacin les est dando a los republicanos una apertura fcil en el perodo previo a las elecciones intermedias.",
    "Casi da a da, el ambiente poltico empeora a pesar de los frenticos esfuerzos de Biden por convencer al pas de que siente su dolor y puede llevarlo a momentos mejores.",
    "Tambin es un poderoso punto de reunin para los crticos de Biden en la industria de los medios conservadores que sugieren que el pas est al borde de la devastacin.",
    "Comenz cuando un fabricante de alimentos para bebs cerr una planta despus de que varios bebs enfermos fueran vinculados a frmula posiblemente contaminada.",
    "El gigante de servicios financieros JPMorgan advirti esta semana que el golpe de US$ 6 por galn de California podra extenderse por todo el pas en agosto.",
    "Liber millones de barriles de petrleo de reservas estratgicas y ha avergonzado a los gigantes petroleros por no bajar los precios ms rpidamente.",
    "Y menos la que el presidente Joe Biden prometi el ao pasado cuando dijo, poco despus de asumir el cargo, que Estados Unidos est de regreso?.",
    "Esta realidad actual, mezclada con pronsticos de que lo peor est por venir, difcilmente es la normalidad que anhelaban los estadounidenses.",
    "La insistencia anterior de la Casa Blanca en que el costo de vida era un resultado \"transitorio\" de la pandemia la perseguir durante meses.",
    "Pero es difcil abrirse paso con eventos presidenciales programados y viajes fuera de Washington en medio de un aluvin de malas noticias.",
    "Biden es responsabilizado por los golpes econmicos\nLos presidentes probablemente reciben demasiado crdito cuando la economa va bien.",
    "Y la sola idea de que los bebs puedan pasar hambre es una metfora daina para un pas y un sistema que no parecen estar funcionando.",
    "\"En el mejor de los casos, este proyecto de ley es una distraccin que en realidad no abordar el problema\", dijo en un comunicado.",
    "El promedio nacional de un galn de gasolina el jueves fue de casi US$ 4,60, segn la Asociacin Estadounidense del Automvil.",
    "La Casa Blanca est alentando a las comunidades a desbloquear fondos de la ley de infraestructura bipartidista de Biden.",
    "\"S que las familias de todo Estados Unidos estn sufriendo debido a la inflacin\", dijo Biden a principios de este mes.",
    "Parece un verano largo, caluroso y miserable que es poco probable que alivie el estado de nimo descontento del pas.",
    "Reciben la culpa cuando las cosas salen mal y terminan con poco crdito cuando el problema finalmente se resuelve.",
    "\"Entiendo cmo se sienten\", agreg, insistiendo en que el alto costo de vida era su \"mxima prioridad interna\".",
    "Millones de estadounidenses se preocupan por cmo lidiar con los altos precios, o se estn quedando sin ellos.",
    "\"La estrategia del presidente Biden de culpar a la inflacin de un nuevo villano cada mes est fracasando.",
    "Y quin no ha buscado un chivo expiatorio cuando el costo de llenar un tanque se acerca a los US$ 100?",
    "Y cualquier aumento de sueldo que viene con un nuevo trabajo sea devorado rpidamente por la inflacin.",
    "Las predicciones de una recesin que se avecina hacen que todos se preocupen por sus trabajos.",
    "Los trabajadores con alta demanda pueden dictar los trminos cuando obtienen nuevos trabajos.",
    "Ha ordenado el uso de poderes de guerra para poner fin a la escasez de frmula para bebs.",
    "La otra cara de la moneda es que ellos reciben toda la culpa cuando las cosas van mal.",
    "Otro tema emotivo que socava la moral nacional es el alto precio de la gasolina.",
    "Pero los presidentes se cargan rpidamente con crisis que nadie ms ha resuelto.",
    "Las consecuencias secundarias de tal coaccin estn destinadas a ser polticas.",
    "Predicciones del precio de la gasolina generalizado de US$ 6 por galn.",
    "\"En el peor de los casos, podra hacer que el problema sea ms grave\".",
    "No hay nada ms angustioso para un padre que un beb hambriento.",
    "La tasa de desempleo est cerca de los mnimos de 50 aos.",
    "Esa es la difcil situacin de Biden en este momento.",
    "Y la negativa de una pandemia a aliviar su control.",
    "Biden no caus el problema de la frmula para bebs.",
    "Llegado el verano, eso puede parecer una ganga.",
    "(CNN) -- Estantes vacos de frmula para bebs.",
    "Eso coincidi con nuevos temores de recesin.",
    "Aumento de los precios de los comestibles.",
    "Una vez ms, Biden ha intentado responder.",
    "Pero los precios parecen seguir subiendo.",
    "Primero, neg que existiera la inflacin.",
    "Temidos apagones de energa en verano.",
    "Esa es la posicin de Biden ahora.",
    "Prxima escasez de alimentos.",
    "Desplome de las acciones.",
    "Nubes de recesin."
  ]
}