{
  "id": 6582,
  "mediaId": 323,
  "date": "d2022-05-19T22:37",
  "headline": "The Limits of Stop the Steal",
  "image": "https://images.wsj.net/im-548224?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/stop-the-steal-trump-endorsement-midterm-gop-republican-primaries-primary-oz-walker-mastriano-kemp-perdue-11652997799",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kimberley A. Strassel",
  "authorUrl": "https://www.wsj.com/news/author/kimberley-a-strassel",
  "termIds": [
    815,
    1147,
    1758,
    1770,
    2095,
    2303,
    3102,
    4325,
    2672,
    2834,
    2862,
    2953
  ],
  "sentences": [
    "The former president has been savvy with some of his endorsements, allying himself with candidates who already have high profiles (including Mehmet Oz and Herschel Walker for Senate in Pennsylvania and Georgia, respectively) or bestowing his approval at crucial times (as he did at the last minute for Mr. Mastriano, who was already leading).",
    "He stoked former Sen. David Perdue into challenging Mr. Kemp last year, and then handed him his complete and total endorsement.? Mr. Perdue, who lost a January 2021 runoff to Democrat Jon Ossoff, has run a straight-up stop the steal? campaign, saying at a March Trump rally: Let me be very clear.",
    "But incumbency is no guaranteeask North Carolina Rep. Madison Cawthorn, whom voters rejected this week, or for that matter, former Democratic Caucus Chairman Joe Crowley, the powerful 10-term congressman who lost to Alexandria Ocasio-Cortez in 2018.",
    "Overall, Pennsylvania voters seemed attracted this cycle to politicians with a pugilistic approach to politics, choosing not only the confrontational Mr. Mastriano on the right, but progressive steamroller John Fetterman on the left.",
    "Mr. Little ran on his record, which included a new law restricting private money in the administration of elections, a thriving economy, significant tax cuts, and a promise to plow the huge state budget surplus into more tax relief.",
    "WSJ Opinion: What We Have Learned From the Durham InvestigationPlay video: WSJ Opinion: What We Have Learned From the Durham Investigation\n Journal Editorial Report: Paul Gigot interviews Wall Street Journal columnist Kim Strassel.",
    "Thats the same Mr. Kemp whom Donald Trump has branded the worst election integrity Governor in the country.? In 2020 Mr. Kemp refused calls to overturn his states election results, and Mr. Trump has since been on a vendetta.",
    "Photo: Elijah Nouvelage/Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 05:21\n1x\nThis article is in your queue.",
    "Open Queue\nThis weeks conventional wisdom holds that state Sen. Doug Mastriano won the Pennsylvania Republican gubernatorial primary by inciting voters with claims of a stolen 2020 election.",
    "The governor rejected any effort to strip Mr. Biden of Georgias electoral votes, but he well understood voter anger and alarm over 2020 election irregularities.",
    "Mr. Kemp let the flood of outrage (and distortions) from the media, Democrats and woke companies make the case to his supporters just how good a reform it was.",
    "Thanks to Mr. Trumps obsession and Mr. Perdues singular focus, Georgia has become one of the purest test cases of the durability of 2020 election grievances.",
    "He made a priority of getting broadband to rural areas and signed laws expanding school choice, protecting girls athletics and strengthening parents rights.",
    "Mostly, recent results show that while GOP voters remain concerned about 2020 election irregularities, they are focused mostly on a fix and the future.",
    "Mr. Youngkin ran on a forward-looking agenda to address schools, the economy and crimeand won in a state that has leaned Democratic in recent years.",
    "That particular primary was a eight-person pileup in which all the candidates struggled to get out a message, producing a highly fractured vote.",
    "The primary also demonstrates that Trump endorsements have some limits, which may make candidates rethink their desperate efforts to nab them.",
    "Within two months of Mr. Bidens inauguration, Mr. Kemp signed an election-reform law with new rules on voter ID and ballot drop boxes.",
    "Mrs. McGeachin slammed the governor over his Covid-19 handling and ran on support for a 50-state audit of the 2020 election results.",
    "WSJ Opinion: What We Have Learned From the Durham Investigation\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "One lesson for candidates is to beware thinking the stolen election? theme is the way to connect to voters.",
    "Images: AP/Getty Images Composite: Mark Kelly\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "He acknowledged Mr. Biden as the legitimate president while also promising to shore up election integrity.",
    "Karl Rove notes that its unclear whether Mr. Mastriano won because of his election claims or despite them.",
    "Glenn Youngkin cracked that code last year in Virginias gubernatorial election, when feelings were rawer.",
    "If 2020 election fury were still as potent as some claim, Mr. Kemp would at least be in a tighter race.",
    "0:00 / 5:05\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Last month he signed a new law allowing Georgians to carry firearms without a permit.",
    "They can do that because Mr. Kemp dealt with the 2020 mess and focused on the future.",
    "In the state of Georgia, thanks to Brian Kemp, our elections were absolutely stolen.",
    "If the polls are correct, the message from Peach State Republicans is: Move on.",
    "Hes overseen a booming economy, featuring a flood of new investment and jobs.",
    "Mr. Perdue has been running on a Trump endorsement for months, and no matter.",
    "The RealClearPolitics average has Mr. Kemp beating Mr. Perdue by 25 points.",
    "It also freed him to highlight and build on a solid conservative record.",
    "That tried-and-true formula remains the path for GOP midterm success.",
    "Mr. Kemp was among the first governors to loosen Covid restrictions.",
    "Brian Kemp speaks at a campaign event in Alpharetta, Ga., May 17.",
    "The most recent poll, from Fox News, has the governor up 32.",
    "Lets see how that analysis holds up if and when Georgia Gov.",
    "He sold us out.?\nRead More Potomac Watch\nHows that working?",
    "The same strategy succeeded this week in Idaho, where Gov.",
    "Brian Kemp crushes his primary challenger next week.",
    "Republican voters know a good bet when they see it.",
    "True, its rare for incumbents to lose primaries.",
    "Your browser does not support HTML5 video.",
    "Brad Little beat Trump-endorsed Lt. Gov.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Janice McGeachin by 20 points.",
    "Write to kim@wsj.com.",
    "Very clear.",
    "Gov."
  ]
}