{
  "id": 6584,
  "mediaId": 195,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Democrats spend big in GOP governor primaries",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/article-illustration_051922mm-ap-john-locher_dem-govs_web.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3494754-democrats-spend-big-in-gop-governor-primaries/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    864,
    1547,
    3102,
    3762,
    4038,
    5275,
    143,
    146,
    428
  ],
  "sentences": [
    "There isnt enough money for them to meddle in the nearly dozen states where Democrats are in danger of losing their hold on the governors office.?\nMeddling in another partys primary, or goosing an independent candidate in hopes of syphoning off votes from a rival, is a rare but not unheard-of occurrence in modern politics.",
    "These elected and formerly elected officials want to deceptively retell their histories, and were just filling in the gaps.?\nSo far, the DGA has dropped $8.4 million on television ads across Illinois, including more than $4 million in the Chicago market alone.",
    "Democrats have strong chances to pick up seats in Maryland and Massachusetts, where popular Republican governors are retiring, while Republicans are aiming to knock off Democratic incumbents in key states like Wisconsin, Michigan, Maine and Kansas.",
    "Instead of standing up for our values, she sided with the right wing to advance their agenda,? says a digital ad paid for by Oregonians for Ethics, citing Johnsons votes against raising the minimum wage and a cap and trade proposal.",
    "The DGAs spending decisions indicate they are very worried about their incumbent governors chances as their failed records are being litigated for voters,? said Jesse Hunt, a spokesman for the Republican Governors Association.",
    "Smith took almost 35 percent of the vote against former state Sen. Cal Cunningham (D), national Democrats preferred candidate  though Cunningham lost to Sen. Thom Tillis (R) after details of a sordid affair sunk his campaign.",
    "Johnson, elected as a Democrat to represent a timber-heavy district on Oregons Pacific Coast, is trying to build a multi-party coalition in her bid to become the states first independent governor in nearly a century.",
    "The early spending comes after Pennsylvania Attorney General Josh Shapiro (D) ran an unconventional advertisement spotlighting state Sen. Doug Mastriano (R) and his support for former President Donald Trump.",
    "The Democratic Governors Association has spent millions in both Illinois and Nevada, where incumbent governors are seeking reelection, in an apparent effort to weaken their likely Republican opponents.",
    "Millions of dollars in attack advertisements are hitting television screens in Illinois castigating Aurora Mayor Richard Irvins (R) track record as an attorney for defendants accused of violent crimes.",
    "The DGA has funneled at least $61,000 to a group called Oregonians for Ethics, which is preparing advertisements that will paint former state Sen. Betsy Johnson, an independent, as a conservative.",
    "The group is also spending early money on what is likely to be an effort to boost an independent candidate in Oregon in hopes of syphoning votes away from the newly minted Republican nominee.",
    "Johnson will vie against former state House Speaker Tina Kotek (D) and former House Republican Leader Christine Drazan (R), who won their respective primaries this week.",
    "Those ads target Irvin, the leading Republican ahead of next months primary, in which he faces state Sen. Darren Bailey (R) and a handful of other contenders.",
    "ran advertisements slamming then-Rep. Todd Akin (R) as too conservative ahead of the Republican primary  a message that conservative voters wanted to hear.",
    "Republicans say the early spending is a sign that Democrats have already hit the panic button in the midst of an unfavorable political climate.",
    "The DGA is wasting no time in educating the public about these Republicans,? said Christina Amestoy, the groups senior communications advisor.",
    "Republicans in 2020 tried their own late trick, paying for ads that elevated state Sen. Erica Smith (D), a progressive Black woman.",
    "That ad reminded both Republican and independent voters of Mastrianos ties to Trump, dual missions with two very dissimilar goals.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Thirty-six states will elect governors this year, including eight states where incumbents are not seeking a new term.",
    "But the advertisements targeting Irvin arent coming from his main rival for the Republican nomination for governor.",
    "Cox took just 6.5 percent of the vote  a share that might otherwise have gone to then-Rep. Denny Rehberg (R).",
    "They are funded by Democrats, more than a month before the Republican primary takes place in late June.",
    "Lombardo leads attorney Joey Gilbert (R) and former Sen. Dean Heller (R) in the race to take on Gov.",
    "On Tuesday, Mastriano and Shapiro both won their primaries in the race to replace term-limited Gov.",
    "And Democrats have spent $2.3 million in Nevada, targeting Clark County Sheriff Joe Lombardo (R).",
    "ran advertisements attacking Dan Cox, the Libertarian Party nominee, as an arch conservative.",
    "Akin won the GOP primary, and McCaskill trounced him that November.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Ted Kulongoski (D) and former Sen. Gordon Smith (R).",
    "This week, she touted support from both former Gov.",
    "That same year, allies of Sen. Jon Tester (D-Mont.)",
    "Tester won with just 48.6 percent of the vote.",
    "The winner of the GOP primary will face Gov.",
    "In 2012, Sen. Claire McCaskill (D-Mo.)",
    "J.B. Pritzker (D) in November.",
    "Steve Sisolak (D).",
    "Tom Wolf (D)."
  ]
}