{
  "id": 6592,
  "mediaId": 558,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Trump leaves Pennsylvania GOP fuming over 'cockamamie election.' Next up: Georgia.",
  "image": "https://s.yimg.com/ny/api/res/1.2/67G.DXYCyKh9o6JGW0OGxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ3MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Wo3qd.7rcSNm7Q5dY7El1A--~B/aD0xNjY3O3c9MjUwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/nbc_news_122/28fa028c5de74264cfc1ad4d0be7e047",
  "link": "https://news.yahoo.com/trump-leaves-pennsylvania-gop-fuming-183434057.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "Former President Donald Trump worked his Pennsylvania primary endorsements to make him look like a winner, but exasperated Republicans in the state say the end result could boomerang in ways that damage both the party and Trump's own chances should he run for president in 2024.\nThis is the most cockamamie election Ive ever seen in my life,? Dave Ball, the GOP chairman in Washington County, said in an interview.",
    "I would think that he [Trump] would be very interested in Doug Mastriano moderating his message and trying to run as someone who can appeal to all Pennsylvanians,? said David Urban, a former Trump campaign adviser who helped him win Pennsylvania in 2016 (Trump lost the state in 2020).",
    "But his endorsements nationwide have triggered a backlash from local Republican leaders in Ohio, , Pennsylvania and Georgia, where they feel as if Trumps picks were haphazard, reckless or harmful to the partys broader electoral objectives and even Trumps long-term interests.",
    "Three days before Election Day, Trump veered hard to the right in the governor's race by backing Doug Mastriano, the state senator who built a devoted grassroots following for his efforts to overturn President Joe Bidens win and promote Trumps stolen election lie.",
    "Mainstream Republicans fear that Mastriano, who had been on track to win the primary anyway before Trump's nod, is too extreme to win a general election in a state with a half million more registered Democrats than Republicans.",
    "They should be concerned about [Democratic nominee] Josh Shapiro as governor because hes going to be the referee.?\nTrump remains the most popular figure in the GOP and his endorsement is campaign gold for Republican candidates.",
    "Turner noted Trumps pick for Georgia attorney general, John Gordon, wasnt a practicing lawyer for years and in 2021 to take part in a failed lawsuit baselessly alleging election fraud.",
    "The governor gets to appoint the secretary of state, who presides over elections in a swing state that was a focus of Trumps bid to reverse his 2020 election loss.",
    "Then, in the governors race, not only did nine candidates vie for the Republican nomination, but none dropped out until the last weekend.",
    "This prevented any consolidation of the field against Mastriano, a far-right state legislator virtually eliminate and has campaigned .",
    "In the Senate race, Trump endorsed celebrity TV doctor Mehmet Oz, whose past liberal views made him anathema to many conservatives.",
    "Turner also questioned the conservative bonafides of Trumps pick in a Georgia congressional race, Vernon Jones, a former Democrat.",
    "Enthusiastic supporters , while many Republicans view him as unelectable in a state where moderates traditionally perform well.",
    "A Democratic victory in the Pennsylvania contest for governor would reverberate through the 2024 presidential election cycle.",
    "Now hes locked in a too-close-to-call race having received less than a third of the vote, according to NBC News.",
    "Its not lost on anybody that the governor of Pennsylvania plays an outsize role in the 2024 election.",
    "And Republicans should be concerned about that."
  ]
}