{
  "id": 6596,
  "mediaId": 195,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Republican election deniers make gains in primary contests",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/mastrianodoug_051822_ap-Carolyn-Kaster_electiondeniers.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/state-watch/3492972-republican-election-deniers-make-gains-in-primary-contests/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    800,
    821,
    1237,
    2131,
    2303,
    3032,
    3102,
    428,
    571,
    2706,
    2834
  ],
  "sentences": [
    "He didnt join the lawsuit because he agreed with Democrat across the country that governors could change election laws without the consent of the peoples representatives.?\nRepublican voters in North Carolina nominated Rep. Ted Budd (R) as their candidate for a U.S. Senate seat held by retiring Sen. Richard Burr (R); Budd was among the Republicans who voted against certifying the 2020 election results.",
    "Republican candidates who were in Washington, D.C., during the Jan. 6, 2021, insurrection won primary elections to appear on the November ballot in North Carolina and Idaho on Tuesday, while one of the few Republicans who refused to go along with a lawsuit seeking to overturn the 2020 election results lost a bid for a new term in Idaho.",
    "Numerous states unconstitutionally changed their laws during the election, subverting the role of state legislatures through unilateral actions taken by the executive and judicial branches,? Labrador wrote to the Idaho Statesman when asked about the results of the 2020 elections.",
    "In Idaho, Attorney General Lawrence Wasden (R) lost his bid for a sixth term in office a year and a half after he refused to join a lawsuit, spearheaded by Texas Attorney General Ken Paxton (R), that sought to reject 2020 presidential election results in six battleground states.",
    "With election lies and conspiracy theories becoming a prominent issue on the campaign trail, voters need to know what is at stake heading into the primaries,? Thania Sanchez, the groups senior vice president of research and policy development, said in a statement.",
    "But she has raised more than $733,000, according to the most recent filings with the Federal Election Commission, after winning endorsements from Trump-backing figures including retired Gen. Michael Flynn, Rep. Paul Gosar (R-Ariz.) and Roger Stone.",
    "Pennsylvania Republicans picked state Sen. Doug Mastriano (R) as their nominee for governor, nearly three months to the day after the select House committee investigating the insurrection issued him a subpoena seeking his testimony.",
    "In North Carolina, Rep. Madison Cawthorn (R), who had become a prominent Trump backer, lost his renomination bid to state Sen. Chuck Edwards (R), who attracted support from top Republicans across the state.",
    "At least 20 candidates are running for secretary of state offices in 16 states that have yet to hold primaries, according to States United Action, a watchdog group founded by former New Jersey Gov.",
    "In Pennsylvania, the two leading contenders locked in a neck-and-neck contest for the Republican Senate nomination  Mehmet Oz and David McCormick  have both refused to acknowledge Bidens victory.",
    "In North Carolina, Republican primary voters chose accountant Sandy Smith (R) as their nominee to run for a U.S. House seat currently held by retiring Rep. G.K. Butterfield (D).",
    "Among three candidates running for secretary of state in Idaho, the winner, Ada County Clerk Phil McGrane (R), was the lone contender who acknowledged President Bidens victory.",
    "Idahos current Attorney General refused to join other Republican State [attorneys general] in challenging these matters, claiming he was protecting Idahos sovereignty.",
    "The results Tuesday are a prelude to primary elections that will come in dozens of other states where election deniers are running for state and federal office.",
    "Rick Saccone, the former Pennsylvania state representative who appeared with Mastriano in Washington, finished second in his bid to become lieutenant governor.",
    "Smith lost to Butterfield in 2020; two months later, she attended the Stop the Steal? rally in Washington that preceded the insurrection.",
    "Wasden lost renomination to former Rep. Raul Labrador (R), who questioned the integrity of the 2020 presidential election.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Another 13 candidates are running for attorney general in 13 states that hold their primaries in the coming months.",
    "Smith faces an uphill challenge against state Sen. Don Davis (D), who won the Democratic nomination on Tuesday.",
    "His state Senate campaign spent donor dollars chartering buses that ferried supporters to Washington that day.",
    "The issues we all care about most deeply depend on the freedom to vote and those votes being counted fairly.",
    "Mastriano was photographed outside the Capitol on Jan. 6, though he has said he did not enter the building.",
    "Several candidates who denied the results of the 2020 elections lost their election bids on Tuesday.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Christine Todd Whitman (R).",
    "Hogwash!"
  ]
}