{
  "id": 6597,
  "mediaId": 136,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Democrats Want to Campaign Against MAGA Candidates",
  "image": "https://d.newsweek.com/en/full/2040550/maga-hat.webp?w=790&f=ee63e2c8e91bfff090084116e0fdef5d",
  "link": "https://www.newsweek.com/democrats-want-campaign-against-maga-candidates-1707956",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Powell",
  "authorUrl": "https://www.newsweek.com/authors/bill-powell-0",
  "termIds": [
    3102
  ],
  "sentences": [
    "Democrats can't wait to point out that several Republicans running for office in battleground states were actually present at the stop the steal rally, including Air Force veteran and political novice J.R. Majewski, who won the Republican primary in Ohio's Ninth Congressional district to face off against incumbent Democratic Representative Marcy Kaptur.",
    "The reason for the strategy, from the White House down to local levels across the country, is straightforward: Democratic pollsters have found that branding someone as \"MAGA,\" rather than just a \"Trump supporter,\" turns off not just the Democratic base, but also many independents.",
    "That will likely include Nevada's Third Congressional District, where incumbent Representative Susie Lee is likely to face off against a well-funded attorney, April Becker, who narrowly lost a race for the state Senate in 2020 and has been embraced by the state GOP establishment.",
    "Later this summer, the House committee will hold high-profile televised hearings, including a few in prime time, intended to make Trump and several top Republicans look complicit in the riot at the U.S. Capitol following the \"stop the steal\" rally organized by the White House.",
    "One senior official at the Democratic Congressional Campaign Committee, who was not authorized to speak on the record, said, \"We are going to make this guy a poster boy: the ultra-MAGA, crazed right-wing nut job who is too extreme for America, just as the president put it.\"",
    "In midterm election races across the country  particularly in tight races  Democrats are going to use the phrase as a cudgel against their GOP opponents, as the party wages a rear guard fight to fend off what many political analysts believe is a coming red wave in November.",
    "But they believe the MAGA strategy, plus anger over the forthcoming Supreme Court decision that is expected to overturn Roe v. Wade, will rile up their base enough to make the damage far less than it might have been, even if control does ultimately flip to the GOP.",
    "A recent, private poll done for the Democratic Congressional Campaign Committee (DCCC) showed that more than fifty percent of independent voters surveyed reject candidates branded as \"MAGA,\" according to a senior official not authorized to speak on the record.",
    "Newsweek has identified no less than 25 congressional races in which Democrats intend to frame their attacks against their likely GOP competitors as out of the mainstream, ultra-MAGA nut jobs, according to DCCC sources and several campaigns.",
    "Democratic hopes for winning the seat had already taken a hit when, on May 15, the lead Democratic candidate for the seat, Lieutenant Governor John Fetterman, revealed he had been hospitalized over the weekend, recovering from a stroke.",
    "The majority of Americans were appalled by the riots, and though polls show most Republicans believe, as Trump insists, that the election was \"stolen,\" those same surveys show that the majority of independent voters reject that idea.",
    "In a very last-minute endorsement, Trump on May 14 threw his support behind Doug Mastriano, now the Republican candidate for governor in Pennsylvania after Tuesday's primary  to the frustration of the GOP establishment in the state.",
    "Veteran Democratic strategist Megan Jones, who for years worked with former Nevada Senator Harry Reid, said she believes Lee can defend her seat in part because she'll be able to tie any of her potential GOP opponents to Trump.",
    "\"MAGA means make America great again,\" GOP Congresswoman Elise Stefanik told Fox News recently, \"and yes, we're for that, and it's nice to know that from the president on down, the Democrats oppose making America great again.",
    "But Barnette faded, and late on election night, McCormick, a former hedge fund executive, West Point graduate and Army ranger, led the race by just 0.1 percent with 99 percent of the vote counted, triggering a recount.",
    "In a bitterly competitive, purple state, McCormick is a relatively uncontroversial straight arrow who, most GOP officials in the state acknowledge, would have won the primary in a walk had Trump not endorsed Oz.",
    "They learned that in Virginia last year, when their nominee, former Governor Terry McCauliffe, tried to brand Glenn Youngkin, his opponent, as Trump 2.0 because the former president had endorsed him.",
    "Democratic strategists feared redistricting had made Kaptur's district much more competitive than it had previously been, creating an opportunity for Republicans to flip the seat in November.",
    "\"The MAGA rhetoric very much reflects the reality: The GOP is now completely captured by Donald Trump and his extreme MAGA followers,\" veteran campaign strategist Ashley Woolheater said.",
    "Becker has echoed Trump's claims that the election in 2020 was stolen in Nevada, and even filed a lawsuit contesting the result of her own race based on voter fraud claims.",
    "They were briefly elated by the late surge of Kathy Barnette, a Black woman running to the far right of Oz with a history of homophobic and Islamophobic tweets.",
    "Democrats will seek to tie as many of their Republican opponents to the former president as they can in states where he lost or even won narrowly in 2020.",
    "To Democrats, \"ultra-MAGA\" is shorthand for an intolerant party that takes \"divisive\" stands on issues ranging from immigration to guns to LGBTQ+ rights.",
    "With Trump's backing, he won the May 17 primary easily, and Democrats believe that makes it more likely they will retain the governorship in Harrisburg.",
    "Democratic operatives hoped Trump's endorsement of celebrity television doctor Mehmet Oz, a political neophyte, would carry him to the nomination.",
    "Late in the campaign, Barnette had moved to within the margin of error from both Oz and David McCormick, the other top contender in the GOP race.",
    "\"That's going to continue to turn reasonable people away from the Republican Party, and President Biden and Democrats are smart to lean into it.\"",
    "Joe Biden isn't the only one intent on branding Republicans as \"ultra-MAGA\" extremists, as the president called them on May 4 at the White House.",
    "Democrats, she said in a tweet on Monday, are \"the party of Socialists, illegals, criminals, Communist Truth Ministers & media stenographers.",
    "Privately, Democratic strategists in Washington still acknowledge that November, particularly in the House, will be an uphill struggle.",
    "Majewski is far from the only Republican candidate who fits the bill for Democrats in terms of espousing the \"MAGA nut job\" sweet spot.",
    "\"MAGA values are not mainstream American values,\" Democratic Senator Chris Murphy, of Connecticut, said in a May 8 on Fox News.",
    "He didn't allow Trump to campaign with him and made the race about the issues while espousing more moderate Republican values.",
    "\"We've tested 'MAGA Republicans' and 'Trump Republicans,'\" said Biden pollster Celinda Lake, who worked on the 2020 campaign.",
    "The \"ultra-MAGA\" strategy is linked to Congressional Democrats' investigation into the events of January 6, 2021.",
    "But the Kaptur campaign was \"thrilled,\" as one senior official put it, when Majewski won the Republican primary.",
    "The Cook Political Report had previously listed the race as \"lean Republican,\" but now rates it as a \"toss up.\"",
    "Those races are in purple states like Nevada and Michigan, red states like Ohio, and blue states like Illinois.",
    "But Democrats are now less confident about winning the Pennsylvania Senate seat at stake in November.",
    "He has publicly stated that he believed the FBI was largely responsible for the January 6 riot.",
    "It's nice that they admit that, though that should be obvious from their disastrous policies.\"",
    "But Democrats acknowledge he is tougher to go after as an \"ultra-MAGA\" Trump acolyte.",
    "McCormick, who sought Trump's endorsement, has pledged fealty to the \"MAGA agenda.\"",
    "Democrats realize that they cannot credibly brand all Republicans as \"ultra-MAGA.\"",
    "\"They all to one degree or another embrace these conspiracy theories about 2020.",
    "Two days later, he easily won his race for the Democratic Party's nomination.",
    "Mastriano was in Washington on January 6 and doesn't apologize for it.",
    "The DCCC is hunting for more where the claim can be plausibly made.",
    "\"Yes, we have to pick our spots,\" said Democratic pollster Lake.",
    "And independents are critical to winning competitive elections.",
    "Republicans, for their part, laugh at the Democratic strategy.",
    "\"But in this cycle there are a lot of spots to pick.\"",
    "This is why there will be a #RedTsunami in November.\"",
    "\"MAGA is the hateful wing of the Republican party.\"",
    "The problem was, Youngkin didn't embrace Trumpism.",
    "This is why the ultra-MAGA branding is smart.\"",
    "\"Are we playing from behind?\"",
    "\"They test very, very well.\"",
    "But the comeback has begun.",
    "A judge dismissed the suit.",
    "posed the DCCC source.",
    "He won easily.",
    "Stay tuned.\"",
    "\"Yes."
  ]
}