{
  "id": 6600,
  "mediaId": 33,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Trump taints Pennsylvania GOP Senate primary with fresh fraud lies",
  "image": "https://www.i.cdn.cnn.com/.a/2.295.0/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/05/19/politics/trump-pennsylvania-election-fraud-lies/index.html",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Collinson",
  "authorUrl": "https://www.cnn.com/profiles/stephen-collinson",
  "termIds": [
    3102
  ],
  "sentences": [
    "If Trump forgot 2020 and concentrated on that message -- and worked exclusively to highlight President Joe Biden's vulnerabilities, including the raging inflation and high gas prices that helped send Wall Street into a 1,000-point plunge on Wednesday -- he might significantly boost his hopes of a new White House term.",
    "Ex-President Donald Trump is injecting his democracy-damaging fraud claims into a new election cycle, urging his friend Mehmet Oz to simply declare he won a too-close-to-call race for the Republican Senate nomination in Pennsylvania -- a key state in Trump's desperate bid to steal the 2020 election.",
    "In a state that could be pivotal to control of the US Senate, top Republicans are raising concerns that Mastriano could drag the party's Senate nominee down, while Democratic nominee Josh Shapiro is already shaping the race by warning the state could fall into the clutches of a dangerous extremist.",
    "Why it matters that Trump is up to his old tricks\nTrump is barging into the Senate race in Pennsylvania because there's still a chance that Oz, whom he endorsed last month, could lose out to the candidate the ex-President spurned, former hedge fund executive McCormick, when all votes are counted.",
    "As does the runaway victor in the commonwealth's GOP gubernatorial primary -- state Sen. Doug Mastriano, who ran a campaign rooted in Trump's falsehoods about the last presidential election being stolen and who could oversee the 2024 White House race in the state if he wins in November.",
    "Americans keen to move on from the former President might wonder why it matters what Trump wrote on a social media platform with a far smaller reach than Twitter, from which he was banned after the January 6, 2021, insurrection for inciting violence.",
    "Aides to McCormick, who has previously raised doubts about electoral integrity in the state, argue that uncounted absentee ballots -- the very outstanding votes that Trump falsely claimed in 2020 were proof of fraud -- will put him over the top.",
    "Trump's mendacity places intense pressure on Oz and McCormick to end their race with grace and for the loser to accept the result -- as candidates have done in America for nearly 250 years -- in order to preserve faith in US elections.",
    "But Trump's pressure on Oz, who late Wednesday had a lead of less than 1,300 votes among 1.3 million cast, represents a fresh attempt to stain the integrity of American democracy simply because it is not delivering the result he wants.",
    "The cliffhanger contest between Oz and David McCormick, another claimant to Trump's legacy, is the marquee race from Tuesday's round of primaries -- and carries calamitous echoes of 2020 election controversy and ill omens for 2024.",
    "He's proving that despite leaving Washington in disgrace after launching a campaign of lies designed to overturn his election loss, which resulted in an insurrection, he would have no qualms about doing so again.",
    "Trump has shown his power over his followers ever since 2020: his fraud falsehoods are now believed by millions, while many GOP candidates this year have made them a part of their campaign messaging.",
    "Mastriano is on record saying that the 2020 vote was compromised and the state legislature had the authority to appoint a new slate of electors, in defiance of voters, to send to Washington.",
    "\"I think people hopefully are, when it comes to the fall election, are very discerning and will be able to differentiate candidate for governor from the candidate for Senate,\" he told Raju.",
    "This confluence of threats to the state's democracy prompted Shapiro, the state's current attorney general and his opponent in the fall, to label Mastriano a \"dangerous extremist.\"",
    "It makes it much harder for them to cheat with the ballots that they just happened to find,\" Trump wrote on his ironically named social media network, \"Truth Social,\" on Wednesday.",
    "Whether he endorsed them or not, candidates were almost all running on Trumpism -- the \"America First\" populist nationalism that now dominates the Republican Party's grassroots.",
    "But his win in the gubernatorial primary means that an outright election denier from 2020 is now one step from power in one of the nation's most closely fought swing states.",
    "Oz has not, so far, taken Trump's advice and claimed victory, seeming to trust the election system in a state that the ex-President claimed was corrupt two years ago.",
    "If the former President was settled into his retirement on the fairways and greens of Florida, his dive into the Pennsylvania election wouldn't be so consequential.",
    "The ex-President claimed the Keystone State's election was a \"MESS,\" making the same kind of baseless claims he conjured after losing to President Joe Biden.",
    "Add to that the fact that as governor, Mastriano would have the authority to appoint a secretary of state who would run the commonwealth's election in 2024.",
    "But there is every sign Trump means to be a major player in November's midterm elections as a launch pad for an attempt to win the White House back in 2024.",
    "However, Tuesday's election results, like other primaries this year, contained a lesson for the former President, if he were minded to learn it.",
    "\"I don't think 2020 is what people are going to want to think about,\" Sen. Lindsey Graham of South Carolina told CNN's Manu Raju on Wednesday.",
    "The fear among Republicans is that Mastriano is so radical, he could not just emulate Trump in trashing Pennsylvania's electoral system.",
    "He backs candidates who strongly support him -- and who paid the price for his endorsement by amplifying his lies about election fraud.",
    "But this new example of interference in Pennsylvania is not history -- it's an active effort to delegitimize an election.",
    "Another Pennsylvania Republican candidate who suddenly has no problem with Pennsylvania's election system is Mastriano.",
    "But Trump is running the same corrupt playbook that he used nearly two years ago to falsely claim he won a second term.",
    "And some GOP senators in Washington, salivating at the chance to win back their chamber in November, are worried.",
    "He might also stigmatize the eventual GOP Senate nominee in a seat that could decide the destiny of the chamber.",
    "He's frustrated that Oz is having to wait for counts of absentee ballots and delayed votes counted in person.",
    "Mastriano also won a late endorsement from Trump, who may be on the ballot in the next presidential election.",
    "And if Oz loses, it could seriously delegitimize McCormick's victory among hard-core pro-Trump voters.",
    "Whoever comes out on top, a recount could be automatically triggered if the margin is narrow enough.",
    "He could also lose badly statewide by tanking among suburban moderate voters, just like Trump did.",
    "The South Dakota Republican said that some of Mastriano's statements \"aren't ideal.\"",
    "A cynic might conclude that this is because it delivered him a handsome victory.",
    "The reaction from GOP Senate Whip John Thune was a considerable understatement.",
    "So his victory is already ringing alarm bells in Washington.",
    "Those votes are just as valid as any cast in person.",
    "For Trump, however, the calculation is simple.",
    "Thune is banking on that not happening.",
    "\"Dr. Oz should declare victory."
  ]
}