{
  "id": 6603,
  "mediaId": 188,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Horowitz: Idaho conservatives poised to remake legislature like never before",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTgyNTYzOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2MTAzNTczM30.bbOobpLffjvF04qoBZWONf37TTiiXVKCBY0ly67dKPQ/img.jpg?width=1245&quality=85&coordinates=0%2C110%2C0%2C110&height=700",
  "link": "https://www.theblaze.com/op-ed/horowitz-idaho-legislature-conservatives",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Horowitz",
  "authorUrl": "https://www.theblaze.com/u/danielhorowitz",
  "termIds": [
    1433,
    3102,
    5267,
    5311,
    5328,
    562,
    571,
    2572,
    2706
  ],
  "sentences": [
    "Eight-term incumbent Adam Koenig, chairman of the House Licensing and Occupations Committee, was defeated by Steven Doan, a liberty candidate supported by Congressman Thomas Massie and state Rep. Savannah Maddox, a rising conservative star who might run for governor next year.",
    "While some of the races involved other quirks or were due to redistricting, and a few others were conservatives who were defeated by more ideologically ambiguous candidates, for the most part, conservatives downed many liberal Republicans and made gains in open seats.",
    "Because it is a de facto one-party state, many liberals who are well connected to the woke industries and lobbyists choose to run as Republicans and use their superior campaign cash to campaign as conservatives, the exact opposite of what they plan to do in office.",
    "Also, Rep. Greg Chaney, the outgoing chair of Judiciary, Rules & Administration in the House, lost his bid for a Senate seat, and Sen. Carl Crabtree, vice chair of the Joint Finance and Appropriations Committee, lost his seat.",
    "Republicans already have strong majorities in both houses, and if they can pick up the governorship with Doug Mastriano, a more conservative legislature can dramatically alter the political trajectory of the state.",
    "Vote-splitting has plagued conservatives for decades, and the institution of runoffs in more states would allow them to compete against the establishment without fear of dividing the vote of thinking voters.",
    "The Idaho media cheer for liberal Republicans because they dont really have Democrat horses to ride, but even they recognize the significance of the Idaho Freedom PACs work in changing the states politics.",
    "What this success at the legislative level demonstrates is that for lower offices, where the bar to entry is much lower in terms of financial needs, conservatives are on a much more level playing field.",
    "In Pennsylvania, Rep. Stan Saylor of York County and Sen. Pat Browne of Lehigh County, both the House and Senate appropriations committee chairs respectively, were defeated by conservative challengers.",
    "Rep. Ed Massey, chairman of the House Judiciary Committee from Hebron, and Rep. Sal Santoro, an eight-term incumbent and chairman of the Transportation Budget Committee, were also defeated.",
    "However, when you get past the statewide elections, which require tremendous money and organization to make competitive  money true conservatives dont have  we find a different story.",
    "This is why, despite a 58-12 majority in the House and a 28-7 majority in the Senate, conservatives rarely enjoy legislative wins that other red states are able to easily secure.",
    "Conservatives would have enjoyed an even better night if not for the fact that leadership drew several of them into the same district and forced them to compete with each other.",
    "Joint Finance and Appropriations Committee co-chair Sen. Jeff Agenbroad was defeated by Brian Lenney, who moved his family from California to Nampa in 2010.",
    "Establishment Republican elites are crowing about their apparent victories in both the Pennsylvania Senate race and the Idaho gubernatorial race on Tuesday.",
    "So, what gives when it comes to 63% of the Pennsylvania Republicans voting for Mehmet Oz or Dave McCormick over the conservative favorite, Kathy Barnette?",
    "Among the highlights were conservative Rep. Codi Galloway beating Sen. Fred Martin, the five-term Senate Health and Welfare Committee chair from Boise.",
    "One recent poll showed Ivey only garnering 40% of the vote, with socially conservative businessman Tim James in second place for a potential runoff.",
    "A total of 20 incumbent Republicans  11 running for the Senate and nine running for the House  were defeated or poised to lose as of Tuesday night.",
    "A bigger focus on state legislatures will pay great dividends in the future, and other states can mimic the work of the Idaho Freedom PAC.",
    "They each raised close to $16 million and ran as solid conservatives, so the other challengers, including Kathy Barnette, were outgunned.",
    "Even in a number of instances where the incumbent survived, the challengers came much closer than we usually see in statewide elections.",
    "Making red states red again and state legislatures great again will go a long way in divorcing ourselves from the morass of Washington.",
    "A big part of these results is thanks to the work of the Idaho Freedom PAC, which actively recruited candidates against incumbents.",
    "On the other hand, Doug Mastriano, likely the most conservative in the gubernatorial field, won his primary in a landslide.",
    "Conservatives also came within a hair of winning the office of secretary of state and only lost because of vote-splitting.",
    "In other states, mainly in the South, where there are runoffs, conservatives have a stronger chance to compete statewide.",
    "Additionally, two conservatives who moved from California to seek freedom in the Gem State defeated prominent incumbents.",
    "Out of the 15 remaining, nine were defeated, and several RINO House members seeking a Senate seat lost to conservatives.",
    "The RINOs can have the irremediably broken federal system, while we focus on rebuilding liberty in some of the states.",
    "Sen. Jim Patrick, who served five terms in the Senate and three in the House, was defeated by a conservative as well.",
    "Retired California firefighter Carl Bjerke took out Senate Health and Welfare Committee vice chair Sen. Peter Riggs.",
    "With less vote-splitting and slightly stronger candidates, conservatives can truly take over the state next time.",
    "Idaho has long suffered a paradox, in that it is so dominated by Republicans that it is not so Republican at all.",
    "Had there been a runoff option, the race might have picked up more momentum and could have become contested.",
    "In that case, there was no unified establishment candidate with endless sums of money to fool the voters.",
    "Even in the statewide elections, there are signs that in the future, conservatives can sweep the state.",
    "Overall, conservatives would be wise to focus more on state and local races rather than federal races.",
    "So, the fact that the Senate has caught up to it will give the legislature a lot of clout over Gov.",
    "This dynamic made the House results more of a wash, but the House was already fairly conservative.",
    "Indeed, the trend of RINO chairmen losing their seats played out in other states on Tuesday night.",
    "Former Congressman Raul Labrador defeated a 22-year incumbent for attorney general.",
    "Now he will face a brand-new caucus that can possibly vote him out of leadership.",
    "Senate President Pro Tempore Chuck Winder only won his race by about 640 votes.",
    "Three RINO Kentucky House chairs lost their seats in northern Kentucky.",
    "He was chairman of the Senate Commerce & Human Resources Committee.",
    "Thirteen of the 28 Republican senators didnt stand for re-election.",
    "Even for governor, Brad Little only secured 53% of the total vote.",
    "Next week, conservatives have an opportunity to draw Alabama Gov.",
    "Its truly hard to overstate the significance of this development.",
    "Last nights elections might have changed that in a big way.",
    "There is almost no parallel to that in recent history.",
    "Brad Little warded off a challenge from Lt. Gov.",
    "Saylor had been in the House for 30 years.",
    "Kay Ivey into a runoff.",
    "Janice McGeachin.",
    "Brad Little.",
    "Very simple.",
    "Idaho Gov."
  ]
}