{
  "id": 6609,
  "mediaId": 238,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Doug Mastrianos Pa. victory could give 2020 denier oversight of 2024",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/18/doug-mastrianos-pa-victory-could-give-2020-denier-oversight-2024/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Dawsey",
  "authorUrl": "https://www.washingtonpost.com/people/josh-dawsey/",
  "termIds": [
    3102
  ],
  "sentences": [
    "He told Bannon on Nov. 28, 2020, that the goal was to reassert our authority to pick the electors for president.?\nHe claimed that the Pennsylvania General Assembly had surrendered over to the popular vote? and insisted that the Constitution allowed the legislature to to reassert our privileges as General Assembly and oversee the electors that they go to the right person.?\nMastriano then traveled to Washington for the rally on Trumps behalf on Jan. 6, 2021.",
    "The Trump-endorsed 58-year-old, who won the Republican nomination for governor on Tuesday, would gain significant influence over the administration of the battleground states elections should he prevail in November, worrying experts already fearful of a democratic breakdown around the 2024 presidential contest.",
    "Trumps intervention was jumping out in front of the parade as it was crossing the finish line,? said Matt Brouillette, CEO of Commonwealth Partners, a pro-business group that responded to Trumps endorsement of Mastriano by calling on other candidates to clear the field and rally behind Barletta.",
    "A video posted to Telegram by election denial activist Ivan Raiklin from Mastrianos victory party on Tuesday showed the candidate smiling as Raiklin congratulated him on his win and added, with a thumbs up, 20 electoral votes as well,? a reference to the states clout in the electoral college.",
    "At a gubernatorial debate in April, Mastriano said he would appoint a secretary of state who would require all voters in the state to renew their registration to be eligible to participate in future elections, a proposal that experts said probably would violate federal law.",
    "In the weeks after the November 2020 election, Mastriano organized a public hearing in Gettysburg featuring then-Trump lawyer Rudy Giuliani and helped commission an off-the-books audit of voting machines in a rural Pennsylvania county that was funded by Trump allies.",
    "The biggest risk is a secretary of state just saying, Im not going to certify the election, despite what the court says and despite what the evidence shows, because Im concerned about suspicions,? said Clifford Levine, a Democratic election lawyer in Pennsylvania.",
    "If Doug loses in November, Trump will actually own more of it than not.?\nSome Republicans have worried that Mastrianos singular focus on 2020 could turn off voters who believe Bidens win was legitimate or who are otherwise more interested in looking to the future.",
    "Pennsylvania Attorney General Josh Shapiro, the Democratic gubernatorial nominee, has signaled that Mastrianos rhetoric on the election and presence in D.C. on Jan. 6, 2021, will be core to his argument that Mastriano is too extreme for the swing state.",
    "And hes proposed a bill that would remove the power to oversee elections from the secretary of state and hand it to a new election commission with members appointed by both the governor and the legislature, expanding the power of the General Assembly.",
    "Though challenges to Bidens win were rejected by state and federal courts, Mastriano proposed a resolution to declare the outcome of the states election in doubt and allow the Republican-controlled state legislature to appoint presidential electors.",
    "Buoyed by a late endorsement from Trump on Saturday, Mastriano, a retired Army colonel and state senator first elected in 2019, defeated eight other candidates for the Republican nomination, including former congressman Lou Barletta.",
    "Those concerns are made especially acute in Pennsylvania by the fact that the governor has the unusual authority to directly appoint the secretary of state, who serves as chief elections officer and must sign off on results.",
    "A person familiar with Trumps thinking said he decided to endorse Mastriano because he believed Mastriano was going to win on Tuesday, and he wanted to claim a win in Pennsylvania on Tuesday no matter what.",
    "One crucial function that the governor performs himself is signing the official certificate of the electoral college votes, and it is not clear what recourse there would be if a governor refuses to do so.",
    "That individual has agreed to be my secretary of state.?\nHe added that he planned to decertify voting machines in several Pennsylvania counties, a power given under state law to the secretary of state.",
    "But Mastriano told Stephen K. Bannon, a former adviser to Trump who now hosts a podcast popular on the right, that he had already selected the person he would appoint as secretary of state if elected.",
    "Though Trump can now add Mastriano to his prized tally of successful primary endorsements, the nod came so late, and after Mastriano was already leading in polls, that it wasnt seen as decisive.",
    "At times, Trump had grown annoyed with Mastriano, two former advisers said, because the state senator was unable to gain traction in helping Trump overturn the 2020 presidential election.",
    "The secretary of state can issue guidelines but has limited power to enforce them, which could be a check on the ability of an election denier to manipulate the system, Morrell said.",
    "Mastriano was a key figure in Pennsylvanias Stop the Steal? movement, falsely arguing that President Bidens more than 80,000-vote win in the state was the result of widespread fraud.",
    "He proposed removing requirements that poll watchers live in the counties they are sent to observe and imposing new penalties on election workers who block access to poll watchers.",
    "And he asserted that the Republican-controlled legislature should have the right to take control of the all-important choice over which presidential electors to send to Washington.",
    "But she said an appointee who embraces election conspiracy theories could use the position to amplify claims that, even if untrue, can erode public confidence in the system.",
    "As a Pennsylvania state senator and gubernatorial candidate, Doug Mastriano railed against the rampant fraud that he believes was responsible for Donald Trumps 2020 defeat.",
    "We would be in the same precarious situation we were in on January 6. In Pennsylvania, operational decisions on running elections are made at the local level.",
    "But Mastriano kept in touch with Trump and was willing to talk about the electoral fraud issue when others wanted to move on, two of these people said.",
    "Since the 2020 election, Mastriano has proposed a series of measures in the Pennsylvania Senate that would dramatically reshape the states elections.",
    "He has said he respected police lines, left the area when it became clear the event was no longer peaceful and did not enter the Capitol building.",
    "Other advisers argued that some of the candidates, such as Barletta, had been more loyal to him over the years, but Trump dismissed the arguments.",
    "As far as cleaning up the election, I mean, Im in a good position as governor,? he said in the April 23 appearance on Bannons War Room? podcast.",
    "As the law now stands, Pennsylvania is one of just three states where the governor directly appoints the states top elections official.",
    "Hes gonna have to rebrand himself.?\nThose who know Mastriano well say hes unlikely to shrink from his pledges to overhaul elections.",
    "You would start to have a breakdown in the legal system and the whole process.?\nMastrianos backers appear well aware of the stakes.",
    "State Rep. Aaron Bernstine, an ally of Mastrianos in Harrisburg, said voters could expect Mastriano to govern like he campaigned.",
    "It would be chaos,? said Jennifer Morrell, a former election administrator and partner at the Elections Group consulting firm.",
    "My opponent enabled their attacks by standing idly by, and even attended the January 6th insurrection,? he tweeted Wednesday.",
    "David Urban, a longtime Trump adviser, said Mastriano would have a difficult time winning a general election in Pennsylvania.",
    "President Trumps loyal to those that stand for truth and are trying to fight for voting integrity in our state,? he said.",
    "Like others interviewed for this report, they spoke on the condition of anonymity to discuss private deliberations.",
    "Videos show him among a crowd moving toward the Capitol as another man removes a bike rack blocking the sidewalk.",
    "When Republicans in Harrisburg sought to undermine our elections, I took them to court to defend our democracy.",
    "I have a voting-reform-minded individual whos been traveling the nation and knows voting reform extremely well.",
    "Urban said Mastriano would have to moderate his message and that he was not sure that was a likely possibility.",
    "Dave Ball, chairman of the Washington County GOP, agreed that Mastriano will have to reach out beyond his base.",
    "Ive always been of the basic view that when people tell you what theyre going to do, believe them.?",
    "The things he talks about are the things he would intend to do as governor,? Bernstine said.",
    "But he said Mastriano will need to build a broader coalition and agenda to win in November.",
    "Hes got to appeal to independents and moderate Republicans and everything else,? Ball said.",
    "In the general election, people have to moderate their message and move back to the middle.",
    "During the primary, Mastriano made his stance on the 2020 election central to his pitch.",
    "As governor, Mastriano would have the opportunity not just to speak, but to act.",
    "If he doesnt want to do that, he wont be a viable candidate,? he said.",
    "Given what weve seen so far, thats gonna be a trick.",
    "He has said he is opposed to any mail-in balloting.",
    "If he does that, he could be a viable candidate.",
    "Its going to be a top issue for me,? he said.",
    "He was hedging his bets,? this person said.",
    "Thats been his whole campaign,? Ball said.",
    "If he or she refuses, chaos could follow."
  ]
}