{
  "id": 6610,
  "mediaId": 195,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Primaries fuel questions about potency of Trump endorsements",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/buddtedd_cawthornmadison_051822ap-see-credits_split_trump-aftermath.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3493613-primaries-fuel-questions-about-potency-of-trump-endorsements/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    821,
    1106,
    1147,
    1404,
    1990,
    2303,
    3102,
    3103,
    428,
    571,
    2706,
    2834,
    2862
  ],
  "sentences": [
    "No, it wasnt the decisive factor.?\nIn Mastrianos case, he was already leading in the polls when Trump endorsed him, despite being outspent on air by the other GOP gubernatorial hopefuls  though he rose to prominence as a supporter of Trumps claims the 2020 presidential election was stolen from him.",
    "I think that is just yet another sign of somebody in an infrastructure thats so desperate to keep these wins because they know what it means to them.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "That to me is the broader and more important story moving forward.?\nHeye echoed this in a recent op-ed for CNN, writing that the media may continue posting Trump-based scorecards like a Preakness Stakes tip sheet,? but Trumpism is in the GOP for the long term.",
    "When you step back and try to judge and assess what happened last night, there are some things that worked against [Trump] that probably arent his fault and some things that he did in the past that make him look better,? said the GOP strategist.",
    "While Trumps favored Senate candidate in North Carolina, Rep. Ted Budd (R), won his primary decisively, others who had received his endorsement, including Rep. Madison Cawthorn (R-N.C.) and Idaho Lt. Gov Janice McGeachin, were defeated.",
    "Even as Trump endorsed and campaigned for Oz, McCormick and conservative commentator Kathy Barnette stayed in the race and sought to portray themselves as the candidates most aligned with Trumps brand of conservatism.",
    "For instance, endorsing a gubernatorial candidate in Pennsylvania who was going to win the nomination well in advance of that endorsement,? the strategist continued, referring to Mastrianos primary win.",
    "While last nights primaries are far from a defeat for the former president, they could stoke further questions about the extent to which he can clear primary fields and play kingmaker for the GOP.",
    "Tuesdays primaries are fueling questions about the strength of Donald Trumps endorsement even as the results underscored the extent to which the former president has molded the party in his image.",
    "Some pointed to Budd and Doug Mastriano, the newly minted GOP Pennsylvania gubernatorial nominee, as two who, while benefiting from Trumps endorsement, could have won their primaries without it.",
    "Even more disappointing for Trump, his endorsed candidate in the Pennsylvania Senate primary, Mehmet Oz, remains locked in a tight battle with hedge fund manager Dave McCormick.",
    "It makes it much harder for them to cheat with the ballots that they just happened to find.?\nThe statement has some asking whether the loss could ultimately damage Trumps brand.",
    "Vances surge from the middle of the pack to a win in Ohios Republican Senate primary earlier this month was seen as the first major win for a Trump-backed candidate this cycle.",
    "The awkward dynamic of the lieutenant governor challenging her own governor in a primary can be traced back to McGeachins past clashes with Little over the pandemic.",
    "And last week, Rep. Alex Mooney (R-W.Va.), who was backed by Trump, won his primary against Rep. David McKinley (R-W.Va.) in the states 2nd Congressional District.",
    "Trumps call to give Cawthorn, who had been plagued with numerous scandals, a second chance? did not appear to do much to help the first-term congressman.",
    "What hes really trying to push Oz to do which is declare victory now is in his best interests and not in Ozs best interests,? the GOP strategist said.",
    "McGeachin hit Little over his decision to issue a stay-at-home order in March 2020, despite Idahos economy reopening by June of that same year.",
    "Operatives argue that while Trumps pull with the conservative base may be decent, its not the only factor that can influence election outcomes.",
    "The spending they have done for Budd  if it werent for them, he wouldnt be where he is now,? said North Carolina GOP strategist Carter Wrenn.",
    "The more you put yourself out there, the more likely it is youre going to lose some, and he clearly has,? said one Republican strategist.",
    "Its a good ticket, but its not a golden ticket,? Republican strategist Doug Heye told The Hill of Trumps endorsement.",
    "The group spent more than $11.2 million on ads in support of Budd over the last week alone, according to AdImpact.",
    "Its the same as that.?\nThe party is more broadly turning Trumpier whether its with or without Trump,? Heye said.",
    "Meanwhile, Trump-backed Charles Herbster lost his gubernatorial bid in Nebraskas GOP primary that same night.",
    "Last year, McGeachin banned mask and vaccine mandates on two separate occasions when Little was out of state.",
    "Cawthorn called one of his six primary challengers, state Sen. Chuck Edwards, to concede on Tuesday night.",
    "Ultimately, though, it appears that Little had an incumbency and money advantage in Tuesdays primary.",
    "Trump, seemingly feeling the pressure, urged Oz to declare victory as soon as possible on Wednesday.",
    "For Budd, strategists say outside spending from the conservative group Club for Growth was a boost.",
    "Oz should declare victory,? the former president wrote on his Truth Social application.",
    "As it would be a Barack Obama nomination or a George W. Bush endorsement in the past.",
    "As of midnight on Monday, Edwards led with 33.4 percent of the vote.",
    "Every race in which Trump has endorsed has been watched closely.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "As of Wednesday, Oz led McCormick by fewer than 3,000 votes.",
    "Out in Idaho, McGeachins loss to incumbent Gov.",
    "Pennsylvanias Senate race is less clear-cut.",
    "Little trounced McGeachin, winning 52.",
    "Yeah, but was it that big of a deal?",
    "McGeachin trailed with 32.2 percent.",
    "Brad Little (R), was more expected.",
    "Cawthorn came in with 31.9 percent.",
    "Did the Trump endorsement help him?",
    "8 percent of the vote.",
    "J.D.",
    "Dr."
  ]
}