{
  "id": 6611,
  "mediaId": 129,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Republican Panic Grows After Mastriano Wins",
  "image": "https://static01.nyt.com/images/2022/05/18/multimedia/18onpolitics-mastriano/18onpolitics-mastriano-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/18/us/politics/mastriano-pa-republicans.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    1147,
    1282,
    1713,
    1990,
    1997,
    2087,
    2303,
    3102,
    4482,
    5424,
    428,
    2862
  ],
  "sentences": [
    "Listing his early priorities as governor, he said, mandates are gone,? any jab for job requirements are gone,? critical race theory is over,? only biological females can play on biological female teams? and you can only use the bathroom that your biological anatomy says.?\nThe Mastriano matchup also plays to Shapiros carefully cultivated image as a fighter for democracy, though his campaign plans to focus primarily on bread-and-butter economic issues such as jobs, taxes and inflation.",
    "Some in Pennsylvania blame Jeff Yass, a billionaire options trader and the states most powerful donor, for sticking with Bill McSwain for governor despite Donald Trumps blistering anti-endorsement; others point the finger at Lawrence Tabas, the state party chairman, for failing to clear the field; still others say that Trump should have stayed out of the race altogether instead of endorsing Mastriano.",
    "On the other side of the state, the editorial page of The Pittsburgh Post-Gazette has already all but officially endorsed Shapiro as the only statewide candidate who did everything the Pennsylvania way.?\nOperatives in both parties expect Shapiro to blitz Mastriano with advertising portraying him as a dangerous extremist while Mastrianos shoestring organization struggles to raise money.",
    "So, that candidate, whoever gets elected in Pennsylvania, will have to show that theyre going to make it a good race.?\nWhat to read\nIn primaries so far, Republican voters have appeared willing to nominate proponents of Donald Trumps election falsehoods, making clear that this years races may well affect future elections, Reid Epstein writes.",
    "The argument Kenyatta would make to young voters who might be souring on the Democratic Party, he said, was that when you elect a bigger, bolder Democratic majority,? it makes it easier to pass major progressive priorities like universal prekindergarten and student debt relief.",
    "An 11th-hour effort to stop Mastriano failed when both McSwain and Dave White, a self-funding candidate who spent at least $5 million of his own money, refused to drop out and support former Representative Lou Barletta, whose supporters insisted he was the more viable option.",
    "So it didnt surprise me when Kenyatta urged his followers to unite behind Fetterman, who also swims in many of the same leftward circles, but has tried to transcend his image as a Bernie Sanders-style progressive as the general election ramps up.",
    "He said the criticism was coming largely from consultants and rent-seekers who dont like us as we disrupt their gravy trains.?\nAfter the Pennsylvania and North Carolina Primaries\nMay 17 was the biggest day so far in the 2022 midterm cycle.",
    "Many Republicans thought that idea was futile and far too late; several said a serious effort to prevent Mastriano from winning should have begun last summer, while others said that Yass and his allies could have dropped McSwain sooner.",
    "Had they kept their powder dry, they could have seen the lay of the land, when Mastrianos lead was 8-10, and backed Barletta,? said Sam Katz, a former Republican candidate for governor who now backs Josh Shapiro, the Democratic nominee.",
    "Mastrianos name has appeared in documents released by the committee investigating the Capitol riot, and he claims to have been in close personal contact with Trump about their shared drive to overturn President Bidens victory.",
    "In the run-up to Tuesday night, Republicans openly used words and phrases like suicide mission,? disaster? and voyage of the Titanic? to convey just what a catastrophe they believed his candidacy will be for their party.",
    "Even before Mastriano clinched the nomination, Shapiros campaign aired an ad highlighting his views on abortion and the 2020 election as well as his ties to Trump, who lost the state to Biden by 80,000 votes.",
    "Conversations with Republican strategists, donors and lobbyists in and outside of Pennsylvania in recent days reveal a party seething with anxiety, dissension and score-settling over Mastrianos nomination.",
    "They note that Shapiro performed better than Biden did in Pennsylvania during his re-election race as state attorney general, and expect Shapiro to be flooded with donations from in and outside the state.",
    "Mastriano has appeared at events linked to QAnon, the amorphous conspiracy theory that alleges there is a secret cabal of elite pedophiles running the federal government and other major U.S. institutions.",
    "The only fault line that exists is between people who care about democracy and those who are autocratic, racist fascists who want to turn this nation into something that its never been,? Kenyatta said.",
    "The aftershocks of Tuesdays big primaries are still rumbling across Pennsylvania, but one impact is already clear: Republican voters choice of Doug Mastriano in the governors race is giving the G.O.P.",
    "As attorney general, Shapiro was directly involved in the Pennsylvania governments litigation after the 2020 election, and oversaw at least 40 cases of alleged voter fraud  winning every single one.",
    "Some Republicans believe the national tailwinds? blowing in their favor might help Mastriano win despite all of his weaknesses, but for now, Democrats are thrilled to be facing him in November.",
    "The question haunts many party leaders, who worry that widespread disillusionment with President Biden and with politics more broadly will lead many younger voters to stay home in November.",
    "Matthew Brouillette, head of Commonwealth Partners, which bankrolled McSwains campaign, noted that his organization also backed Carrie DelRosso, who won the lieutenant governors race.",
    "John Fetterman of Pennsylvania in the states Democratic primary for an open Senate seat, went straight to that point when I met him at his watch party last night in Philadelphia.",
    "remains committed to engaging in competitive gubernatorial contests where our support can have an impact.?\nThe statement left room for the possibility that the G.O.P.",
    "He organized buses to Washington for the Jan. 6, 2021, rally in Washington and can be seen on video crossing police lines at the Capitol as the rally became a riot.",
    "Its leftist politics are vastly different from Bidens centrism, but the group tends to rally behind the Democratic Partys official nominees once primaries end.",
    "On Tuesday night, the Republican Governors Association issued a lukewarm statement acknowledging Mastrianos victory, but suggesting he was on his own for now.",
    "An adviser to several Republican governors, speaking on the condition of anonymity, said there was wide displeasure with the outcome, calling him unelectable.",
    "Of the many unknowns hanging over the general election contests across the country this fall, a big one for Democrats is: Will young progressives turn out?",
    "Kenyatta, a gay Black man who recently married his longtime partner, said he was confident that Republican candidates were out of the cultural mainstream.",
    "In February, the committee demanded documents and information that are relevant to the select committees investigation? in a letter to Mastriano.",
    "The state senator and retired U.S. Army colonel has taken a hard line on abortion, which he has said should be illegal under all circumstances.",
    "Kenyatta had the backing of the Working Families Party, a scrappy progressive outfit centered in New York that supports like-minded candidates.",
    "A group is seeking to disbar Senator Ted Cruz of Texas for his involvement in the effort to overturn the 2020 election, Maggie Haberman scoops.",
    "He is likely to be an especially weak candidate in the crowded suburbs around Philadelphia, the states most important political battleground.",
    "Mastriano gave scant indication during Tuesdays victory speech that he was ready to shift toward a more palatable general election message.",
    "Jazmine Ulloa spoke with Chuck Edwards, the state lawmaker who ousted Representative Madison Cawthorn last night in western North Carolina.",
    "Had they spent $5 million in three weeks, they might have forced Trump to make a different choice and changed everything,? Katz added.",
    "He has refused to say whom he would appoint as secretary of state, a critical position overseeing election infrastructure and voting.",
    "Right now, the major players in governors races appear to be waiting to see how the race develops before making that determination.",
    "Republican voters in Pennsylvania have chosen Doug Mastriano as their nominee for governor,? Executive Director Dave Rexrode said.",
    "candidates who aggressively cast doubt on the 2020 election have fared best, while Democratic voters are pushing for change.",
    "Trumps Limits: The MAGA movement is dominating Republican primaries, but Donald J. Trumps control over it may be slipping.",
    "The Make America Great Again movement is dominating Republican primaries, Michael C. Bender and Maggie Haberman write.",
    "Thats the traditional pattern in midterm elections, and it is what happened in the Virginia governors race last year.",
    "Up Next: Closely watched races in Georgia and Alabama on May 24 will offer a clearer picture of Mr. Trumps influence.",
    "Understand the 2022 Midterm Elections\nWe make those decisions based on where we think we can be effective,? Gov.",
    "He has also been a leading advocate of the baseless claims that the 2020 election was stolen from Trump.",
    "Its a constant source of frustration for Democratic strategists, since younger voters lean left.",
    "Pete Ricketts of Nebraska, the co-chairman of the governors group, said on CNN on Sunday.",
    "Trump Endorsements: Most of the candidates backed by the former president have prevailed.",
    "Most Americans think thats ridiculous.?\n Blake\nIs there anything you think were missing?",
    "governors might help Mastriano should the Pennsylvania race be close in the fall.",
    "Malcolm Kenyatta, a dynamic 31-year-old state representative who lost to Lt. Gov.",
    "Most people do not want to ban books and cancel Elmo and Mickey Mouse,? he said.",
    "Mastriano had amassed nearly 45 percent of the vote as of Wednesday afternoon.",
    "Our policy has long been we get involved in races where we think we can win.",
    "Wait-and-see mode\nWill national Republicans help Mastriano or shun him?",
    "Ties to Jan. 6 and QAnon\nMastrianos vulnerabilities are legion, G.O.P.",
    "Kenyatta told me he would do his level best? to help unite the party.",
    "The Mastriano campaign did not respond to a request for comment.",
    "Tabas did not respond to a request for comment on Wednesday.",
    "He also has made statements that veer into Islamophobia.",
    "But is the former president in control of it?",
    "On the record\nIt all comes down to turnout.",
    "However, there are some noteworthy losses.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "Stop the Steal Endures: G.O.P.",
    "Wed love to hear from you.",
    "Here are more takeaways.",
    "Heres what weve learned.",
    "operatives lament.",
    "Young turnout.",
    "The R.G.A.",
    "fits."
  ]
}