{
  "id": 6612,
  "mediaId": 147,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Breaking down the primary results and what they mean for midterm elections",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/fullepisoode-768x512.jpg",
  "link": "https://www.pbs.org/newshour/show/breaking-down-the-primary-results-and-what-they-mean-for-midterm-elections",
  "sentiment": "0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Desjardins",
  "authorUrl": "https://www.pbs.org/newshour/author/lisa-desjardins",
  "termIds": [
    729,
    821,
    1147,
    1970,
    2087,
    2303,
    2325,
    2491,
    3102,
    3764,
    2862
  ],
  "sentences": [
    "As Dave said, in Pennsylvania, you have Summer Lee, who kind of  we wrote about at The 19th, had to kind of build her own pipeline to get to where she is now, and Fetterman, who is certainly seen as a progressive candidate, but is the current sitting lieutenant governor who has won  the only candidate and in that contest who had won statewide election, and so not necessarily somebody who is technically an outsider, right, I mean, literally the incumbent lieutenant governor, but really is kind of redefining what blue-collar could look like.",
    "And then  but then you also had Charles Booker coming out of Kentucky, who is going to be facing Rand Paul for that Senate seat, Charles Booker certainly somebody who is a more progressive candidate who is wanting to swing big in terms of Democratic priorities, and not just the incremental change that I think you saw a lot of folks thinking was more the pragmatic, safer choice just a couple of years ago.",
    "That is certainly something that the party is concerned about, thinking about how to raise awareness, and really educate voters who are wanting to be involved, and making sure that their vote counts headed into November, really kind of making sure that they galvanize those folks, not only to turn out, but to be made to feel that, if they turn out, that their vote is actually going to matter.",
    "And just about everything has gone wrong for Democrats in redistricting in the last few months, with a court striking down their gerrymander in New York, which was  which was going to potentially win them three additional seats, and just today, a Supreme Court in Kansas upholding a Republican gerrymander, which could give Republicans an additional seat there.",
    "I mean, look, the MAGA philosophy was still very much in play, particularly here in Pennsylvania, where The Philadelphia Inquirer said that they declined to even endorse candidates in the GOP primary because they felt that they could not because of the way that the party's politics were in this state.",
    "Errin Haines:\nOnce again, you have just a question for Democratic voters on whether they want to go with kind of more establishment folks or they want people who they see are going to be fighters, pushing for real, kind of big systemic change.",
    "And pretty much the only two Trump skeptics who did really well in congressional races last night were Republican Mike Simpson in Idaho and Republican Brian Fitzpatrick in Pennsylvania, who won primaries that largely escaped Trump's radar.",
    "Judy Woodruff:\nTo help us break down more of last night's results, I'm joined by David Wasserman of The Cook Political Report With Amy Walter and Errin Haines, editor at large of the nonprofit newsroom The 19th.",
    "Read the Full Transcript\nJudy Woodruff:\nOn the busiest primary day so far of the 2022 midterm elections, there were mixed results for Republican candidates endorsed by former President Donald Trump.",
    "Gisele Barreto Fetterman, Wife of John Fetterman: I would like to take a moment to address the elephant in the room, which is that my husband, John Fetterman, is not in the room tonight.",
    "(CHEERING AND APPLAUSE)\nLisa Desjardins:\nDemocrats' candidate will be Cheri Beasley, the state's former chief justice, hoping to become the third Black woman elected to the U.S. Senate.",
    "And it looks like a Blue Dog Democrat, conservative Democrat, Kurt Schrader, in Oregon will go down to defeat in his primary against a more progressive challenger, Jamie McLeod-Skinner.",
    "Dr. and former TV host Mehmet Oz, Donald Trump's chosen candidate, narrowly leading his Republican opponent businessman David McCormick, with thousands of mail-in votes left to count.",
    "Interesting that, in some of these states, it's the more progressive Democratic candidate who was winning against the, I guess, so-called establishment mainstream Democrat.",
    "With or without his endorsement, you saw either people who were endorsed by Trump or who subscribe to that style of politics absolutely on display on the Republican side.",
    "But the big lie is absolutely on the ballot, with Mastriano being one of those people who would have voted to certify the election for former President Trump in 2020.",
    "In Pennsylvania, Doug Mastriano, the now Republican nominee for the gubernatorial contest in Pennsylvania, was endorsed kind of in the 11th hour by President Trump.",
    "Look, you had candidates like Kathy Barnette, who ends up being a spoiler in that GOP primary with Oz and McCormick, saying MAGA is  does not belong only to Trump.",
    "Judy Woodruff:\nAnd, Dave Wasserman, we  if we step back for a minute, we look at where  where these congressional races across the country  how they're shaping up.",
    "And redistricting, which looked like it could be a silver lining in a bleak election cycle for them a couple of months ago, has shifted in Republicans' direction.",
    "On Tuesday, the busiest primary day so far of the 2022 midterm elections, there were mixed results for Republican candidates endorsed by former President Trump.",
    "Whoever comes out on top will face off in November against Pennsylvania's current lieutenant governor, John Fetterman, who easily won the Democratic primary.",
    "But it'll be interesting to see how President Trump really factors into the general election, knowing how pivotal Pennsylvania was in the 2020 election.",
    "So, on the whole, it looks like Republicans might net two or three seats from redistricting alone, before you even factor in the political environment.",
    "(CHEERING AND APPLAUSE)\nLisa Desjardins:\nIn Pennsylvania:\nMehment Oz (R), Pennsylvania Senatorial Candidate: We're not going to have a result tonight.",
    "But two other controversial Republicans who are very pro-MAGA who Cawthorn endorsed won their primaries in North Carolina for very competitive seats.",
    "And, for Democrats, several races provided the first true test of what the party's message will be with Trump no longer at the top of the ticket.",
    "And layer on top of that the voter suppression laws that have swept state legislatures that are going to be in place headed into November.",
    "And in Idaho, the Trump-endorsed lieutenant governor lost a challenge to her boss and fellow Republican, incumbent Governor Brad Little.",
    "Lisa Desjardins reports, and David Wasserman of The Cook Political Report, and Errin Haines of The 19th, join Judy Woodruff to discuss.",
    "Congressman Kurt Schrader, endorsed by President Biden, was trailing a progressive challenger, environmentalist Jamie McLeod-Skinner.",
    "You also had Summer Lee, a state representative, who is narrowly ahead of the more moderate candidate for an open seat in Pittsburgh.",
    "There's still a chance that Trump's preferred candidate, Mehmet Oz, will win the Pennsylvania Senate primary on the Republican side.",
    "But when you look at what's going on with redistricting, it makes that almost  it makes it a big mountain for them to climb.",
    "And regardless of whether President Trump endorsed or didn't endorse certain winners, the party is moving in his direction.",
    "Rep. Ted Budd:\nThat America first agenda, it led to historic job growth, wage growth and prosperity for all Americans.",
    "Congressman Ted Budd emerged from a crowded Republican field that included a former governor and a former congressman.",
    "Judy Woodruff:\nWell, it is  it's only the middle of May, a long way to go, but we do have some new numbers to look at.",
    "It's also the large number of Republican candidates who say they don't believe the  accept the 2020 election results.",
    "You had John Fetterman, who is perceived to be more progressive, win comfortably in the Pennsylvania Senate primary.",
    "Maybe they're voting for the candidates who they personally like and trust without a big emphasis on ideology.",
    "Governor DeSantis in Florida overpowering his own legislature to pass a pretty aggressive gerrymander there.",
    "This is somebody who's been a judge for 20 years and that  and was the clear front-runner in that contest.",
    "Look, Madison Cawthorn, whom Trump endorsed, self-sabotaged his way to defeat in Western North Carolina.",
    "Kathy Barnette (R), Pennsylvaniia Senatorial Candidate: Thank you so much for all of your hard work.",
    "And I think the overall takeaway is that maybe Democratic voters aren't subscribing to this framing.",
    "Judy Woodruff:\nAnd, Errin, we have been hearing for some time this is not a good year for Democrats.",
    "Trump's endorsement couldn't save controversial Congressman Madison Cawthorn, who lost his primary.",
    "Braddock kind of looking like the new Scranton, essentially, in this contest headed into the fall.",
    "(LAUGHTER)\nLisa Desjardins:\nFetterman remains in the hospital after suffering a stroke on Friday.",
    "And for Democrats, several races provided the first true test of what the partys message will be.",
    "And we could be looking at a Republican gain in the House of somewhere between 20 and 35 seats.",
    "Lisa Desjardins:\nBoth fending off a late surge from conservative commentator Kathy Barnette.",
    "Cheri Beasley (D), North Carolina Senatorial Candidate: I am honored to be your nominee.",
    "And Democrats are clear underdogs at this point to retain their majority in the House.",
    "Because, again, it's not only the candidates that former President Trump has endorsed.",
    "And there was no clear verdict on the left or center fight in the Democratic Party.",
    "As a few in the Tar Heel State got closer to Congress, someone else was shown out.",
    "David McCormick (R), Pennsylvania Senatorial Candidate: We can see the path ahead.",
    "Next week, political attention turns south, with heated primary races in Georgia.",
    "I want to ask about the influence of President Trump, the candidates he endorsed.",
    "So this could end up being something of a grudge match for the former president.",
    "Now, this is somebody who didn't need the former president's endorsement.",
    "Republicans instead chose state Senator Chuck Edwards as their nominee.",
    "Lisa Desjardins:\nA key Senate primary contests still too close to call.",
    "(CHEERING AND APPLAUSE)\nDavid McCormick:\nAnd it's all because of you.",
    "He was already looking likely to be the nominee even without that.",
    "And we thank you both for helping us understand what's going on.",
    "David Wasserman, The Cook Political Report:\nThat's right, Judy.",
    "What do you see going on there, certainly Pennsylvania Senate?",
    "And I think we have a map showing some redistricting results.",
    "And you also had Cheri Beasley coming out of North Carolina.",
    "Errin Haines, The 19th News: That's absolutely right, Judy.",
    "And his campaign says he will be back on the trail soon.",
    "Judy Woodruff:\nAnd, Errin Haines, what do you see here?",
    "Earlier, on Election Day he had a pacemaker implanted.",
    "Errin Haines, Dave Wasserman, thank you so much.",
    "Out West, a Democratic incumbent is in trouble.",
    "Welcome back to the \"NewsHour\" to both of you.",
    "So maybe you can work that into your answer.",
    "Well, when it rains, for one side, it pours.",
    "Dave Wasserman, let's turn to the Democrats.",
    "David Wasserman:\nYes, it was a mixed bag.",
    "And we're seeing that across the country.",
    "And that's a big win for progressives.",
    "Dave Wasserman, let me start with you.",
    "Lisa Desjardins begins our coverage.",
    "Judy Woodruff:\nNo question about it.",
    "But, at this point, what do you see?",
    "There are still primaries to go.",
    "David Wasserman:\nThat's right.",
    "Errin Haines:\nAbsolutely.",
    "We can see victory ahead.",
    "For the \"PBS NewsHour.\"",
    "And she's right, right?",
    "I'm Lisa Desjardins.",
    "Not all of them won.",
    "It was a mixed bag.",
    "How did they do?"
  ]
}