{
  "id": 6617,
  "mediaId": 323,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "The Disinformation Governance Board, Disavowed",
  "image": "https://images.wsj.net/im-547361?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/the-disinformation-governance-board-disavowed-nina-jankowicz-homeland-security-mary-poppins-11652910532",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    1147,
    1647,
    2303,
    2491,
    3102,
    4596,
    5434,
    156,
    549,
    3544
  ],
  "sentences": [
    "Plus, Pennsylvania Republicans nominate Doug Mastriano for Governor, while progressive candidates surge, and Rep. Madison Cawthorn loses after becoming plagued by scandal.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nOnly three weeks after that announcement, media reports say the board is being paused? and Ms. Jankowicz has resigned.",
    "Homeland Security says the board has been grossly and intentionally mischaracterized: it was never about censorship or policing speech in any manner.? It wasnt even meant to have operational capability.?\nEven if this is true, a board that sounds like a government fact-checker was a lousy idea sure to feed public mistrust.",
    "WSJ Opinion: The Mary Poppins of DisinformationPlay video: WSJ Opinion: The Mary Poppins of Disinformation\n Wonder Land: When progressives start using phrases like disinformation governance and gendered abuse, one hopes they aren't shocked that some people think they are being euphemized into silence.",
    "You can just call me the Mary Poppins of disinformation,? she tweeted last year, with a video of herself singing modified song lyrics to Supercalifragilisticexpialidocious.?\nShe also tweeted that she hoped the adtech industry stops placing ads for masks and worse (straight up disinfo!)",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nOpinion: Potomac Watch\nDr. Oz and David McCormick in Overtime\nPennsylvania's hotly contested GOP Senate primary is still undecided, with Mehmet Oz and David McCormick potentially headed toward a recount.",
    "Nina Jankowicz\n Photo: Department of Homeland Security\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nListen to article\nLength (2 minutes)\nAD\nLoading advertisement...\n00:00 / 02:15\n1x\nThis article is in your queue.",
    "She said Hunter Bidens laptop should be seen as a Trump campaign product.? In 2016 she tweeted this conspiracy theory: Trump had not one, but two secret email servers to communicate w/ influential Russian bank.",
    "Open Queue\nQuick as she came, the Mary Poppins of Disinformation unfurled her umbrella and floated away to her next job, nannying another nation of children who had the wrong ideas.",
    "The whole episode has been comedic, other than that the government wasted your tuppence setting up a board that will probably never operate.",
    "And why hire Ms. Jankowicz, a Democratic partisan with a record of defining disinformation as political facts or opinions she doesnt like?",
    "on articles and info about coronavirus.? That was in March 2020 when masks were dismissed, shortly before they were required.",
    "Surely Homeland Security has a few capable bureaucrats who could track foreign disinformation in an apolitical manner.",
    "Nina Jankowicz, age 33, was supposed to lead the Department of Homeland Securitys new Disinformation Governance Board.",
    "Images: Getty Images/Bettman Composite: Mark Kelly\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "WSJ Opinion: The Mary Poppins of Disinformation\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "0:00 / 4:32\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Or at least the audience at home must be hoping theres not a sequel.",
    "Could Donald Trump's endorsement have been the deciding factor?",
    "Unbelievable.? Disinformation doctor, refute thyself.",
    "Why did benign explanations take so long to arrive?",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "It isnt difficult to see why."
  ]
}