{
  "id": 6625,
  "mediaId": 558,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "US midterms and the strange demise of the political center",
  "image": "https://s.yimg.com/ny/api/res/1.2/ZZf6f7TXEOD3nvMfZRB1yQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY1MTtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Di6PGoAw.9GVdaSjj0skzg--~B/aD01MjE7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.sg/e1bbc2298660a51f59525f6b73d32bdc",
  "link": "https://ph.news.yahoo.com/us-midterms-strange-demise-political-013656654.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frankie TAGGART",
  "authorUrl": "",
  "termIds": [
    1090,
    1147,
    1304,
    1563,
    2087,
    2117,
    3102,
    5258,
    2945
  ],
  "sentences": [
    "But Trump, whose status as political kingmaker is being tested, also experienced setbacks Tuesday including in Idaho, where his favorite gubernatorial candidate Janice McGeachin, who reportedly said this month that \"Christ will reign in the state,\" lost to the incumbent.",
    "The races are early fronts in a battle already playing out in Republican and Democratic primary contests across America, as establishment politicians find their hopes of representing their parties in the midterms threatened by more extreme challengers.",
    "It isn't campaigning as Lincoln or Kennedy knew it, but it worked for midwestern underdog candidate J.R. Majewski, and analysts worry it could be a glimpse of future US primary election seasons in a country that is losing its moderate political center.",
    "In Pennsylvania, state senator and election denier Doug Mastriano, who helped Trump try to overturn the state's 2020 results that favored Biden, swatted away several less controversial Republicans Tuesday to win the party's nomination for governor.",
    "In South Carolina, another Trump-endorsed hopeful, Katie Arrington, has called for disbanding the US Department of Education, President Joe Biden's impeachment and the arrest of government Covid-19 advisor Anthony Fauci.",
    "Establishment Republicans in Majewski's northwest Ohio swing district -- where he is vying to win a US House seat in November's midterm elections -- spent six-figure sums trying to get more moderate rivals nominated.",
    "But the Trump-backed air force veteran and conspiracy theorist won anyway, seeing off more favored state lawmakers after being endorsed by Paul Gosar, a far-right congressman.",
    "She is challenging first-term Republican congresswoman Nancy Mace, who is out of favor with Trump after blaming him for the 2021 US Capitol assault.",
    "A TV ad featuring an assault rifle and a vow to do \"whatever it takes\" to restore America to its \"former glory.\"",
    "A giant Donald Trump mural on the front lawn.",
    "An anti-Biden rap video."
  ]
}