{
  "id": 6627,
  "mediaId": 65,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Pennsylvania proves Republicans still want 'America First'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2c37f3f0-6945-4ba3-b839-796160d15124/f6b8c781-fe50-4f2c-b97b-1ceb167c04a6/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/opinion/pennsylvania-republicans-donald-trump-david-bossie",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David N. Bossie",
  "authorUrl": "https://www.foxnews.com/person/b/david-n-bossie",
  "termIds": [
    2303,
    3102
  ],
  "sentences": [
    "Despite being victorious in an amazing 58 of the 59 primary elections in which he endorsed a candidate going into Tuesday nights contests in Pennsylvania, North Carolina, Idaho, and Oregon, the biased mainstream media and political establishment were poised to launch another assault on President Donald Trumps strength in the Republican Party if his latest slate of candidates had a subpar showing.",
    "These convincing results make it clear that voters fully understand that their constitutional rights and God-given liberties are under assault by the Biden administration, and they want tough state attorneys general to band together and take a stand.",
    "CLICK HERE TO GET THE OPINION NEWSLETTER\nIn Idahos Republican primary for state attorney general, anti-establishment conservative Raul Labrador defeated the states longest serving Attorney General Lawrence Wasden by the wide margin of 51% to 39%.",
    "The top three finishers, Oz, Dave McCormick and Kathy Barnette, are all conservative political outsiders in the Trumpian tradition, all campaigned for President Trumps endorsement and strongly support his America First agenda.",
    "In fact, Trumps stamp of approval paved the way for Congressman Budd to win a once unthinkable 59% of the vote in a crowded and competitive field of candidates that included a popular former governor.",
    "Even in North Carolinas 11th congressional district primary where freshman Rep. Madison Cawthorn was defeated due to an avalanche of negative news reports, he still only lost by 1,300 votes.",
    "Voters know that President Trumps 'America First' agenda is the right one for our country, and they want MAGA, anti-establishment political outsiders to represent them in elected office.",
    "But facts are stubborn things and today the polls show that President Trump cant be seriously challenged in the Republican presidential primary in 2024 if he chooses to run again.",
    "But heres one thing we know for certain: every Republican candidate who prevails in the next round of primaries will do so because he or she supports Trump America First policies.",
    "The former presidents support among GOP primary voters is proving to be as resilient and loyal as ever, much to the chagrin of those yearning to write his political obituary.",
    "So, while tracking endorsements, wins and losses is good for ratings and clicks, its important not to lose sight of where the hearts and minds of the American people are.",
    "Other than the Oz-McCormick race which is still up in the air, President Trump had a very strong night winning 23 out of 25 races he endorsed in for the May 17 primaries.",
    "The race appears headed to a recount, but anyone who follows tight elections knows that Ozs current vote lead will be very difficult  if not impossible  to overcome.",
    "The results in Pennsylvanias U.S. Senate primary are still too close to call at this hour; however Trump-endorsed candidate Dr. Mehmet Oz has the lead.",
    "And in the Tar Heel States 13th district, Trump endorsed candidate Bo Hines won handily even though the \"experts\" were predicting a nail biter.",
    "President Trump will win most of the races he endorsed a candidate in, maybe lose a race here or there, and some will likely go to a run-off.",
    "The liberal media will work hard to sweep the implications of Budds massive haul under the rug, but what it means is unmistakable.",
    "As each week of primaries come and go, Trump haters desperately want their preferred narrative to take hold, but it never does.",
    "In the gubernatorial election, President Trumps endorsement propelled conservative State Sen. Doug Mastriano to victory.",
    "They want a booming economy, low gas prices, a secure border, safe streets, and a peace through strength foreign policy.",
    "Furthermore, the field of Republican candidates received more than 140,000 more votes than their Democrat counterparts.",
    "But on election night with Trump in his corner, he received a whopping 44% of the vote in a very crowded field.",
    "This enthusiasm gap could make all the difference in the general election in the all-important Keystone State.",
    "In North Carolinas primary election for U.S. Senate, conservative Congressman Ted Budd fit the bill perfectly.",
    "President Trump remains very strong in the critically important battleground state of North Carolina.",
    "Regardless, the anti-Trump media and anti-Trump political establishment will be ready to pounce.",
    "Labrador is a former four-term congressman and leading member of the House Freedom Caucus.",
    "President Trump endorsed Budd early on, and it paid off in spectacular fashion.",
    "Now its onto next Tuesdays primary contests in Alabama, Arkansas and Georgia.",
    "Before Trump threw his support behind Mastriano, he was polling in the 20s.",
    "The trends that continued last night across the country are crystal clear.",
    "Voters are longing for the Trump years of promises made and promises kept.",
    "As each primary comes and goes, one undeniable fact will emerge.",
    "Those numbers are an exclamation point that cant be ignored.",
    "And once again, it didnt happen by a long shot."
  ]
}