{
  "id": 6631,
  "mediaId": 238,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Opinion Say it clearly: Republicans just nominated a pro-Trump insurrectionist",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/18/doug-mastriano-insurrectionist/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Sargent",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "Sarah Posner, a scholar of the religious right, has extensively demonstrated that Mastrianos efforts for Trump were infused with Christian nationalist fervor, which holds that Trump was installed in the White House by God as restorer of Americas white Christian heritage.?\nMastriano hinted at this in his victory speech Tuesday night.",
    "In light of these facts, the story everywhere is, election denier won nomination,? or in another iteration, election conspiracist won.? But Mastriano is not just an election denier? or an election conspiracist.?\nThese phrases create the impression that Mastriano is merely delusional in some backward-looking sense.",
    "When Mastriano tried to help Trump in 2020, he adopted the radical argument that the Pennsylvania legislature had the sole authority? to reappoint new electors for Trump, because Bidens win was compromised.?\nMastrianos claim of a compromised? Biden win, of course, wasnt tethered to actual facts.",
    "Lets state this plainly: Pennsylvania Republicans just nominated a full-blown insurrectionist who intends to use the power of the office to ensure that, as long as he is governor, no Democratic presidential candidate wins his state again.",
    "Voxs Zack Beauchamp describes these tendencies as American Orbanism,? after Hungarian leader Viktor Orban: It relies on religiously inspired culture-warring to energize and justify the curtailment or abandonment of democracy.",
    "Mastriano is running on what is functionally an open vow to use the power of the governors office to nullify future election losses, even if they are procedurally legitimate, and even if he knows this to be the case.",
    "As she says, this worldview holds that the United States was founded as a Christian nation, and that this is being subverted by satanic and secular forces that Christian nationalists are duty-bound to resist.",
    "He helped bus in Trump supporters and attended the rally on Jan. 6, 2021; as state senator he argued for the invalidation of Joe Bidens electors; and hes continued falsely claiming election fraud ever since.",
    "The suggestion is that hes obsessing over already-settled matters that wont be reopened, or that he actually believes the election was stolen and cant let go of that myth out of personal loyalty to Trump.",
    "But lets be clear: Hes telegraphing a willingness to attempt such a thing, and that hed likely see it as a righteous act as well, even if theres little actual voter fraud, and even if he knows this.",
    "He uses people like you and me to change history.?\nThe idea that Mastrianos victory shows God using him to change history? is a textbook Christian nationalist trope, notes Posner.",
    "Mastrianos victory also highlights another story thats bigger than this one contest: The role of Christian nationalism in fueling the growing insurrectionist streak on the right.",
    "To prevent the subversion of the Christian nation,? Posner added, he hopes to take the God-given power to change election results? to the governors mansion.",
    "The aim of overturning the election was itself such a righteous goal that the creation of a pretext for accomplishing it was justified on that basis.",
    "Thats been orthodoxy? for a long time, Posner says, but the new ingredient is the eagerness to overturn elections in service of that higher end.",
    "This nexus underscores the danger this movement poses in a way that also demands more clarity about the worldview of candidates like Mastriano.",
    "Now that Doug Mastriano has won the GOP nomination for governor in Pennsylvania, countless news accounts are describing him with that phrase.",
    "As governor, Mastriano would likely handpick a secretary of state who would resist certifying a razor-thin legitimate Democratic victory.",
    "After Mastriano prevailed by double digits on Tuesday night, news accounts noted Mastrianos key role in trying to overturn Trumps loss.",
    "It should be obvious that phrases like election denialist? and election conspiracist? dont do justice to what were really seeing here.",
    "Even procedurally legitimate electoral outcomes can be deemed out of step with Gods plan and subject to nullification.",
    "Mastriano is saying hes empowered as a believer to overturn election results to achieve Gods will,? Posner said.",
    "The 2024 election in Pennsylvania might not be close; either the Republican or the Democrat might win easily.",
    "This is meant to convey the idea that Mastriano wont accept Donald Trumps 2020 presidential reelection loss.",
    "Whats important is that Mastriano is making a statement about his forward-looking intentions as governor.",
    "Mastriano may be delusional or given to conspiracy theorizing, but this is largely beside the point.",
    "And Mastriano would likely try to certify sham electors for Trump or another GOP candidate.",
    "This may seem like a leap, but to experts in Christian nationalism, it makes perfect sense.",
    "Its their patriotic duty as believers to fight for that Christian nation,? Posner told me.",
    "Getting it right on whats at stake in places like Pennsylvania is truly urgent.",
    "In this telling, liberal democratic proceduralism is inherently nonbinding.",
    "Whether Mastriano believed? that widespread fraud happened doesnt matter.",
    "This becomes unavoidable once you look closely at Mastrianos own conduct.",
    "Either way, the creation of the pretext itself becomes a righteous act.",
    "And his Christian nationalist sympathies underscore the point.",
    "Alternatively, such an effort by Mastriano might fail.",
    "But heres the crucial point: It didnt have to be.",
    "The situation is worse than this.",
    "Thats true, but its insufficient.",
    "God is good,? Mastriano said."
  ]
}