{
  "id": 6633,
  "mediaId": 136,
  "date": "d2022-05-18T15:04",
  "headline": "Donald Trump Scored Key Ally for 2024 Election Last Night",
  "image": "https://d.newsweek.com/en/full/2040111/trump-2024-pennsylvania-mastriano.webp?w=790&f=f184d276c32fae6751232d5b21212d5b",
  "link": "https://www.newsweek.com/donald-trump-scored-key-ally-2024-election-last-night-1707770",
  "sentiment": "0.563",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Fung",
  "authorUrl": "https://www.newsweek.com/authors/katherine-fung",
  "termIds": [
    1147,
    1282,
    1625,
    1713,
    1997,
    2087,
    3102,
    425,
    2862,
    2934
  ],
  "sentences": [
    "Mastriano was among the Republicans who signed on to Texas' amicus brief asking the Supreme Court to throw out the 2020 electoral results from a number of states, including Pennsylvaniawhere Biden carried the state with just over 50 percent of the vote and gained 20 electoral votes.",
    "On Tuesday, Mastrianoone of the most far-right gubernatorial candidates to receive the party's nominationbeat out former congressman Lou Barletta and former U.S. Attorney Bill McSwain with more than 44 percent of the GOP vote.",
    "\"After 8 years of the disastrous policies of Tom Wolf, Republican voters in Pennsylvania have chosen Doug Mastriano as their nominee for Governor,\" RGA Executive Director Dave Rexrode said after the gubernatorial primary.",
    "Not only has the state senator pursued legal and legislative efforts to overturn President Joe Biden's victory but he was also at the U.S. Capitol on January 6, 2021, the day pro-Trump supporters stormed the building.",
    "But before Mastriano can become a key Trump ally in 2024, he will have to beat Shapiro, the state's attorney general, later this year in a tough bid to replace Wolf, who is stepping down because of a term limitation.",
    "Even after Biden was inaugurated, Mastriano continued to challenge the state's election process, sending a letter to several counties requesting a forensic investigation into the 2020 race and last year's primaries.",
    "Former President Donald Trump scored a huge win Tuesday that could benefit his 2024 political ambitions after Pennsylvania Republicans overwhelmingly voted for state Senator Doug Mastriano to be the next governor.",
    "\"The country, and Pennsylvania, is worse off under Democratic leadership and Josh Shapiro, who will continue the same policies that have led to record inflation and increased violent crime,\" Rexrode added.",
    "\"The RGA remains committed to engaging in competitive gubernatorial contests where our support can have an impact in defending our incumbents and expanding our majority this year.\"",
    "I could decertify every machine in the state with the stroke of a pen via my secretary of state,\" Mastriano said during a March 30 appearance on WPIC's Eric Bombeck radio show.",
    "If Mastriano wins November's general election against Democrat Josh Shapiro, he would have the power to appoint the secretary of state, who oversees Pennsylvania's elections.",
    "When it comes to promoting Trump's baseless claims about a \"stolen\" presidential election in 2020, Mastriano has been one of the former president's most loyal allies.",
    "Mastriano, who received a last-minute endorsement from Trump three days before the primary, could be a major help to the former president in Pennsylvania politics.",
    "On the legislative level, Mastriano introduced a resolution urging Congress to ignore the 2020 election results certified by Pennsylvania's secretary of state.",
    "Mastriano, meanwhile, has been seen as a divisive figure and has the GOP worried he might drive away moderate and independent voters in Pennsylvania.",
    "\"I get to appoint the secretary of state, who's delegated from me the power to make the corrections to elections, the voting logs and everything.",
    "It was not taken up in the Republican-controlled Legislature because current Governor Tom Wolf, a Democrat, did not call a special session.",
    "He's been very loyal on election integrity and a lot of different things,\" Trump said early Tuesday on the Chris Stigall podcast.",
    "On Tuesday night, the association released a statement acknowledging his win but stopped short of congratulating him.",
    "\"I think it's a very corrupt election process that takes place in Pennsylvania, and a lot of people do,\" he said.",
    "\"I'd like to tell you every vote counts, and it should be that way,\" Trump said about Pennsylvania's elections.",
    "Even the Republican Governors Association (RGA) seems to be aware of the difficult challenge Mastriano faces.",
    "Trump has teased another presidential run in two years but has not declared his candidacy.",
    "However, he added that he still thinks voters in the state should cast their ballots.",
    "On Tuesday, Trump called election integrity in Pennsylvania \"the biggest problem.\"",
    "Shapiro, who ran unopposed, has rallied Democrat voters across the state.",
    "\"But the more we win by, the harder it is for them to cheat.",
    "\"Mastriano has a very big base.",
    "Let's put it that way.\""
  ]
}