{
  "id": 6635,
  "mediaId": 881,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "A QAnon-Loving Election Denier Just Won Pennsylvanias GOP Governor Primary",
  "image": "https://video-images.vice.com/articles/6284f68bf9ba8f009eafe9e9/lede/1652881040733-gettyimages-1397825685.jpeg?crop=1xw:0.8427xh;0xw,0xh&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/xgdn57/pennsylvania-doug-mastriano-primary",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    1147,
    1282,
    1713,
    1990,
    2087,
    3102,
    414,
    428,
    2862
  ],
  "sentences": [
    "He regularly used the hashtags #QAnon and #thegreatawakening, and just weeks ago spoke at a QAnon conference, where he argued that America is a Christian nation, mocked what he called this myth of the separation of church and state,? and promised the audience that he and they are taking our country back.?\nMastriano is involved in a coalition of QAnon-aligned candidates running for elected positions that would put them in control of state election systems.",
    "The Republican Governors Association has yet to reserve airtime in Pennsylvania, unlike many other swing states with governors races on the ballot this year, and sources tell VICE News that the organization is much less likely to spend significant resources in the state if Mastriano is the nominee.",
    "But he rocketed to rightwing stardom by trumpeting false claims that President Joe Bidens 82,000-vote win in Pennsylvania was rigged, worked to try to block Bidens election win from being certified, attempting to get the legislature to toss out Bidens win and name Trump winner of Pennsylvania.",
    "Democratic Attorney General Josh Shapiro, who won his primary Tuesday to face Mastriano, ran a TV ad that called Mastriano one of Donald Trumps strongest supporters? and highlighted Mastrianos fight to audit the 2020 Pennsylvania election.",
    "And they may be right: A recent poll conducted by Pennsylvania-based Republican firm Osage Research found that Shapiro led Mastriano by 49%-41%, when a generic Republican would lead the governors race by a three-point margin.",
    "As NBC News first reported, Mastrianos staffer was just feet away as rioters surged through a shattered door into the Capitol building, and later stood by laughing as others smashed up cameras and other media equipment.",
    "He was in Washington, D.C. on January 6, and though he claimed that he didnt go beyond police lines,? Mastriano was captured on video walking toward the Capitol moments after rioters dismantled the original police line.",
    "One of Mastrianos campaign staffers who blocked reporters from a Mastriano/Barnette campaign event over the weekend was on the Capitol grounds that day tooand theres video and photo evidence he got even closer.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Mastriano has pledged to reset? Pennsylvanias election rolls and force everyone in the state to have to re-register? to votea move that would sow utter chaos (and likely violate federal election law).",
    "Democrats are already highlighting his statehouse bill to ban abortion with no exceptions for cases of rape and incest, as well as his comments about cutting state education funding.",
    "The former president made a last-minute endorsement of Mastriano last weekend, picking a shoe-in winner once it was clear that Mastriano would be the nominee.",
    "His win sets up an existentially important November election against Attorney General Josh Shapiro, who was uncontested in the Democratic primary.",
    "But President Biden is so unpopular right now that Democrats could lose just about any swing-state contest, no matter their opponents flaws.",
    "If he wins in November, hell have the power to appoint Pennsylvanias secretary of state and make major changes to the states voting laws.",
    "Mastriano also has close links with QAnon, and his win makes him the most prominent QAnon-aligned candidate to win a GOP primary so far.",
    "Mastriano was barely known outside the state capitol before 2020and regarded as a back-bench kook by his colleagues in both parties.",
    "Democrats have made it clear, however, that they wanted Mastriano to win the primary, and see him as their easiest opponent.",
    "Now, hes one election away from being in charge of the countrys largest swing state during the next presidential election.",
    "Mastriano, a state senator, easily won his primary for governor on Tuesday night, with 44% of the primary vote.",
    "That could lead to an election crisis in the swing state whose results may well determine the next president.",
    "His campaign spent more than $800,000 on the spotdouble Mastrianos total TV ad spending in the primary.",
    "Doug Mastriano did everything he could to interfere with Pennsylvanias election system in 2020.",
    "Mastriano has based his entire campaign around pushing the big lie about the 2020 election.",
    "A last-minute push to stop Mastriano by rallying around Barletta fell flat on its face.",
    "Those efforts got him on Trumps radar and made him a hero on the far right.",
    "His next-closest rival, former Rep. Lou Barletta, received 20% of the vote.",
    "And if Mastriano pulls this race off, the 2024 elections could be at risk.",
    "Establishment Republicans arent thrilled about Mastrianos win, either.",
    "He later pushed for an audit of the states elections.",
    "Mastriano is unquestionably a problematic candidate."
  ]
}