{
  "id": 6637,
  "mediaId": 169,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Less Madison Cawthorn, more dumpy fascists in bad suits: Republicans embrace covert Big Liars",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/madison-cawthorn-0518221.jpg",
  "link": "https://www.salon.com/2022/05/18/less-madison-cawthorn-more-dumpy-fascists-in-suits-embrace-covert-big-liars/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.salon.com/writer/amanda_marcotte",
  "termIds": [
    821,
    2303,
    3102
  ],
  "sentences": [
    "RELATED: Trumpism in a fleece vest: GOP's new gambit scored a big win  but here's how to beat it\nThe main difference between Edwards and Cawthorn is Edwards is likely to be a more effective destroyer of democracy, precisely because there are fewer videos out there of him nakedly humping his cousin's head.",
    "And they understand that the task will be much easier if they run candidates who can pass as \"normal\" in the eyes of moderate voters, even though those candidates are just as radical underneath their bland exteriors as some of the more gleefully trollish options available to GOP voters.",
    "Cawthorn won in 2020 on a wave of pro-troll enthusiasm among Trump-drunk Republican voters, which also led to the election of headline-hoggers like Rep. Marjorie Taylor Greene of Georgia and Rep. Lauren Boebert of Colorado.",
    "By being a bunch of cookie-cutter white guys reciting the same talking points, these politicians normalize the Big Lie in such a way that both the press and moderate voters start to ignore how dangerous they actually are.",
    "Cawthorn quickly became a reliable producer of outrage bait, from his Hitler-winking social media posts to his unsubtle calls for political violence to the scandal that finally ended him, his cocaine-and-orgies comments.",
    "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, Doug Mastriano, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "When Cawthorn, one of the loudest supporters of Trump's attempted coup in 2020, encouraged Trump supporters to \"lightly threaten\" congressional members who didn't back the coup, Edwards denounced his rhetoric.",
    "Without wall-to-wall national coverage of their radical views, it will be easy for either man to convince large numbers of Pennsylvania moderates that he isn't the radical insurrectionist he, in fact, is.",
    "Glenn Youngkin in Virginia, who bamboozled moderate voters into thinking he wasn't so bad and then immediately became unpopular once he actually started to govern as the far-right radical that he is.",
    "They went for candidates that, while fully committed to the anti-democratic cause, are missing that je nais se quois to produce outrage bait that has so appealed to Republican voters in the past.",
    "They can be Mussolini on the inside, but as long as they look like a generic grandpa at the cookout, they will slide under the radar and, all too often, right into electoral victory.",
    "After years of Donald Trump-inflected voting for the biggest troll they can find, Republican voters largely did what a GOP campaign consultant would prefer they do this time around.",
    "If voters become aware of how radical Mastriano's politics are, they are very likely to reject him in favor of the Democratic nominee, Pennsylvania's Attorney General Josh Shapiro.",
    "It's a statement that sounds innocuous on its surface, but deeper analysis shows that, in all the ways that actually count, Edwards is just as much an insurrectionist at Cawthorn.",
    "The GOP establishment was terrified of Barnette  not because they disagreed with her anti-democracy views, but because her flat-out weirdness would draw attention to those views.",
    "The GOP establishment was terrified of Barnette  not because they disagreed with her anti-democracy views, but because her flat-out weirdness would draw attention to those views.",
    "GOP primary voters are getting serious about the long-term efforts to stack the halls of power with people who will steal the 2024 election from President Joe Biden for Trump.",
    "Again, in a sea of white men who all look basically the same saying the same dumb things about \"election integrity\" and \"voter fraud,\" Mastriano quite likely won't stick out.",
    "But while he came out against violence after violence didn't work, Edwards continued to echo the same Big Lie talking points about \"the integrity of our elections system.\"",
    "It doesn't help matters that nearly all Republicans these days use the same coded language about \"election integrity\" and \"voter fraud\" to signal support for the Big Lie.",
    "Turns out that the best way for a fascist to hide is in plain sight, by being so boring that voters don't care enough to learn how terrifying your politics actually are.",
    "Because he's another dumpy white guy with rolled-up sleeves, Mastriano just isn't going to attract the same kind of clickbait attention that someone like Cawthorn gets.",
    "Republican primaries in Pennsylvania and North Carolina may have been a big win for the Big Lie, but they were devastating for headline writers at political websites.",
    "By saying he doesn't \"need to be threatened,\" Edwards is clearly implying he would have happily voted to overturn the 2020 election without being pressured.",
    "His blandness is the best possible disguise, as it allows him to convey pro-fascist sentiments to his followers while being ignored by the national press.",
    "But Barnette, who was a last-minute surge candidate, has an unhinged affect and a tendency to talk about how forced childbirth after rape is a good thing.",
    "It's just that they have now come to realize that the key to pulling it off is running candidates who are a little bit better at hiding how evil they are.",
    "Two of the flashiest trolls on the ballot, Kathy Barnette of Pennsylvania and Rep. Madison Cawthorn of North Carolina, went down in flames Tuesday night.",
    "He also wisely blocks the press from many of his events, no doubt so he can unfurl the lurid conspiracy theory talk without getting quoted in headlines.",
    "At the last minute, the majority of GOP voters agreed, splitting their votes between the two other candidates, Mehmet Oz and Dave McCormick.",
    "All of the major GOP candidates are Big Lie supporters who Republican voters can feel confident will help Trump steal the 2024 election.",
    "And because he doesn't, far too many voters will go to the polls, unaware of how radical the guy they're voting for actually is.",
    "To be certain, Republican voters still want to complete the authoritarian destruction of democracy Trump set in motion in 2020.",
    "But they're slightly better at subterfuge, in no small part because they weren't literally photographed at the insurrection.",
    "But the same liberal-triggering talents that so please GOP base voters have the side effect of drawing national attention.",
    "The likely winner of this primary, state senator Chuck Edwards, made a name for himself by deriding Cawthorn's antics.",
    "The GOP primary for North Carolina's 11th congressional district is the perfect distillation of this phenomenon.",
    "Notably, he only released this anti-violence statement after the January 6 insurrection at the Capitol failed.",
    "McConnell's theory of politics is simple: The best Republican politician is the one no one pays attention to.",
    "So the McConnell strategy is to speak very little, avoid press coverage, and be as blank a slate as possible.",
    "The strategy is to pretend to be normal in public, and only reveal the sinister agenda after the election.",
    "\"As a legislator, I don't need to be threatened to do the job the voters hired me to do,\" Edwards tweeted.",
    "She was also photographed eagerly participating in the January 6 march that turned into an insurrection.",
    "But it also tends to backfire in general election races, at least in purple districts and states.",
    "In light of that, the best GOP candidate is the one that voters couldn't pick out of a line-up.",
    "It's why McConnell is angry with those in the GOP caucus who put their policy views in writing.",
    "If voters actually listen to Republicans talk about what they believe, most will be turned off.",
    "But the next best thing is a truckload of white guys in khaki pants and rolled-up shirtsleeves.",
    "Senate Minority Leader Mitch McConnell is a deeply evil and cynical man, but he's also smart.",
    "McCormick in particular likes to imply that Black voters are inherently illegitimate.",
    "He even has an aide who was photographed participating in the January 6 riot.",
    "Mastriano paid for shuttle buses to take people to the Capitol on January 6.",
    "A similar situation is playing out in the Pennsylvania primary for governor.",
    "In this case, what is bad for clickbait headlines is also bad for democracy.",
    "If Republican strategists could nominate literal blank slates, they would.",
    "There's no doubt that Republican primary voters love themselves a troll.",
    "All that stuff triggers the liberals, drawing GOP base enthusiasm.",
    "Cheap insults, conspiracy theories, winking at violence?",
    "Subscribe to her newsletter Standing Room Only.",
    "Subscribe to her newsletter Standing Room Only.",
    "Want more Amanda Marcotte on politics?",
    "Both these men are stalwart Big Liars.",
    "Want more Amanda Marcotte on politics?",
    "Unfortunately, that's a big \"if.\"",
    "Their best disguise?",
    "Being very boring.",
    "It worked for Gov."
  ]
}