{
  "id": 6639,
  "mediaId": 195,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Kinzinger says Cawthorn loss good for the country",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/KinzingerCawthorn_Getty.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/house/3492561-kinzinger-says-cawthorn-loss-good-for-the-country/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarakshi Rai",
  "authorUrl": "https://thehill.com/author/sarakshi-rai/",
  "termIds": [
    2303,
    3102
  ],
  "sentences": [
    "He added that Washington, D.C., has become kind of a growing ground for people that are just more interested in fame than governing? and said that those people are more interested in becoming famous than in actually doing the very serious work at a time when weve got a lot of challenges here at home and overseas.?\nSo its a good thing he lost.?\nCawthorn, 26, is in his first term in Congress and is the youngest member of the House.",
    "In the CNN interview, Kinzinger added that his organization, Country First, was on the ground in North Carolina and said they were not spending money boosting specific candidates but instead just getting people to turn out to the primary.?\nKingzinger acknowledged the Tuesday primaries werent all good news for his side of the GOP.",
    "Asked about Mastrianos win, Kinzinger said Cawthorns defeat does not mean were winning this battle for the soul of the Republican Party, its not true.?\nAccording to Kinzinger, this race and others show that there is a competition? to see who can be more crazy and said it is a litmus test? of who can be a conservative.",
    "Rep. Adam Kinzinger (R-Ill.) slammed Rep. Madison Cawthorn (R-N.C.) on Wednesday and said in an interview that his primary loss is good for the country.?\nIn an interview with CNNs John Berman in which he was asked what he thought about Cawthorns loss, Kinzinger said: Well, its good.",
    "Kinzinger is on the outs with the House Republican Conference, as he is one of two Republicans on the House select committee investigating the Capitol riot and frequently criticizes former President Trump.",
    "It doesnt mean you want to deny elections.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Pennsylvania state Sen. Doug Mastriano won the GOP gubernatorial primary after pushing unsubstantiated claims of widespread voter fraud in the 2020 election.",
    "He has received outsized attention as a rank-and-file member because of a series of controversial comments and other episodes.",
    "Those comments annoyed other rank-and-file GOP lawmakers, who had to answer for the remarks in their home districts.",
    "He added that, to him, being a conservative means you want to spend a little less money and empower people.",
    "I mean its good for the country, its good for the party, its good for the 11th District of North Carolina.",
    "At one point, he claimed hed been invited to orgies by fellow lawmakers and seen some consume cocaine.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He is not running for reelection."
  ]
}