{
  "id": 6642,
  "mediaId": 136,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Five Key Takeaways From Primary Election Results",
  "image": "",
  "link": "https://www.newsweek.com/five-key-takeaways-primary-election-results-2022-1707724",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    821,
    2303,
    3102
  ],
  "sentences": [
    "Trump's Support Not Enough to Save Cawthorn\nRepublican Representative Madison Cawthorn conceded defeat in the GOP primary for North Carolina's 11th congressional district after losing to state Senator Chuck Edwards in what may be the biggest upset of the primary season so far.",
    "While Kathy Barnette looks unlikely to prevail in the GOP Senate primary in Pennsylvania, she currently has almost a quarter of the vote in spite of her previous controversial comments including a tweet falsely claiming former President Barack Obama was a Muslim.",
    "McLeod-Skinner was ahead of Schrader by 22.6 percent with 54 percent of results reported as of early Wednesday morning but the final results may not be known for several days due to mail-in ballots and a printing error in some ballots in Clackamas County.",
    "Concerns that Barnette could emerge the surprise victor appear to have been overstated, but the so-called \"ultra MAGA\" candidate has won an impressive share of the vote despite controversy over her previous remarks attacking Islam and LGBT people.",
    "Pennsylvania Emerges as Key Battle Ground\nCelebrity heart surgeon Dr. Mehmet Oz was also endorsed by Trump but his race against businessman and former George W. Bush Treasury official David McCormick looks like it will come down to the wire.",
    "However, there is also the real possibility that a Democratic congressman who was endorsed by President Joe Biden could end up losing his primary to a progressive challenger and that a Trump-backed Senate candidate could be defeated.",
    "The junior senator for North Carolina had strongly criticized Cawthorn over remarks about cocaine and orgies in Washington, D.C.\nEdwards had won 33.4 percent of the vote to Cawthorn's 31.9 percent with 95 percent of results reported.",
    "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator Doug Mastriano who will now be the party's nominee for governor.",
    "Progressive Democrats had a good night on Tuesday as five states held primary contests for the U.S. Senate and House of Representatives, while a key Republican Senate primary in Pennsylvania remains extremely close.",
    "In the North Carolina Republican Senate primary, Trump-backed Representative Ted Budd is projected to win, while another Trump-endorsed candidate, Bo Hines, will win the primary for North Carolina's 13th district.",
    "An upset could be brewing in Oregon's newly redrawn 5th congressional district, where seven-term Representative Kurt Schrader is facing a stiff challenge from progressive attorney Jamie McLeod-Skinner.",
    "President Joe Biden was quick to offer his support to Fetterman once it became clear he would win the primary and the president attacked both Oz and McCormick as \"too craven\" to represent the state.",
    "In the Democratic Senate primary, Lieutenant Governor John Fetterman was on track for a clear victory, winning 59 percent of the vote with 91 percent of results reported on early Wednesday morning.",
    "The 26-year-old, who is currently the youngest member of Congress, had been the focus of a series of salacious news stories in recent weeks, while Edwards enjoyed support from Senator Thom Tillis.",
    "Fetterman and his eventual Republican opponent will compete to replace Republican Senator Pat Toomey, who is retiring, and Pennsylvania could be key to controlling the Senate.",
    "Charles Booker, a progressive, is projected to win the Democratic Senate primary in Kentucky and face off against Senator Rand Paul, who is on track to win the GOP primary.",
    "He has said he left before the riot and has been subpoenaed by the House Select Committee investigating January 6 over his attempt to send alternative electors to Congress.",
    "Potential Gains for Progressives\nProgressive Democrats also had a good night on Tuesday as Fetterman triumphed over his moderate opponent, Representative Conor Lamb.",
    "However, Cawthorn's defeat could be an outlier because of the unusual circumstances of the race, including the leaked photos and Tillis' intervention against him.",
    "Oz had won 31.3 percent of the vote, McCormick had 31.1 percent and longshot candidate Kathy Barnette had won 24.8 percent with 95 percent of results reported.",
    "State Representative Summer Lee, who was endorsed by Senator Bernie Sanders (I-Vermont), is in a close race with Steve Irwin in Pennsylvania's 12th district.",
    "Budd, who will run for the Senate in North Carolina, voted in support of an objection to Pennsylvania's Electoral College votes on January 6, 2021.",
    "Both Mastriano and Representative Ted Budd have supported the so-called \"Big Lie\" that the 2020 presidential election was stolen from Trump.",
    "Cawthorn's re-election campaign was likely not helped by the release of potentially embarrassing photos and video of the young congressman.",
    "Trump's Endorsement Still Powerful\nTrump's endorsement still appears to have some power, despite Cawthorn's defeat in North Carolina.",
    "He is projected to win, despite some establishment Republicans believing he is too far right to win the governor's race in November.",
    "Candidates endorsed by former President Donald Trump had a mixed night and the final outcomes of some key races are not yet known.",
    "Mastriano was present outside the U.S. Capitol building on January 6, 2021 before it was stormed by a pro-Trump mob.",
    "A strong Trump supporter, Cawthorn received the former president's endorsement despite recent controversies.",
    "His defeat may be seen as a blow to Trump on a night where other candidates he endorsed performed well.",
    "Schrader is one of just two Democratic candidates Biden has endorsed so far in the 2022 election cycle.",
    "Trump endorsed Pennsylvania state Senator Doug Mastriano in the GOP gubernatorial primary.",
    "Irwin is supported by outgoing Representative Matt Doyle, who is retiring.",
    "It remains to be seen if Oz will prevail in the Pennsylvania primary.",
    "Here are five key takeaways from Tuesday's elections.",
    "1.",
    "2.",
    "3.",
    "4.",
    "5."
  ]
}