{
  "id": 6644,
  "mediaId": 558,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "How Pa. GOP gov pick could turn election lies into action",
  "image": "https://s.yimg.com/ny/api/res/1.2/bzA22azk_vUClu1GZFHvnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Q9iYDdwsubQ4vZHE.xCjWg--~B/aD0yODg1O3c9NDMyODthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/d39c8eb754568b2ca48b7bc217b00678",
  "link": "https://nz.finance.yahoo.com/news/pa-gop-gov-pick-could-195244126.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEVE PEOPLES",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "While he would have to contend with a Legislature that may not go along with his plans, he would still have significant authority over elections because Pennsylvania is one of the few states where governors have the power to appoint the secretary of state.",
    "With his far-right brand of politics, Mastriano's victory actually has been seen by some as a gift for Democrats, leaving Republicans with a candidate so out of step with Pennsylvania that he would struggle in a general election campaign.",
    "Election 2022 Pennsylvania Governor\nState Sen. Doug Mastriano, R-Franklin, a Republican candidate for Governor of Pennsylvania, speaks at a primary night election gathering in Chambersburg, Pa., Tuesday, May 17, 2022.",
    "(AP Photo/Carolyn Kaster)\nHARRISBURG, Pa. (AP)  Doug Mastriano is not the only candidate who won a Republican primary on Tuesday after embracing Donald Trump's lie that the 2020 election was stolen.",
    "In one of the most politically competitive states in the U.S., the newly minted Republican nominee for governor was deeply involved in the former president's efforts to overturn the last election.",
    "As Pennsylvania's chief elections official, that official oversees how elections are managed, gives counties guidance on how to conduct elections and, crucially, certifies the final results.",
    "But no GOP contender did more to subvert that presidential election -- and no one may be better positioned to subvert the next one -- than Mastriano if hes elected Pennsylvania's governor.",
    "If he's elected in November, Mastriano has pledged to end no-excuse vote by mail, a process that hundreds of thousands used in this week's primary.",
    "But Pennsylvania was one of the critical states that Trump won in 2016, and he lost it by just over one percentage point in 2020.",
    "People should be terrified,? said Jamie Perrapato, executive director of the pro-Democrat group Turn PA Blue.",
    "With that in mind, Democrats made an urgent case for their supporters to take Mastriano seriously.",
    "We have literally opened the door to a conspiracy theorist who was at the insurrection.?",
    "He also wants to force millions of registered voters to register again.",
    "He was at the U.S. Capitol during the Jan. 6 insurrection."
  ]
}