{
  "id": 6651,
  "mediaId": 169,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "2022 GOP primaries prove that MAGA is now bigger than Donald Trump",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/mastriano-trump-capitol-riot-0518221.jpg",
  "link": "https://www.salon.com/2022/05/18/2022-primaries-prove-that-maga-is-now-bigger-than-donald/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Digby Parton",
  "authorUrl": "https://www.salon.com/writer/heather_digby_parton",
  "termIds": [
    2303,
    3102
  ],
  "sentences": [
    "RELATED: Cawthorn's loss highlights Trump's waning influence but election deniers win big in GOP primaries\nCongressman Madison Cawthorn, meanwhile, in North Carolina lost his race, after a brutal barrage of negative opposition from the GOP establishment in D.C. which decided that he'd crossed their red line when he publicly mentioned that he'd been invited to cocaine-fueled orgies by members of Congress he'd always looked up to.",
    "So, in the big marquee primary races in Pennsylvania, it appears that one undisputedly far right MAGA candidate won despite not being endorsed by Trump himself until the last minute and the other will be won by a hair by either the Trump endorsee or a man pushed hard by the GOP establishment.",
    "Kathy Barnette, the other super MAGA GOP candidate running for the open Senate seat, made a late surge but was unable to overcome her opponents, the Trump-endorsed TV celebrity Dr. Mehmet Oz and his arch-rival David McCormick, a wealthy hedge fund executive with establishment credentials.",
    "In fact, every Republican candidate has to ensure that he doesn't antagonize the base and even if he or she is trying hard to walk the line between the less doctrinaire Trump voters and the true believers in statewide races, some positions are non-negotiable.",
    "Mastriano is so MAGA that even Donald Trump was afraid to endorse him  until it became obvious that Mastriano was going to win so he jumped on the bandwagon last Friday in order to keep his followers from wondering where his loyalties lie.",
    "But just as the evangelical base happily made common cause with the libertine Trump in order to get their social conservative courts, the base will back others who are clearly inauthentic as long as they follow the party line.",
    "If there is an important story coming out of the primaries so far it's that there are two kinds of candidates in the Republican Party, those who are led around by the nose by the MAGA base and those who are the MAGA base.",
    "Last week his chosen candidate for Nebraska governor (a fellow accused sexual abuser) lost badly, and last night Trump's choice for Idaho Governor (a far-right candidate in the Mastriano mold) also went down in flames.",
    "Hate groups proliferate as state GOP descends into MAGA paranoia\nFor instance, no GOP candidates are allowed to admit that the Big Lie is a big lie otherwise they risk alienating a huge portion of the GOP electorate.",
    "Take for instance what he said about the insurgent candidate Kathy Barnette in the days just before the election:\n\"Kathy Barnette will never be able to win the General Election against the Radical Left Democrats.",
    "She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Party  and I will be behind her all the way.\"",
    "Last night, Pennsylvania Republicans nominated a Big Lie proponent and January 6th \"Stop the Steal\" attendee named Doug Mastriano to run for governor of Pennsylvania in November.",
    "In fact, it seems pretty clear at this point that while they remain enthralled by Trump himself, MAGA is bigger than he is  and Pennsylvania's Mastriano is its poster boy.",
    "And if he wins this race, he will be able to choose his own secretary of state to administer elections in the important swing state of Pennsylvania.",
    "He did seem to push JD Vance to the top in last week's Ohio Senate primary, but as you can see, it didn't seem to mean that much in Pennsylvania.",
    "Trump had endorsed Cawthorn and even stepped in belatedly on the day before the election to appeal to voters to give Cawthorn a second chance.",
    "They are saying that if elected Mastriano will ensure that Pennsylvania's 20 electoral votes will go to Donald Trump  or whomever they choose.",
    "Doug Mastriano is the perfect reflection of today's GOP and you can bet they are thrilled that he has won such an important election.",
    "He's a hardcore evangelical Christian Nationalist, retired Army Colonel, far-right insurrectionist and QAnon conspiracy nut.",
    "Candidates like JD Vance and Dr. Oz are willing to follow the base and do a fairly good job of sounding like they mean it.",
    "He, of course, will take credit for the wins and ignore the losses as he always does and his followers won't even notice.",
    "In the end it really doesn't matter what they believe in their heart of hearts, the end result is the same.",
    "The MAGA genie is out of the bottle and it's unclear if the American people will be able to put it back in.",
    "If David McCormick ekes out a win you can bet he'll have to do some fancy footwork to keep the base happy.",
    "Naturally, the big question among all the political analysts is whether or not Trump still has any clout.",
    "That race remains too close to call this morning and could be decided by late counted mail-in ballots.",
    "You can see that Trump obviously did not want to offend the MAGA voters who were flocking to her.",
    "He's always been tuned into the right and far right's zeitgeist and he follows it closely.",
    "It's now a MAGA litmus test  a sign of respect, a sort of loyalty oath to the movement.",
    "Soothing the wound, however, was the big win by Ted Budd for Senate in North Carolina.",
    "If you aren't ready to deny reality in service to the cause, you simply aren't MAGA.",
    "That mealy-mouthed comment was worthy of Rep. Kevin McCarthy at his most unctuous.",
    "You can see that Trump obviously did not want to offend the MAGA voters ...",
    "We don't have to guess what will happen:\nThere is nothing curious about it.",
    "Trump had endorsed Budd very early against the wishes of the state GOP.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "But if you want a candidate who is the real deal, it's Doug Mastriano.",
    "The irony is so thick it would take a chainsaw to cut through it.",
    "So, the Trump endorsement clout game has been a mixed bag.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Ironically, Trump himself is one of the former.",
    "So that's another one in the loss column.",
    "But it's no longer really about him.",
    "They aren't even trying to hide it.",
    "RELATED: Is Pennsylvania losing it?",
    "Trump started that, of course.",
    "He's more Trump than Trump.",
    "He is the MAGA base.",
    "He's got it all.",
    "They aren't his.",
    "He is theirs.",
    "Funny that."
  ]
}