{
  "id": 6665,
  "mediaId": 195,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Five takeaways from the Pennsylvania, North Carolina primaries",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/fettermanjohn_032322ap-keith-srakocic_fetterman.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3492387-five-takeaways-from-the-pennsylvania-north-carolina-primaries/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    821,
    2303,
    3102
  ],
  "sentences": [
    "And while the former president had hoped that his support would push celebrity physician Mehmet Oz across the finish line in Pennsylvanias GOP Senate primary, the race appears increasingly likely to head to a recount, with former hedge fund manager David McCormick holding his own.",
    "Cawthorn faced a wave of rebukes in recent months over comments he made suggesting fellow Republican lawmakers invited him to cocaine-fueled orgies; insider trading allegations; driving with an expired license; trying twice to bring a loaded gun through airport security; and more.",
    "Nida Allam, who carried the endorsements of Sanders and Ocasio-Cortez, lost a Democratic House primary in North Carolinas 4th District, while former state Sen. Erica Smith lost a primary for another North Carolina House seat to state Sen. Don Davis, handing progressives a defeat.",
    "Lee has the backing of top progressives like Sen. Bernie Sanders (I-Vt.) and has been billed as a potential future member of the Squad,? the group of left-wing lawmakers that includes Reps. Alexandria Ocasio-Cortez (D-N.Y.), Ilhan Omar (D-Minn.), Ayanna Pressley (D-Mass.",
    "Similarly, in Oregons 5th District, moderate Rep. Kurt Schrader (D-Ore.) appears to be in real trouble in his bid against progressive challenger Jamie McLeod-Skinner, who has also racked up endorsements from top progressive groups and labor unions.",
    "Rep. Madison Cawthorn (R-N.C.), a staunch ally of the former president who received his endorsement last year, was denied a second term in Congress after losing to state Sen. Chuck Edwards in the GOP primary for North Carolinas 11th District.",
    "But the May 17 primaries in five states offered some valuable clues about where both parties and their voters stand less than six months out from the 2022 midterm elections that will decide control of both chambers of Congress.",
    "However, Fettermans campaign quickly informed voters that he was anticipated to make a full recovery, and his win in every single Pennsylvania county hands him the chance to run for retiring Sen. Pat Toomeys (R) seat.",
    "John Fetterman had a victorious night on Tuesday, clinching the Democratic nomination in Pennsylvanias Senate race and capping off a campaign that saw him leading the primary field for nearly the entire race.",
    "Fetterman fended off bids from Rep. Conor Lamb and state Rep. Malcolm Kenyatta, an unsurprising result given the lieutenant governors consistent, double-digit polling lead in the primarys closing weeks.",
    "But even that nomination came after Republican officials sought to head off his nomination over concerns his intense focus on unsubstantiated voter fraud claims from 2020 would hinder his electability.",
    "In the North Carolina GOP Senate primary, for instance, Budd benefited heavily from the support of the conservative Club for Growth, which spent more than $11 million to boost him ahead of the primary.",
    "McCormick, who had vied for Trumps support before Oz won the endorsement, still ran ads in the primarys final stretch touting himself as an America First? conservative and tying himself to Trump.",
    "And in the states 13th congressional district, Trumps endorsement helped propel former college football player Bo Hines to victory, despite the candidates questionable ties to the district.",
    "However, others suggest that his hulking six-foot-nine-inch frame, goatee and forearm tattoos could draw support from the kinds of blue-collar voters who have deserted Democrats in droves.",
    "Meanwhile, trailing about 6 points behind, is Barnette, a conservative commentator and firebrand who likely would have caused headaches for leadership if she made it to the upper chamber.",
    "Fetterman has been pegged as a progressive, in part due to his support for Sen. Bernie Sanderss (I-Vt.) presidential bids and policies like a $15 minimum wage and marijuana legalization.",
    "His influence was clearly seen in his endorsed candidates, particularly Mastriano, who has ardently taken up the former presidents rallying cry that the 2020 race was stolen? from him.",
    "And in Idaho, Little still voiced support for Trumps policies and emphasized during his campaign the positive working relationship the two had during the previous administration.",
    "Progressives have reason to be happy\nFettermans victory in the Pennsylvania Democratic Senate primary may have been the highest-profile win for the partys left flank on Tuesday.",
    "The GOP establishment bounces back\nIn the midst of the fierce civil war between the GOPs traditional and hardline flanks, Tuesday marked a key victory for the establishment.",
    "In the Democratic primary to represent Pennsylvanias new 12th District, state Rep. Summer Lee is leading attorney Steve Irwin and appears on track to notch a win.",
    "And in Idaho, Little, a staunch conservative with a record of cutting taxes and restricting abortion access, fended off a challenge from his deputy, McGeachin.",
    "And Cawthorn faced a series of damaging revelations and missteps ahead of his primary that may have simply been too much for Trumps endorsement to overcome.",
    "In the end, Tuesdays primaries showed that even when Trumps chosen candidate falls short, the victor is still taking pages out of the MAGA playbook.",
    "But progressives also saw a number of bright spots in down-ballot races, giving them reason for optimism after a series of disappointing defeats.",
    "In Pennsylvania, Oz maintained the narrowest of leads in the GOP Senate primary, with McCormick right on his tail, outpacing many late polls.",
    "Trumpism remains potent force\nRegardless of Trumps record Tuesday evening, his broader impact on the party was still on display.",
    "Still, the Democratic Partys left flank has some wins to celebrate, especially after a long streak of lackluster performances.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The latter had launched her primary challenge to Little after she said he should have banned mask and vaccine mandates.",
    "Just days before Election Day, Fetterman also suffered a stroke, throwing an 11th-hour curveball into the primary.",
    "His preferred candidate in North Carolinas GOP Senate primary, Rep. Ted Budd (R-N.C.), easily defeated former Gov.",
    "Key nominating contests in Pennsylvania and Oregon headed into Wednesday morning without any clear resolution.",
    "Still, the nomination comes after months of speculation over Fettermans electability in a general election.",
    "GOP leaders mobilized against Cawthorn, with Sen. Thom Tillis (R) making a stunning endorsement of Edwards.",
    "All thats to say that Trumps endorsement may not always be the ticket to victory that he wants it to be.",
    "And in North Carolina, Cawthorns loss showed that there are limits to what voters will tolerate.",
    "Some Democrats have voiced concern that that reputation could turn off swing voters in November.",
    "Cawthorn faced numerous controversies that made him a pariah even among some in his own party.",
    "Meanwhile, in Idaho, Trumps endorsed candidate for the Republican gubernatorial nod, Lt. Gov.",
    "Trumps endorsement power remains in question\nTuesdays primaries were a mixed bag for Trump.",
    "Little never imposed any mandates but allowed localities to make their own decisions.",
    "State Sen. Doug Mastriano did win the GOP nod in Pennsylvanias gubernatorial race.",
    "Pat McCrory and former Rep. Mark Walker (R-N.C.) to clinch the partys nomination.",
    "But even candidates who missed out on Trumps imprimatur ran on his agenda.",
    "The night wasnt without any successes for GOP firebrands, however.",
    "To be sure, progressives suffered some disappointments, as well.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Janice McGeachin, was soundly defeated by incumbent Gov.",
    "But thats about where the good news stopped for Trump.",
    "), Rashida Tlaib (D-Mich.), Cori Bush (D-Mo.)",
    "Of course, there were other factors at work.",
    "Here are five takeaways from Tuesdays races.",
    "Fetterman triumphs\nPennsylvania Lt. Gov.",
    "and Jamaal Bowman (D-N.Y.).",
    "Brad Little."
  ]
}