{
  "id": 6668,
  "mediaId": 65,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Conway: Pennsylvania primary GOP bids embraced Trump while Democrats shunned Biden",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/86009451-033b-47e5-9014-9e165a1e115f/1b33814d-e3f5-4cea-b475-fe40c6289c7e/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/pennsylvania-primary-trump-biden-candidates-oz-mastriano-fetterman-shapiro-conway-hannity",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    906,
    1147,
    1282,
    1648,
    2087,
    2491,
    3102,
    428,
    571,
    2862
  ],
  "sentences": [
    "At the time of Biden's visit to Pittsburgh, State Attorney General Josh Shapiro  the unopposed Democratic gubernatorial candidate  wasn't present, but later tweeted he is \"looking forward to traveling with POTUS in his home state  as we fight to move PA forward.\"",
    "She recounted how the former Braddock mayor appeared in nearby Pittsburgh when the president visited to assess damage from the tragic bridge collapse earlier this year  but claimed he appeared less enthused about being in the commander-in-chief's presence.",
    "\"The other two still were touting their connections to President Trump, to the America-First Agenda, to their time with him That doesn't happen on the Democratic side,\" she said, referring to Barnette and McCormick.",
    "The Republicans running in the Pennsylvania primaries largely embraced Donald Trump, while on the Democratic side, the hopefuls appeared to shun President Biden, Kellyanne Conway told Fox News on Tuesday.",
    "Mastriano received Trump's endorsement and called his margin a \"mandate more massive than Dick Thornburgh's\" ahead of the general election, during remarks at his Chambersburg campaign headquarters.",
    "On the Senate side, Kathy Barnette, Dr. Mehmet Oz and David McCormick all hoped for Trump's endorsement, while the former president ultimately chose Oz, Conway noted on \"Hannity.\"",
    "With the GOP Senate primary too close to call as of press time, all three front-runners sought out Trump's endorsement or ran as a Trumpian Republican, Conway said on \"Hannity.\"",
    "Thornburgh won in 1978 during Biden-like economic turmoil under President Carter, and similarly without the PA-GOP endorsing a candidate in the primary, Mastriano said Tuesday.",
    "The same was true for many in the governor's race, where State Sen. Doug Mastriano of Gettysburg was projected the winner by the Associated Press.",
    "\"This is really reflection of what's going on with the two political parties and their heads right now,\" she said.",
    "Joe Biden went to the state, and he was nowhere to be found until the bridge collapsed,\" she said.",
    "John Fetterman, did not seem to embrace Biden the way the GOP candidates embraced Trump.",
    "He faced pro-Trump ex-Rep. Lou Barletta and U.S. Attorney William McSwain among others.",
    "Conway pointed out that the eventual Democratic Senate primary winner, Lt. Gov.",
    "They don't want Joe Biden and Kamala Harris campaigning with them.",
    "And it tells you the tale of the two parties right now.\"",
    "\"John Fetterman doesn't want Joe Biden [campaigning].",
    "\"[Fetterman] showed up in his shorts and sweatshirt."
  ]
}