{
  "id": 6669,
  "mediaId": 21,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Madison Cawthorn's loss in his North Carolina primary race undermines the myth surrounding the power of a Trump endorsement",
  "image": "https://i.insider.com/62827770e7446d0018ccabd7?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/madison-cawthorn-smashes-myth-of-power-of-a-trump-endorsement-2022-5",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.businessinsider.com/author/cheryl-teh",
  "termIds": [
    821,
    1896,
    2303,
    3102
  ],
  "sentences": [
    "However, Trump's backing did little to push Cawthorn over the line to beat Edwards, a candidate bolstered by a Republican-linked super PAC and endorsed by a senator from Cawthorn's home state, Thom Tillis.",
    "Freshman Rep. Madison Cawthorn's loss in North Carolina to his primary challenger, Chuck Edwards, has busted the myth surrounding the power of former President Donald Trump's political endorsements.",
    "Trump threw the embattled congressman a lifeline ahead of his Tuesday primary, posting on Truth Social  Trump's social media platform  an appeal for voters to \"give Madison a second chance.\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Tom Williams/CQ-Roll Call via Getty Images and Jamie Squire/Getty Images\nMadison Cawthorn has busted Donald Trump's claim of having an \"unparalleled\" endorsement record.",
    "JD Vance won his primary for the Ohio Senate on May 4, while Doug Mastriano, a clear front-runner backed by Trump, won his race in the Pennsylvania governor primary.",
    "Another Trump-endorsed political candidate, Charles Herbster, lost his gubernatorial race in Nebraska last week amid allegations of sexual assault from eight women.",
    "The following month, he was accused by a former staffer of being a \"habitual liar,\" and received a second citation for bringing a loaded gun into an airport.",
    "Cawthorn's loss comes after a slew of scandals: In March, he angered senior GOP lawmakers by making claims about orgies and cocaine use by lawmakers in DC.",
    "Meanwhile, other Trump-backed figures, including Georgia gubernatorial candidate David Perdue, have struggled to keep up in their respective races.",
    "Mastriano is best known for being a 2020 election denier and participating in the plot to overturn then-President Donald Trump's loss in the state.",
    "I'm almost unblemished,\" Trump said during an interview with David Brody on the Christian Broadcasting Network's show \"The 700 Club.\"",
    "The lawmaker may have also violated the STOCK Act by failing to disclose his purchases of the \"Let's Go Brandon\" cryptocurrency coin.",
    "Snaps of Cawthorn dressed in lingerie while on a cruise  which he dismissed as \"goofy vacation photos\"  were also leaked in April.",
    "Cawthorn's ouster comes weeks after Trump boldly claimed that his backing of Republican candidates was vital for their success.",
    "In his post, Trump wrote that Cawthorn had recently \"made some foolish mistakes, which I don't believe he'll make again.\"",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "He was also the subject of two leaked videos posted online by a PAC that campaigned against his re-election.",
    "Trump has made 183 endorsements since leaving office, per Ballotpedia, many of which have yet to play out.",
    "Trump said on the show that Republicans should be afraid of him if their views didn't line up with his.",
    "Cawthorn lost his primary race to Chuck Edwards, debunking the myth of the power of Trump's backing.",
    "A Trump-backed GOP win is certainly not guaranteed if this week's results are anything to go by.",
    "Cawthorn is a Trump ally whom the former president said deserved a \"second chance\" in Congress.",
    "Republican Rep. Madison Cawthorn of North Carolina and former President Donald Trump.",
    "\"Because if I endorsed them, they win, and if I don't endorse them, they don't win.",
    "For his part, Cawthorn has conceded the race to Edwards, per the Associated Press.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "However, Trump-endorsed candidates have also seen some electoral victories.",
    "Cawthorn dismissed both videos as part of a \"drip campaign\" to oust him.",
    "\"My record is unparalleled, my endorsements, it's totally unparalleled.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "I mean, that's almost 100% of the case,\" the former President said.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Nobody's ever had a record like this.",
    "Loading Something is loading."
  ]
}