{
  "id": 6677,
  "mediaId": 195,
  "date": "d2022-05-18T01:53",
  "headline": "Mastriano wins Pennsylvania GOP governor primary despite party concerns",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/02b4c43ecc154065a659c91e637b2f80.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/news/campaign/3491906-mastriano-wins-pennsylvania-gop-governor-primary-despite-party-concerns/",
  "sentiment": "-0.73",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    1282,
    1625,
    3102,
    146,
    425,
    428,
    2992,
    2862,
    5003
  ],
  "sentences": [
    "Why Im doing this is because I dont want to see my party pull a Thelma and Louise and go over the cliff when we have an opportunity in front of us to really put this commonwealth back on a track,? Sam DeMarco, the chairman of the Allegheny County GOP who was involved in the talks, told The Hill last week.",
    "Mastrianos nomination is particularly frustrating for Republicans given the positive environment the GOP is anticipated to enjoy this year and the fact that the party already controls both chambers of the state legislature, meaning a win in the gubernatorial race for outgoing Gov.",
    "Instead of focusing on kitchen-table issues like strengthening the economy and investing in education, Doug Mastriano is an extremist running on a dangerous agenda that would devastate Pennsylvania families,? said Democratic Governors Association Executive Director Noam Lee.",
    "Compounding those worries is the fact that Mastriano will run against state Attorney General Josh Shapiro, who ran without any opposition in the Democratic primary and stocked up a fearsome campaign bank account as his GOP rivals bickered.",
    "The RGA remains committed to engaging in competitive gubernatorial contests where our support can have an impact in defending our incumbents and expanding our majority this year,? said RGA Executive Director Dave Rexrode.",
    "However, conversations among the other major campaigns and some local and state GOP officials failed to push out any of Mastrianos top rivals, leaving him a path to victory with just a plurality of the vote.",
    "Mastriano defeated a crowded field of other gubernatorial candidates, including former Rep. Lou Barletta, his main primary rival, and had a healthy polling lead during the weeks leading into the primary.",
    "The country, and Pennsylvania, is worse off under Democratic leadership and Josh Shapiro, who will continue the same policies that have led to record inflation and increased violent crime.",
    "Pennsylvania state Sen. Doug Mastriano was projected to win the states GOP gubernatorial primary Tuesday despite a flagging effort from some Republicans to block him from the nomination.",
    "Mastriano is a staunch hard-liner in the GOP and has centered much of his campaign around the unsubstantiated claims of widespread voter fraud in 2020.",
    "Still, Republicans had scrambled to try to head off a Mastriano nomination and waged a bungling effort to coalesce around an alternative candidate.",
    "The state senator scored a surprise endorsement from former President Trump over the weekend, helping inject a late jolt into Mastrianos bid.",
    "The Republican Governors Association (RGA) expressed determination to flip Wolfs seat  but in a statement made no mention of Mastriano.",
    "Hes also supported outlawing abortion without any exceptions and rolling back privacy protections for people who contract COVID-19.",
    "Mastrianos win also hands Trump a win, though Mastriano held a consistent lead before winning the former presidents imprimatur.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Tom Wolfs (D) open seat would hand them unified control in Harrisburg.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Associated Press called the race at 9:51 p.m.",
    "ET."
  ]
}