{
  "id": 6683,
  "mediaId": 178,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Midterm updates | Idaho Gov. Little defeats Trump-backed foe",
  "image": "https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1652819855",
  "link": "https://www.startribune.com/midterm-updates-idaho-gov-little-defeats-trump-backed-foe/600174083/",
  "sentiment": "0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press Associated Press",
  "authorUrl": "",
  "termIds": [
    821,
    1000,
    1106,
    1147,
    1770,
    1903,
    2303,
    3102,
    5393,
    571,
    2706,
    2834,
    2850
  ],
  "sentences": [
    "HERE'S WHAT ELSE YOU SHOULD KNOW:\n Election 2022: Key races unfold in Pennsylvania, North Carolina\n Mastriano, Fetterman win in Pennsylvania races\n Rep. Madison Cawthorn concedes in North Carolina primary\n Oregon Democrat at risk as 5 states hold US House primaries\n Idaho governor faces Trump-backed challenger in GOP primary\nFollow all AP stories on the midterm elections at https://apnews.com/hub/2022-midterm-elections.",
    "Mastriano, a state senator and retired U.S. Army colonel, built a devoted online following by leading opposition to state-ordered shutdowns during the pandemic and taking a prominent role in the unsuccessful effort to overturn Trump's 2020 reelection defeat.",
    "___\nHARRISBURG, Pa.  Doug Mastriano has won the Republican nomination for Pennsylvania governor, overcoming an eleventh-hour push by the state's GOP political establishment to consolidate support around an alternative in the crowded primary.",
    "But political experts say Republicans have an opening in November amid widespread discontent in the state and a possible split in votes among the majority party as unaffiliated candidate Betsy Johnson makes a gubernatorial run in the fall.",
    "Shapiro's advertising in recent weeks has included spots introducing him to voters, but he also has targeted state Sen. Doug Mastriano as the Republican gubernatorial candidate emerged from the large primary field as a front-runner.",
    "Foushee, a former local school board member before joining the General Assembly, benefited in the primary from super PACs  including one associated with the American Israel Public Affairs Committee  supporting her candidacy.",
    "___\nOTHER DEVELOPMENTS:\nHARRISBURG, Pa.  Heart surgeon-turned-TV celebrity Mehmet Oz and former hedge fund CEO David McCormick are in a too-early-to-call race in Pennsylvania for the Republican nomination for U.S. Senate.",
    "Shapiro, 48, from the Philadelphia suburb of Abington, spent the primary campaign season raising money and working to boost his pick for lieutenant governor ahead of what is expected to be a grueling fall campaign.",
    "Mastriano, who was endorsed by former President Donald Trump and has promoted his lies about the 2020 election, will face Democratic state Attorney General Josh Shapiro in the November general election.",
    "___\nSALEM, Ore.  Former Oregon state House Speaker Tina Kotek has won the state's Democratic gubernatorial primary, beating state Treasurer Tobias Read in a victory for the party's progressive wing.",
    "He overcame a number of better-funded rivals with stronger establishment connections, including former U.S. Rep. Lou Barletta, former U.S. Attorney Bill McSwain, businessman Dave White and others.",
    "Oz has been helped by an endorsement from former President Donald Trump, while a super PAC backing McCormick weighed in heavily, spending almost $20 million on the race, much of it to attack Oz.",
    "___\nRALEIGH, N.C.  State Sen. Valerie Foushee has won the Democratic primary for a central North Carolina U.S. House district held almost continually for 35 years by retiring Rep. David Price.",
    "He is a former state lawmaker and county commissioner whose record as attorney general includes the production of a 2018 report into child sexual abuse among the state's Catholic churches.",
    "McCrory was considered a moderate in the 14-candidate primary but is best known nationally for signing a \"bathroom bill\" targeting transgender people in 2016 that cost the state billions.",
    "A firebrand and vocal supporter of former President Donald Trump, he had made unforced political and personal errors that led top Republican leaders in North Carolina to turn against him.",
    "Oz, best known as the host of daytime TV's \"The Dr. Oz Show,\" has battled misgivings among conservative groups about his positions on guns, abortion and other core conservative issues.",
    "Instead, he connected with far-right GOP voters through appearances on conservative broadcasters and by a tireless ground campaign that has left the state dotted with his yard signs.",
    "Beach-Ferrara got in the race 14 months ago, criticizing at the time Cawthorn for his speech at the \"Stop the Steal\" rally just before the Jan. 6, 2021 riot at the U.S. Capitol.",
    "___\nRALEIGH, N.C.  LGBTQ activist and local elected official Jasmine Beach-Ferrara has won the Democratic nomination for a congressional seat in far western North Carolina.",
    "The Democrat hoped to capitalize on voter unrest in Oregon over the handling of the pandemic, the homeless crisis, a lack of affordable housing and increasing gun violence.",
    "The 4th District is anchored by liberal electorates in Durham and Orange counties, so the Democratic primary winner should have a strong advantage for the general election.",
    "Both men spent millions of their own money on the campaign and battled accusations of being carpetbaggers  Oz moved from New Jersey to run and McCormick from Connecticut.",
    "He will face the winner of a hotly contested Republican primary that includes Dr. Mehmet Oz, ex-hedge fund CEO David McCormick and conservative activist Kathy Barnette.",
    "___\nFRANKFORT, Ky.  Charles Booker has won the Democratic primary election for the U.S. Senate in his bid to stop a decadeslong winning streak by Kentucky Republicans.",
    "___\nHARRISBURG, Pa.  Pennsylvania Democrats have made their choice for governor official, handing the nomination to second-term state Attorney General Josh Shapiro.",
    "McGarvey, the top-ranking Democrat in the Kentucky Senate, held a big fundraising advantage and an endorsement from Yarmuth, who touted his progressive credentials.",
    "Former President Donald Trump put his endorsement record on the line in two key Republican primaries for open U.S. Senate seats in Pennsylvania and North Carolina.",
    "___\nFRANKFORT, Ky.  Kentucky state Sen. Morgan McGarvey has won the Democratic nomination for the U.S. House seat being vacated by Democratic Rep. John Yarmuth.",
    "Republicans are almost guaranteed of winning in the general election as Democrats haven't held the governor's office since 1995 or statewide office since 2007.",
    "Yarmuth, the influential chair of the House Budget Committee, announced last fall that he wouldn't run for another term in the seat he's held since 2007.",
    "___\nRALEIGH, N.C.  First-term U.S. Rep. Madison Cawthorn has conceded to North Carolina state Sen. Chuck Edwards in the Republican congressional primary.",
    "Budd's win is also a victory for former President Donald Trump, who elevated the little-known congressman with a surprise endorsement nearly a year ago.",
    "In the campaign, he emphasized his military background and Christian beliefs and shunned traditional media while criticizing the party establishment.",
    "Fetterman, a former mayor of Braddock, is a progressive who has vowed to be a reliable vote for organized labor and liberal causes in Washington.",
    "Booker says such proposals would uplift people across the Bluegrass State, including poor urban neighborhoods and struggling Appalachian towns.",
    "In Idaho, the governor and lieutenant governor in Idaho run on separate tickets, so the two were not aligned when they won their races in 2018.",
    "Yarmuth played a role in passing high-profile national measures, including pandemic-relief legislation and the bipartisan infrastructure bill.",
    "A super PAC affiliated with the conservative Club for Growth spent millions on ads supporting Budd and attacking his chief rival, former Gov.",
    "The 52-year-old Fetterman defeated U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta on Tuesday to advance to November's general election.",
    "___\nRALEIGH, N.C.  Cheri Beasley has won the North Carolina Democratic primary in the race to succeed retiring Republican Sen. Richard Burr.",
    "Fetterman suffered a stroke Friday, injecting uncertainty into the Democratic primary race that for weeks had been shaping up as a runaway.",
    "Cawthorn faced negative publicity for speeding and gun violations, as well as for calling Ukrainian President Volodymyr Zelenskyy a \"thug.\"",
    "The Portland-based Kotek has collected endorsements from a third of Oregon lawmakers, nationally elected leaders, unions and organizations.",
    "Democrats see the seat being vacated by retiring Republican U.S. Sen. Pat Toomey as among their best pickup opportunities in the country.",
    "Foushee, from Chapel Hill, got the most votes in the eight-candidate race and enough to avoid a runoff in the 4th Congressional District.",
    "He now advances to the November general election, where he'll take on Democrat Cheri Beasley, a former state Supreme Court chief justice.",
    "Paul is a former presidential candidate who has gained a national voice in supporting limited government and a restrained foreign policy.",
    "Brad Little has survived a Republican primary challenge from his lieutenant governor, who was endorsed by former President Donald Trump.",
    "Both men emerged at their election-night watch parties to say they will have to wait for vote-counting Wednesday to determine a winner.",
    "___\nRALEIGH, N.C.  U.S. Rep. Ted Budd has won a crowded Republican primary for retiring GOP Sen. Richard Burr's seat in North Carolina.",
    "The race against Democratic nominee John Fetterman is expected to be among the nation's most competitive in the fall general election.",
    "And his initial decision to run for reelection elsewhere  only to switch back to the 11th District  didn't sit well with many locals.",
    "Beach-Ferrara is a minister, Buncombe County commissioner and executive director of the Campaign for Southern Equality in Asheville.",
    "The 73-year-old Wyden, who is seeking his fifth full term in the Senate, will be a heavy favorite in the liberal state in November.",
    "Mastriano, 58, represents a Senate district based in conservative Franklin County on Pennsylvania's southern border with Maryland.",
    "Booker is back with his \"hood to the holler\" campaign agenda after narrowly losing the Democratic Senate primary two years ago.",
    "Kotek's biggest challenger was Read, who was a state representative in Oregon for 10 years before being elected as treasurer.",
    "___\nFRANKFORT, Ky.  Republican U.S. Sen. Rand Paul of Kentucky has won his party's nomination in his quest for a third term.",
    "Some state GOP leaders have warned that Mastriano is too extreme to defeat Shapiro in the presidential battleground state.",
    "The libertarian-leaning Paul coasted to victory over five little-known challengers in the GOP Senate primary in Kentucky.",
    "Luke Ball, a spokesperson for Cawthorn's campaign, told The Associated Press late Tuesday that Cawthorn had conceded.",
    "A fast-food franchise owner, Edwards would advance to the November election against Democrat Jasmine Beach-Ferrara.",
    "Crapo was an attorney before he entered politics and previously served in the U.S. House and the Idaho Legislature.",
    "Louisville  the state's largest city  remains a Democratic stronghold while most of Kentucky is solidly Republican.",
    "McGarvey defeated Rep. Attica Scott on Tuesday in the primary for the 3rd Congressional District in Louisville.",
    "Beach-Ferrara got the most votes among six candidates in the 11th Congressional District Democratic primary.",
    "She was later appointed to the Supreme Court, won an election and was named chief justice by Democratic Gov.",
    "Mastriano's primary campaign spent almost nothing on television  ads attacking him were much more visible.",
    "Her rivals included former \"American Idol\" runner-up Clay Aiken and Durham County commissioner Nida Allam.",
    "John Fetterman has won the state's Democratic primary for U.S. Senate just days after suffering a stroke.",
    "McCormick has tried to overcome attacks by Trump that he is part of a corrosive Washington establishment.",
    "She has also promoted Trump's lies that the 2020 election was stolen from him through mass voter fraud.",
    "Paul promotes limited government while Booker supports sweeping health care and anti-poverty programs.",
    "___\nBOISE, Idaho  Republican incumbent Mike Crapo has won the GOP primary for U.S. Senate in Idaho.",
    "Beasley would be North Carolina's first Black senator if elected in the Republican-leaning state.",
    "Crapo is seeking a fifth term and will be heavily favored in November in the conservative state.",
    "Janice McGeachin had feuded frequently over coronavirus precautions and the role of government.",
    "Seven Republicans were seeking to defeat first-term GOP Rep. Madison Cawthorn in their primary.",
    "Kate Brown, a progressive Democrat, cannot run for the position again because of term limits.",
    "Little had a long string of endorsements, including from the Idaho Fraternal Order of Police.",
    "___\nPennsylvania, North Carolina, Kentucky, Idaho and Oregon held primary elections Tuesday.",
    "Voters in three states  Pennsylvania, Idaho and Oregon  picked their nominees for governor.",
    "Last year, McGeachin twice attempted a power grab when Little was out of state on business.",
    "Some counties have yet to tabulate mail-in ballots in the presidential battleground state.",
    "He said he is on his way to a \"full recovery\" but will remain in the hospital for a while.",
    "The Bluegrass State hasn't elected a Democrat to the Senate since Wendell Ford in 1992.",
    "McGarvey, an attorney, was also endorsed by several state lawmakers and labor unions.",
    "___\nSALEM, Ore.  Incumbent Ron Wyden has won Oregon's Democratic U.S. Senate primary.",
    "She'll face the Republican nominee in November in a district that leans to the right.",
    "The former state Supreme Court chief justice defeated 10 other Democrats on Tuesday.",
    "Beasley would be North Carolina's first Black U.S. senator if she wins in November.",
    "He promotes social programs such as Medicare for All and a basic universal income.",
    "Kentucky hasn't elected a Democrat to the U.S. Senate since Wendell Ford in 1992.",
    "Beasley became the Democratic front-runner as two key rivals bowed out last fall.",
    "In 2020, she lost a statewide election to remain chief justice by just 400 votes.",
    "Cawthorn vaulted to national prominence after winning the seat in 2020 at age 25.",
    "U.S. Sen. Thom Tillis said Cawthorn was an embarrassment to his constituents.",
    "Her group helped pushed for same-sex marriage in North Carolina a decade ago.",
    "Budd avoided a runoff by garnering more than 30% of the vote in the primary.",
    "He will challenge Republican U.S. Sen. Rand Paul in the November election.",
    "Price announced last October that he would not seek reelection this fall.",
    "Yarmuth is the only Kentucky Democrat to represent the state in Congress.",
    "The last time Democrats won a U.S. Senate election in Idaho was 1974.",
    "He is currently the ranking member of the Senate Finance Committee.",
    "She raised the most campaign money among all of the competitors.",
    "He was previously a longtime U.S. House member from Oregon.",
    "The fall campaign will feature sharply contrasting agendas.",
    "Booker defeated three opponents in the Democratic primary.",
    "Beasley was elected to the state Court of Appeals in 2008.",
    "Former U.S. Rep. Mark Walker also competed in the race.",
    "Shapiro was unopposed for the Democratic nomination.",
    "Wyden chairs the powerful Senate Finance Committee.",
    "The state hasn't had a GOP governor in 35 years.",
    "___\nHARRISBURG, Pa.  Pennsylvania Lt. Gov.",
    "The incumbent, Democratic Gov.",
    "The incumbent, Democratic Gov.",
    "The AP hasn't called the race.",
    "Pat McCrory, as too liberal.",
    "Tom Wolf, is term-limited.",
    "Tom Wolf, is term-limited.",
    "BOISE, Idaho  Idaho Gov.",
    "Little and Lt. Gov.",
    "Roy Cooper in 2019.",
    "Current Gov."
  ]
}