{
  "id": 6689,
  "mediaId": 178,
  "date": "d2022-05-18T00:00",
  "headline": "Election 2022: Budd, Beasley to face off for N.C. Senate",
  "image": "https://chorus.stimg.co/23522085/pjimage__52_.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/election-2022-budd-beasley-to-face-off-for-n-c-senate/600173876/",
  "sentiment": "-0.353",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WILL WEISSERT",
  "authorUrl": "",
  "termIds": [
    729,
    943,
    1147,
    1404,
    1622,
    3102,
    571,
    2862,
    2865,
    4916
  ],
  "sentences": [
    "Mastriano made Trump's lies about widespread electoral fraud costing him the presidency a centerpiece of his campaign  and has been subpoenaed by the House committee investigating the Capitol riot following his efforts to name a slate of alternate Electoral College electors in Trump's favor.",
    "The 52-year-old tweeted a picture of himself casting an emergency absentee ballot from the hospital and his campaign later released a statement saying he was undergoing surgery to implement a pacemaker with a defibrillator which should address the root cause of his health scare.",
    "He has pledged to take the extraordinary step of requiring voters to \"re-register\" to vote  even though that's barred by the National Voter Registration Act and likely violates significant protections under federal, and possibly state, law.",
    "Trump is poised to notch several easy wins, including in Pennsylvania's much-watched GOP race for governor, which far-right contender Doug Mastriano was already leading before the former president backed him over the weekend.",
    "Given his level of involvement in the race, a loss would be a notable setback for the former president, who is wielding endorsements as a way to prove his dominance over the GOP ahead of a potential 2024 presidential run.",
    "That's especially true in the perennial political battleground of Pennsylvania, where some Republicans are already worried that Mastriano is too extreme to woo moderates who are often decisive in general elections.",
    "\"What I've been trying to do throughout this campaign is talk about the fact that no matter how difficult it is, we actually know as a party what it takes to be successful,\" Lamb told a Pittsburgh radio station.",
    "While much of the attention during the opening phase of the primary season has focused on Trump's grip on the GOP, the contests also serve as a referendum on Biden's leadership of the Democratic Party.",
    "Meanwhile, Pennsylvania Attorney General John Shapiro, who was unopposed for his party's governor's nomination, tweeted that he had mild COVID-19 symptoms that were forcing him from the campaign trail.",
    "Tuesday's contests could ultimately determine how competitive the general election will be this fall, when control of Congress, governor's mansions and key elections posts are up for grabs.",
    "Still, known for his hulking, 6-foot-8 stature and tattoos, and for championing causes including universal health care, Fetterman has appealed to many Democrats with an outsider image.",
    "Lamb said Tuesday he had detected \"frustration\" among Democratic primary voters, a feeling he said he shared as the party has struggled to accomplish much of its policy agenda.",
    "HARRISBURG, Pa.  Republican U.S. Rep. Ted Budd will face Democrat Cheri Beasley in North Carolina's Senate race after both easily clinched primary victories Tuesday night.",
    "\"Everything he was talking about was making sense,\" said Steinly, who wore a black T-shirt that said \"Biden is not my president (or anyone else's) based on legal votes.\"",
    "Then there's Mastriano, who was also outside the Capitol during the mob attack and would appoint Pennsylvania's chief elections official if he becomes governor.",
    "Budd had the endorsement of Donald Trump and his victory is a boost for the former president, who is looking to reshape a new generation of Republicans.",
    "Barnette is running even further to the right than Oz and participated in the January 2021 rally that turned into an insurrection at the U.S. Capitol.",
    "But he argued that moderates helped Democrats retake control of the House in 2018 and that the party should \"double down\" on that approach this year.",
    "In the president's native state of Pennsylvania, U.S. Rep. Conor Lamb, a moderate in the mold of Biden, is at risk of being trounced by Fetterman.",
    "Some are suspicious of the ideological leanings of the celebrity heart surgeon who gained fame as a frequent guest on Oprah Winfrey's talk show.",
    "Trump, who has held campaign-style rallies with Oz, insists he is the best candidate to keep the Senate seat in Republican hands in the fall.",
    "That's allowed commentator Kathy Barnette to emerge in the final days of the primary as a conservative alternative to both Oz and McCormick.",
    "Stacy Steinly, a 51-year-old school bus assistant, cast her ballot in the town of Hamburg, Pennsylvania, about 30 miles west of Allentown.",
    "Trump's safest bet might be Budd, who has overcome a slow start to emerge from 14 Republican primary candidates, including former Gov.",
    "But Trump's preferred Senate candidate in Pennsylvania, Mehmet Oz, has divided conservatives who are typically in lockstep with Trump.",
    "Robert Sweeney, 59, also from Hamburg, said he voted for Fetterman because \"he seemed like a decent guy and knows what he's doing.\"",
    "Should she win the primary and general election, Barnette would be the first Black Republican woman elected to the U.S. Senate.",
    "The year's midterm primary season is entering its busiest stretch with races also unfolding in Kentucky, Oregon and Idaho.",
    "\"There's definitely some concern in large factions of the party,\" said Pennsylvania Republican strategist Vince Galko.",
    "She said she chose Mastriano because \"he was sticking by President Trump and saying that everything was fraudulent.\"",
    "More fundamentally, Tuesday's primaries could test voters' commitment to democratic principles.",
    "John Fetterman has dominated the Senate race but was forced off the campaign trail by a stroke.",
    "Oz has spent much of the campaign in a heated fight with former hedge fund CEO David McCormick.",
    "He'll be helpful,\" Trump told a Philadelphia radio station on Tuesday, referring to Oz.",
    "___\nAssociated Press writer Michael Rubinkam contributed from Hamburg, Pennsylvania.",
    "If she prevails in November, Beasley would be the state's first Black senator.",
    "Beasley, a former state supreme court justice, won her 11-candidate primary.",
    "Pat McCroy, as a favorite in North Carolina's Republican Senate primary.",
    "\"I also think he's the one that's gonna win the election.",
    "Democrats have their own high-profile primaries.",
    "You know that's not an easy election to win.\"",
    "In Pennsylvania, progressive Lt. Gov.",
    "\"I think he's tough.",
    "He's very smart."
  ]
}