{
  "id": 6694,
  "mediaId": 33,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "6 conclusiones de las primarias en Pensilvania, Carolina del Norte y ms",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220518132344-donald-trump-file-051422-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/05/18/6-conclusiones-primarias-pensilvania-carolina-del-norte-mas-trax/",
  "sentiment": "0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Merica",
  "authorUrl": "https://cnnespanol.cnn.com/author/dan/",
  "termIds": [
    821,
    2303,
    3102
  ],
  "sentences": [
    "Un negador de elecciones podra tener poder sobre las elecciones de Pensilvania de 2024\nEn el senador estatal Doug Mastriano, los republicanos de Pensilvania han nominado para gobernador a una voz destacada que promueve las mentiras de Trump sobre el fraude electoral, lo que aumenta la posibilidad de que alguien que ya intent anular la voluntad de los votantes en 2020 tendra poder sobre la maquinaria electoral de uno de los estados de campo de batalla presidencial ms importantes de la nacin en 2024.",
    "En Oregon, el representante titular Kurt Schrader, que cont con el respaldo del presidente Joe Biden junto con un par de grandes grupos de gasto (el Center Forward, un PAC respaldado por productos farmacuticos y Mainstream Democrats, financiado por el fundador de LinkedIn, Reid Hoffman) que reforzaron su campaa, qued por detrs del retador Jamie McLeod-Skinner, de corte progresista, a medida que llegaban los votos del condado ms grande del 5. distrito recin sorteado.",
    "Y en Carolina del Norte, Beasley fue vista tan ampliamente como el principal candidato que otra estrella demcrata en ascenso que habra sido uno de los principales reclutas en aos anteriores, el senador estatal y miembro de la Guardia Nacional del Ejrcito Jeff Jackson, termin su campaa meses antes de las primarias, quedando detrs de Beasley mientras se postulaba para un escao en la Cmara.",
    "Los grupos externos obtienen un rendimiento modesto en la gran apuesta de las primarias demcratas a la Cmara\nLos grupos externos inundaron en gastos a los candidatos demcratas moderados antes de las carreras en Carolina del Norte, Pensilvania y Oregon en un intento por superar a los externos progresistas y mitigar el impulso reciente de la izquierda en las primarias de la Cmara.",
    "Un par de candidatos progresistas seleccionados en Carolina del Norte perdieron por mucho, mientras que Summer Lee, una representante estatal de Pensilvania que competa por convertirse en la primera mujer negra elegida para el Congreso del estado libre asociado, estaba en una carrera reida con su rival moderado en el Distrito 12 de Pittsburgh.",
    "Los puentes quemados de Madison Cawthorn en las primarias de Carolina del Norte\nA pesar de una asistencia tarda de Trump, el representante Madison Cawthorn no pudo sobrevivir a su serie de escndalos, ni a los esfuerzos del Partido Republicano por convertirlo en un ejemplo para otras figuras de extrema derecha.",
    "Es una dinmica exclusiva de las primarias republicanas: Trump es una fuerza tan absorbente en el Partido Republicano que cuando el candidato respaldado por Trump y aquellos que buscan llevar el trumpismo an ms lejos no son la misma persona, le da espacio a un candidato menos inspirado en Trump como McCormick.",
    "Hasta la madrugada de este mircoles, Mehmet Oz, el clebre cirujano cardaco respaldado por el expresidente Donald Trump, y el ejecutivo de fondos de cobertura retirado David McCormick estn enzarzados en una batalla cuerpo a cuerpo en las primarias republicanas para el Senado que podra tardar das en resolverse.",
    "El ganador de esa carrera se enfrentar al vicegobernador John Fetterman, quien triunf en las primarias demcratas a pesar de haber sido hospitalizado despus de sufrir un derrame cerebral das antes, en una carrera que ambos partidos consideran crucial en la batalla por el control del Senado.",
    "Si lo que atrae a los votantes de las primarias demcratas se traducir en elegibilidad en noviembre en las dos contiendas por los escaos vacantes que dejarn los republicanos que se jubilan, podra desempear un papel clave para determinar qu partido controlar el Senado el prximo ao.",
    "Las implicaciones de los resultados del martes tambin pesarn en la exitosa segunda vuelta de la prxima semana en Texas, donde Jessica Cisneros est tratando de derrocar al actual representante moderado Henry Cuellar, otro gran beneficiario de organizaciones financieras externas.",
    "Pero Trump sigue siendo la fuerza gravitacional dentro del Partido Republicano, y la victoria de Mastriano en las primarias muestra que aquellos que estn dispuestos a cumplir sus rdenes podran tener mucho ms poder para frustrar la voluntad de los votantes en 2024 que en 2020.",
    "McGeachin, quien fue elegida vicegobernadora por separado de Little (porque en Idaho los dos cargos se eligen en sus propias contiendas en lugar de ser un boleto nico) era parte de una serie de candidatos de extrema derecha que buscaban tomar el control del gobierno estatal.",
    "En Pensilvania, Fetterman, a quien los votantes demcratas consideraban autntico y luchador, derrot al representante Conor Lamb, un refinado veterano de la Marina que ha vencido a los republicanos en contiendas difciles y tiene una clida relacin con el presidente Joe Biden.",
    "(Crdito: Michael M. Santiago/Getty Images)\nSus victorias son parte de un cambio dentro del Partido Demcrata, donde lo que constitua un buen recluta en ciclos pasados significaba alguien que se pareca mucho ms a las personas a las que derrotaron Fetterman y Beasley.",
    "(CNN) -- Los republicanos de Pensilvania eligieron este martes en las primarias como su candidato a gobernador en las elecciones intermedias a un poltico que neg la victoria de Joe Biden, pero parecen haber rechazado a un candidato de extrema derecha al Senado.",
    "Mastriano respaldado por Trump se enfrentar al fiscal general demcrata del estado Josh Shapiro, quien ha defendido constantemente el proceso electoral de Pensilvania y los resultados de 2020, en la carrera para reemplazar al gobernador demcrata Tom Wolf.",
    "McGeachin haba aparecido en los titulares al usar su condicin de gobernadora interina cuando Little viaj brevemente fuera del estado para implementar rdenes ejecutivas relacionadas con el coronavirus que prohiban los mandatos de mascarillas y vacunas.",
    "Este martes por la noche, el vicegobernador John Fetterman, un exalcalde calvo y tatuado que mide poco ms de 2 metros, conocido por usar pantalones cortos y sudaderas con capucha, gan las primarias demcratas para el Senado de Pensilvania.",
    "El ganador podra desempear un papel importante en las elecciones de 2024: en Pensilvania, el gobernador nombra al secretario de estado, la persona a cargo de dirigir las elecciones de Pensilvania y aprobar a sus electores.",
    "En Carolina del Norte, la expresidenta del Tribunal Supremo del estado, Cheri Beasley, despej en gran medida el campo de las primarias y logr una nominacin que podra convertirla en la primera senadora negra del estado.",
    "Intent realizar una revisin partidista al estilo de Arizona de los resultados de las elecciones de 2020 en Pensilvania e hizo teoras de conspiracin desacreditadas sobre la eleccin una pieza central de su campaa.",
    "El resultado final podra retrasarse en parte debido a un error de impresin en el condado de Lancaster que, segn los funcionarios all, dej alrededor de 22.000 boletas que no pudieron ser ledos por los escneres.",
    "El senador Thom Tillis y otros importantes republicanos de Carolina del Norte no solo denunciaron abiertamente a Cawthorn, sino que identificaron y apoyaron a un solo oponente en el campo de ocho candidatos.",
    "La primera persona a la que Oz agradeci durante un discurso en su fiesta de la noche electoral fuera de su propia familia fue al expresidente Donald Trump, cuyo respaldo lo catapult a una carrera abierta.",
    "La candidata de extrema derecha en Idaho se derrumba\nEl gobernador de Idaho, Brad Little, evit fcilmente un intento de quitarlo del cargo por parte de su propia vicegobernadora, Janice McGeachin.",
    "Trump la respald, a pesar de que Little tambin haba respaldado las mentiras electorales de Trump y se sum al esfuerzo legal de Texas para anular los resultados de algunos estados en 2020.",
    "La conservadora Kathy Barnette, a quien muchos funcionarios republicanos teman que superara a Oz y McCormick a pesar de las preocupaciones sobre su elegibilidad, estaba en tercer lugar.",
    "Lee enfrent ms de US$ 3 millones en gastos del Proyecto Democracia Unida, un sper PAC alineado con el Comit de Asuntos Pblicos Estadounidense-Israel y la Mayora Democrtica para Israel.",
    "Unas apretadas primarias para el Senado en Pensilvania\nPensilvania continu contando boletas de su eleccin primaria republicana para el Senado este mircoles por la maana.",
    "Pero si bien Trump ayud personalmente a Oz, el trumpismo, la evolucin de las fuerzas que el expresidente desat dentro del Partido Republicano, podra haberlo perjudicado.",
    "La derrota de Cawthorn lo fue tambin para Trump, quien recurri a su propia red social, Truth Social, para abogar por el congresista de 26 aos el domingo por la noche.",
    "Aunque el voto en contra de Cawthorn se fractur entre varios contendientes, los esfuerzos por elevar a Edwards como la principal alternativa valieron la pena.",
    "Mastriano estuvo en Washington para la manifestacin \"Stop the Steal\" (Paren el robo) antes del ataque al Capitolio de Estados Unidos el 6 de enero de 2021.",
    "Y aunque Barnette ocupa el tercer lugar en la carrera cuando se cuentan las ltimas boletas, parece haberle quitado los votos necesarios al famoso mdico.",
    "Trump escribi: \"Recientemente, cometi algunos errores tontos, que no creo que vuelva a cometer... Dmosle a Madison una segunda oportunidad!\".",
    "En Carolina del Norte, la representante republicana Madison Cawthorn fue derrotada por poco en medio de una nube de escndalo.",
    "Las tcticas detrs del enfoque de tierra arrasada de los crticos de Cawthorn dentro del partido fueron clave para su derrota.",
    "Recibi un apoyo considerable de Justice Democrats y Working Families Party, pero esos grupos todava tenan muchos gastos.",
    "La evolucin de la \"elegibilidad\" demcrata\nLo que significa ser uno de los principales reclutas demcratas est cambiando.",
    "La conservadora Kathy Barnette se postul como heredera de Trump, aprovechando la antipata republicana de base hacia Oz.",
    "Fue expulsado de su escao en el Congreso del oeste de Carolina del Norte por el senador estatal Chuck Edwards.",
    "Y es una razn importante por la que la carrera sigue siendo demasiado reida para decidir.",
    "Los republicanos nacionales mantuvieron a Mastriano a distancia el martes por la noche.",
    "Pero con casi todos los votos, los rendimientos de esas inversiones parecen ser mixtas.",
    "Y en Oregon, un demcrata moderado qued rezagado en las primarias del Congreso.",
    "Pensilvania fue uno de los cinco estados que celebraron primarias este martes.",
    "En Idaho, el gobernador Brad Little se defendi de un desafo de su No.",
    "Estas son seis conclusiones de las primarias del martes.",
    "Little inmediatamente rescindi esas rdenes a su regreso.",
    "2."
  ]
}