{
  "id": 6705,
  "mediaId": 238,
  "date": "d2022-05-18T00:00",
  "headline": "Pennsylvania Republicans identify the real kingmaker: Sean Hannity",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/18/pennsylvania-republicans-identify-real-kingmaker-sean-hannity/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Bump",
  "authorUrl": "https://www.washingtonpost.com/people/philip-bump/",
  "termIds": [
    1147,
    1148,
    1653,
    3102,
    200,
    428,
    571,
    2862
  ],
  "sentences": [
    "Giving me advice in late-night conversations  again the kinds of things that true friends do for one another.?\nHere, again, I am obligated by the standards of my profession to gnash my teeth at Hannity offering behind the scenes? advice to a candidate for office, but I will say that Im gnashing them with little more than depressed resignation.",
    "Oz: I want to thank Sean Hannity He understands how to make a difference and hes been doing that this entire campaign.. much of it behind the scenes giving me advice on late night conversations pic.twitter.com/E18ZHl973W\nI want to thank Sean Hannity,? Oz said during the speech he gave at his campaign party Tuesday night.",
    "I raise this point because its possible that Trump  for whom endorsements are as emotionally vital as the last dollar placed on a roulette table by a man on the brink of insolvency  may strike out in his Senate endorsement in Pennsylvania.",
    "So Hannity backed Trumps candidate  in keeping with his dedication to the former president  and then used his resources (a prime-time program on the cable news channel most watched by Republican voters) to benefit that candidacy.",
    "And, yes, its true that bashing Hannity is a safer play than bashing Trump for someone who might want to either run as a Republican again or who is looking for a more prominent perch for punditry.",
    "In the hours after polls closed, though, both Oz and Barnette pointed to a different person as playing an important role in how the race turned out: Fox News Channel host Sean Hannity.",
    "pic.twitter.com/bgtr066AOh\n Kathy Barnette (@Kathy4Truth) May 18, 2022\nOn Wednesday morning, Barnette released a brief video thanking Pennsylvania voters for supporting her candidacy.",
    "But lets be honest: No one on this earth who has paid more than 20 seconds of attention to Hannity is under any misapprehension about his proximity to evenhanded reporting.",
    "He did endorse Doug Mastriano, the state senator who won the gubernatorial primary in the state, but only after it was obvious Mastriano was going to win handily.",
    "In his next late-night call with the former president, one might expect that Sean Hannity will hear some choice words about how true friends? are supposed to act.",
    "There were television ads targeting Barnettes murky background and lots of non-Hannity-led conversation about how she might fare in a general election.",
    "Former president Donald Trump, whose endorsement has been sought by all the Republican candidates, chose to back Oz, frustrating many of his allies.",
    "This is the paragraph in which I am obliged to harrumph about how Hannity, as a member of the media, is not supposed to be endorsing candidates.",
    "The race was one of the most ferociously contested of Tuesday nights elections, introducing an unusual new dynamic to Republican politics.",
    "Perhaps his comment prompted a senior Fox executive to think about shrugging, but I doubt one actually exerted the effort to carry it out.",
    "Fox News has in the past chastised Hannity for getting actively involved in races, but it seems to have just given up on the idea.",
    "Barnettes candidacy was a more natural fit with Trumps base, helping explain why she earned as much support as she did.",
    "The pair appear to have held off a late threat from right-wing commentator Kathy Barnette, who has no path to victory.",
    "Barnette might never have had a real shot or she might not have done any better had Hannity not said a word about her.",
    "Almost single-handedly, Sean Hannity sowed seeds of disinformation, flat-out lies every night for the past five days.",
    "It was an interesting test: Could Trumps endorsement lift a less-Trumpy candidate over a more-Trumpy one?",
    "That formulation of Hannity hopping on the phone and riffing on how to proceed might sound familiar.",
    "It is, after all, exactly the way in which he reportedly offered Trump advice in the White House.",
    "If Oz loses to McCormick, Trumps breathless insistence on his king-making prowess takes a hit.",
    "He understands exactly how to make a difference and hes been doing that this entire campaign.",
    "Now, we should not assume that this by itself was why Barnette is likely to finish in third.",
    "I want to thank each and every one of my supporters in Pennsylvania and all around America.",
    "The leading candidates are television personality Mehmet Oz and businessman Dave McCormick.",
    "As of writing, the results in Pennsylvanias Republican Senate primary are undetermined.",
    "(Give me $20 on red,? the gambler says as the roulette ball settles onto a red space.)",
    "But we should also note that it isnt just that Barnette blamed Hannity for her loss.",
    "Over and over, even within the same program, he hammered on Barnette and touted Oz.",
    "And that was just extremely hard to overcome, apparently.?\nOkay, sure, you say.",
    "I do want to say,? she said: Never forget what Sean Hannity did in this race.",
    "The past thirteen months have been some of the most incredible in my life.",
    "We now must focus on winning back our nation from the radical Left!",
    "When Sean punches through something, he really punches through it.",
    "Hannity said directly last week on his show that he endorsed Oz.",
    "Its also that Oz gave him some credit for his potential win.",
    "And if Hannity gets the credit for knocking out Barnette?",
    "Or if Oz wins and Hannity gets more credit than Trump?",
    "A person who lost is finding a scapegoat for losing.",
    "She also offered some words of condemnation.",
    "Our journey together is only beginning.",
    "Much of it behind the scenes.",
    "(Gnash, harrumph, sigh, etc.)",
    "Seans like a brother to me."
  ]
}