{
  "id": 6710,
  "mediaId": 157,
  "date": "d2022-05-18T00:00",
  "headline": "Trump was 'stunned' to see Kathy Barnette's rise despite his endorsement of Dr. Oz: NY Times",
  "image": "https://www.rawstory.com/media-library/trump-s-defeat-and-denial-has-turned-the-white-house-mood-sour-as-staffers-scramble-for-new-jobs-nyt-reporter.jpg?id=27093739&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/trump-stunned-kathy-barnette/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    723,
    906,
    1147,
    1443,
    1653,
    2303,
    2491,
    3102,
    5388,
    517
  ],
  "sentences": [
    "Michael Bender and Maggie Haberman revealed in a New York Times report that behind the scenes, former President Donald Trump was shocked that his endorsement didn't mean a blowout win for Mehmet Oz.",
    "Not one to be dictated from the top down.?\nThe report recalled the January event with Trump and former Fox News host Bill O'Reilly who told the audience that they'd been vaccinated and boosted.",
    "Activist Diante Johnson, who founded the Black Conservative Federation, explained that after years fighting the Republican establishment, there is now a kind of \"Trump establishment.\"",
    "\"Long known for being dialed into his voters, Mr. Trump increasingly appears to be chasing his supporters as much as marshaling them,\" Bender and Haberman wrote.",
    "He never did anything to help Mastriano, despite the state senator's loyalty to Trump and the belief that the 2020 election went down in a conspiracy.",
    "\"Theres no obvious heir apparent when it comes to America First  its still him,\" said Kellyanne Conway, the 2016 campaign manager and pollster.",
    "\"But people feel they can love him and intend to follow him into another presidential run  and not agree with all of his choices this year.\"",
    "\"Republican voters distrust of authority and appetite for hard-line politics  traits Mr. Trump once capitalized on  have worked against him.",
    "In Pennsylvania's gubernatorial race, Trump only endorsed Doug Mastriano a week before the election, after it was clear he was going to win.",
    "She along with hedge funder David McCormick, who had a number of Trump's old staff working for him, ended up with a lot of MAGA support.",
    "Some have come to see the president they elected to lead an insurgency as an establishment figure inside his own movement.\"",
    "Trump assumed Oz was going to win because his show was once a successful one and he got the Trump brand behind him.",
    "After Tuesday's races, there's reason to believe that Trump doesn't quite have the power that he thinks he does.",
    "Instead, MAGA supporters questioned his dedication to the \"America First\" agenda, not to mention the \"Big Lie.\"",
    "In fact, he told the Fox network that she'd never win and that's why he didn't want her to be the candidate.",
    "Trump infamously told a crowd of his supporters that Oz was going to win because he was on television.",
    "Ironically, however, Trump appears to run into problems when he isn't Trumpy enough for the audience.",
    "He appears only concerned about \"winning\" a Senate race and installing his own loyalists in office.",
    "Kathy Barnette saw a huge response after ads began airing about her Club for Growth endorsement.",
    "In the Senate race in Pennsylvania, however, Trump thought it would be a huge response for Oz.",
    "He lost the governor's races in Idaho and Nebraska and Rep. Madison Cawthorn's (R-NC) primary.",
    "The so-called MAGA movement is a bottom-up movement,? said Ken Spain, a Republican strategist.",
    "His base staying true to the philosophy shouldn't surprise anyone, the story explained.",
    "\"Every Trump establishment individual that came after her, she stood there and fought.\"",
    "Meanwhile, Kathy Barnette made it clear that Trump doesn't own the movement anymore.",
    "It wasn't Trump's dedication to the MAGA movement or the \"America First\" agenda.",
    "Yet, Trump has quickly realized that he can't control the MAGA world he created.",
    "MAGA does not belong to President Trump,? she said during the Senate debate.",
    "\"Hes in the bedrooms of all those women, telling them good and bad.",
    "He'd never considered the possibility of endorsing her candidacy.",
    "Barnettes rise \"stunned\" Trump, advisers told the Times.",
    "\"The knife came to her and she didnt back up,\" he said.",
    "At one point, Oz was even booed by a Trump audience.",
    "The crowd booed and the men seemed shocked.",
    "Hes on that screen,\" Trump said.",
    "\"Ive known him a long time.",
    "And they love him.\""
  ]
}