{
  "id": 6711,
  "mediaId": 234,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Report: Trump Thinks Truth Social Is a Failure Because Google Is Trying to F--k Him",
  "image": "https://media.vanityfair.com/photos/628567fb3cdce88a131e3b2f/master/w_2240,c_limit/901868142",
  "link": "https://www.vanityfair.com/news/2022/05/donald-trump-truth-social-google",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    3102
  ],
  "sentences": [
    "If youre not familiar with Doug Mastriano, a quick primer on the state senator turned gubernatorial candidate:\nOn November 5, 2020, he called for the resignation of Kathy Boockvar, the then secretary of the Pennsylvania Commonwealth, claiming that Pennsylvanians no longer feel secure in casting their vote?;\nHe wrote an email to a Department of Justice official, and asked that it be passed on to the then acting attorney general, in which he raised a litany of false and debunked claims of widespread election fraud in Pennsylvania, which Mastriano had previously aired at a November 25, 2020, hearing at a hotel in Gettysburg featuring Trump campaign lawyers Rudy Giuliani and Jenna Ellis,? as well as Trump himself via phone;\nAfter Bidens PA win was official, he introduced a resolution to throw out the votes and just appoint Trump electors;\nHe used campaign funds to charter busses to the Stop the Steal? rally that preceded the violent riot;\nVideo footage shows that he and his wife took part in the...insurrection,? having crossed police lines and breaching the barricades set up at the Capitol;\nOn March 30, 2022, while campaigning for governor, he said: Im Doug Mastriano, and [if elected] I get to appoint the secretary of state whos delegated from me the power to make the corrections to elections, the voting logs and everything.",
    "Scientists and federal health officials are debating plans to pair coronavirus and flu vaccinations in the fall (NYT)\nWhat every American knows: No setting is off limits to a mass shooting (Washington Post)\nHouse to vote on $28 million in emergency funding to address baby formula shortage (CNN)\nAbortion counteroffensive could buoy California Dems (Politico)\nBiden to meet with Democratic senators on student loan debt (CNN)\nPentagon watchdog finds Trump administration targeted brother of key impeachment witness for reprisal (CNN)\nJohns Hopkins students invent edible Tastee Tape? to keep burritos together (UPI)\nGeraldo Rivera Says He Saw UFO While Stoned on Ecstasy? in the Bahamas (Mediaite)",
    "According to the outlet, Trump, who reportedly doesnt use email, once suggested that everyone in the U.S. should stop using computers, and reportedly calls iPads the flat one,? has also asked if Google is is trying to screw with me? or has simply wondered aloud, Whats up with Google??\nIn February, former California representative Devin Nunes, who left his job in Congress to be Truth Socials CEO, said that the companys goal? was to have the network fully operational? by the end of March, which obviously did not happen.",
    "Mastriano apparently has no issue with QAnon; wants abortions banned with no exceptions for rape, incest, or to save the life of the mother; and, per HuffPost, is a key figure in Christian nationalism, the insurgent movement that holds the anti-democratic belief that America is a nation by and for Christians in need of saving from secular, satanic forces so that its laws can reflect a far-right interpretation of scripture.?\nThe GOP wants to tell your kids a bedtime story\nElsewhere!",
    "One of the countrys biggest election deniers is now the Republican Partys nominee for PA governor\nSince the day Republican senators acquitted Donald Trump for the second time, choosing not to ban him from ever holding office again (despite his incitement of a violent riot and attempt to block Joe Biden from becoming president), the mere idea of the 2024 election has been an exercise in nail-biting anxiety.",
    "Which, reporters Adam Rawnsley and Asawin Suebsaeng note, probably has less to do with Google trying to screw over the ex-president and more to do with the fact that, as of Tuesday, the company hadnt even submitted an Android app to Google to review for Play Store approval.? Nevertheless, Trump continues to labor under the idea that this is personal.",
    "Like a crazy old man who spends his days shouting at an empty blender and thinks the government is performing mind control on people through their microwaves, Donald Trump apparently believes that the reason his newly formed social media company, Truth Social, is not a runaway success is because Google has internally decided to sabotage him.",
    "I could decertify every machine in the state with the stroke of a pen via the secretary of state?:\nAs Trump himself said in his endorsement of the guy: There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano.",
    "In recent weeks, the former presidents eldest son, Donald Trump Jr., was called in to take a lead role focused on trying to fix? what was wrong with the company and the app performance, according to two people familiar with the situation.",
    "He keeps hearing about how Google and YouTube have it out for himincluding on Truth Social, and I think hes taking [it] seriously,? one source whos discussed the matter with Trump told Rawnsley and Suebsaeng.",
    "But on Tuesday night, that fear turned to threat-level shit your pants,? after one of the biggest enablers of Trumps big lie? became the Republican nominee for Pennsylvania governor.",
    "One of these sources frankly referred to what Trump Jr. was doing as an emergency rescue mission.?\nWhen Don Jr. is your Hail Mary, you know things have gotten really bad.",
    "According to Rolling Stone, Trump believes the tech giant has it out for him due to the fact that the Truth Social app is not yet available for Android users.",
    "In addition to reportedly being placed in waitlist purgatory, would-be Truthers have complained that attempting to use the app is a Kafkaesque nightmare.",
    "He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it?\nAside from all that?",
    "Is Google trying to fuck me?? the former president has reportedly been asking friends and advisers over the past several weeks.",
    "In recent months, a pair of senior executives, one of whom was described as the brains? behind the apps technology, quit.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "A Truth Social spokesperson did not respond to Rolling Stones request for comment.",
    "A Google spokesperson declined Rolling Stones request comment.",
    "But perhaps the biggest sign of how poorly things are going?"
  ]
}