{
  "id": 6712,
  "mediaId": 157,
  "date": "d2022-05-18T00:00",
  "headline": "Ana Navarro goes off on Trump-backed nutcase Doug Mastriano: One of the wackiest acceptance speeches Ive ever heard",
  "image": "https://www.rawstory.com/media-library/meet-the-far-right-pennsylvania-republican-who-believes-that-god-was-behind-trumps-attempted-coup.jpg?id=26314583&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/doug-mastriano-acceptance-speech/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1611,
    3102,
    5450,
    106,
    200,
    2862
  ],
  "sentences": [
    "IN OTHER NEWS: Doctor clashes with GOPer over definition of woman: 'I think it's important we educate people like you'\nBlackwell wondered why Mastriano used his speech to throw red meat to his base instead of pivoting to a general election message.",
    "said the man who led the effort to overturn the 2020 election in Pennsylvania and has been subpoenaed by the House Select Committee Investigating the Jan. 6 Attack on the U.S. Capitol.",
    "\"He sounds like a commentator on Fox News, not like someone wanting to be governor of a state that, until now, has been, you know, pretty purple,\" she explained.",
    "\"It was one of the looniest, wackiest, acceptance speeches I've ever heard in years of listening to acceptance speeches all over this country,\" she concluded.",
    "CNN commentator Ana Navarro had harsh words after Republican primary voters in Pennsylvania after they nominated state Sen. Doug Mastriano for governor.",
    "\"So I think he was sticking to his points that won him the primary and it is what he's going to run on.",
    "Anchor Victor Blackwell played a clip of Mastriano's Tuesday evening victory speech.",
    "CRT, culture wars, manufactured grievances and things he thinks gets his base out.\"",
    "\"They like to call people who stand on the Constitution far-right and extreme.",
    "\"I think he's being authentic as to the right-wing nutcase that he is.\"",
    "Mastriano went on to list some of his \"day one\" priorities.",
    "\"Because I think that's who he is,\" Navarro replied.",
    "I repudiate that  that is crap!\""
  ]
}