{
  "id": 6715,
  "mediaId": 132,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Trump-backed Mastriano wins GOP Pennsylvania governor nod",
  "image": "https://cdn.newsday.com/ace/c:N2NkNDA0NTktYTMxNi00:YThkZjA0/landscape/1280",
  "link": "https://www.newsday.com/news/nation/doug-mastriano-pennsylvania-governor-nomination-a4tpi3ha",
  "sentiment": "0",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "Shapiros campaign, meanwhile, closed the primary campaign by running a TV ad portraying Mastriano as extreme and saying that if Mastriano wins, its a win for what Donald Trump stands for.?\nMastriano has insisted to supporters that he is not extreme and that his platforms  including eliminating mail-in voting, expanding gun rights, banning abortion and banishing school property taxes  enjoy broad support.",
    "In a statement, Shapiro said he knows Pennsylvanians are worried right now, and thats why they need a governor they can count on and one who can meet this moment.?\nHe called Mastriano a dangerous extremist who wants to take away our freedoms.?\nMastriano, 58, represents a Senate district based in conservative Franklin County on Pennsylvanias southern border with Maryland.",
    "1 goal is first, is to restore freedom.?\nIn his campaign, he connected with far-right GOP voters through appearances on conservative broadcasters, a tireless ground campaign that dotted the state with his yard signs and endorsing conspiracy theories, including Trumps unsubstantiated claims that Democrats stole the 2020 presidential election from him.",
    "Mastriano slammed it as a backroom deal.?\nIn 2020, Mastriano became a rising force in Pennsylvania's right-wing politics, gaining a following by leading anti-shutdown rallies during the early days of the pandemic to protest Wolf's orders to wear masks in public, close down non-essential businesses and educate school children remotely.",
    "HARRISBURG, Pa.  Doug Mastriano won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "Shapiro helped cement his reputation with a landmark grand jury investigation into child sexual abuse coverups inside Pennsylvanias Roman Catholic dioceses and defending Pennsylvanias 2020 election result against attempts in court to overturn it by Trump and his allies.",
    "Republican voters had to choose from among nine names on the ballot for governor, even though two said they had ended their campaigns and endorsed Barletta as part of a last-ditch attempt to help defeat Mastriano.",
    "In the final days of the campaign, party officials tried to consolidate support around former U.S. Rep. Lou Barletta, the Trump-endorsed nominee for U.S. Senate in 2018, in a long-shot bid to defeat Mastriano.",
    "The winner in the fall general election is likely to share power with a Republican-led Legislature, where entrenched GOP majorities have controlled the floors for nearly all of the past three decades.",
    "He later organized bus trips to the U.S. Capitol for Trumps Jan. 6 Stop the Steal? rally, where he was seen in footage with his wife passing through breached barricades set up by Capitol Police.",
    "Shapiro was uncontested on the primary ballot after wrapping up the endorsement of the state party and its top allies, including the AFL-CIO, and raising more than $20 million since early 2021.",
    "Mastriano went on to pad his support among hardcore Trump backers by working with the former president to overturn his loss in 2020's election in the presidential battleground state.",
    "Mastriano, a retired U.S. Army colonel and state senator since 2019 who was endorsed by former President Donald Trump, will face Democrat Josh Shapiro in the November election.",
    "Trump endorsed Mastriano over the protests of many party officials who feared he cannot win over the moderate voters necessary to prevail in politically divided Pennsylvania.",
    "We're going to have the hardest-working campaign in the general election.?\nDemocrats, meanwhile, were united behind Shapiro, the states two-term elected attorney general.",
    "Mastriano, once viewed as a fringe candidate, spent almost nothing on TV ads and largely shunned interviews with independent news organizations.",
    "Mastriano beat a number of Republican rivals who outspent him and he suggested that he can again win a fall election where he will be outspent.",
    "Rather, he says Democrats  including President Joe Biden  are far-left radicals while the Republican swamp? was trying to defeat him.",
    "Barletta had picked up a number of endorsements by current and former Republican officeholders, including members of Congress.",
    "He also emphasized his military background, Christian beliefs and hard-line conservative positions on abortion and guns.",
    "We had the hardest-working campaign in this primary,? Mastriano told a cheering crowd in a Chambersburg event hall.",
    "That earned Mastriano a subpoena from the U.S. House committee investigating the Capitol riot on Jan. 6, 2021.",
    "Shapiro, 48, is a former state House member and county commissioner from Montgomery County.",
    "His electoral success statewide and fundraising prowess cleared the field of rivals.",
    "Mastriano was well on his way to victory when Trump endorsed him on Saturday.",
    "Tom Wolf, who is constitutionally term-limited after entering office in 2015.",
    "Mastriano and Shapiro are vying for the right to succeed Democratic Gov.",
    "He was experiencing mild symptoms and was isolating at home, it said.",
    "Shapiro tested positive for COVID-19, his campaign said Tuesday.",
    "On stage in Chambersburg, Mastriano said, our No.",
    "Get the latest breaking news as it happens.",
    "Get the Breaking News newsletter!"
  ]
}