{
  "id": 6720,
  "mediaId": 558,
  "date": "d2022-05-17T21:33",
  "headline": "Oz, McCormick locked in nail-biter as Pa. GOP Senate primary results trickle in",
  "image": "https://s.yimg.com/ny/api/res/1.2/8A_wTqG7wgL6EikAH3eGpA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ3MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/txvyUDbD5UFRpWvcV4Pz6w--~B/aD0xNjY3O3c9MjUwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/nbc_news_122/bbfe9bcbe6d05460f644e66690320007",
  "link": "https://news.yahoo.com/surge-stroke-endorsement-pa-primary-131447135.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    729,
    1092,
    1282,
    1404,
    1653,
    1903,
    2303,
    3102,
    428,
    562,
    571,
    2862
  ],
  "sentences": [
    "Given the possibility of recounts and the need for official certifications, it is unlikely that final results in all races will be available tonight.?\nIn the race for governor, state Sen. Doug Mastriano, known for advancing debunked claims that the 2020 election was stolen from Trump, has won the GOP primary, NBC News projects.",
    "In a crowded primary in the neighboring 6th District, a PAC linked to a has spent $10.5 million  a virtually unheard-of sum, making it by far the most expensive House race of the cycle so far, according to Open Secrets, a nonprofit organization that tracks campaign finance data.",
    "Polls had shown Kathy Barnette  a conservative commentator who has spent far less money and would be the first woman and the first Black candidate to win a Senate seat in Pennsylvania  , although she ended up trailing Oz and McCormick on Election Day.",
    "And Barnettes personal story  she speaks often about how she was conceived when her mother, then 11 years old, was raped  has resonated on the right at a time when the Supreme Court might soon overturn the constitutional right to an abortion.",
    "Fetterman has built a through his support for legal recreational marijuana and LGBTQ rights while eschewing like \"progressive\" and pushing back against with Sen. Bernie Sanders, I-Vt., the democratic socialist he has aligned with in the past.",
    "I feel about Jan. 6 the way the left feels about the summer of 2020, when you have Black Lives Matter and antifa and other groups out there looting and robbing and everyone was calling it mostly peaceful protests,? in an interview this week.",
    "National Democrats backed Schrader, while supported progressive challenger Jamie McLeod-Skinner, arguing that Schrader isn't a real incumbent because the heavily redrawn district is now made up mostly of new voters.",
    "In North Carolina, Trump-endorsed Rep. Ted Budd won the GOP Senate primary and will face Democrat Cheri Beasley, the former chief justice of the state Supreme Court, in the general election, NBC News projected.",
    "On the Democratic side, the populist Fetterman had long outpolled centrist U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta, who would have been the state's first openly gay and first Black senator.",
    "In the GOP race for governor, had led in polls, and former U.S. Rep. Lou Barletta had tried to consolidate support among Republicans who argued that Mastriano is too extreme to be elected this fall.",
    "Pennsylvania's chaotic Republican Senate primary was too close to call early Wednesday, with celebrity TV doctor Mehmet Oz locked in a tight race with former hedge fund executive Dave McCormick.",
    "Unfortunately, were not going to have resolution tonight,? McCormick predicted in remarks to his supporters, asserting that mail-in votes tabulated later Wednesday would seal his victory.",
    "Budd of the Club for Growth, a big-spending conservative group that split with Trump in this months rowdy Senate primary in Ohio, as well as in Pennsylvania, where it was behind Barnette.",
    "Lamb and Kenyatta both criticized Fetterman for an , when he pulled a shotgun on a Black jogger after he heard what he thought was gunfire and detained the man until police arrived.",
    "With 91 percent of the expected ballots counted shortly after midnight, Oz, who was endorsed by former President Donald Trump, led McCormick by about 850 votes.",
    "Ozs dual citizenship in Turkey and the occasionally liberal positions he advanced before he entered politics became fodder for McCormick and other rivals.",
    "She , however, at candidate forums and debates, earning free media coverage that offset the fact that Oz and McCormick were far outspending her on TV.",
    "Barnette, meanwhile, was perhaps best known for her unsuccessful 2020 congressional bid in the Philadelphia suburbs  a landslide loss that she .",
    "Fetterman, who is white and was the mayor of the Pittsburgh-area borough of Braddock at the time, has said he couldn't tell the man's race.",
    "The GOP Senate primary in North Carolina, where Republican incumbent Richard Burr isn't seeking re-election, had particularly high stakes.",
    "Trump inserted himself into the Senate race early, endorsing Army veteran Sean Parnell, an unsuccessful congressional candidate in 2020.",
    "The state secretary of states office indicated in a statement that it could take a few days? to report unofficial results.",
    "Ahead of the primary, more than 900,000 applications for mail-in and absentee ballots were requested,? the statement said.",
    "In the battle for the nomination to succeed retiring Republican Sen. Pat Toomey, Oz found himself in a three-way fight.",
    "John Fetterman, the Democratic nominee, who was hospitalized in the final days of the campaign after he had a stroke.",
    "And two influential champions helped him score Trumps endorsement: former first lady and Fox News host Sean Hannity.",
    "When all the votes are tallied,? he said late Tuesday, I am confident we will win.?\nThe winner will face Lt. Gov.",
    "But Parnell last fall after he lost a child custody dispute that included allegations of abuse, which he denied.",
    "Brad Little survived a Trump-backed primary challenge from his own lieutenant governor, Janice McGeachin.",
    "Mastriano had been leading in polls when he scored a last-minute endorsement from Trump over the weekend.",
    "He will face state Attorney General Josh Shapiro, the Democratic nominee, in the general election.",
    "State law requires an automatic recount if the margin of victory is within 0.5 percentage points.",
    "But Trump's late endorsement most likely fortified Mastriano against such efforts to stop him.",
    "Trump's endorsement record was mixed Tuesday, and it could look worse if Oz can't hold on.",
    "But embattled Rep. Madison Cawthorn, whom Trump supported, lost a tough primary.",
    "We expect to have unofficial results within a few days.",
    "He and McCormick the states airwaves with commercials.",
    "Oz also urged patience when he addressed supporters.",
    "Oz has vowed to if he wins the Senate race.",
    "Trump endorsed Budd over former Gov.",
    "The jogger was unarmed.",
    "And in Idaho, Gov.",
    "Pat McCrory."
  ]
}