{
  "id": 6726,
  "mediaId": 441,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Pennsylvanias Primary Circus Clatters Toward Unruly Close",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iLSSRbLNgCJA/v0/-1x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-05-17/pennsylvania-s-primary-circus-clatters-toward-unruly-conclusion?srnd=premium",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Niquette",
  "authorUrl": "https://www.bloomberg.com/authors/AQVgYOcI2go/mark-niquette",
  "termIds": [
    1147,
    2303,
    2491,
    3102,
    72,
    146,
    2834,
    2862,
    5034
  ],
  "sentences": [
    "For months, the GOP race for an open US Senate seat was between Mehmet Oz, the celebrity physician, and former Bridgewater Associates Chief Executive Officer David McCormick, who with their allies had spent more than $54 million on ads -- a record for a Senate primary in the commonwealth.",
    "A Pennsylvania primary campaign that became more dramatic in every day of the final stretch roars to an end Tuesday, concluding a three-way heat in the Republican US Senate race where the victor will likely face a Democrat recovering from a stroke.",
    "Meanwhile, several thousand mail-in ballots in Lancaster County, Pennsylvania, have to be manually marked and rescanned after a printing issue made them unreadable, extending the vote counting process, officials said Tuesday.",
    "The winner of Tuesdays primary will likely face John Fetterman, the Keystone States 6-foot-8, gym shorts-wearing, Democratic lieutenant governor, who announced on Sunday he was hospitalized for a stroke but was recovering.",
    "Fetterman holds a commanding lead in polls over his nearest rival, US Representative Conor Lamb, once considered a rising star in the party for his 2018 win in a district that voted Republican in the previous election.",
    "After a number of legal and political entanglements, the youngest member of Congress has lost the backing of the GOP in his state, but gained that of former President Donald Trump in a multi-candidate primary.",
    "The Republican Senate race is also another test of Trumps grip on the GOP and whether his base voters follow his endorsements as he seeks to elect loyal candidates and teases another White House bid in 2024.",
    "Earlier this month, the former president scored a victory in neighboring Ohio when his endorsement helped JD Vance come from behind to win the Republican primary for an open US Senate seat.",
    "In Pennsylvanias governors race, Trump has endorsed state Senator Doug Mastriano, a staunch supporter of his false 2020 election claims, in a crowded Republican primary for the open seat.",
    "On Tuesday afternoon, Fettermans campaign said that he was getting a pacemaker with a defibrillator implanted and later announced the procedure was successful.",
    "But commentator Kathy Barnette upended the campaign with a late surge to make it a statistical tie in two polls released days before the primary.",
    "The highest-profile of the races in those states is 26-year-old US Representative Madison Cawthorns bid for re-election in North Carolina.",
    "But Trumps imprimatur hasnt given Oz the same boost, and hes struggled to separate from McCormick and a rising Barnette.",
    "Under state law, returned mail-in ballots cannot be opened and counted until 7 a.m. the day of the election.",
    "He said he cast his vote from Penn Medicine Lancaster General Hospital using an emergency absentee ballot.",
    "Democrat Josh Shapiro, Pennsylvanias attorney general, is running unopposed in the primary.",
    " With assistance by Emma Kinery\n(Updates with mail-in ballot problems in ninth paragraph)",
    "Lamb has complained about voters having very little information? about Fettermans health.",
    "There are also primaries Tuesday in North Carolina, Idaho, Kentucky and Oregon.",
    "Shapiro announced on Tuesday that he tested positive for Covid-19.",
    "Trump endorsed Oz in the primary."
  ]
}