{
  "id": 6727,
  "mediaId": 323,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Primary Elections Live Updates: Voters in Pennsylvania and North Carolina Cast Ballots",
  "image": "https://images.wsj.net/im-545787/social",
  "link": "https://www.wsj.com/livecoverage/primary-election-results-pennysylvania-north-carolina-oregon",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    999,
    1147,
    1282,
    1433,
    2303,
    3102,
    5414,
    428,
    2834,
    2850,
    2862
  ],
  "sentences": [
    "Here's a look back at WSJ's coverage:\nA healthcare executive is challenging the high-profile lawmaker in next months Republican primary in a Georgia district where many voters embrace Mrs. Greenes provocative style but some Republicans are frustrated by what they see as a lack of attention to the districts needs.",
    "Mr. Trump posted on his Truth Social account that Mr. Cawthorn had made foolish mistakes, which I dont believe hell make again.? He added: Lets give Madison a second chance!?\nOn Tuesday, voters in the GOP primary will decide whether to send the youngest lawmaker in the House back for a second term.",
    "The campaign said it should be a short procedure that will help protect his heart and address the underlying cause of his stroke.?\nEarlier, his campaign released a photo of Mr. Fetterman casting his vote from Penn Medicine Lancaster General Hospital using an emergency absentee ballot.",
    "Tuesdays results will answer whether Mr. Schrader, who has cautioned against Democrats spending too much money amid high inflation, can convince enough Democrats that his dose of realism makes sense at a time when many are frustrated with a lack of action from Democrats in Washington.",
    "Voters in five states are casting ballots in primary elections on Tuesday, with several contests providing the latest tests of former President Donald Trumps influence within the Republican Party and others offering Democrats a choice between their partys liberal and centrist wings.",
    "Here are some of the key races to watch:\nPennsylvania: In the Republican Senate primary, little-funded Kathy Barnette has pulled within reach of two leading contenders, celebrity surgeon Mehmet Oz and former hedge fund manager David McCormick, who spent tens of millions of dollars.",
    "In the Republican Senate primary, polls have found that a little-funded candidate, conservative commentator Kathy Barnette, has pulled within reach of two leading contenders who spent tens of millions of dollars and until recently dominated news coverage of the campaign.",
    "Five states are holding primary elections on Tuesday, with several contests providing the latest tests of former President Donald Trumps influence within the Republican Party and others offering Democrats a choice between their party's liberal and centrist wings.",
    "Those two candidates, celebrity surgeon Mehmet Oz and former hedge-fund manager David McCormick, and allied groups have been running TV ads and using public appearances in the final days of the race to raise questions about Ms. Barnettes electability.",
    "I know a lot about Oz, and hes not a conservative.?\nIn the Democratic primary, Bee Schindler, 42, who is a diversity and inclusion training manager at the University of Pittsburgh and uses they/them? pronouns, voted for Conor Lamb in the Senate race.",
    "On Monday, former President Donald Trump threw his support behind North Carolina Rep. Madison Cawthorn, whose political future was in peril after he lost support from grassroots groups in his district and many prominent Republican lawmakers.",
    "In the closing days of Pennsylvanias Republican primary for U.S. Senate, a candidate who has had a tiny fraction of the resources of the two front-runners is suddenly a contender, triggering attacks against her from different directions.",
    "It really came down to who I thought could beat Fetterman.?\nIn the governors race, Mr. Mautino said he voted for Doug Mastriano after the state senator and retired Army colonel drew former President Donald Trumps endorsement on Saturday.",
    "Kathy Barnette, an Army Reserve veteran and commentator, is surging in part because of a rise from poverty that includes being the product of sexual assault, something she has said helped forge her fierce opposition to abortion.",
    "The Pennsylvania primary for governor on the Republican side offers a test of whether voters are swayed more by former President Donald Trumps last-minute endorsements or state GOP leaders who have backed different candidates.",
    "BEND, Ore.The list of things people are unhappy about is long in this competitive Oregon district where longtime Democratic Rep. Kurt Schrader is facing a serious primary challenge for his newly reconfigured U.S. House seat.",
    "I did go for Trumps endorsement.?\nAndy Dlinn, 69, a financial adviser in Pittsburgh, said he voted for former Congressman Lou Barletta in the gubernatorial primary because he had a clear conservative track record.",
    "Most recently he promised to veto any bills that would restrict abortion access, something all Republican candidates for governor have said they would support in light of the leaked U.S. Supreme Court decision.",
    "The centrist Democratone of a dwindling number of fiscally conservative members of the party known as Blue Dogsis facing pressure from constituents on his left and right who are eager for a political shift.",
    "Jamie McLeod-Skinner, a small-business owner and an emergency-response coordinator, is running to Mr. Schraders political left in this district that stretches from the Portland suburbs into central Oregon.",
    "He said that his stroke was caused by a clot stemming from atrial fibrillation, or afib, an irregular or often rapid heart rhythm that increases the risk of stroke, heart failure and other complications.",
    "Kentucky: Contests include re-election bids by Sen. Rand Paul and Rep. Thomas Massie, both iconoclastic Republicans who have at times halted or voted against efforts to speed support to Ukraine.",
    "The former president, who is backing celebrity surgeon Mehmet Oz, has said Ms. Barnette is certain to fail in the fall if she is the nominee to succeed retiring Republican Sen. Pat Toomey.",
    "With a week to go before the election, a number of state Republican leaders expressed concern that Mr. Mastriano was too far-right to win a general election in the perennial swing state.",
    "Tuesday night will test whether centrist Rep. Kurt Schrader is able to hang on in Oregons Fifth Congressional District against a challenger who has captured the excitement of the base.",
    "I think she brings a clearly honest approach to her campaign,? said Mr. Mautino, who manages the last remaining steel foundry in the city, in the Lawrenceville neighborhood.",
    "Tuesday's contests are the latest in a series of May primaries that represent the biggest test yet of Donald Trumps post-presidential influence on the Republican electorate.",
    "Pennsylvania is the scene of late drama as both parties prepare to select nominees for an open Senate seat in one of the nations most politically competitive states.",
    "There is general frustration with state and local leaders, who are largely Democratic, over widespread homelessness and crime in nearby Portland and its outskirts.",
    "Because of once-in-a-decade redistricting, the district was redrawn to include large parts of central Oregon that Mr. Schrader didnt previously represent.",
    "Meanwhile, four of the six county Democratic parties in the district broke precedent this year and overwhelmingly voted to endorse Ms. McLeod-Skinner.",
    "Thats called constitutional voting.?\nIn the Senate race, Mr. Dlinn said he had been impressed by David McCormicks record and decided to vote for him.",
    "Several GOP candidates pulled out of the race and threw their weight behind Lou Barletta, a former Congressman and the former mayor of Hazleton, Pa.",
    "Democrats nationwide are facing resistance, amid weak approval numbers for President Biden and the party as they seek to keep control of Congress.",
    "Democrats nationally worry that Ms. McLeod-Skinner could be a weaker candidate in a general election because of her ties to the partys left.",
    "North Carolina: Rep. Madison Cawthorn, who has Mr. Trumps backing, is in a challenging race to stay in Congress after a series of blunders.",
    "Mr. Schrader is working to convince voters here that they shouldnt send someone new to Congress and instead elect him for an eighth term.",
    "Mr. Fettermans wife had urged him to go to the hospital on Friday after he wasnt feeling well, according to a statement released Sunday.",
    "Meanwhile, Ms. McLeod-Skinner, who lives near Bend, is well known in the community because of previous unsuccessful runs for office.",
    "On Saturday, Mr. Trump endorsed Doug Mastriano, a state Senator and retired Army colonel who had been at the top of polls for weeks.",
    "Mr. Mastriano has pushed unsupported claims of widespread fraud in the 2020 election and attended the Jan. 6 protest at the Capitol.",
    "Her rise has brought with it a new intensity of criticism from her rivals and even the partys biggest national figure, Donald Trump.",
    "Covid-19 restrictions have turned off some Democrats and fired up Republicans, who say the government infringed on their freedoms.",
    "Idaho: The states Republican governor is defending his seat against a challenge from the states Trump-backed lieutenant governor.",
    "Mr. Mautino, 57, said he decided to vote for Ms. Barnette on Tuesday morning before he went to his polling site in Squirrel Hill.",
    "The hope was that reducing a crowded field of candidates would enable Mr. Barletta to draw enough support to pass Mr. Mastriano.",
    "John Fetterman, said that he was recovering from a stroke that would keep him in the hospital at least through Election Day.",
    "Hes been a big friend of less government and more individual responsibility, and thats what Im looking for,? said Mr. Dlinn.",
    "She is also benefiting from endorsements in the final week of the primary campaign from two powerful conservative groups.",
    "Liberals say they are angry at Democrats in Washington, D.C., for not doing enough with their slim majority in Congress.",
    "Oregon: Rep. Kurt Schrader, a member of the centrist group known as Blue Dog Democrats, is running for an eighth term.",
    "Mr. Trumps support could give Mr. Cawthorn a last-minute boost while also testing the political power of Mr. Trump.",
    "On the Democratic side, John Fetterman is the front-runner but suffered a stroke last week and is now recovering.",
    "The Republican winner will face Josh Shapiro, the states attorney general who didnt have a primary challenger.",
    "John Fetterman said he was undergoing a procedure Tuesday to implant a pacemaker with a defibrillator.",
    "Mr. Shapiro is running on being a check against the states Republican majorities in the statehouse.",
    "He said Ms. Barnettes recent surge in the polls made him take a second look at her campaign.",
    "In Pittsburgh, Scott Mautino was among the group of late deciders in the GOP Senate primary.",
    "Republicans say this seat, which Mr. Schrader has represented for seven terms, is winnable.",
    "I know hes kind of middle-of-the-road and I know theres been a push to be less polarized.",
    "Mr. Dlinn said he was puzzled by Mr. Trumps endorsement of Mehmet Oz in that race.",
    "The Democratic race was shaken on Sunday when the front-runner, Lt. Gov.",
    "His challenger, Jamie McLeod-Skinner, is running to his political left.",
    "That was the swing in the gubernatorial,? said Mr. Mautino.",
    "Its a tactic that Im interested in,? Schindler said.",
    "Mr. Schrader has the endorsement of President Biden.",
    "The Senate campaign of Pennsylvania Lt. Gov.",
    "\"But Im not sure whats going on there.",
    "Hes incredible,\" said Mr. Dlinn.",
    "Hes been around a long time.",
    "Im a big Trump supporter.",
    "Big."
  ]
}