{
  "id": 6728,
  "mediaId": 21,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "RESULTS: Republican Doug Mastriano wins Republican primary in a crucial race for Pennsylvania governor",
  "image": "https://i.insider.com/6283a6714c737900196516f2?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/pennsylvania-governor-primary-doug-mastriano-live-results-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    1990,
    1997,
    3102,
    571,
    2597,
    2862,
    4936,
    5458,
    5461,
    5463
  ],
  "sentences": [
    "Adams\nAllegheny\nArmstrong\nBeaver\nBedford\nBerks\nBlair\nBradford\nBucks\nButler\nCambria\nCameron\nCarbon\nCentre\nChester\nClarion\nClearfield\nClinton\nColumbia\nCrawford\nAdams\nAllegheny\nArmstrong\nBeaver\nBedford\nBerks\nBlair\nBradford\nBucks\nButler\nCambria\nCameron\nCarbon\nCentre\nChester\nClarion\nClearfield\nClinton\nColumbia\nCrawford\nPennsylvania Governor Democratic Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n Josh Shapiro check_circle\n 781,926\n 100%\n* = Incumbent\n 781,926 votes.",
    "Mastriano's rise through a crowded field has prompted anxiety among Pennsylvania Republicans, who worry that his far-right views and ties to the Capitol riot and extremist groups could jeopardize the GOP's chances of flipping the state's governorship in the fall if he secures the nomination, NBC News and Politico reported.",
    "Pennsylvania Governor Republican Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n Doug Mastriano check_circle\n 364,860\n 43.70%\n Lou Barletta\n 181,522\n 21.74%\n William M McSwain\n 127,693\n 15.29%\n David White\n 65,907\n 7.89%\n Melissa Hart\n 38,253\n 4.58%\n Show More Candidates\n* = Incumbent\n 834,994 votes.",
    "On Thursday, just five days before the primary, state Senate President Jake Corman dropped out of the gubernatorial race and endorsed Barletta out of that exact fear, saying, \"The only way that we will not be successful in the fall is if we nominate someone who can't possibly win.\"",
    "In Pennsylvania, which is expected to see one of the most competitive governor's races of 2022, Republicans winning back the governorship would give them full control of the state government  and allow the governor to appoint the state's chief election official.",
    "He's also said he would sign a heartbeat-style abortion ban, implement constitutional carry for guns, ban \"Critical Race Theory and Gender Theory studies\" in Pennsylvania schools, and establish \"strike f0rce\" teams at every state agency to cut regulations.",
    "Mastriano, who was the definite frontrunner in the race, was elected to the state senate in 2018, but soon rose to prominence through his aggressive but unsuccessful role in the plot to overturn President Donald Trump's 2020 election loss in the state.",
    "Mastriano's election-related policy planks include eliminating no-excuse mail voting, which Pennsylvania enacted in 2019, and wiping all voters off the rolls and making them re-register to vote, which is illegal under federal law.",
    "The Republican primary contenders included state Sen. Doug Mastriano, former congressman and 2018 Senate candidate Lou Barletta, former federal prosecutor Bill McSwain, and wealthy businessman Dave White, among others.",
    "Mastriano has scant support from his fellow Pennsylvania lawmakers, but his work pushing the lie that the 2020 election was stolen earned him a last-minute endorsement from Trump just days before the election.",
    "Mastriano's efforts included organizing bus transport to the protests in Washington, DC, on January 6, 2021, and pushing for a partisan review of the 2020 election results in Pennsylvania.",
    "Mastriano has also tried to ban the press from his campaign events, which a CNN reporter recently circumvented by renting a room at a hotel where he held a rally in the courtyard.",
    "He's been subpoenaed by the House Select Committee investigating the January 6 insurrection about his role in seeking to overturn the election, but has so far refused to testify.",
    "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,\" Trump said in his endorsement statement.",
    "Attorney General Josh Shapiro all but cleared the field for the Democratic nomination, but a crowded and unpredictable field of Republicans remained in flux on Tuesday.",
    "Barnette has also barred the press from public events, often with those blocking media access declining to identify themselves as members of the campaign or security.",
    "The race and the stakes:\nDemocrats and Republicans faced off for the nomination to replace term-limited outgoing Democratic Gov.",
    "\"He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it.\"",
    "An aide who blocked press from a subsequent campaign event was also present near the Capitol on January 6, NBC News reported.",
    "On the day of the election, Real Clear Politics' polling average showed Mastriano leading the rest of the field by 14 points.",
    "Mastriano has been running as an unofficial ticket with Senate candidate Kathy Barnette in the Republican primaries.",
    "Follow Insider's live coverage of all of Tuesday night's primaries\n Sign up for notifications from Insider!",
    "Updated 5/17/2022, 7:34:46 PM\nWe're sorry but embeds doesn't work properly without JavaScript enabled.",
    "Updated 5/17/2022, 7:34:46 PM\nWe're sorry but embeds doesn't work properly without JavaScript enabled.",
    "But Pennsylvania Republicans rallying around Barletta at the last minute came too late.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Insider\nPennsylvania held primaries for a high-stakes gubernatorial race.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Tom Wolf in Pennsylvania, a critical battleground state.",
    "Stay up to date with what you want to know.",
    "Please enable it to continue.",
    "Please enable it to continue.",
    "Polls closed at 8 p.m.",
    "Estimated 74% in.",
    "Estimated 71% in.",
    "ET."
  ]
}