{
  "id": 6731,
  "mediaId": 558,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Jan. 6 rally attendee Doug Mastriano wins Republican primary for Pennsylvania governor",
  "image": "https://s.yimg.com/ny/api/res/1.2/ONwDI36PB0BbbiPTiWW61g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/ac194790-d648-11ec-b633-a29099b1790a",
  "link": "https://sg.news.yahoo.com/doug-mastriano-pennsylvania-republican-governor-primary-jan-6-015302631.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Wilson",
  "authorUrl": "https://www.yahoo.com/author/christopher-wilson",
  "termIds": [
    3102
  ],
  "sentences": [
    "PITTSBURGH  State Sen. Doug Mastriano, who attended the Jan. 6 Stop the Steal? rally and worked with former President Trumps legal team to overturn the 2020 election results, won the Republican governors primary in Pennsylvania Tuesday night.",
    "A 58-year-old former Army colonel, Mastriano won a special election in 2019 for a seat in south-central Pennsylvania, and came to prominence for his work with the Trump legal team in the aftermath of Joe Bidens presidential win.",
    "Mastriano organized a faux hearing? in Gettysburg where Rudy Giuliani promoted conspiracy theories about the election and was joined on the campaign trail by Jenna Ellis, another Trump lawyer who praised Mastrianos efforts.",
    "I followed those lines as they existed.?\nHes also been subpoenaed by the House committee investigating the events of the day, but said at a recent debate there were no legal issues stemming from his Jan. 6 activity.",
    "He introduced a six-week ban shortly after entering the Legislature and said during the gubernatorial campaign that he would ban the procedure without exceptions for rape, incest or the health of the mother.",
    "Advocates for fair elections are worried that if Mastriano is governor in 2024, he might attempt to obstruct the certification of the states Electoral College votes if a Democrat wins the race.",
    "Mastriano emerged from a crowded field despite late efforts from some Republican power brokers to stop him, concerned his positions would prove toxic in the November general election.",
    "In a May 2021 statement, Mastriano said, I followed the directions of the Capitol Police and respected all police lines as I came upon them.",
    "The nonpartisan Cook Political Report, which handicaps races nationwide, that Shapiro is now favored to win in November.",
    "Mastriano will face state Attorney General Josh Shapiro, who ran unopposed in the race to replace Democratic Gov.",
    "In Pennsylvania, the governor also selects the secretary of the state, who serves as chief elections officer.",
    "He spent part of the day on the Capitol grounds, although there is no evidence he entered the building.",
    "Even disingenuous internet sleuths know that police lines did shift throughout the course of the day.",
    "While all of the candidates running in the GOP primary said theyd restrict abortion access,.",
    "Mastriano helped arrange buses to the Jan. 6 rally that preceded the Capitol riot.",
    "Prior to Mastriano's victory, they had described the race as a toss-up.",
    "Those efforts were undercut by an endorsement Saturday from Trump.",
    "Tom Wolf, who is leaving office due to term limits."
  ]
}