{
  "id": 6732,
  "mediaId": 238,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Opinion Disturbing primary elections show how the GOP normalizes extremism",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/17/primary-elections-gop-normalizes-extremism/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Waldman",
  "authorUrl": "https://www.washingtonpost.com/people/paul-waldman/",
  "termIds": [
    3102
  ],
  "sentences": [
    "They may pour millions of dollars into TV ads, but instead of saying Candidate Smith is a dangerous extremist anyone would be ashamed to vote for,? they say, Candidate Smith once voted against a tax cut  can we really trust that hes a true Republican??\nThe same thing is happening with Barnette, who seems to have surged to the front in the Senate primary after Mehmet Oz and David McCormick bludgeoned each other for months over which one was the Trumpiest Trumper.",
    "This is how the party handles fanatics in its midst wherever they emerge: Because efforts to eliminate them are so tentative and ineffectual, not only do they sometimes win, but even when they dont, their ideas come to seem normal, even respectable.",
    "Some Republicans arent even seriously disavowing the racist great replacement theory,? which has been championed by Fox News host Tucker Carlson and motivated alleged mass shooters in Buffalo, El Paso and Pittsburgh.",
    "Its a story weve heard many times before: A candidate with dangerous ideas or a disturbing past emerges, the party establishment tries to figure out how to defeat them, and the establishment usually fails.",
    "It looks likely that after Tuesdays primary in Pennsylvania, the Republican nominees for governor and senator will both have been enthusiastic participants in the Jan. 6, 2021, protests at the Capitol.",
    "Thats not to mention his QAnon ties and Christian nationalist beliefs, which ought to be terrifying to anyone who believes in the pluralistic model of democracy that America was supposed to embody.",
    "Imagine if Republicans really went after the extremists in their midst  not because they might threaten the loss of a few key elections, but because it was the right thing to do.",
    "McGeachin is deeply enmeshed in the world of radical anti-government extremists; she speaks at events put on by notorious white nationalists and lunatic conspiracy theorists.",
    "Many in the Republican Party at the state and national level are deeply concerned about Doug Mastriano and Kathy Barnette becoming the nominees for governor and Senate.",
    "God calls us to pick up the sword and fight,? she has said, and Christ will reign in the state of Idaho.?\nTo repeat, McGeachin is the lieutenant governor of the state.",
    "Democrats do that all the time; influential people in their party are constantly attacking progressives and policing the boundaries of what they consider appropriate.",
    "The occasional conservative columnist might call it out, but when almost half of the partys voters believe it, what Republican is going to tell them theyre wrong?",
    "Hes no mere Stop the Steal? advocate; he has all but promised to give Pennsylvanias electoral votes to Donald Trump in 2024 no matter what the voters think.",
    "What those episodes have in common is that the establishment members attacks are almost always weak and halfhearted, as though theyre pulling their punches.",
    "The implicit message of all this is that the things that make candidates such as Mastriano and Barnette so dangerous arent anything to worry about.",
    "The effort was doomed before it even got started, and when Trump gave Mastriano his endorsement, it was probably the final nail in the coffin.",
    "Now Barnette is the subject of super PAC attacks  but they take some remarks out of context in an attempt to portray her as a liberal.",
    "And since the governor appoints the secretary of state in Pennsylvania, the two of them might be able to carry out an election coup.",
    "Their only ideas were to unite around another candidate or persuade some contenders to drop out of the race at the last minute.",
    "While a few lonely voices have called out her extremism, most criticism from the party has been careful and restrained.",
    "Brad Little, a very conservative Republican, is being challenged by his lieutenant governor, Janice McGeachin.",
    "Republicans will say that they dont agree with racist or conspiratorial ideas, and leave it at that.",
    "But that concern seems to begin and end with their potential vulnerability in the general election.",
    "Politico recently reported that Republican leaders in the state were plotting to stop Mastriano.",
    "The result is that extremism, hatred and a tolerance for violence spread throughout their party.",
    "Its now standard practice among Republicans to accuse any and all Democrats of being pedophiles.",
    "Though they did not engage in violence, both are election deniers and conspiracy theorists.",
    "Meanwhile, more and more deranged ideas move from the periphery to the center of the GOP.",
    "It doesnt seem to bother anyone in the party that they are both radical extremists.",
    "The other has a long history of rancid bigotry against Muslims and gay people.",
    "Which shows how such dangerous views are becoming normalized in the GOP.",
    "Unfortunately, you cant imagine it, because it almost never happens.",
    "When they decide to go after the left, they do it without mercy.",
    "Thats not likely to be persuasive to Republican primary voters.",
    "One is a Christian nationalist who campaigns at QAnon events.",
    "We see it in other places, too.",
    "And that puts us all at risk.",
    "In Idaho, incumbent Gov.",
    "Consider Mastriano."
  ]
}