{
  "id": 6757,
  "mediaId": 98,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Pennsylvania governors race could have outsize impact on abortion access",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/6d62ef6/2147483647/strip/true/crop/3000x2000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff9%2Fec%2F6522594645499ec24abf15d17f51%2Fap22105741325392.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-17/pennsylvania-kansas-governors-races-abortion-roe-wade",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arit John",
  "authorUrl": "https://www.latimes.com/people/arit-john",
  "termIds": [
    3102
  ],
  "sentences": [
    "But in a handful of states, particularly Pennsylvania and Kansas, the winner of the November gubernatorial races could have a significant impact, vetoing or signing into law abortion legislation that would affect millions of people of reproductive age both in their jurisdictions and in nearby states.",
    "Does it even bring in people who would, in previous years, be more challenging for a general election audience??\nThe 2022 midterm cycle seems poised to be a wave year for Republicans, who are banking on voters concerns over inflation, gas prices and the cost of groceries to help earn them votes.",
    "One of those bills, a six-week ban that would effectively block the majority of abortions, was introduced in the state Senate by Doug Mastriano, a candidate endorsed by former President Trump who is leading the field heading into Tuesdays Republican gubernatorial primary.",
    "Planned Parenthood Action Fund, NARAL Pro-Choice America and Emilys List announced this month that they plan to spend a combined $150 million on messaging and communication to promote candidates who support abortion rights, including in gubernatorial races.",
    "One day after the draft Supreme Court decision that would overturn Roe vs. Wade leaked, Pennsylvania Democrat Josh Shapiro declared that his bid to become governor was the only thing preventing Republicans from restricting abortion access in the state.",
    "My opponents would sign it.?\nIf the landmark 1973 Roe vs. Wade decision guaranteeing protection of abortion rights is overturned, abortion policy will be set by states, where Republicans hold the majority of legislatures and governorships.",
    "Gavin Newsom has deployed campaign ads in his reelection bid noting that a Republican opponent wants to roll back abortion rights,? messaging he also used in successfully fending off a GOP-led attempt to recall him from office last year.",
    "The chance of us winning back either chamber [of the state Legislature] in this coming election is almost nil,? said Ed Rendell, a former Democratic governor of Pennsylvania who also served as chair of the Democratic National Committee.",
    "Were expecting a hard-fought campaign, but were up for the challenge.?\nNearly half of the 7,849 abortions performed in Kansas in 2021 were for out-of-state residents, mainly from Missouri, according to the Kansas Department of Health.",
    "And in Pennsylvania, a swing state where the Democrats biggest problem is enthusiasm, the race may focus less on policy and more on the personality and character of the candidates if Mastriano wins Tuesdays primary, Blizzard said.",
    "Mastriano has become a controversial figure within his own party  Republicans launched an 11th-hour bid to coalesce around former Pennsylvania Rep. Lou Barletta, out of fears Mastriano is too conservative for the general election.",
    "Lawson said they are focused on protecting incumbent Democratic governors in Kansas, Michigan, Wisconsin, Minnesota and Nevada, flipping Republican-held seats in Georgia and Arizona, and helping Shapiro win in Pennsylvania.",
    "Kelly reaffirmed her support for abortion rights after the draft decision leaked, but has not portrayed her election as a battle over abortion rights in the same way Shapiro has ahead of the amendment vote.",
    "The next governor is going to have a bill on their desk that will restrict or outlaw abortion rights, and they will have a decision as to whether to sign it or veto it,? he told reporters this month.",
    "Meanwhile, Republican gubernatorial candidates have also sought to make abortion an issue in their races, aiming to paint themselves as the GOP contender most opposed to abortion in those primaries.",
    "The governors election will be Armageddon.?\nIn past cycles, abortion has been one of several issues to take root in close primaries and general elections, but has not always been a deciding factor.",
    "Governors in many states will truly be the backstop, protecting access to abortion as Roes power is reduced,? said Jenny Lawson, executive director of the super PAC Planned Parenthood Votes.",
    "That decision has blocked the Republican-controlled Legislature from passing laws to reduce abortion access, and would continue to allow abortions in Kansas even without a federal right.",
    "The question for Shapiro, Kelly and other gubernatorial candidates employing similar strategies is whether anger on the left over Roe will lead to more Democratic votes in November.",
    "Across the country, Democrats running for governor are hoping the possibility of Roe vs. Wade being overturned will drive concerned voters to turn out in competitive races.",
    "On Saturday, the former president endorsed Mastriano, who was among those who attempted to overturn President Bidens Pennsylvania win and the results of the 2020 election.",
    "This is going to be a good test, if some of these candidates make their way through the primary, to see not how big the wave is, but maybe how deep it is,? Blizzard said.",
    "Without Roe, new abortion restrictions in nearby states including Oklahoma, Missouri and Nebraska would likely lead more people to visit Kansas to terminate pregnancies.",
    "Even in states where Democrats would have a difficult time barring abortion restrictions passed this year or earlier, candidates have promised to block new bills.",
    "A proposal to strip the right from the state Constitution, called the Value Them Both? amendment by supporters, has been placed on the August primary ballot.",
    "We are laser-focused on Aug. 2,? said Brittany Jones, director of policy and engagement for Kansas Family Votes, part of the coalition behind the amendment.",
    "Robert Blizzard, a GOP pollster, said he isnt convinced the leaked decision is having that big of an effect on elections, especially at the national level.",
    "Of the seven states with toss-up governors races, four have Democratic governors and Republican legislatures: Pennsylvania, Kansas, Michigan and Wisconsin.",
    "In Kansas, where Blizzard worked on Kansas Republican Roger Marshalls successful Senate campaign in 2020, Marshall won on an antiabortion platform.",
    "In Pennsylvania, Shapiro released an ad tying Mastriano to Trump and claiming he wants to outlaw abortion.? Mastriano has said abortion is the No.",
    "Kelly hasnt really brought it up, but there isnt a need for her to bring it up,? said Christopher Reeves, a Democratic strategist based in Kansas.",
    "Its not swaying enthusiasm or interest level on either side.?\nAt the state level, Democrats ability to make abortion a central issue will vary.",
    "Shapiro, who is running in a swing state, and Kelly, who is campaigning in a red state, have approached abortion in different ways.",
    "Most polling that weve seen, privately as well as publicly, furthers that point, that its not swaying people to vote differently.",
    "While it is not an immediate issue right now, as the summer goes on it? will become the primary issue in the race, he said.",
    "Because there was no fear that Roe vs. Wade would go away, it was not an issue that most voters voted on,? he said.",
    "That plan hit a snag when Trump endorsed Mastriano, praising him for his opposition to the 2020 election results.",
    "Pennsylvania could also see an increase in out-of-state residents from Ohio and West Virginia seeking abortions.",
    "In Kansas, a 2019 state Supreme Court decision found that the state Constitution included a right to abortion.",
    "Democrats say voters on both sides of the abortion debate recognize the importance of the coming elections.",
    "The Democratic governors there, Gretchen Whitmer and Tony Evers, respectively, have opposed those bans.",
    "In Pennsylvania, where abortion is legal up to the 24th week of pregnancy, term-limited Democratic Gov.",
    "In 2002, Rendell beat Bob Casey, then state auditor general, in the Democratic primary for governor.",
    "If the amendment passes, the state Legislature would be able to approve new abortion regulations.",
    "Michigan and Wisconsin have pre-Roe laws on the books banning abortion that could be reinstated.",
    "Abortion rights groups backed Rendell, who supported their cause, over Casey, who did not.",
    "Tom Wolf has vetoed several bills that would have restricted abortion access.",
    "We believe that Kansans do not want to be a destination for abortion.",
    "Laura Kelly if they maintain their supermajorities in both chambers.",
    "Republicans would be able to override a veto from Democratic Gov.",
    "Rendell, however, credited his win to a host of other issues.",
    "In Pennsylvania, it will all come down to the governors race.",
    "This time around, people are going to be fanatical.?",
    "But thats, I think, where we are today,? he said.",
    "Gen. Derek Schmidt, has backed the amendment.",
    "Her likely Republican opponent, Kansas Atty.",
    "Things can change, things can shift.",
    "And in deep-blue California, Gov.",
    "I will, of course, veto it.",
    "1 issue of his campaign."
  ]
}