{
  "id": 6777,
  "mediaId": 147,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "2022 Pennsylvania Primary Election Results",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/2022-04-07T102011Z_1999694794_RC26HT9XR2HS_RTRMADP_3_USA-ELECTION-REPUBLICANS-REGISTRATION-1200x800.jpg",
  "link": "https://www.pbs.org/newshour/politics/2022-pennsylvania-primary-election-results",
  "sentiment": "0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.pbs.org/newshour/author/associated-press",
  "termIds": [
    1092,
    1622,
    1653,
    1770,
    1990,
    2491,
    3102,
    562,
    2862
  ],
  "sentences": [
    "He vowed to press forward despite the health setback, saying, Our campaign isnt slowing down one bit, and we are still on track to win this primary on Tuesday.?\nFetterman has led in polls and fundraising in a four-person field that includes U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "For Republicans, the race looked for much of the campaign like a two-man contest between celebrity heart surgeon Mehmet Oz, best known as the host of daytime TVs The Dr. Oz Show,? and former hedge fund CEO David McCormick.",
    "U.S. House 2022 Pa. Dem Primary\nU.S. House 2022 Pa. GOP Primary\nThe race to fill retiring Republican U.S. Sen. Pat Toomeys seat has been dominated by a huge primary field  with particular attention on the GOP candidates.",
    "They fear Mastriano, who has promoted Trumps lies of widespread election fraud in the 2020 election, is unelectable in November and likely to squander an opportunity to replace Democratic Gov.",
    "WATCH: Why a key Pennsylvania primary race could set the tone for candidates nationwide\nBut on Sunday, the focus was on the Democrats as Fetterman announced he was recovering from a stroke.",
    "In the governors race, some Republicans are wringing their hands over the prospect that a far-right candidate, state Sen. Doug Mastriano, could emerge as the winner in the crowded field.",
    "But several prominent conservative groups have gotten involved in the races final days, backing lesser-known conservative activist Kathy Barnette as an alternative.",
    "The 52-year-old said he went to the hospital on Friday after not feeling well and would remain there for a while for observation.",
    "On the Democratic side, the states two-term attorney general, Josh Shapiro, is unchallenged in his gubernatorial bid.",
    "A recent Fox News poll shows she is surging, just trailing Oz and McCormick.",
    "Tom Wolf, who is prevented by term limit laws from running again."
  ]
}