{
  "id": 6788,
  "mediaId": 881,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "A MAGA star is born",
  "image": "https://video-images.vice.com/articles/6282411f0fc6390094f1cca9/lede/1652704409805-untitled-design.png?crop=1xw:0.8427xh;0xw,0xh&resize=20:*",
  "link": "https://www.vice.com/en_us/article/pkpjp9/pennsylvania-republican-primaries-doug-mastriano-kathy-barnette",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "She also has along track record of homophobia, writing in a 2010 op-ed that the homosexual agenda? was immoral and perverse? and bent on domination.? In later statements she called Caitlyn Jenner deformed? and demonic? for being transgender, and claiming that many homosexuals LEAD with their sexual preference.?\nWhat is all this 11th-hour shit supposed to do??\nBoth Mastriano and Barnette are benefiting from crowded fields, where they can win with a much smaller percentage of the vote.",
    "(Michael M. Santiago/Getty Images)\nMAGA Doug Mastriano and Kathy Barnette both look poised to win, in what one GOP former congressman calls a double-nightmare scenario.?\nA pair of fringe conspiracy theorists have seized the momentum to be the Republican Partys nominees for governor and senator in Pennsylvaniaa prospect thats alarming to Republicans who think theyll lose the general election, and even more concerning for democracy if they win it in the nations largest swing state.",
    "There is some worry that somebodys going to win with well under 50% of the vote and after the primary were gonna find out we have a big problem.?\nStill, the national political environment is so toxic for Democrats that Mastriano and Barnette could win this fall, in spite of their extreme and conspiratorial views, putting one hardliner in charge of Pennsylvanias government and the other in the U.S. Senate, with a national platform.",
    "The national atmosphere is so bad for Democrats right nowBidens poll numbers are underwater nationally, and one Democratic strategist involved in a number of statewide races told VICE NEWS that theyre absolute dogshit just about everywhere? in the statesthat even with fringe conspiracy candidates like these two could have a shot in the general election in Pennsylvania, which Biden won by just 82,000 votes in 2020.",
    "Mastriano has repeatedly aligned himself with the QAnon conspiracy movement, including a recent appearance at a QAnon conference where he argued that America is a Christian nation, mocked this myth of the separation of church and state,? and promised the audience that he, and they, are taking our country back.?\nEvent organizers listed Barnette as a featured speaker for that event, but she didnt end up attending.",
    "Her rise came after Oz, McCormick, and their allies spent a combined $60 million on TV ads, much of it spent tearing each other down on what one GOP strategist called a murder-suicide.? Barnette has quietly skated by, spending less than $150,000 on ads while building her name ID with appearances on conservative outlets.",
    "She quickly connected with conspiracy theorists from across the country who were pushing false claims that there was evidence the election had been rigged, and went door-to-door in her district to try to prove it, while making numerous appearances on conservative TV shows to push false claims about the election.",
    "Shes made plenty of time for other controversies, though: Barnette has called Islam a theocracy? and said it should be banned in the U.S. comparing it to Nazism and Stalinism; claimed that pedophilia is a cornerstone of Islam?; and repeatedly pushed the lie that former former President Barack Obama is Muslim.",
    "The Democratic Governors Association is running a TV ad that calls Mastriano one of Donald Trumps strongest supporters? and highlights his fights to audit the 2020 Pennslyvania election and to outlaw abortion in the statepossible attack lines in a general election, but clear selling points in the primary.",
    "The Republican Governors Association has yet to reserve airtime in Pennsylvania, unlike many other swing states with governors races on the ballot this year, and sources tell VICE News that the organization is much less likely to spend significant resources in the state if Mastriano is the nominee.",
    "She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Partyand I will be behind her all the way.?\nBut its clear that Trump and his allies have lost a good chunk of the MAGA base in this race.",
    "But he quickly emerged as one of Trumps most steadfast toadies in the state, claiming without real evidence that President Joe Bidens 82,000-vote win in Pennsylvania was fraudulent, working to try to block Bidens election win from being certified, and later pushing for an Arizona-style audit.",
    "The environment is so good, I do think whoever wins, itd be a mistake for national strategists to look at this and say oh, the [general election] race is over,? said Pennsylvania GOP strategist John Brabender, whos working for one of Mastrianos opponents and isnt involved in the Senate race.",
    "Polling released early this week sent Republicans into a panic: Allies of both Oz and McCormick flooded journalists with haphazard last-minute opposition research dumps with some of Barnettes wildest comments, while national Republican strategists wincingly braced for impact.",
    "Barnette has rocketed up in the polls in recent weeks into a three-way statistical tie with TV doctor Mehmet Oz and businessman David McCormick, the races big-spending onetime frontrunners, according to recent public surveys as well as private polls shared with VICE News.",
    "Mastriano attended, too, and though he initially claimed that he didnt go beyond police lines? that day, video later emerged that appears to show him strolling toward the Capitol moments after rioters pushed police back from their initial line of defense.",
    "The seat is completely gone if shes the nominee,? warned one GOP strategist whos working for one of Barnettes opponents, comparing Barnette to Christine ODonnell, whose infamous Im not a witch? ad helped her blow a winnable Delaware Senate race in 2010.",
    "Barnette says on the stump and in her campaign bio that shes a former adjunct professor of corporate finance who worked for two major financial firms in corporate America,? but she and her campaign have refused to say where exactly she actually worked.",
    "Barnette has come out of nowhere in the race to replace retiring GOP Sen. Pat Toomey, and is suddenly in a three-way tie in the polls with the races two longtime frontrunners, Trump-backed TV doctor Mehmet Oz and businessman David McCormick.",
    "But their involvement in pushing and legitimizing conspiracy theories about the 2020 election got them on the radar of former President Donald Trump, made them local MAGA starsand gave them a real shot at winning their primaries.",
    "Despite desperate 11th-hour attempts to stop Mastriano and Barnette, Republicans involved in the race admit they both appear to have the edge heading into Tuesdays primaries, though Mastriano looks much more like a sure thing.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it.?\nDemocrats arent just hoping Mastriano will wintheyre airing ads for him.",
    "In the past week, two candidates who were polling in the single digits dropped out and backed Barletta, as did a bevy of establishment-leaning Republican congressmen and former Sen. Rick Santorum.",
    "If there's a Mastriano-Barnette ticket, everyone knows theres almost no path forward to winning the governors raceand the Senate seat is in great jeopardy too,? warned the former GOP congressman.",
    "Mastriano and Barnette have found common cause as the hardest of the hardcore MAGA conspiracy theorists, endorsing each other and regularly campaigning together across Pennsylvania.",
    "Mastriano, a state senator, is the clear front-runner to be Pennsylvanias GOP gubernatorial nominee, with a double-digit lead over his nearest opponents in a crowded field.",
    "Her surge is ominous to many Republicans who worry about losing the seat and facing a tougher path to Senate controlincluding Trump, who threw his support to Oz last month.",
    "(Aimee Dilger/SOPA Images/LightRocket via Getty Images) /\nKathy Barnette after speaking during a Republican leadership forum on May 11, 2022 in Newtown, Pennsylvania.",
    "Thats alarming to Republicans, who worry the pair may be fatally flawed candidates who will lose in November, in spite of a great political environment for the GOP.",
    "Barnette played a similar role: In 2020, she lost a House bid to Democratic Rep. Madeleine Dean in a heavily Democratic district by more than 20 percentage points.",
    "There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,? Trump said in a statement.",
    "Most polls have former GOP Rep. Lou Barletta, former U.S. Attorney Bill McSwain, and businessman Dave White are all bunched up in the mid-teens.",
    "They both made their names in politics by pushing wild conspiracy theories, including unfounded claims that Democrats rigged the 2020 election.",
    "The long knives are coming out at this point, and I had the best day of my life today,? Barnette gleefully said at a Thursday night rally.",
    "The right-wing Club for Growth has sprung into action to help her, making a last-minute $2 million ad buy to boost her campaign this week.",
    "Kathy Barnette will never be able to win the General Election against the Radical Left Democrats,? Trump warned in a Thursday statement.",
    "Fox News host Sean Hannitys Friday tweet promoting a segment about how Barnette cant win was quickly ratioed by right-wing activists.",
    "Pennsylvania GOP gubernatorial front-runner Doug Mastriano and surging GOP Senate candidate Kathy Barnette have a lot in common.",
    "Theres plenty left to find out about Barnetteincluding details of some basic claims she makes in her own campaign biography.",
    "Mastriano has maintained a steady lead in public and private polls, even though hes never been above 30% in a survey.",
    "What is all this 11th-hour shit supposed to do?? asked one national Republican whos keeping close tabs on the race.",
    "Both were in Washington to support Trump and to protest Congress certification of Bidens election win on Jan. 6.",
    "The Pennsylvania Republican establishment is mounting a desperate last-minute attempt to stop Mastriano.",
    "A lot of the party leadership is in full panic mode,? one Republican former congressman told VICE News.",
    "We have a double-nightmare scenario where two fringe candidates could emerge as the nominees.",
    "And all that effort was likely knocked back by the GOPs most important endorsement.",
    "And they both have strong chances to win their primaries on Tuesday.",
    "But Republicans are hoping they dont have to find out the hard way.",
    "Until the 2020 election, Mastriano was a back-bench state senator.",
    "They were both in Washington during the Jan. 6 Capitol riot.",
    "Barnette organized two buses to bring people to the rally.",
    "Doug Mastriano speaks to his supporters in Wilkes-Barre.",
    "Trump threw his support to Mastriano Saturday morning.",
    "The pair were little-known activists until recently.",
    "Want the best of VICE News straight to your inbox?",
    "And the pair have a long history of controversy.",
    "Its probably too little, too late.",
    "To this day, she hasnt conceded.",
    "But theyre not fully vetted.",
    "Sign up here."
  ]
}