{
  "id": 6790,
  "mediaId": 157,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Republicans are already accepting defeat in Pa. governor's race -- and are looking for someone to blame",
  "image": "https://www.rawstory.com/media-library/a-major-gop-group-is-ditching-bill-mcswain-joining-a-last-ditch-effort-to-help-lou-barletta-stop-doug-mastriano.jpg?id=29807401&width=1200&coordinates=0%2C133%2C0%2C133&height=600",
  "link": "https://www.rawstory.com/doug-mastriano-republican-party-failures/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    3102
  ],
  "sentences": [
    "So hats off to the party leadership for actually taking that bold stand.?\nALSO IN THE NEWS: Mysterious US Army PSYOPS recruiting video has critics scratching their heads -- and wondering about its real intent\nMeanwhile, in the U.S. Senate race, Kathy Barnette has seen a dramatic rise in popularity as the top two Republican men outspend her multiple times over.",
    "Politico reported Monday that the Republican Party is anticipating that they'll lose the seat with Mastriano as the candidate and they're looking for someone to blame for a loss that is still nearly six months away.",
    "\"She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Party  and I will be behind her all the way.\"",
    "Kulback added that Tabas should resign, and that calls for him to do so are, among insiders, very widespread.?\nOn the other side, however, Mastriano is furious that the party isn't doing enough to help him.",
    "The Pennsylvania governor's race has one major problem that Republicans are suddenly starting to understand: The top GOP candidate has little chance of being elected to the seat.",
    "At the end of 2021, the University of Massachusetts at Amherst did a poll where they asked Republican voters about their support for pieces of the far-right ideology in the GOP.",
    "Fringe candidate Doug Mastriano has been enthusiastically endorsed by former President Donald Trump and appears likely to prevail in the primary on Tuesday.",
    "The theory is that he is responsible for not forcing a more mainstream candidate on the party instead of letting the far-right leader rise to the top.",
    "Trump doesn't support her because they didn't think she could appeal to all voters in the general election, he explained in a statement last week.",
    "And so truly, we have an opportunity in Pennsylvania where the people can make a vote without influence from the state party apparatus.",
    "This is the first time in 44 years that the state party has not endorsed a candidate for governor,? he told Newsmax on Monday.",
    "That leaves an overwhelming majority of 79 percent of Republicans who believe that the election was stolen from Trump.",
    "The Washington Post did an April 2021 poll that showed that 19 percent of Republicans believed Trump won the election.",
    "We need to look at reorganization.?\nBut the polls show that Mastriano is nothing more than a reflection of the GOP.",
    "\"Kathy Barnette will never be able to win the General Election against the Radical Left Democrats,\" he lamented.",
    "Hes the one in charge, so its up to him to figure this out,? said Cambria County GOP chair Jackie Kulback.",
    "Some Republicans are calling for the state's Republican Party chairman, Lawrence Tabas to resign.",
    "The winner of the GOP primary will likely face Josh Shapiro, the state attorney general.",
    "Just 21 percent of Republican voters agreed that Joe Bidens victory was legitimate.",
    "Honestly, as a state party, we need to reevaluate our entire organization.",
    "His poll numbers statewide, however, don't appear to be as successful.",
    "But it isn't just Tabas who led to Mastriano's success.",
    "What's more, the number hasn't changed much.",
    "At this point, Lawrence needs to own it.",
    "He didn't cite any examples."
  ]
}