{
  "id": 6791,
  "mediaId": 558,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Abortion rights: how a governors veto can protect womens freedoms",
  "image": "https://s.yimg.com/ny/api/res/1.2/deG8EQNkglUjtda5hjGINA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/MFwxdid1QcSL7UbOKD3dVA--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/theguardian_763/784f5398100e35c89d428cbf71bce513",
  "link": "https://sg.news.yahoo.com/abortion-rights-governor-veto-protect-070053602.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joan E Greve",
  "authorUrl": "",
  "termIds": [
    1713,
    3102,
    5265,
    143,
    428,
    2732,
    2791,
    2862,
    2945
  ],
  "sentences": [
    "The likely end of Roe has raised the stakes in gubernatorial races with candidates stressing on the urgency of the moment\nIf the US supreme court follows through with its initial decision to overturn Roe v Wade next month, 26 states are certain or likely to ban abortion.",
    "In published last week, Whitmer warned that it would be nearly impossible to repeal the 1931 ban with Republicans controlling the Michigan legislature, and she underscored the need for Democrats to use every tool at their disposal to protect abortion rights.",
    "Some of the toss-up states holding gubernatorial races this year  including Michigan, Wisconsin and Arizona  already have abortion bans on the books that predate Roe, and Republicans have called for their enforcement if the court reverses the landmark case.",
    "The leaked draft opinion overturning Roe v Wade makes one thing clear  the future of reproductive rights will be defined at the state level,? said Christina Amestoy, senior communications advisor for the Democratic Governors Association.",
    "The probable end of Roe has raised the stakes in gubernatorial races across the country, particularly in states with Republican-led legislatures that would probably move to ban abortion unless a Democratic governor steps in.",
    "Who sits in the governors office will determine a womans ability to access abortion.?\nSince the courts draft opinion was made public, Republican gubernatorial candidates views on abortion have come under renewed scrutiny.",
    "Democrats are also paying close attention to gubernatorial elections in battleground states where Republicans currently control both the governors mansion and the state legislature, such as Georgia and Arizona.",
    "In Kansas and Pennsylvania, the sitting Democratic governors have both previously vetoed bills restricting abortion access, and those proposals would probably be enacted if a Republican took control.",
    "State senator Doug Mastriano, who ahead of the Tuesday primary, said at a recent debate that he would oppose any exceptions to an abortion ban, such as for rape, incest or the safety of the mother.",
    "If the supreme court does indeed overturn Roe next month without other federal protections in place, individual states policies will soon dictate if and how Americans can access abortion.",
    "Democratic gubernatorial candidates are now stressing the urgency of the moment to voters, portraying themselves as the last line of defense against an abortion ban in their states.",
    "Four states with Republican-controlled legislatures and Democratic governors  Kansas, Michigan, Pennsylvania and Wisconsin  are holding gubernatorial races in November.",
    "A survey last week showed 26% of Americans named economic policy as their most significant concern for the midterm elections, making it the most common response.",
    "Josh Shapiro, the presumptive Democratic gubernatorial nominee in Pennsylvania, has already cut warning that Mastriano wants to ban abortion? if elected.",
    "If the supreme court overturns Roe and Republicans have full control of the state government, abortion bans in those states will become all but certain.",
    "Polls show that the probable end of Roe has certainly caught voters attention, although many Americans remain more focused on economic issues like .",
    "Last Wednesday, Senate Republicans and Democrat Joe Manchin a bill that would have codified Roe and secured abortion rights at the national level.",
    "Drawing that contrast is even more important for Democratic gubernatorial candidates with federal abortion legislation stalled in Congress.",
    "In Pennsylvania, all four leading Republican gubernatorial candidates have indicated they would support some form of an abortion ban.",
    "But abortion was cited almost as often, with 25% of Americans selecting it as their top priority when appraising candidates.",
    "For those who want to protect abortion rights, a governors veto pen is about to become all the more powerful."
  ]
}