{
  "id": 6794,
  "mediaId": 157,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Revealed: GOP's Kathy Barnette paid for 3 busloads of Jan. 6 'patriots' for '1776 moment'",
  "image": "https://www.rawstory.com/media-library/kathy-barnette-campaign-website.png?id=29802835&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/kathy-barnette-2657332674/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    3102
  ],
  "sentences": [
    "This comes after NBC News confirmed that Barnette was photographed marching toward the Capitol on January 6 with members of the extreme-right Proud Boys, some of whom were charged with trespassing in the Capitol and assaulting police officers.",
    "Other candidates challenging Barnette for the Senate nomination include Dr. Mehmet Oz, a controversial daytime TV show host who has Trump's endorsement, and David McCormick, a former Treasury Department official and hedge fund executive.",
    "Doug Mastriano, the Trump-backed frontrunner for the gubernatorial nomination, also paid to bus people to the Capitol on January 6 and was on the complex during the attack, but denies actually participating in the attack himself.",
    "\"Calling it 'our 1776 moment,' Barnette promised those attending the rally would make their voices heard, according to previously unreported comments from the time reviewed by CNN's KFile,\" reported Andrew Kaczynski and Em Steck.",
    "\"'You're gonna see a bunch of pissed off patriots that are like, 'We're not having this anymore,'' Barnette told radio host and conservative activist Ed Martin on January 5, 2021,\" said the report.",
    "Barnette, who has called for abolishing Islam and claimed transgender people are \"deformed,\" is not the only major Pennsylvania GOP candidate with apparent ties to the Capitol insurrection.",
    "On Monday, CNN revealed that Kathy Barnette, the rising dark horse candidate for Pennsylvania's Republican Senate nomination, paid to bus people to D.C. on January 6, 2021.",
    "Democrats are used to, you know, being loud, whining, calling us names and then our side of the aisle, simply roll over and play dead.",
    "I am so proud that there are an innumerable number of Americans who are just like, no, we are not rolling over.",
    "Barnette denies any affiliation with the Proud Boys and denies having entered the Capitol herself.",
    "\"In another interview before the rally, Barnette said she helped bring three buses to Washington.\"",
    "And so I'm so very grateful that Americans are not rolling over.",
    "\"'You're gonna have to hear our voices.",
    "You're gonna have to hear us.'\"",
    "We're not going back to sleep."
  ]
}