{
  "id": 6798,
  "mediaId": 157,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Doug Mastriano aide uncovered as Jan. 6 protestor after he blocks press from weekend campaign event",
  "image": "https://www.rawstory.com/media-library/trump-backers-look-to-last-stand-protest-on-january-6.jpg?id=25062534&width=1200&coordinates=0%2C51%2C0%2C51&height=600",
  "link": "https://www.rawstory.com/doug-mastriano-aide-january-6/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    3102
  ],
  "sentences": [
    "The report by NBC News explained that they combed through aide Grant Clarkson's social media and photos and videos from the Jan. 6 attack on the U.S. Capitol and were able to make a clear match.",
    "Over the weekend, an aide to far-right gubernatorial candidate Doug Mastriano blocked press members from entering an event with Mastriano and GOP Senate candidate Kathy Barnette.",
    "Clarkson's name hasn't been cited among the activist groups tracking participants who have been indicted for their behavior during the insurrection.",
    "\"I, uh, don't recall smashing any cameras,\" Clarkson said when asked why he was smiling watching media equipment be destroyed outside the Capitol.",
    "A childhood friend of Clarkson's was along for the ride, the report said, and that person did breach the Capitol, pushing officers.",
    "A site that tracks congressional salaries shows Clarkson as a Congressional intern for Rep. Dan Meuser (R-PA) and Rep.",
    "\"You're clearly going to put my name out there, and probably some photos of me,\" Clarkson said.",
    "There's no evidence that Clarkson entered the Capitol and he has denied entering the building.",
    "At the time of the attack, Clarkson was no longer an intern nor was he a staffer in Congress.",
    "The friend hasn't been indicted either, the report said.",
    "Guy Reschenthaler (R-PA) until May 13, 2020."
  ]
}