{
  "id": 6813,
  "mediaId": 195,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Reprehensible: Oz condemns GOP opponents tweet on Islam",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/f99545a092f74da5bebd3f43209a9cf8.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/news/campaign/3488709-reprehensible-oz-condemns-gop-opponents-tweet-on-islam/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "In an interview, he took issue with a 2015 tweet from Barnette in which she wrote that Pedophilia is a Cornerstone of Islam.?\nOz, who would be the nations first Muslim senator, described the comments as disqualifying.?\nIts reprehensible that she would tweet out something that is defamatory to an entire religion,? Oz told The Associated Press.",
    "In my case, those disagreements often come about because, as a doctor, Ive dealt with issues that threaten the life of the mother.?\nOz saved his most pointed criticism for Barnette, however, echoing Trumps concerns that her background hasnt been properly scrutinized.",
    "For months, the race for the Republican nomination for Pennsylvanias open Senate seat has been an expensive fight between former hedge fund CEO David McCormick and Oz, who have spent millions of dollars attacking each other on television.",
    "But I think its disqualifying to make Islamophobic and homophobic comments, not just for the general election, but the Republican primary as well.?\nAssociated Press writer Marc Levy in Harrisburg, Pa., contributed to this report.",
    "When asked to clarify his views on abortion in the Saturday interview, Oz distanced himself from Trumps newly minted pick for Pennsylvania governor, Doug Mastriano, a far-right conservative who has called abortion the No.",
    "After spending much of the campaign steering clear of fellow Republican Senate contender Kathy Barnette, Oz on Saturday said she was out of step with the GOP and would be unable to win the general election in November.",
    "CARLISLE, Pa. (AP)  Republican Senate hopeful Mehmet Oz is stepping up his criticism of far-right candidates in Pennsylvania who are gaining traction ahead of Tuesdays primary election.",
    "Oz described himself as pro-life,? but said he would prefer an abortion ban in Pennsylvania that would include exceptions for rape, incest and the life of the mother.",
    "1 issue.? In a recent televised debate, Mastriano said he supports banning abortion from conception, with no exceptions for rape, incest or the life of the mother.",
    "But in the final days of the Republican primary, a third candidate  Barnette, a conservative commentator who has courted hard-line pro-Trump groups  has emerged.",
    "Im proud as a Pennsylvanian to uphold those founding beliefs that every faith has its merits.?\nThe Barnette campaign did not respond to a request for comment.",
    "With the election just days away, polls show a tight three-way race with a sizable number of undecided voters who could sway the results next week.",
    "Oz has won Trumps endorsement in the Senate contest, although some Trump supporters continue to question his conservative credentials.",
    "Earlier in the week, Barnette told NBC News that she did not make the statement, which was still live on her Twitter feed on Saturday.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He lashed out at her previous comments on Islam, noting that she also has a history of anti-gay remarks.",
    "McCormick grew up in the state, while Oz went to medical school there and was married in Philadelphia.",
    "There are times when we disagree with other pro-life advocates,? Oz told the AP.",
    "Trump himself has warned that Barnettes background hasnt been properly vetted.",
    "Each has also faced questions about their ties to Pennsylvania.",
    "Every time she answers a question, she raises more questions.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "This state was based on religious freedom.",
    "We know so little,? Oz said."
  ]
}