{
  "id": 6817,
  "mediaId": 25,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Full transcript of \"Face the Nation\" on May 15, 2022",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/15/5019c6c4-ce5e-4308-9683-f5164eaa63d2/thumbnail/1200x630/93d7894bc947d1ef81e985e2099a6cbc/0515-ftn-pg2-1011648-640x360.jpg",
  "link": "https://www.cbsnews.com/news/full-transcript-of-face-the-nation-on-may-15-2022/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "And this is the most important thing I think we need to take a hard look at right now, when we're fighting inflation with everything that we've got, that we made the case to lower the cost of insulin to $35 and faced basically unified Republican opposition, tried to lower the cost of prescription drugs, and were blocked from doing so by congressional Republicans, who then come around and want to talk about inflation, without offering a plan.",
    "MARGARET BRENNAN: Let's talk about that because I want to...\nSECRETARY PETE BUTTIGIEG: And we're making the case for that to happen...\nMARGARET BRENNAN: I want to ask you about what the administration thinks in regard to what some congressional Democrats, like Senator Warren -- Speaker Pelosi also says she's putting forward a bill about price gouging by companies and banning unconsciously excessive pricing.",
    "The overhang of allegations of data falsification are going to be the kinds of allegations that are hard for the agency to clear, even if they're not able to prove a causal relationship between the infections that we saw in children and the facility itself, which -- which, so far, the agency hasn't been able to prove, and they may never be able to prove that.",
    "And this would be a good day for every politician in this country left, right and center, every media figure in this country, left, right and center, to come out and unequivocally condemn white nationalism, so-called Replacement Theory, and any other hateful ideology that could have contributed to something like this, before it happens again.",
    "But Oz has since struggled to fend off two challengers, retired hedge fund manager David McCormick, whose wife, Dina Powell, served in the Trump administration as a deputy national security adviser, and hard right candidate Kathy Barnette, whose fiery and deeply personal message on abortion has caught fire with grassroots conservatives.",
    "But, to your question, yes, I think the January 6 Committee needs to get to the bottom of the truth of what happened on January 6, the events leading up to it, and understand it, so, we -- there is a degree of kind of accountability, and, second, we have lessons learned to make sure it doesn't happen again.",
    "I do believe that cases will continue to come down -- wastewater data collected by cities does show overall cases coming down -- and that we shouldn't have a big wave of infection this summer, although there are models floating around the administration that does show a big wave of infection this summer.",
    "(End VT)\nCHARLIE D'AGATA: British military intelligence reports that, despite that kind of bombardment, Russia has failed to achieve substantial territorial gains in the past month, and it's likely Russia has lost around a third of the ground forces it committed to the invasion of Ukraine -- Margaret.",
    "So I'm calling on social media platforms to be making sure that they're doing a better job monitoring the hate speech that's out there, especially when it's directed against populations and comes under the guise of white supremacy terrorism, which is exactly what happened here in Buffalo.",
    "And I write about in the final days, I had this private meeting with the head of the National Guard and General Milley, and I talk about what might or might not happen the day after the election, concern that there may be the use of the military somehow to influence the outcome.",
    "As you know, I joined my other -- the living secretaries of defense, wrote an op-ed on January 3, three days prior to the transition, expressing our concern about the peaceful handover of power and warning the Pentagon, if you will, about the importance of them doing their duty.",
    "MARGARET BRENNAN: But -- so you reject the idea of a summer surge, even though scientists like Dr. Birx, who was on this program just a few weeks ago, is predicting and seeing a trend line that makes her very concerned that could happen, because it's happened before?",
    "We are certainly saddened that someone drove from hundreds of miles away, someone not from this community, that did not know this community, that came here to take as many black lives as possible, who did this in a willful, premeditated fashion, planning this.",
    "And they've said they have in their possession a draft executive order that would have had the then-defense secretary seize voting machines, and that the Department of Justice and the Pentagon would then be involved somehow in stopping the transfer of power.",
    "That said, after all of these mass shootings that have taken place in this country for different reasons, year in and year out, month in and month out, week in and week out, let Buffalo, New York, be the last place that this kind of mass shooting happens.",
    "And in your book, you write General Milley actually had an agreement with the other members of the Joint Chiefs, the lead military commanders in the country, to all resign if President Trump tried to use the military to stop the transfer of power.",
    "It's because I wanted to be there on the spot if any of these things happened to be the circuit-breaker, because the only two people in the United States that can deploy troops, U.S. military troops, are the president and the secretary of defense.",
    "It looks like most of the people who are getting infected aren't people who were previously infected with B.1, but some portion of the 40 percent of people who escaped the prior wave of Omicron and are now getting caught by this current wave.",
    "We also want them to be more vigilant and use the resources they have to hire more people, change their algorithms, be able to identify the second that this hate speech appears, and let there be a determination by law enforcement quickly.",
    "(Begin VT)\nMARGARET BRENNAN: A senior administration official told our CBS' David Martin that, in a meeting at the White House on Monday morning, the president demanded that 10,000 active-duty troops be ordered into American streets.",
    "(Begin VT)\nROBERT COSTA (voice-over): Top Republicans are flocking to Pennsylvania in the final days of the state's red-hot Senate primary race, knowing the state will be a crucial battleground in this November's midterm elections.",
    "But, at the same time, it doesn't provide stringent enough oversight of the resulting oligopoly -- three companies control 80 percent of the market -- to ensure that there's no snafus that can cause shutdown of those facilities.",
    "And another issue may be that the people who the whistle-blower has implicated -- and FDA has interviewed that whistle-blower -- may be the same people now making representations to the agency about the safety of that facility.",
    "It's why we up the fuel economy standards, so that, by the 2026 model year, the cars will be so much more efficient, if you have a gas car, that you -- if you used to have to fill up four times a month, it might be three now.",
    "By the way, this is an issue the president has been talking about in area after area after area, whether we're talking about fertilizer, whether we're talking about other things in our agriculture sector, or more generally.",
    "All I know is, the way we defused this is Bill Barr, to his credit, because he was a good partner on this stuff, put forward 5,000 law enforcement officers, and I put forward up to 5,000 National Guard to take care of this.",
    "SECRETARY PETE BUTTIGIEG: Well, look, the administration acted from day one after the recall, taking steps like creating more flexibility for the WIC program to help rebalance the availability of formula in the States.",
    "This has been an under-resourced part of the agency for a very long time, and that's contributing, I think, to these challenges that the agency is facing, trying to exert more vigorous and more efficient oversight.",
    "I think, like many of us, I figured the president would -- would challenge the election, like others have done in the past, and, after a few weeks, it would be over, and we'd have a peaceful transition of power.",
    "MAYOR BYRON BROWN: We're a midsize American city of over 278,000 people, and this part of the city, 80 percent African-American, but diverse, with people of many different backgrounds living in this community.",
    "But this is the difference between a supply chain problem, in other words, a problem about moving goods around, and a supply problem, which has to do with whether they're being produced in the first place.",
    "Kathy Hochul\nBuffalo Mayor Byron Brown\nDr. Scott Gottlieb\nLloyd Blankfein, senior chairman of Goldman Sachs\nMark Esper, former defense secretary\nClick here to browse full transcripts of \"Face the Nation.\"",
    "And like millions of Americans, we've been rooting around stores, checking online, getting in touch with relatives in other places where they don't have the same shortages to see what they can send over.",
    "You just heard the administration's view that this baby formula shortage is really the failure of one company here and that the FDA isn't necessarily fully responsible for ensuring things at that plant.",
    "The suspect, 18-year-old Payton Gendron, is believed to have posted a hate- filled manifesto shortly before the shooting, which he also livestreamed on the social media platform Twitch, authorities say.",
    "NANCY CHEN: That's when police say he encountered a retired police officer working as a security guard, who fired multiple shots that hit the gunman, but didn't impact him because of his tactical gear.",
    "And while we're talking about this in the macro sense, overall, for individuals and certainly the individuals at the bottom quartile of the pie sharing, it's going to be quite difficult and oppressive.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Watch the CBS Evening News With Norah O'Donnell tomorrow night for an exclusive interview with the president of the company that makes the Enfamil formula for babies.",
    "And on Saturday at what was billed as her final campaign rally, Barnette spoke to supporters in Bucks County alongside Doug Mastriano, who was endorsed hours earlier by Trump in the race for governor.",
    "We have a lot to get to today, but we begin with breaking news from Buffalo, New York, where an 18-year-old male is in police custody following a mass shooting that killed 10 and injured three others.",
    "DR. SCOTT GOTTLIEB: Yeah, and there is a model that the White House was briefed on last week that shows a big surge of infection in the summer driven by B.2 as it moves into the Midwest and the West.",
    "And some companies have become ridiculously profitable, notably including oil companies, which have specifically said they're not going to use the permits and the production capacity that they have.",
    "I think that's probably the pattern we're going to see again, where June and July are relatively low, people do feel safe again, and then, as we head into the late summer...\nMARGARET BRENNAN: Yeah.",
    "The agency had a 34-page whistle-blower report in hand making pretty serious allegations that there was data falsifications information -- data falsification information withheld from inspectors.",
    "And one of those companies, a company which, by the way, seems to have 40 percent market share, messed up, and is unable to confirm that a plant, a major plant, is safe and free of contamination.",
    "MARGARET BRENNAN: Are you concerned that, if the former president stands for election, that he will surround himself with people who you are deeply critical of who didn't try to short-circuit?",
    "ROBERT COSTA: OK.\nTrump has been watching her rise carefully, and warned his supporters to stick with Oz, arguing Barnette, if nominated, will -- quote -- \"never be able to win in November.\"",
    "ROBERT COSTA: But once polls in recent days showed Barnette jumping into the top tier, she also faced new and intense scrutiny of her past, including homophobic and anti-Muslim statements.",
    "And we need to make sure that we root out that kind of hate and, by the way, that we have a conversation about the availability of the kind of tactical weaponry that he seems to have had.",
    "Of course, we're also working to make electric vehicles more affordable, because that has a huge benefit, especially in terms of protecting families from these kinds of price volatility.",
    "And it was a little bit of fighting the last war, in some ways, because, in the financial crisis, you recall, the feeling in the aftermath was it took a long time to recover from that.",
    "And it's mostly a wave of infection driven by B.2 and this new Omicron variant, B.2.12.1 that appears to be more contagious and have more immune escape than prior variants of Omicron.",
    "I want to ask you about COVID, but just to pick up on something you said, I think you told me there are only nine people who oversee the entire baby formula industry in this country.",
    "Well, voters in five states head to the polls for midterm primary elections this Tuesday, and those contests will determine which party candidates will be on the ballot in November.",
    "DR. SCOTT GOTTLIEB: And that facility probably should have been inspected, especially -- when I was in office -- especially given the fact that there had been prior findings there.",
    "But standing here, looking at the size of this crater in the middle of a dirt road in a quiet residential neighborhood, it's hard to know exactly what the Russians were aiming for.",
    "You were in the Oval Office with the president and he spoke about a very specific number, 10,000, of active-duty troops potentially being sent into the streets of Washington, D.C.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Well, first, let me extend my condolences, by the way, to the families and friends of those tragically murdered yesterday in Buffalo.",
    "MARGARET BRENNAN: But should there be a federal statute that elevates things when those terms you just threw out there -- should there be an association directly with terrorism?",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Former Secretary of Defense Mark Esper is out with a new book called \"A Sacred Oath,\" which chronicles his time in the Trump administration.",
    "SECRETARY PETE BUTTIGIEG: Look, one thing that we know is that we're in this moment, right, where we're feeling -- Americans are feeling the pinch on product after product.",
    "And so, when you do have a shutdown, when the market's that concentrated, it creates these distributed shortages that we're seeing right now that are very hard to resolve.",
    "GOVERNOR KATHY HOCHUL: Well, we are taking proactive measure to make sure that we're monitoring all social media platforms, because this -- this information was out there.",
    "You've also said that the shooter had been at one point under the surveillance of medical authorities because of past comments he had made about carrying out a shooting.",
    "GRADY LEWIS (Witness): When I first saw him shooting, he shot a woman, he shot a deacon, he shot another woman, and then he went in the store and started shooting again.",
    "but you did say recently that, after the events of January 6, which took place when you were out of office, that you now consider President Trump a threat to democracy.",
    "LLOYD BLANKFEIN: ... a very long time of the globalization of the economy, which made goods and services cheaper because we took advantage of cheap labor and countries.",
    "So this individual is not going to see the light of day again, whether it's under federal prosecution or state under our domestic terrorism laws or just murder one.",
    "(Begin VT)\nCHARLIE D'AGATA (voice-over): Finland today formalized its intention to apply for NATO membership, with Sweden likely to follow suit in the days ahead.",
    "MEHMET OZ (R-Pennsylvania Senatorial Candidate): I called Kathy Barnette a mystery, because, every time she answers a question, she raises a bunch more questions.",
    "SECRETARY PETE BUTTIGIEG: A plant shutting down because a company can't assure that it is physically safe from contamination is the responsibility of the company.",
    "SECRETARY PETE BUTTIGIEG: Which is exactly why, again, from day one after the recall...\nMARGARET BRENNAN: This isn't just a private sector problem, is my point.",
    "(VERA KUSOLOPENKO SPEAKING IN FOREIGN LANGUAGE)\nCHARLIE D'AGATA: But the shelling continues; 67-year-old Vera Kusolopenko lost everything to a Russian missile.",
    "President Biden referred to it as an act perpetrated in the name of white nationalist ideology, and he has called for an end to hate-fueled domestic terrorism.",
    "GOVERNOR KATHY HOCHUL (D-New York): To see that sense of security shattered by an individual, a white supremacist, who has engaged in an act of terrorism.",
    "And so we're very concerned about what other information is perpetrated out there on social media platforms and are out there being disseminated globally.",
    "Of course, if you go through my story, you'll understand that the president calls over to the Pentagon earlier that morning and talks about 10,000 troops.",
    "I know that you are the first African-American mayor of Buffalo, which, as a city, has been called very segregated, if not one of the most in the country.",
    "And it's going to be important to learn whether or not the new -- newly formulated vaccines that are now in development will cover this B.2 variant well.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: I had a lot of concern about what might or might not happen in the months leading up to the election, right?",
    "LLOYD BLANKFEIN: Well, how good do we feel, with what we've learned to be relying -- and this as part of your last talk with -- with Secretary Buttigieg.",
    "They're going to have to curtail, hopefully reduce the number of positions that are unopened, because they -- and increase the size of the labor force.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Well, I'm -- yes, I'm trying to kind of give him his 10,000 without giving him 10,000 active-duty troops.",
    "SECRETARY PETE BUTTIGIEG: No, what we're asking Americans to do is to obviously recognize that we're working this issue because we're feeling it, too.",
    "If you look at the modeling going on in those states, states like Connecticut and New York, it does appear that the infections are peaking right now.",
    "And during the government shutdown, we actually preserved inspections of infant formula plants because of the risks associated with those facilities.",
    "And I was in that pivotal position to act if I thought something was outlandish, irresponsible or would affect the institution of DOD or our country.",
    "DR. SCOTT GOTTLIEB: Well, look, we're definitely seeing a surge of infection, particularly in the Northeast and parts of the Mid-Atlantic right now.",
    "How is the administration making sure that those essential ingredients that are actually required for something like formula are actually available?",
    "But that's because, again, we've got four companies making about 90 percent of the formula in this country, which we should probably take a look at.",
    "And with Finland now on the verge of joining NATO, President Vladimir Putin faces the prospect of sharing an 800-mile border with a NATO partner.",
    "Russia has now turned its firepower on Eastern Ukraine's industrial Donbass region, targeting infrastructure, bridges, oil refineries warehouses.",
    "We're standing strong as a community and working to not let this horrible act of hate detract from us being a loving, warm, welcoming community.",
    "That massacre is being investigated by the Justice Department as a hate crime and an act of -- quote -- \"racially motivated violent extremism.\"",
    "But what I can tell you from an administration perspective is that there is guidance going out to crack down on price gouging where we see it.",
    "The responsibility of the regulator is to ensure, as they take steps to get it ready, that it will in fact be safe when it comes back online.",
    "MARGARET BRENNAN: As a representative of the administration, I do want to ask you a little bit about this reaction to the events in Buffalo.",
    "If price gouging arises in the formula market or the fuel market...\nMARGARET BRENNAN: Is that what -- how much of a factor is that, though?",
    "So, are we going to take that as an excuse to do nothing and do the same thing forever, or are we going to take that as an issue to work?",
    "SECRETARY PETE BUTTIGIEG: Look, what we want to do is create options for Americans to be able to get where they're going more affordably.",
    "NANCY CHEN (voice-over): A frantic scene after a gunman opened fire at a Tops supermarket Saturday afternoon starting in the parking lot.",
    "And the prices year over year are pretty incredible, when you look at them, gas up 44 percent, eggs 23 percent increase year over year.",
    "How comfortable are we now to rely on those supply chains that are not within the borders of the United States that we can't control?",
    "(VERA KUSOLOPENKO SPEAKING IN FOREIGN LANGUAGE)\nCHARLIE D'AGATA: \"This was my home,\" she said, \"and, yesterday, it was burned down.\"",
    "And at that point in time, I was patiently waiting to see what would happen, make sure that the peaceful transfer of power happened.",
    "SECRETARY PETE BUTTIGIEG: Yeah, I mean, it's basically a series of monopolies that have added up into enormous market concentration.",
    "It's one of the factors among many that has been blamed for months of problems with baby formula even before the recall in February.",
    "But we heard from both Dr. Fauci and Dr. Walensky this week that they have started putting on masks when they go indoors once again.",
    "I think, now that that facility has been shut by Abbott and production isn't going on, it's going to be hard to clear the facility.",
    "DR. SCOTT GOTTLIEB: Well, these look, were persistent problems that appear to have been handled poorly, certainly by the company.",
    "(COMMERCIALS)\nMARGARET BRENNAN: If you can't watch the full Face the Nation, you can set your DVR, or we're available on demand.",
    "We had a relatively quiet June and July, and then Delta came along in late August and started to create a new wave of infection.",
    "We turn to the former CEO and current senior chairman of Goldman Sachs, Lloyd Blankfein, who joins us from Water Mill, New York.",
    "And I would say -- you say worse in 40 years, kind of unprecedented that everywhere in the world all lock down at the same time.",
    "There was an impeachment hearing on -- about what happened with January 6...\nFORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Sure.",
    "KATHY BARNETTE (R-Pennsylvania Senatorial Candidate): But it definitely made me become very adamant about the sanctity of life.",
    "Remember, we thought that there was going to be a big surge last year and this summer with B.117 when it emerged in the spring.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: And we turn now to Dr. Scott Gottlieb, former Trump FDA commissioner and Pfizer board member.",
    "The fact that FDA went into that facility this year and found five different strains of Cronobacter, that is a serious concern.",
    "We have a regulatory scheme that is stringent enough that it does create obstacles to getting into the market for new entrants.",
    "SECRETARY PETE BUTTIGIEG: Well, I will let the president speak to the legal outlook with regard to the definition of terrorism.",
    "And the real pain is not so -- is partly what the Fed is going to do, but it's just that this inflation, some of it is sticky.",
    "And we also know, right, that with gas prices on the rise -- and the president's acted with the Strategic Petroleum Reserve.",
    "(LAUGHTER)\nROBERT COSTA: And the top three contenders are all pitching themselves as champions of Trump's political legacy.",
    "When you say it took a long time, it took about 10 years to recover from the last financial crisis..\nLLOYD BLANKFEIN: Yeah.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We want to return now to the economy and the financial challenges facing this country.",
    "DAVID MCCORMICK (R-Pennsylvania Senatorial Candidate): Well, listen, I have gotten to know Kathy on the campaign trail.",
    "LLOYD BLANKFEIN: Do we feel good about getting all our semiconductors from Taiwan, which is, again, an object of China?",
    "MARGARET BRENNAN: And we'll have more on that later in the show, but -- because I know you're not the FDA commissioner.",
    "And that's why it's getting attention at the highest levels, including, of course, direct involvement by the president.",
    "MAYOR BYRON BROWN: I think the question that we need to ask ourselves, are any residents safe in this country anywhere?",
    "The sheer devastation caused by an airstrike in Bakhmut that tore homes apart, leaving residents homeless and furious.",
    "CHARLIE D'AGATA: President Putin has already warned the Finnish president he's made a mistake in joining the alliance.",
    "MARGARET BRENNAN: I want to come back to that in a moment, but I want to ask about the weapon that this shooter used.",
    "There's only been one new entrant in the last 15 years that's a domestically based manufacturer, a company, ByHeart.",
    "So this summer should be a backstop against continued spread of this variant, but it does pose a risk for the fall.",
    "Senior foreign correspondent Charlie D'Agata has the latest on the diplomatic front and the battlefield -- Charlie.",
    "(End VT)\nNANCY CHEN: A first-degree murder charge carries a sentence of life in prison without parole if convicted.",
    "And that took -- and then, again, the financial system is the intermediary by which Fed accomplishes its activity.",
    "MARGARET BRENNAN: But the public isn't interested in things that didn't work, right, or didn't pass or aren't law.",
    "SECRETARY PETE BUTTIGIEG: Right, but America has the productive capacity to create the baby formula that we need.",
    "MARGARET BRENNAN: You talk about and have spoken quite a lot this past week about the events in Lafayette Square.",
    "This has been called dangerous and misguided nonsense by the Obama administration economic adviser Jason Furman.",
    "What we know is that somebody traveled a long distance with an AR-15 to hunt human beings, to hunt black people.",
    "Apparently, he was investigating when he was a high school student, brought to the attention of the authorities.",
    "So the most important thing to do right now, of course, is to get that plant in Michigan up and running safely.",
    "SECRETARY PETE BUTTIGIEG: So, a shortage of ingredients is not what led to the shutdown of the facility, right?",
    "SECRETARY PETE BUTTIGIEG: Again, we don't know, obviously, all of the details that fit the legal definitions.",
    "But I think about what that would be like if you're a shift worker with two jobs, maybe you don't have a car.",
    "Police say the heavily armed suspect shot four people outside, killing three, before moving inside the store.",
    "I'm happy to be here, to be on this show, but it's very a tragic day for all of us here in Western New York.",
    "MARGARET BRENNAN: But that is the federal government's job as regulators to help ensure safety of the plant.",
    "And that whistle-blower report was head -- sent to the head of the Office of Criminal Investigations at FDA.",
    "It was -- it was the way to kind of get that down, get out of the room and get on with what we needed to do.",
    "It comes as Russia has faced significant losses, pulling back from Ukraine's second largest city of Kharkiv.",
    "And the most important thing was to not have it -- was to not lose all those jobs and have a massive crisis.",
    "So, you saw evidence or you had good reason to believe there was an attempt here to basically stage a coup?",
    "SECRETARY PETE BUTTIGIEG: Well I think they want to know what Congress is going to do to lower their costs.",
    "That whistle-blower report said they failed to maintain proper records and released untested baby formula.",
    "I want to play a clip for you here because I asked the then-Attorney General Bill Barr about exactly that.",
    "And, there, you had the banks in trouble, a lot of distress, a lot of liquidity issues, big credit issues.",
    "We need vigilance, not just law enforcement, but also from the platforms that are allowing this to spread.",
    "Officers say the suspect held a gun to his own neck after encountering police, but eventually surrendered.",
    "MARGARET BRENNAN: But it's -- I mean, just even laying that out to you, it is kind of astounding to hear.",
    "We hit this horrendous milestone this week of one million deaths over the entire course of this pandemic.",
    "MARGARET BRENNAN: The Justice Department has called this an act of racially motivated violent extremism.",
    "I know you just mentioned going online and taking what's out there in the social media space seriously.",
    "(APPLAUSE)\nSENATOR TED CRUZ (R-Texas): Every Republican running for office says: \"I love Donald Trump.\"",
    "Then you have the issue with this one plant, Abbott, whistle-blower in September, February, the recall.",
    "There is a lot of -- it is going to be hard for people to have savings, but they already have savings.",
    "But, right now, with existing technology, we know that we can get more Americans into these vehicles.",
    "I understand that he wrote something when he was in high school and that that was being investigated.",
    "Let me talk to you about the things you are involved more in, which is supply chain and procurement.",
    "But, fundamentally, we are here because a company was not able to guarantee that its plant was safe.",
    "It's hard to finely tune them, and it's hard to see the effects of them quickly enough to alter it.",
    "MARGARET BRENNAN: ... and about whether there were attempts to stop the peaceful transfer of power.",
    "The suspect is being held without bond and is set to appear in court again on Thursday -- Margaret.",
    "A law enforcement source told CBS News the suspect allegedly yelled racial slurs during the attack.",
    "She's not transparent about so many aspects of her basic biography, that we don't know who she is.",
    "We've been talking about this baby formula shortage nationwide that's been ongoing now for months.",
    "And we learned this week that the cost of things like food and energy rose compared to last month.",
    "Now, the administration's also been working with other companies to try to surge their production.",
    "But, yeah, only nine people right now oversee -- oversee the entire industry in the United States.",
    "And it doesn't appear to have been a state-of-the-art facility, based on the findings in that 483.",
    "MARGARET BRENNAN: ... when they point to things like all the fiscal spending adding to inflation?",
    "(WOMAN SPEAKING IN FOREIGN LANGUAGE)\nCHARLIE D'AGATA: \"We need help,\" a woman shouts in despair.",
    "We want to continue now with former FDA Commissioner and Pfizer board member Dr. Scott Gottlieb.",
    "I describe this moment in the book, where he thinks about the people he should put into office.",
    "MARGARET BRENNAN: But should any of those people have any proximity to public office right now?",
    "MARGARET BRENNAN: You know, Americans haven't experienced inflation like this in 40 years now.",
    "MARGARET BRENNAN: But, for our audience, it's the central banker's job control inflation here.",
    "But it is the contest among Republicans in Pennsylvania that is attracting a lot of attention.",
    "He was arraigned hours after the attack on a first- degree murder charge, pleading not guilty.",
    "I think what...\nMARGARET BRENNAN: But you're trying -- bringing it in from Europe right now.",
    "MARGARET BRENNAN: ... because this is also part of -- I'm using the term food stamp program.",
    "They want to know what's going on right now,at their kitchen table and in their pocketbooks.",
    "LLOYD BLANKFEIN: And you can argue about that, but that's all with the benefit of hindsight.",
    "There was talk about conducting strikes against -- military strikes against other countries.",
    "The president through the summer was talking about sending troops into Seattle and Portland.",
    "You know, I wrote about this in my book that Bill Barr and I have different recollections.",
    "ROBERT COSTA: But CBS News and others were refused entry, no access, no questions allowed.",
    "She was tested in the last 24 months in a congressional seat, which she lost by 20 points.",
    "And I think -- I think there were -- I believe there were three when I started at the FDA.",
    "NANCY CHEN: Gendron is from Conklin, New York, about three-and-a-half- hours from Buffalo.",
    "And yet we seem to be having that conversation over and over and over again as a country.",
    "LLOYD BLANKFEIN: We're certainly heading -- it's certainly a very, very high risk factor.",
    "\"Everything is destroyed, broken,\" salvaging what's left of their homes and their lives.",
    "MARGARET BRENNAN: Well, they're names that we're watching and we will continue to cover.",
    "He said, if we'd been better mind readers, I guess we could have done something earlier.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We will be right back with a lot more Face the Nation.",
    "DR. SCOTT GOTTLIEB: ... probably B.2.12.1 is going to emerge or B.2 mostly in the South.",
    "SECRETARY PETE BUTTIGIEG: I'm not familiar with all of the details of that legislation.",
    "In my mind...\nMARGARET BRENNAN: You're trying to retrofit this 10,000 arbitrary number.",
    "You always have to think through alternative scenarios, what might or might not happen.",
    "I said on another network I would have certainly spoken out if he had won the election.",
    "I know the president said more action is coming, but this has been ongoing for months.",
    "They stopped inspecting some places during the pandemic that weren't mission-critical.",
    "I'm sure the FDA commissioner will be questioned about that on Capitol Hill this week.",
    "And there's a budget request from the current administration to add four more people.",
    "MARGARET BRENNAN: Well, and this is going to be an issue Congress takes up this week.",
    "MARGARET BRENNAN: But there are contracts there too...\nSECRETARY PETE BUTTIGIEG: Yes.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: I don't think so, but that's my opinion.",
    "You talk about Stephen Miller, all people who were egging on some of these instincts.",
    "Some of it -- and some of these things are a little bit stickier, like energy prices.",
    "You have a number of media and social media companies with big offices in your state.",
    "And there are some elements of the supply chain that are going to be a lot stickier.",
    "Do you think it's important for that committee to lay out these facts to the public?",
    "MARGARET BRENNAN: The shooter was allegedly motivated by white supremacist ideology.",
    "And why did the president on Friday seem to say that it was new information to him?",
    "MARGARET BRENNAN: I want to tap into your perspective, as someone who ran the FDA.",
    "I know your state classifies assault based on race or religion as a terror attack.",
    "MARGARET BRENNAN: So, it's possible that he should not have been sold that weapon?",
    "Do you think that there should be a federal law criminalizing domestic terrorism?",
    "But we also know, right now, that we could be lowering other costs for Americans.",
    "MARGARET BRENNAN: Mr. Mayor, good luck to you and thank you for your time today.",
    "You write about personally being concerned that that's what he was trying to do.",
    "And so, yes, that is a concern of mine, if he runs and is reelected, absolutely.",
    "I mean, you were very critical of Robert O'Brien, the national security adviser.",
    "Chairman Powell said getting it down to 2 percent is going to involve some pain.",
    "But some of it will be a little bit stickier and it will be with us for a while.",
    "And, at the time that this was -- that this was beginning, it was a huge crisis.",
    "In response, there was a massive public policy response, and -- to overwhelm it.",
    "On this \"Face the Nation\" broadcast moderated by Margaret Brennan:\nNew York Gov.",
    "The committee that's investigating January 6 is about to begin public hearings.",
    "You literally don't have the time or the money to be going from store to store.",
    "But whether it's called that legally or not, this was terrorism, this was hate.",
    "Gas prices, highest ever price in the country, $4.45 a gallon national average.",
    "DR. SCOTT GOTTLIEB: And, if that's the case, that's going to complicate issues.",
    "MARK ESPER (Former U.S. Secretary of Defense): Margaret, great to be with you.",
    "ROBERT COSTA: Would Kathy Barnette be a risky bet for Republicans in November?",
    "The Ukrainian government is claiming a key victory in the battle for Kharkiv.",
    "I mean, you lived through the last financial crisis...\nLLOYD BLANKFEIN: Sure.",
    "But I'm 110 percent confident of what the president was seeking that morning.",
    "Look, we have -- we have sort of the worst of both possible worlds right now.",
    "And we're just -- replayed on our CBS News Streaming Network at noon Eastern.",
    "I think it's more likely that you're going to see infection levels come down.",
    "I mean, it is certainly possible, but other people disagree with that model.",
    "And, look, I -- there's been a lot of criticism about why I didn't speak up.",
    "So, given what you're saying is unprecedented, what does recovery look like?",
    "LLOYD BLANKFEIN: Well, the object is, there's an imbalance, too much demand.",
    "We had this massive exogenous event, COVID, lockdowns all around the world.",
    "MARGARET BRENNAN: The former attorney general said it was completely false.",
    "(End VT)\nMARGARET BRENNAN: Why do you seem to have different recollections?",
    "We're wrapping our arms around the families of those whose lives were lost.",
    "It's got to be safe and it's got to be up and running as soon as possible.",
    "The federal government is directly involved in some of these arrangements.",
    "MARGARET BRENNAN: All right, Lloyd Blankfein, thank you for your insights.",
    "They're not necessarily going to increase it quickly because of inflation.",
    "This person murdered ten innocent victims in our community just yesterday.",
    "It's going to be -- you know, we have something like 8 percent inflation.",
    "LLOYD BLANKFEIN (Senior Chairman, Goldman Sachs): Good morning, Margaret.",
    "WILLIAM BARR (Former U.S. Attorney General): No, that's completely false.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Well, the election was over.",
    "MARGARET BRENNAN: No, but it is a factor that has led to price inflation.",
    "MARGARET BRENNAN: Those battery components are also a supply chain issue.",
    "Barnette has mostly denied and deflected, hoping to keep up her momentum.",
    "DR. SCOTT GOTTLIEB: Those allegations are going to be very hard to clear.",
    "FDA didn't exert all the oversight that they could have of that facility.",
    "(LAUGHTER)\nSENATOR TED CRUZ: \"No, no, no, I love Donald Trump even more.",
    "That's led to an increase in production, which is helping to compensate.",
    "But, at the end of the day, this plant needs to come back online safely.",
    "Television personality Dr. Mehmet Oz won Trump's endorsement last month.",
    "He had a medical evaluation based on something he had written in school.",
    "For Face the Nation, this is Robert Costa, reporting from Philadelphia.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Yeah, absolutely, he will.",
    "There are more actions that are underway, including looking at imports.",
    "SECRETARY PETE BUTTIGIEG: As regulators, yes, but let's be very clear.",
    "MARGARET BRENNAN: But why didn't you speak publicly about all of this?",
    "And all those dollars are change -- are chasing -- are chasing assets.",
    "So...\nLLOYD BLANKFEIN: So, we have too much growth, too much stimulus.",
    "He's acted with ethanol flexibility to try to stabilize those prices.",
    "MARGARET BRENNAN: But it's a part of a government assistance program.",
    "And, on the other side of the break, we'll continue the conversation.",
    "GOVERNOR KATHY HOCHUL: That is exactly what's being investigated now.",
    "MARGARET BRENNAN: Well, our condolences to you and to that community.",
    "Federal terrorism -- there are domestic terrorism laws on the books.",
    "And we made some budget requests to increase the size of that group.",
    "DR. SCOTT GOTTLIEB: The timeline for that is very unclear right now.",
    "And that's the work that's going on between the company and the FDA.",
    "MARGARET BRENNAN: I want to ask you a little bit on a personal note.",
    "SAULI NIINISTO (President of Finland): We have today a historic day.",
    "Sunday night...\nMARGARET BRENNAN: The president did not demand that?",
    "Do you think that was an effort to deliberately mislead the public?",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Well, I was concerned.",
    "MARGARET BRENNAN: We turn now to the mayor of Buffalo, Byron Brown.",
    "The president used that phrase, but that's not really on the books.",
    "There were known problems with that facility going back many years.",
    "There is the potential that you see a slow burn through the summer.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Welcome back to Face the Nation.",
    "So the entire industry in this country is overseen by nine people.",
    "And our thoughts, our condolences are with you and your community.",
    "MARGARET BRENNAN: I want to talk to you about a number of things,.",
    "So you agree with the San Francisco Fed...\nLLOYD BLANKFEIN: Right.",
    "And I think they reacted sensibly with what they knew at the time.",
    "How do you actually regulate this without impeding on free speech?",
    "So, this information from yesterday's attack is already out there.",
    "JOHN GARCIA (Erie County, New York, Sheriff): This was pure evil.",
    "Well, let's talk about what's happening now to try to control it.",
    "ROBERT COSTA: But the race remains a tossup, with voters divided.",
    "If I were running a big company, I would be very prepared for it.",
    "MARGARET BRENNAN: And it's an important bit of the public record.",
    "I think, in all these cases, people hear or see different things.",
    "MARGARET BRENNAN: We have more to talk about with you, as always.",
    "Dr. Gottlieb, we've been talking about the baby formula shortage.",
    "And as we got into the later spring, infection levels came down.",
    "Are you saying strap in for more than a decade of struggle here?",
    "They're going to eventually need to get that facility reopened.",
    "MARGARET BRENNAN: Good morning, and welcome to Face the Nation.",
    "And so we're going to find out what happened in the aftermath.",
    "And what you have to do is, you have to slow down that demand.",
    "But they're starting in a much better place than we were then.",
    "Nobody was sure who was able to pay their debts as they arose.",
    "And there were -- it's always at least a little bit different.",
    "MARGARET BRENNAN: Do you think we're headed towards recession?",
    "FORMER U.S. ATTORNEY GENERAL BARR: No, he did not demand that.",
    "People have asked me about things that I simply can't recall.",
    "The war will not go -- in the Ukraine will not go on forever.",
    "LLOYD BLANKFEIN: And the Fed has very, again, powerful tools.",
    "(End VT)\nMARGARET BRENNAN: We turn now to the war in Ukraine.",
    "We know they didn't inspect the Abbott facility back in 2020.",
    "So these should have prompted more aggressive action earlier.",
    "BYRON BROWN (Mayor of Buffalo New York): Thank you, Margaret.",
    "PETE BUTTIGIEG (U.S. Transportation Secretary): Good morning.",
    "SECRETARY PETE BUTTIGIEG: Yeah, this is very personal for us.",
    "But I'm going to get to the bottom of and find out right now.",
    "This can be prosecuted under state or federal laws right now.",
    "GOVERNOR KATHY HOCHUL: No, we want them to stay in our state.",
    "We want to go now to the governor of New York, Kathy Hochul.",
    "And, look, I don't know why we have different recollections.",
    "You're saying you actually were worried about that yourself.",
    "Until next week, for Face the Nation, I'm Margaret Brennan.",
    "And do you think the Fed is doing what is needed right now?",
    "DR. SCOTT GOTTLIEB (Former FDA Commissioner): Good morning.",
    "We didn't see it in 2021, when B.117 emerged in the spring.",
    "Plus, you can watch us through our CBS or Paramount+ apps.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: I don't know.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: I don't know.",
    "GOVERNOR KATHY HOCHUL: They have a responsibility as well.",
    "It started with our district attorney at the state level.",
    "The intent of this individual was telegraphed in advance.",
    "MARGARET BRENNAN: ... Goldman Sachs obviously a key part.",
    "Actually, the consumer is starting out at a strong level.",
    "No, no, no, I have Donald Trump tattooed on my rear end.\"",
    "The government does not make baby formula, nor should it.",
    "MARGARET BRENNAN: I have so much more to get to as well.",
    "Secretary of Transportation Pete Buttigieg joins us now.",
    "How do you all unite in the wake of something like this?",
    "But I think they are -- I think they're responding well.",
    "But why didn't you speak out as soon as you left office?",
    "How was he allowed to buy and to hold on to that weapon?",
    "Are you concerned about further violence in your state?",
    "He figured this out in 2020, after he beat impeachment.",
    "But voters face a conundrum: Who exactly fits the bill?",
    "MARGARET BRENNAN: Dr. Gottlieb, we'll be watching that.",
    "DR. SCOTT GOTTLIEB: Well, look, it is mission-critical.",
    "So it does appear to be a sophisticated whistle-blower.",
    "MARGARET BRENNAN: And that's what I wanted to ask you.",
    "MARGARET BRENNAN: And good luck with the baby formula.",
    "There was a lot -- a lot of different things going on.",
    "I mean, you look at hotel prices, 23 percent increase.",
    "This was on a manifesto that was written a while back.",
    "You've called it a feeding frenzy for white supremacy.",
    "Some of the supply chain issues, again, will go away.",
    "We were the beneficiary for...\nMARGARET BRENNAN: Yes.",
    "MARGARET BRENNAN: Face the Nation will be right back.",
    "Secretary Buttigieg, good to have you here in person.",
    "GOVERNOR KATHY HOCHUL: Well, no, we don't know that.",
    "How does the facility not get inspected by the FDA?",
    "Right now, we're averaging about 326 deaths a week.",
    "It is obviously very painful, very raw, very fresh.",
    "MARGARET BRENNAN: So, that's why you didn't resign.",
    "And I would have spoken out if called for to do it.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Right.",
    "I know you started writing the book within months.",
    "FORMER U.S. SECRETARY OF DEFENSE MARK ESPER: Yeah.",
    "And one...\nMARGARET BRENNAN: Is that an oligopoly?",
    "So, they should have been under close supervision.",
    "You just said that the FDA didn't do all it could.",
    "And it was less than that just several years ago.",
    "I believe they will, but that remains to be seen.",
    "MAYOR BYRON BROWN: Thank you very much, Margaret.",
    "That's when I'm first made aware of this request.",
    "You write about the chief of staff, Mark Meadows.",
    "It was straight-up racially motivated hate crime.",
    "NANCY CHEN: Of the 13 people shot, 11 were black.",
    "If I was a consumer, I would be prepared for it.",
    "Eventually, the war in the Ukraine will be over.",
    "You have called Kathy Barnette a mystery person.",
    "MARGARET BRENNAN: We're going to leave it there.",
    "The bottom line is, we didn't see that in 2020.",
    "Do you have problems getting a hold of formula?",
    "Now, again, at the time, it was very uncertain.",
    "I think it's -- it's...\nMARGARET BRENNAN: Yeah.",
    "Mr. Secretary, welcome back to Face the Nation.",
    "MARGARET BRENNAN: Should Americans drive less?",
    "Remember, this division at FDA is nine people.",
    "And it was even fewer people when I was there.",
    "Does this sound like criminal behavior to you?",
    "There's been more resources added since then.",
    "Baby formula is a very big part of our lives.",
    "MARGARET BRENNAN: We turn now to the economy.",
    "MARGARET BRENNAN: Is there an ongoing threat?",
    "Some of the supply chain shocks will go away.",
    "MARGARET BRENNAN: Charlie D'Agata, thank you.",
    "This would have happened a little while back.",
    "Specifically, what are you asking them to do?",
    "MARGARET BRENNAN: Governor, good luck to you.",
    "So we're going to get to the bottom of that.",
    "There's spillover into the services too now.",
    "LLOYD BLANKFEIN: Well, it's -- well, no, no.",
    "And so they're going to have to raise rates.",
    "But I think the Fed has very powerful tools.",
    "I mean, all of us see that pain at the pump.",
    "There were findings on previous inspections.",
    "And you're pointing to regulation failures.",
    "GOVERNOR KATHY HOCHUL: Thank you very much.",
    "Again, people have different recollections.",
    "MARGARET BRENNAN: Difficult and oppressive.",
    "Law enforcement also monitors this as well.",
    "There's no federal statute that does that.",
    "CBS News correspondent Nancy Chen reports.",
    "(Begin VT)\nMAN: A shooter, a mass shooter.",
    "This is -- this is kind of much different.",
    "MARGARET BRENNAN: When you were in office.",
    "We got some more resources for that group.",
    "There's all sorts of allegations in here.",
    "We have to focus on sensible gun control.",
    "Some of that is transitory, will go away.",
    "And we pulled it off, and thank goodness.",
    "LLOYD BLANKFEIN: It's definitely a risk.",
    "CHARLIE D'AGATA: Good morning, Margaret.",
    "That's why this is such a serious issue.",
    "They're incredibly profitable right now.",
    "They're not unhappy about the situation.",
    "What do you see in terms of trend lines?",
    "MARGARET BRENNAN: Nancy Chen, thank you.",
    "Are you asking Americans to drive less?",
    "We're taking it as an issue to work on.",
    "MARGARET BRENNAN: ... airlines over 30.",
    "So, this time, we were going to go big.",
    "What does all of this indicate to you?",
    "And her rivals are sounding the alarm.",
    "And that's going to involve some pain.",
    "There are supply chain issues already.",
    "We've got two nine month old children.",
    "Thank you for your insight, as always.",
    "MAN #1: Stand behind the cone, please.",
    "LLOYD BLANKFEIN: And so they reacted.",
    "Thank you for your time this morning.",
    "You said white supremacist terrorism.",
    "GOVERNOR KATHY HOCHUL: Good morning.",
    "You've said it was legally obtained.",
    "And that created a lot of liquidity.",
    "LLOYD BLANKFEIN: Well, wage as well.",
    "Mark Esper, a lot more in this book.",
    "MARGARET BRENNAN: That's astounding.",
    "So, stay with us on Face the Nation.",
    "SECRETARY PETE BUTTIGIEG: Thank you.",
    "Isn't baby formula mission-critical?",
    "Good morning to you, Mr. Secretary.",
    "That's what it came down to for me.",
    "Finland will maximize its security.",
    "So it is the Federal Reserve's job.",
    "China won't be locked down forever.",
    "So we need a multifaceted approach.",
    "I mean, we have the FBI monitoring.",
    "Is that an oversight in the state?",
    "The suspect then killed the guard.",
    "Some of this will transition away.",
    "And there's -- but there's a path.",
    "You have to slow down the economy.",
    "MARGARET BRENNAN: Too much growth.",
    "But you said it's a broken market.",
    "I wonder how you respond to that.",
    "SECRETARY PETE BUTTIGIEG: Thanks.",
    "DR. SCOTT GOTTLIEB: That's right.",
    "Do you agree that it is nonsense?",
    "MAN #2: They told us, no presser.",
    "I will tell you how we got here.",
    "MARGARET BRENNAN: You know this.",
    "SECRETARY PETE BUTTIGIEG: Right.",
    "SECRETARY PETE BUTTIGIEG: Right.",
    "SECRETARY PETE BUTTIGIEG: Right.",
    "And we will keep moving forward.",
    "We're all set, at least for now.",
    "There's concern about an uptick.",
    "DR. SCOTT GOTTLIEB: Potentially.",
    "Good morning to you, Mr. Mayor.",
    "I want to get you on inflation.",
    "What does that indicate to you?",
    "But it's not baked in the cake.",
    "MARGARET BRENNAN: I understand.",
    "Good morning to you, Governor.",
    "How are you all handling this?",
    "But we are a strong community.",
    "Are your residents safe today?",
    "Our Robert Costa tells us why.",
    "And that plant has shut down.",
    "This is a capitalist country.",
    "MARGARET BRENNAN: But he did.",
    "We don't know that right now.",
    "It's my hometown of Buffalo.",
    "It's a little bit different.",
    "Good morning to you, Doctor.",
    "It's grown in recent years.",
    "Let me ask you about COVID.",
    "GOVERNOR KATHY HOCHUL: Yes.",
    "Some of that is transitory.",
    "I will give you an example.",
    "That's not impaired today.",
    "But Kathy has been tested.",
    "We'll be back in a moment.",
    "It's absolutely important.",
    "We also have state police.",
    "What do you mean by that?",
    "MARGARET BRENNAN: Mm-hmm.",
    "MARGARET BRENNAN: Mm-hmm.",
    "That's quite a long time.",
    "MARGARET BRENNAN: Mm-hmm.",
    "Why has it taken so long?",
    "You have infants at home.",
    "The president is unhappy.",
    "MARGARET BRENNAN: Mm-hmm.",
    "And we're taking action.",
    "So we've come a far way.",
    "They're not complaining.",
    "MARGARET BRENNAN: Right.",
    "MARGARET BRENNAN: Right.",
    "MARGARET BRENNAN: Right.",
    "That's completely false.",
    "You used a sharper word.",
    "Thank you for watching.",
    "MARGARET BRENNAN: Yeah.",
    "Companies make formula.",
    "MARGARET BRENNAN: Yeah.",
    "MARGARET BRENNAN: Yes.",
    "MARGARET BRENNAN: Yes.",
    "The public is unhappy.",
    "And we figured it out.",
    "You were once a mayor.",
    "You know it very well.",
    "LLOYD BLANKFEIN: Sure.",
    "LLOYD BLANKFEIN: Sure.",
    "MARGARET BRENNAN: Yes.",
    "LLOYD BLANKFEIN: Sure.",
    "LLOYD BLANKFEIN: Sure.",
    "We will be right back.",
    "We will be right back.",
    "MARGARET BRENNAN: Yes.",
    "I'm Margaret Brennan.",
    "Hopefully, they will.",
    "Good to be with you.",
    "That's it for today.",
    "It is worth reading.",
    "I mean, do the math.",
    "I respect her story.",
    "Good morning to you.",
    "It was livestreamed.",
    "It's a narrow path.",
    "Too much stimulus.",
    "He talks about it.",
    "He's 19 years old.",
    "Is that accurate?",
    "5,000 and 5,000.",
    "And we went big.",
    "So stay with us.",
    "Should there be?",
    "Why would they?",
    "But he didn't.",
    "Where are we?",
    "Stay with us.",
    "Thank you.",
    "It's May.",
    "Nine?"
  ]
}