{
  "id": 6822,
  "mediaId": 136,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump-Endorsed Doug Mastriano's Chances of Beating GOP Rivals: Polls",
  "image": "https://d.newsweek.com/en/full/2037860/doug-mastriano.webp?w=790&f=6b502ad161491bc845a9cc2eea80a140",
  "link": "https://www.newsweek.com/trump-endorsed-doug-mastrianos-chances-beating-gop-rivals-polls-1706690",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1147,
    1282,
    1990,
    1997,
    2087,
    3102,
    146,
    201,
    428,
    571,
    2862
  ],
  "sentences": [
    "Despite these claims, which have been consistently debunked and discredited by top election officials and former Trump administration officials, Biden won the state by more than 80,000 votes, a little over 1 percent of the total votes.",
    "In Pennsylvania, many local GOP officials as well as prominent national conservatives, have highly criticized Trump's backing of television personality and physician Dr. Mehmet Oz to be the Republican Senate nominee.",
    "Former President Donald Trump endorsed Pennsylvania's Republican gubernatorial hopeful Doug Mastriano on Saturday, just days before he faces off against GOP opponents in the state's primary on Tuesday.",
    "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,\" Trump claimed in his Saturday statement endorsing the GOP contender.",
    "The former president's preferred candidates for House, Senate and governor have won 39 out of 40 total GOP primary races, according to polling news site FiveThirtyEight's analysis.",
    "The Trump-backed candidate had the support of 28 percent of Republicans while his closest rival, Representative Lou Barletta, came in second with close to 18 percent.",
    "The Trump-endorsed contender received the backing of 20 percent of respondents while former district attorney William McSwain came in second at 12 percent.",
    "Even before Trump's endorsement, however, Mastriano, a GOP state senator in Pennsylvania, appeared to be the frontrunner in the Republican primary contest.",
    "\"Kathy Barnette will never be able to win the general election against the radical left Democrats,\" the former president said in an official statement.",
    "Mastriano has led efforts in Pennsylvania to review and investigate Trump's allegations that President Joe Biden's win in the state was fraudulent.",
    "\"He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it.\"",
    "The survey had a margin of error of plus or minus 6.9 percentage points, however, and only polled 325 registered voters.",
    "Another recent survey by Franklin & Marshall College from April 20 to May 1 showed Mastriano in the lead by 8 points.",
    "The current RealClearPolitics average of Pennsylvania polls show that he has a lead of about 10.4 percentage points.",
    "A survey conducted by Trafalgar Group from May 6 to 8 showed that Mastriano was 10 points ahead with likely voters.",
    "Meanwhile, recent polls show that Mastriano is like to come out on top after GOP voters cast their primary ballots.",
    "Just over 1,000 voters were surveyed and the poll had a margin of error of plus or minus 3 percentage points.",
    "Meanwhile, some of his high profile endorsements have faced substantial backlash from fellow Republicans.",
    "That poll, which included 1,080 respondents, had a margin of error of plus or minus 3 percentage points.",
    "The Republican gubernatorial hopeful backed conservative commentator and author Kathy Barnette instead.",
    "\"Dr. Oz is the only one who will be able to easily defeat the Crazed, Lunatic Democrat in Pennsylvania.",
    "Recent polls show that Oz is only slightly favored in what appears to be a nearly three-way tied race.",
    "In that survey, Mastriano led by 12 points and was backed by 29 percent of registered voters.",
    "Again, Barletta came in at a distant second with the support of 17 percent of GOP voters.",
    "Thus far in the GOP primary season, Trump's endorsements have been largely successful.",
    "On Thursday, Trump knocked Barnette as recent polls showed her nearly tied with Oz.",
    "Two recent polls showed the candidate with a double-digit lead over his opponents.",
    "A vote for anyone else in the Primary is a vote against Victory in the Fall!\"",
    "Polling by Fox News carried out from May 3 to 7 had similar results.",
    "Notably, even Mastriano does not support Oz.",
    "Barletta was a close third at 11 percent."
  ]
}