{
  "id": 6825,
  "mediaId": 147,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump endorses Doug Mastriano ahead of Pennsylvania GOP governor primary",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/GettyImages-1397114091-1200x800.jpg",
  "link": "https://www.pbs.org/newshour/politics/trump-endorses-doug-mastriano-ahead-of-pennsylvania-gop-governor-primary",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "https://www.pbs.org/newshour/author/marc-levy-associated-press",
  "termIds": [
    1147,
    1282,
    1713,
    2087,
    3102,
    428,
    2992,
    2862
  ],
  "sentences": [
    "He has revealed the Deceit, Corruption, and outright Theft of the 2020 Presidential Election, and will do something about it.?\nTrump called Mastriano a fighter like few others, and has been with me right from the beginning, and now I have an obligation to be with him.?\nBesides campaigning with key figures in Trumps circle who have spread lies about the last election, Mastriano also floated a plan to let state lawmakers wipe out that election result and make their own decision on which candidate should receive the states electoral votes.",
    "In a statement Saturday, Mastriano said he was honored? to receive Trumps endorsement and he cited Pennsylvanians who want their individual liberties restored, power returned to the people, and for their elected leaders to fulfill the America First  and Pennsylvania First  agenda.?\nOur grassroots supporters across Pennsylvania know that Donald Trump and I will always have their backs,? Mastriano wrote.",
    "HARRISBURG, Pa. (AP)  Donald Trump on Saturday endorsed Doug Mastriano in Pennsylvanias Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan. 6 insurrection and has worked with determination to overturn the results of the 2020 presidential election.",
    "READ MORE: As Trumps chosen candidates face voters in May races, bid to shape GOP is tested\nMastriano has, for example, helped spread unsubstantiated claims from Trump and his allies that Democrats fraudulently stole the election for Joe Biden  something that Trump seized on in his endorsement statement.",
    "But there are growing fears from party leaders that Mastriano, a state senator and retired U.S. Army colonel, is too extreme to beat Democrat Josh Shapiro in Novembers general election and could drag down other Republicans competing in the pivotal state.",
    "Mastriano is leading the nine-person field of Republican candidates, with party officials and conservatives believing that votes for more electable establishment candidates are too splintered to head off his consolidation of far-right voters.",
    "We are all committed to ending the era of party bosses, dark money interest groups, and flawed elections.?\nBarletta has spent the past few days accumulating establishment endorsements, including from members of Congress.",
    "On Friday, Mastriano told former Trump adviser Steve Bannons online War Room? broadcast that the Republican establishment is panicking, I mean, literally wetting themselves? at the prospect that he will be the nominee.",
    "Mastriano organized bus trips to the U.S. Capitol for Trumps Stop the Steal? rally just before the riot, where Mastriano was seen in footage with his wife passing through breached barricades set up by police.",
    "Such a move is barred by the National Voter Registration Act and likely runs into significant protections under the federal  and possibly state  constitution and laws, constitutional law scholars say.",
    "Some allies desperately urged him to stay out of the race or to endorse a Mastriano rival, such as Lou Barletta, a former congressman who was the partys Trump-endorsed nominee for U.S. Senate in 2018.",
    "Some allies had tried to convince the former president that backing Mastriano would hurt Oz because Mastriano has closely aligned and campaigned with one of Ozs rivals, Kathy Barnette.",
    "Mastriano was already leading a crowded field of contenders, and the former presidents endorsement puts him on even stronger footing heading into Tuesdays primary.",
    "Republicans worry in particular that Mastriano is too toxic to win moderate voters in the heavily populated suburbs of Philadelphia and Pittsburgh in November.",
    "Trumps top focus in Pennsylvania has been the Senate primary, where his endorsed candidate, celebrity heart surgeon Mehmet Oz, is seen as vulnerable.",
    "In many cases, rank-and-file Republican voters, conservative activists and pro-Trump hard-liners have refused to back Oz just because Trump does.",
    "But as Trump worries about Ozs chances, endorsing Mastriano is seen as a means to protect his ego, providing a likely win if Oz ends up losing.",
    "There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,? Trump wrote.",
    "He has avoided criticizing Mastriano by name, other than trying to make the case that he is the most electable candidate in the primary.",
    "That includes a U.S. Senate contest in which Trump is trying to lift his endorsed candidate to victory in a highly competitive race.",
    "I will continue making the case to the people that I am the only candidate who can unite the party and bring victory in November.",
    "Still, Barletta has acknowledged there is very little in policy difference between himself and Mastriano.",
    "As a result he was subpoenaed by the U.S. House committee investigating the Capitol riot on Jan. 6, 2021.",
    "After the election, Mastriano boasted to supporters in online chats about his frequent talks with Trump.",
    "Republicans have been shut out of the governors office in Pennsylvania since 2014 under Democratic Gov.",
    "Critics fear he will endanger down-ballot GOP candidates with a lackluster top-of-the-ticket turnout.",
    "Mastriano has said he would take the extraordinary step of requiring voters to re-register? to vote.",
    "I look forward to having President Trumps endorsement Wednesday morning,? Barletta wrote.",
    "__\nAssociated Press writer Jill Colvin in New York contributed to this report.",
    "Were going to start all over again,? he said during a debate last month.",
    "Trump was torn on the endorsement decision in the governors race.",
    "On Saturday, he maintained that he could still beat Mastriano.",
    "Tom Wolf, who is barred by term limits from running again."
  ]
}