{
  "id": 6829,
  "mediaId": 136,
  "date": "d2022-05-14T13:58",
  "headline": "Trump Further Alienates Pennsylvania GOP by Backing Mastriano for Governor",
  "image": "https://d.newsweek.com/en/full/2037831/donald-trump-endorses-doug-mastriano.webp?w=790&f=0031c0139a5e90f0043784256ffa9165",
  "link": "https://www.newsweek.com/trump-further-alienates-pennsylvania-gop-backing-mastriano-governor-1706672",
  "sentiment": "-0.361",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    1147,
    1282,
    1726,
    1967,
    2087,
    3102,
    146,
    428,
    2992,
    2862
  ],
  "sentences": [
    "His endorsement could potentially sway some undecided GOP voters, but it could also alienate party leaders who have coalesced around former Congressman Lou Barletta, who has won the backing of former Pennsylvania Senator Rick Santorum, as well as congressmen Fred Keller and Dan Meuser.",
    "Recent polls have found Mastriano surging in the weeks leading up to the primary even before receiving Trump's endorsement, which could boost his odds as the former president remains an influential figure within the GOP.",
    "Trump's endorsement of Mastriano, a state senator who has vigorously backed the ex-president's unproven claims of massive voter fraud during the 2020 election, comes only three days before the primary on Tuesday.",
    "He faced calls for resignation after he appeared at the U.S. Capitol on January 6, 2021, the same day a group of Trump supporters violently rioted in an effort to stop the certification of the election.",
    "David Urban, a former Trump adviser, warned on CNN that Mastriano may not be able to win the general election, pointing to Pennsylvania's record of electing more moderate candidates.",
    "Former President Donald Trump endorsed Doug Mastriano in Pennsylvania's GOP gubernatorial primary Saturday, again alienating state leaders in the Republican Party.",
    "It comes after Trump caused a rift in the state's GOP senate primary by endorsing Oz, sparking criticism from many supporters who questioned Oz's credentials.",
    "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,\" Trump wrote in a statement.",
    "He added that \"Mastriano and Dr. Mehmet Oz will make an unbeatable team going into the most important Midterm Election in the history of our Country.\"",
    "He also launched a \"forensic investigation\" of the 2020 election in Pennsylvania, where President Joe Biden defeated Trump by a narrow 1.2 percent.",
    "Democrat Josh Shapiro, who currently serves as the state's attorney general, appears to be the favorite to win the nomination.",
    "\"I think Mastriano is too hot, too conservative, too far out, too far right for the Pennsylvania general electorate,\" he said.",
    "The race is widely considered to be a toss-up in what was one of the closest states in the 2020 presidential election.",
    "A Fox News poll from early May found him winning 29 percent of the vote, while Barletta trailed with 17 percent.",
    "He has not been charged, but was subpoenaed in February by the House select committee investigating the riot.",
    "He commended Mastriano as a \"fighter like few others\" and for being \"with me right from the beginning.\"",
    "Mastriano remains a controversial figure over his stance on the 2020 presidential election results.",
    "Ultimately, no substantial evidence of widespread voter fraud has been identified in the state.",
    "Meanwhile in March, Barletta led with 19 percent to Mastriano's 18 percent.",
    "ET: This article was updated with additional information and background.",
    "Whoever wins the GOP primary will face a competitive race in November.",
    "Some Republicans denounced the endorsement Saturday morning.",
    "Update 05/14/22, 11:37 a.m."
  ]
}