{
  "id": 6835,
  "mediaId": 558,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump endorses Mastriano for Pennsylvania governor",
  "image": "https://s.yimg.com/ny/api/res/1.2/Y9SqqrGiSVP3_Ew55OPJqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/5M1SRR3DSvXQNMG2VoHbtg--~B/aD01MzM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/c25297c89be3e1c56b74db7050d44144",
  "link": "https://sg.news.yahoo.com/trump-endorses-mastriano-pennsylvania-governor-144627985.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "In August, Mastriano was removed from the state's 2020 election audit, as the state's top Republican senator said he was focused on \"politics and showmanship\" rather than an actual investigation.",
    "By Pete Schroeder\nWASHINGTON (Reuters) - Former President Donald Trump announced Saturday he was backing Pennsylvania state Senator Doug Mastriano in that state's 2022 governor's race.",
    "Mastriano, a staunch Trump ally who has been a vocal proponent of his baseless stolen-election claims, was already leading in the polls against several other Republican challengers.",
    "Mastriano was a leading advocate for an investigation into the 2020 election results, where Pennsylvania's backing of President Joe Biden ultimately sealed his victory.",
    "\"He is a fighter like few others, and has been with me right from the beginning, and now I have an obligation to be with him.\"",
    "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity,\" Trump said in a statement.",
    "Pennsylvania is a key swing state where Democratic Governor Tom Wolf will not seek reelection due to term limits.",
    "Josh Shapiro, the state's attorney general, is currently the presumptive Democratic nominee.",
    "The endorsement comes three days before the Republican primary election.",
    "(Reporting by Pete Schroeder; Editing by Daniel Wallis)"
  ]
}