{
  "id": 6839,
  "mediaId": 129,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Trump Backs Doug Mastriano, a Far-Right Loyalist, to Lead Pennsylvania",
  "image": "https://static01.nyt.com/images/2022/05/13/multimedia/00pol-trump-mastriano-photo/00pol-trump-mastriano-photo-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/14/us/politics/trump-endorses-doug-mastriano.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    905,
    1147,
    1282,
    1713,
    3102,
    562,
    571,
    2862
  ],
  "sentences": [
    "There is no one in Pennsylvania who has done more, or fought harder, for election integrity,? Mr. Trump said in a statement, adding that Mr. Mastriano would also fight violent crime, strengthen our borders, protect life, defend our under-siege Second Amendment, and help our military and our vets.?\nA Fox News poll released Tuesday showed Mr. Mastriano with a lead of 12 percentage points over his closest primary rival, former Representative Lou Barletta.",
    "Former President Donald J. Trump on Saturday endorsed Doug Mastriano, a retired colonel and state senator who has propagated myriad false claims about the 2020 election and attended the protest leading up to the Capitol riot, in the Republican primary race for governor of Pennsylvania.",
    "In a statement after the endorsement on Saturday, Mr. Barletta said, Throughout this campaign I have proved that Im the best Republican to unite the Republican Party and defeat Josh Shapiro, and I will continue unifying our grass-roots conservatives towards our shared goal.?",
    "Pennsylvania Republicans not aligned with the Mastriano campaign have said he cannot win a general election against Josh Shapiro, the Pennsylvania attorney general who is the presumptive Democratic nominee for governor.",
    "Mr. Trump made his choice three days before the states Tuesday primary, a political blessing that serves to increase the former presidents standing as much as Mr. Mastrianos.",
    "Two fellow candidates dropped out and endorsed Mr. Barletta, as have a few prominent former elected officials, including former Senator Rick Santorum of Pennsylvania.",
    "He used campaign money to organize buses to Washington on Jan. 6, 2021, and, last month, campaigned at an event that promoted the outlandish QAnon conspiracy theory.",
    "Mr. Trump, whose chosen candidate for governor of Nebraska lost a primary on Tuesday, is at risk of another blemish on his record in Pennsylvanias Senate race.",
    "Mr. Shapiros campaign recently began airing television advertisements that appeared intended to lift Mr. Mastrianos standing among Republican primary voters.",
    "His pick, the television personality Dr. Mehmet Oz, has failed to put daylight between himself and a field of candidates.",
    "Since then, Mr. Barletta has sought to coalesce support from Republicans wary of nominating Mr. Mastriano.",
    "Mr. Mastriano has long been an outspoken supporter of Mr. Trump."
  ]
}