{
  "id": 6840,
  "mediaId": 19,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Republicans Very Disappointed in Trumps Mastriano Endorsement, Continue Lining Up Behind Lou Barletta",
  "image": "https://media.breitbart.com/media/2022/05/LB-DM.png",
  "link": "https://www.breitbart.com/politics/2022/05/14/republicans-very-disappointed-in-trumps-mastriano-endorsement-continue-lining-up-behind-lou-barletta/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1147,
    1282,
    1713,
    2087,
    3012,
    3102,
    4806,
    428,
    571,
    2862
  ],
  "sentences": [
    "\nKulback, who has an army of volunteers set to work on Tuesday to get voters out, told the Washington Examiner: Trumps interference in Pennsylvania is going to cost us the governors office in the fall, which, by the way, is very important to hold when you are running for president in 2024, but there is a chance it could also cost us the Senate seat.?\n\nOne prominent county chairman, who asked to remain anonymous but has hosted Trump in his county several times and voted for him twice, said, Maybe Joe Bidens not the only septuagenarian who should take a competency test??\nAn Osage Research poll of 600 swing voters in Pennsylvania shows Mastriano is losing in a head-to-head matchup with Shapiro.",
    "Pennsylvania Republican Party chairs told the Washington Examiner that they too are not happy with Trumps endorsement of Mastriano, worried that he will risk throwing the general election to Shapiro:\nAllegheny County Republican Party Chairman Sam DeMarco was stunned when the news hit social media: I am very disappointed with the presidents decision in picking Mastriano.",
    "Mastrianos image is already upside down with swing voters with only 16 percent having a favorable opinion of Mastriano while already 22 percent have an unfavorable opinion.?\nThe Pennsylvania GOP gubernatorial primary election is on May 17.",
    "On Saturday, Trump announced his endorsement of Mastriano, whom statewide Republican Party leaders worry will be a tough sell in a general election against Pennsylvania Attorney General Josh Shapiro, the presumptive Democrat nominee.",
    "While endorsing Barletta on Saturday, former Rep. Tom Marino (R-PA) said all indications? state that the former Hazelton mayor is best positioned to beat Shapiro in a general election and assailed Trumps endorsement of Mastriano.",
    "Its not exactly going out on a limb supporting someone in the lead three days before the election; it does guarantee him one win in this state on Tuesday,? said DeMarco in an interview with the Washington Examiner.",
    "While swing voters, by a three percent margin, say they prefer a Republican to a Democrat for governor, 49 percent said they would vote for Shapiro if Mastriano is the GOP nominee.",
    "We took a lot of heat about it.? He went on:\nMy leadership, our leadership, told us when they heard we did this, that our political careers were over  we did the right thing there.",
    "Republicans across Pennsylvania are questioning former President Trumps last-minute endorsement of State Sen. Doug Mastriano (R) in the gubernatorial race.",
    "Many have continued lining up behind former Rep. Lou Barletta (R-PA), who has previously unseated Democrats in local and congressional races.",
    "Barletta is now calling on Republican candidates Dave White and Bill McSwain to drop out of the gubernatorial primary and endorse him.",
    "Im just very disappointed in our president  because apparently, the loyalty does not go as far as he says his loyalty does.",
    "This week, Barletta won endorsements from Melissa Hart and Jake Corman, both of whom dropped out of the race to back him.",
    "This is an unsustainable number for a general election nominee for a party,? the pollsters note.",
    "I was extremely disappointed when Mr. Trump came out and endorsed Mr. Mastriano,? Marino said.",
    "Lou and I were the first congressmen to come out and endorse Trump in his first election.",
    "At the very least, a telephone call as to say why he did what he did but he didnt.",
    "Former Sen. Rick Santorum (R-PA) has endorsed Barletta.",
    "Mastriano trails in the matchup with just 41 percent.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    " Where in the hell is the loyalty?",
    "Follow him on Twitter here."
  ]
}