{
  "id": 6842,
  "mediaId": 157,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "'Too far right: Former adviser slams Trump's endorsement of PA's Mastriano",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29804387&width=1200&coordinates=0%2C21%2C0%2C51&height=600",
  "link": "https://www.rawstory.com/donald-trump-mastriano/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    3102
  ],
  "sentences": [
    "Donald Trump's endorsement of controversial lawmaker Doug Mastriano to be the Republicans Party's nominee to be the next governor of Pennsylvania got off to a rough start just moments after he made his choice known through his spokesperson on Twitter.",
    "Sitting in on a CNN panel as it received the breaking news, former Trump adviser David Urban said, on the one hand, the endorsement makes sense while bluntly adding that he doesn't see any way Mastrianao can win in November.",
    "He wanted a winner, it's clear by all the polling that Doug Mastriano is going to win, so I think the president's endorsement here is looking to bolster his record.\"",
    "And I think that's why you saw the Wall Street Journal and many mainstream Republicans wringing their hands about Doug Mastriano at the top of the ticket.",
    "\"I wasn't shocked by the president's endorsement of Doug Mastriano,\" Urban, who ran Trump's campaign in Pennsylvania in 2016, admitted.",
    "\"I think Mastriano is too hot, too conservative, too far out, too far right for the Pennsylvania general electorate,\" he predicted.",
    "Speaking with CNN host Michael Smerconish, Urban immediately poured cold water all over Mastriano's bid for the governor's office.",
    "Whether it's Dick Thornberg or Tom Ridge, Arlen Specter -- it's a very purple state, as you said, originally.\"",
    "\"I think he's -- Michael, you and I go way back and we've been doing this stuff for a long time.",
    "The president likes to tout how his record has lots and lots of victories, people he supported.",
    "You know, Pennsylvania is a very long history of electing moderates, right?",
    "They fear he'll be a big drag on the ticket and will weigh down the race.\"",
    "\"I thought it was coming, I was just surprised that it came so late.",
    "\"I think [Democrat] Josh Shapiro will be the victor in that race.",
    "He's concerned about Dr. [Mehmet] Oz losing on Tuesday.",
    "I think this is about the president's win/loss record.",
    "\"No, no, I don't think he can,\" Urban quickly replied.",
    "\"Can Mastriano win a general in Pennsylvania?\"",
    "CNN 05 14 2022 09 27 23",
    "the CNN host pressed."
  ]
}