{
  "id": 6856,
  "mediaId": 558,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Trump takes aim at Kathy Barnette as little-known Senate candidate throws Pa. GOP into chaos",
  "image": "https://s.yimg.com/ny/api/res/1.2/Z4QSsQvUzcPJo2R8NZGTEw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/6febd740-d226-11ec-bbe9-22985391eff7",
  "link": "https://sg.news.yahoo.com/trump-takes-aim-at-kathy-barnette-as-little-known-senate-candidate-throws-pennsylvania-gop-into-chaos-205825802.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Wilson",
  "authorUrl": "https://www.yahoo.com/author/christopher-wilson",
  "termIds": [
    3102
  ],
  "sentences": [
    "Its also opened her to new scrutiny, including questions about her biography, her embrace of conspiracy theories and her incendiary comments about Islam, which she once said should be banned in the USA.?\nBarnettes explosive rise threatens to make next Tuesday the second straight week that a Trump-backed candidate has lost a high-profile Republican primary, after Trumps pick for governor in Nebraska was defeated this Tuesday.",
    "Although Barnette has spent a fraction of her rivals' outlay on television ads, a confluence of events  late endorsements, an alliance with the gubernatorial frontrunner, a lack of enthusiasm for other options and a viral ad about her own mothers decision not to have an abortion after being raped at age 11  has pushed her into contention.",
    "She worked with two major financial firms in corporate America and sat on the board of a pregnancy crisis center for five years.? It also says she was an adjunct professor of corporate finance.?\nZito asked for details about where and when she was a professor, her time in officer candidate school and the financial firms where she worked.",
    "PITTSBURGH  Just days before Pennsylvanias primary elections, the Republican Senate nomination has been turned upside down with a late surge from Kathy Barnette, a virtual unknown whose sudden rise has riled former President Donald Trump and his allies.",
    "But Barnettes campaign the questions, citing a need for privacy, other than to say she attended basic training at Fort Dix Army Reserves.?\nHer website that she worked for A.G. Edwards and Sons and for Bank of America Capital Asset Management.",
    "Republicans in Pennsylvania and at the national level about Mastrianos chances of winning a crucial governors seat this fall against Democratic Attorney General Josh Shapiro, who is running unopposed for his partys nomination.",
    "She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Party  and I will be behind her all the way,? Trump said.",
    "Top Trump allies, like former Ambassador Richard Grenell and Fox News host Sean Hannity, have also spent recent days warning that Barnette is unelectable and could cost Republicans their chance of retaking the Senate.",
    "The influential and well-funded Club for Growth, which is locked in a grudge match with Trump that arose out of a disagreement over which Senate candidate to support in Ohio, this week started for Barnette.",
    "Barnette is a true-blue MAGA candidate and her victory would be a message from the grassroots that they want candidates who are dependably MAGA more than they want candidates who Trump endorsed,? Bannons .",
    "Even before her recent surge, Barnette was creeping up on Oz and McCormick, who have spent months  and millions from their respective individual fortunes  pummeling each other on the TV airwaves.",
    "Salena Zito, a national political reporter for the Washington Examiner who is popular in conservative circles, to Barnettes campaign about some of the claims made on the candidates website.",
    "Oz has hit McCormick for being soft on China and alleging hes .? McCormick has hit Oz for being a Hollywood liberal,? his dual citizenship with Turkey, and on key issues such as abortion.",
    "Mastriano and Barnette have endorsed each other, have campaigned with each other in heavily Republican areas of the state and that the 2020 election was stolen by the Democrats.",
    "But the campaigns response prompted Zito to criticize it for trying to run out the clock.?\nThe conventional wisdom has been that the race would be between Oz and McCormick.",
    "Barnettes rise, experts said, is linked to her alliance with right-wing state Sen. Doug Mastriano, the leading GOP contender for governor in a nine-person primary.",
    "Barnettes campaign that she served her country proudly for 10 years in the Armed Forces Reserves where she was accepted into Officer Candidacy School.",
    "It was President Trump who shifted and aligned with our values.?\nYet questions are also being raised about her rsum ahead of the Tuesday primary.",
    "Shes a conservative commentator who moved to the state about eight years ago and failed in a bid for a Philadelphia-area House seat in 2020.",
    "And over the past week, Barnettes polling numbers have gone from around 12% in the to 21%, effectively tying her with Oz and McCormick.",
    "Multiple polls this week have shown Barnette within striking distance for the nomination to replace retiring GOP Sen. Pat Toomey.",
    "On Thursday, Trump said Barnette will never be able to win the General Election? this November against a Democratic candidate.",
    "Until the past week, Oz and former hedge fund CEO David McCormick had been locked in a tight contest for the top spot.",
    "In addition, Steve Bannon, the far-right media personality and sometime Trump adviser, on his podcast Monday.",
    "She lost the safe Democratic seat by 20 points, a result she blamed on voter fraud.",
    "In Pennsylvania, Trump has backed former daytime talk show host Dr. Mehmet Oz.",
    "But over the past few days, Barnette has also gained new allies.",
    "Our values never, never shifted to President Trumps values.",
    "MAGA does not belong to President Trump,? she ."
  ]
}