{
  "id": 6861,
  "mediaId": 19,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Republican Jake Corman Drops Out of Pennsylvania Gubernatorial Race, Endorses Lou Barletta",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1396875579-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/12/republican-jake-corman-drops-out-pennsylvania-gubernatorial-race-endorses-lou-barletta/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1282,
    1625,
    1713,
    3019,
    3102,
    146,
    393,
    428,
    2862,
    5003
  ],
  "sentences": [
    "At a time when Tom Wolf is leaving office with historically low approval ratings when the country and Pennsylvania are rejecting the Biden agenda, this is a time when were looking for new leadership.?\nIts an opportunity for Republicans to win this governors race and then to accomplish things for the people of Pennsylvania,? he continued.",
    "Pennsylvania State Senate President Pro Tempore Jake Corman (R) dropped out of the gubernatorial race Thursday and endorsed former Rep. Lou Barletta (R), calling him the man at the right time at the right place? to defeat Democrat Josh Shapiro.",
    "Corman made the announcement at a press conference in Harrisburg, Pennsylvania, saying he felt it was necessary to drop out and endorse Barletta to unite the states party against Shapiro in the general election.",
    "More recent polls show Mastriano and Barletta at the top of the Republican primary field while businessman Dave White and former U.S. attorney Bill McSwain have run consistently behind the top two candidates.",
    "Lou Barletta is perfectly positioned to get results for the people of Pennsylvania and Im proud to add my voice to support him.?\nBarletta said he appreciated Cormans support in the race.",
    "It is increasingly evident that Republicans must get behind one candidate who can win the nomination and then actually defeat Josh Shapiro in November,? Barletta said.",
    "I am proven, road-tested, and ready to lead the great Pennsylvania comeback.?\nLast month, Barletta held a slight lead against Doug Mastriano, a state senator.",
    "Lou Barletta is the man at the right time at the right place for the people of Pennsylvania and Im happy to be here today to support Lou,? Corman said.",
    "There is no question that as the Republican nominee, I can beat Shapiro because the people of Pennsylvania know me.",
    "The only way that we will not be successful in the fall is if we nominate someone who cant possibly win.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "The election is on May 17."
  ]
}