{
  "id": 6863,
  "mediaId": 19,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Republican Heavy Hitters Line Up to Back Lou Barletta in Pennsylvania",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1396875477-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/12/republican-heavy-hitters-line-up-to-back-lou-barletta-in-pennsylvania/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    905,
    1282,
    1713,
    3102,
    5341,
    5378,
    393,
    428,
    2862,
    5473
  ],
  "sentences": [
    "Thats Lou Barletta.?\nCawley said Barletta is the obvious? choice for conservatives in Pennsylvania because he is a proven fighter for our conservative ideals, which will put Pennsylvania back on the right track.?\nIf we want someone who has always been there  been a leader who does whats right no matter what the media or his political opponents say  then Lou Barletta is the candidate,? Cawley said.",
    "I have known Lou Barletta for over 20 years and he has always been a solid conservative who has never shied away from the battles that need to be fought,? Santorum said:\nHe stood on the national stage by himself when he fought against illegal immigration in Hazleton and he has proven to be able to win over Democrats, meaning he will be a strong nominee who can beat Josh Shapiro in November.",
    "Ive known Lou for many years and hes exactly who Pennsylvania needs as our next Governor,? Keller said:\nLou started his own successful business, served in an executive role as Mayor of Hazleton where he fought illegal immigration, and led the America First movement as a Congressman.",
    "Barletta also won the endorsement of Pennsylvania State Senate President Pro Tempore Jake Corman, who dropped out of the race and urged his supporters to back the former Hazleton, Pennsylvania mayor.",
    "[Emphasis added]\nAlready, Barletta has been endorsed by 15 sheriffs across Pennsylvania, the Luzerne County Republican Committee, and the Oil & Gas Workers Association, among others.",
    "Pennsylvania Attorney General Josh Shapiro, the Democrat candidate for governor, has recently released an ad suggesting he does not want to face Barletta in a general election.",
    "[Emphasis added]\nHe will unleash Pennsylvanias energy resources to create jobs, and will restore the rights of parents to be involved in their childrens education.",
    "A number of Republican heavy hitters are lining up to support former Rep. Lou Barletta (R) in the Republican primary race for Pennsylvania governor.",
    "Lou Barletta is a pro-God, pro-gun, pro-family, pro-life, pro-America public servant, and I am proud to give him my emphatic endorsement.",
    "Hes been fighting the conservative fights for nearly 20 years.?\nI am calling on all Republican voters to think about November.",
    "In my view, there is only one Republican who is the correct choice, and thats Lou Barletta,? Schweiker said.",
    "Instead, Shapiro has signaled he prefers to go up against Doug Mastriano, the Pennsylvania state senator.",
    "Importantly, he is the only Republican candidate who can win both the primary and general elections.",
    "Think about which candidate truly represents our core values and can beat Josh Shapiro,? he said.",
    "On Thursday, former Sen. Rick Santorum (R-PA) endorsed Barletta in the GOP gubernatorial primary.",
    "Jim Cawley (R) announced their endorsement of Barletta during a press conference on Thursday.",
    "Former Rep. Fred Keller (R-PA) similarly endorsed Barletta.",
    "[Emphasis added]\nLikewise, former Pennsylvania Gov.",
    "John Binder is a reporter for Breitbart News.",
    "Lou has my full support and endorsement.",
    "Mark Schweiker (R) and former Lt. Gov.",
    "Email him at jbinder@breitbart.com.",
    "His experience is unmatched.",
    "Follow him on Twitter here.",
    "We all know Lou."
  ]
}