{
  "id": 6865,
  "mediaId": 323,
  "date": "d2022-05-11T22:33",
  "headline": "The Mastriano Pileup in the Pennsylvania Elections",
  "image": "https://images.wsj.net/im-542448/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/the-doug-mastriano-pileup-in-pennsylvania-governor-election-republicans-democrats-donald-trump-11652301140",
  "sentiment": "-0.682",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    1147,
    1282,
    1713,
    1997,
    3019,
    3102,
    146,
    428,
    571,
    2862
  ],
  "sentences": [
    "His commercial calls Mr. Mastriano one of Donald Trumps strongest supporters,? saying that he led the fight to audit the 2020 election? and wrote the heartbeat bill in Pennsylvania? to help outlaw abortion.? Mr. Mastriano doesnt have the campaign cash to bombard television viewers, so Mr. Shapiro is trying to help him get the nomination.",
    "Although he said he left when the rioting began, the Philadelphia Inquirer says video appears to show Mastriano and his wife walking through breached police barricades.? Last month he spoke at an event featuring QAnon nonsense.",
    "With Mr. Mastriano at the top of the ticket, many Republicans fear a washout could also cost them control of the Legislature or the crucial Senate seat now held by Republican Pat Toomey, who is retiring.",
    "Hes a 2020 stolen-election theorist who wants to end Pennsylvanias contracts with compromised voting machine companies.? He reportedly organized buses to take people to Mr. Trumps rally on Jan. 6, 2021.",
    "Mr. Corman is scheduled Thursday to join Mr. Barletta for a major announcement,? but even if he tries to shift all his support, its only 5%, not enough to make the difference on its own.",
    "Pennsylvania Republicans will regret it if their party throws away another winnable election and delivers four more years of vetoes by another Democratic Governor.",
    "President Trump won the Republican primary in 2016 by taking roughly a third of the vote, while his squabbling opponents from the traditional GOP split the rest.",
    "Next week Pennsylvania state Sen. Doug Mastriano might pull off the same trick in the primary for Governor, and Democrats couldnt be happier to help him do it.",
    "This is an unsustainable number for a general election nominee for a party.? Those are the figures while Democrats are running TV ads to help Mr. Mastriano.",
    "Former Rep. Lou Barletta was at 17%, former U.S. Attorney Bill McSwain at 13%, businessman Dave White at 11%, and state Senate leader Jake Corman at 5%.",
    "GOP bigwigs are now frantically trying to unite those factions by getting unviable candidates to drop out and endorse a consensus pick.",
    "Mr. McSwain is anti-endorsed by Mr. Trump, who called the former U.S. Attorney a coward? for doing absolutely nothing? on voter fraud.",
    "Pennsylvania Republicans want voting reforms, and the GOP state Legislature passed some that were promptly vetoed by Democratic Gov.",
    "Mr. White has invested millions of his own money, which might be sunk cost, but he understandably wants to get to primary day.",
    "The likely Democratic nominee is Attorney General Josh Shapiro, whose latest TV ad reveals his view of the GOP field.",
    "Its hard for any candidate to throw in the towel after putting in months of sweat and asking donors to contribute.",
    "If primary voters want those bills signed, their job is to pick a conservative who can win the general election.",
    "A recent poll by Osage Research said Pennsylvania swing voters preferred a Republican Governor, 42% to 39%.",
    "The pollster said it involved Mastriano losing an astounding 23% of the swing Republicans to Shapiro.",
    "Political primaries are about campaign promises and ideology, but also temperament and electability.",
    "This will probably work about as well as it did in 2016 against Mr. Trump, which is to say, it wont.",
    "A poll by Fox News last week put Mr. Mastriano at 29% support among Republican primary voters.",
    "But asked about a race between Mr. Shapiro and Mr. Mastriano, the Democrat was up 49% to 41%.",
    "If Republicans go for it, Tuesdays primary could be the start of another Trumpian backfire.",
    "Appeared in the May 12, 2022, print edition as 'The Mastriano Pileup in Pennsylvania'.",
    "Thats a plurality only because below him theres an eight-car pileup.",
    "Bill McSwain is staying in the race,? his team said Tuesday.",
    "Mr. Barletta is in second, so hes unlikely to quit.",
    "What about when they begin really going after him?",
    "Mr. Mastriano is a long shot in November.",
    "Four others were in single digits.",
    "Tom Wolf."
  ]
}