{
  "id": 6872,
  "mediaId": 157,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Pennsylvania GOP scrambling behind closed doors to ensure Trump-backed candidate loses",
  "image": "https://www.rawstory.com/media-library/meet-the-far-right-pennsylvania-republican-who-believes-that-god-was-behind-trumps-attempted-coup.jpg?id=26721140&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/pennsylvania-gop-scrambling-behind-closed-doors-to-ensure-trump-backed-candidate-loses/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.rawstory.com/u/meaghan_ellis_alternet",
  "termIds": [
    3102
  ],
  "sentences": [
    "Those concerns have led to discussions among the campaigns of which I have been occasionally involved.?\nReilly also added that the state party voted not to endorse a candidate, any decision a campaign makes to endorse another candidate, suspend their campaign or stay in the race is entirely the decision of that campaign.?\nMike Conallen, the former chief of staff for Rep. Brian Fitzpatrick (R-Pa.) who now serves as a Republican strategist in Pennsylvania, also explained why he believes Mastriano will have the most difficult time clinching a gubernatorial win.",
    "As the primary election approaches, \"GOP gubernatorial campaigns and leading state and county officials have been in discussions about uniting behind a single candidate to avoid a scenario in which Mastriano wins the crowded race by taking advantage of a splintered vote.",
    "And it appears here in Pennsylvania, because of the number of people in the race and his smaller but consistent base of support, we may be nominating the only Republican who would be unelectable in November.?\nReilly also released a statement detailing his concerns.",
    "I think there is a significant level of concern that Mastriano, of all of the primary candidates, will have the most difficult time in the general, just because of the level of his conservative viewpoints and policies,? said Conallen.",
    "Last week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of Doug Mastriano in the Republican primary, it raised concerns among the campaigns.",
    "Speaking to Politico, Andy Reilly, a Republican National Committee (RNC) member, Sam DeMarco, who served as the Allegheny County Republican Party chair, and other sources opened up about their concerns.",
    "There was the general consensus that even though he was the most likely to win the primary, he was going to have the toughest time in the general.?\nStories Chosen For You",
    "In a statement to POLITICO, Reilly said, As National Committeeman, I have spoken regularly with almost all of the gubernatorial campaigns over the past [three] months.",
    "appears to be the frontrunner and Republican leaders are reportedly working tirelessly behind the scenes to ensure he does not end up with the Republican nomination.",
    "Republicans in Pennsylvania are expressing growing concern about the possibility of the party being defeated in November for the state's gubernatorial election.",
    "Theres so much that concerns me about this,? DeMarco told the news outlet as he specified that he was only speaking for himself as opposed to the entire group.",
    "The Republican candidate, who has been a vocal supporter of Trump and his voter fraud conspiracies, leans heavily to the far right.",
    "If that doesnt work, another option is persuading the candidates in single-digits in the polls to drop out.\"",
    "Were in a year where all evidence points to a red tsunami.",
    "For Conallen, it seems that may be a bit problematic.",
    "According to Politico, Sen. Doug Mastriano (R-Penn.)"
  ]
}