{
  "id": 6881,
  "mediaId": 151,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Ultra-MAGA longshot roars into contention in key Senate race",
  "image": "https://www.politico.com/dims4/default/efc7bcd/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F32%2F56%2F12f468e648b09ed97b30d2be321e%2F220509-kathy-barnette-ap.jpg",
  "link": "https://www.politico.com/news/2022/05/10/kathy-barnette-pennsylvania-senate-gop-primary-00031262",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1653,
    1747,
    1839,
    2491,
    3102,
    5418,
    571,
    2862
  ],
  "sentences": [
    "A former Trump aide described Barnette as running in the hardcore MAGA lane despite the Trump endorsement of Oz.? On his show, Bannon said others call her pure MAGA  in fact, Kathy Barnette may be ultra-MAGA.?\nOne example of her purist approach: in an April debate, Barnette said MAGA does not belong to President Trump.?\nOur values never, never shifted to President Trumps values,? she said.",
    "He endorsed her and she endorsed him, and I said at the time she got the better of that deal.?\nA Monmouth University poll in late April found that 18 percent of Republican primary voters said they were very likely? to back Barnette, compared to 22 percent for Oz and 19 percent for McCormick.",
    "Barnettes apparent rise is surprising just because of the lack of notoriety or resources compared to some of the other candidates in that race,? said Brian Nutt, a Pennsylvania-based Republican strategist who is not working for a candidate in the contest.",
    "And its these plastic, little run-of-the-mill political ads.?\nBarnette has used forums and debates to talk about her striking biography: She has described herself as a product of a rape,? whose mother was only 11 years old when she was conceived.",
    "I do really like her.?\nGOP consultants said another factor that helps explain her bump in the polls is her link to state Sen. Doug Mastriano, the frontrunner in the states GOP primary for governor.",
    "Rob Gleason, former chair of the states Republican Party, said it would be the story of the century if she would win.?\nIm not so sure that she is in the mix,? said Gleason, who endorsed McCormick.",
    "And, according to Republican strategists and officials across the state, Barnette is likely benefiting from a smashmouth primary that features Oz and McCormick going nuclear on each other on TV.",
    "Steve Bannon, the former White House chief strategist to Trump, invited Barnette onto his War Room: Pandemic? podcast Monday and marveled at her momentum: Stunning polling coming out last night.",
    "This time around, her opponents Mehmet Oz and David McCormick have spent $12.4 million and $11.4 million on television commercials, respectively, according to the ad-tracking firm AdImpact.",
    "I cant even believe that she would be in the mix the way these guys have spent money.?\nIf Barnette is surging, it would show that parts of the MAGA movement have outpaced Trump himself.",
    "Other contenders in the race include real estate developer Jeff Bartos and former Trump ambassador Carla Sands, both of whom were in low single digits in the Franklin & Marshall poll.",
    "She went on to become a veteran, adjunct professor of corporate finance, and author of Nothing to Lose, Everything to Gain: Being Black and Conservative in America.?\nI think its real.",
    "| Matt Rourke/AP Photo\nBy Holly Otterbein\n 05/10/2022 04:30 AM EDT\nPHILADELPHIA  Kathy Barnette has been outspent 358-to-1 on TV in Pennsylvanias GOP primary for the Senate.",
    "And what was said about her was, Boy, I really like her, but she cant win,? said Chris Mottola, a GOP consultant and Pennsylvania native who is not involved in the race.",
    "In a poll by Franklin & Marshall College released this month, Barnette received a more modest 12 percent, behind McCormick at 16 percent and Oz at 18 percent.",
    " And shes basically in a dead heat.?\nIn an interview, Barnette said she has been successful because voters are looking for authenticity? amid the TV ad wars.",
    "But the ultra-MAGA commentator is surging in the polls anyway in the final weeks of one of the most expensive and closely watched races in the country.",
    "GOP voters have been inundated with attack ads slamming Oz as a RINO? and McCormick as a stooge for China, leading some to look for a third option.",
    "Multiple sources also told POLITICO that in private polling conducted by both Democrats and Republicans, Barnette has seen a surge in recent weeks.",
    "Barnettes unlikely  and, to some, unbelievable  rise has turned heads in political circles across the state because it defies political logic.",
    "Ive had grassroots political people tell me for a while that when theres candidate forums, shes the one who has the most enthusiasm.",
    "A more recent horse-race survey by Trafalgar Group reported Barnette at 23 percent, Oz at 25 percent and McCormick at 22 percent.",
    "Mastriano worked to overturn the 2020 presidential election and recently appeared at an event that promoted Q-Anon propaganda.",
    "Her numbers are starting to line up with Mastrianos,? said Christopher Nicholas, a longtime Pennsylvania-based GOP consultant.",
    "He also went to the Capitol on Jan. 6, and has been subpoenaed by the congressional committee investigating the insurrection.",
    "Barnette said she has raised more money on WinRed, the digital fundraising platform, this week than any other in the race.",
    "Kathy Barnettes unlikely  and, to some, unbelievable  rise has turned heads in political circles across the state.",
    "Barnette has a purists zeal, a compelling life story, and the ability to tell it to Republican grassroots voters.",
    "Unless theres some high-falutin press conference or debates or events to go to, its overwhelmingly on television.",
    "She said at a debate that it is absolutely not? time for the GOP to move past the presidential election.",
    "Some Pennsylvania Republicans are skeptical that Barnettes polling should be believed.",
    "Just two years ago, she lost a House bid in the Philadelphia suburbs by a wide margin.",
    "That still represented a small uptick for Barnette from its prior survey of the race.",
    "Mastriano and Barnette have endorsed each other and campaigned alongside each other.",
    "With Oz and McCormick just savaging each other, they wind up with high negatives.",
    "Other candidates and outside groups have bankrolled $25 million more in spots.",
    "Like Mastriano, Barnette has made false statements about voter fraud in 2020.",
    " Oz and McCormick combined, I think, have spent $24 million, combined.",
    "It was President Trump who shifted and aligned with our values.?",
    "Barnette, on the other hand, has spent a paltry $137,000 on TV.",
    "She doesnt have former President Donald Trumps endorsement.",
    "All of a sudden, youre like, Well, why not vote for her?",
    "As a child, she lived on a pig farm without insulation.",
    "Oz has also won a highly sought-after nod from Trump.",
    "That is their campaign,? she said of her opponents.",
    "She hasnt run for statewide office before.",
    "He has said he left before the riot.",
    "Theyre spending $50 million on ads.",
    "$24 million!"
  ]
}