{
  "id": 6892,
  "mediaId": 129,
  "date": "d2022-05-08T00:00",
  "headline": "Midterms Biggest Abortion Battleground: Pennsylvania",
  "image": "https://static01.nyt.com/images/2022/05/09/lens/09pol-pa-abortion-01/merlin_206357274_38f563dd-d288-4b12-8e51-bd0fdf945272-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/08/us/politics/midterms-abortion-pennsylvania.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1713,
    3102,
    146,
    428,
    2991,
    2791,
    2862,
    2972
  ],
  "sentences": [
    "Lou Barletta, a former congressman and one of two front-runners in the race, has said he would sign any bill that comes to my desk that would protect the life of the unborn.?\nAnother top candidate, Doug Mastriano, said in a recent debate that he was opposed to any exceptions  for rape, incest or the health of the mother  in an abortion ban.",
    "The fall of Roe will make that less likely to happen.? Shavonnia Corbin-Johnson, political director of the State Democratic Party, said that the end of abortion access would add to compounding racial disparities and maternal health? for minority communities, and that the party was planning to organize aggressively around the issue.",
    "In Hanover Township, outside Allentown, an affluent suburb in a onetime Republican enclave that has trended blue, Dave Savage and Vincent Milite, both center-right voters, were analyzing the abortion issue through the eyes of their adult daughters, while loading groceries outside a Wegmans supermarket.",
    "That reminds me every time I fill up, I want a change.?\nPennsylvanias large Roman Catholic population  about one in five adults  has afforded electoral space for a tradition of anti-abortion Democratic officials, including Senator Bob Casey Jr., and his father, Bob Casey Sr., who served as governor.",
    "Never!?\nPennsylvania, one of a handful of states where abortion access hangs in the balance with midterm elections this year, is a test case of the political power of the issue in a post-Roe world, offering a look at whether it will motivate party bases or can be a wedge for suburban independents.",
    "On that issue alone.?\nLinda Ward, also a Republican, said the states current law allowing abortion up to 24 weeks was reasonable.?\nBut Ms. Ward said she would vote for a Republican for governor, even though all the leading candidates vowed to sign legislation sharply restricting abortion.",
    "My position is, I dont have a vagina so I have no skin in the game.?\nMr. Milite read aloud a text between his two daughters, abortion-rights supporters, in reaction to a Facebook post by a cousin who wrote sharply of her opposition to abortion after the Supreme Court leak.",
    "Every one of my opponents would sign it into law, and I would veto it.?\nFrom Opinion: A Challenge to Roe v. Wade\nCommentary by Times Opinion writers and columnists on the Supreme Courts upcoming decision in Dobbs v. Jackson Womens Health Organization.",
    "HANOVER TOWNSHIP, Pa.  Jan Downey, who calls herself a Catholic Republican,? is so unhappy about the Supreme Courts likely reversal of abortion rights that she is leaning toward voting for a Democrat for Pennsylvania governor this year.",
    "After a draft of a Supreme Court opinion that would end the constitutional guarantee of abortion rights was leaked last week, Republicans downplayed the issue, shifting attention instead to the leak itself and away from its substance.",
    "They also argued that voters attentions were fleeting, that abortion was hardly a silver bullet for Democratic apathy and that more pressing issues  inflation and President Bidens unpopularity  had already cast the midterm die.",
    "Mr. Shapiro, the states attorney general, has been primarily known for defeating multiple cases brought by supporters of Donald J. Trump claiming fraud after he lost Pennsylvania by 80,000 votes in 2020.",
    "With Trump no longer aggravating suburban voters every week, Republicans were hoping to regain traction in the Philadelphia suburbs in 2022,? said J.J. Balaban, a Democratic strategist in the state.",
    "I expect that level of concern, of fear, of worry, of anger is going to continue.?\nAll four of the top Republicans heading into the primary on May 17 have said they favor strict abortion bans.",
    "A law that the senior Casey pushed through the legislature in the 1980s included some abortion restrictions, which was challenged in the 1992 Supreme Court case Planned Parenthood v. Casey.",
    "When Mr. Shapiro began his campaign last year, he focused on voting rights, but he said in an interview last week that he expected the general election to become a referendum on abortion.",
    "In four states with politically divided governments and elections for governor this year  Pennsylvania, Michigan, Wisconsin and Kansas  the issue is expected to be a fulcrum of campaigns.",
    "The ruling struck down laws in many states that had barred abortion, declaring that they could not ban the procedure before the point at which a fetus can survive outside the womb.",
    "A broad middle group, 53 percent, said abortion should be legal under certain circumstances.?\nThe issue had not ranked high among the states voters before the Supreme Court leak.",
    "The legislature is going to put a bill on the desk of the next governor to ban abortion,? said Josh Shapiro, a Democrat running unopposed for the partys nomination for governor.",
    "Pennsylvania, which has a conservative Republican-led legislature and a term-limited Democratic governor, is the only one of the four states with an open seat for governor.",
    "Jamelle Bouie: The leak proves that the Supreme Court is a political body, where horse-trading and influence campaigns are as much a part of the process as legal reasoning.",
    "In Michigan and Wisconsin, which have anti-abortion laws on the books predating Roe, Democratic governors and attorneys general have vowed to block their implementation.",
    "I dont have any kids, and I dont plan on having any yet, but if I was in a situation that required me to, I should be able to? choose the fate of a pregnancy, she said.",
    "In a Monmouth University poll last month, abortion was cited as one of Pennsylvania voters top two issues by just 5 percent of Democrats and 3 percent of Republicans.",
    "Mr. Savage, 63, said that his 30-year-old daughter felt strongly that abortion should be legal, and that therefore it would be an important issue for him in November.",
    "Democrats are worried, in Pennsylvania and around the country, that their 2020 coalition lacks motivation this year after expelling Mr. Trump from the White House.",
    "Speaking from Philadelphia after a road trip from his home in western Pennsylvania, Mr. Gleason said: I stopped on the turnpike and paid $5.40 a gallon for gas.",
    "There were so many people that thought that this could never happen.?\nIf Roe v. Wade is overturned, the power to regulate abortion would return to the states.",
    "Soleil Hartwell, 19, who works in a big-box store near Bethlehem, is typical of voters who drop off in midterm elections after voting in presidential years.",
    "Democratic operatives hope abortion will keep those independent voters  who have since swung against the president in polls  from defecting to Republicans.",
    "Mr. Mastriano, a state senator, has introduced a bill in Harrisburg to ban abortions after a fetal heartbeat? is detected, at about six weeks of pregnancy.",
    "Still, support for abortion rights in Pennsylvania has gradually increased, according to polling by Franklin & Marshall College over more than a decade.",
    "Im going to be talking about rights  from voting rights to reproductive rights  until the polls close at 8 p.m. on Election Day,? Mr. Shapiro said.",
    "He rejected the notion that voters, whose attention spans can be short, will absorb a major Supreme Court reversal and move on by the fall.",
    "The leaked draft of the courts opinion last week, written by Justice Samuel Alito, would overturn the Casey ruling along with Roe.",
    "Im a Republican because this county was always Republican.?\nHe said he was undecided about whom to support in this months primary.",
    "In the third, it allowed states to ban abortions so long as exceptions were made to protect the life and health of the mother.",
    "A retired municipal employee, Mr. Savage said he was an independent voter but had primarily voted Republican most of his life.",
    "Justice Harry A. Blackmun, a modest Midwestern Republican and a defender of the right to abortion, wrote the majority opinion.",
    "Last month, 31 percent of registered voters said abortion should be legal in all circumstances, up from 18 percent in 2009.",
    "The practice would likely be banned or restricted heavily in about half of them, but many would continue to allow it.",
    "Another Republican bill would require death certificates and a burial or cremation after miscarriages or abortions.",
    "Thirteen states have so-called trigger laws, which would immediately make abortion illegal if Roe were overturned.",
    "After whats happened this past year, I will never vote for a Democrat,? said Ms. Ward, a retired church employee.",
    "Those calling for abortion to be illegal in all circumstances declined to 16 percent, from 22 percent in 2009.",
    "Whats going to happen is, youre going to lose a lot of Republican votes? over abortion, Mr. Milite predicted.",
    "Kansas voters face a referendum in August on codifying that the state constitution does not protect abortion.",
    "As many as 28 states are likely to ban or tightly restrict abortion, according to a New York Times analysis.",
    "The court upheld most of the states restrictions, while affirming Roe v. Wades grant of a right to abortion.",
    "It was suburbanites, especially outside Philadelphia, who gave Mr. Biden his winning edge in the state.",
    "His campaign said it had its best day of fund-raising after the Supreme Court draft leaked last week.",
    "Patrick T. Brown: If Roe is overturned, those who worked toward that outcome will rightly celebrate.",
    "It might mean overcoming ones own hesitation to provide procedures like second-trimester abortions.",
    "Their people are depressed,? said Rob Gleason, a former chair of the Pennsylvania Republican Party.",
    "Roe v. Wade created a framework to govern abortion regulation based on the trimesters of pregnancy.",
    "Roe v. Wade is a landmark Supreme court decision that legalized abortion across the United States.",
    "Jay Kaspian Kang: There is no clear path toward a legislative solution to protect abortion rights.",
    "Come November, he would not support a candidate for governor who opposed abortion rights, he said.",
    "These are terrifying times,? said Nancy Patton Mills, chair of the Pennsylvania Democratic Party.",
    "I would never have an abortion, but I dont have the right to tell? others what to do, she wrote.",
    "The listlessness extends to Black, Latino and younger voters, as well as suburban swing voters.",
    "Individual states would be able to decide whether and when abortions would be legal.",
    "Mr. Milite, a supervisor in municipal government, said he supported his daughters.",
    "The leading Republicans running for governor in the state want to outlaw abortion.",
    "Alison Block: Offering compassionate care is a core aspect of reproductive health.",
    "Republicans are deeply skeptical that abortion can reanimate the Democratic base.",
    "In 1992, the court tossed that framework, while affirming Roes essential holding.",
    "That point, known as fetal viability, was around 28 weeks when Roe was decided.",
    "Bret Stephens: Roe v. Wade was an ill-judged decision when it was handed down.",
    "She is disgusted with inflation, mask mandates and woke philosophy,? she said.",
    "I unfollowed her immediately,? one of Mr. Milites daughters texted the other.",
    "But overturning it would do more to replicate its damage than to reverse it.",
    "But Ms. Hartwell said she would vote this year to protect abortion rights.",
    "In the second, it allowed regulations to protect womens health.",
    "The presumptive Democratic nominee promises to veto any ban.",
    "Today, most experts estimate it to be about 23 or 24 weeks.",
    "But a broader pro-family agenda should be their next goal.",
    "His vote in the general election also seemed up for grabs.",
    "In the first trimester, it allowed almost no regulations.",
    "The State of Roe v. Wade\nCard 1 of 4\nWhat is Roe v. Wade?",
    "Im a Republican, but Im a moderate Republican,? he said.",
    "Inflation topped the concerns of voters in both parties.",
    "Thats precisely why people need to take to the streets.",
    "Nothings going to be able to save them this year.",
    "I think its going to hurt the Republican Party.?",
    "The 7-2 ruling was announced on Jan. 22, 1973.",
    "To Democrats, this time really is different.",
    "What would happen if Roe were overturned?",
    "People are very concerned about this.",
    "What else did the case do?",
    "What was the case about?",
    "Absolutely,? she said."
  ]
}