{
  "id": 6897,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "LOL! Watch Members Of The MAGA Crowd Boo Dr. Oz (R. NJ) At Trump Rally",
  "image": "https://images.dailykos.com/images/1067138/story_image/20220506emDrOz04-1651885160.jpeg?1651906007",
  "link": "https://www.dailykos.com/story/2022/5/7/2096487/-PA-Sen-LOL-Watch-Members-Of-The-MAGA-Crowd-Boo-Dr-Oz-R-NJ-At-Trump-Rally",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1304,
    1653,
    1765,
    2087,
    2409,
    3102,
    3960,
    2682,
    2820,
    2940
  ],
  "sentences": [
    "One of his ads states that Mastriano is one of Donald Trumps strongest supporters.? Shapiro goes on to say Mastriano is ahead in the polls,? would outlaw abortion,? that he wants to end vote by mail, and he led the fight to audit the 2020 election.?\nHe ends by saying, If Mastriano wins, its a win for what Donald Trump stands for.?\nHes not only running ads to boost Mastriano's name recognition and advertise his conservative bona fides.",
    "Governor\nAustin Davis\nBrian Sims\nPennsylvania Organizations\nAll In Pennsylvania\nPennsylvania Democratic Party\nPennsylvania House Democratic Campaign Committee\nPennsylvania Senate Democratic Campaign Committee\nCongress:\nSummer Lee for Congress\nSean Meloy for Congress\nChris DeLuzio for Congress\nJerry Dickinson for Congress\nMatt Cartwright\nSusan Wild\nChrissy Houlahan\nMadeleine Dean\nDwight Evans\nMary Gay Scanlon",
    " Im running as a guy who grew up here and went away to serve our country and wants to carry those conservative values to Washington, and someone whos lived them his whole life.?\nAs Oz, McCormick and their allied super PACs have flooded the airwaves with tens of millions of dollars worth of commercials  many of them negative  some voters have looked for an alternative.",
    "Citing the revelation of a photo this week that showed the American-born Oz, a dual citizen of the United States and his parents' native Turkey, casting a ballot in the 2018 Turkish presidential election, Pompeo called on Oz's campaign to \"explain why he had time and energy and focus to vote in a Turkish election, but not in an American election.\"",
    "\"Maybe it's all innocent, maybe it's all straight up, but we and the people of Pennsylvania and the Americans who he will be representing as one of a hundred members of the United States Senate voting on important national security matters need to understand the scope and depth of his relationship with the Turkish government,\" Pompeo said.",
    "pic.twitter.com/sKScrzaNB4\n Daniel Marans (@danielmarans) May 6, 2022\nAnd Trump still told the crowd to not support David McCormick (R. PA) in the May 17th primary:\nFormer President Donald Trump chastised Pennsylvania Republican Senate contender David McCormick over his ties to China and Senate Minority Leader Mitch McConnell on Friday.",
    "Despite spending a pittance on ads  less than $120,000, according to the advertising tracking firm AdImpact  18 percent of Republican voters said they were very likely? to cast a ballot for conservative commentator Kathy Barnette in the latest Monmouth University poll.",
    "McCormick served as undersecretary of the treasury for international affairs during the Bush administration and turned down an offer from Trump to serve as the U.S. deputy secretary of defense when he was CEO of Bridgewater Associates, which has investments in China.",
    "pic.twitter.com/loRIoTvnFX\n Daniel Marans (@danielmarans) May 6, 2022\nAs the music that welcomed Dr. Mehmet Oz onto the stage tapered off on Friday night, boos from a segment of the crowd of diehard Donald Trump supporters became more audible.",
    "If Mastriano wins the Republican primary in Pennsylvania, he may well cost Republicans the Senate race that will share the ballot this fall, a couple of congressional races, and perhaps even majorities in the state House and state Senate.",
    "But all the money and fighting between Oz and McCormick might help boost one candidate in the primary:\nMcCormick also shifted his advertising strategy in the wake of Trumps endorsement  a sign of the threat it could pose to his campaign.",
    "This isnt the only race with a high profile GOP candidate though could do more harm than good to the GOPs chances in November:\nDemocrat Josh Shapiro wants Doug Mastriano to win the Pennsylvania Republican primary for governor on May 17.",
    "And the reason is that hes got a whole set of positions from a life in media, a life in television, and all of them are counter to what Pennsylvanians believe in terms of the Second Amendment, in terms of life, in terms of fracking.",
    "McCormick has been trying to take down Oz over this:\nIn a Friday press briefing organized by McCormick's campaign, former US Secretary of State Mike Pompeo spoke about Oz's \"connection to the Turkish government.\"",
    "Standing in the rain at a rally in Greensburg, Pennsylvania, to bolster TV celebrity Dr. Mehmet Oz, who is locked in a tight race with McCormick, the former president panned McCormick for not being \"MAGA\" enough.",
    " Daniel Marans (@danielmarans) May 6, 2022\nBut even with the boos, Trumps endorsement still helps him:\nx\nLouis Riffle, an oil and gas rig worker, isnt that into politics but will vote Oz cus Trump endorsed him.",
    "She asserted that his Turkish citizenship posed no security threat to the United States and noted that Oz \"has already said when elected to the Senate he would renounce his citizenship.\"",
    "A few days after his announcement, McCormick began airing an ad calling Oz a complete and total fraud.? He has since run an ad showcasing him riding a motorcycle with Trump supporters.",
    "Behind the scenes, McCormick told friends he sought Trump's support in his bid for Senate but would draw a line at parroting Trump's 2020 election fraud claims, the Bulwark reported.",
    "Click below to donate and get involved with Fetterman, Shapiro and these Pennsylvania Democrats campaigns:\nGovernor\nJosh Shapiro for Governor\nU.S. Senate\nJohn Fetterman\nLt.",
    "I love that youre out here in the rain in Westmoreland, and I know why youre excited: Because the only thing that Joe Biden has built back better is the Republican Party.",
    "Hours of torrential rain turned the dirt surface beneath the Trump fans feet into ankle-deep mud, prompting rally-goers to take turns seeking shelter in the grandstands.",
    "pic.twitter.com/ruGzLpuAZf\n Daniel Marans (@danielmarans) May 6, 2022\nTo be fair, he did get applause for this:\nx\nOzs biggest applause line is a promise to fire Fauci.",
    "He is bragging privately how malleable and gullible Republican voters are on not picking up on the fact that a Mastriano primary win means a Shapiro win in November.",
    "Here are some more responses from the rally:\nx\nCarrie Hamley, a Greensburg small business owner supporting Kathy Barnett, explained to me why theyre booing.",
    "That is not mere speculation  the well-funded Democratic gubernatorial candidate has made it a priority to help Mastriano in the campaign's closing days.",
    "Asked what his message is to Trump voters, McCormick told POLITICO that President Trump is incredibly popular in Pennsylvania for all the right reasons.",
    "pic.twitter.com/B4N5Pqwf2E\n Daniel Marans (@danielmarans) May 6, 2022\nx\nJoe Castellano Sr. and Joe Castellano Jr. are also skeptical of Dr. Oz.",
    "Try telling any of these voters who has amassed a cultish following that Mastriano has a lot of issues, and they dig in and support him more.",
    "The 2018 photo, posted on the Facebook page of the Turkish Consulate General in New York, shows Oz placing a paper ballot into a ballot box.",
    "Dr. Mehmet Oz (R. NJ)\nFigured everyone would get a kick out of this:\nx\nI have yet to meet anyone here who is a firm supporter of Dr. Oz.",
    "Ozs name ID is so high that we all know hes not a conservative.?\nWe will find out who will emerge from the GOP primary on May 17th.",
    "In February, Oz told Washington Post columnist Josh Rogin that he had \"never been politically involved in Turkey in any capacity.\"",
    "The only thing more mediocre than the reception Oz received was the poor weather at the Westmoreland County Fairgrounds.",
    "Twenty-two percent of GOP voters said they were very likely to back Oz, while 19 percent said the same of McCormick.",
    "The post noted that Turkish citizens registered on foreign electoral rolls were eligible to vote at the consulate.",
    "Oz campaign spokeswoman Brittany Yanick called the criticisms from McCormick's campaign \"pathetic and xenophobic.\"",
    "That would be a pretty remarkable feat in a year when Republicans are expected to succeed throughout the country.",
    "Oz responded by trying to butter up the crowd with one of his favorite partisan lines about President Joe Biden.",
    "Do I have it right??\nThe audience, which was there primarily to hear Trump speak, reacted with mild applause.",
    "By the time Trump came to speak, more than an hour after Oz, the crowd proved more receptive to his pitch.",
    "This was before he was going to run, and then all of a sudden he said, 'Boy, I like this guy a lot.'\"",
    "Health and Democracy are on the ballot this year and we need to get ready to keep Pennsylvania Blue.",
    "Yet everywhere you go across rural Pennsylvania, there are Mastriano campaign signs for governor.",
    "Another features Republicans saying that, while they love Trump, he made a mistake in backing Oz.",
    "They are in yards, parking lots, along the sides of highways, and along the side of buildings.",
    "This is the opponent backed by Mitch McConnell, the old crow, the old broken-down crow.",
    "She did not respond to questions about whether Oz voted in any US elections in 2018.",
    "His America-first agenda helped Pennsylvania.?\nBut, he said, Mehmet Oz isnt popular.",
    "In fact, theres a whole section of people that boos every time he appears on screen.",
    "Trump even welcomed Oz back on stage to address the crowd briefly alongside him.",
    "Mitch McConnell is the least popular politician in the country,\" Trump said.",
    "While polling is sparse, its another indication that the race is fluid.",
    "But the central tension of the evening had already been laid bare.",
    "The recurring theme is doubts about his conservative credentials.",
    "\"David came out very strongly against me on numerous occasions.",
    "Oz gets the endorsement, and I get the benefit,? said Barnette.",
    "The margin of error was plus or minus 4.9 percentage points.",
    "ABC News first reported the existence of the picture.",
    "I love you guys, Pennsylvania!? he declared.",
    "He walks off and Trump hasnt yet arrived.",
    "Catch it at the end of this video.",
    "Because name ID works both ways.",
    "\"David is totally controlled.",
    "Hes probably not wrong.",
    "Mastriano is that bad.",
    "Why is that?"
  ]
}