{
  "id": 6900,
  "mediaId": 237,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "In Pennsylvania, a Doug Mastriano win would cost the GOP the House and Senate in that state",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/aa8fc7d/2147483647/strip/true/crop/3000x1575+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F46%2F5c%2F67e9626a4b198175fdcbc3d16222%2Fap20315542867284-1.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/columnists/in-pennsylvania-a-doug-mastriano-win-would-cost-the-gop-the-house-and-senate-in-that-state",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://www.washingtonexaminer.com/opinion/author/salena-zito",
  "termIds": [
    1147,
    1713,
    1997,
    2124,
    3102,
    146,
    428,
    562,
    571,
    2862
  ],
  "sentences": [
    "One of his ads states that Mastriano is one of Donald Trumps strongest supporters.? Shapiro goes on to say Mastriano is ahead in the polls,? would outlaw abortion,? that he wants to end vote by mail, and he led the fight to audit the 2020 election.?\nHe ends by saying, If Mastriano wins, its a win for what Donald Trump stands for.?\nHes not only running ads to boost Mastriano's name recognition and advertise his conservative bona fides.",
    "\"When I introduced myself to him weeks ago, he told me his name was Spartacus.?\nLike countless conservative grassroots activists interviewed for the story, Breakiron said that if Mastriano is the Republican nominee, down-ballot carnage \"is just what will happen.?\nMastriano is known for wearing spurs everywhere he goes and giving elaborate and often uncomfortable speeches.",
    "Part of the problem is the ridiculous number of candidates running for the nomination  currently, there are nine, including former Rep. Lou Barletta, state Senate President Pro Tempore Jake Corman, Republican strategist Charlie Gerow, former Rep. Melissa Hart, former U.S. Attorney Bill McSwain, Delaware County businessman Dave White, and heart surgeon Nche Zama.",
    "If Mastriano wins the Republican primary in Pennsylvania, he may well cost Republicans the Senate race that will share the ballot this fall, a couple of congressional races, and perhaps even majorities in the state House and state Senate.",
    "This week, he became agitated and abruptly ended a podcast interview when asked about his attendance at a QAnon-linked event in Gettysburg, as well as the rally he attended just before the Jan. 6 attack on the Capitol.",
    "He could get the nomination just because there are so many people in the race; the latest Franklin and Marshall College polling shows that a whopping 40% of Pennsylvania Republican primary voters are undecided.",
    "He is bragging privately how malleable and gullible Republican voters are on not picking up on the fact that a Mastriano primary win means a Shapiro win in November.",
    "Pollsters for multiple campaigns in the state say Mastriano is the only one out of the nine who has been leading in their internal polling outside of \"undecided.\"",
    "As one grassroots activist said: I am certainly no mainline insider committee person, but I understand how bad he would impact races up and down the ticket.",
    "If there was one race I would have wished Trump endorsed in in the state, it would be this one, except then, you worry he would have endorsed Mastriano.?",
    "That is not mere speculation  the well-funded Democratic gubernatorial candidate has made it a priority to help Mastriano in the campaign's closing days.",
    "Try telling any of these voters who has amassed a cultish following that Mastriano has a lot of issues, and they dig in and support him more.",
    "Mastriano, a retired Army colonel elected to the state Senate in 2019, has emerged as a front-runner with a small core group of supporters.",
    "My concern is his egotism,\" said Dr. Garrett Breakiron, a supporter of White and the chairman of the Fayette County Reagan Republicans.",
    "Ten years ago, more than half of these candidates would have been told by a strong state party apparatus to get out of the race.",
    "Just In...\nDemocrat Josh Shapiro wants Doug Mastriano to win the Pennsylvania Republican primary for governor on May 17.",
    "That would be a pretty remarkable feat in a year when Republicans are expected to succeed throughout the country.",
    "The House committee investigating the Jan. 6 attack subpoenaed him in March about his involvement.",
    "Yet everywhere you go across rural Pennsylvania, there are Mastriano campaign signs for governor.",
    "They are in yards, parking lots, along the sides of highways, and along the side of buildings.",
    "But state party leaders are just figureheads today.",
    "Hes probably not wrong.",
    "Mastriano is that bad."
  ]
}