{
  "id": 6903,
  "mediaId": 237,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Shapiro ad seeks to boost Doug Mastriano in Pennsylvania gubernatorial contest",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/8515903/2147483647/strip/true/crop/2520x1323+235+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F38%2F2a%2F4b3ffeae4a25a678780cf891e671%2Fap22091697708672.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/shapiro-ad-seeks-to-boost-doug-mastriano-in-pennsylvania-gubernatorial-contest",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    3102
  ],
  "sentences": [
    "Democratic gubernatorial candidate Pennsylvania Attorney General Josh Shapiro recently launched a campaign advertisement designed to boost state Sen. Doug Mastriano, a Republican candidate some in the party worry may not fare well in the general election.",
    "Mastriano recently abruptly ended a podcast interview when questioned about a QAnon-linked event he attended in Gettysburg as well as his attendance at the Washington, D.C., rally before the Jan. 6 Capitol riot.",
    "Mastriano is a front-runner in a crowded Republican gubernatorial field, although many voters remain undecided ahead of the states May 17 primary.",
    "As of press time, Trump has not yet endorsed a Republican candidate in the crowded race, although he may do so at his Friday rally in Greensburg.",
    "The Shapiro ad introduces Mastriano as the Republican who's ahead in the polls for governor.?\nHe wants to outlaw abortion,? the ad states.",
    "He will go on to face the winner of the Republican primary in November in a race Cook Political Report has ranked as a toss-up.",
    "A staunch supporter of former President Donald Trump, Mastriano backed his unfounded claims that the 2020 election was stolen.",
    "It's Mastriano who wrote the heartbeat bill in Pennsylvania, and he's one of Donald Trump's strongest supporters.",
    "Is that what we want in Pennsylvania??\nShapiro secured the Democratic nomination virtually uncontested.",
    "In running the ad about Mastriano, Shapiro appears to agree with that assessment.",
    "Tom Wolf is term-limited and cannot seek reelection to a third consecutive term.",
    "He wants to end vote by mail, and he led the fight to audit the 2020 election.",
    "If Mastriano wins, it's a win for what Donald Trump stands for.",
    "The Keystone States incumbent Democratic Gov."
  ]
}