{
  "id": 6904,
  "mediaId": 558,
  "date": "d2022-05-06T10:25",
  "headline": "Protective order against lieutenant gov candidate tossed",
  "image": "https://s.yimg.com/ny/api/res/1.2/iNN4F923F.Wp7sLeDtbwtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/RRikCdcKPyLkP7oN5phKfQ--~B/aD00NTg7dz02NTA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cp.org/c1f745fd0d6a7d2ac57f25598b83a88b",
  "link": "https://ca.news.yahoo.com/protective-order-against-lieutenant-gov-172543875.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102,
    428,
    2862
  ],
  "sentences": [
    "HONESDALE, Pa. (AP)  A judge dismissed a temporary protective order against a candidate for Pennsylvania lieutenant governor on Friday after his attorneys attacked the motivation and credibility of the candidate's wife, who had testified he was verbally abusive and made threats.",
    "She said Daniels then told her: And if I find out you're in on it, you're going down too.?\nDaniels' lawyers pointed out the woman had not previously reported the alleged threat, either to police or in her application for a protective order.",
    "Daniels' wife, who had obtained a temporary protection-from-abuse order against Teddy Daniels last week, testified that Daniels was incensed because he believed her family was cooperating in an unflattering magazine story about him.",
    "Im going to go see my son.?\nDaniels, 47, is one of nine candidates seeking the GOP nomination in the states May 17 primary, running with the endorsement of a leading candidate for governor, Republican state Sen. Doug Mastriano.",
    "Obviously the court believed that, or the court would not have dismissed and denied the protection from abuse.?\nNeither Daniels' wife nor her lawyer had any immediate comment after the court hearing.",
    "Teddy Daniels claimed vindication after the ruling by President Judge Janine Edwards, telling reporters outside the Wayne County Courthouse, Justice was served today in a court of law.",
    "Daniels, who is running for the GOP nomination in this months primary, had been was ordered to stay away from his home and forbidden from having any contact with his wife.",
    "The temporary order had also given Daniels wife temporary custody of their child and forced Daniels to turn over his guns.",
    "Our case was proven by cross examination of a witness who lied,? Daniels lawyer, Jen Gilliland Vanasdale, told reporters.",
    "In court, they suggested she only sought the protective order because Daniels had threatened to leave her.",
    "He threatened to put a bullet? in the head of one of the people he blamed, the woman testified.",
    "Daniels himself did not testify and did not call any witnesses."
  ]
}