{
  "id": 6906,
  "mediaId": 98,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Essential Politics: If you care about abortion, these are the states to watch",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/464a3c9/2147483647/strip/true/crop/6000x4000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa3%2Fd1%2F69edb43b4b9288c5d62685a97833%2F954013-na-pol-0503-scotus-roe-v-wade-kkn-19966.jpg",
  "link": "https://www.latimes.com/politics/newsletter/2022-05-06/if-you-care-about-abortion-these-are-the-states-to-watch-essential-politics",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Lauter",
  "authorUrl": "https://www.latimes.com/people/david-lauter",
  "termIds": [
    3102,
    146,
    428,
    482,
    3482,
    2945,
    2959
  ],
  "sentences": [
    "Its a really sticky subject? that gets into a lot of complicated feelings,? said Natalie Jackson, the director of research at the Public Religion Research Institute, which has done extensive polling on the subject, including a widely cited state-by-state survey in 2018.",
    "At the other end of the spectrum, another 14 states, mostly in the South and the interior West, have so-called trigger laws that would ban or severely restrict abortions as soon as Roe is struck down and have Republican-led governments that plan to enforce those bans.",
    "The list will sound familiar because its the same states that have swung the last few presidential elections and that have elections this year that likely will determine control of the U.S. Senate: Arizona, Wisconsin, Michigan, Pennsylvania, New Hampshire, Georgia.",
    "The latest from Washington\nThe Federal Reserve on Wednesday pushed up interest rates by a half-percentage point, the largest increase in more than 20 years and a significant escalation of its efforts to get control of troublingly high inflation, Don Lee wrote.",
    "The states where the debate over abortion likely will rage the hottest  and where the political impact likely will be greatest  are in the middle, especially a handful of states where political circumstances all but guarantee conflict on the issue.",
    "In Wisconsin, the most recent Marquette University Law School poll found 61% of the states voters said abortion should be legal in all (23%) or most (38%) cases, compared with 34% who said it should be illegal all (11%) or most (23%) of the time.",
    "WASHINGTON \nFor decades, abortion has provided a near-perfect issue for Republicans: Hard-line rhetoric mobilized strongly antiabortion voters, but hard-line legislation got blocked by courts before it could alienate the rest of the electorate.",
    "The Biden administration plans to exclude Cuba from the upcoming Summit of the Americas, a major global meeting to be held in Los Angeles in June that typically welcomes all governments in the Western Hemisphere, Tracy Wilkinson reported.",
    "But opinions vary strongly by ideology and religion, with conservatives and white evangelical Protestants being the most opposed to abortion, while liberals and those who dont follow any religion most strongly support abortion rights.",
    "That could boost them in a year that seems otherwise grim for their party, although theres no way to know how many voters will decide that abortion outweighs issues that Republicans will campaign on, such as inflation and crime.",
    "In roughly 14 states along the West Coast and in the Northeast and mid-Atlantic regions, support for abortion rights runs strong, and the direct impact of a Supreme Court ruling overturning Roe vs. Wade likely will be minimal.",
    "What happens in other states is relevant in all states,? Greenberg said, noting that voters in focus groups around the country this year have mentioned the Texas law that bans abortions after around six weeks of pregnancy.",
    "As Marisa Gerber reported, Faisal Gill, a civil rights attorney and former Homeland Security official, and Kevin James, a lawyer turned radio host turned City Hall insider, both once ran for office as Republicans.",
    "Whats happening is not nuanced.?\nCoverage of the abortion debate\nIn the days since the draft Supreme Court opinion became public, my colleagues have examined a wide array of topics related to the abortion debate.",
    "The 60-year era of building new and expanded freeways in California is coming to an end, a shift brought about by concerns about climate change and the impact that massive road projects have on neighborhoods.",
    "The issue in those states will be whether Republican lawmakers, under pressure from the ardently antiabortion wing of their party, will go beyond what voters  even in conservative areas  will tolerate.",
    "A major new survey of 10,441 Americans by the Pew Research Center, conducted in March and released Friday, found 61% of Americans said abortion should be legal all (19%) or most (42%) of the time.",
    "Second Gentleman Doug Emhoff will travel to Seoul on Sunday, leading the U.S. delegation to next weeks inauguration of South Koreas incoming president, Yoon Suk-yeol, a White House official said.",
    "In Louisiana this week, a legislative committee passed a measure to classify abortions as homicides and subject women to prosecution if they terminate pregnancies at any point after conception.",
    "But as Benjamin Oreskes and Doug Smith reported, new research by the RAND Corp. shows that many homeless people wont go to group shelters, fearing that theyre unsafe and dont provide privacy.",
    "Karine Jean-Pierre has been selected to be the next White House press secretary, becoming the first Black person and first openly LGBTQ person to serve in that role, Eli Stokols reported.",
    "As Noah Bierman reported, the trip will be Emhoffs first to a foreign inauguration and third foreign excursion since his wife, Vice President Kamala Harris, took office in January 2021.",
    "Doug Mastriano, who has a small lead in recent polls, touted his support for a ban after six weeks, with no exceptions for cases of rape, incest or a danger to a pregnant patients life.",
    "Only 22% of Americans said abortions should always be legal at 24 weeks, roughly the point of viability, which Roe vs. Wade set as the point at which states could regulate abortions.",
    "Efforts like that could help spur Democratic turnout, and not just in the states where the measures are under consideration, said Democratic pollster and strategist Anna Greenberg.",
    "Tony Evers in Wisconsin and Gretchen Whitmer in Michigan quickly pledged this week to defend abortion rights and seem likely to make that issue a theme of their reelection bids.",
    "Biden, gearing up for a difficult midterm campaign, attacked Republicans as extreme? and touted his administrations efforts to reduce the deficit, Courtney Subramanian reported.",
    "While a majority opposed a ban at six weeks, support was significantly stronger for a ban after 14 weeks, similar to the Mississippi law being challenged in the Supreme Court.",
    "If youre a fan of this newsletter, youll love our daily podcast The Times,? hosted every weekday by columnist Gustavo Arellano, along with reporters from across our newsroom.",
    "A leaked draft of a Supreme Court opinion this week showed that a five-justice majority plans to overturn Roe vs. Wade, the 1973 decision that legalized abortion nationwide.",
    "We expect the democratic nations of our hemisphere to gather for a conversation,? Brian Nichols, assistant secretary of State for the Western Hemisphere, told Wilkinson.",
    "Now, theyre accelerating their plans, with Democrats hoping the impending high court decision will help them mobilize their voters, Melanie Mason and Seema Mehta wrote.",
    "But as Liam Dillon, Ben Poston and Rachel Uranga reported, at least one major group opposes the shift away from freeway construction  the states construction unions.",
    "From President Biden on down, they repeatedly used the word extreme? to describe Republican proposals on abortion and talked about their opposition to outright bans.",
    "One illustration of the complex feelings around abortion: Forty-eight percent of Americans said in some cases abortion is morally wrong but should be legal anyway.",
    "An additional 31% said the procedures should be legal at that point sometimes, including when the mothers life is endangered or the fetus has severe disabilities.",
    "Twenty-two percent said that whenever abortion is morally wrong it should be illegal, and 28% said abortion is always morally acceptable or is not a moral issue.",
    "On the other side, just 8% said abortion should be illegal in all cases, while another 29% said it should be illegal in most cases or with only a few exceptions.",
    "But in the coming months, that will change as the argument shifts to state capitals where newly empowered lawmakers will be grappling with writing actual laws.",
    "At a news conference Wednesday, Newsom said California should provide a beacon of hope? to residents of states that have restrictive laws, Brittny Mejia wrote.",
    "Indeed, many conservative states have moved aggressively in the other direction, enacting laws that ban all abortions, including those that result from rapes.",
    "Several Los Angeles mayoral candidates have said that if elected, they would build more dormitory-style group housing to get homeless people off the streets.",
    "The issue has not been front and center in recent elections, but it certainly will be in these circumstances,? said Charles Franklin, who directs the poll.",
    "Josh Shapiro, the Democratic candidate for governor, this week vowed to veto any antiabortion bills that the Republican majority legislature might pass.",
    "A lot of Americans are pulled in different directions on abortion and hold views that are nuanced or, in some cases, contradictory, the survey found.",
    "Wisconsin and Michigan, for example, both have antiabortion laws passed generations ago that are likely to go back into effect if Roe is overturned.",
    "Even in the most conservative states, the share of people who think abortion should be illegal all the time maxes out at around 25%,? Jackson said.",
    "Two top candidates in the race to become Los Angeles next city attorney share what some see as a liability: their former allegiance to the GOP.",
    "If that majority holds, states will have full authority to write their own abortion legislation for the first time in nearly half a century.",
    "If the court rules as is now expected, it would be an emphatic, and potentially damaging, expression of minority rule, Mark Barabak wrote.",
    "The proposals under discussion would have mostly symbolic impact in those states, which already allow abortions in most circumstances.",
    "Support for abortion rights is similarly strong in Pennsylvania, said Berwood Yost, director of the Franklin & Marshall College poll.",
    "Activists on both sides of the abortion debate have spent months planning for a Supreme Court ruling on the future of Roe vs. Wade.",
    "In some of those strongly Democratic states, including California, lawmakers plan to push measures to bolster abortion rights.",
    "Here are a few of the highlights:\nThe future of abortion in the U.S. is moving to the mailbox, Jennifer Haberkorn wrote.",
    "The state allows abortions through 24 weeks, and the issue now seems likely to be a big one in the race for governor.",
    "Were the organization of slow,? said Joseph Cruz, executive director of the California State Council of Laborers.",
    "The survey also found, however, that many Americans do not support measures pushed by abortion rights advocates.",
    "Gavin Newsom is making defense of abortion rights a central part of his reelection message, Taryn Luna reported.",
    "The proposal may not make it into law, but it illustrates how the push for restrictions has grown more radical.",
    "In heavily Democratic Los Angeles, that could be a liability, and both say their political views have changed.",
    "Until now, that complex debate has largely boiled down to a simple binary: Roe vs. Wade, for it or against it.",
    "Conservative states may try to restrict access to pills through the mail, but that could prove difficult.",
    "Nationwide, according to Pews survey, about 14% of Americans favor jailing women who obtained abortions.",
    "Sign up for our California Politics newsletter to get the best of The Times state politics reporting.",
    "Republican legislative majorities in both states likely will oppose moves to liberalize those laws.",
    "From a Democrats point of view, anything is better than talking about inflation,? he said.",
    "On the other side, a recent debate found all the Republican hopefuls opposed to abortion.",
    "Those results are consistent with a host of other surveys of opinion regarding abortion.",
    "Only about 15% of the states voters say all abortions should be banned, the poll shows.",
    "Until next time, send your comments, suggestions and news tips to politics@latimes.com.",
    "The general pattern is that Pennsylvania voters support abortion rights,? Yost said.",
    "In the pre-Roe era, safe, reliable, nonsurgical ways to end a pregnancy didnt exist.",
    "Proposals that until now have been drills will suddenly become live-fire exercises.",
    "Democrats in recent days have tried to align themselves with voters in the middle.",
    "Download and listen on our App, subscribe on Apple Podcasts and follow on Spotify.",
    "Now, abortion pills  medication abortions  are the most common type of abortions.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "Democrats have been looking for a new issue, both here and nationally.",
    "They cant afford to alienate their partys large antiabortion faction.",
    "Republicans will have a harder time matching any move to the center.",
    "Nuanced views\nMost Americans support abortion rights  up to a point.",
    "Republicans espouse such proposals at their peril,? said Greenberg.",
    "Shell replace Jen Psaki, who is leaving to take a job with MSNBC.",
    "Were not the organization of no when it comes to climate change.",
    "And are you following us on Twitter at @latimespolitics?",
    "Sign up here to get Essential Politics in your inbox.",
    "In a handful of states, it could also upend politics.",
    "Lawmakers in some states have proposed going further.",
    "That could affect the lives of millions of women.",
    "Keep up with breaking news on our Politics page.",
    "Wisconsins law dates to 1849, Michigans to 1931.",
    "That translates into a sharp regional division.",
    "Men and women hold similar views on the issue.",
    "People are very nuanced about this,? she said.",
    "People dont want to think hard about abortion.",
    "These elections are nationalized,? she said.",
    "Thats about to change dramatically.",
    "Did someone forward you this?",
    "Go beyond the headlines.",
    "Democratic Govs.",
    "Gov."
  ]
}