{
  "id": 6915,
  "mediaId": 943,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Abortion battles in states fire up after Supreme Court leak",
  "image": "https://www.chicagotribune.com/resizer/Tkd6oOJldSslfaeHu6VdW_lfvwo=/800x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/BVAQZIRWJBAOPLX7ZCAIATTCDU.jpg",
  "link": "https://www.chicagotribune.com/nation-world/ct-aud-nw-abortion-states-supreme-court-20220504-haobcystojdibfyndrdsyn3doe-story.html",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "LINDSAY WHITEHURST",
  "authorUrl": "",
  "termIds": [
    1625,
    1713,
    1935,
    2069,
    2140,
    3102,
    428,
    482,
    2590,
    2957
  ],
  "sentences": [
    "(Wong Maye-E/AP)\nThe Supreme Courts apparent intention to abolish a nationwide right to abortion, spelled out in a draft opinion leaked this week, will expand the battlefield of the nations most highly charged culture war, taking it to states where abortion access has long been assured.",
    "Democrats in blue states are bracing for a wave of legal attacks and other maneuvers seeking to undermine access, and some are even taking steps to enshrine the right to abortion in their constitutions, making it much more difficult to impose a ban in the future.",
    "There is one way and one way only for us to ensure that women have the legal right to continue to make decisions over their own bodies in Pennsylvania and that is winning this governors race,? Shapiro said during a conference call with reporters this week.",
    "And thats what were trying to protect against.?\nColorado Democrats and advocates say they will seek a ballot measure in 2024 to enshrine abortion access in the constitution and repeal a 1980s constitutional amendment that bans public funding for abortion.",
    "The race to replace him is between a similarly minded Democrat, state Attorney General Josh Shapiro, and a primary field of nine Republicans who all say they would sign restrictions passed by the Legislature, which is likely to remain under GOP control.",
    "Republican states are expected to ban or restrict abortion, but tactics also could include an aggressive effort to go beyond their borders to sue abortion providers and find other ways to punish those who assist a woman in securing an abortion.",
    "Republican Party Chairman Michael Whatley said in a release that the balance of the General Assembly and the Supreme Court has never been more important? to ensure that pro-life majorities? are in charge in a post-Roe future.",
    "The potential to undermine abortion access also is surfacing in Virginia, where Democrats lost their total hold on state government last November when Republicans flipped the House of Delegates and won the governors office.",
    "In Minnesota, where control of the legislative chambers is divided between the parties, two anti-abortion amendments to a health and human services bill narrowly failed on procedural votes in the Democrat-controlled House.",
    "Tim Walz vowed in an email to supporters this week that no abortion ban will ever become law? as long as hes governor; the Republican candidates vying to challenge his re-election bid all support a ban.",
    "This is fundamental for Colorado women, no matter whos in charge.?\nWhitehurst reported from Salt Lake City, Ramer reported from Concord, New Hampshire, and Kruesi reported from Nashville, Tennessee.",
    "Gavin Newsom and top Democratic leaders in the Legislature committed to asking voters to enshrine the right to choose? in the state constitution, steps also in the works in Vermont and Colorado.",
    "A draft opinion suggests the U.S. Supreme Court could be poised to overturn the landmark 1973 Roe v. Wade case that legalized abortion nationwide, according to a Politico report released Monday.",
    "Democratic House Majority Leader Daneya Esgar said an amendment is needed because state legislatures can change, and depending on who has the majority, they can write into law their ideologies.",
    "The next chapter of the conflict is really going to be about essentially what happens with interstate conflicts,? said Mary Ziegler, a legal historian at Florida State Universitys law school.",
    "If they succeed, you can add North Carolina to the list of states that will ban abortions,? Cooper, who has vetoed efforts to limit abortion since 2019, said in a recent fundraising letter.",
    "The rhetoric on both sides points to a growing fight over access, with anti-abortion advocates hoping to shrink the number of states where the procedure remains legal if Roe is overturned.",
    "But legislative leaders say the amendment would make it much harder to repeal those protections should the political winds change and future lawmakers seek to impose restrictions.",
    "Roy Cooper and other state Democrats have framed the November election as one in which they must prevent the GOP from winning back veto-proof majorities in the Legislature.",
    "A new law in Idaho, currently blocked by the state Supreme Court, would allow family members of all involved to sue abortion providers, an example of the tactics to come.",
    "Connecticut and Washington state have already taken steps to shield providers from possible lawsuits as they anticipate women seeking abortions would cross state lines.",
    "One Republican candidate, state Sen. Doug Mastriano, supports a ban at six weeks of pregnancy without exceptions for rape, incest or saving the life of the mother.",
    "Democrats also believe it would shield the state from any adverse state court decisions or federal abortion bans if Republicans were to win control of Congress.",
    "Michigans governor already has filed a legal challenge to the law, while Wisconsins attorney general, Democrat Josh Kaul, said he expects litigation as well.",
    "Oregon lawmakers included $15 million in their state budget to help pay for people to travel to the state to get abortions and California has a similar bill.",
    "Campaigns for two state Supreme Court seats are expected to be even more intense because the court could hear challenges to any new abortion restrictions.",
    "The potential to roll back established abortion rights already has emerged in states with divided political control, including Pennsylvania and Virginia.",
    "Democrats control the state Senate by only one vote and have one caucus member who opposes abortion and has indicated an openness to new restrictions.",
    "He said this week that it was premature to speculate on what the Supreme Courts final decision would be or how he and lawmakers might proceed.",
    "Michigan and Wisconsin, states with Democratic governors and legislatures controlled by Republicans, have pre-Roe abortion bans in state law.",
    "Glenn Youngkin describes himself as pro-life,? though he has said he supports exceptions in cases of rape, incest or to save a womans life.",
    "Unless we are explicit about what we are protecting  some day some court could interpret privacy as not including my right to an abortion.",
    "Whatever the outcome, the Politico report represents an extremely rare breach of the court's secretive deliberation process.",
    "It was unconstitutional for 50 years.?\nSome deeply Democratic states are moving quickly to try to shore up abortion rights.",
    "California and Colorado are pushing to protect abortion access in their constitutions, a stronger step than passing a law.",
    "Demonstrators rally in support of abortion rights at a park in lower Manhattan on Tuesday, May 3, 2022, in New York City.",
    "Tom Wolf, a Democrat who has vetoed recent legislation restricting abortion, is not running because of term limits.",
    "Roughly half of U.S. states are expected to move quickly to ban or greatly restrict abortion if that happens.",
    "With every seat up for election in November, Republicans need to gain five seats to restore that control.",
    "We will not allow the tentacles of Texas to get into Washington state,? said Democratic Gov.",
    "Republicans in our state are on the verge of gaining veto-proof supermajorities in Raleigh.",
    "Democrats currently hold four of the seven seats, including two on the ballot this year.",
    "In Pennsylvania, abortion is legal under state law for the first 24 weeks of pregnancy.",
    "California already has some of the most expansive abortion protections in the country.",
    "The unimaginable can happen,? said state Sen. Nancy Skinner, a Democrat from Berkeley.",
    "Associated Press statehouse reporters around the country contributed to this report.",
    "Jay Inslee, who vowed to make Washington a sanctuary for those seeking abortion.",
    "Many states with one-party control of government already have chosen their side.",
    "The laws survival is on the line in this years race for governor.",
    "The handful of states with divided politics are up for grabs.",
    "(The) ban wasnt just dormant,? he said.",
    "In North Carolina, Gov.",
    "Democratic Gov.",
    "California Gov.",
    "Gov.",
    "Gov."
  ]
}