{
  "id": 6940,
  "mediaId": 881,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Trumps Spokeswoman Calls For Arrests Over 2020 Election at QAnon Rally",
  "image": "https://video-images.vice.com/articles/6269952e87bbc4009b07d11f/lede/1651088170322-ap21181833609902.jpeg?crop=1xw:0.8427xh;0xw,0.1003xh&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/akvmyp/liz-harrington-qanon-rally-trump",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    1147,
    1796,
    2016,
    3102,
    5390,
    414,
    2862
  ],
  "sentences": [
    "You really think if theres no arrests made from 2020, if theres no real exposing of it and getting these people and holding them accountable, you really think they wont do it again??\nWhen VICE News asked who specifically she meant should be arrested, Harrington didnt name names but linked to two videos she claimed showed people stuffing ballot boxes with fraudulent votes.",
    "Other speakers included former Trump attorney Jenna Ellis, Trump-endorsed Maryland GOP gubernatorial candidate and Delegate Dan Cox, and Pennsylvania gubernatorial candidate and state Sen. Doug Mastrianoand Michael Peroutka, a pro-secession Confederate sympathizer who is running as a Republican to be attorney general of Maryland.",
    "Mastrianos running mate for lieutenant governor, Teddy Daniels, also spoke at the conference, warning the audience that we are at war in this country, we are losing this country.? He also said that the only way to be civil with liberals is after we beat the crap out of them.?\nWe will be civil on our terms, not theirs,? he said.",
    "Mastriano gave a long speech that argued that America is a Christian nation, mocked what he called this myth of the separation of church and state,? and promised the audience that he and they are taking our country back.?\nWere going to win on May 17 [Pennsylvanias primary date], with your help.",
    "Harrington wasnt the only big-name MAGA Republican who spoke at the Patriots Arise? conference in Gettysburg, Pennsylvania, which was hosted by a pair of QAnon activists and deeply steeped in the language of right-wing Christian fundamentalism.",
    "After his speech, Mastriano was awarded a Sword of David? by the conventions co-hosts, podcasters and QAnon conspiracy theorists Allen and Francine Fosdick, whose website used to feature the QAnon slogan WWG1WGA (Where we go one, we go all?).",
    "Former President Trumps chief spokeswoman spoke to a QAnon-affiliated conference over the weekend, warning the audience that if the liberals she alleges stole the 2020 election arent thrown in jail, theyll come after Trump supporters instead.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "He also spent years on the board of the pro-secession League of the South, though he left the organization before it served as one of the main organizers for the Charlottesville Unite the Right? rally.",
    "Trump has described him as a great patriot,? and hes currently neck-and-neck with former GOP Rep. Lou Barletta in recent polls in a crowded primary field to win the Republican nomination for governor.",
    "Mastriano vaulted from being a little-known backbencher in the state Senate to a top MAGA figure by leading the charge to try to overturn Trumps 2020 election loss in Pennsylvania.",
    "So your headline should be: Trumps Spokeswoman Calls for Those Who Broke Election Laws to Be Arrested,? Harrington told VICE News in an email.",
    "She didnt reply to questions about whether she knew that the conferences organizers were QAnon adherents before she agreed to speak there.",
    "He has advocated for the South to secede to form a Christian nation and has close ties with former Alabama Senate candidate Roy Moore.",
    "Theyre going to parade people and interrogate you for your free speech,? Trump spokeswoman Liz Harrington said in a lengthy speech.",
    "Michael Peroutka, who is running as a Republican to be attorney general of Maryland, also spoke on the first day of the conference.",
    "Its so important to have accountability and have that trust restored because otherwise youre going to get more of it.",
    "Peroutkas weekend speech was tame by comparison: He simply called for the impeachment of Maryland Republican Gov.",
    "They could start with those who committed election fraud felonies on camera.",
    "My god will make it so,? Mastriano promised, to cheers from the crowd.",
    "Wheres Goliath?? Mastriano said with a laugh as he raised the sword.",
    "Theyre gonna start throwing political dissidents in jail.",
    "You think its gonna be better next time?? she continued.",
    "Anyone who violated election laws should be charged.",
    "And in November were going to take our state back.",
    "Want the best of VICE News straight to your inbox?",
    "Theyre gonna start arresting political opponents.",
    "Larry Hogan over Hogans COVID-19 policies.",
    "Theres no accountability?",
    "Sign up here.",
    "Yep."
  ]
}