{
  "id": 6948,
  "mediaId": 195,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Can Dr. Oz complete his GOP metamorphosis with a Senate win?",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/ozmehmet_040222ap-matt-rourke_oz.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3460529-can-dr-oz-complete-his-gop-metamorphosis-with-a-senate-win/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Al Weaver",
  "authorUrl": "https://thehill.com/author/al-weaver/",
  "termIds": [
    1147,
    1653,
    1758,
    2137,
    2491,
    3102,
    146,
    428,
    571,
    2862,
    4936
  ],
  "sentences": [
    " When you get to Washington, how do I know that youre going to keep those values??\nThe advertisement against you where you are on your show, youre asking a child, what did it feel like when your parents thought you were a boy? Thats very disturbing.?\nAttempting to assuage the attentive crowd of 400 at a town hall in Bucks County, Oz began to answer the final query, telling them something you dont usually hear at political events of this kind.",
    "Although the McCormick side has virtually a bottomless pit of cash to carpet bomb Ozs campaign in the coming weeks with accusations that hes a Hollywood liberal,? there are concerns that Ozs unique way of connecting with voters  one that kept him on the air for 13 years  could be a deciding factor when all is said and done as Oz continues to attract crowds across the state.",
    "I want you coming in here skeptical.?\nAnd skeptical Pennsylvania GOP voters are as they attempt to determine whether Oz is who he says he is and should be their nominee for the Senate in November amid a brutal battle over the airwaves between him and David McCormick, the rival who he beat out earlier this month for the endorsement of former President Trump.",
    " Id study them and Id say, actually, although it sounds smart, heres how it could be used against people in ways you wouldnt want.?\nHowever, theres a good chance all the intraparty concerns will be a moot point come May 17 after Oz nabbed Trumps endorsement, putting him in the drivers seat with three weeks to go.",
    "According to one source familiar, at a recent Mar-a-Lago fundraiser for former Rep. Lou Barletta (R-Pa.), Trump spent time addressing the attendees by panning Bill McSwain (who he recently assailed as a coward? for not backing his voter fraud claims), speaking highly of Barletta, and talking up Mastriano.",
    "Despite the optimism, there is one concern Pennsylvania Republicans harbor: that state Sen. Doug Mastriano (R), a leader in the push to overturn the 2020 election results, could nab the GOPs gubernatorial nomination and drag the entire ticket down in November, including the Senate race.",
    "In fact, Republicans in Washington had lost confidence in Sean Parnell, the original Trump-endorsed candidate before he dropped out amid a custody dispute, to the point that they were unlikely to get involved in the race if he were the nominee, according to one GOP strategist.",
    "To that point, Oz (along with former Housing and Urban Development Secretary Ben Carson, who said the attacks calling into Ozs conservative stances are a bunch of crap?) stayed afterwards to grip, grin and talk with supporters for roughly an hour following the town hall.",
    "Only six years ago, Trump, who had a lengthy track record of donating to Democratic politicians, holding pro-choice and other liberal views, became the first GOP presidential candidate to win the Keystone State in nearly three decades.",
    "His celebrity status would worry me the most, that hes just so well known, and hes really good on television,? said Rob Gleason, the Republican Party of Pennsylvania chairman from 2006 until 2017, including Trumps 2016 win.",
    "In the Trafalger Groups latest poll taken after Trump announced his endorsement, Oz holds a 3-point advantage over McCormick, though the survey was taken well before the endorsement had sunk in with the voting electorate.",
    "In addition to bigger crowds, and higher digital fundraising numbers, Dr. Oz lead has widened in our internal polling,? Oz campaign manager Casey Contres told The Hill.",
    "Not only does he have the celebrity factor, but hes out with the people,? one Pennsylvania-based political operative who is unaffiliated with the race told The Hill.",
    "The Oz-McCormick fight will also take on a new shape tonight as the two are set to take part in their first debate together at 8 p.m. and is hosted by Nexstar Media.",
    "BRISTOL, Pa.  Less than four weeks away from primary day, the questions and comments by potential GOP primary voters about Mehmet Ozs past stances were streaming in.",
    "I didnt even ask for the endorsement in the first meeting,? Oz said, adding that he made the official endorsement request during their third get together.",
    " Its not that theyre angry or anything with Dr. Oz, but its just that hes not the conservative you need.?\nHowever, the Trump aspect cannot be overstated.",
    "In addition, polling from sources involved in the race shows Oz with a slight lead following Trumps endorsement, but within the margin of error.",
    "While he is seen as slightly more conservative than he was before, he is still viewed unfavorably by nearly half of the primary electorate.",
    "Theres a lesson from Trump in 16: Theyll forgive you for a lot if youre willing to stand in front of them and talk to them about it.",
    "Speaking with The Hill prior to the event, Oz tried to explain his political evolution, a premise with which he did not take issue.",
    "Oz said the push for the endorsement came over the course of three meetings with Trump since announcing his bid in December.",
    "Trump had the same issues,? said Vanessa Fiori, a candidate for the GOPs state committee from Bucks County, after the event.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Almost universally, GOP operatives are convinced that either candidate will win in November if Pennsylvania Lt. Gov.",
    "They dont care how he got there anymore.?\nAccording to the most recent polls, that sentiment is mostly ringing true.",
    "Youll say, you know, that makes common sense. And then youll learn, because youve got to get smart about topics.",
    "One questioner at the event told Oz that they were there simply because the former president had endorsed him.",
    "I just want to clarify that.?\nAt what point in your life did you realize that you had conservative values?",
    "But remember, primary voters are hardcore Republicans, and they are pretty conservative,? he continued.",
    "Glenn Youngkin], we have those people living out here, so thats what I think is going to rule the day.",
    "Our base isnt, oh this guy was pro-choice 10 years ago. They just want someone who is on their side.",
    "Gleason has endorsed McCormick and has criticized Oz for only recently moving to the commonwealth.",
    "However, the battle between Oz and McCormick has one group of people excited: D.C. Republicans.",
    "Trumps blessing also gives Oz something he desperately needs at this point: cover.",
    "I would take either one of them in a second,? a second GOP operative said.",
    "These are not pep rallies,? Oz said, absorbing the series of questions.",
    "A lot of things that you hear about are trojan horses for some groups.",
    "Primary voters know what theyre doing and they are very conservative.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "President Trumps impact on the race has been clear.",
    "You replied earlier that life begins at conception.",
    "John Fetterman holds on for the Democratic nod.",
    "I will forgive him for all of his leftist past.",
    "Its the same group that elected [Virginia Gov.",
    "Hes been pretty accessible.",
    "Youve got to study them.",
    "It was not a hard sell.",
    "He was a celebrity."
  ]
}