{
  "id": 6955,
  "mediaId": 19,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Poll: Oz Takes Slight Lead in PA Senate Primary, Locked in Statistical Tie with McCormick",
  "image": "https://media.breitbart.com/media/2022/03/david-mccormick-dr-oz-getty-dod-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/15/poll-oz-takes-slight-lead-in-pa-senate-primary-locked-in-statistical-tie-with-mccormick/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    3102
  ],
  "sentences": [
    "New #PASen @trafalgar_group #GOP primary #poll (4/11-13) shows very competitive race among top 3 #PApol\nSee Report: https://t.co/H5i2r5w8xB pic.twitter.com/7GiKYFprWj\n Robert C. Cahaly (@RobertCahaly) April 15, 2022\nAccording to the survey conducted by the Trafalgar Group, 22.7 percent of likely GOP primary voters would vote for Oz if the election was held today.",
    "Celebrity doctor Mehmet Oz has a slight lead in Pennsylvanias Republican U.S. Senate primary but remains locked in a statistical tie with businessman Dave McCormick, according to a recent poll.",
    "I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,? Trump said.",
    "The poll found that Pennsylvanias GOP primary for governor is also statistically tied between candidates Doug Mastriano and former Rep. Lou Barletta.",
    "The Trafalgar Group conducted the latest poll from April 11 to April 13 and surveyed 1,074 likely 2022 GOP primary voters.",
    "Surprisingly, support for Oz declined since the previous Trafalgar Group poll was conducted two months ago.",
    "Coming in a close second, 19.7 percent of Pennsylvania Republicans would vote for McCormick.",
    "The next closest candidate is Kathy Barnette, who earned 18.4 percent of those polled.",
    "However, 17 percent of likely GOP primary voters in the state remain undecided.",
    "The poll comes just one week after former President Donald Trump endorsed Oz.",
    "Oz had 27.4 percent support in February, compared to McCormicks 15.9 percent.",
    "Mastriano has 21.9 percent support compared to Barlettas 18.8 percent.",
    "Pennsylvanias primary will take place next month on April 17.",
    "The polls margin of error is  2.9 percent."
  ]
}