{
  "id": 6957,
  "mediaId": 656,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Pennsylvania State Senator Proposes Fee for Remittances",
  "image": "https://www.fairus.org/sites/default/files/styles/staff_card_photo/public/images/staff/david-jaroslav-headshot_1.jpg?h=4578afae&itok=r8fJc_L2",
  "link": "https://www.fairus.org/legislation/state-and-local-legislation/societal-impact/pennsylvania-state-senator-proposes-fee",
  "sentiment": "0.0",
  "mediaOutlet": "FAIR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "SB 1158 would:\nImpose a 2% fee on each transaction sent to someone outside the United States, capped at $5,000;\nRequire money transmitters to provide the transaction fees they collect on a quarterly basis to the states Department of Banking and Securities; and\nDirect all the fee revenue to be deposited in the states Property Tax Relief Fund, to be used to specifically to defray residential homeowners property taxes and residential tenants rental costs.",
    "He proclaimed the bill is a great way to deter illegal immigration we can put that new revenue towards tax breaks for legal citizens in our commonwealth.?\nIn an April 8 press release, Senator Mastriano further noted that Oklahoma enacted a similar fee on remittances in 2014 and now receives over $13 million in annual revenue for the state.",
    "Because Pennsylvanias estimated illegal immigrant workforce is significantly higher than Oklahoma, revenue generated from SB 1158 would likely result in at least eight times as much annual revenue.?\nRepublicans control both chambers of the Pennsylvania legislature.",
    "Federal, state and local governments bear a significant burden with this lost revenue, prompting a prominent state senator in Pennsylvania to introduce legislation to recoup some of these funds by placing a transaction fee on remittances.",
    "Senator Mastriano says his bill will raise revenue to help Pennsylvanians with rising housing costs as well as act as a deterrent against illegal aliens settling in the state.",
    "While Republican votes alone are sufficient to pass SB 1158, they do not have a 2/3 supermajority which would be needed to override a possible veto by Governor Tom Wolf (D).",
    "It has been cosponsored by three senatorsMario Scavello (R-Mount Pocono), Kristin Phillips-Hill (R- Stewartstown) and Patrick Stefano (R- Somerset).",
    "Generally, monies sent abroad are not taxed since many of the individuals who send money abroad are paid in cash  many times under the table.",
    "Once the money leaves the United States, it permanently leaves our economy because it is no longer used to purchase goods and services here.",
    "However, commonsense legislation like Senator Mastrianos bill has at times garnered widespread bipartisan support in Pennsylvania.",
    "In 2019, FAIR estimated that $150 billion a year is sent out of the United States in the form of remittances.",
    "This was the case in 2019 when the legislature passed an E-Verify bill for the states construction industry.",
    "Committee Chairman Senator John DiSanto (R-New Bloomfield) has yet to schedule a hearing for the bill.",
    "Wolf allowed it to become law without his signature rather than veto it and face a likely override.",
    "Senator Doug Mastriano (R-Gettysburg) introduced Senate Bill (SB) 1158 on March 24.",
    "The bill was referred to the Senate Committee on Banking and Insurance.",
    "The governor has not yet publicly stated his position on SB 1158.",
    "In the House, Republican have 112 seats to 89 for the Democrats.",
    "A companion bill has not yet been introduced in the House.",
    "That bill passed by such a wide margin that Gov.",
    "In the Senate they control the chamber 28-20."
  ]
}