{
  "id": 6962,
  "mediaId": 43,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "New F&M Poll Gives John Fetterman (D) A Double Digit Lead In The Democratic Primary",
  "image": "https://images.dailykos.com/images/1058953/story_image/1773.jpeg?1649917153",
  "link": "https://www.dailykos.com/story/2022/4/13/2091881/-PA-Sen-New-F-amp-M-Poll-Gives-John-Fetterman-D-A-Double-Digit-Lead-In-The-Democratic-Primary",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    943,
    1282,
    1622,
    1653,
    1770,
    2124,
    2491,
    3102,
    146,
    2862
  ],
  "sentences": [
    "The Republican governors race also remains close with state Sen. Doug Mastriano, R-33, Franklin County, at 15%; former U.S. Attorney Bill McSwain, 12%; former congressman and Hazleton Mayor Lou Barletta, 10%; HVAC company owner Dave White, 5%; former congresswoman Melissa Hart and Montgomery County Commissioner Joe Gale, each 3%; former state Senate President Pro Tempore Jake Corman, R-33, Centre County, 2%; communications consultant Charlie Gerow, 1%; and cardiothoracic surgeon Nche Zama, 0%.",
    "Governor\nAustin Davis\nBrian Sims\nPennsylvania Organizations\nAll In Pennsylvania\nPennsylvania Democratic Party\nPennsylvania House Democratic Campaign Committee\nPennsylvania Senate Democratic Campaign Committee\nFair Districts PA\nDraw the Lines PA\nCommittee of Seventy\nCongress:\nSummer Lee for Congress\nSean Meloy for Congress\nChris DeLuzio for Congress\nJerry Dickinson for Congress\nMatt Cartwright\nSusan Wild\nChrissy Houlahan\nMadeleine Dean\nDwight Evans\nMary Gay Scanlon",
    "Im hopeful these rules will go into effect as quickly as possible.?\nThe ruling delivered by the Department of Justice cracks down on ghost guns as violent shootings surge in cities across the country, with the use of the self-assembled guns increasing tenfold from 2016 to 2020, according to gun violence prevention group CeaseFirePA.",
    " Josh Shapiro (@JoshShapiroPA) June 14, 2021\nAlso:\nHours after the Biden administration announced measures to make ghost guns?  home-assembled firearms without serial numbers  harder for felons to access, Pennsylvania Attorney General Josh Shapiro told media he was prepared to handle legal challenges to the ruling.",
    "Trumps former National Security Advisor-turned-Q enthusiast Michael Flynn, who has endorsed Mastriano, spoke and reassured the crowd that Jesus was a domestic terrorist.?\nMastriano maintains an active presence on Facebook, where he often posts videos and appears on Steve Bannons War Room? podcast.",
    "Pennsylvania\n Acting as Mayor of Braddock, Pennsylvania between 2005-2019, and sworn in as Lieutenant Governor of Pennsylvania in January 2019, 2022 is going to be John Fettermans last year in officebut its certainly not the end of his extensive career.",
    "During a guest appearance on a late-night talk show in 2019, Oz was asked about his experiences on the President's Council on Sports, Fitness and Nutrition and if he had \"tried to convince Trump to start eating better.\"",
    "Author/commentator Kathy Barnette had the support of 7%; businessman Jeff Bartos, 6%; former U.S. ambassador to Denmark Carla Sands, 5%; attorney George Bochetto, 2%; and business and health care attorney Sean Gale, 0%.",
    "Click below to donate and get involved with the Democratic U.S. Senate candidate of your choice along with these Pennsylvania Democrats campaigns:\nGovernor\nJosh Shapiro for Governor\nU.S. Senate\nJohn Fetterman\nLt.",
    "FYI:\nLOL, if you thought Donald Trumps endorsement of Dr. Mehmet Oz for Senate was the worst development in Pennsylvanias 2022 GOP primaries, wait until you hear about the Republicans running for governor.",
    "This is just pathetic by the way:\nOn Saturday, former President Donald Trump endorsed surgeon and former television personality Mehmet Oz in the Republican primary for Pennsylvania's open US Senate seat.",
    "Additionally, the ruling clarifies the definition of a firearm, requiring the frames of ghost guns to be given serial numbers that would make it easier for law enforcement agencies to trace them.",
    "Fetterman shared in November 2021 that in his role as a chair of the Pennsylvania Board of Pardons, he wants to see as many people pardoned for cannabis convictions in 2022 before his run ends.",
    "The Frame or Receiver? rule spent at least a year in the DOJ before being announced on Monday, and requires retailers to issue background checks for the kits sold to assemble the weapons.",
    "Asked for comment on Tuesday about the McCormick campaign's claim that Oz is anti-Trump, Trump spokesperson Taylor Budowich said, \"I think the President's endorsement speaks for itself.\"",
    "John Fetterman has opened up a commanding lead in Pennsylvanias Democratic U.S. Senate race while the Republican race remains tight with many still undecided, according to a new poll.",
    "Certainty, well be prepared to deal with any litigation that comes  well be on the front lines of that,? said Mr. Shapiro, who attended the announcement at the White House on Monday.",
    "A Fox News poll conducted March 2-6 showed Barlettas lead shrinking to one point; an Emerson College poll conducted March 26-28 showed Mastriano leading the race by 4 points.",
    "As the words \"ANTI TRUMP\" appear on the screen, the McCormick ad shows a clip of Oz on camera saying, \"And we haven't had any interaction with President Trump at all.\"",
    "On the Republican side, former TV talk-show host Mehmet Oz and former hedge fund manager Dave McCormick were in a virtual tie with Oz at 16% and McCormick at 15%.",
    "The endorsement is a challenge for Oz's top Republican rival, former hedge fund chief executive David McCormick, who had also reportedly sought Trump's backing.",
    "Hes the bald military vet Pennsylvania state senator who bused people to the Capitol on January 6, where he was scheduled to speak at a Stop the Steal? rally.",
    "He announced his bid for governor with a 4-hour event described as a political rally, rock concert, and Christian religious revival? that drew 1,500 people.",
    "When fellow guest Padma Lakshmi followed up by saying Trump \"doesn't seem interested in eating well,\" Oz did say, \"Yeah, I'm not sure that's a major focus.\"",
    "Fetterman has the support of 41% of Democrats with U.S. Rep. Conor Lamb, D-17, Allegheny County, at 17%, according to the Franklin & Marshall College poll.",
    "Why it matters: Former President Trump on Saturday made a surprise endorsement of Mehmet Oz, better known as Dr. Oz, who is running against McCormick.",
    "Most early polls showed that former congressman and Hazelton Mayor Lou Barletta held an edge on Mastriano, but Mastriano seems to have momentum.",
    "By the way, gross:\nFormer Sen. Rick Santorum will endorse Dave McCormick for the Republican nomination in the U.S. Senate race in Pennsylvania.",
    "But let me be clear: legalization must include expungement for those in jail or who have served time for possessing small amounts of marijuana.",
    "But let me be clear: legalization must include expungement for those in jail or who have served time for possessing small amounts of marijuana.",
    "Trump said in his endorsement statement that Oz is \"very strong\" on a variety of issues and \"has always been popular, respected, and smart.\"",
    "Facts First: Oz wasn't expressing opposition to Trump when he said, \"And we haven't had any interaction with President Trump at all.\"",
    "But the ad takes an Oz remark out of context to falsely portray the comment as some sort of attack on the former President.",
    "Fetterman also announced his run for Senator of Pennsylvania, the primary of which is approaching on May 17, 2022.",
    "Trump flunkies Liz Harrington and Jenna Ellis have traveled to Pennsylvania to headline campaign events for him.",
    "TL; DR: Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary.",
    "That was a statement of fact -- one in which Oz avoided criticizing Trump's diet -- not an anti-Trump attack.",
    "And, theres an excellent chance the nuttiest bunny of them all, Doug Mastriano, is going to win the primary.",
    "https://t.co/Y3A8UzyZm2\n John Fetterman (@JohnFetterman) April 14, 2022\nJohn Fetterman\n Current Lt. Gov.",
    "McCormick's campaign has now released a television attack ad that claims Oz is actually \"ANTI TRUMP.\"",
    "He was subpoenaed by the January 6th Committee for his participation in Trumps phony elector scheme.",
    "Health and Democracy are on the ballot this year and we need to get ready to keep Pennsylvania Blue.",
    "The Democratic Primary is May 17th and you have to be a registered Democrat to vote in that primary.",
    "Our Black & brown communities have been disproportionately impacted by this for far too long.",
    "Our Black & brown communities have been disproportionately impacted by this for far too long.",
    "He tried to bring an Arizona-style audit? to his state in hopes of decertifying the election.",
    "He has my full endorsement,\" Santorum said in a statement provided by the McCormick campaign.",
    "Governor John Fetterman (D. PA)\nHeres the latest news today out of Pennsylvania:\nLt. Gov.",
    "Even that, though, would be weak sauce as the basis for a claim that Oz is \"ANTI TRUMP.\"",
    "Which means that Republicans might get a crackpot governing this swing state in 2024.",
    "During his response, Oz said the council hasn't had any interaction with Trump.",
    "Dave McCormick will be the next senator from the Commonwealth of Pennsylvania.",
    "The only thing differentiating them is how far down the rabbit hole they go.",
    "Another 9% chose someone else, 2% chose no one and 26% were undecided.",
    "Another 1% chose no one, 7% someone else and 40% remained undecided.",
    " Josh Shapiro (@JoshShapiroPA) June 14, 2021\nx\nLegalize marijuana.",
    "State Rep. Malcolm Kenyatta, D-181, Philadelphia, was at 4%.",
    "Details: \"I know Pennsylvania and I know conservatives.",
    "Instead, they increased his profile with Trump voters.",
    "Another 6% chose someone else, and 43% were undecided.",
    "Both of these actions should have made him a pariah.",
    "If anyone has momentum in the race, its Mastriano.",
    "Also, this is fucking awesome:\nx\nMade the list.",
    "You have until May 2nd to register to vote.",
    "The name Mastriano? should sound familiar.",
    "Because theyre all election conspiracists.",
    "He sure does like to put on a show.",
    "And regardless, it isn't in the ad.",
    "Click here to register to vote.",
    "What could possibly go wrong?",
    "How can I be sure of that?",
    "FYI:\nx\nLegalize marijuana.",
    "A high honor.",
    "Regulate it.",
    "Regulate it.",
    "Tax it.",
    "Tax it.",
    "Lt."
  ]
}