{
  "id": 6968,
  "mediaId": 157,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Former Ted Cruz staffer slams Pennsylvania GOP: Every governor candidate is an 'election conspiracist' down the 'rabbit hole'",
  "image": "https://www.rawstory.com/media-library/meet-the-far-right-pennsylvania-republican-who-believes-that-god-was-behind-trumps-attempted-coup.jpg?id=26314583&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/former-ted-cruz-staffer-slams-pennsylvania-gop-every-governor-candidate-is-an-election-conspiracist-down-the-rabbit-hole/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    3102
  ],
  "sentences": [
    "McSwain has attacked former Attorney General William Barr for allegedly not pursuing election fraud; White claimed that Democrats \"cry like a little baby\" whenever there's a call to audit elections; and Corman, the President Pro Tempore of the Pennsylvania Senate, actually helped order a baseless audit of Pennsylvania's results by a Florida company.",
    "Mastriano, who has been subpoenaed by the January 6 committee for his presence at the attack on the U.S. Capitol and his involvement in bussing people to the event, has also gained attention for being affiliated with a QAnon-promoting church that believes AR-15 style semiautomatic rifles are literally ordained by the Bible.",
    "On Tuesday, writing for The Bulwark, former Ted Cruz communications staffer and anti-Trump conservative Amanda Carpenter outlined how Pennsylvania Republicans have lined up a roster of gubernatorial candidates consisting more or less entirely of election conspiracy theorists.",
    "And the other candidates arent drawing contrasts  they are following Mastrianos lead, which says everything about who is really in control of the GOP,\" concluded Carpenter.",
    "\"The brutal fact is that the two leading candidates in Pennsylvanias GOP gubernatorial primary were actual participants in Trumps phony elector scheme.",
    "\"Barletta, most well-known for his hardline anti-immigration stance, was one of the first members of Congress to endorse Trump,\" wrote Carpenter.",
    "\"He chaired Pennsylvanias GOP delegation for Trumps 2020 nomination and stayed true to Trump through the post-election turmoil.",
    "\"Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary,\" wrote Carpenter.",
    "On January 6th, he tweeted that 'Congress must NOT certify while the integrity of this election is in question!'\"",
    "And, theres an excellent chance the nuttiest bunny of them all, Doug Mastriano, is going to win the primary.\"",
    "\"Pretty soon, Dr. Oz might be considered the most normal Republican running statewide in Pennsylvania.\"",
    "\"The other candidates in the race  Bill McSwain, Dave White, and Jake Corman  arent any better.",
    "The only thing differentiating them is how far down the rabbit hole they go.",
    "Theyve all played along with Trumps election lies,\" wrote Carpenter.",
    "After the election, Barletta called for a 'full forensic audit.'",
    "But, noted Carpenter, Mastriano is not an outlier in this race.",
    "For one thing, there's former Congressman Lou Barletta.",
    "Because theyre all election conspiracists.",
    "You can read more about the story here.",
    "\"How can I be sure of that?"
  ]
}