{
  "id": 6970,
  "mediaId": 157,
  "date": "d2022-04-12T00:00",
  "headline": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29673990&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/trump-pennsylvania-republicans/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    718,
    1133,
    1147,
    1282,
    1997,
    3102,
    146,
    428,
    2992,
    2862
  ],
  "sentences": [
    "In Pennsylvanias race for governor, some Republican insiders worry the crowded field could enable someone like Mastriano  a leading election denier who many in the GOP see as a deeply flawed general election candidate  to win the nomination with only a fraction of the vote.\"",
    "It was there for the taking and he failed so badly.?\nIn the resulting chaos, state Senate leader Jake Corman asked a court to take his name off the ballot for governor  and then decided to stay in the race after talking with Trump.",
    "He was the U.S. Attorney who did absolutely nothing on the massive Election Fraud that took place in Philadelphia and throughout the commonwealth.?\nDo not vote for Bill McSwain, a coward, who let our Country down,? Trump said.",
    "\"And to top it off, former U.S. Rep. Lou Barletta (R-PA), another leading candidate, just happened to have a campaign fund-raiser planned for Tuesday evening at Mar-a-Lago, Trumps private club in Florida.",
    "\"Donald Trump is still sowing chaos in Pennsylvania Republican politics,\" the newspaper reported, noting Trump's attack on Pennsylvania Republican gubernatorial candidate Bill McSwain.",
    "Conservative pundit Amanda Carpenter on Tuesday predicted, \"Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary.\"",
    "\"The developments didnt bring much clarity to the crowded race to take on state Attorney General Josh Shapiro, the presumptive Democratic nominee.",
    "Meanwhile, on Fox News, Laura Ingraham tried to get Kellyanne Conway to say it was a \"mistake\" for Trump to endorse Dr. Oz in the Senate primary.",
    "The seat is currently held by retiring Sen. Pat Toomey (R-PA), which would give Democrats a pick-up in the closely divided U.S. Senate.",
    "Within hours of endorsing Dr. Mehmet Oz in the GOP primary for U.S. Senate, conservatives were openly criticizing Trump's decision.",
    "As The Philadelphia Inquirer reports, Tuesday became a \"whiplash-inducing day in the GOP primary for governor\" in Pennsylvania.",
    "\"But individual candidates matter, and in any given race, the party with the wind at its back can still self-destruct.",
    "Some insiders worry state Sen. Doug Mastriano could seize the nomination and give Democrats an opening in November.",
    "\"And, theres an excellent chance the nuttiest bunny of them all, Doug Mastriano, is going to win the primary.\"",
    "\"A Fox News poll last month found Mastriano and Barletta leading the field, followed by White and McSwain.",
    "But no candidate had even 20% of the vote, and most Republicans were undecided,\" the newspaper reported.",
    "Donald Trump keeps interjecting pandemonium into GOP politics in the battleground state of Pennsylvania.",
    "One person in Pennsylvania who I will not be endorsing is Bill McSwain for Governor,? Trump argued.",
    "A source close to Barlettas campaign said the event had long been planned,\" the newspaper reported.",
    "But they unmistakably showed that Trump continues to dictate the terms of the primary campaign.\"",
    "The only thing differentiating them is how far down the rabbit hole they go,\" she explained.",
    "Trump's \"big lie\" of election fraud could also play a major role in the gubernatorial race.",
    "\\nKellyanne: No, I\\u2019m not afraidpic.twitter.com/efVgWLuTFi\n Acyn (@Acyn) 1649818581",
    "Ingraham: You wouldn\\u2019t answer the question whether it was mistake.",
    "I\\u2019ll say it, I\\u2019m not afraid to say it.",
    "Because theyre all election conspiracists.",
    "He knew what was happening and let it go.",
    "\"I'll say it, I'm not afraid to say it.",
    "I think it was a mistake to endorse Oz.",
    "It was a mistake,\" Ingraham said.",
    "\"How can I be sure of that?",
    "It was a mistake."
  ]
}