{
  "id": 6981,
  "mediaId": 157,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "'This is a charade': Pennsylvania Democrats walk out of GOP-led election hearing",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29620900&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/pennsylvania-democrats-walk-out-of-election-hearing/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102,
    5282,
    5307,
    5334,
    5452,
    428,
    571,
    2991,
    2862,
    5476
  ],
  "sentences": [
    "Youre looking at evidence thats ridiculously put together by your team, your people.?\nLeslie Osche, a Republican county commissioner from Butler County, Jessica Morgan, a Republican judge of elections in Luzerne County, and John Lott, a conservative who is now president of the Crime Prevention Research Center, also offered remarks on Thursday without swearing an oath.",
    "Sen. Cris Dush, R-Jefferson, who chairs the Republican-controlled panel, briefly suspended the hearing  publicly advertised as a meeting on ballot drop boxes  after Hughes directed a line of questions to Lehigh County Republican Committee Chairperson Joseph Vichot about a video showing an individual placing a handful of papers into a drop box in Lehigh County.",
    "Dush said that Republican committee members didnt know about the hearing until about two days ago.?\nSpeaking with reporters after the meeting, Dush defended his decision not to swear-in meeting participants, saying: I wanted this to be more informative and free-flowing in the way that the discussion went.",
    "The Democrats will not participate in a kangaroo operation that is set up with no bipartisanship conversation beforehand, as is the case of all of the hearings that we do in this body,? Sen. Vincent Hughes, D-Philadelphia, shouted as the Senate Intergovernmental Operations Committee sat at ease Thursday.",
    "Efforts to review past elections come after former President Donald Trump and his allies launched a months-long campaign to promote baseless claims of voter fraud and election misconduct to justify his loss to now-President Joe Biden, who won in Pennsylvania by 80,555 votes.",
    "Vichot, joined by three other conservative panelists, did not take an oath to swear that his remarks were truthful despite requests from Hughes and Senate Minority Leader Jay Costa, D-Allegheny, that Dush swear in the panelists  a typical practice at legislative hearings.",
    "The Pennsylvania Senate committee thats investigating the 2020 general and 2021 primary elections saw a walkout from Democratic members after its Republican chairperson refused to swear in a conservative panel during its first public meeting since last September.",
    "We need to be able to tell the whole story  my actions speak to the intent that I want this to be a nonpartisan thing because I just want the facts,? Dush said, adding that hes willing to discuss election integrity measures with opposing parties.",
    "Doug Mastriano, R-Franklin, and Judy Ward, R-Blair, sitting on the committee because of their ties to a third-party election review in Fulton County that ultimately resulted in the Department of State decertifying the countys voting machines.",
    "Since Dush replaced Mastriano as the committees chairperson in August, the panel issued a legislative subpoena for millions of voters drivers license numbers and partial Social Security numbers as part of the taxpayer-funded review.",
    "Costa added that the number of senseless hearings? the General Assembly has conducted since the 2020 election to support the erroneous claims of fraud [is] incalculable.?\nThis is a charade,? Costa, who joined remotely, said.",
    "My testifiers were willing to answer any question.?\nIn September, Fulton County Commissioner Stuart Ulsh, a Republican, appeared before the panel to testify about election guidance issued ahead of the 2020 general election.",
    "In June, Mastriano launched a so-called forensic investigation? of the 2020 election and made a sweeping request for election equipment and voter information in Philadelphia, York, and Tioga counties.",
    "Without being sworn in, it puts the veracity of truth in question,? Hughes, who has repeatedly blasted the GOP-initiated election investigation, told the Capital-Star after leaving the meeting.",
    "Earlier this year, Mastriano, a Trump ally who funded a bus trip to the U.S. Capitol on Jan. 6, 2021, also received a subpoena from the U.S. House committee investigating the Capitol riot.",
    "Legal challenges to the results failed in court, and two post-election audits carried out in Pennsylvania after the presidential election found no evidence of fraud.",
    "Pennsylvania Capital-Star is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Hughes said that Democratic committee members did not have time to prepare for Thursdays hearing or invite participants to speak about ballot drop boxes.",
    "NOW WATCH: Judge blocks all new FL voter suppression laws  then knocks the Supreme Court for putting voting rights 'under siege'\nStories Chosen For You",
    "The Senate Republican caucus also entered into a contract agreement with Envoy Sage, LLC, an Iowa-based company, to help carry out the election review.",
    "In the weeks and months after the fall hearing, lawmakers and government watchdogs raised concerns about inconsistencies in Ulshs testimony.",
    "The legal request is tied up in court, with legislative Democrats and Democratic Attorney General Josh Shapiro challenging the subpoena.",
    "Hughes left about an hour after Costa urged his colleagues to leave the meeting, which he described as a waste? of taxpayer dollars.",
    "Text messages obtained by the Capital-Star and other media outlets through open records requests also contradict Ulshs statements.",
    "Democrats have dubbed the election review in Pennsylvania as a sham.? Theyve also raised concerns about Sens.",
    "Dush added that the Senate committee received a letter and sworn affidavit to clarify Ulshs testimony.",
    "He was sworn in before offering a prepared statement and answering questions from committee members.",
    "Democrats have also expressed concerns about the firms credentials and security policies.",
    "All of the conservative panelists expressed frustration with ballot drop boxes.",
    "The documents will be added to the committees records, Dush told reporters.",
    "Im a little disappointed that we didnt have that kind of cooperation.",
    "Contact Editor John Micek for questions: info@penncapital-star.com.",
    "Pennsylvania Capital-Star maintains editorial independence.",
    "Follow Pennsylvania Capital-Star on Facebook and Twitter."
  ]
}