{
  "id": 6987,
  "mediaId": 129,
  "date": "3/19/2022 12:00:00 AM",
  "headline": "Trucker Protest Moved by More Than Opposition to Covid Mandates",
  "image": "https://static01.nyt.com/images/2022/03/18/us/politics/00pol-trucker-convoy1-sub/merlin_203314638_57fc0388-5d71-4654-8442-5a3e3c973db1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/19/us/politics/trucker-convoy-protest.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "This week, one side of the stage was piled with books written by Robert F. Kennedy Jr., an anti-vaccine activist; while near the other, a vendor sold stickers saying WHEN I DIE DONT LET ME VOTE DEMOCRAT.? On Wednesday evening, Dr. Paul Alexander, a former official in Mr. Trumps Health and Human Services Department who has become a prominent personality in the anti-mandate movement, called for President Biden to pardon the defendants facing charges related to the Jan. 6, 2021, storming of the Capitol.",
    "She said she would be staying with the convoy until it had achieved the aim of getting our freedom back.?\nPeople show up here because this is kind of the last stand of hope,? said Tyler Lee, 34, a real estate investor who is running for Congress as a Republican in a heavily Democratic congressional district in North Carolina.",
    "One truck pulled a trailer decorated with an immense American-flag-patterned skull topped by Mr. Trumps distinctive hair, alongside the phrase, Q Sent Me.?\nSince arriving in Hagerstown, Ms. Campbell has been sleeping in the back seat of her trucks extended cab, on a bedroll covered with an American flag-patterned bedspread.",
    "Along the gravel entrance road to the racetrack, Sherrie Campbell, a retired truck driver from Dallas, stood alongside her black Chevy Silverado, the exterior of which was painted with slogans related to QAnon, a conspiracy theory about the existence of a global pedophilic cabal that includes Democratic leaders.",
    "Meanwhile, some Republican politicians and candidates have come to pay their respects at the speedway camp, including Senator Ted Cruz of Texas and Doug Mastriano, a Pennsylvania state senator and candidate for governor who chartered buses to Mr. Trumps Jan. 6 rally preceding the storming of the Capitol.",
    "Asked in interviews what had drawn them to the protest, demonstrators spoke of ending a national emergency order Mr. Biden had extended in February, as well as a handful of remaining federal restrictions  vaccine requirements for military service members, for instance, and mask requirements on airplanes.",
    "The Republicans very much will look like they are looking backward and talking about something voters dont really care about.?\nConvoy organizers insist they will continue demonstrating until their demands are met, and the Hagerstown encampment has taken on an air of increasing permanence.",
    "The 100 or so trucks  plus an entourage of pickups, cars and camper vans  that head off toward Washington daily have neither matched the scale of the Canadians city-paralyzing demonstration, which drew thousands of trucks at its peak, nor summoned the same media attention.",
    "Organizers have compared the convoys weathering of a snowstorm last weekend to the Continental Armys winter encampment at Valley Forge, Pa., and their caravans around the Washington Beltway, which they are circuiting daily, to the Israelites marches around Jericho.",
    "The Biden administrations vaccine-or-testing mandate for large employers was blocked by the Supreme Court in January, and in early February, Democratic governors rushed to repeal their states indoor mask mandates, leaving only Hawaii with such a mandate in place.",
    "When the convoy first arrived after a cross-country trip from California on March 4, its organizers avoided trying to shut down Washington as the Canadian demonstrators had Ottawa, opting instead for relatively orderly laps around the Beltway.",
    "On Friday, organizers yielded the microphone briefly to a motorcyclist in leather chaps, who exhorted the mostly white crowd to strip the Black Lives Matter? slogan from a street near the White House where it has been painted in giant letters.",
    " As dusk settled over the racetrack on the edge of town, a truck driver stood on a trailer being used as a makeshift stage and held forth on the sins of the politicians in the nations capital, an hour and a halfs drive southeast.",
    "When these failed to make any great impression, drivers began making forays into the citys heart, with noisy excursions down residential streets, drawing the attention of law enforcement and, increasingly, angering residents.",
    "She had driven five hours to the Hagerstown Speedway to show her support for the Peoples Convoy, a demonstration against Covid-19 vaccine mandates modeled on the one that occupied Canadas capital city of Ottawa for weeks.",
    "Although organizers insist that their demonstration is nonpartisan and narrowly focused on Covid restrictions, in practice, it is animated by a broad, familiar array of conservative and right-wing issues and grievances.",
    "But not until then.?\nBesides an end to the emergency order, the convoy is calling for an investigation into Covid-19s origins and the federal response, and is encouraging state-level protests against local restrictions.",
    "Not all of them identified as Republicans, but all who disclosed how they voted in 2020 had supported Mr. Trump, and said they believed or at least suspected that the election had been rigged against him.",
    "For the moment, the protest is perhaps most notable as a window onto the evolution of the American right in the wake of Donald J. Trumps presidency, and one that Republican politicians are watching.",
    "This worldview is increasingly incorporating ideas from the anti-vaccine movement, some of them preceding the Covid outbreak, even as the virus has receded and Covid restrictions have eased.",
    "But most of the dozen demonstrators interviewed also enumerated other motivations, from concern over gun rights and abortion to the Trump-aligned QAnon conspiracy theory.",
    "Wolking and other Republican strategists argue that Covid restrictions remain a Democratic vulnerability in 2022, despite the few policies still in place.",
    "In the United States, unlike Canada, federal vaccine mandates for private employers were never implemented and few state-level Covid restrictions remain.",
    "The Centers for Disease Control and Prevention has since eased mask guidelines as the spike in infections from the Omicron variant has largely abated.",
    "The demonstrators camped outside Washington are rallying against Covid restrictions, but are fueled by a far broader set of right-wing grievances.",
    "Well be satisfied when Bidens gone, when Harris is gone and Pelosis gone,? Curt Martin, a 73-year-old truck driver from upstate New York, said.",
    "These are narrower aims than the Canadian protest, befitting a country where there are relatively few Covid mandates left to protest against.",
    "Some of these meetings were arranged by Axiom Strategies, a Republican consulting firm whose principals have worked for Mr. Cruz and Gov.",
    "But for Mrs. Graham, a Republican who is active in local politics, the American convoy was about far more than Covid restrictions.",
    "This is one of the major political movements in America right now,? said Matt Wolking, Axioms vice president for communications.",
    "Mask and vaccine mandates were just one example of how our freedoms have been coming down brick by brick over time,? she said.",
    "Mr. Lee had driven from Charlotte, N.C., to meet the convoy in Adelanto, Calif., in February and traveled with it ever since.",
    "Two young men in the attire of the Proud Boys, the far-right organization, were milling around the camp on a recent morning.",
    "Banners with symbols of the Three Percenters, an armed extremist movement, have been flown from some trucks in the convoy.",
    "At least nine other Republican senators and congressmen have met with the organizers during their visits to Capitol Hill.",
    "Complaints about schools mix with far-right conspiracy theories and refusal to accept the 2020 election results.",
    "Glenn Youngkin of Virginia and offered its services pro bono to connect the convoy with Republican politicians.",
    "We are still looking for accountability,? Brian Brase, a convoy organizer and its most visible spokesman, said.",
    "I think the voters have moved on,? said Brian Stryker, a partner at Impact Research, a Democratic polling firm.",
    "But he thought politicians should spend more time at the camp, perhaps even spend the night as he himself did.",
    "As the speedway occupation seemed to stretch ahead indefinitely, however, Mr. Lee was eyeing the calendar.",
    "Tracy Graham, a Mary Kay consultant from Suffolk, Va., held her own flag neatly folded in her hands.",
    "Shed asked the truckers to sign her flag and was thinking about framing it when she returned home.",
    "Historical and biblical allusions are tossed around loosely at the convoys speedway headquarters.",
    "There have been barbecues, campfires and, on Wednesday morning, a wedding.",
    "But whether the convoy can match its own aspirations remains uncertain.",
    "Its all or nothing!? called out another, waving a large American flag.",
    "You can get a real pulse of what is going on in America,? he said.",
    "References to QAnon have appeared on a number of convoy vehicles.",
    "Lock them up!? a man yelled from the crowd of several hundred.",
    "He gave Mr. Cruz credit for his visit to the convoy site.",
    "His primary, on May 17, was coming up soon.",
    "Still, Im taking it day by day,? he said.",
    "Were going to take it back,? he declared.",
    "Ive committed to these guys,? he said.",
    "Because I do have a campaign to run.?",
    "This is a part of history,? she said.",
    "When theyre gone, well be happy.",
    "HAGERSTOWN, Md.",
    "Well go home."
  ]
}