{
  "id": 7002,
  "mediaId": 43,
  "date": "3/7/2022 12:00:00 AM",
  "headline": "Some in MAGAworld think hes JFK Jr. resurrected, so of course this QAnon star is running for Senate",
  "image": "https://images.dailykos.com/images/1046027/story_image/GettyImages-1290928821.jpg?1646688532",
  "link": "https://www.dailykos.com/story/2022/3/7/2084499/-Some-in-MAGAworld-think-he-s-JFK-Jr-resurrected-so-of-course-this-QAnon-star-is-running-for-Senate",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2011,
    2137,
    3102,
    5268,
    5350,
    414,
    571
  ],
  "sentences": [
    "x\nThis woman at the Trump rally believes this current version of Joe Biden is fake,? and the real Biden was assassinated at Gitmo in 2019.?\nShe also believes Michael Jackson, JFK, Jr., and Princess Diana will be at Trumps upcoming inauguration because he helped them escape.? pic.twitter.com/hfpXhMp6M9\n PatriotTakes gg (@patriottakes) January 29, 2022\nSo now we have Fusca, a guy who spends his time maintaining a ludicrous after-five-oclock shadow and allowing people to believe that he may be a resurrected dead person in the flesh.",
    "I threw my hat in the ring because there's too much happening in our nation right now that isn't right: our border, our crime going up, our educational system falling apart.? The good news is, if you werent sure whether or not Mr. Fusca wasnt a straight-up charlatan piece of three-week-old-egg-salad-sandwich left on a beach in August, he had this to say when asked if he was actually John F. Kennedy Jr.: We're going to leave that for another time, because right now it's about getting the signatures for us to get there.",
    "Yes, the same JFK Jr. who tragically died, along with his wife Carolyn Bessette Kennedy and her sister Lauren Bessette in July of 1999, when a small aircraft he was piloting crashed into the Atlantic Ocean near Marthas Vineyard in Massachusetts.",
    "Guy Reschenthaler, who tried to overturn our democratically decided election and recently attempted to explain to Americans how a sociopath can reconcile hundreds of childrens deaths to COVID-19 in the pursuit of ones own political aspirations?",
    "Theres COVID-19 super-spreader, state Sen. Doug Mastriano, who participated in the Jan. 6 festivities and has had to face calls for his resignation and an investigation for his part of the attempted coup detat.",
    "WESA reports that during a rally on Saturday, Fusca wore a T-shirt advertising George magazine, a now-defunct political and lifestyle monthly that the younger Kennedy founded in the 1990s.?\nBut dont you worry!",
    "For them, all you need to know is that Michael Jackson, Princess Diana, and JFK Jr. are living on a secret island, where they spend their afterlives fighting against the deep state and pedophilia.",
    "There was Donald Trumps choice for Senate, Sean Parnell, who had to drop out after his estranged wife testified during a custody hearing that Parnell was a violent domestic abuser.",
    "They said that, while they know Fusca isnt JFK Jr., they do understand why some people have bought into the lie (and the only reason this guy is actually running for office).",
    "A subset of those folks believes that, finally, after 23 years in hiding, JFK Jr. has decided to reveal himself to the worldas Donald Trumps 2024 running mate.",
    "Most of the people who were at this Saturday event dont actually believe that the decades-deceased son of a former president is alive and named Vince Fusca.",
    "Pittsburghs NPR news station WESA reports that Mr. Fusca has decided to cash in some of his QAnon celebrity to run for Senate in the Keystone State.",
    "You let enough truth come out. I believe in people doing research and finding the truth.?\nYou see, if nothing is real, then anything can be real.",
    "Somethingmaybe his cartoonish hobo stylings or solid bone structure?has led many in the QAnon world to believe he is actually John F. Kennedy Jr.",
    "Shill away\nPennsylvania is one of the many borderline-MAGA states filled with GOP operatives who should probably be facing criminal inquiries.",
    "Fusca has been a MAGA fan who shows up at MAGA rallies and supports MAGA causesand by extension, the QAnon worldfor a few years now.",
    "The news outlet caught up with Fusca while he worked on getting the signatures needed to grift a bunch of money get on the ballot.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Is it really? And I'm like, Not that I know of.?\nChristine Ree and her husband Robert are working on this campaign.",
    "If you have followed the Qronicles of QAnon you might be aware of a man named Vincent (Vince) Fusca.",
    "At political events she attends with Fusca, she said, We get it constantly, you know, Who is he?",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Possibly unrelated note: Fusca has yet to articulate a policy platform.? U-S-A!",
    "Ree said, Vince is not JFK Jr. Not at all.? That sounds extremely reasonable!",
    "We can go in so many different directions with JFK Jr. and other movements.",
    "That sect of QAnoners went down to Dallas a few months ago and havent left.",
    "In fact, even after JFK and his son failed to show up, they have remained.",
    "But wait, theres more:\nI don't believe things I see with my own eyes now.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "But let's stick to the matter at hand right now.?\nCan I get a Y-U-C-K?",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "You know, he doesn't take off a mask,? said Christine Sypien.",
    "Some of the QAnon folks believe JFK Jr. faked his own death.",
    "There are others who dont go in for all that cult business.",
    "Yes, the son of former President John F. Kennedy.",
    "Vincent Fusca says he is maybe not JFK Jr.",
    "This is a short blurb about Daily Kos.",
    "And how can we forget Republican Rep.",
    "Hes the guy in the picture above.",
    "... [Y]ou see enough things.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "I don't believe he's JFK.",
    "Daily Kos is different.",
    "Theres the dark magic.",
    "You give enough time.",
    "Please read it.",
    "True story."
  ]
}