{
  "id": 7006,
  "mediaId": 169,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Is Pennsylvania losing it? Hate groups proliferate as state GOP descends into MAGA paranoia",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/03/doug-mastriano-0302221.jpg",
  "link": "https://www.salon.com/2022/03/03/is-pennsylvania-losing-it-hate-groups-proliferate-as-state-descends-into-maga-paranoia/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    1145,
    1997,
    2087,
    2525,
    3102,
    28,
    376,
    428,
    462,
    2862,
    5460
  ],
  "sentences": [
    "\"From parroting Donald Trump's lies about the election to embracing his far-right agenda,\" Pennsylvania Democratic Party spokesman Brendan Welch said in a statement, \"Lou Barletta is running a campaign defined by Trumpian litmus tests and dangerous conspiracy theories.\"",
    "The group, which says it is \"committed to restoring and promoting the conservative values and ideals espoused in America's founding documents,\" called on supporters to travel to Washington last Jan. 6 to \"fight\" for former President Donald Trump.",
    "Some of these groups helped storm the Capitol and Pennsylvania had the third-highest number of federal cases against individuals involved in the Capitol riot, behind only Florida and Texas, according to the George Washington Program on Extremism.",
    "One of these groups was the Berks County Patriots, an \"extreme anti-government group,\" according to the Southern Poverty Law Center, that has attracted an unusual amount of attention from the crowded Republican gubernatorial primary field.",
    "The Berks County Patriots last year also hosted the two frontrunners in the crowded Republican governor's race: state Sen. Doug Mastriano and former Rep. Lou Barletta, both of whom have ties to Trump supporters charged in the Capitol riot.",
    "Last year, McSwain sent a letter to Trump claiming that his office had \"received various allegations of voter fraud and election irregularities\" but then-Attorney General Bill Barr prevented him from publicly announcing the allegations.",
    "In October, the group invited yet another candidate, Charlie Gerow, a longtime Republican strategist who was one of the fake electors who signed fraudulent documents naming Trump the winner of Pennsylvania's 2020 election.",
    "The Berks Oathkeepers last month sponsored a Berks County Patriots event that featured Republican gubernatorial candidates Dave White and Guy Ciarrocchi, who ultimately dropped out of the race shortly afterward.",
    "Some members of the group also traveled to the rally separately, including one of the group's board members, who claims he had left the Capitol area before violence broke out, according to The Morning Call.",
    "Pennsylvania Democrats said Mastriano's entrance into the primary field was \"sure to supercharge the race to the bottom,\" accusing him of spreading misinformation and peddling \"absurd conspiracy theories.\"",
    "In November, Scavo was sentenced to 60 days in prison, more than prosecutors requested, after illegally entering the Capitol on Jan. 6 and organizing a bus trip for 200 people to attend the protest.",
    "Mastriano was subpoenaed by the Jan. 6 committee last month after publicly calling for the Pennsylvania legislature to overturn President Biden's win in the state and award its electors to Trump.",
    "The Southern Poverty Law Center tracked 36 different hate groups in the Keystone State and the Anti-Defamation League reported a record-high increase in hate incidents in Pennsylvania last year.",
    "Pennsylvania Republican gubernatorial candidates have campaigned with an extreme anti-government group whose members attended the \"Stop the Steal\" rally ahead of the deadly Jan. 6 Capitol riot.",
    "Lazar found himself on the FBI's Most Wanted List last year after he was seen in videos pepper-spraying police and trying to pull down a metal bike rack that officers were using as a barrier.",
    "The group planned to sponsor numerous bus trips to D.C. but ultimately \"disassociated\" itself from the event over concerns of violence, according to Patriots chairman Sam Brancadora.",
    "Pennsylvania has \"emerged as a hotbed for hate groups,\" local news outlets reported last year, ranking it as one of the top five states with the highest concentration of hate groups.",
    "The group is holding another event this month that is expected to feature Republican gubernatorial hopeful Bill McSwain, who served as a U.S. attorney in the Trump administration.",
    "Mastriano himself was seen in photos on the Capitol grounds ahead of the breach but has said he left after it became \"apparent that this was no longer a peaceful protest.\"",
    "Mastriano was in frequent touch with Trump during the latter's campaign to overturn his election loss, and bragged that he spoke with the then-president at least 15 times.",
    "The Berks County Patriots also have ties to the Berks County chapter of the Oath Keepers, one of the largest anti-government extremist groups and militias in the country.",
    "Samuel Lazar, another Trump supporter charged in the riot, attended a fundraiser for Mastriano last year that was headlined by former Trump lawyer Rudy Giuliani.",
    "The Berks County Patriots did not respond to questions from Salon, but Brancadora pushed back on criticism of the group in an interview with the Morning Call.",
    "The Berks County Patriots in January hosted gubernatorial candidate Jason Richey and last November hosted Dr. Nche Zama, another GOP gubernatorial hopeful.",
    "Oath Keepers leader Stewart Rhodes and other members were indicted on seditious conspiracy charges over their role in the storming of the Capitol.",
    "Barletta was also one of the 20 Republicans to sign on as a fake Trump elector, though he has not yet been summoned before the House Jan. 6 panel.",
    "Barletta fully embraced Trump's election lies, refusing to admit that Biden won the race and calling for an \"audit\" of the state's results.",
    "State Democrats called Barletta a \"Trump sycophant, alleging that he cared \"more about Mar-a-Lago than Pennsylvania's working families.\"",
    "Barr rejected McSwain's claims, saying his \"cutely written\" letter was an attempt to curry favor with Trump.",
    "The fake elector scheme has since come under scrutiny by the House committee investigating the Capitol riot.",
    "Barletta's PAC in 2019 backed GOP candidate Frank Scavo for a seat in the state legislature.",
    "\"We're white supremacists as far as our opponents are concerned,\" he told the outlet.",
    "Read more on Jan. 6 and the far right:\nBefore Jan. 6, I knew violence was coming.",
    "The trip was taken over by \"private individuals\" and proceeded as planned.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Neither Mastriano nor Barletta responded to questions from Salon.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"I know we're not, but that's what they think.",
    "I know how far men like Trump will go to win",
    "There's nothing we can do about it.",
    "We just do the best we can.\""
  ]
}