{
  "id": 7008,
  "mediaId": 124,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "Inside the chaotic GOP primary for governor in Pennsylvania",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220227-lou-barletta-jm-1500-e7a69a.jpg",
  "link": "https://www.nbcnews.com/politics/elections/chaotic-gop-primary-governor-pennsylvania-rcna17837",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "\"And with the forest of TV ads already being run by Senate candidates in Pennsylvania, it's not likely that any candidate for governor will be able to make an impact just by putting up a few trees on TV,\" said Murtaugh, who was the communications director for Trumps re-election campaign.",
    "\"There's a sense among the candidates as well as donors and a lot of people in the party that Mastriano has a message that sells in the primary but it's not going to work in the general election,\" said Vince Galko, a Pennsylvania GOP strategist who is neutral in the primary.",
    "Former Rep. Lou Barletta, a hard-liner on immigration, was listed as a so-called alternate elector in Trump allies strategy to overturn the 2020 election  an illegitimate effort to send a completing slate of electors to Congress to stop the ascertainment of Bidens win.",
    "The moment underscored the quandary Pennsylvania Republicans find themselves in as they try to reclaim the governor's mansion in a presidential battleground state that Biden won narrowly and Trump has made central to his debunked claims of a stolen election.",
    "Pennsylvania voters express concerns ahead of midterm elections\nJan. 20, 202204:48\nThe deep primary field is a \"double-edged sword\" for Republicans, said Melissa Hart, a former member of Congress who is seeking the party's nomination.",
    "Most danced around the question by acknowledging that Biden is the current president or praising former President Donald Trump while vowing to tighten the state's election laws before the next presidential election in 2024.",
    "Some noted how his endorsement of Sean Parnell in the states GOP Senate primary blew up when Parnell left the race after he lost a custody battle for his children amid allegations of abuse by his estranged wife.",
    "Democrats, meanwhile, already have a presumptive nominee in Attorney General Josh Shapiro, who has crossover appeal and a national reputation built in part by pushing back against Trumps election lies.",
    "A survey this month by the Trafalgar Group, a conservative polling firm, found Barletta in front, backed by 24 percent of likely primary voters, and Mastriano close behind, with about 20 percent.",
    "Then there is state Sen. Doug Mastriano, who was outside the U.S. Capitol last year when a pro-Trump mob overran it and who was recently subpoenaed by the House committee investigating the riot.",
    "A dozen candidates are fighting for the nomination, many striving for a blend of conservative ideals and electability that can be tough to balance against Trumps grievances and election lies.",
    "When Republican candidates for governor do address the election issues, it is often in the context of Act 77, a package of voting changes that passed the GOP-controlled Legislature in 2019.",
    "Tim Murtaugh, a Barletta adviser, asserted that his candidates name recognition as a former member of Congress and an unsuccessful Senate candidate in 2018 makes him the front-runner.",
    "At a debate last month for Republicans running to be Pennsylvania's next governor, candidates were asked whether they believed President Joe Biden legitimately won the state in 2020.",
    "Some candidates and state Republicans had a number of issues they thought were more important to winning, including jobs, education and the backlash to term-limited Democratic Gov.",
    "\"No, Joe Biden is not the legitimate winner ... \" long-shot John Ventre began, his words immediately smothered by whistles and cheers from the audience in western Pennsylvania.",
    "Hart said he was focused on schools and other issues that appeal to suburbanites who may have voted for Biden in 2020, pointing to the election last year of Republican Gov.",
    "While Mastriano loudly echoes Trump's falsehoods about Pennsylvanias 2020 results, candidates here spend plenty of time on issues that don't involve relitigating his loss.",
    "\"But it also delays the Democrats' opportunity to pick apart our nominee, whereas Josh Shapiro has been already and is continuing to be picked apart as their nominee.\"",
    "\"Sometimes,\" Trump said in a video message to Pennsylvania Republicans that played before last month's debate, \"the vote counter is more important than the candidate.\"",
    "\"We need to do everything we can to restore faith in our elections,\" Corman said in a statement, adding, \"If we dont have faith in our elections, we have nothing.\"",
    "\"So there's the fear overtaking everyone that everyone out there is going to split the vote and Mastriano is going to win this thing with 24 percent of the vote.\"",
    "A Morning Consult/Politico survey released this month found that 50 percent of GOP voters are over discussing 2020, while 37 percent want to keep the focus on it.",
    "Trump, who is teasing another run in 2024, has a keen interest in a state where the governor  not the voters  picks a secretary of state to administer elections.",
    "Bill McSwain, who was the Trump administrations U.S. attorney in Philadelphia, has sought Trumps endorsement by raising vague allegations of voter fraud.",
    "Trump could shake up the race with an endorsement, but those invested in the race who spoke with NBC News said they don't see him doing so at this time.",
    "\"I don't think he's going to make an endorsement, because frankly, a lot of these candidates have ties to him in one respect or another,\" Capozzi said.",
    "Teddy Daniels, a GOP candidate for lieutenant governor who is aligned with Mastriano, agreed that a packed primary makes it much easier for him to win.",
    "Lou Capozzi, who chairs the Cumberland County GOP, said Wolfs pandemic policies and a desire for a return to normalcy will drive the primary vote.",
    "Others said that because both Barletta and Mastriano are seen as loyal supporters, it's less likely Trump would boost one over the other.",
    "The bill expanded mail-in balloting, a practice that became a prime target of 2020 election deniers after Bidens narrow win over Trump.",
    "In interviews, the candidates, their strategists and other close observers painted the picture of a tricky, potentially chaotic race.",
    "\"In a way, it'll hurt the Republicans, certainly because we are less focused on our nominee and advancing our nominee,\" Hart said.",
    "\"They have spines made of spaghetti, and they are showing that they would rather pander and promote the big lie than speak truth.\"",
    "\"I think he made an endorsement for Sean Parnell for the Senate race, and I don't think that really worked out too well for him.",
    "The states high-voltage 2022 Senate race, he said, is likely to clutter the airwaves and command more attention from voters.",
    "Catering to the pro-Trump wing could yield a primary winner by plurality who appeals less to the wider November electorate.",
    "The state party, for the first time since the 1970s, has declined to endorse a candidate for governor before the primary.",
    "Shapiro accused his Republican challengers in an interview last month of \"lying repeatedly\" to Pennsylvanians.",
    "Corman and Mastriano are among those who voted for it as state senators but have since criticized the law.",
    "State Senate President Pro Tempore Jake Corman is overseeing the Legislatures election investigation.",
    "\"The party is split,\" said Daniels, who, like Mastriano, was outside the Capitol on Jan. 6, 2021.",
    "\"Each of the people running against me have demonstrated a profound personal weakness,\" he said.",
    "Only one of the eight hopefuls onstage offered the yes-or-no response that had been requested.",
    "Another 27 percent said they supported other candidates, while 29 percent were undecided.",
    "GOP leaders, including those who once supported Act 77, have since called for its repeal.",
    "Several of the leading GOP candidates have burnished credentials that matter to Trump.",
    "He could be a disruptive force in the primary, even if he doesn't endorse a candidate.",
    "\"In Pennsylvania, you have your swampy establishment, pre-Trump-type politicians.",
    "Wolf has appealed a recent state court ruling that the law is unconstitutional.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "\"They won't be able to catch up to Barletta no matter how much they spend.\"",
    "And candidates have escalated their attacks on one another in recent weeks.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Even Daniels said \"the election thing is just one piece of the pie.\"",
    "\"I think most people are looking forward at this point,\" he said.",
    "Glenn Youngkin in Virginia as a road map to victory this fall.",
    "Mastriano's rise worries some in the states GOP establishment.",
    "So I think he's going to keep his powder dry.\"",
    "And Doug is the only one thats in that lane.\"",
    "That tracks with recent national polling.",
    "I call it the 'America First' movement.",
    "\"How do we bring those people back?\"",
    "And then you have post-Trump.",
    "Tom Wolfs Covid policies.",
    "Hart asked."
  ]
}