{
  "id": 7019,
  "mediaId": 238,
  "date": "2/16/2022 12:00:00 AM",
  "headline": "The cyber fight in Ukraine is getting more serious",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/cybersecurity.svg",
  "link": "https://www.washingtonpost.com/politics/2022/02/16/cyber-fight-ukraine-is-getting-more-serious/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "The officials did not say whether they thought Zero Hedge knew of any links to spy agencies and did not allege direct links between the website and Russia.?\nThe site rebutted the accusations, writing that this website has never worked, collaborated or cooperated with Russia, nor are there any links to spy (or any other) agencies.? The sites goal is to provide a platform, a voice to anyone who has a unique, a .different, perspective from the one pushed by the mainstream media.?\nThe House committee subpoenaed two Trump campaign aides and current and former Republican officials in three battleground states, Tom Hamburger and Jacqueline Alemany report.",
    "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. Mark Finchem (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate Doug Mastriano (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trumps reelection campaign\nThe committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,? Tom and Jacqueline write.",
    "Heres Sandra Joyce, head of intelligence at the cyber firm Mandiant, in a blog post: The U.S. and Europe have seen wave after wave of attempts to burrow into our sensitive critical infrastructure  attempts we believe were designed to prepare for a scenario such as the crisis that is unfolding in Ukraine today Without a doubt, the threat they pose is serious?\nThe moves come amid broad uncertainty about whether the conflict is winding down or scaling up.",
    "The concern is so great that on Friday the White Houses deputy national security adviser for cyber, Anne Neuberger, ran a tabletop exercise to ensure that federal agencies were prepared for Russian cyber-assaults that might take place in an escalating conflict with Moscow,? Ellen and Alex report.",
    "Richard Blumenthal (D-Conn.) and Marsha Blackburn (R-Tenn.) would require social media companies to give children more control over personal data they share with those sites and impose the highest security and privacy settings by default, Cat Zakrzewski reports.",
    "Kremlin hackers have likely wormed their way into computer systems of Ukraines military and top energy firms and could disrupt them during a land invasion, according to newly declassified U.S. intelligence as reported by Ellen Nakashima and Alex Horton.",
    "ORourke, who was always an entertaining panelist on NPRs Wait Wait  Don't Tell Me!?\nBelow: U.S. officials accused a financial site of spreading Russian propaganda, and election administrators are short on cash for security and other priorities.",
    "The officials said Zero Hedge, which has 1.2 million Twitter followers, published articles created by Moscow-controlled media that were then shared by outlets and people unaware of their nexus to Russian intelligence,? Merchant writes.",
    "The bill would also require companies to ramp up parental controls for children under 16, including allowing them to limit screen time, view how long kids spend on particular sites and disable features aimed at extending time online.",
    "Zero Hedge has published articles by people affiliated with a U.S.-sanctioned foundation that the Biden administration says is linked to a Russian intelligence agency, the Associated Presss Nomaan Merchant reports.",
    "It says, hey, were ratcheting things up, but were not crossing any huge red lines yet.?\nSome Ukrainian citizens also received spam text messages claiming that ATM service was disrupted, Ukraines cyber police said.",
    "And it would allow the federal government to create a program for researchers to access data from companies so that they can do more research about techs potential harm of children and teens.?",
    "He pledged that the United States is prepared to respond? to any disruptive cyberattacks against our companies or critical infrastructure? targeting the United States or its allies.",
    "The subpoenas come as the committee investigates the effort to have Trump electors cast votes for the former president in states that were certified as being won by Biden.",
    "The bill also establishes an obligation for companies to prevent the promotion of self-harm, eating disorders, bullying and the sexual abuse of children,? Cat reports.",
    "U.S. officials are also preparing in case the conflict escalates to the point Russian hackers are going after U.S. targets  likely in response to Western sanctions.",
    "Our analysts indicate that they remain very much in a threatening position,? he said, while expressing hope the conflict can be resolved through diplomacy.",
    "Hackers are poised at the edge of a significant cyber fight, but they havent crossed the border yet  much like the broader military conflict right now.",
    "Russia is inching closer to a serious cyberattack in Ukraine even as the United States sharpens its warnings against any cyber aggression.",
    "Its called a distributed denial of service (DDoS) attack and involves flooding websites with digital requests until theyre forced offline.",
    "The U.S. government has determined only that Russia could undertake disruptive cyberactivity, not that it will,? Ellen and Alex report.",
    "This is signaling,? Christian Sorenson, a former U.S. Cyber Command official and CEO of the cyber firm SightGain, told me.",
    "Russia said it has pulled back some of the roughly 150,000 troops massed on the Ukrainian borders with Russia and Belarus.",
    "Russia has a long and documented history of compromising critical infrastructure, such as banks and energy firms.",
    "The finance blog typically publishes articles about finance and politics, often from a conservative perspective.",
    "Together those attacks might, at most, slightly reduce public faith in the security of financial institutions.",
    "Early this morning, a website disruption was still forcing the Ukrainian defense ministry website offline.",
    "But U.S. officials have not verified any movement, President Biden said in a public address yesterday.",
    "Russia is the likeliest culprit, but no nation has yet firmly attributed the attacks to the Kremlin.",
    "Earlier attacks against Ukrainian government computers were more serious, wiping out some data.",
    "Similar attacks hit the websites of the nations armed forces and several Ukrainian banks.",
    "Tuesdays letter requests depositions into mid-March.?\nThe bill from Sens.",
    "Officials fear it could now use that access to cause significant damage.",
    "But it could be a signal of far more serious attacks that are ready.",
    "Thats a relatively minor attack in hacking terms.",
    "Biden also issued a stark warning.",
    "Welcome to The Cybersecurity 202!",
    "RIP P.J."
  ]
}