{
  "id": 7024,
  "mediaId": 124,
  "date": "2/15/2022 12:00:00 AM",
  "headline": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220215-arizona-kelli-ward-2018-ac-454p-0d7a9f.jpg",
  "link": "https://www.nbcnews.com/politics/congress/new-subpoenas-jan-6-committee-target-alternate-elector-organizers-rcna16382",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    926,
    1147,
    1413,
    1990,
    2052,
    2087,
    3102,
    545,
    600,
    2550
  ],
  "sentences": [
    "In his letter to Mastriano, Thompson said the committee understands \"you have knowledge of and participated in a plan to arrange for an alternate slate of electors to be presented to the President of the Senate on January 6, 2021, and we understand that you spoke with former President Trump about your post-election activities.\"",
    "Thompson, D-Miss., went on to say that the committee \"would like to better understand these, and other, statements, events that you witnessed or in which you participated, \" and \"communications we believe you may have had with national, state, and local officials about the outcome of the November 2020 election.\"",
    "The panel also wants to find out more about Finchem's comments that he had traveled to Washington, D.C., to deliver an evidence book and letter to Vice President Pence showing key evidence of fraud in the Arizona Presidential Election, and asking him to consider postponing the award of electors,? Thompson wrote.",
    "Among those being subpoenaed are Kelli Ward, the Arizona GOP chair who has already filed suit to block the committee from getting her phone records, and Pennsylvania state Sen. Doug Mastriano, an outspoken purveyor of the false claim that there was widespread fraud in the presidential election.",
    "Were seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,\" Rep. Bennie Thompson, the panel's chairman, said in a statement announcing the subpoenas.",
    "It also said that, \"Based on your public statements, we understand that you were present during the attack on the U.S. Capitol on January 6, 2021, and that you witnessed 'agitatorsgetting in the face of the police' and 'agitatorsstart pushing the police up the [Capitol] steps.",
    "The House committee investigating the Jan. 6 riot at the Capitol subpoenaed a half-dozen people Tuesday who it says were involved in organizing slates of \"alternate electors\" to challenge President Joe Biden's 2020 election victory.",
    "Subpoenas were also issued to two members of Trump's campaign team who were allegedly part of a \"coordinated strategy\" to enlist Republican state lawmakers to line up alternate slates of electors, Thompson said.",
    "Ward, an ardent supporter of former President Donald Trump who tried to overturn Bidens electoral victory in Arizona, and her husband were part of a bogus slate of electors from the state.",
    "Thompson said the committee wants to know about Finchem's claims the election was \"rigged\" and his communications with organizers of the \"Stop the Steal\" rally on Jan. 6.",
    "The new subpoenas come weeks after the panel subpoenaed 14 of the 84 so-called alternate electors who falsely claimed that Trump had won the election in their states.",
    "The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.",
    "The panel also issued a subpoena Tuesday to Mark Finchem, who's running for secretary of state in Arizona and has been endorsed by Trump.",
    "In Tuesday's letter, Thompson noted that during the Jan. 6 riot she tweeted: Congress is adjourned.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "'?\nWard and Mastriano did not immediately respond to requests for comment.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Finchem did not immediately respond to a request for comment.",
    "Send the elector choice back to the legislatures.\""
  ]
}