{
  "id": 7041,
  "mediaId": 237,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Pennsylvania court declares mail-in voting law unconstitutional",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/813407.png",
  "link": "https://www.washingtonexaminer.com/news/pennsylvania-court-declares-mail-in-voting-law-unconstitutional",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Faddis",
  "authorUrl": "https://www.washingtonexaminer.com/author/elizabeth-faddis",
  "termIds": [
    1147,
    1625,
    1713,
    1990,
    3102,
    51,
    5186,
    2862
  ],
  "sentences": [
    "\"No-excuse mail-in voting makes the exercise of the franchise more convenient and has been used four times in the history of Pennsylvania,\" Mary Hannah Leavitt, a judge with the Commonwealth Court, wrote in the court's decision.",
    "\"A constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can 'be placed upon on statute books,'\" she added.",
    "In a 3-2 decision on Friday, the court ruled that the mail-in voting law, also known as Act 77, was not legal but left open the possibility of it passing constitutional muster if voted on by the public.",
    "Tom Wolf signed the bipartisan mail-in voting law into effect on Oct. 31, 2019, allowing all citizens in the state to request and submit mail-in ballots and providing extra time to register to vote.",
    "\"More than 5M mail-in ballots have been cast by voters of both parties in the 4 elections since our bipartisan mail-in voting law was signed in 2019,\" Shapiro wrote in a tweet.",
    "While former President Donald Trump and GOP lawmakers in the state, such as Sen. Doug Mastriano, welcomed the ruling, Attorney General Josh Shapiro expressed disappointment.",
    "Trump claimed the mail-in ballots were among the tools exploited by political opponents who committed widespread voter fraud despite officials' assurances votes were secure.",
    "Fourteen Republican lawmakers filed the lawsuit with the Commonwealth Court in September of last year, arguing the state's mail-in voting law was unconstitutional.",
    "The law was in place during the 2020 presidential election when many viewed congregating at the polls as a heightened risk amid the coronavirus pandemic.",
    "\"If presented to the people, a constitutional amendment to end the Article VII, Section 1 requirement of in-person voting is likely to be adopted.\"",
    "The Pennsylvania Commonwealth Court struck down the state's mail-in voting law as unconstitutional unless voted upon by citizens.",
    "His campaign filed several lawsuits alleging widespread voter fraud, the majority of which were tossed by federal courts.",
    "Previously, people with conflicts such as religious holidays or work vacations had to request absentee ballots.",
    "We'll appeal to restore Act 77 and protect mail-in voting.\"",
    "\"More Republicans voted for this law than Democrats.",
    "These are facts.",
    "Democratic Gov."
  ]
}