{
  "id": 7042,
  "mediaId": 129,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Pennsylvania Court Says States Mail Voting Law Is Unconstitutional",
  "image": "https://static01.nyt.com/images/2022/01/28/us/politics/28pa-votinglaw-1/merlin_179587551_600f88c8-5b92-47c4-aba2-0dee2622987f-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/28/us/politics/pennsylvania-mail-voting-law-unconstitutional.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3102
  ],
  "sentences": [
    "Whether it be through a court decision or by legislation, I support the immediate end of Act 77.?\nThe bipartisan law was praised by both sides when it was passed, but it became a target of conservatives during the 2020 election, as former President Donald J. Trump unspooled falsehoods and lies about fraud involving mail-in voting.",
    "In a statement, Josh Shapiro, the Democratic Pennsylvania attorney general who is also running for governor, criticized the state courts decision as faulty?\nThis opinion is based on twisted logic and faulty reasoning, and is wrong on the law,? Mr. Shapiro said in a statement.",
    "Senator Josh Hawley of Missouri, a Republican, challenged the slate of electors from Pennsylvania on Jan. 6, 2021, claiming that the states lawmakers had passed Act 77 irregardless of what the Pennsylvania Constitution said.?\nSoon after, rioters stormed the U.S. Capitol.",
    "The majority opinion, written by Judge Mary Hannah Leavitt, a Republican, said that voting requires the physical presence of the elector? and ruled that the legislature could not make changes to voting laws without amending the state Constitution.",
    "Following the 2020 election, Representative Mike Kelly, a Republican from northwestern Pennsylvania, filed a lawsuit seeking to overturn the results in the federal races and claimed that Act 77 was unconstitutional.",
    "It permitted no-excuse absentee voting, created a permanent mail-in voter list, reduced the voter registration deadline from 30 days to 15 and provided for $90 million in election infrastructure upgrades.",
    "A state court in Pennsylvania on Friday struck down the states landmark election law as unconstitutional, dealing a temporary blow to voting access in one of the nations most critical battleground states.",
    "Unsatisfied with the results of that wager, they would now flip over the table, scattering to the shadows the votes of millions of Pennsylvanians,? Justice David Wecht wrote following the election.",
    "But his effort was sternly rebuffed by the states Supreme Court, which ruled that the law had been in place for well over a year with no legal challenge until Mr. Trump lost Pennsylvania.",
    "They expressed confidence that the appeal to the state Supreme Court, which has sided with the state on voting issues both during and following the 2020 election, would be successful.",
    "I welcome the end of no-excuse mail-in voting in Pennsylvania,? said Doug Mastriano, a Republican state senator who is also running for governor, in a statement.",
    "Pennsylvania filed an appeal to its Supreme Court on Friday afternoon, triggering an automatic stay that keeps the law in place during the appeal process.",
    "Republicans in the state celebrated the decision, claiming that the law had been warped by Democratic state leaders in the run-up to the 2020 election.",
    "Courts should not decide elections when the will of the voters is clear.?\nAn appeal by Mr. Kelly to the United States Supreme Court was also denied.",
    "This is just a continuation of attacking and undermining our electoral process,? said State Senator Jay Costa, the Democratic minority leader.",
    "Democrats in Pennsylvania said they were not surprised that the Commonwealth Court, which they said leans conservative, ruled against the law.",
    "In a 3-to-2 decision, the state court sided with 14 Republican lawmakers who sued last year, arguing that the law was unconstitutional.",
    "It is not our role to lend legitimacy to such transparent and untimely efforts to subvert the will of Pennsylvania voters.",
    "Yet the Republican attempts to overturn the 2020 election based on challenges to Act 77 continued.",
    "The law, known as Act 77, was passed by the Republican-controlled legislature and signed by Gov.",
    "Eleven of the 14 lawmakers who sued to kill the law voted for it in 2019.",
    "Later that night, Pennsylvanias electors were seated.",
    "It also eliminated straight ticket voting.",
    "Tom Wolf, a Democrat, in 2019."
  ]
}