{
  "id": 7048,
  "mediaId": 238,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "Opinion: Will 2022 be all about Trump? Direct that question at Republicans, not Democrats.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/01/12/midterm-elections-all-about-trump-gop/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1216,
    1233,
    1282,
    2087,
    2131,
    3102,
    146,
    428,
    2862,
    2953
  ],
  "sentences": [
    "This is the key takeaway from a new Politico report that concludes numerous GOP candidates for governor around the country are crafting their campaigns in his image.?\nMost notably, many GOP gubernatorial candidates in primaries are practically clambering all over each other to show unshakable fidelity to Trumps lies about the 2020 election and about our election system more generally.",
    "Heres a rundown, per Politico:\nIn Pennsylvania, state Sen. Doug Mastriano launched his gubernatorial campaign by touting his support from two Trump associates  former campaign lawyer Jenna Ellis and former national security adviser Michael Flynn  who are loud proponents of conspiracy theories and lies about the 2020 election.",
    "We have to talk to them and articulate how these candidates would bring Trumps policies, personality and attempts to overturn elections into state government.?\nOthers, this strategist notes, are motivated about how youre going to make their lives better.",
    "Amusingly, one GOP strategist openly declares that any candidate for governor who hopes to have a chance must embrace the need to win Trump voters without hesitance.?\nThese developments seem oddly out of sync with the lesson from Virginia, i.e.",
    "As one Democratic strategist involved in gubernatorial races told me, many Democratic voters still are energized by the continuing threat Trump poses, and Democrats must speak to those voters, even if others are less driven by that threat.",
    "In reality, McAuliffe campaigned on many issues, but the charge stuck: In 2022, went the refrain, just how aggressively Democrats would seek to tie GOP candidates to the former president would have to be dramatically recalibrated.",
    "In Nevada, gubernatorial candidate Dean Heller, a former senator, is campaigning on the idea that the only way Republicans can win the next presidential election in the state is if a GOP governor changes election laws.",
    "After Democrat Terry McAuliffe lost the Virginia gubernatorial race, a chorus of pundits and analysts chanted in unison that Democrats had been punished for being overly obsessed with former president Donald Trump.",
    "Whatever the truth of that, Trump will require Republican gubernatorial hopefuls to make their candidacies about Jan. 6 by pledging fealty to the underlying cause of the rioters as a just one.",
    "So other Democratic gubernatorial candidates will have no choice but to follow the lead of Josh Shapiro in Pennsylvania, who is already seeking to heighten those stakes.",
    "Yes, Virginia is more blue-leaning than these other states, but note that Trump lost all of them, yet many of these candidates are going full Trump in them anyway.",
    "In Arizona, gubernatorial candidate Kari Lake, a former TV anchor, will attend a rally on Saturday with Trump and two prominent Trump-backing conspiracy theorists.",
    "But that aside, Democrats simply have to spell out the stakes of letting Trumpists get their hands on those processes when it comes to the future of democracy.",
    "But missing from this whole notion is the role that Republican candidates themselves appear poised to play in making the 2022 elections all about Trump.",
    "To be clear, this doesnt mean Democrats can make these elections all about Trump,? as the constant pundit cliche has it, and nor are they going to.",
    "Also in Pennsylvania, other candidates are staffing up with former Trump advisers, who will surely help them sharpen appeals to Trump voters.",
    "Indeed, it would arguably be malpractice for Democrats to refrain from placing their own stamp on the importance of Trump in these contests.",
    "The reason for this resides in the specific and outsize significance these races may end up having for the integrity of future elections.",
    "Governors will be in a position of great influence over how smoothly the 2024 elections certification processes for electors proceeds.",
    "One particularly Trumpy candidate, former Rep. Lou Barletta, has even hired the consultants that oversaw Trumps failed 2020 campaign.",
    "Heller has refused to say Joe Biden legitimately defeated Trump, thus trading on anger about Trumps loss to underscore that case.",
    "that a Republican can win by directing Trumpist appeals to the base while keeping them as subtle and disguised as possible.",
    "Gubernatorial candidates are in a position to tell both stories simultaneously.? Thats the balance to strike.",
    "Obviously its suboptimal that Republicans in thrall to Trump and his lies are running for these positions.",
    "We constantly hear that voters arent motivated by memories of Jan. 6 and efforts at a reckoning over it.",
    "Given all this, Republicans seem like the ones poised to ensure that these races are about Trump.",
    "And Democrats will have a responsibility to explain to voters the depths of danger this poses.",
    "Segments of our base are motivated by the specter of Trump,? this strategist told me.",
    "What it does mean is that getting the balance right here will be paramount."
  ]
}