{
  "id": 7049,
  "mediaId": 43,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "The Hill, \"John Fetterman (D) calls for ban on congressional stock trading\"",
  "image": "https://images.dailykos.com/images/1025860/story_image/3000.jpeg?1641957771",
  "link": "https://www.dailykos.com/story/2022/1/11/2074129/-PA-Sen-The-Hill-John-Fetterman-D-calls-for-ban-on-congressional-stock-trading",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1338,
    1680,
    1770,
    3102,
    146,
    428,
    545,
    571,
    2862
  ],
  "sentences": [
    "In the same interview, he complimented President Joe Biden, saying he really appreciated Bidens tone? about uniting the country, and called the news of some of Bidens first appointments encouraging.?\nOver on Team Blue, big news for the second prominent Democrat in this race:\nU.S. Rep. Conor Lamb, a Democratic candidate for the U.S. Senate from the suburbs of Pittsburgh, planted a pair of political flags  geographical and ideological  in Southeastern Pennsylvania Wednesday.",
    "Governor\nPennsylvania Organizations\nPennsylvania Democratic Party\nPennsylvania House Democratic Campaign Committee\nPennsylvania Senate Democratic Campaign Committee\nFair Districts PA\nDraw the Lines PA\nCommittee of Seventy\nCongress:\nSummer Lee for Congress\nSean Meloy for Congress\nChris DeLuzio for Congress\nEugene DePasquale for Congress\nJerry Dickinson for Congress\nMatt Cartwright\nSusan Wild\nChrissy Houlahan\nMadeleine Dean\nDwight Evans\nMary Gay Scanlon",
    "He was part of a team at Columbia University that patented a device to strengthen damaged heart valves, and also was the target of a letter of protest by physicians who asked why the university kept him on the faculty since he had shown an egregious lack of integrity by promoting quack treatments and cures in the interest of personal financial gain.?\nOn Covid-19, Dr. Oz has been particularly contradictory.",
    "Lawmakers should not be making profits off of the same companies they are supposed to be regulating, based on closed-door information that isnt available to the public.?\nIn a recent poll, 76 percent of voters expressed support for banning members of Congress from trading individual stocks, including 70 percent of Democrats, 78 percent of Republicans and nearly 80 percent of independents.",
    "And Pennsylvania has a perfect solution for energy, a bridge fuel, natural gas.?\nAlso, heres the latest on the GOP primary in the Governors race:\nMichael Flynn suggested this weekend that Democrats would refer to Jesus Christ as a \"domestic terrorist\" during a speech in which he endorsed Republican state Senator Doug Mastriano for Pennsylvania governor.",
    "Now heres some more info you should know about the new GOP frontrunner:\nU.S. Senate candidate and television personality Mehmet Oz has a history of promoting \"colloidal silver,\" a liquid dietary supplement that includes tiny particles of the metal and is considered a possible health hazard by national researchers.",
    "Oz, a Republican best known for his now-defunct syndicated program The Dr. Oz Show, has promoted colloidal silver as a dietary supplement, calling it a \"smart\" treatment with \"a ton of data behind it,\" according to a report published Monday by Media Matters of America, a left-leaning nonprofit media monitor.",
    "As McCormick prepares to imminently enter Pennsylvanias Republican contest for the Senate  a race in which candidates are outdoing each other to prove their loyalty to Trump  he is already making moves to inoculate himself from the all-but-certain primary attacks that he is insufficiently MAGA.",
    "Instead he identifies himself as a doctor who is trained to tell it like it is because you deserve to hear our best advice and make your own decisions.?\nPerhaps it shouldnt be surprising that this messianic diet guru would offer to cure us of all that ails us, physically and spiritually.",
    "That isnt the only remark that could come back to bite him in the primary: After the attack on the Capitol last January, McCormick said at a Bloomberg summit that Trump bore \"a lot of responsibility\" for the \"polarization\" and \"divisiveness\" of the previous four years.",
    "The National Center for Complementary and Integrative Health, a branch of the National Institute of Health, stated on its website that taking colloidal silver can be a health hazard and there is no scientific evidence backing its purported health benefits.",
    "Click below to donate and get involved with these Pennsylvania Democrats campaigns:\nGovernor\nJosh Shapiro for Governor\nU.S. Senate\nConor Lamb\nJohn Fetterman\nVal Arkoosh\nMalcolm Kenyatta\nPennsylvania Courts\nLori Dumas for Commonwealth Court\nLt.",
    "I wasn't particularly involved with the Trump camp  I wasn't a Trump supporter,? he said at a 2017 event at Duke University, adding that he nonetheless wanted whichever candidate that won  Trump or Hillary Clinton  to be successful.",
    "Heres another clown in the GOP primary trying to kiss Trumps ass:\nDave McCormick has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an America First? mindset.",
    "Ryan Boyer, the Council leader who also heads the Laborers District Council, made clear in his introduction that Lambs position on organized labor and the fracking of natural gas in the state, made him their clear choice.",
    "Lamb was unanimously endorsed by the Philadelphia Building & Construction Trades Council, 30 labor unions in the city and surrounding suburbs with the political heft to help his campaign with manpower and money.",
    "McCormick has built a campaign-in-waiting with a whos who of Trump-world operatives, and distanced himself from his former companys China ties, while his allies have reached out to Trump-friendly media.",
    "He has promoted the safety and efficacy of vaccines and masks, but also initially recommended the use of the malaria drug hydroxychloroquine to treat Covid, based on a small and soon-discredited study.",
    "Its time we get back to normal.?\nIf theres one consistent strain in Dr. Ozs trajectory, its his belief in the power and responsibility of individuals to take control of their health and well being.",
    "Right-wing media personality Candace Owens has given it a ringing endorsement, and InfoWars host Alex Jones has sold a toothpaste laced with the substance that he claims will kill the coronavirus.",
    "Hes always been a snake oil salesman:\nThe thousands of on-air hours Dr. Oz has spent ministering to Americans health concerns have made him a multimillionaire, and also a controversial figure.",
    "None of it is apparent from his Senate campaign website, which says people are asking him to run to represent America First? values, a nod to former President Donald Trumps battle cry.",
    "Fetterman, one of the top Democratic candidates in Pennsylvania's midterm Senate contest, joins a growing list of high-profile congressional candidates embracing the popular proposal.",
    "And his bid to represent Pennsylvania in the Senate is based on his promise to free Americans from some of the mask and vaccine mandates that his medical colleagues widely support.",
    "He has praised unproven supplements such as sage leaf tea, green coffee bean extract and raspberry ketones as miracles? for weight loss and was chastised by senators for doing so.",
    "The bigger question is why so many are ready to believe that organic, cold-pressed snake oil could stop us from aging, cure cancer, make us lose weight and end a pandemic?",
    "Colloidal silver has long been used for various medical applications, notably wound dressings, according to an article in the journal Environmental Health Perspectives.",
    "We are Americans, and we can do anything we want,? he tweeted recently, alongside a Fox News clip of himself criticizing the Biden administrations Covid-19 policies.",
    "The former Trump administration official appeared to be making a nod to the January 6 event while endorsing Mastriano for being a \"warrior and fighter\" in politics.",
    "He understands that we work in the energy industry, that we want to protect the environment, but we also want to protect our jobs,? Boyer said.",
    "Silver has no known bodily function or benefit when ingested orally, nor is it a nutritionally essential mineral, according to the center.",
    "Health and Democracy are on the ballot next year and we have to take Dr. Ozs candidacy seriously and get ready to keep Pennsylvania Blue.",
    "Mastriano attended the \"Stop the Steal\" rally in D.C. on January 6, 2021 and is a fervent supporter of former President Donald Trump.",
    "The question is whether that will be convincing enough in a state where Trump continues to have a strong hold on the GOP grassroots.",
    "He is a little more of a globalist than I would like,? said Gloria Lee Snover, chair of Northampton Countys Republican Party.",
    "I love his life story  two parents were teachers, he grew up on a Christmas tree farm, and did the hard work  so I like that.",
    "John Fetterman (D) on Tuesday urged Congress to ban lawmakers, their spouses and their senior staffers from trading stocks.",
    "Allowing members of Congress and their spouses to trade stocks is a clear conflict of interest,? he said in a statement.",
    "Strikingly, in his essay announcing his candidacy, Dr. Oz doesnt speak of unity or community, as many politicians do.",
    "They would call him a domestic terrorist today,\" Flynn said Saturday during Mastriano's official campaign launch.",
    "One of those workers said he was fired after appearing in a video announcing the formation of the union.",
    "Recently, federal authorities warned against companies selling colloidal silver as a COVID-19 cure.",
    "But Im still vetting.?\nAn early Jeb Bush backer, McCormick hasnt always been deferential to Trump.",
    "\"Biblically speaking, at the age of 13, Jesus Christ went into the temple and he ransacked it.",
    "The baristas are demanding better pay, higher staffing and more input on COVID-19 measures.",
    "But a lot of Trump past employees are getting on with him and think hes a great candidate.",
    "A former hedge fund CEO, hes overseen more than $1 billion in investments in China.",
    "Colloidal silver can instead prevent the absorption of some drugs, the center said.",
    "Heres what else Fetterman has been up to:\nDemocratic leaders, including Lt. Gov.",
    "We need people that believe in this country,\" Flynn later added in his speech.",
    "More recently, it has been marketed as an alternative medicine cure-all.",
    "Last month, workers at The Coffee Tree announced they were unionizing.",
    "John Fetterman (D. PA)\nFrom The Hill:\nPennsylvania Lt. Gov.",
    "\"Doug Mastriano is exactly the kind of leader we need.",
    "John Fetterman, rallied for a barista who was fired.",
    "We need warriors, we need fighters.",
    "Governor\nAustin Davis for Lt.",
    "Cant say this is surprising.",
    "Governor\nBrian Sims for Lt.",
    "Lt. Gov."
  ]
}