{
  "id": 7220,
  "mediaId": 129,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "How Trumps 2020 Election Lies Have Gripped State Legislatures",
  "image": "https://static01.nyt.com/images/2022/05/22/us/politics/state-legislators-election-denial-1653221407172/state-legislators-election-denial-1653221407172-facebookJumbo.png",
  "link": "https://www.nytimes.com/interactive/2022/05/22/us/politics/state-legislators-election-denial.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Corasaniti",
  "authorUrl": "https://www.nytimes.com/by/nick-corasaniti",
  "termIds": [
    3102
  ],
  "sentences": [
    "If past is prologue, that same strategy is likely to be central to efforts to subvert an election in the future.?\nWhat state legislatures can attempt before an election\nPass laws that make voting harder\nPass laws that give them more power over elections\nPass laws that make overturning elections easier\nWhat they can attempt after an election\nLaunch audits and investigations\nAttempt to delay certification\nVote to send alternate electors\nWhat they can attempt after an election has been certified\nLaunch audits and investigations\nAttempt to decertify the election\nThe Timess review provides only a glimpse of the ways that state legislatures fueled the movement to deny and challenge the 2020 results.",
    "Russell Bowers, the speaker of the Arizona House and a Republican, said that the State Legislature could only appoint its own electors if there was proven demonstrable fraud sufficient to cover whatever balance or a gap in voters that existed.? He added, We did not even come close to that,? and he dismissed the Senate review as a seat-of-the-pants circus.?\nRepublican leaders in other battleground states are facing similar upheavals surrounding so-called audit efforts.",
    "State legislatures hold a unique position in the countrys democratic apparatus, wielding a constitutionally mandated power to set the times, places and manner of holding elections.? Cheered on by Mr. Trump as he eyes another run for the White House in 2024, many state legislators have shown they see that power as license to exert greater control over the outcome of elections.",
    "A call for action\nFour days before the House of Representatives was set to formally tally the Electoral College votes for Mr. Biden, an act long considered purely ceremonial, Mr. Trumps advisers gathered more than 300 state legislators on a Zoom call, according to a report by the House committee investigating the Jan. 6 attack on the Capitol.",
    "In an interview with The Times, Mr. Trump acknowledged that in deciding whom to endorse in state legislative races, he is looking for candidates who want state legislatures to have a say in naming presidential electors  a position that could let politicians short-circuit the democratic process and override the popular vote.",
    "Doug Mastriano, the Republican state senator from Pennsylvania who won his partys nomination for governor on Tuesday, has pushed the Justice Department to investigate debunked election conspiracies, held a legislative hearing with members of Mr. Trumps legal team and promised to enact new voting restrictions if elected.",
    "LANSING, Mich.  At least 357 sitting Republican legislators in closely contested battleground states have used the power of their office to discredit or try to overturn the results of the 2020 presidential election, according to a review of legislative votes, records and official statements by The New York Times.",
    "In some, the false view that the election was stolen  either by fraud or as a result of pandemic-related changes to the process  is now widely accepted as fact among Republican lawmakers, turning statehouses into hotbeds of conspiratorial thinking and specious legal theories.",
    "Days after Mr. Trump spoke to lawmakers, members of the Pennsylvania state legislature wrote a letter to Senator Mitch McConnell, then the Senate majority leader, and Representative Kevin McCarthy, the Republican leader in the House, asking them to delay certification.",
    "In Wisconsin, Robin Vos, the Republican speaker of the House, at first resisted launching an outside forensic audit.? But after public pressure from Mr. Trump, Mr. Vos relented and created a review helmed by Michael Gableman, a former State Supreme Court justice.",
    "Audits as a gateway\nThe hunt for fraud in Arizona accelerated in the days after electors had been certified, and showed how a vocal and determined faction of Republican legislators could force through a deeply destabilizing outside election review.",
    "But with Democrats in control of the House, Senate and governors office, Republicans in the State Legislature showed little interest in joining efforts by the Nevada Republican Party to send an alternate slate of electors after the 2020 election.",
    "Some legislators who were among the most vociferous in their support of subverting the election have tried to use their 2020 efforts as a springboard to higher office, all while still pledging to further remove democratic guardrails.",
    "The argument was based on the independent state legislature theory which asserts that state legislatures hold absolute and exclusive power over presidential elections, including the appointment of electors to the Electoral College.",
    "In the days after the election, the Republican speaker of the House and the Senate president from Michigan rebuffed Mr. Trumps personal pleas to support an alternate slate of electors, even after being summoned to the White House.",
    "A total of 34 laws that include restrictions on voting were passed in 2021, according to a review by The Times, and 18 laws were passed this year, according to a report from the States United Democracy Center, a nonprofit group.",
    "And it is only a minority of Republican lawmakers who promote the legally dubious view that they  and not the votes of the people  can select the electors who formally cast a ballot for the president in the Electoral College.",
    "But in Texas, another state Mr. Trump won, the deeply conservative Legislature was eager to show voters it was taking action and lawmakers introduced a bill that included provisions to overturn results in future elections.",
    "When he released an initial report of his findings in March, Mr. Gableman argued for decertification.? One state representative, Timothy Ramthun, has put the call to decertify at the center of his campaign for governor.",
    "While some may say there is no valid constitutional, nor statutory grounds for such an action, they clearly are disregarding longstanding jurisprudence,? Mr. Finchem wrote in an announcement accompanying the resolution.",
    "He has endorsed 10 candidates for state legislative seats  including some who are challenging Republican incumbents  and is seeking to play kingmaker in the already brewing fight over who will be speaker of the House.",
    "Mr. Trump and his allies focused instead on perceived irregularities in the voting process, such as 23,344 mail-in ballots sent from voters prior addresses and election management databases that were purged.",
    "In most states, the lawmakers who challenged the 2020 results do not yet have the numbers, or the support of governors, secretaries of state or legislative leaders, to achieve their most audacious aims.",
    "Mr. Trump has continued to try to convince state legislatures that they can decertify? the 2020 election, a process that has no basis in either the United States Constitution nor state constitutions.",
    "The Timess analysis exposes how deeply rooted lies and misinformation about former President Donald J. Trumps defeat have become in state legislatures, which play an integral role in U.S. democracy.",
    "In 2020, the plan of Trump and his allies hinged ultimately on getting state legislatures to overturn the will of the voters,? said Ben Berwick, a counsel at Protect Democracy, a nonpartisan group.",
    "In the interview, Mr. Trump, who won seven million fewer votes than Mr. Biden, spread blame for his loss across several targets, including Vice President Pence, Mr. McConnell and state lawmakers.",
    "Mr. Trumps defeat was undisputed among election officials and certified by Democratic and Republican secretaries of state, with slates of electors signed by Democratic and Republican governors.",
    "On Jan. 5, more than 90 legislators from Georgia, Arizona, Michigan, Wisconsin and Pennsylvania sent a letter to Vice President Mike Pence asking him to delay the certification of the election.",
    "In many states, lawmakers first step has been to call for outside partisan investigations, often referred to as audits,? although they do not follow typical auditing procedures or standards.",
    "Yet many of those claims appeared verbatim in a resolution introduced in February by Mr. Finchem, the Arizona state representative, and sponsored by 13 fellow Republicans in the Legislature.",
    "In each of those states, the election was conducted without any evidence of widespread fraud, leaving election officials from both parties in agreement on the victory of Joseph R. Biden Jr.",
    "In three states, Arizona, Pennsylvania and Wisconsin, state lawmakers successfully pushed for investigations that sowed doubt about the results and tested the boundaries of their oversight.",
    "Jonathan Lindsey, a Trump-endorsed candidate for the Michigan State Senate, said that at a minimum he thinks the State Legislature should vote on electors if an election is disputed.",
    "These fictions about rigged elections and widespread fraud have provided the foundation for new laws that make it harder to vote and easier to insert partisanship in the vote count.",
    "Mr. Trump won Florida and had no reason to pressure lawmakers to agitate over the result, though they used distrust in the election as justification for new voting restrictions.",
    "In Arkansas, Republicans granted the State Board of Election Commissioners new powers to take corrective action? or open investigations at every stage of the voting process.",
    "Mark Finchem, a Republican state representative in Arizona who has pursued the dubious theory of election decertification, is a candidate for secretary of state in Arizona.",
    "The Republican Senate hired a shadowy outside firm with ties to election conspiracy theories to conduct an audit,? dismissing objections from Republican county officials.",
    "An early draft of a sweeping Texas election law included a subsection titled Overturning Elections,? though that provision was dropped before the bills final passage.",
    "23 percent took steps to delay the vote count or overturn the election by supporting lawsuits or by signing letters to Congress or former Vice President Mike Pence.",
    "Election and democracy experts say they see the rise of anti-democratic impulses in statehouses as a clear, new threat to the health of American democracy.",
    "The initial pursuit of fraud would devolve into a yearlong fracas between Republicans and local election officials in Maricopa County, home to Phoenix.",
    "Remaking legislatures in the next election\nLegislative leaders have repeatedly acted as firewalls blocking anti-democratic efforts from moving forward.",
    "And yet The Timess analysis also shows that these efforts have encountered significant resistance from key Republican figures, as well as Democrats.",
    "Peter Navarro, a former top White House adviser, told those in the group that it was their responsibility to act, describing the situation as dire.",
    "7 percent supported a legally dubious theory of decertification? of the 2020 election, which legal experts say has no basis in U.S. election law.",
    "In Nevada, Democrats control the Legislature, and though the state Republican Party pushed for alternate electors, no legislators took action.",
    "Mr. Trump told them that legislatures were the linchpin in his strategy, more important than the courts or Congress, according to the report.",
    "The analysis focused on concrete actions and did not include lawmakers posts on social media or statements they made in campaign speeches.",
    "The tally accounts for 44 percent of the Republican legislators in the nine states where the presidential race was most narrowly decided.",
    "Legislators in Florida and North Carolina did not face as much pressure to overturn the election because Mr. Trump carried both states.",
    "This story is part of an ongoing examination by The Times of challenges to democratic norms in the United States and around the world.",
    "Others put more power over elections in the hands of state legislatures, rather than local election officials or secretaries of state.",
    "Note: The actions examined do not include statements made on social media or elsewhere in support of overturning the 2020 election.",
    "24 percent of the Republican lawmakers voted for an outside, partisan review of the 2020 election (often referred to as an audit?).",
    "What the audit? eventually found  that Mr. Biden had indeed won Arizona  proved irrelevant to those who had called for it.",
    "In announcing the resolution, Mr. Finchem made reference to the independent state legislature theory as a justification.",
    "The idea is purely theoretical; it has never been affirmed by a court decision and most scholars say it has no merit.",
    "The path from the reviewto the resolution shows how outside investigations can create pressure for further action.",
    "They have advanced, but not enacted, legislation that would make it easier for politicians to overturn elections.",
    "(Arkansas state legislators were not included in the Times analysis because Mr. Trump won the state handily.)",
    "Regarding the 2020 election, he added: If I were in that seat, I would have voted to send Trump electors.?",
    "The former president and his allies pushed for lawmakers to change the certified results sent to Congress.",
    "357 lawmakers took concrete steps to discredit or overturn the results of the 2020 presidential election.",
    "State lawmakers have responded to Mr. Trumps calls for action largely by overhauling voting procedures.",
    "The reviews have been used to justify new voting laws and efforts to decertify the 2020 election.",
    "Figures do not include vacancies and independent legislators, and may not add up to 100 percent.",
    "Nevada is the only one of the nine battleground states where Democrats control the Legislature.",
    "Local election officials found 76 misleading, inaccurate or false claims in the audit report.",
    "Republican leaders in the Arizona Legislature havent taken up Mr. Finchems measure.",
    "Some bills also sought to make it easier for lawmakers to intervene in elections.",
    "His campaign to overturn the defeat played out differently across the states.",
    "Since then, he has made transforming the Michigan Legislature a pet project.",
    "Mr. Trumps Department of Justice found no evidence of widespread fraud.",
    "That amounts to 44 percent of the Republican lawmakers in those states.",
    "Trump-endorsed candidates for state legislative seats have taken note.",
    "Mr. Trump lost more than 50 of his post-election challenges in court.",
    "The legislatures, the local Republicans, lost the election,? he said.",
    "Mr. Gableman quickly took the investigation in a different direction.",
    "Many experts said such a move would have been unconstitutional.",
    "None of the many recounts or audits altered the outcome.",
    "In Nevada, Mr. Trump lost by more than 33,000 votes.",
    "The resolution calls for decertifying? the election.",
    "Read more from our Democracy Challenged coverage.",
    "Some limited drop boxes or mail-in voting.",
    "Both practices are legal and common.",
    "Mr. Trump has not forgotten."
  ]
}