{
  "id": 7349,
  "mediaId": 32,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
  "image": "https://image.cnbcfm.com/api/v1/image/107065691-1653331818775-gettyimages-1398519796-029a0016_2178b783-e276-4d55-8896-ee222677adc9.jpeg?v=1653331915&w=740&h=416&ffmt=webp",
  "link": "https://www.cnbc.com/2022/05/24/georgia-midterm-primary-elections-trumps-picks-challenge-gop-rivals.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Breuninger",
  "authorUrl": "",
  "termIds": [
    815,
    2095,
    2303,
    3102,
    3103
  ],
  "sentences": [
    "Joe Raedle | Getty Images\nThe impact of Georgia's primary elections on Tuesday will reverberate far beyond state lines, as key races up and down the ballot test former President Donald Trump's political power and set the table for a showdown over which party controls Congress.",
    "The politically unseasoned athlete, who has skipped debates and faced accusations of avoiding non-friendly press, can expect to face more heat in the general, possibly about his reported history of alleged domestic abuse and making exaggerating claims about his business.",
    "A test of Trump's endorsement\nPerhaps more than in any other state this election cycle, Georgia's primaries mark a test of whether Trump, 15 months after the end of his single term in the White House, still holds the same sway over the direction of the GOP.",
    "Businessman Charles Herbster failed to clinch the GOP nomination for the Nebraska governor's race, even after Trump held a rally in the state and defended Herbster against recent sexual-misconduct allegations that had roiled his campaign.",
    "Secretary of State\nIn the GOP primary for Georgia's top elections officer, Trump has backed Rep. Jody Hice, one of the dozens of congressional Republicans who voted to challenge Electoral College results after the Jan. 6 Capitol riot.",
    "Greene was stripped of her committee assignments last year by the Democrat-led House as punishment for peddling a wide array of extreme views and conspiracy theories, including the pro-Trump QAnon conspiracy, before taking office.",
    "Democrats are fighting uphill: The president's party tends to underperform in the midterm elections, and the lead-up to the primaries has been marked in part by high inflation and low approval ratings for Biden.",
    "Here's what to watch:\nGovernor\nFormer Sen. David Perdue is trying again in Georgia, this time competing for the governor's office after losing in last year's Senate runoff race to Democratic Sen. Jon Ossoff.",
    "But Perdue, who is endorsed by Trump and has campaigned in part on spreading the former president's debunked falsehoods about the 2020 presidential election, appears to be falling badly behind incumbent Gov.",
    "Cawthorn, the youngest member of Congress, was dragged down by a laundry list of scandals that had alienated him from many of his fellow congressional Republicans, including North Carolina Sen. Thom Tillis.",
    "One of them, Rep. Andrew Clyde, stoked outrage last year when he claimed in a hearing that the violent pro-Trump mob that swarmed the Capitol on Jan. 6 looked more like a normal tourist visit than a riot.",
    "Also endorsed by Trump is Rep. Marjorie Taylor Greene, whose extreme conspiracy theories before and during her time in Congress have made her a polarizing figure in politics and a villain among Democrats.",
    "Most importantly, he can't win because the MAGA base  which is enormous  will never vote for him, Trump said in a statement endorsing Perdue, which was re-posted by Trump's social media account on Monday.",
    "The Trump-backed challengers in both of those GOP primaries have echoed the former president's false claims that the 2020 presidential election results were tainted by widespread fraud and misconduct.",
    "More recently, media outlets revealed that in the days after the Capitol riot, Greene had texted then-White House chief of staff Mark Meadows urging him to talk to Trump about imposing martial law.",
    "Kemp refused to step down as Georgia's secretary of state when he ran for governor, rebuffing critics' concerns about his participation in an election that his office was in charge of overseeing.",
    "That phone call is being eyed in a criminal investigation looking into Trump's efforts to overturn the election results, overseen by Fulton County District Attorney Fani Willis, who's a Democrat.",
    "For some of today's races, the key question may not be which candidate can receive more votes, but whether a candidate can avoid a runoff election by receiving more than 50% of the votes cast.",
    "An election-reform group had filed a lawsuit to try and kick Greene out of the primary race, alleging that her comments and actions related to the Capitol riot disqualified her from office.",
    "But as of last week, Trump had no further plans to campaign in person for Perdue, whose campaign ad spending has also dried up completely, NBC News reported, citing sources close to Trump.",
    "Trump has also thrown his weight behind Herschel Walker, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "Days before that riot, then-President Trump called Raffensperger and urged him to find 11,780 votes  the number that Trump believed was required to overturn Biden's victory in Georgia.",
    "Brian Kemp and Secretary of State Brad Raffensperger, two Republicans who both resisted pressure from Trump to overturn President Joe Biden's 2020 election win in the key swing state.",
    "Others, such as Pennsylvania's Republican gubernatorial nominee Doug Mastriano, received Trump's endorsement right before the election, once they had already emerged as frontrunners.",
    "Senate\nWalker, a Heisman Trophy winner and businessman who attended the University of Georgia, is expected to easily take the Republican nomination for Senate in Tuesday's primary.",
    "Trump-backed gubernatorial candidate Janice McGeachin, Idaho's lieutenant governor, lost by a wide margin in her challenge of the state's incumbent Republican Gov.",
    "The Republican who advances to the general election will likely face Stacey Abrams, the progressive Democrat who narrowly lost to Kemp in the 2018 governor's race.",
    "That gap includes polls that were conducted after Trump's political action committee reportedly spent $500,000 on ads attacking Kemp in the gubernatorial contest.",
    "Unlike Kemp and other incumbent Republicans being challenged by Trump's picks, Little had not publicly stoked Trump's anger prior to his endorsement of McGeachin.",
    "Some of Trump's endorsements appeared to make a major difference, such as his backing of Rep. Alex Mooney, a West Virginia Republican who won his House primary.",
    "Polls show Walker running more than 50 percentage points ahead of his closest rival, according to an average of recent surveys compiled by RealClearPolitics.",
    "Trump has endorsed more than a dozen candidates in the Peach State primaries, some of whom are challenging incumbent Republicans who are up for reelection.",
    "The most-watched House race in Georgia will likely be the 14th congressional district, where freshman Rep. Greene is running for a second term in office.",
    "Brian Kemp greets people as he campaigns during a Get Out the Vote cookout at the Hadden Estate at DGD Farms on May 21, 2022 in Watkinsville, Georgia.",
    "He has been endorsed by former Vice President Mike Pence, whom Trump has attacked over his refusal to reject Electoral College votes on Jan. 6, 2021.",
    "Rep. Madison Cawthorn, a first-term Republican from North Carolina, also lost his primary despite his incumbent status and an endorsement from Trump.",
    "The election of Warnock over Republican Kelly Loeffler in a pivotal 2021 runoff election helped Democrats seize a razor-thin majority in the Senate.",
    "But a judge ruled against that group, and Secretary of State Raffensperger ruled earlier this month that Greene's reelection campaign can continue.",
    "Meanwhile in Alabama, GOP Rep. Mo Brooks is fighting in the primary for the state's open Senate seat after Trump rescinded his endorsement.",
    "He has launched an array of attacks against Raffensperger's handling of the 2020 election, some of which fact-checkers have labeled false.",
    "House\nIn the Republican House primaries, Trump has also endorsed a number of loyalists who have challenged the 2020 election results.",
    "Trump, who had previously publicly attacked Kemp and Raffensperger, wrote on Twitter after the call that Raffensperger has no clue!",
    "That dynamic holds true in the four other states  Alabama, Arkansas, Texas and Minnesota  that are also holding elections Tuesday.",
    "But Walker is likely to face much stronger opposition if he advances to the November election against incumbent Sen. Warnock.",
    "Early polls of the hypothetical Walker-Warnock matchup show the candidates virtually tied, according to RealClearPolitics.",
    "Kemp remains an enemy in the eyes of Trump, who has slammed the Republican as a very weak governor who has failed Georgia.",
    "Georgia's primaries arrive as Republicans hope to wrest control of the House and Senate from the Democrats in the fall.",
    "Some political watchers view trump's endorsement record in the current primary cycle as a key measure of his influence.",
    "In Georgia's primaries, Trump endorsed three Republican House members in safe districts just days before Election Day.",
    "While most of Trump's endorsees have won their primaries, some of those candidates ran with little or no opposition.",
    "Kemp, who in 2019 signed a highly restrictive abortion law, has cultivated a reputation as a staunch conservative.",
    "Vance, prevailed in a viciously competitive Ohio Republican Senate primary after winning Trump's support.",
    "Recent polls show Kemp heading into the primary with a double-digit lead over Perdue, his top GOP rival.",
    "In Arkansas, Trump's former press secretary Sarah Huckabee Sanders, who is also the daughter of ex-Gov.",
    "Hice had supported a legal effort to overturn key swing states' 2020 election results.",
    "But others have noted that Trump's win-loss record may not tell a complete story.",
    "Raffensperger refused, and the phone call was promptly leaked to the media.",
    "Abrams in the wake of that loss has repeatedly said the race was unfair.",
    "Polls in Georgia's primary elections are open Tuesday from 7 a.m.",
    "Among high-profile contested races, Trump's record is more mixed.",
    "Mike Huckabee, is expected to win the GOP gubernatorial primary.",
    "Herbster denied the accusations from multiple women.",
    "Other Trump-endorsed candidates lost big.",
    "Those incumbents include Georgia's Gov.",
    "Another candidate, J.D.",
    "Brad Little.",
    "ET to 7 p.m.",
    "Georgia Gov.",
    "Brian Kemp.",
    "ET."
  ]
}