{
  "id": 8461,
  "mediaId": 129,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Trump's Primary Losses Puncture His Invincibility",
  "image": "https://static01.nyt.com/images/2022/05/27/multimedia/27pol-gop-DeSantis/27pol-gop-DeSantis-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/28/us/politics/trump-endorsed-candidates-primary-elections.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    896,
    1147,
    1434,
    2095,
    3102,
    3103,
    428,
    2672,
    2706,
    2816,
    2845
  ],
  "sentences": [
    "Numerous Republican strategists have argued that Mr. Trump's continued obsession with the 2020 election is an unwanted distraction in 2022, when Democrats hold the levers of power in Washington and polls show most of the country feels like the nation is moving in the wrong direction.",
    "DeSantis is great about seeing where the left is going and playing on the field that they're going to be on, rather than reacting to what happened a couple of years ago, Mr. Muzio said, echoing the frustration that Mr. Trump continues to obsess about denying his 2020 election loss.",
    "When a triumphant Mr. Kemp, whom Mr. Trump had targeted because he refused to go along with his efforts to subvert the 2020 presidential election, arrived in Nashville on Thursday to speak before a gathering of the Republican Governors Association, he received a standing ovation.",
    "Mr. Muzio, whose organization is hosting former Secretary of State Mike Pompeo as its fall gala headliner, spoke as he waited to hear Mr. Pence this week in Kennesaw, Ga., at a rally for Mr. Kemp  all names he included in the party's deep bench of 2024 alternatives.",
    "Mr. Trump's main fund-raising committee accounted for 19.7 percent of what was raised by Republican campaigns and committees on WinRed in the last four months of 2021, but just 14.1 percent of what was raised during the first three months of 2022.",
    "But after the first phase of the primary season concluded on Tuesday, a month in which a quarter of America's states cast their ballots, the verdict has been clear: Mr. Trump's aura of untouchability in Republican politics has been punctured.",
    "Still, only 10 times since July 2021 has Mr. Trump's committee accounted for less than 10 percent of the money raised on WinRed during a single day  and nine of those instances came in March 2022, the last month data was available.",
    "Donald Trump had four good years, said Cole Muzio, president of the Frontline Policy Council, a conservative Christian group based in Georgia, who voted twice for Mr. Trump but is now looking for someone more forward-looking.",
    "Mr. Trump has gone from raising an average of $324,633 per day in September 2021 on WinRed, the Republican donation-processing portal, to $202,185 in March 2022  even as he has ramped up his political activities and profile.",
    "In Pennsylvania, Doug Mastriano, a leading voice against certifying the 2020 election, won the primary for governor in a landslide last week  even as the party's old guard warned that he was too extreme to win in November.",
    "The mounting losses have emboldened Mr. Trump's rivals inside the party to an extent not seen since early 2016 and increased the chances that, should he run again in 2024, he would face serious competition.",
    "Rivals, including his own former vice president, Mike Pence, are gearing up for potential presidential runs, as he and others visit key early states like Iowa and ramp up their own fund-raising operations.",
    "Sarah Huckabee Sanders in Arkansas virtually cleared the field for governor with his support, and Representative Ted Budd in North Carolina defeated a past governor to win his party's Senate nomination.",
    "Even some Trump allies, like the right-wing media host Stephen K. Bannon, speak for a swath of one-time Trump voters when they condemn the coronavirus vaccines that Mr. Trump championed while president.",
    "Yet the difficult primary season has added to Mr. Trump's personal anxieties about his standing, after he has sought to fashion himself as something of an old-school party boss in his post-presidency.",
    "Mr. Cotton has also drawn a contrast with Mr. Trump from the right, vocally criticizing the First Step Act  a criminal justice reform bill that the former president signed into law  as a liberal law.",
    "Donald J. Trump had cast this year's primaries as a moment to measure his power, endorsing candidates by the dozen as he sought to maintain an imprint on his party unlike any other past president.",
    "Two former top Trump administration officials, Mr. Pompeo and Nikki Haley, the former United Nations ambassador, are making endorsements, traveling and building up their political infrastructure.",
    "A favorite of evangelical voters, he has sought to highlight his support for ending abortion rights as the Supreme Court prepares for a possible decision undoing the landmark Roe v. Wade ruling.",
    "President Trump's political operation continues to dominate American politics, raising more money and driving more victories than any other political organization  bar none, Mr. Budowich said.",
    "In more than five years  from when he became president in January 2017 until May 2022  Mr. Trump had only ever seen voters reject a half-dozen of his choices in Republican primaries.",
    "Senator Tom Cotton of Arkansas, a Republican who has been a hawk on immigration and China since before the Trump presidency, has positioned himself as a potential heir to Trumpism.",
    "Ron DeSantis of Florida has amassed a $100 million re-election war chest and is the talk of many donors, activists and voters interested in the future of Trumpism without Trump.",
    "Mr. Pence, whom Mr. Trump publicly condemned as rioters swarmed the Capitol during the certification of the 2020 Electoral College vote, has made travels to early states.",
    "Vance in Ohio), losers (Jody Hice in Georgia, Janice McGeachin in Idaho and Charles Herbster in Nebraska) and those headed for a recount (Dr. Mehmet Oz in Pennsylvania).",
    "An analysis by The New York Times shows that his average daily online contributions have declined every month for the last seven months that federal data is available.",
    "I think a non-Trump with an organized campaign would have a chance, said Jack Kingston, a former Georgia congressman who advised the first Trump presidential campaign.",
    "Those close to Mr. Trump  and even Republicans who aren't  caution against misreading the significance of primary losses in which he himself was not on the ballot.",
    "Yet if the primaries in May showed the bounds of Mr. Trump's personal influence, they also made clear that his election-denialism movement has permeated the party.",
    "We had a great four years with him: The economy was great, jobs were great, everything was great, said Belinda Fickes, 49, a cafeteria manager outside of Atlanta.",
    "The resounding message from the Republican voters in Georgia is: Quit talking about 2020, Senator Mitch McConnell, the Republican minority leader, told Politico.",
    "Hillary Clinton carried it by fewer than 8,000 votes in 2016; President Biden won it by more than 55,000 votes, far more than his winning margin in the state.",
    "Taylor Budowich, a Trump spokesman, said the undeniable reality is that Republicans rely on Mr. Trump to fuel Republican victories in 2022 and beyond.",
    "Some Republican strategists have fixated on the fact that so many of Mr. Trump's endorsees have landed about one-third of the vote  big winners (J.D.",
    "Senator Tim Scott of South Carolina recently announced another trip to Iowa and has been investing heavily in his digital fund-raising operation.",
    "Rebuking Trump: The ex-president picked losers up and down the ballot in Georgia, raising questions about the firmness of his grip on the G.O.P.",
    "Governor's Race: Brian Kemp scored a landslide victory over David Perdue, delivering Mr. Trump his biggest setback of the 2022 primaries.",
    "2018 Rematch: Stacey Abrams, the Democratic nominee for governor, will again face Mr. Kemp  but in a vastly different political climate.",
    "Yet the sense among Republicans that Mr. Trump has lost political altitude is taking hold, including among some of those close to him.",
    "The vocal opposition is no longer just confined to anti-Trump forces inside the party but is also evident in the pro-Trump mainstream.",
    "The critical question, as he put it, is whether Republican voters are in a let's give him the gold watch and let's move on mood.",
    "And until Trump either bows out of electoral politics, or is beaten by a Republican at the ballot box, his strength remains.",
    "Mr. Kemp, for instance, took pains not to say a cross word about the former president to avoid alienating his loyal base.",
    "But there has been a less visible sign of slippage: Mr. Trump's vaunted digital fund-raising machine has begun to slow.",
    "After the Georgia Primary Election\nThe May 24 races were among the most consequential so far of the 2022 midterm cycle.",
    "But by the end of this month, that figure had more than doubled, with his biggest defeat coming on Tuesday when Gov.",
    "very much remains Trump's party, even as he saw a distinction developing between Trumpism and Donald Trump himself.",
    "One-third of the party is at once an unmatched base of unbending loyalists  and yet a cohort far from a majority.",
    "He has told advisers he wants to declare his candidacy or possibly launch an exploratory committee this summer.",
    "To be the man, you have to beat the man, said Jim Hobart, a Republican pollster with Public Opinion Strategies.",
    "Most of Mr. Trump's advisers believe he should wait until after the midterm elections to announce a candidacy.",
    "Mr. Trump remains broadly popular among Republicans and has a political war chest well north of $100 million.",
    "There is this temptation to engage in wish-casting in which, This is the moment in which Trump is slipping!'",
    "Mr. Trump still remains the most coveted endorsement in his party, and he has boosted some big winners.",
    "She lives in Cobb County, a suburban area that swung sharply away from Republicans in the Trump years.",
    "Notably, Mr. Trump's share of what is raised overall among all Republicans online has also declined.",
    "But he continues to pad a $23.4 million campaign treasury despite facing only token opposition.",
    "Some of that decrease is the result of other candidates on the ballot raising more this year.",
    "Brian Kemp of Georgia thrashed a Trump-backed challenger by more than 50 percentage points.",
    "voters rejected Donald Trump's 2020 fixation, and Democrats backed a gun-control champion.",
    "Mr. Scott has more than 1,000 times as much as his closest rival, a Democrat with $23,199.",
    "And make the fall election about the future and about the Biden administration.",
    "In interviews with Republican voters at Kemp events, few had become anti-Trump.",
    "But Ms. Fickes, who voted twice for Mr. Trump, is looking elsewhere in 2024.",
    "Three other Trump recruits challenging Kemp allies also went down to defeat.",
    "He's so polarizing, Ms. Fickes said of Mr. Trump, and that's the problem.",
    "Understand the 2022 Midterm Elections\nMr. Sykes said the current G.O.P.",
    "Mr. Scott has said that this will be his last term in the Senate.",
    "He drew a bright red line  and voters just stampeded across it.",
    "On the other hand, what happened in Georgia was significant.",
    "said Charlie Sykes, a conservative anti-Trump commentator.",
    "Rachel Shorey contributed reporting.",
    "Here's what else we learned.",
    "Takeaways: G.O.P.",
    "G.O.P.",
    "Gov."
  ]
}