{
  "id": 8463,
  "mediaId": 195,
  "date": "d2022-05-27T15:00",
  "headline": "Rays of a much-needed, principled GOP shine through",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/e1f9a4aa1c164b048d64c6a1473dc3a2.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/opinion/campaign/3503874-rays-of-a-much-needed-principled-gop-shine-through/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Aftergut",
  "authorUrl": "",
  "termIds": [
    1147,
    1609,
    2087,
    2095,
    2345,
    2437,
    3102,
    4108,
    428,
    2791,
    2972
  ],
  "sentences": [
    "Even before we get to the states, let's note that on May 26, 20 former Republican Congressman urged Republican Minority Leader Kevin McCarthy (R-Calif.) and four other Republican members to comply with the Jan. 6 Committee's subpoenas: A full and honest accounting of the attack and its causes, the former officials wrote, is critical to preventing future assaults on the rule of law and American institutions  and ensuring that we all can move forward.",
    "With Republicans trying to leapfrog each other in extremist positions to gain favor with Trump and his followers, the trend toward abandoning the moderation of traditional Republican icons like Dwight Eisenhower or John McCain may come back to haunt the GOP in places like Pennsylvania.",
    "Debate can be endless about whether principled resisters should stay and work from the inside or head for the exits when the candle is no longer worth the flame  but there's little question that if one chooses to leave, taking a public stand for principle advances the common good.",
    "All in all  without denying the brutal facts of Trumpism's current dominance in the GOP  there are reasons to keep faith that at least some Republicans will continue the fight for a return to common sense and conventional belief in the nation's founding principles.",
    "We saw it in politics on May 25 in Georgia's primary where Trump lost the trifecta: Three Republican candidates whom Trump had endorsed were defeated by those he loved to hate for certifying the 2020 election of Joe Biden  incumbent Gov.",
    "On May 25, Dean Knudson, a Wisconsin former state legislator resigned from the state's election board  which he had helped design  saying Two of my core values are to practice service above self and to display personal integrity.",
    "Of Maddock's removal, Bill Ballenger, a former Republican state legislator in Michigan, told the Washington Post, I think the Republicans just decided we've just got a cancer eating us from within and we've got to get rid of it.",
    "To understand the importance of having principled Republicans, one need only think back to Jan. 6 and Vice President Mike Pence, who resisted almost unbearable pressure from Trump to reject or delay the Electoral College vote.",
    "He was the Michigan Republican who in a Profiles in Courage moment in late November 2020, broke a 1-1 tie on the state's electoral Board of State Canvassers, voting to certify Biden's election.",
    "For most of its history, America's political life has consistently affirmed that judgment, with two parties intent on competing but not on destroying each other or the republic.",
    "We need them to differ on policy but to remain resolute in their commitment to a constitutional system in which the people's will rules and no person is above the law.",
    "Or to Georgia's Raffensperger, who did the same in Trump's Jan. 2, 2021 call in which Trump sought 11,780 votes, one more than needed to overturn the Georgia election.",
    "One election predictor, Race to the Whitehouse, which correctly called the narrow 2020 victories of Joe Biden in Arizona and Michigan as well as of Democratic Sens.",
    "That is why it is so important that there are signs of some Republicans standing up for principle in important states like Wisconsin, Michigan and Georgia.",
    "Then, in the rarest of actions, the Michigan House of Representatives' Republican Caucus removed Trump firebrand Matt Maddock from membership.",
    "We don't yet know where the fight over Trumpism in Michigan will end, but we do know the Greeks' golden mean  nature abhors excess.",
    "In 1824, Thomas Jefferson wrote to his friend, Henry Lee, Men by their constitutions are naturally divided into two parties.''",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Even if the message falls on deaf ears, it matters that there are Republicans of principle willing to speak the truth.",
    "To me, Knudsen told the Milwaukee Sentinel, integrity demands acknowledging the truth even when the truth is painful.",
    "History has affirmed what Thomas Jefferson understood  our politics have always operated with two major parties.",
    "Dennis Aftergut is a former federal prosecutor, currently of counsel to Lawyers Defending American Democracy.",
    "He excoriated the committee for its subservience to Trump, whom Daunt referred to as a deranged narcissist.",
    "Republican Tony Daunt sent a scalding letter of resignation to the party's governing committee.",
    "He is running against the extremely capable Democratic state Attorney General Josh Shapiro.",
    "He has attacked other Republicans for not being sufficiently loyal to the former president.",
    "[T]he painful truth is that President Trump lost  the election in Wisconsin in 2020.",
    "Brian Kemp, Secretary of State Brad Raffensperger, and Attorney General Chris Carr.",
    "There, Republican primary voters nominated extremist Doug Mastriano for governor.",
    "Jon Ossoff and Raphael Warnock in Georgia, projects Shapiro to win by 9 points.",
    "(The good news is that Tony Daunt remains there as his replacement.)",
    "From vital kernels of integrity in the party, cornfields could grow.",
    "He wrote of cowardly party leaders' who were cravenly loyal Trump.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Something very similar happened on April 26 in Michigan.",
    "That vote quickly cost him his seat on the board.",
    "And the loss was not due to election fraud.",
    "Aaron Van Langervelde also comes to mind.",
    "They are not alone."
  ]
}