{
  "id": 8472,
  "mediaId": 129,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "The G.O.P. Has Gone Even Farther to the Right Than I Expected': Three Writers Talk About the Midterms",
  "image": "https://static01.nyt.com/images/2022/05/26/opinion/26bruni-continetti-smith-image/26bruni-continetti-smith-image-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/26/opinion/midterms-trump-democrats-republicans.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    815,
    2095,
    2303,
    3102
  ],
  "sentences": [
    "They voted against the American Rescue Plan (then took credit for the checks that went to American households), mostly voted against infrastructure (then took credit for projects in their districts), mostly voted against capping the price of insulin, voted against stopping oil companies from price gouging, mostly voted against a bill that would include importing baby formula.",
    "Frank Bruni, a contributing Opinion writer, hosted an online conversation with Lis Smith, a Democratic communications strategist, and Matthew Continetti of the American Enterprise Institute about a month of primaries, how they have shaped the midterms and what Democrats and Republicans can hope for and expect.",
    "BRUNI: As we were all typing, Beto O'Rourke, a Democrat who's running for governor in Texas, where this latest horrible massacre occurred, interrupted a news conference being held by the incumbent Republican governor, Greg Abbott, to shout at Abbott that he was doing nothing to stop such bloodshed.",
    "I am open to the idea that the end of Roe v. Wade may induce pro-choice voters off the sidelines in some swing districts, but in the weeks since the leak of Justice Samuel Alito's draft opinion, the evidence of a pro-abortion-rights surge among voters is scattered at best.",
    "SMITH: After Sandy Hook, we did see a number of states  Colorado, Connecticut, Maryland, New York  take strong action on gun control, and I still believe that we will most likely see gun-control legislation on the state versus the federal level.",
    "If Democrats can channel the outrage that a lot of Americans feel  particularly parents  toward the politicians who are just sitting behind tables and choosing inaction and make this about political courage, we can potentially flip the script.",
    "BRUNI: Matt, why aren't the Republicans who are losing to other Republicans in these primaries, as Lis put it earlier, screaming from the rooftops about election irregularities and rigged results the way they do when they lose to Democrats?",
    "SMITH: We have seen common-sense Democrats like Shontel Brown in Ohio, Valerie Foushee in North Carolina and Morgan McGarvey in Kentucky win against far-left Democrats, and that's a good thing for the party and our chances in November.",
    "The Supreme Court taking away something that has been a fundamental right for 50 years will definitely piss people off and bring some of the Biden voters who might have otherwise voted Republican this year back into our corner.",
    "Have the primaries so far conformed to your expectations  or are there particular results or general patterns that surprise you and that challenge, or throw into doubt, your assumptions about what will happen in November?",
    "Lis Smith (@Lis_Smith), a Democratic communications strategist, was a senior adviser to Pete Buttigieg's presidential campaign and is the author of the forthcoming memoir Any Given Tuesday: A Political Love Story.",
    "As we saw in Virginia, Democrats can't rely on painting their opponents as Trump 2.0  they need to explicitly define and disqualify the opposition, and these mega-MAGA extremists give us plenty of material.",
    "SMITH: Trump is a factor here, but Democrats really need to keep the focus on these candidates and their beliefs and make this an election between the Democratic candidate and the Republican candidate.",
    "And midterm elections are traditionally where voters air their grievances: They're mad about inflation, mad about gas prices  in 2018, they were mad about Republicans' trying to repeal Obamacare.",
    "BRUNI: Lastly, in one sentence without too many conjunctions and clauses, give me a reason not to feel too despondent-verging-on-hopeless about our political present and immediate future?",
    "CONTINETTI: Voters will hear a lot of what Lis is saying before November, but the Democrats' problem is that they are in power as inflation comes roaring back after a 40-year absence.",
    "BRUNI: Matt, do ultra-MAGA Republican candidates like him or for that matter Ted Budd in the North Carolina Senate race potentially undermine what might otherwise be a red-wave year?",
    "It will allow Democrats in marginal, suburban seats to use the issue against their Republican opponents, given that nearly every Republican in the House voted against H.R.",
    "Sometimes these sorts of confrontations can come across as a little stunt-y, but in this case, it was executed well and made Governor Abbott and his lackeys look cowardly.",
    "BRUNI: Matt, I know you're not here to help Democrats, but if you were advising them, what would you tell them to do to head off a possible or probable midterms drubbing?",
    "I worry that we're cutting certain Republican conspiracists a break because they're not as flagrant conspiracists as, say, Marjorie Taylor Greene or Madison Cawthorn.",
    "Matthew Continetti (@continetti) is a senior fellow at the American Enterprise Institute and the author of The Right: The Hundred Year War for American Conservatism.",
    "SMITH: That's a great example of going on the offensive, generating the emotion and pissed-off-ness that Democrats need to turn out our voters in the midterms.",
    "Yet Oz has refrained, as have other Trump picks like the former senator David Perdue, who lost in a landslide in Georgia to the incumbent governor, Brian Kemp.",
    "FRANK BRUNI: On Tuesday, at least 19 children and two teachers were killed in the latest mass school shooting in a country that has witnessed too many of them.",
    "CONTINETTI: When you study history, you are reminded that America has been through a lot like this before  and worse  and has not only endured but prospered.",
    "I'm thinking about a guest essay you wrote for The Times not long ago in which you raised the concern that Donald Trump and his minions would spoil things.",
    "But he's right  Mastriano proved so polarizing and so toxic that you had a former Trump adviser in Pennsylvania, David Urban, say that he was too extreme.",
    "Frank Bruni (@FrankBruni) is a professor of public policy at Duke, the author of the book The Beauty of Dusk, and a contributing Opinion writer.",
    "This is a strategy that appeals to independent and moderate voters in the suburbs  they are often with Democrats on abortion, with us on guns.",
    "I agree that it helps when you are the out party in a national election and can blame the incumbent for poor economic and social conditions.",
    "I usually think of the presidential election as when the broad electorate turns out and midterms as when pissed-off voters come out to vote.",
    "Let's just say that the Democrats have a very slim chance of holding the House and a slightly less-than-even chance of holding the Senate.",
    "Because they want to impose as much misery as possible on the American people so that voters blame Biden and vote Republican in November.",
    "Many Democrats believe that pissed-off-ness is the key to winning elections, but I don't know what evidence there is for that case.",
    "Along those lines, do you see anything potentially happening in the months ahead that could change the trajectory of the midterms?",
    "CONTINETTI: If I were a Democratic consultant, the first thing I would tell my clients would be to take shelter from the storm.",
    "What has surprised me is the depth of public disillusionment with President Biden, his party and the direction of the country.",
    "But little has happened to either reduce the number of guns in America or to shift power to advocates for firearm regulation.",
    "He's been urging his choice in the Pennsylvania Senate primary, Mehmet Oz, to declare victory in a race too close to call.",
    "He funded buses to shuttle people to the Capitol on Jan. 6 and helped efforts to overturn the 2020 election in the state.",
    "8, which would implement background checks and common-sense restrictions of the sort that have had broad public support.",
    "And then when they win, they want to criminalize abortions and ensure that we never have free and fair elections again.",
    "At this point, just over five months out, what percentage chance would you say the Democrats have of holding the House?",
    "BRUNI: In 2028 or 2032, will we be talking about Sarah Huckabee Sanders, possible Republican presidential nominee?!?!",
    "CONTINETTI: I can see that, too  maybe that's when Alexandria Ocasio-Cortez will make her presidential debut as well.",
    "CONTINETTI: O'Rourke is running 10 points behind Abbott, and I don't think his outburst will help him close that gap.",
    "At some point the Republicans will nominate a woman for president  let's hope that you didn't just conjure this one.",
    "has been more welcoming of Budd, but he also wanted to overturn 2020 and he also opposes abortion in every instance.",
    "And he has been unpopular with the independents and suburban moderates necessary for any party to win a majority.",
    "For example, what if the Supreme Court in June in fact overturns Roe or further weakens gun regulations?",
    "Even that probably won't be enough to escape the gravitational pull of Biden's declining job approval.",
    "Unfortunately, history suggests that the political landscape won't change after the horror in Texas.",
    "overreached on the bathrooms issue, the law that restricted restroom access for transgender people.",
    "SMITH: We need to be screaming from the rooftops about what the Republicans in Congress are doing.",
    "Regardless, we keep asking, after every primary: What does this say about Trump's level of sway?",
    "SMITH: Emphasis on at this point: 51 percent chance Democrats hold the Senate, 15 percent House.",
    "CONTINETTI: We've been reminded in recent weeks of what you might call Trumpian Exceptionalism.",
    "As the great Mark Shields likes to say, When the economy is bad, the economy is the only issue.",
    "The key to winning elections is to appeal to independent voters and moderates in the suburbs.",
    "Whether getting angry will work in Texas this year and for this candidate is another matter.",
    "North Carolina voters have a history of turning back candidates with extreme social views.",
    "He writes a weekly email newsletter and can be found on Twitter, Instagram and Facebook.",
    "Just look at Doug Mastriano, who won the Republican governor's primary in Pennsylvania.",
    "SMITH: Roe is an example of something that could change the trajectory of the election.",
    "BRUNI: Thoughts on Herschel Walker (potentially) in the Senate, in five words or less.",
    "In its urgency and passion, is that smart politics that could make a difference, Lis?",
    "Budd is a more typical fusion of conservative movement traits with Trump MAGA traits.",
    "The best hope for Democratic incumbents is to somehow denationalize their campaigns.",
    "LIS SMITH: It should, but I unfortunately don't think it will move the needle a ton.",
    "In my heartfelt (and heartsick) opinion, that should change the political landscape.",
    "Where Republicans got the idea that Trump is a political winner is a mystery to me.",
    "CONTINETTI: As you know, Trump did not win the popular vote in either 2016 or 2020.",
    "BRUNI: After that cheery start, let's pull back and zoom out to a bigger picture.",
    "That's one of the reasons Roy Cooper won his first race for governor  the G.O.P.",
    "The people who aren't as out there as Mastriano give us plenty of material, too.",
    "Each incident has been met with public horror and with calls for gun controls.",
    "By the end of his presidency, Democrats were in full control of government.",
    "Right now the economy is the issue, and it's hurting the Democratic Party.",
    "Is there a Republican future in which candidates regularly ignore Trump?",
    "I mean, in the House, Budd voted to overturn the 2020 election results.",
    "BRUNI: Lis, the plenty of material you refer to must include abortion.",
    "CONTINETTI: Math, much less statistics, has never been my strong suit.",
    "We often lose the gun debate because it's about policy particulars.",
    "Is that question distracting us from bigger, more relevant ones?",
    "Even Trump was wary of him until the very end of the primary.",
    "If I had to guess, Budd is more likely to win than Mastriano.",
    "Either a state holds trustworthy elections or it doesn't, no?",
    "CONTINETTI: I'd say they are shaping up as one might expect.",
    "I'd like to hear it and then what Matt has to say about it.",
    "What about hearings on the Jan. 6 storming of the Capitol?",
    "BRUNI: Let's end with a lighting round of short questions.",
    "SMITH: Wow, I've never thought of that, but I can see it.",
    "I draw a distinction, though, between Mastriano and Budd.",
    "But voters have more reasons to be angry than just Roe.",
    "Whenever Trump loses, he says the result is fraudulent.",
    "There's a long and terrible list of school shootings.",
    "SMITH: Trump's whole pitch is to play on grievances!",
    "The president's party rarely does well in midterms.",
    "Sorry, that's three sentences  but important ones!",
    "And this does raise the stakes of the midterms.",
    "The Biden Democrats appear to be no exception.",
    "He makes Ron DeSantis look like Charlie Baker.",
    "My guess is Democrats are surprised as well.",
    "has gone even farther right than I expected.",
    "BRUNI: What shall we call too MAGA for MAGA?",
    "There is no escaping Biden's unpopularity.",
    "Though we've learned not to hope too much.",
    "He opposes abortion without exceptions.",
    "Mastriano is, as you say, ultra-MAGA.",
    "Pissed-off-ness gets you only so far.",
    "BRUNI: Lis, is Matt splitting hairs?",
    "He was too MAGA for the MAGA crowd.",
    "SMITH: It's splitting hairs a bit.",
    "SMITH: We've gotten through worse.",
    "BRUNI: What are you thinking of?",
    "It's really cynical, dark stuff.",
    "SMITH: Death of an institution.",
    "We'll get through this moment.",
    "CONTINETTI: Indeed, it does.",
    "MATTHEW CONTINETTI: I agree.",
    "But, realistically, will it?",
    "Does that concern persist?",
    "CONTINETTI: Fun to watch.",
    "It will just take time.",
    "Some of us hope so.",
    "That's my rant.",
    "The Senate?",
    "Mega-MAGA?",
    "Meta-MAGA?",
    "Maxi-MAGA?",
    "The G.O.P.",
    "The G.O.P.",
    "Why?"
  ]
}