{
  "id": 8626,
  "mediaId": 238,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "What's the far right trying to build power for?",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/06/02/whats-far-right-trying-build-power/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Bump",
  "authorUrl": "https://www.washingtonpost.com/people/philip-bump/",
  "termIds": [
    661,
    2303,
    3102
  ],
  "sentences": [
    "The right's push to have a more active supervisory and management role in voting and vote-counting has been well documented, but recent reports, including from Politico, make clear that there remains real energy aimed at influencing election outcomes.",
    "The Republican nominee for governor in Pennsylvania celebrated his victory in the party's primary last month by pledging to the audience that he would similarly prioritize the sorts of things that get heavy coverage from people like Sean Hannity.",
    "Asked what areas of public policy drove him, Tarrio offered a handful, including criminal justice reform, rooting out violations of our 2nd amendment, free speech across ALL digital platforms and an America first foreign policy.",
    "It was a rejection less of Democratic politics than of the idea that the government should encourage collective action  an idea that was once anodyne but has increasingly been placed at the left end of the partisan spectrum.",
    "The report describes a pattern that should by now be familiar: Traditional Republican figures (here meaning people like former governor Jeb Bush) build institutional power, and outsider elements then appropriate that power.",
    "That's in part because it is framed as oppositional to individual freedom, a term that often simply means that people should not face any restrictions (including on social media, as candidate Enrique Tarrio clearly felt).",
    "Trump rose to power as a representative of the conservative media caucus and earned support from Republican voters, thanks largely to his willingness to echo whatever was airing in the prime-time hours of Fox News.",
    "The most recent iteration of the right's flagship political gathering, the Conservative Political Action Conference, was held in Hungary, where attendees heard effusive praise for that country's autocratic leader.",
    "At least a half-dozen current and former Proud Boys  have secured seats on the Miami-Dade Republican Executive Committee, seeking to influence local politics from the inside, Patricia Mazzei and Alan Feuer report.",
    "There's an inescapable racial aspect to this that emerges explicitly in the Proud Boys' embrace of Western chauvinism, a sense among many on the right that they  often meaning Christian Whites  are embattled.",
    "He completed a questionnaire offered by Ballotpedia in which he explained his candidacy and his political role models  Reps. Jim Jordan (R-Ohio), Matt Gaetz (R-Fla.) and Elise Stefanik (R-N.Y.) among them.",
    "Among its questions was one asking how Americans felt about replacing our existing form of government with one where a strong leader could simply act without being held in check by any legislative body.",
    "He saw political power as a tool to punish his opponents and understood that meeting the needs of his constituents meant winning the sorts of fights in which Breitbart and Rush Limbaugh were engaged.",
    "He also included countering the very real threat of domestic terrorism  clearly a reference not to groups like the Proud Boys but, instead, to left-wing activists like those associated with antifa.",
    "For those familiar with Tarrio solely through his recent political activity  leading a fringe movement that embraces violence and was central to the Capitol riot  this may seem incongruous.",
    "Ron DeSantis (R) expends an enormous amount of energy weighing in on culture-war fights, obviously in part because he has an eye on the national Republican constituency for 2024.",
    "A lot of the right-wing energy around political engagement was sparked not by Trump's false claims of election fraud but by coronavirus restrictions that were seen as oppressive.",
    "These are fairly vague, of course, but refreshingly specific, compared with what the Republican Party itself offered in 2020 after Trump had become the party's official leader.",
    "If you want to hold office less because you want to effect change within the system than that you want to use it as a platform, maybe it will be worth sticking around.",
    "It seems very safe to assume that the Proud Boys and other extremists want power for a primary reason that Trump did: to hold power in lieu of the left doing so.",
    "The New York Times on Thursday explored the extent to which the Republican Party in Miami-Dade County had been infiltrated by active members of the Proud Boys.",
    "You'll recall that the GOP offered literally no platform save that it has and will continue to enthusiastically support the President's America-first agenda.",
    "There was a time when Enrique Tarrio, the currently imprisoned head of the right-wing extremist group the Proud Boys, wanted to be an elected official.",
    "No compromise would be needed with a group that most Republicans said in the same time frame that they saw not as political opponents but as enemies.",
    "There has been a push since the 2020 election for far-right candidates to seek election to lower-ballot races, as well, particularly school boards.",
    "Trump is an important example, though, because he's also a reminder of what one can expect to happen next: The fringe becomes the establishment.",
    "That candidate is Doug Mastriano, a right-wing Trump supporter who was present at the Capitol on Jan. 6, 2021, when violence first erupted.",
    "We may not be able to answer that question for another year or two as the sheer drudgery of holding governmental positions takes its toll.",
    "In Northern California, right-wing politicians now hold a majority on a county board of supervisors following a successful recall effort.",
    "A large majority of Americans said that was a bad idea, but 44 percent of people who vote Republican said it was at least fairly good.",
    "You can ask Rep. Madison Cawthorn (R-N.C.) about the difference between running for and winning office and then holding office.",
    "Cawthorn, for example, clearly liked continuing to stir the pot from his elevated position of elected leadership.",
    "This is a useful caveat to the idea that people will get bored with holding government positions, of course.",
    "He has known Donald Trump's longtime adviser Roger Stone for years and ran a group called Latinos for Trump.",
    "Autocracy is power for the sake of power, power aimed at doing what one wants in the face of opposition.",
    "The Proud Boys don't want power so they can introduce legislation and debate it in committee hearings.",
    "What's happening in Miami is a specific example of the phenomenon, but it's happening elsewhere, too.",
    "Trump's agenda (and Tarrio's, reading only barely between the lines) was mostly culture war stuff.",
    "Much of this is motivated by sincere (if misguided) concern about the security of U.S. elections.",
    "In other words, whatever Trump's agenda was at the moment, that was the party's agenda, as well.",
    "Their ranks include adherents who face criminal charges for participating in the Capitol attack.",
    "Some of it is simply about securing or preserving power for the right, by any means necessary.",
    "Is this simply a side effect of the Trump era and, particularly, its ignominious fate in 2020?",
    "His followers do want to unite America, in the same way that Trump did: against pluralism.",
    "Many on the right don't want to monitor elections simply to verify that they lost fairly.",
    "Why do Proud Boys want to have a say in the direction of the Miami-Dade Republican Party?",
    "His flirtation with running for office was a flirtation with gaining power via one route.",
    "But Tarrio has for some time been intertwined with prominent political actors in Florida.",
    "A majority of Republican voters younger than 50 said it was at least a fairly good idea.",
    "What did the head of the Proud Boys pledge to deliver for his constituents?",
    "This raises a bigger question: Why do far-right elements want this power?",
    "Shortly after Trump took office, the World Values Survey was conducted.",
    "In 2019, he briefly entertained a bid for Congress from South Florida.",
    "Others in his organization, though, aren't forcing that same choice.",
    "Then, of course, there's the push to influence elections themselves.",
    "I want to make America less divded, his answer began, typo included.",
    "He didn't say this explicitly, of course, but he didn't need to.",
    "(No evidence has emerged that he participated in the violence.)",
    "This is what brought me to Tarrio's endorsement questionnaire.",
    "A new generation of elected officials has followed that path.",
    "It's the story of the GOP nationally in the era of Trump.",
    "Or is it a real shift in right-wing engagement?",
    "This can be seen as ironic  or as prescient.",
    "Retaining power offers a form of protection.",
    "It's not clear what to make of this moment.",
    "The latter is generally less interesting.",
    "He ended up choosing another.",
    "The job is what you make it.",
    "What do they plan to do?",
    "Behind the right.",
    "Florida Gov."
  ]
}