{
  "id": 8676,
  "mediaId": 195,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Defense & National Security  Biden, Harris huddle with NATO head",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/06/biden_stoltenberg_nato_ap_0602.jpg?w=827",
  "link": "https://thehill.com/policy/defense/overnights/3510224-defense-national-security-biden-harris-huddle-with-nato-head/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Williams",
  "authorUrl": "https://thehill.com/author/jordan-williams/",
  "termIds": [
    895,
    1147,
    1168,
    1434,
    1990,
    2087,
    2198,
    3102,
    346,
    2959
  ],
  "sentences": [
    "The Friends of the National World War II Memorial will host an event titled Battle of Midway 80th Anniversary Reading of the Names and Wreath Presentation at the World War II Memorial at 10 a.m.\nWHAT WERE READING\nBiden administration announces fresh round of Russia sanctions\n9/11 families press Biden on possible meeting with Saudi crown prince\nBiden lays groundwork for risky meeting with Saudis\nBiden officials speak with Ukraine on latest military aid package\nThe Hill Opinion: The unpalatable truth in Ukraine\nThats it for today.",
    "What the panel wants: The letter from Mastrianos lawyer, first reported by Politico, makes clear the extent of what the panel was seeking from the lawmaker, including any documents or communications tied to the plan to send an alternate slate of electors on Jan. 6 as well as any of his communications with Trumps legal team.",
    "Mastriano agrees to interview with Jan. 6 panel\nDoug Mastriano, Pennsylvanias Republican gubernatorial nominee, will testify before the committee investigating the Jan. 6, 2021, attack on the Capitol about his role aiding the Trump campaign in challenging the results of the 2020 presidential election.",
    "Axios notes that official invitations to testify have not yet been sent, but Luttig previously told CBS News that he would be willing to speak before the House panel investigating Jan. 6, when supporters of former President Trump stormed the Capitol as lawmakers were certifying President Bidens win.",
    "What Mastrianos attorney said: A letter from Mastrianos attorney, Timothy Parlatore, indicates he has turned over a suite of documents to comply with the committees request but notes the panels guardrails to avoid information related to official actions that you took as an elected lawmaker.",
    "FORMER PENCE ADVISER TO APPEAR IN JAN. 6 PANEL HEARINGS\nThe retired judge who advised former Vice President Mike Pence ahead of the Jan. 6, 2021, attack on the U.S. Capitol is expected to be among those who will testify as hearings begin next week, according to Axios.",
    "We continue to closely consult with our Ukrainian partners to ensure U.S. military assistance is adapting as needed to deliver the critical capabilities for todays fight, such as this weeks announcement of plans to transfer Multiple Launch Rocket Systems, they added.",
    "State weighs in: A State Department spokesperson didnt directly dispute the report but told The Hill as a matter of policy, we do not confirm or publicly comment on proposed defense transfers until they have been formally notified to Congress.",
    "The leaders also welcomed Finland and Swedens applications to NATO, and Biden conveyed his strong support for efforts to facilitate a rapid accession process that addresses the security concerns of all Allies, the White House added.",
    "The select House committee subpoenaed the Pennsylvania state lawmaker in February, citing his involvement in a plan to send an alternate slate of electors for some states to swing the 2020 election for former President Trump.",
    "Circuit Court of Appeals appointed by George H. W. Bush, wrote ahead of the attack that the vice presidents role in certifying the election is only to faithfully count the electoral college votes as they have been cast.",
    "Recapping the meeting: The leaders discussed how Russias war affects transatlantic security, as well as the importance of strengthening NATOs deterrence and defense, the White House said in a readout of the meeting.",
    "Biden looks to sell armed drones to Ukraine\nThe Biden administration is reportedly planning to sell armed drones that can carry Hellfire missiles to Ukraine, Reuters reported on Wednesday.",
    "NATO chief huddles with Biden, Harris\nPresident Biden and Vice President Harris met with NATO Secretary General Jens Stoltenberg ahead of the alliances upcoming summit in Madrid.",
    "The meeting was one segment of Stoltenbergs two-day trip in Washington, during which he also met with Secretary of State Antony Blinken and Defense Secretary Lloyd Austin.",
    "Mastriano last month won Pennsylvanias GOP gubernatorial primary after centering much of his campaign on claims of voter fraud and winning Trumps endorsement.",
    "The alliance has to unanimously agree to accept new members, but Turkey is objecting over accusations that the Nordic countries harbor terrorist groups.",
    "A lookahead to Madrid: The heads of state and government from NATOs member countries will be meeting at the alliances summit in Madrid from June 29-30.",
    "The 28-foot unmanned aircraft can last more than 27 hours and hold up to four Hellfire missiles, according to the Armys acquisition website.",
    "Moscow refocuses its efforts toward the eastern part of Ukraine after failing at its initial goal of capturing the capital city of Kyiv.",
    "The spokesperson added that as the conflict is changing and Ukraines defense needs change so too has our support for Ukraines defense.",
    "President Biden and Vice President Harris met with NATO Secretary General Jens Stoltenberg as the alliance head visits Washington.",
    "Parlatore told The Hill they are still in discussions with the committee over when Mastriano will sit for a voluntary interview.",
    "This is Defense & National Security, your nightly guide to the latest developments at the Pentagon, on Capitol Hill and beyond.",
    "About the drone: The Gray Eagle is larger than the drones that Ukraine has been using to fend off Russias invasion so far.",
    "ON TAP TOMORROW\nThe U.S. Institute of Peace will host a discussion on Preventing Mass Atrocities in Afghanistan at 9 a.m.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Plus, well recap the latest moves from the House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "The administration plans to notify Congress of the sale in the coming days and make a public announcement afterward.",
    "It also asks for any documents tied to his efforts to organize busses to transport supporters to the rallies.",
    "The backdrop: Stoltenbergs visit to Washington comes as Russias invasion of Ukraine approaches its 100th day.",
    "The U.S. is looking to sell four MQ-1C Gray Eagle drones made by General Atomics, sources told the outlet.",
    "The countries will discuss the most pressing security concerns of today and tomorrow, the alliance said.",
    "NATO will also adopt its new Strategic Concept, which reaffirms the alliances purposes and tasks.",
    "Given those limitations, the bulk of the tranche of documents provided are social media posts.",
    "It also comes as NATO looks to fast-track Finland and Swedens ascension into the alliance.",
    "Stoltenberg separately met with national security adviser Jake Sullivan, the readout said.",
    "Check out The Hills Defense and National Security pages for the latest coverage.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The drones can be armed with Hellfire missiles.",
    "Michael Luttig, a former judge on the 4th U.S.",
    "A friend forward this newsletter to you?",
    "For The Hill, Im Jordan Williams.",
    "Well talk about the meeting.",
    "See you tomorrow!",
    "Read more here.",
    "Subscribe here."
  ]
}