{
  "id": 8681,
  "mediaId": 195,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Mastriano agrees to interview with Jan. 6 panel",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/mastrianodoug_051822_ap-Carolyn-Kaster_electiondeniers.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/policy/national-security/3509377-mastriano-agrees-to-interview-with-jan-6-panel/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Beitsch",
  "authorUrl": "https://thehill.com/author/rebecca-beitsch/",
  "termIds": [
    3102
  ],
  "sentences": [
    "We understand that you have knowledge of and participated in a plan to arrange for an alternate slate of electors to be presented to the President of the Senate on January 6, 2021, and we understand that you spoke with former President Trump about your post-election activities, the committee wrote at the time.",
    "The letter from Mastrianos lawyer, first reported by Politico, makes clear the extent of what the panel was seeking from the lawmaker, including any documents or communications tied to the plan to send an alternate slate of electors on Jan. 6 as well as any of his communications with Trumps legal team.",
    "A letter from Mastrianos attorney, Timothy Parlatore, indicates he has turned over a suite of documents to comply with the committees request but notes the panels guardrails to avoid information related to official actions that you took as an elected lawmaker.",
    "Doug Mastriano, Pennsylvanias Republican gubernatorial nominee, will testify before the committee investigating the Jan. 6, 2021, attack on the Capitol about his role aiding the Trump campaign in challenging the results of the 2020 presidential election.",
    "The select House committee subpoenaed the Pennsylvania state lawmaker in February, citing his involvement in a plan to send an alternate slate of electors for some states in order to swing the 2020 election for former President Trump.",
    "Mastriano was present at the Capitol on the day of the attack and tweeted that state legislature has the sole authority to direct the manner of selecting delegates to the Electoral College.",
    "Mastriano last month won Pennsylvanias GOP gubernatorial primary after centering much of his campaign on claims of voter fraud and winning Trumps endorsement.",
    "Parlatore told The Hill they are still in discussions with the committee over when Mastriano will sit for a voluntary interview.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "It also asks for any documents tied to his efforts to organize busses to transport supporters to the rallies.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}