{
  "id": 8688,
  "mediaId": 234,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Steve Bannon's Election-Takeover Dream Is Starting to Take Shape",
  "image": "https://media.vanityfair.com/photos/61686895d505681d6be40ac8/master/w_2240,c_limit/Bannon10.14.jpg",
  "link": "https://www.vanityfair.com/news/2022/06/steve-bannon-election-takeover-precinct-strategy",
  "sentiment": "0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    1839,
    1990,
    2207,
    3102,
    403,
    427,
    428,
    2645,
    2791
  ],
  "sentences": [
    "Under the new operation, the party could essentially do that in real time, with trained poll watchersmany of whom appear to have volunteered for positions because they subscribe to Trumps rigged election liesin direct contact with GOP lawyers who could intervene to block vote counts at certain precincts, Politico reported.",
    "But it is only one such threat: From anti-voting legislation enacted on the basis of Trumps lies to a gubernatorial candidate in Pennsylvanias Doug Mastriano who has indicated he would not respect election results, Republicans are building on the former presidents 2020 efforts to overturn his loss.",
    "Being a poll worker, you just have so many more rights and things you can do to stop something than [as] a poll challenger, Matthew Seifried, the RNCs election integrity director for Michigan, said in a November meeting with state GOP activists, according to a recording obtained by the outlet.",
    "The plan is essentially the precinct strategy that was developed a decade ago by Arizona lawyer Dan Schultz and championed more recently by Bannon, the former Trump strategist: Its going to be a fight, but this is a fight that must be won, Bannon said on a podcast episode last year.",
    "Embracing the precinct strategy promoted by Steve Bannon, the GOP is reportedly preparing to sow chaos in the 2022 election by creating an army of poll workers and Republican lawyers to challenge voters in Democratic precincts.",
    "But its true aims seem clear: to gum up the democratic process in Democratic areas and lay the foundation for results to be challenged in swing states like Michigan that were key to Joe Bidens victory in the 2020 election.",
    "As ProPublica has reported, Bannons promotion of that bottom-up strategy has contributed to a groundswell of Big Lie proponents seeking roles in the election process, including as precinct officers and poll workers.",
    "Trump himself gave his blessing to the plan this year, approvingly citing Schultzwho has ties to the Oath Keepers, a far-right group that took part in the January 6 insurrectionin an email to supporters in March.",
    "The undertaking illustrates the extent to which the GOP is institutionalizing Donald Trumps 2020 election liesand provides a glimpse into the partys efforts to hijack the infrastructure of the election system.",
    "According to recordings obtained by Politico, the Republican National Committee has been recruiting and training poll watchers to contest votes and building a network of party-friendly attorneys to help them.",
    "The RNC is focused on training volunteers to take part in the election process because polling shows that American voters want bipartisan poll-watching to ensure transparency and security at the ballot box.",
    "If members of our Great movement start getting involved (that means YOU becoming a precinct committeeman for your voting precinct), we can take back our great Country from the ground up.",
    "Democrats have had a monopoly on poll watching for 40 years, and it speaks volumes that theyre terrified of an even playing field, RNC spokesperson Gates McGavick told Politico.",
    "This is completely unprecedented in the history of American elections that a political party would be working at this granular level to put a network together, Penniman said.",
    "Come election day you create massive failure of certification, Nick Penniman, founder and CEO of the election watchdog group Issue One, told Politico.",
    "It goes without saying that enlisting election deniers to exert influence over the voting process poses a major threat to the democratic system.",
    "The operation has been cast by Republican officials as an effort to even out party imbalances among poll workers in urban centers like Detroit.",
    "In the wake of the 2020 election, Trump and his allies mounted a relentless effort to contest the results in several states he lost.",
    "Just heard about an incredible effort underway that will strengthen the Republican Party, Trump said, according to ProPublica.",
    "Were going to have more lawyers than weve ever recruited, because lets be honest, thats where its going to be fought, right?",
    "The one it will face in the coming elections, as that anti-democratic push grows more sophisticated, could be even tougher.",
    "It looks like now the Trump forces are going directly after the legal system itself and that should concern everyone.",
    "The real hope is that you can throw the choosing of electors to state legislators.",
    "Seifried referred Politicos request to the RNC, which defended its plans.",
    "Its going to be an army, Seifried said at a different meeting last fall.",
    "The democratic process survived that stress test a year and a half ago.",
    "Were going to take this back village by villageprecinct by precinct.",
    "It looks like we're experiencing playback issues.",
    "Our bad!"
  ]
}