{
  "id": 8696,
  "mediaId": 129,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Lawyer who plotted to overturn Trumps 2020 loss recruits election deniers to watch over the vote.",
  "image": "https://static01.nyt.com/images/2022/05/12/multimedia/00pol-training/00pol-training-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/live/2022/05/31/us/midterms-primary-elections",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2095,
    3102,
    3103
  ],
  "sentences": [
    "And while MAGA-world luminaries like Rudolph W. Giuliani, Representative Marjorie Taylor Greene and the MyPillow founder Mike Lindell filled the gilded ballroom, the former president called out two lesser-known figures sitting up front  the stars of 2000 Mules, a documentary film promoting that ballot-trafficking theory and premiering at Mar-a-Lago that night.",
    "The film, directed by the conservative commentator Dinesh DSouza, is based in part on an erroneous premise: that getting paid to deliver other peoples ballots is illegal not just in states like Pennsylvania and Georgia where True the Vote centered its research and where third-party delivery of ballots is not allowed in most cases, but in every state.",
    "Along the way, they had become powerful stalwarts  if not political mascots  in their districts: Ms. Maloney, a pathbreaking feminist and the widow of an investment banker, represents an East Side district so wealthy it was once christened the silk-stocking district; Mr. Nadler, a proudly opinionated old-school progressive, holds down the West Side.",
    "A court-ordered redrawing of New Yorks congressional district lines had combined the East and West Sides of Manhattan into a single district for the first time since World War II, putting Mr. Nadler and Representative Carolyn Maloney, a longtime colleague, on a potentially disastrous collision course in the Aug. 23 Democratic primary.",
    "With a salary of $150,000, the person is expected to comb fringe sites like 4chan, far-right social networks like Gettr and Rumble and mainstream social media sites to root out early misinformation narratives about voting before they go viral, and then urge the companies to remove or flag the posts that contain false information.",
    "According to its website, the coalition includes LaRouchePAC, a committee dedicated to Lyndon LaRouche, the deceased conspiracy theorist, and Lets Fix Stuff, an outfit run by a former Republican state senator who has promoted a theory about the 2020 election that Republican Michigan Senate leaders denounced as indefensible.",
    "Rebecca A. Seawright, an assemblywoman from the Upper East Side supporting Ms. Maloney, said that the congresswoman has endless energy and an innate understanding of womens priorities that her allies believe will resonate with voters in a year when the Supreme Court may strike down Roe v. Wade.",
    "Mr. Phillips is also an adviser to Get Georgia Right, a political action committee that received $500,000 from Mr. Trumps Save America PAC this past March 25, the day after Mr. Phillips and Ms. Engelbrecht advanced their 2020 vote-fraud theories to a legislative committee in Wisconsin.",
    "Numerous Republican strategists have argued that Mr. Trumps continued obsession with the 2020 election is an unwanted distraction in 2022, when Democrats hold the levers of power in Washington and polls show most of the country feels like the nation is moving in the wrong direction.",
    "DeSantis is great about seeing where the left is going and playing on the field that theyre going to be on, rather than reacting to what happened a couple of years ago, Mr. Muzio said, echoing the frustration that Mr. Trump continues to obsess about denying his 2020 election loss.",
    "When a triumphant Mr. Kemp, whom Mr. Trump had targeted because he refused to go along with his efforts to subvert the 2020 presidential election, arrived in Nashville on Thursday to speak before a gathering of the Republican Governors Association, he received a standing ovation.",
    "While the early primaries have delivered a mixed verdict on the former presidents endorsements and stolen-election obsessions, polling nonetheless shows that a majority of Republicans believe the 2020 presidential election was stolen, even though vote fraud is exceedingly rare.",
    "Concerned about a similar deluge of unfounded rumors and lies around this years midterm elections, the state plans to spend nearly $2 million on marketing to share factual information about voting, and to create its first-ever position for an expert in combating misinformation.",
    "In the days after the 2020 election, Ms. Mitchell was among a cadre of Republican lawyers who frantically compiled unsubstantiated accusations, debunked claims and an array of confusing and inconclusive eyewitness reports to build the case that the election was marred by fraud.",
    "Mr. Phillips, whose firm OpSec does data analysis for True the Vote, is perhaps best known for making a fantastical claim in 2017 that more than three million illegal immigrants voted in the 2016 election, which was amplified by Mr. Trump but never backed up with evidence.",
    "He trumpets his role in Mr. Trumps impeachments and frequently points out that he and Ms. Maloney were on opposite sides on the Iraq War (she voted for, he voted against), the Patriot Act (she was for, he was against) and the Iran nuclear deal (he voted for, she against).",
    "More broadly, Ms. Engelbrecht has said that the surge of mail-in voting in 2020 was part of a Marxist plot, aided by billionaires including George Soros and Mark Zuckerberg, to disrupt American elections, rather than a legitimate response to the coronavirus pandemic.",
    "Mr. Muzio, whose organization is hosting former Secretary of State Mike Pompeo as its fall gala headliner, spoke as he waited to hear Mr. Pence this week in Kennesaw, Ga., at a rally for Mr. Kemp  all names he included in the partys deep bench of 2024 alternatives.",
    "In Fairfax, a Democratic bastion outside Washington, about three dozen activists associated with the coalition and the local Republican Party rotated through election offices, combing through voter registration applications, undeliverable mail and other materials.",
    "I think its going to come down to whether they are truly interested in knowing the truth about elections or theyre interested in propagating propaganda, said Al Schmidt, a Republican and former city commissioner of Philadelphia who served on the elections board.",
    "Ms. Maloneys single-mindedness was on clear display one afternoon this week, as she sipped a latte outside Blank Street Coffee on Madison Avenue, near her longtime home, making small talk with constituents passing by while fielding questions from a reporter.",
    "These people are true patriots, Mr. Trump said, gesturing from the podium to the pair  a Tea Party veteran from Texas, Catherine Engelbrecht, and Gregg Phillips, her full-bearded sidekick, a longtime Republican operative  and imploring them to stand up.",
    "For nearly 30 years, the committee was limited in some operations by a consent decree after Democrats accused party officials in New Jersey of hiring off-duty police officers and posting signs intended to scare Black and Latino people away from voting.",
    "A test drive of the strategy in the Virginia governors race last year highlighted how quickly the work  when conducted by people convinced of falsehoods about fraud  can disrupt the process and spiral into bogus claims, even in a race Republicans won.",
    "Mr. Trumps main fund-raising committee accounted for 19.7 percent of what was raised by Republican campaigns and committees on WinRed in the last four months of 2021, but just 14.1 percent of what was raised during the first three months of 2022.",
    "Ms. Mitchells trainings promote particularly aggressive methods  with a focus on surveillance  that appear intended to feed on activists distrust and create pressure on local officials, rather than ensure voters access to the ballot, they say.",
    "Andrianne Konstas, a poll worker and volunteer with the League of Women Voters, said, It almost felt like if Youngkin hadnt won, it would be like were gathering evidence so we can take it to dismiss precincts or to dismiss a process of voting.",
    "On the federal level, the Department of Homeland Security recently paused the work of an advisory board on disinformation after a barrage of criticism from conservative lawmakers and free speech advocates that the group could suppress speech.",
    "Indeed, at the Harrisburg training, Jenny Beth Martin, the leader of Tea Party Patriots, a conservative advocacy group, suggested activists use a three-word response whenever they become frustrated with officials: Bless your heart, she said.",
    "But after the first phase of the primary season concluded on Tuesday, a month in which a quarter of Americas states cast their ballots, the verdict has been clear: Mr. Trumps aura of untouchability in Republican politics has been punctured.",
    "During an elections panel hosted by the Council for National Policy in the summer of 2020, Mr. Fund, a former member of The Wall Street Journals editorial board, said Ms. Engelbrecht had hooked up with the wrong associates and gone astray.",
    "Her latest effort is organized through the Conservative Partnership Institute, a nonprofit organization where she serves as a senior legal fellow and where Mark Meadows, Mr. Trumps final White House chief of staff, is a senior partner.",
    "She has tapped into a network of grass-root groups that promote misinformation and espouse wild theories about the 2020 election, including the fiction that President Bidens victory could still be decertified and Mr. Trump reinstated.",
    "Hans von Spakovsky, a Heritage Foundation fellow, appears in the movie agreeing that the practice is outlawed nationwide, but in 2019 he wrote that it was perfectly legal in some states for political guns-for-hire to collect ballots.",
    "State and local governments are well-situated to reduce harms from dis- and misinformation by providing timely, accurate and trustworthy information, said Rachel Goodman, a lawyer at Protect Democracy, a nonpartisan advocacy group.",
    "Two weeks before the election, the nonprofit behind the Virginia coalition filed a lawsuit, accusing the county of violating state voting law by accepting at least 339 ballot applications that were missing Social Security numbers.",
    "Still, only 10 times since July 2021 has Mr. Trumps committee accounted for less than 10 percent of the money raised on WinRed during a single day  and nine of those instances came in March 2022, the last month data was available.",
    "Coaching poll monitors to consider election officials as enemies is a formula for conflict, said Tammy Patrick, a former federal compliance officer for the Maricopa County elections department in Arizona, who reviewed the manual.",
    "Not since Bella Abzug challenged fellow West Side representative William Fitts Ryan in a 1972 race pitting two liberal icons against each other has New York City faced a primary contest with the potential to be quite so fraught.",
    "Last year, the group set out to find evidence of fraud by canvassing neighborhoods in search of discrepancies between election results and information collected from residents, a method that election experts dismiss as invalid.",
    "But Ms. Engelbrecht found support from Salem Media Group, which distributes right-wing talk radio and podcasts, including one hosted by Mr. DSouza, who was pardoned by Mr. Trump after being convicted of campaign finance fraud.",
    "Donald Trump had four good years, said Cole Muzio, president of the Frontline Policy Council, a conservative Christian group based in Georgia, who voted twice for Mr. Trump but is now looking for someone more forward-looking.",
    "And it will play out in one of the most politically influential pockets of the United States  home to financiers, media titans and entertainers, and the source of millions of dollars in campaign donations each election cycle.",
    "Mr. Trump has gone from raising an average of $324,633 per day in September 2021 on WinRed, the Republican donation-processing portal, to $202,185 in March 2022  even as he has ramped up his political activities and profile.",
    "The suit alleges Ms. Engelbrecht and Mr. Phillips were in a romantic relationship and violated Texas law related to conflicts of interest, since True the Vote directed a substantial portion of Mr. Eshelmans funds to OpSec.",
    "In Pennsylvania, Doug Mastriano, a leading voice against certifying the 2020 election, won the primary for governor in a landslide last week  even as the partys old guard warned that he was too extreme to win in November.",
    "In his primary race this year, Mr. Raffensperger batted down misinformation that there were 66,000 underage voters, 2,400 unregistered voters and more than 10,350 dead people who cast ballots in the presidential election.",
    "Florida, led by Republicans, has enacted legislation limiting the kind of social media moderation that sites like Facebook, YouTube and Twitter can do, with supporters saying that the sites constrict conservative voices.",
    "No matter the outcome, the contest will cost New York City a high-ranking Democrat with the kind of sway to bring money home, and distract from the more pressing fights the Democrats are trying to wage with Republicans.",
    "People like me should be actively trying to help Democrats all over the country, thats what I really am focused on, said Ken Sunshine, a veteran public relations executive, who is planning to raise money for Mr. Nadler.",
    "Connecticut and Colorado officials said the problem of misinformation has only worsened since 2020 and without a more concerted push to counteract it, even more voters could lose faith in the integrity of elections.",
    "In fact, one of the few specific allegations of vote fraud cited in the film concerns a North Carolina Republican operative who was facing ballot-tampering and obstruction-of-justice charges when he died last month.",
    "John Fund, a prominent conservative journalist who was once a booster of Ms. Engelbrecht, has implored donors to shun her, according to videotape provided to The New York Times by Documented, a nonprofit news site.",
    "The primary matchup between Mr. Nadler and Ms. Maloney may be one of the most bruising political spectacles in living memory, a crosstown clash between two respected party elders in the twilight of their careers.",
    "Working with a well-funded network of organizations on the right, including the Republican National Committee, she is recruiting election conspiracists into an organized cavalry of activists monitoring elections.",
    "Ahead of last years governors race between Glenn Youngkin, a Republican businessman, and Terry McAuliffe, a Democratic former governor, she helped a Virginia nonprofit organize dozens of groups into a coalition.",
    "She has worked closely with Virginia Thomas, the wife of the Supreme Court justice Clarence Thomas, on organizing through the Council for National Policy, a national coordinating group for conservative leaders.",
    "In an interview, she cited her success in securing money to build a Second Avenue subway line, the fight for a national womens history museum in Washington and her recent appearance on a Russian sanctions list.",
    "And yet neither Mr. Nadler nor Ms. Maloney has wasted any time working the phones to pressure union leaders, old political allies and wealthy donors  many of whom the two have shared for years  to pick sides.",
    "Soon after the 2020 election, with its funding faltering in recent years, True the Vote got a windfall $2.5 million donation from Fred Eshelman, a Texas entrepreneur seeking evidence to overturn the election.",
    "In seminars around the country, Ms. Mitchell is marshaling volunteers to stake out election offices, file information requests, monitor voting, work at polling places and keep detailed records of their work.",
    "An extensive review of Ms. Mitchells effort, including documents and social media posts, interviews and attendance at the Harrisburg seminar, reveals a loose network of influential groups and fringe figures.",
    "While the establishment is eager to take advantage of the bases energy and outrage over 2020, some are wary of being associated with  or held accountable for  some of the more extreme people in the movement.",
    "The officer would track down viral misinformation posts on Facebook, Instagram, Twitter and YouTube, and look for emerging narratives and memes, especially on fringe social media platforms and the dark web.",
    "Political analysts are warning that the outcome may depend on who casts ballots in a primary in late August, when many residents of the Upper East and West Sides decamp to the Hamptons or the Hudson Valley.",
    "In conversations across Manhattan, the prospect elicited a series of sighs from Democratic voters like Joy Schulman, an Upper West Side resident who said she had long-lasting admiration for both candidates.",
    "The effort, called the Election Integrity Network, is a project of the Conservative Partnership Institute, a right-wing think tank with close ties and financial backing from Mr. Trumps political operation.",
    "The mounting losses have emboldened Mr. Trumps rivals inside the party to an extent not seen since early 2016 and increased the chances that, should he run again in 2024, he would face serious competition.",
    "Rivals, including his own former vice president, Mike Pence, are gearing up for potential presidential runs, as he and others visit key early states like Iowa and ramp up their own fund-raising operations.",
    "They include election deniers as well as mainstream organizations such as the Heritage Foundations political affiliate, Tea Party Patriots and the R.N.C., which has participated in Ms. Mitchells seminars.",
    "On Election Day, Republican poll watchers in 13 polling places were observed being disruptive, hovering too closely or taking photographs, according to reports that elections workers filed to the county.",
    "Yet on a recent evening at his Mar-a-Lago resort, there was Mr. Trump showcasing his latest election conspiracy theory, one he has been advancing for months at rallies for his favored midterm candidates.",
    "As he sat in the shade of Riverside Park on a sparkling recent weekday morning in Manhattan, Representative Jerrold Nadler tried to make sense of how two powerful allies suddenly found themselves at war.",
    "Californias office of the secretary of state is searching for misinformation and working with the Department of Homeland Security and academics to look for patterns of misinformation across the internet.",
    "Last year, after True the Vote circulated its research in Georgia, the Georgia Bureau of Investigation said the cell data turned over, which tracked people to within 100 feet, was insufficient to act on.",
    "Its really, really hard to assign even what side of the street youre on when youre using this kind of data, said Paul Schmitt, a research scientist and professor at the University of Southern California.",
    "Even some Trump allies, like the right-wing media host Stephen K. Bannon, speak for a swath of one-time Trump voters when they condemn the coronavirus vaccines that Mr. Trump championed while president.",
    "Reached by telephone, Gary Greengrass, whose grandfather founded the Amsterdam Avenue mainstay in 1908, said that he could not remember seeing Ms. Maloney there but that Mr. Nadler was a frequent diner.",
    "After the 2020 election, Donald J. Trump and his allies cycled through a raft of explanations for what they claimed was the fraud that stole his rightful re-election as president, all of them debunked.",
    "Yes, it was a little bit more annoying, but I think at the end of the day its worth it so these people can see the process and feel comfortable and know that its a safe, secure process, Mr. Piper said.",
    "Sarah Huckabee Sanders in Arkansas virtually cleared the field for governor with his support, and Representative Ted Budd in North Carolina defeated a past governor to win his partys Senate nomination.",
    "Yet the difficult primary season has added to Mr. Trumps personal anxieties about his standing, after he has sought to fashion himself as something of an old-school party boss in his post-presidency.",
    "Mr. Cotton has also drawn a contrast with Mr. Trump from the right, vocally criticizing the First Step Act  a criminal justice reform bill that the former president signed into law  as a liberal law.",
    "True the Vote focuses on Democrats, but in 2019 the head of the National Republican Congressional Committee vowed to be more aggressive in its use of the same practice of collecting mail-in ballots.",
    "Numerous Republican candidates have embraced former President Donald J. Trumps falsehoods about the 2020 election, campaigning  often successfully  on the untrue claim that it was stolen from him.",
    "Oregon, Idaho and Arizona have education and ad campaigns on the internet, TV, radio and billboards meant to spread accurate information about polling times, voter eligibility and absentee voting.",
    "Mr. Nadlers associates circulated old news articles about Ms. Maloneys obsession with pandas, and suggested that Speaker Nancy Pelosi, who is officially neutral in the race, really preferred him.",
    "Any humor, though, appears to be lost on many New Yorkers, who see the choice between the two as an inevitable lose-lose, forced on them without much explanation by a state court five hours away.",
    "Two former top Trump administration officials, Mr. Pompeo and Nikki Haley, the former United Nations ambassador, are making endorsements, traveling and building up their political infrastructure.",
    "Donald J. Trump had cast this years primaries as a moment to measure his power, endorsing candidates by the dozen as he sought to maintain an imprint on his party unlike any other past president.",
    "A favorite of evangelical voters, he has sought to highlight his support for ending abortion rights as the Supreme Court prepares for a possible decision undoing the landmark Roe v. Wade ruling.",
    "Virginians for America First, the coalition member that promotes hand-counting ballots, began posting reports online purporting to show potential problems with absentee ballots and other issues.",
    "In a hotel conference center outside Harrisburg, Pa., Cleta Mitchell, one of the key figures in a failed scheme to overturn Donald J. Trumps defeat, was leading a seminar on election integrity.",
    "And Republicans have in the past boasted of plans to build an army of observers, raising fears about widespread voter intimidation and conflict at the polls that largely have not materialized.",
    "President Trumps political operation continues to dominate American politics, raising more money and driving more victories than any other political organization  bar none, Mr. Budowich said.",
    "They claim to have isolated 107 unique devices that made 20 or more visits to drop boxes and multiple visits to nongovernmental organizations that were involved in get out the vote efforts.",
    "On May 7, the Connecticut legislature approved $2 million for internet, TV, mail and radio education campaigns on the election process, and to hire an election information security officer.",
    "Ms. Engelbrecht, the founder of True the Vote, a group that has spent years warning of the dangers of voter fraud, has criticized the earlier narratives of the 2020 election as unhelpful.",
    "In an ABC/Ipsos poll from January, only 20 percent of respondents said they were very confident in the integrity of the election system and 39 percent said they felt somewhat confident.",
    "Ms. Raffle, as well as an organizer from Heritage Action, would be joining a new coalition of election activists led by Toni Shuppe, a fast-rising state activist, organizers announced.",
    "In more than five years  from when he became president in January 2017 until May 2022  Mr. Trump had only ever seen voters reject a half-dozen of his choices in Republican primaries.",
    "The basic pitch is that an army of left-wing operatives stuffed drop boxes with absentee ballots  a new spin on an old allegation that voter-fraud activists call ballot trafficking.",
    "Senator Tom Cotton of Arkansas, a Republican who has been a hawk on immigration and China since before the Trump presidency, has positioned himself as a potential heir to Trumpism.",
    "Asked if she had a favorite West Side retreat, Ms. Maloney mentioned street corner booksellers (Its sort of European), the cultural institutions and the passion for social action.",
    "Ms. Maloney had to work harder for hers, upsetting a long-serving liberal Republican, Bill Green, to win the East Side seat once held by Mayors John V. Lindsay and Edward I. Koch.",
    "Ms. Griswold, who is up for re-election this fall, has received threats for upholding 2020 election results and refuting Mr. Trumps false claims of fraudulent voting in the state.",
    "Much of Ms. Shuppes plan is laid out in The Citizens Guide to Building an Election Integrity Infrastructure, a 19-page manual Ms. Mitchell has distributed at trainings and online.",
    "They advise each group to enlist tech-savvy volunteers who, they suggest, can become expert on the specific software and equipment in each county and what the vulnerabilities are.",
    "In at least one case, according to the reports, a voter who spoke Spanish left without voting after what two poll workers believed was intimidation from a Republican poll watcher.",
    "The manual advises activists to be ever-present inside elections offices, and to meet with post office officials to observe every step of the vote-by-mail process allowed by law.",
    "Sixty to 70 percent of the content is educational, it is observation, its transparency, said Ms. Patrick, who now is a senior adviser to the elections program at Democracy Fund.",
    "They recommend aggressively crowdsourcing the accuracy of the voter rolls by collecting affidavits from residents and mailing letters to try to identify potential bad addresses.",
    "On Twitter, users spread a false post that a tractor-trailer carrying ballots had crashed on Interstate 95, sending thousands of voter slips into the air and across the highway.",
    "Ron DeSantis of Florida has amassed a $100 million re-election war chest and is the talk of many donors, activists and voters interested in the future of Trumpism without Trump.",
    "A number of researchers have said that while cellphone data is fairly precise, it cannot determine if someone is depositing ballots in a drop box or just passing by the area.",
    "Activists also were advised to research the backgrounds of election officials, key staff members, and even people inside attorney general offices who work on election issues.",
    "In Michigan, Ms. Mitchells group held a training session in May that was sponsored in part by a coalition of grass-roots groups called the Michigan Election Protection Team.",
    "Ms. Mitchell, in a text, said that her legal team spent years doing all the heavy lifting, but was fired after issuing a public statement, which had been standard practice.",
    "We have to have situational awareness by looking into all the incoming threats to the integrity of elections, said Scott Bates, Connecticuts deputy secretary of the state.",
    "He recalled telling Ms. Maloney in a private conversation on the House floor in Washington a few days earlier that he would win, suggesting she run for a neighboring seat.",
    "We are taking the lessons we learned in 2020 and we are going forward to make sure they never happen again, Ms. Mitchell told the crowd of about 150 activists-in-training.",
    "In a statement emailed later, she said: The American election system envisions citizen engagement and we are training people to assume the roles outlined in the statutes.",
    "Mr. Pence, whom Mr. Trump publicly condemned as rioters swarmed the Capitol during the certification of the 2020 Electoral College vote, has made travels to early states.",
    "Vance in Ohio), losers (Jody Hice in Georgia, Janice McGeachin in Idaho and Charles Herbster in Nebraska) and those headed for a recount (Dr. Mehmet Oz in Pennsylvania).",
    "In Georgia, Brad Raffensperger, a Republican who certified President Bidens win in the state, has faced fierce criticism laced with false claims about the 2020 election.",
    "But in order to maintain that trust, they must make clear that they are not engaging in any kind of censorship or surveillance that would raise constitutional concerns.",
    "Theres a deli over there; its called Grassroots, Ms. Maloney said tentatively, only to be quickly interrupted by an aide reminding her that she meant Barney Greengrass.",
    "In Virginia, for example, Ms. Mitchell helped a nonprofit organize a coalition that includes Virginians for America First, a group advocating for hand-counting ballots.",
    "In an interview, she backtracked, but when asked to provide evidence of improper votes, she only pointed to previous accusations unrelated to the 2020 general election.",
    "An elaborate and shadowy film set, with giant screens and flashing lights, was built to show Ms. Engelbrecht and Mr. Phillips conducting their cellphone-data analysis.",
    "I would not give her a penny, Mr. Fund said at a meeting of members of the Council for National Policy, a secretive group of right-wing leaders, in the summer of 2020.",
    "I think a non-Trump with an organized campaign would have a chance, said Jack Kingston, a former Georgia congressman who advised the first Trump presidential campaign.",
    "An analysis by The New York Times shows that his average daily online contributions have declined every month for the last seven months that federal data is available.",
    "The same report says the group purchased 25 terabytes of cellphone signal data emitted by devices in the Milwaukee area in a two-week period before the 2020 election.",
    "Earlier this year, she circulated a petition that declared citizens right to throw off such government that intends to keep the truth behind the 2020 election hidden.",
    "It is also clear that the level of potential fraud is significant enough to affect the outcome of these elections, said one memo, dated five days before the election.",
    "But Mr. Konopasek, the former registrar in Fairfax County, resigned in March in large part because of how difficult Ms. Brim and others were making his job, he said.",
    "works with other groups who have an interest in promoting election integrity, but the partys efforts are independent from any outside organization, Ms. Vaughn said.",
    "She was on the phone with Mr. Trump when he asked Brad Raffensperger, Georgias secretary of state, to find 11,780 votes that could reverse Mr. Trumps defeat there.",
    "(Mr. Phillips said such footage exists, but Mr. DSouza said it wasnt included because its not easy to tell from the images themselves that it is the same person.)",
    "They are embroiled in litigation with True the Votes largest donor, and Ms. Engelbrecht has feuded with Cleta Mitchell, a leading Trump ally and elections lawyer.",
    "Those close to Mr. Trump  and even Republicans who arent  caution against misreading the significance of primary losses in which he himself was not on the ballot.",
    "Yet if the primaries in May showed the bounds of Mr. Trumps personal influence, they also made clear that his election-denialism movement has permeated the party.",
    "We had a great four years with him: The economy was great, jobs were great, everything was great, said Belinda Fickes, 49, a cafeteria manager outside of Atlanta.",
    "The resounding message from the Republican voters in Georgia is: Quit talking about 2020, Senator Mitch McConnell, the Republican minority leader, told Politico.",
    "True the Votes eventual focus on ballot trafficking was inspired by an Arizona investigation into ballot collection in the 2020 primary that led to indictments.",
    "Mr. DSouza emailed The New York Times a citation to a federal statute that outlaws getting paid to vote  and does not discuss delivering other peoples ballots.",
    "Hillary Clinton carried it by fewer than 8,000 votes in 2016; President Biden won it by more than 55,000 votes, far more than his winning margin in the state.",
    "Mr. Nadler named the Metropolitan Museum as his favorite East Side institution: Ever since I saw The Ten Commandments as a kid, Ive been interested in Egypt.",
    "The West Side votes heavily, thats to our advantage, said Gale Brewer, a former Manhattan borough president who now represents the area on the City Council.",
    "It might have helped to have the most skeptical people closely engaged, said Christopher Piper, who until recently ran the Virginia Department of Elections.",
    "The network ultimately trained 4,500 poll watchers and election workers and organized 18 local task forces, a number that has since doubled, organizers say.",
    "Some former election officials say they are hopeful that when election skeptics observe the process they may finally be convinced that the system is sound.",
    "Mr. Trumps defeat was undisputed among election officials and certified by Democrats and Republicans, with many recounts and audits verifying the outcome.",
    "We are trying to bridge the gap between the grass-roots and some of the issues weve had with the party, she told trainees at the event outside Harrisburg.",
    "After meeting with Mr. Phillips and Ms. Engelbrecht, Salem Media spent $1.5 million to make the film and $3 million to market it, according to Mr. DSouza.",
    "Mr. Phillips said he had received zero money from Get Georgia Right, which backed Mr. Trumps favored and failed governor-primary candidate, David Perdue.",
    "The swing states where Ms. Phillips and Ms. Engelbrecht focused their research do ban the delivery of ballots on behalf of others, with some exceptions.",
    "Ms. Maloney enters the contest with an apparent, if slight, demographic edge: She already represents about 60 percent of the voters in the new district.",
    "One concern is the groups intent to research the backgrounds of local and state officials to determine whether each is a friend or foe of the movement.",
    "Asked about a personal relationship, Ms. Engelbrecht said, You know, Gregg and I have actually talked about this and how we would answer this question.",
    "Taylor Budowich, a Trump spokesman, said the undeniable reality is that Republicans rely on Mr. Trump to fuel Republican victories in 2022 and beyond.",
    "Christine Brim, the task forces leader, appeared in person or emailed staff nearly every day, according to Scott Konopasek, the registrar at the time.",
    "On an island known for Democratic infighting, Mr. Nadler, 74, and Ms. Maloney, 76, have managed to coexist more or less peacefully for three decades.",
    "It added that while the group had said it had a source who could validate such findings, despite repeated requests that source has not been provided.",
    "A report created by the group includes an appendix that claims to list IMEI numbers of the tracked devices  15-digit codes unique to each cellphone.",
    "Some Republican strategists have fixated on the fact that so many of Mr. Trumps endorsees have landed about one-third of the vote  big winners (J.D.",
    "Theyre advised to keep careful records, including details on any encounter that is intended to make you uncomfortable being at the election offices.",
    "The new board member, Christopher Henzel, told The Times he would promote transparency to ensure that elections are both fair and perceived as fair.",
    "Campaigns, parties and outside groups from both sides of the political spectrum regularly form poll-monitoring operations and recruit poll workers.",
    "Many are run by activists with little experience in politics or elections but who have amassed sizable membership lists and social media followers.",
    "Ms. Mitchell, the elections lawyer and leading vote-fraud activist in her own right, was sitting next to Mr. Fund and nodding through his comments.",
    "The team is composed of three election security experts who monitor the internet for misinformation and then report it to federal law enforcement.",
    "We are seeing a threat atmosphere unlike anything this country has seen before, said Jena Griswold, the Democratic secretary of state of Colorado.",
    "Mr. Nadler was a precocious young lawyer who started a group of self-styled reformers, the West Side Kids, and won a State Assembly seat in 1976.",
    "Those claims are purportedly backed up by tracking cellphone data, but the films methods of analysis have been pilloried in numerous fact-checks.",
    "Senator Tim Scott of South Carolina recently announced another trip to Iowa and has been investing heavily in his digital fund-raising operation.",
    "Rebuking Trump: The ex-president picked losers up and down the ballot in Georgia, raising questions about the firmness of his grip on the G.O.P.",
    "Now, Ms. Shuppe is recruiting election activists, using what she learned at Ms. Mitchells and other training sessions, she said in an interview.",
    "But several who examined Ms. Mitchells training materials and statements at the request of The New York Times sounded alarms about her tactics.",
    "Some conservatives and civil rights groups are almost certain to complain that the efforts to limit misinformation could restrict free speech.",
    "Attempts to broker a peace settlement were made, but Mr. Nadler, over a chilled Diet Coke, acknowledged that they were somewhat halfhearted.",
    "The spread narrows among Democratic primary voters, according to data complied by the Center for Urban Research at the CUNY Graduate Center.",
    "This year, its multimillion-dollar investment includes hiring 18 state election integrity directors and 19 state election integrity lawyers.",
    "If theres an absence of good will theres nothing you can say thats going to reassure someone or win them over or change their mind, he said.",
    "She enlisted John Eastman, the lawyer who crafted specious legal theories claiming Vice President Mike Pence could keep Mr. Trump in power.",
    "But elections officers in 16 other states surveyed by The Times said their states did not prohibit people getting paid to deliver a ballot.",
    "Mr. Trump and his allies hope 2000 Mules, now playing at several hundred theaters, will win over doubters among establishment Republicans.",
    "Voters are clearly going to vote for me because I lost weight, quipped Mr. Nadler after a man came over to compliment his slimmer profile.",
    "Officials said they would prefer candidates fluent in both English and Spanish, to address the spread of misinformation in both languages.",
    "But their long truce came to a shattering end last week, when a state court imposed a significant revision on New Yorks congressional map.",
    "Ms. Mitchell says she is creating a volunteer army of citizens who can counter what she describes as Democratic bias in election offices.",
    "The group was funded by Patrick Byrne, the former Overstock.com executive who is now a major benefactor of the election denial movement.",
    "Governors Race: Brian Kemp scored a landslide victory over David Perdue, delivering Mr. Trump his biggest setback of the 2022 primaries.",
    "2018 Rematch: Stacey Abrams, the Democratic nominee for governor, will again face Mr. Kemp  but in a vastly different political climate.",
    "Both candidates played down differences between their sides of Manhattan, pointing to common interests and shared cultural institutions.",
    "She was the first Council member to give birth while in office and the first to introduce legislation giving rights to same-sex couples.",
    "Mr. Nadler leads the Judiciary Committee, a role that earned him national attention during President Donald J. Trumps two impeachments.",
    "We know we cant boil the ocean, but we have to figure out where the threat is coming from, and before it metastasizes, Mr. Bates said.",
    "What has not been provided is any other kind of evidence that ties these cellphones to ballot harvesting, the bureau said in a letter.",
    "Yet the sense among Republicans that Mr. Trump has lost political altitude is taking hold, including among some of those close to him.",
    "The vocal opposition is no longer just confined to anti-Trump forces inside the party but is also evident in the pro-Trump mainstream.",
    "The state director, Andrea Raffle, had worked alongside Ms. Mitchell for months on the event, one of the speakers told the attendees.",
    "The operation ate up county workers time with dozens of information requests, as well as informal interrogations, Mr. Konopasek said.",
    "Ms. Vaughn acknowledged that party officials participate in events hosted by other groups to recruit poll workers and poll watchers.",
    "If you are satisfied with the state of New York, the country or the Democratic Party, they are your candidates, Mr. Patel, 38, said.",
    "chairman, said the activists were merely trying to get answers, particularly because the state had initiated new voting procedures.",
    "But throughout the document, theres this pitting of people against the election official or the people theyre there to learn from.",
    "Ms. Mitchell said election officials should have no problem with citizens asking questions and helping them do their jobs better.",
    "Harnessing the Energy\nSince 2020, scores of local groups have popped up around the country to promote claims about the election.",
    "Asked about her project at the Pennsylvania training, Ms. Mitchell declined an interview request and asked a reporter to leave.",
    "The moves by these states, most of them under Democratic control, come as voter confidence in election integrity has plummeted.",
    "It looks only for election-related misinformation on issues like absentee voting, polling locations and eligibility, she said.",
    "Mr. Nadler inherited his safely Democratic West Side seat when the incumbent died of a heart attack on the eve of the primary.",
    "Ms. Maloney is the chair of the Oversight and Reform Committee, which most recently oversaw an overhaul of the Postal Service.",
    "Everything they saw that they didnt understand was fraud in their minds and thats how they would frame the questions, he said.",
    "The critical question, as he put it, is whether Republican voters are in a lets give him the gold watch and lets move on mood.",
    "The document includes some typical guidelines for poll monitors, but elections experts also noted tactics that arent routine.",
    "The new lines have roiled Democrats across the state, but perhaps nowhere has the change been more disruptive than Manhattan.",
    "Other secretaries of state, who head the office typically charged with overseeing elections, have received similar pushback.",
    "A Test Run in Virginia\nMs. Mitchell has repeatedly held up Virginia, and particularly Fairfax County, as the national model.",
    "And until Trump either bows out of electoral politics, or is beaten by a Republican at the ballot box, his strength remains.",
    "The claim that Mr. Trump lost the election because of improper conduct in election offices or rampant voter fraud is false.",
    "Misinformation can erode peoples confidence in elections, and we view that as a critical threat to the democratic process.",
    "Ms. Shuppes group, Audit the Vote PA, has become a leading peddler of misleading data about the election in Pennsylvania.",
    "Courts rejected the cases and election officials were unconvinced, thwarting a stunning assault on the transfer of power.",
    "Mr. Kemp, for instance, took pains not to say a cross word about the former president to avoid alienating his loyal base.",
    "A repeated contention of the documentary is that getting paid to deliver other peoples ballots is illegal in every state.",
    "The party has so far recruited more than 5,000 poll watchers and nearly 12,000 poll workers, according to the committee.",
    "The Gateway Pundit, a right-wing website, reported on the complaint saying the state of Virginia is being stolen again.",
    "Were going to take back our elections, she said in an April interview with John Fredericks, a conservative radio host.",
    "Its a position popular among some of those who believe conspiracy theories about foreign hacking in the 2020 election.",
    "All a person has to do is tell Carolyn Maloney, no, she cant do it, and she will prove them wrong, Ms. Seawright said.",
    "But there has been a less visible sign of slippage: Mr. Trumps vaunted digital fund-raising machine has begun to slow.",
    "For now, predictions about which candidate will win appear to correlate with proximity to the Hudson and East Rivers.",
    "Ms. Maloney is from Greensboro, N.C. Mr. Nadler, the son of a onetime chicken farmer, was mostly raised in Brooklyn.",
    "Connecticut joins a handful of states preparing to fight an onslaught of rumors and lies about this years elections.",
    "But by the end of this month, that figure had more than doubled, with his biggest defeat coming on Tuesday when Gov.",
    "Whats more, the film claims, but never shows in its footage, that individual mules stuffed drop box after drop box.",
    "They put a new Republican on the election board, someone Ms. Brim, the groups leader, describes as a real activist.",
    "They should not be able to act like Detective Chief Inspector Barnaby ferreting out clues, that poll worker wrote.",
    "What they were putting out there was a lot of misinformation that just wasnt true, she said in a recent interview.",
    "The group has not presented any evidence that the ballots themselves  as opposed to their delivery  were improper.",
    "The case led state elections officials to order the first redo of a federal election because of fraud allegations.",
    "very much remains Trumps party, even as he saw a distinction developing between Trumpism and Donald Trump himself.",
    "One-third of the party is at once an unmatched base of unbending loyalists  and yet a cohort far from a majority.",
    "Ahead of the 2020 elections, Connecticut confronted a bevy of falsehoods about voting that swirled around online.",
    "Just know that we have a plan, she wrote the day after the Harrisburg seminar to her 15,000 Telegram subscribers.",
    "If theyre being obstructionary and slowing down the process, thats going to be incredibly challenging, she said.",
    "But for those who lived through the first one and remained pained by it for years, its history repeating itself.",
    "Ms. Maloney, a former teacher, was a top legislative aide in Albany before winning a City Council seat in 1982.",
    "To be the man, you have to beat the man, said Jim Hobart, a Republican pollster with Public Opinion Strategies.",
    "He has told advisers he wants to declare his candidacy or possibly launch an exploratory committee this summer.",
    "(Asked about the discrepancy, Mr. von Spakovsky said he believed the practice is illegal based on federal law.)",
    "No one ever forgot that, Harold Holzer, a historian and former aide to Ms. Abzug, said of the primary contest.",
    "Mr. Nadler and Ms. Maloney are among the Houses most progressive members and both lead prestigious committees.",
    "Yet a close look at the documentary shows that it, too, is based on arguments that fall apart under scrutiny.",
    "Ms. Engelbrecht said that Ms. Mitchell has been on a rampage against me since she fired Ms. Mitchell in 2017.",
    "Mr. Trump remains broadly popular among Republicans and has a political war chest well north of $100 million.",
    "Most of Mr. Trumps advisers believe he should wait until after the midterm elections to announce a candidacy.",
    "And the best answer that I think either of us are going to give is, it is totally unrelated and unimportant.",
    "A judge ruled that the group did not have standing, which did not settle the legal question  or the dispute.",
    "Ms. Mitchell is no doubt connecting with some of the fringe groups and ideas some in the party once avoided.",
    "She has represented the National Rifle Association and was on the board of the American Conservative Union.",
    "There is this temptation to engage in wish-casting in which, This is the moment in which Trump is slipping!",
    "The Republican National Committees involvement is part of a return to widespread election-work organizing.",
    "Many officials already feel under attack by those who falsely contend that the 2020 election was stolen.",
    "sent both its national and state election integrity directors to Ms. Mitchells training near Harrisburg.",
    "For example, there are no statements of witnesses and no names of any potential defendants to interview.",
    "I want to make very clear that were not suggesting that the ballots that were cast were illegal ballots.",
    "Mr. Trump still remains the most coveted endorsement in his party, and he has boosted some big winners.",
    "For all their superficial differences, Mr. Nadler and Ms. Maloney have had broadly similar career arcs.",
    "Facts still exist and lies are being used to chip away at our fundamental freedoms, Ms. Griswold said.",
    "Ms. Mitchell has described herself as a key conduit between activists and Republican Party leadership.",
    "We needed a fighter, she said, as she recounted her work for the activists at the Harrisburg training.",
    "She lives in Cobb County, a suburban area that swung sharply away from Republicans in the Trump years.",
    "Some of those states limit how many ballots an individual can deliver, or bar campaigns from doing so.",
    "The R.N.C.s state election integrity director brought together the coalition to recruit poll workers.",
    "(True the Vote declined to offer tangible proof  Mr. Phillips calls his methodology a trade secret.)",
    "But each entry on the list is a 20-character string of numbers and letters followed by a lot of xs.",
    "Notably, Mr. Trumps share of what is raised overall among all Republicans online has also declined.",
    "Mr. Trumps political action committee, Save America PAC, donated $1 million to the group last year.",
    "Poll workers in other locations noted Republican poll watchers acting like, as one put it, sleuths.",
    "activists continued to press Mr. Konopasek and other election workers about it, he and others said.",
    "She said basically the opposite, and so it was an impasse, Mr. Nadler said, and we left it at that.",
    "Once a liberal Democrat in Oklahoma, Ms. Mitchell has been a fixture in the conservative movement.",
    "One, widely viewed on Facebook, wrongly said that absentee ballots had been sent to dead people.",
    "Mr. Phillips and Ms. Engelbrecht have become controversial even within the hard-right firmament.",
    "As True the Votes funding faltered in recent years, it found new adversaries among old friends.",
    "But he continues to pad a $23.4 million campaign treasury despite facing only token opposition.",
    "The question they should pose about the attorney general officials is, Is that a friend or foe?",
    "Connecticut officials said the states goal was to patrol the internet for election falsehoods.",
    "But reaching for the name of a restaurant beloved by generations of New Yorkers, she fumbled.",
    "Despite some concerns about these groups involvement, the 2021 election overall ran smoothly.",
    "Some of that decrease is the result of other candidates on the ballot raising more this year.",
    "Brian Kemp of Georgia thrashed a Trump-backed challenger by more than 50 percentage points.",
    "Ms. Shuppe has admitted to flaws in her data but stands by the conclusions of her analysis.",
    "A movement is stirring, Ms. Mitchell wrote to Mr. Eastman just two days after Election Day.",
    "These efforts are separate from the Election Integrity Network, said Emma Vaughn, an R.N.C.",
    "Instead Im going to be hosting events and plotting and scheming to defeat a friend of mine.",
    "Ms. Griswold will oversee the team, called the Rapid Response Election Security Cyber Unit.",
    "Colorado is redeploying a misinformation team that the state created for the 2020 election.",
    "He came within four percentage points of beating Ms. Maloney in the primary two years ago.",
    "We Needed a Fighter\nAfter the election, the party activists continued to press for change.",
    "Mr. Scott has more than 1,000 times as much as his closest rival, a Democrat with $23,199.",
    "He stopped to engage Ms. Maloney in a conversation about the impending abortion decision.",
    "Checking for telltale bamboo fibers that might prove ballots had been flown in from Asia.",
    "They built parallel political machines and accumulated important committee chairmanships.",
    "voters rejected Donald Trumps 2020 fixation, and Democrats backed a gun-control champion.",
    "Rooting for you, said one smartly dressed middle-age man, who identified himself as Hal.",
    "The difference is not whether you are male or female, its your effectiveness, she said.",
    "(Election workers at three sites had similar complaints about Democratic poll monitors.",
    "They are spurred on by national figures touring the circuit and spreading false claims.",
    "The 71-year-old lawyer has been a steady and influential force in the voting battles.",
    "litigation had been a great fund-raising vehicle for Ms. Mitchell and her associates.",
    "But election officials would often dodge their questions or brush them off, he said.",
    "The May 24 races were among the most consequential so far of the 2022 midterm cycle.",
    "Colorado has hired three cybersecurity experts to monitor sites for misinformation.",
    "What were saying is that the process was abused, Ms. Engelbrecht said in Wisconsin.",
    "She added of Mr. Nadler, whom she is backing: Hes got a brain that is frightening.",
    "Mr. Nadler, the citys only remaining Jewish congressman, was even more direct: No.",
    "Problem is that Catherine hates it if anyone else deals with reporters, she said.",
    "is training its monitors to comply with laws protecting voting rights, she said.",
    "Id say its sad, Ms. Maloney said in an interview near her Upper East Side home.",
    "And make the fall election about the future and about the Biden administration.",
    "In interviews with Republican voters at Kemp events, few had become anti-Trump.",
    "But the effort sputtered and Mr. Eshelman sued, claiming he had been swindled.",
    "Still, Mr. Greengrass said he planned to stay like Switzerland in the contest.",
    "Mr. Nadler plans to pitch himself to voters as a more principled progressive.",
    "His premise is that it is time to give a younger generation a chance to lead.",
    "They arrived in Congress within two months of each other in the early 1990s.",
    "She noted that in many states poll monitors must be authorized by the party.",
    "In August 2020, Mr. Trump tapped her to prepare for postelection litigation.",
    "But True the Votes efforts have prompted little action from law enforcement.",
    "Three other Trump recruits challenging Kemp allies also went down to defeat.",
    "But Ms. Fickes, who voted twice for Mr. Trump, is looking elsewhere in 2024.",
    "(Mr. Nadler, by contrast, has not had a close election in nearly 50 years.)",
    "Ms. Mitchell once represented Ms. Engelbrecht in a dispute with the I.R.S.",
    "Mr. Phillips and Ms. Engelbrechts case is largely built on cellphone data.",
    "election integrity directors have been involved in Ms. Mitchells events.",
    "Hes so polarizing, Ms. Fickes said of Mr. Trump, and thats the problem.",
    "The feeling is mutual among activists, many of whom believe the R.N.C.",
    "She noted the activists are instructed to be courteous and respectful.",
    "They also said that they fear for the safety of some election workers.",
    "Complaints from 10 sites did not specify the poll watchers parties.)",
    "Mr. Trumps Justice Department found no evidence of widespread fraud.",
    "Mr. Trump lost more than 50 of his postelection challenges in court.",
    "Ms. Mitchell helped the president argue his case to state officials.",
    "Mr. Phillips said new IDs had been created to obfuscate the numbers.",
    "I wanted to win the case and move on and not be a cottage industry.",
    "In his 30-year career, he said, he had never seen anything like it.",
    "Mr. Scott has said that this will be his last term in the Senate.",
    "Allies of Ms. Maloney whispered doubts about Mr. Nadlers health.",
    "In every job Ive held, Ive been the first woman ever to hold it.",
    "Both came up through local New York City politics in the 1970s.",
    "He drew a bright red line  and voters just stampeded across it.",
    "Ms. Mitchells operation sits at a tension point for her party.",
    "Maybe this will be more heartbreaking than it is infuriating.",
    "He lost an initial round in Texas court and is now appealing.",
    "On the other hand, what happened in Georgia was significant.",
    "over allegations that it was targeting conservative groups.",
    "said Charlie Sykes, a conservative anti-Trump commentator.",
    "We saw it in the 2020 election and we are seeing it again.",
    "Their film, she maintains, offers a more-serious theory.",
    "What a shame that it would end up this way, she said.",
    "People want to believe the conspiracies in some ways.",
    "But they clearly have work to do to convince voters.",
    "So far, around 200 people have signed up, she said.",
    "Now Ms. Mitchell is prepping for the next election.",
    "She would be putting you to work, she told them.",
    "The committee was freed of restrictions in 2018.",
    "Ive never been more effective, Ms. Maloney said.",
    "A third Democrat, Suraj Patel, is also running.",
    "did not do enough to back Mr. Trumps challenge.",
    "Ms. Mitchell stepped in to harness that energy.",
    "The only way they win is to cheat, she added.",
    "Both have strongly rebuffed pleas to retire.",
    "Youve gone a million times, the aide said.",
    "It wasnt intended to be that way, he said.",
    "Shes a good person whos been led astray.",
    "Steve Knotts, the Fairfax County G.O.P.",
    "Nick Corasaniti contributed reporting.",
    "Votes switched by Venezuelan software.",
    "Voting machines hacked by the Chinese.",
    "Neither lawmaker grew up in Manhattan.",
    "Its true, she said after he finished.",
    "Rachel Shorey contributed reporting.",
    "(His aides say his health is good.)",
    "But in multiple states, the R.N.C.",
    "But needs constitutional support.",
    "And 2020 still needs decertified.",
    "Mr. Sykes said the current G.O.P.",
    "There is no going back to sleep.",
    "Maybe it offended a few people.",
    "He won his primary last week.",
    "None of the claims are true.",
    "Heres what else we learned.",
    "Were going to be watching.",
    "It was always accusatory.",
    "Is That a Friend or Foe?",
    "But any reason will do.",
    "She believed the I.R.S.",
    "Its sad for the city.",
    "This must be fixed.",
    "Takeaways: G.O.P.",
    "Well never quit.",
    "PALM BEACH, Fla.",
    "spokeswoman.",
    "Its insane.",
    "Dont do it.",
    "The R.N.C.",
    "The R.N.C.",
    "The R.N.C.",
    "The G.O.P.",
    "it says.",
    "G.O.P.",
    "Gov.",
    "No.",
    "No.",
    "No.",
    "No.",
    "No."
  ]
}