{
  "id": 8706,
  "mediaId": 157,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Gun-worshiping MAGA 'cult' moves closer into GOP mainstream with Pennsylvania primary win: historian",
  "image": "https://www.rawstory.com/media-library/hyung-jin-sean-moon.jpg?id=27655592&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/rod-of-iron-ministries-2657419798/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    3102
  ],
  "sentences": [
    "State Sen. Doug Mastriano took part in the Jan. 6, 2021, \"Stop the Steal\" rally and went to the U.S. Capitol afterward, and his ideology can be summed up as Christian nationalism -- so it's not surprising that he has spoken at events hosted by the apocalyptic \"Rod of Iron Ministries\" founded by the Rev.",
    "\"Just as Moons church has developed a larger and larger platform through partnerships with bad actors, the cult of the AR-15 has insinuated itself in communities where traditional faith has been displaced by the miasma of Christian nationalism,\" he wrote.",
    "\"Rod of Iron might be the most explicit proponent of the cult, but those who see political opportunity in the business of fearmongering about gun rights have become its secret missionaries, bearing messages of salvation through implements of destruction.\"",
    "The church draws inspiration from QAnon conspiracy theories and Christian nationalism to go along with its fetishization of the AR-15 rifle, but Lecaque said their views are moving closer into the conservative mainstream.",
    "Sun Myung Moon, has forged ties to Mastriano and other far-right political figures, and high-ranking church leader Gregg Nall described their theology at a blessing ceremony for a new 40-acre compound in central Texas.",
    "\"The Book of Revelation  also known as the Apocalypse of John  is the final book of the Bible and the place where Moon came to his beliefs about the cosmic significance of the AR-15.",
    "\"American syncretic spirituality animates every part of Mastrianos public profile and political career,\" wrote Lecaque, an associate professor of history at Grand View University.",
    "We believe that the kingdom of heaven is a kingdom of armed citizens, so we believe that everyone in the kingdom should be armed, Nall said.",
    "\"Perhaps it should be no surprise that he associates with an extremist sect that places special emphasis on Americas most notorious gun.\"",
    "What he and other cultists should consider is that the apocalypse they desire might reveal a different deity than they expect.\"",
    "The Republican nominee for Pennsylvania governor has Donald Trump's backing and ties to a gun-worshiping religious sect.",
    "\"Like Moon and Mastriano, they desire an apocalypse, which is another word for revelation,\" Lecaque added.",
    "If you dont have a gun the predator comes in and ravishes you or us as a nation.",
    "If you have a gun in self-defense, the criminal or the predator will back off.",
    "Hyung Jin Sean Moon, wrote historian Thomas Lecaque for The Bulwark.",
    "Moon, the youngest son of Unification Church founder Rev.",
    "The gun really does represent strength.",
    "Peace through strength."
  ]
}