{
  "id": 8948,
  "mediaId": 441,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "Capitol Riot Apologists Go Unpunished as Memories of Horror Fade",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iX54tM8rh0Lo/v1/-1x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-06-05/capitol-riot-apologists-in-gop-go-unpunished-as-jan-6-memories-fade?srnd=premium-middle-east",
  "sentiment": "0",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Dorning",
  "authorUrl": "https://www.bloomberg.com/authors/APt1Xtz3Jhw/mike-dorning",
  "termIds": [
    3094,
    3102
  ],
  "sentences": [
    "Conflict over Jan. 6 and the election outcome often merges in populist conservative circles with grievances over Covid masking measures, suspicion of vaccines and division over the Black Lives Matter movements calls for racial justice, said Russell Moore, the former head of the Southern Baptist Conventions public policy arm and an early evangelical critic of Trump.",
    "The turning point is the people in the Republican party who know it is a lie and don't believe it  with the exception of a few people like Liz Cheney and Mitt Romney  for the most part acquiesce to it because they traded principles that they said they believed in for power, said Stuart Stevens, a long-time Republican strategist who opposed Trumps elections.",
    "It is an effort by the former president to overturn an election, to use multiple tools and sources of pressure to try to stay in office, to try to delay our counting of electoral votes -- ultimately, the violence we all lived through, Liz Cheney, who is vice chair of the committee investigating the insurrection, said during a hearing in April.",
    "Audio obtained by the New York Times documents House Republican leader Kevin McCarthy in the days after the attack complaining to fellow party leaders about Trumps atrocious conduct and weighing ways to remove him from office, including pushing him to resign or invoking the 25th amendments provisions to oust an incapacitated president.",
    "As Congress prepares for a series of televised hearings on the assault starting Thursday, polls show the Republican party is on track to make big gains in midterm elections despite fielding candidates who embrace the false narrative of election fraud that fueled the riot and shun efforts to investigate the attack.",
    "That is a political imperative if Democrats are to compete for votes in the midterm elections, especially among moderate independents likely to decide key races, said Democratic pollster Joel Benenson, who advised President Barack Obama on both his 2008 and 2012 campaigns and Hillary Clinton on her 2016 campaign.",
    "The deadly assault on the US Capitol on Jan. 6, 2021 shocked viewers watching live around the world and, at least in the moment, infuriated Republican congressional leaders who fulminated among themselves against the role Donald Trump and his allies played in egging on the rioters.",
    "Its a remarkable turnabout for an event documented in graphic video -- much of it taken by the celebratory participants themselves -- of broken glass, bloody fights with police and the emergency evacuation of the vice president from the ornate Senate chamber.",
    "In November, Tucker Carlson, one of the most prominent television voices on the right, aired the Patriot Purge documentary series on Fox News streaming service pushing debunked claims the assault was a false-flag operation set up to entrap Trump supporters.",
    "A hard core of Republicans have talked themselves into believing that the Democrats are so dangerous that almost any measures are justified to keep them out of office, H. W. Brands, a presidential historian at the University of Texas at Austin.",
    "President Joe Biden and his congressional allies have shifted to the crises at the top of voters priorities: the pandemic, supply-chain issues, rising inflation and more recently the Russian invasion of Ukraine.",
    "The price for that unity would be acquiescence to a continuing campaign to portray the 2020 election results as illegitimate and resistance to efforts to investigate the origins of the attack on the Capitol.",
    "But the short-lived horror over the worst attack on the seat of US democracy since British troops burned the building in 1814 wasnt enough to shake the tribal political divisions that drove the insurrection.",
    "Doug Mastriano, who won the partys nomination for Pennsylvania governor in a landslide, attended the rally that preceded the riot and has called for decertifying the states 2020 election results.",
    "Representative Ted Budd of North Carolina, who voted against certifying Bidens election, beat a well-known former governor for the Senate nomination by more than 30 percentage points.",
    "Anger in the GOP rank and file over false claims of a stolen election and a range of other cultural and economic grievances is stronger than any dismay over the attack on the Capitol.",
    "Instead, ambitious Republican politicians travel to Mar-a-Lago to compete for Trumps blessing while the two GOP members of Congress who joined the investigative panel are ostracized.",
    "The House panels upcoming hearings include prime-time televised testimony and may be the best remaining shot at making a case for broader accountability for the insurrection.",
    "But barely three weeks afterward, McCarthy was in Mar-a-Lago to stand beside a smiling Trump and declare the congressional leaders support for a united conservative movement.",
    "Half of Republicans said the left-wing group Antifa was mostly responsible for violence at the Capitol, a discredited theory advanced by some conservative commentators.",
    "Only two Republicans showed up at a Capitol event marking the riots one-year anniversary: Representative Liz Cheney and her father, former Vice President Dick Cheney.",
    "Representative Zoe Lofgren, a California Democrat who is on the committee, said she is not concerned about whether the hearings turn out to be a loser for Democrats.",
    "Explanations for the shift in attitudes range from the political re-alignment of the major parties, deep-seated cultural divisions to a newly balkanized news media.",
    "Less than a year after the attack, a poll showed more than half of Republican voters opposed continuing to identify and prosecute the people who carried it out.",
    "The narratives have been nurtured on the right by conservative news media and social media as Americans sources of information fragment along ideological lines.",
    "Three-quarters of Republicans without a college degree held that view, according to a January 2021 poll by the center-right American Enterprise Institute.",
    "I think the old George Orwell rule applies, said Moore, now public theologian at Christianity Today, an evangelical magazine founded by Billy Graham.",
    "That could prove a potentially devastating blow to Republicans who would then find their conservative base siphoned off to a competing party.",
    "One practical matter: Trump remained popular with Republican voters and was reported to be considering forming a breakaway Patriot Party.",
    "The fact that it wasnt a game-changing moment is pretty remarkable, Julian Zelizer, a Princeton University presidential historian, said.",
    "Much of that is driven by the highest inflation in 40 years, soaring gasoline prices and President Joe Bidens slumping approval ratings.",
    "But in some of the early primary races, candidates who dispute the presidential election outcome are winning Republican primaries.",
    "A Republican National Committee resolution earlier this year characterized the events on Jan. 6 as legitimate political discourse.",
    "Committee organizers will do it with little help from Republican colleagues whose early expressions of disgust quickly dissipated.",
    "Long gone are the days of news coverage by three common-denominator television networks and one or two mass-market local papers.",
    "I really think politically it's a dead issue for most voters, said Representative Guy Reschenthaler, a Pennsylvania Republican.",
    "Other candidates, including in key races in Georgia, were defeated by opponents who defended the vote counting in their state.",
    "Just after the riot, two-thirds of Republican voters said the presidential election results were marred by widespread fraud.",
    "The few Republicans politicians who criticized Trump and his allies immediately after the riot have mostly remained silent.",
    "And voters who already endured a second impeachment of Trump over the insurrection are preoccupied with other matters.",
    "Conservative Fox News now competes for viewers with harder-line cable networks such as Newsmax and One America News.",
    "Social media and the rising popularity of political podcasts are another channel for amplifying conspiracy theories.",
    "Shifting Blame\nDemocrats, meanwhile, are being urged to focus on more pressing concerns for voters.",
    "People tend to be able to justify any atrocities on their side or able to not hear about them.",
    "More than a hundred officers were injured and one participant was shot and killed by police.",
    "Trying to get the truth out in way that's coherent and understandable, Lofgren said.",
    "Congress plans televised hearings on the Capitol attack but voters have forgotten.",
    "That is not the dinner-table conversation anywhere in America, Benenson said.",
    "People are able to filter out news based on their partisan identities.",
    "And that's what I'm picking up when I'm back in the district.",
    "And the American people will have to take it from there.\"",
    "We live in a time of partisan conceptions of truth.",
    "Literally no one is talking to me about Jan. 6.",
    "Were a year and a half removed from the riot.",
    "There's immediate problems they're facing.",
    "Some have decided to retire from Congress.",
    "It is not just what happened on that day.",
    "You have a duty to stand up against that.",
    "Its historically pretty hard to believe.",
    "Theyve been rewarding election deniers.",
    "Those views have hardened with time.",
    "\"We're just trying to do our jobs.",
    "We're not bystanders.",
    "Kitchen table issues."
  ]
}