{
  "id": 8978,
  "mediaId": 129,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "High California gas prices are rattling Democrats who hoped to pick up House seats.",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/06/06/us/midterms-primary-elections",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3102
  ],
  "sentences": [
    "It grew out of meetings held by a conspiracy-mongering QAnon leader and a Nevada politician, and has quietly gained support from influential people in the election denier movement  including Mike Lindell, the MyPillow founder, and Patrick Byrne, the former Overstock.com executive who has financed public forums that promote the candidates and theories about election vulnerabilities.",
    "Key figures in the effort to subvert the 2020 presidential election have thrown their weight behind a slate of Republican candidates for secretary of state across the country, injecting specious theories about voting machines, foreign hacking and voter fraud into campaigns that will determine who controls elections in several battleground states.",
    "But some frustrated Democrats in states like Texas, Florida and Ohio sounded unconvinced as Republicans, who have controlled the House in 10 of the last 15 elections despite losing the popular vote in seven of them, seemed to fare better than Democrats at tilting political maps decisively in their direction in key states they controlled.",
    "His physician, Ramesh R. Chandra, released a scolding note saying that when Mr. Fetterman was diagnosed with atrial fibrillation and a decreased heart pump in 2017, he was prescribed medicine, lifestyle changes and follow-up appointments, but that he did not go to any doctor for five years and did not continue taking his medications.",
    "Of the approximately 35 states where politicians ultimately control congressional redistricting  the remainder either rely on independent commissions or have only one House seat  the first maps of House seats approved in some 14 states fit many statistical measures of gerrymandering used by political scientists.",
    "If successful, the recall would overturn one of the nations boldest efforts in criminal justice reform: an experiment to install a former public defender as the protector of public safety with promises to reduce mass incarceration, hold the police accountable and tackle racial disparities in the justice system.",
    "Because those missed residents were concentrated in predominantly blue cities, any additional new urban districts probably would have elected Democrats to both congressional and state legislative seats, said Kimball W. Brace, a demographer who has helped Democratic leaders draw political maps for decades.",
    "He has referred to one of the biggest donors to the recall campaign, William Oberndorf, a conservative and wealthy businessman, as an oligarch, called his opponents Trumpian, and sought to place the recall in the national context of a Republican-led effort to attack liberal prosecutors as weak on crime.",
    "The problem for the Democrats here will be that all of the contributing economic factors, particularly inflation, thats hurting them nationally is on steroids in California, said Rob Stutzman, a veteran California Republican strategist who is assisting some independent statewide candidates this year.",
    "In fighting to keep his job, he has leaned on two main strategies: associate, at every turn, the recall effort with Republicans, and confront voters with data that shows overall crime has not increased meaningfully while he has been in office, even as some categories have risen during the pandemic.",
    "Berwood A. Yost, the director of the Center for Opinion Research at Franklin & Marshall, said that given the Democratic nominees 52 years of age, his health problems may make Fetterman even more relatable.You get to your 50s as a working-class person, and youve got some scars to show for it, right?",
    "SAN FRANCISCO  As the former chair of the San Francisco Democratic Party, Mary Jung has a long list of liberal bona fides, including her early days in politics volunteering in Ohio for the presidential campaign of George McGovern and her service on the board of the local Planned Parenthood branch.",
    "Representative Michelle Steel, who like Ms. Kim is a Korean American Republican who flipped a seat in 2020, is running in a new, heavily Asian American district in what is expected to be a close race against Jay Chen, a small-business owner and lieutenant commander in the U.S. Navy Reserve.",
    "On the cusp of Tuesdays primary elections that will determine Californias general election matchups, there are signs that the cost of living is overshadowing virtually every other issue in some of the states battleground areas, according to elected officials, party strategists and polling.",
    "But they have held out hope that a handful of California congressional contests will emerge as bright spots, thanks to the redistricting process that made some seats more hospitable to Democrats, and the importance of issues including abortion rights and gun control to many coastal voters.",
    "But as the general election season begins, the 6-foot-8 Mr. Fetterman suddenly seems a good deal more vulnerable, equipped now with a pacemaker and a doctors note attesting that he can campaign and serve as Pennsylvanias next senator, though the candidate himself admitted he almost died.",
    "The election comes as San Francisco is being convulsed by debates over the disorder of its streets  car break-ins, tent encampments that dot the sidewalks in some neighborhoods and the open-air markets peddling illicit fentanyl that has killed more people in the city than Covid-19.",
    "Mr. Boudin, 41, was an outsider to San Francisco politics who grew up while his parents, 1960s radicals with the Weather Underground, went to prison for their role in the notorious 1981 robbery of a Brinks armored car in New York that left two police officers and a bank guard dead.",
    "A vote to push Mr. Boudin from office would signal to Democrats that talking tough on crime could be a winning message in the midterm elections, and deal a blow to a national movement that has elected progressive prosecutors in cities such as Philadelphia, Chicago and Los Angeles.",
    "Two of them have already scored primary victories in these states: In Michigan, Kristina Karamo, a novice Republican activist who gained prominence challenging the 2020 results there, won her partys endorsement at an April convention, all but securing her nomination in August.",
    "Now she finds herself leading what has been called a Democratic civil war in one of Americas most liberal cities: an effort to recall San Franciscos district attorney, Chesa Boudin, that has echoes of the partys larger split over how to handle matters of crime and punishment.",
    "Five months before the midterm elections, Democrats are straining to defend their narrow House majority in a brutal political environment shaped by high inflation, Mr. Bidens low approval ratings and a strong sense among many Americans that the country is on the wrong track.",
    "Democrats pulled nearly even  in terms of the partisan lean of districts, if not the partys prospects for success in the November midterms  largely by undoing some Republican gerrymanders through court battles and ballot initiatives, and by drawing their own partisan maps.",
    "Just three weeks ago, a varied cross-section of Pennsylvania Democrats put its hopes on the broad shoulders of John Fetterman, confident that the commonwealths burly lieutenant governor could vanquish anything or anyone that a fractured Republican Party could throw at him.",
    "The state court rulings and smattering of new maps from independent commissions this year were bright spots in an otherwise bleak picture, said Paul M. Smith, the senior vice president of the Campaign Legal Center, an advocacy group involved in redistricting battles.",
    "In the first, the justices will review a ruling issued this spring by a three-judge panel that Alabama Republicans violated the Voting Rights Act by drawing only one of the states six House districts where Blacks might elect their favored candidate, instead of two.",
    "On June 16, the court will decide whether to hear a claim by North Carolina Republicans that their state Supreme Court had no authority to strike down its gerrymandered maps on grounds that drawing political boundaries is a legislative duty beyond court review.",
    "SANTA ANA, Calif.  Orange County, Calif., symbolized Republican struggles in Americas diverse and highly educated suburbs during Donald J. Trumps presidency, as a backlash to Mr. Trump transformed center-right strongholds into increasingly Democratic territory.",
    "Shawn W. Rosenberg, a professor of political and psychological science at the University of California, Irvine, who has been studying politics and political style since the late 1980s, said Mr. Fettermans imagery before the health scare had broken new ground.",
    "Texas Republicans told a federal judge this spring that a State Senate district in Fort Worth could not have been illegally drawn to weaken Black and Hispanic voters because their true goal was to weaken Democrats  a partisan aim beyond federal courts reach.",
    "Ms. Longwell said the Democrats overwhelming popularity with his base was the mirror opposite of the reaction to Dr. Oz, who elicits strong suspicion from some conservative Pennsylvania voters, despite the endorsement of former President Donald J. Trump.",
    "Members of the slate have won party endorsements or are competitive candidates for the Republican nomination in several states, including three  Michigan, Arizona and Nevada  where a relatively small number of ballots have decided presidential victories.",
    "But like the concerns of many recall supporters, some of Mr. Fernandezs complaints do not relate directly to the district attorneys performance  they are more general feelings of a need for order and responsiveness from the city, including the police.",
    "A poll from Franklin & Marshall College just before the primary  and before his stroke  found that 67 percent of Democratic voters viewed him favorably, well above the 46 percent who felt warmly toward his primary opponent, Representative Conor Lamb.",
    "They not only successfully defied repeated orders by the State Supreme Court to obey it, but suggested that the courts chief justice, a Republican, be impeached for rejecting the maps drawn by the states Republican-dominated redistricting commission.",
    "At the least, political analysts said, Republicans proved more relentless at shielding such maps from court challenges, through artful legal maneuvers and blunt-force political moves that in some cases challenged the authority of the judicial system.",
    "Yet in California, home to the highest average price for regular gasoline in the nation  $6.326 on Sunday, according to the motor club AAA, compared with the nations average of $4.848  anger over the cost of living is threatening Democrats ambitions.",
    "Though he hails from his partys left flank, he has garnered the affections of more moderate, working-class voters with his bald head, goateed face, Carhartt sweatshirts, baggy basketball shorts and tireless campaigning in every nook of the state.",
    "Its startling to have statewide candidates, multiple candidates for a really important statewide office, running on a deeply incoherent policy plank, said Mark Lindeman, an expert on elections with Verified Voting, an election security nonprofit.",
    "In an interview on Facebook in March, Ms. Trujillo, the New Mexico candidate, asserted that U.S. voting systems are no better than any other communist country like Venezuela or any of these other states where our elections are being manipulated.",
    "The project picked up steam in the spring of last year, after Mr. Marchant attended a meeting of activists hosted by a man known in QAnon circles by the alias Juan OSavin, according to an account from one of the people involved in the group.",
    "What was left for the fight over the Senate seat deemed most within reach for a Democratic takeover was a heart patient, Mr. Fetterman, battling a heart surgeon, Dr. Oz, and a distinct sense of unease, at least for now, among some Democrats.",
    "Car break-ins, long a festering problem, were less frequent during the pandemic, but thieves shifted their targets from tourist areas to more residential neighborhoods, a change that gave the issue more immediacy and urgency among voters.",
    "Weeks later in Florida, where voters approved a ban on partisan maps in 2010, the State Supreme Court, comprising seven Republican justices, declined to stop the implementation of a gerrymander of the states 28 congressional districts.",
    "The information being tossed out under the guise of election reform, particularly the machine manipulation of votes, threatens to corrode Americans trust in democracy, said John Merrill, the Republican secretary of state in Alabama.",
    "Like so many others, and so many men in particular, I avoided going to the doctor, even though I knew I didnt feel well, Mr. Fetterman said in a statement on Friday that broke weeks of silence since he had left the campaign trail.",
    "There are also primary contests for a newly redrawn open seat in Californias 13th Congressional District near Fresno, which leans Democratic, according to the Cook Political Report, though the race may well be highly competitive.",
    "She and many other Democrats argue that their party is trying to bring down gas prices  which have spiked for reasons including Russias invasion of Ukraine  while charging that Republicans embrace the issue as a political cudgel.",
    "Mr. Chen, who is Taiwanese American, is casting Ms. Steel as too far right for the district, and, like Ms. Porter and Mr. Levin, he argued that Republicans seem primarily interested in discussing high prices for political gain.",
    "Blatantly unfair Republican maps in states like Texas, Tennessee and Wisconsin have sailed into law without being challenged in state courts because critics assume that state courts are aligned with the gerrymanders drafters.",
    "Democrats, communists, establishment Republicans and Mark Zuckerberg, the Facebook mogul, all feature prominently, as does the billionaire George Soros, who has long been at the center of right-wing, often antisemitic tropes.",
    "But his health struggles also might clash with his superman image as it bolsters his opponent, a heart surgeon who has spent his extensive television career touting medical interventions, many legitimate, some questionable.",
    "Two other high-profile House races are unfolding in Orange County, a place once strongly associated with Ronald Reagan and Richard Nixon, staunchly conservative former presidents, but now a prominent political battleground.",
    "All theyre doing is pointing fingers and trying to rile up voters without offering any solutions, Mr. Chen said, also arguing that issues of gun violence and the threat of Roe v. Wade being overturned may galvanize voters.",
    "But Mr. Trumps attempts to overturn the results  including his failed attempt to pressure Brad Raffensperger, Georgias secretary of state, to find votes to reverse his loss  has thrust the offices power into the spotlight.",
    "And certainly, there is still time for gas prices and other costs to come down before the midterms, amid other positive economic indicators, and for the political environment to improve for Democrats in competitive races.",
    "But at a Chevron station in Santa Ana near John Wayne Airport on Friday afternoon, the anger was aimed at President Biden and his party, as Californians grappled with gas prices registering that day at $6.59 a gallon.",
    "Among the most frustrated residents in San Francisco are those who live and work in the Tenderloin, the compact neighborhood near City Hall that was once the citys red-light district filled with bars and boxing gyms.",
    "Senator Bernie Sanders, the Vermont independent whose progressive politics are similar to Mr. Fettermans, suffered a heart attack in late 2019, with the presidential primary season looming, and hardly skipped a beat.",
    "In 11 states, the group has sponsored public forums where prominent activists unspool intricate conspiracy theories about voting machines and issue dark warning about forces they claim are manipulating the system.",
    "(California gas prices are typically the highest in the nation, owing in part to state taxes and regulations on emissions that require a more expensive blend of gasoline, but recent numbers have been eye-popping.)",
    "Ms. Jung, director of government affairs for the San Francisco Association of Realtors and head of a Realtors foundation that assists homeless people, wondered what kind of city her granddaughter would grow up in.",
    "Like a president facing election during a bad economy, Mr. Boudin finds himself a vessel for residents pandemic angst and their frustrations over a wave of burglaries and other property crimes in well-to-do areas.",
    "The delay game played out most glaringly during the extended process in Ohio, where ballot initiatives approved by voters in 2015 established a bipartisan redistricting commission that Republicans have dominated.",
    "The politicians put in charge of it spent nine months trampling the Ohio constitution, trashing the rule of law and wasting taxpayer dollars, Paul De Marco, a Cincinnati lawyer and gerrymandering critic, said.",
    "In private weekly calls that stretch on for hours on Friday mornings, the candidates discuss policies and campaign strategy, at times joined by fringe figures who have pushed ploys to keep Mr. Trump in power.",
    "When Mr. Fernandez calls the Tenderloin police station one block away to report fights on the sidewalk, drug sales, threatening behavior or shoplifting, he is frequently disappointed with the slow response.",
    "In April, the seven Democratic justices on New Yorks highest court blew up an aggressive gerrymander of the states 26 congressional districts that had been expected to net Democrats three new House seats.",
    "Theyre beyond furious  its called desperation, said Representative Lou Correa, a Democrat from Santa Ana, whose district is considered safely Democratic but neighbors more competitive Orange County seats.",
    "He promised to end cash bail, stop prosecuting children as adults and expand diversion programs that offer defendants a chance at rehabilitation instead of prison  all steps he has taken while in office.",
    "Ms. Peters, who is the county clerk in Mesa County, is under indictment related to allegations that she tampered with elections equipment, and a judge has barred her from overseeing this years elections.",
    "The doctrine, named the Purcell principle after a 2006 federal lawsuit, says courts should not change election laws or rules too close to an election  how close is unclear  for fear of confusing voters.",
    "As the manager of Threads for Therapy, a nonprofit thrift shop in the Tenderloin run by a Christian charity, Angel Fernandez watched warily on a recent afternoon as customers perused the womens coats.",
    "Its not been an easy time to start a career in public life, he said recently at a community forum in the North Beach neighborhood, which was interrupted by protesters outside chanting, Recall Chesa!",
    "But more than anything, it was the case of Troy McAlister, a man with a long criminal history who mowed down two people with a stolen car on New Years Eve in 2020, that has fueled the recall effort.",
    "WASHINGTON  The brutal once-a-decade process of drawing new boundaries for the nations 435 congressional districts is limping toward a close with the nations two political parties roughly at parity.",
    "Ms. Steel said she opposed abortion rights except to protect the health of the mother and for instances of incest but did not answer directly when asked twice if she supported exceptions for rape.",
    "The races against Representatives David Valadao and Mike Garcia, two Republicans, are expected to be highly competitive in general elections, given the Democratic tilt of both their new districts.",
    "The congresswoman missed the vote to certify the 2020 election because she said she had tested positive for the coronavirus; in the interview, she said she did not know how she would have voted.",
    "Today, it is a gritty tableau of the citys most persistent ills  the illicit drug markets, the desperation of those who are chronically homeless and the consequences of untreated mental illness.",
    "Celebrity in the modern sense is somebody who is known, highly produced, managed and in the media, but they are also commercialized, they are using their celebrity to sell, Professor Majic said.",
    "He also pointed to an increase in media coverage of crime, and especially high-profile videos on social media of shoplifting cases  like one showing a man on a bike stealing from a Walgreens.",
    "But the squalor and petty crime that she sees as crescendoing on some city streets  her office has been broken into four times during the coronavirus pandemic  has tested her liberal outlook.",
    "The group discusses campaigns and policy ideas, including how to transition to hand-counting all ballots  a notion election experts say is impractical and can lead to errors and cause chaos.",
    "In an overwhelmingly Democratic city, liberals and independents will decide a recall that is receiving major funding from conservative donors in addition to backing from moderate Democrats.",
    "Tony Evers, a Democrat, and the Legislature deadlocked this spring over an equally partisan state legislative map, the Republican-controlled Wisconsin Supreme Court ordered new maps drawn.",
    "The former state assemblyman and another candidate won the endorsement of the central committee of the state Republican Party, giving them a boost before voters go to the polls on June 14.",
    "The document made its way to the inbox of the White House chief of staff, Mark Meadows, and is now part of the congressional investigation into the deadly riot at the Capitol on Jan. 6.",
    "In an interview, Mr. Byrne said he is primarily interested in spreading ideas about election integrity and how it needs to be fixed rather than promoting specific candidates for office.",
    "The replacement would serve until an election is held in November, though a separate Tuesday ballot question could prevent that appointee from running and make that person a caretaker.",
    "As Mr. Baugh made his way through a wealthy, marina-adjacent neighborhood, he appeared far more animated when sounding traditional Republican notes on fiscal restraint and the economy.",
    "They translated it into a language none of us can speak and they put it in the hands of private companies and N.G.O.s said Lara Logan, a former CBS journalist who moderated the event.",
    "A three-way slugfest between a celebrity, Dr. Oz, an out-of-state hedge fund manager, Mr. McCormick, and a far-right Fox News pundit, Kathy Barnette, slipped quickly away into memory.",
    "Given the overall political environment, Mr. Yost said the race is a true tossup, but he too wondered how Dr. Ozs lack of connection with his new state will work in the commonwealth.",
    "Other speakers included Russell J. Ramsland Jr., a Texas businessman whose firm produced a widely circulated report that Mr. Trump and his associates presented as evidence of fraud.",
    "And in Pennsylvania, where the governor appoints the secretary of state, State Senator Doug Mastriano, who is aligned with the group, easily won his primary for governor last month.",
    "Scott Baugh, a former chairman of the Orange County Republican Party and former Republican leader in the State Assembly, is considered the leading candidate to challenge Ms. Porter.",
    "And, to many involved in efforts to replace gerrymanders with competitive districts, the vanishing number of truly contested House races indicated that whoever won, the voters lost.",
    "While Chief Scott admits that he and District Attorney Boudin have their disagreements, he maintains that they have a candid and very professional relationship, the spokesman said.",
    "Mr. Boudin added that the recall campaign had exploited individual tragedies like the story of a Thai grandfather who was fatally attacked last year while taking his morning walk.",
    "Mr. Waldron is perhaps best known for circulating a PowerPoint presentation that recommended Mr. Trump declare a national emergency to delay the certification of the 2020 results.",
    "In Nevada, Mr. Marchant has called to decertify Dominion voting machines, and urges the use of paper ballots in a state that first began allowing machines to count votes in 1951.",
    "Around 25 people, including some of the candidates and people seeking to influence them, join the weekly conference calls, according to some of the candidates who were recruited.",
    "We still pay the highest gas price in the whole country, she said in an interview afterward, urging a suspension of the state gas tax, which is set to rise in California in July.",
    "An ABC News/Ipsos poll released Sunday found that most Americans called the economy, inflation and rising gas prices the most important issues in determining their midterm votes.",
    "Voter Fraud Claims Fade: Republicans have been accepting their primary victories with little concern about the voter fraud they once falsely claimed caused Mr. Trumps 2020 loss.",
    "There is no evidence of widespread fraud in the 2020 election and claims that voting machines were hacked have been thoroughly debunked by election officials from both parties.",
    "Sarah Longwell, a Republican strategist who has conducted focus groups with Pennsylvania voters, quoted Democrats saying, You know, hes the physical embodiment of Pennsylvania.",
    "Campaign officials announced he needed a pacemaker as soon as they learned it, and the campaign released Fridays statement as soon as the doctor gave his permission, she said.",
    "But Democrats also began this redistricting cycle with a built-in handicap: The 2020 census markedly undercounted Democratic-leaning constituencies, like Blacks and Hispanics.",
    "A spokesman said in a statement that it was not appropriate for him to get into the type of political discussion that could influence the will of the voters of San Francisco.",
    "Ms. Steel also said she did not know if Mr. Biden won legitimately; Mr. Trover later noted that she has said that she believed he did and that she maintained that position.",
    "But the strategy at times succeeded too well, as courts struck down Democratic maps in some states, and ballot measures kept party leaders from drawing new ones in others.",
    "Brooke Jenkins, a former prosecutor, left the office to join the recall effort in part, she says, because she clashed with Mr. Boudin about how to prosecute a murder case.",
    "In a statement to The New York Times, Mr. Cook said he hoped his work would make our election system more accurate, more transparent and more understandable by the public.",
    "It matters who is counting the vote for that election, said Rachel Hamm, a long-shot contender in Californias primary on Tuesday, at a forum hosted by the group this year.",
    "The host of that session was Phil Waldron, a retired Army colonel and a leading proponent of a machine-hacking theory involving Communists, shell companies and Mr. Soros.",
    "The courts replacement map, drawn by an independent expert, pits Democratic incumbents against each other and creates new swing districts that could cost Democrats seats.",
    "Should they prevail, gerrymanders might be exempt from courts control, and this years rulings vetoing unfair maps in North Carolina, Maryland and New York could be moot.",
    "Secretary of state races were once sleepy affairs, dominated by politicians who sought to demonstrate their bureaucratic competence, rather than fierce partisan loyalty.",
    "On Tuesday, Ms. Hamm will compete to place among the top two candidates in California, and Audrey Trujillo, who is running unopposed in New Mexico, will cinch her G.O.P.",
    "Now that common-man appeal must include the contrition of an ailing patient who ignored his doctors advice for years and an overt appeal to the sympathies of the voters.",
    "These are evil, evil people, Tina Peters, a county clerk and candidate in Colorado, said at a recent forum, speaking of the people she believes are working against her.",
    "Once the fuel has been added to the fire, its very hard to back away from it, said Kathay Feng, the national redistricting director for the advocacy group Common Cause.",
    "But in Ohio, Republicans who gerrymandered congressional and state legislative districts this spring also ignored a voter-approved constitutional ban on partisan maps.",
    "Another problem is that Mr. Boudin and the Police Department, whose rate of arrests for reported crimes is among the lowest of major cities, have a toxic relationship.",
    "And while Mr. Boudin has been criticized for not more aggressively prosecuting drug dealing, he said the police make, on average, only two drug-dealing arrests a day.",
    "over the partys nominee to take on Mr. Fetterman ended suddenly on Friday when Dr. Mehmet Oz accepted the concession of David McCormick, his narrowly beaten opponent.",
    "The candidate insisted that amid inflation and high gas prices, local independent and Republican voters who opposed Mr. Trump had already returned to his partys fold.",
    "And Dr. Oz will know how to sell it, said Samantha Majic, a political scientist at John Jay College of Criminal Justice, who studies style and celebrity in politics.",
    "Trumps Invincibility in Doubt: With many of Donald J. Trumps endorsed candidates failing to win, some Republicans see an opening for a post-Trump candidate in 2024.",
    "Last year, on the same day her granddaughter was born, she watched a video of a mentally ill man punching an older Chinese woman in broad daylight on Market Street.",
    "And Representative Katie Porter, a Democrat with a national platform and a huge war chest, is running in a redrawn seat that is roughly evenly politically divided.",
    "When a State Supreme Court deadline for the commission to submit maps of legislative districts for legal review came due last week, Republicans simply ignored it.",
    "The Republican primary winner for Pennsylvania governor, Mr. Mastriano, was involved in an effort to keep the states electoral votes from President Biden in 2020.",
    "The replacement would serve at least until an election is held in November, though a separate Tuesday ballot question could prevent that appointee from running.",
    "Her primary contest this year grew unexpectedly competitive, and her newly redrawn district would become far more tightly contested in November should she lose.",
    "Mr. Valadao, of the Central Valley, is one of 10 Republicans who voted to impeach Mr. Trump after the Jan. 6 Capitol riot, and he also faces primary challenges.",
    "Im really unhappy, Carmen Vega, 47, of Anaheim, said, adding that she voted for Mr. Biden but was now considering backing Republicans in the midterm elections.",
    "It doesnt mean we dont have a real problem with auto burglaries, but the notion that its out of control today and it wasnt in 2019 is just demonstrably false.",
    "Alabamas congressional map, drawn by Republicans, will be used in the November election, even though a panel of federal judges ruled it a racial gerrymander.",
    "What shade of blue are you  thats really what it comes down to, said Lilly Rapson, the campaign manager of the recall and Ms. Jungs partner in the endeavor.",
    "All that ended on Friday when he admitted that he suffered from a heart condition called cardiomyopathy and had left other heart issues untreated for years.",
    "Doctors have told me I need to continue to rest, eat healthy, exercise and focus on my recovery, and thats exactly what Im doing, he said in his statement.",
    "In May 2021, when Mr. Marchant organized an all-day meeting in a suite at the Trump International Hotel Las Vegas, Mr. Lindell appeared remotely briefly.",
    "In New York, Democrats ignored a voter-approved constitutional mandate that districts not be drawn to discourage competition or favor political parties.",
    "But elsewhere, Republicans seized on the Supreme Courts embrace of a once-obscure legal doctrine to keep even blatant gerrymanders from being blocked.",
    "Some residents, especially the citys sizable Asian American population, also feel that a spike in hate crimes has made it unsafe to walk the streets.",
    "What I liked was that gas prices werent this high  another woman poked her head around the pump and offered a silent thumbs up before driving away.",
    "He has pledged to spend up to $15,000 on each event, and has contributed around $83,000 to a political action committee controlled by Mr. Marchant.",
    "In the 2019 campaign, the San Francisco Police Officers Association attacked Mr. Boudin by calling him the #1 choice of criminals and gang members.",
    "On Saturday morning, Ms. Steel addressed a group of volunteers, standing before a collage of signs bearing her name and slogans like Lower taxes!",
    "He went on to become a Rhodes Scholar who graduated from Yale College and Yale Law School before starting his legal career as a public defender.",
    "The candidates cast their races as a fight for the future of democracy, the best chance to reform a broken voting system  and to win elections.",
    "Mark Cook, a technology consultant who has worked for Mr. Lindell, also spoke to the group, telling them that this system controls our freedom.",
    "And the Fetterman campaign has already started attacking the Republican as a New Jersey interloper who is coming to Pennsylvania via Hollywood.",
    "Voters were venting frustration at the president over global problems, like gas prices, which Mr. Biden cant single-handedly control, she said.",
    "The Politics of Guns: Republicans have been far more likely than Democrats to use messaging about guns to galvanize their base in the midterms.",
    "The contours of those House races will come into clearer focus after Tuesdays primaries, which have so far appeared to be low-turnout affairs.",
    "The Wisconsin State Legislature has been under Republican control since 2011, in part reflecting one of the nations most extreme gerrymanders.",
    "He suffered a stroke last month, just days before Pennsylvanias primary, and seemed to let his campaign systematically downplay his condition.",
    "In 2019, Mr. Boudin sought to move across the courtroom and was elected as the citys top prosecutor, assuming office just before the pandemic.",
    "Many experts expect the justices to further weaken or even strike down a portion of the law dealing with racial disparities in redistricting.",
    "National Republicans see a chance to defeat Representative Mike Levin, a Democrat, but there is also a competitive primary to challenge him.",
    "Election officials have said there was no evidence that fraud or other irregularities played a role in the outcome of the presidential race.",
    "As they appeal for votes on the stump and on social media, the candidates are seeding falsehoods and fictions into the political discourse.",
    "California Democrats have had success using that strategy of attaching opponents to former President Donald J. Trump  most notably in Gov.",
    "A redistricting cycle that began with efforts to demand fair maps instead saw the two parties in an arms race for a competitive advantage.",
    "But his message of leniency for perpetrators has rankled residents of the city, many of whom feel unsafe and violated by property crimes.",
    "The ruling cited procedural issues in allowing the map to take effect, but many experts said there was never much doubt about the result.",
    "But the lessons drawn from how they got there offer little cheer for those worried about the direction of the weary American experiment.",
    "Mr. Lindell told The Times he has gotten involved because he believes most secretaries of state are corrupt and should all be replaced.",
    "They dove deep into well-worn conspiracy theories linking U.S. voting systems to Venezuelan elections and international organizations.",
    "Mr. Byrne, who spent millions on the discredited audit of votes in Arizona, has taken particular interest in sponsoring public forums.",
    "Republicans argue that Democrats have pursued a range of inflationary measures, and some are pushing for practices like more drilling.",
    "Just 28 percent of those surveyed approved of Mr. Bidens handling of inflation, and 27 percent approved of his handling of gas prices.",
    "Mr. Garcia, of Santa Clarita, who won his last election by just 333 votes, voted against certifying the results of the 2020 election.",
    "Democratic officials had grown so worried that there was chatter about recruiting a new nominee, gossip that she pushed back on hard.",
    "Mr. Fettermans health struggles could be particularly resonant because so much of his appeal has stemmed from his image of vitality.",
    "But America First candidates could be competitive in at least four battleground states: Nevada, Arizona, Pennsylvania and Michigan.",
    "The America First slate comprises more than a dozen candidates who falsely claim the 2020 election was stolen from Donald J. Trump.",
    "The Democrats seriously overreached, said John J. Faso, a Republican and former New York state assemblyman and U.S. representative.",
    "So might the truly independent redistricting commissions that drafted new maps in Michigan, Colorado and a handful of other states.",
    "A lifelong Democrat, Ms. Rapson said she was motivated to lead the campaign after her home was broken into last year as she slept.",
    "However, Mr. Baugh declined to say whether he would have voted to certify the 2020 election, citing concerns about irregularities.",
    "She said she also worried that Democrats were unenthusiastic, and she fretted over the effect on Tuesdays turnout and in November.",
    "Editors Note:\nJune 5, 2022\nAn earlier version of this article imprecisely described what would occur if Chesa Boudin was recalled.",
    "maps of Ohio House and Senate districts to be used for this years elections, even though the states high court had rejected them.",
    "One of the most extreme congressional gerrymanders added as many as three new Democratic House seats in staunchly blue Illinois.",
    "In an interview that began in his S.U.V., which he said had cost $140 to fill up, he called Mr. Biden our legitimate president.",
    "Officers have been heard on body camera footage telling residents that the district attorney is unwilling to prosecute crimes.",
    "The group posted a platform that calls for moving to paper ballots, eliminating mail voting and aggressive voter roll cleanup.",
    "In a fight between a Paul Bunyan-like common man and a celebrity doctor, the doctor might emerge as the responsible candidate.",
    "But if Mr. Boudin loses the recall, Mayor London Breed is likely to appoint a more moderate Democrat, political analysts say.",
    "Lawsuits in state courts dismantled Republican partisan maps in North Carolina and Democratic ones in New York and Maryland.",
    "Incidentally, the same thing is true with auto burglaries, where 1 percent of reported auto burglaries result in an arrest.",
    "Most gerrymanders were drawn by Republicans, in part because Republicans control more state governments than Democrats do.",
    "But it said the guiding principle should be to protect incumbents  effectively guaranteeing continued Republican control.",
    "She described her opposition as Mr. Zuckerberg and Mr. Soros in woman form and compared herself to David slaying Goliath.",
    "Since its founding last year, the America First slate has ballooned from a handful of candidates to a high of around 15.",
    "Soon after, the group gathered again at a distillery in Austin, Texas, according to two people who attended the meeting.",
    "Rebecca Katz, a strategist for Mr. Fetterman, strongly denied that the campaign had been keeping his condition hidden.",
    "He added: Its frustrating  all the more so because this is my own fault  but bear with me, I need a little more time.",
    "And then people read the story, they see the video, and they perceive crime as being out of control, Mr. Boudin said.",
    "She added: As campaigns become more expensive, youve got to have celebrity capital to parlay into financial capital.",
    "Do we want a political leader who is a version of the guy next door or someone who stands above us in some respects?",
    "Its going to be a brutal campaign, said G. Terry Madonna, a longtime pollster and political writer in Pennsylvania.",
    "Mr. McAlister was free because Mr. Boudins office had previously negotiated a plea deal on an armed robbery charge.",
    "The city recorded 7,575 burglaries in 2020 and 7,217 last year, a sharp increase of more than 45 percent from 2019.",
    "A leading candidate in Nevadas primary next week is Jim Marchant, one of the organizers of the America First slate.",
    "The report, which focused on results in one Michigan county, was later debunked by Republicans in the State Senate.",
    "The groups candidate in Arizona, Mark Finchem, is a leading contender and the top fund-raiser in the primary race.",
    "Where once clean-scrubbed youth sold well, Pennsylvanians have lapped up their lieutenant governors Everyman look.",
    "Your vote hasnt counted for decades, Mr. Marchant said in a February debate, according to the Nevada Independent.",
    "The annual number of people killed in the city has stayed within a range of 41 to 56 over the past seven years.",
    "There is no compelling evidence that Mr. Boudins policies have made crime significantly worse in San Francisco.",
    "Texas Republicans drew a new map that turned one new House seat and eight formerly competitive ones into G.O.P.",
    "Its governors and state officials and sometimes even courts leaning in to affirm these egregious gerrymanders.",
    "Instead, recall advocates describe a pervasive feeling that quality of life in San Francisco has deteriorated.",
    "In California primaries, the top two vote-getters, regardless of party, then move on to the general election.",
    "The U.S. Supreme Court could rule next year in two pivotal cases arising from this years gerrymander battles.",
    "Seats that, when the maps got drawn, that they didnt think would be competitive very well could be, he added.",
    "At a campaign rally for Ms. Porter near the ocean, Heather Dodd, 54, seemed acutely aware of those dynamics.",
    "My minivan is almost out of gas today and I thought, you know what, Im not in the mood to fill it up today.",
    "Unlike in other parts of the country, homicides are not driving the anger and passions of recall advocates.",
    "What you do is you encourage people not to have confidence in the elections process and people lose faith.",
    "No challenge was filed in state court, where all nine justices on the State Supreme Court are Republicans.",
    "And in Republicans view, Democrats sabotaged a bipartisan commission that voters set up to draw fair maps.",
    "The reason, the Supreme Court said in February, is that the decision came too close to primary elections.",
    "Several Republican primary contests may determine how close a number of Southern California seats become.",
    "Speakers issued dire warnings about a shadowy cabal using technology to steal elections around the world.",
    "Its really problematic that we are having a very Trumpian conversation in San Francisco, Mr. Boudin said.",
    "The chief of police, Bill Scott, declined to answer questions on the departments rate of solving crimes.",
    "And in Arizona, Mr. Finchem has sued to try to ban the use of voting machines in the November elections.",
    "But, she said, many of her more conservative neighbors in Sunset Beach did not appear to share her view.",
    "He compares Mr. Boudin to Robin Hood, someone who views criminals as the downtrodden forced into crime.",
    "Most of the literature suggests we want the latter, and Fetterman is an interesting challenge to that.",
    "The replacement would not automatically serve through the end of the year and then face re-election.",
    "But we don't know how consequential they will be until we see how the Supreme Court rules, he said.",
    "Republicans carved up Kansas City, Kan.; Salt Lake City; Nashville; Tampa, Fla.; Little Rock, Ark.",
    "But you have to be able to balance that with your primary obligation of maintaining public safety.",
    "The nature of this job is we are always looking backwards and hindsight is 20-20, Mr. Boudin said.",
    "Supporters of Mr. Boudin responded at his victory party with chants of epithets toward the union.",
    "He of course ran on a platform of reform, and reform is necessary in the criminal justice system.",
    "San Francisco has had a long line of liberal prosecutors, including Vice President Kamala Harris.",
    "The drama might enhance Mr. Fettermans appeal by further humanizing him, but that is not assured.",
    "I dont believe Chesa is living up to his obligation as the district attorney, Ms. Jenkins said.",
    "Low-level drug dealers can reasonably expect in San Francisco that nothing will happen to them.",
    "Mr. Marchant has said he was urged to start the coalition by unnamed people close to Mr. Trump.",
    "Theres a sense of place here among long-term residents, he said, and Oz really isnt from here.",
    "We know as a matter of material fact that some people will be released and commit bad crimes.",
    "Overall crime in San Francisco has changed little since Mr. Boudin took office in early 2020.",
    "And as Simona Sabo, 38, of Irvine, waxed nostalgic for Mr. Trump while filling up her S.U.V.",
    "There is a solution to this, and it starts by being willing to stand up to corporate abuse.",
    "There has also been something of a Republican rescue mission for Representative Young Kim.",
    "Its frustrating, Ms. Porter said, arguing that Democrats grasp voters pain on this issue.",
    "Theres always going to be cases where if we look back we would make different decisions.",
    "But some wonder if the approach has staying power the longer Mr. Trump is out of office.",
    "He has said he wants to cancel all voter registrations and force voters to re-register.",
    "Neither candidate is favored to beat Democratic opponents in their solidly blue states.",
    "I dont hear anything about the other national issues were focusing on in Washington.",
    "They took something that belonged to the people  our vote, our right to have a say.",
    "Burglaries, especially in wealthier neighborhoods, have soared during the pandemic.",
    "In a video statement, Dr. Oz vowed to start afresh after a difficult primary fight.",
    "Mr. Marchant, Ms. Trujillo and Mr. Finchem did not respond to requests for comment.",
    "I needed to run with my sword right into the belly of the beast and split it open.",
    "In Cleveland, I was considered a communist, she said in her San Francisco office.",
    "According to the 2020 census, a third of Alabama residents are African American.",
    "Among Democrats and many independents in Pennsylvania, Mr. Fetterman is popular.",
    "It doesnt really matter whos running for assembly or governor or anything else.",
    "The shop has a full-time security guard because so many people try to shoplift.",
    "Democrats moved boundaries in New Mexico and Oregon to dilute Republican votes.",
    "Each party has won a handful of state court battles to preserve partisan maps.",
    "Governors Emboldened: Many Republican governors are in strong political shape.",
    "Almost immediately, his opponents began collecting signatures toward a recall.",
    "Now its not just the operatives in the back room, which is where it started.",
    "To have put them in charge was like letting children set their own bedtime.",
    "Ron DeSantis, a Republican, that could net his party four new House seats.",
    "Mr. Fernandez does not hesitate when asked how he will vote on the recall.",
    "Her campaign has said her legal troubles amount to a political witch hunt.",
    "Some of the candidates have aired similar ideas on the campaign trail.",
    "I see them as gatherings of highly concerned citizens, Mr. Byrne said.",
    "So the focus on my office or on me or my policies is really misplaced.",
    "Im not quite back to 100 percent yet, but Im getting closer every day.",
    "All we have is the truth, and thats what we chose to share, she said.",
    "A spokesman, Lance Trover, later said she did support that exception.",
    "They have to go to market, they have to go to work, Ms. Steel added.",
    "If Mr. Fetterman is limping into the general election, so is Dr. Oz.",
    "In recent months, the core group has been recruiting new candidates.",
    "Ms. Peters and her lawyer did not respond to a request for comment.",
    "More common, though, is that obvious gerrymanders go unchallenged.",
    "I thought, Am I going to be able to take her out in the stroller?",
    "Ms. Peters, the Colorado candidate, claimed the tide was turning.",
    "Im going to reach to every corner of this commonwealth, he said.",
    "Undoing those gerrymanders has proved a hit-or-miss proposition.",
    "And what seemed like a protracted, divisive fight in the G.O.P.",
    "The bipartisan commission, he added, is what people voted for.",
    "Its not just legislators being shameless about drawing lines.",
    "If I had to put it in a couple of words, its no holds barred.",
    "But there was no mention of that reality at the Dallas forum.",
    "Major figures in the election denier movement were drawn in.",
    "On the campaign trail, Mr. Boudin is facing stiff headwinds.",
    "And Mr. Boudin says it is a case that keeps him up at night.",
    "Theyre not happy with the direction of the country, he said.",
    "When in fact things like shoplifting are down dramatically.",
    "They let our country be taken through computers, he said.",
    "I want to encourage others to not make the same mistake.",
    "Part of the Republican play since Trump is anti-elitism.",
    "The two parties each claimed redistricting went its way.",
    "The economy sucks right now, everythings too expensive.",
    "Sometimes they dont come at all, he said of the police.",
    "But even in losing races, the slate has left its mark.",
    "He added: That works to his advantage in Pennsylvania.",
    "What are you going to do to bring down the gas prices?",
    "And a comeback from a health setback is not uncommon.",
    "The newly drawn district somewhat favors Democrats.",
    "Democrats are locked in a primary to challenge him.",
    "Peoples expectations are not reasonable, she said.",
    "Its a further contrast between the two candidates.",
    "She called the 2020 presidential election a coup.",
    "They took the ability to cheat to a global scale.",
    "Several polls showed him down at least 10 points.",
    "Voters have to go pick up their kids from school.",
    "The ruling preserves the new map ordered by Gov.",
    "Their status as candidates amplifies the claims.",
    "I mean, the contrast couldnt be any more stark.",
    "Federal judges ordered the gerrymandered G.O.P.",
    "Everybodys complaining, she said of gas prices.",
    "; Oklahoma City and more to weaken Democrats.",
    "Mr. Lindell says he is financing the lawsuit.",
    "The end of the story hasnt been written yet.",
    "The other case could be even more momentous.",
    "New York is a particularly glaring example.",
    "Gavin Newsoms triumph over a recall drive.",
    "The perception is right, Mr. Boudin said.",
    "Against Oz, hes clearly not the elitist.",
    "Weve got to pull people together again.",
    "I want to make sure that happens again.",
    "And some are openly opposing Mr. Trump.",
    "Many have little chance of succeeding.",
    "The statement read like a confession.",
    "Because theyre not getting arrested.",
    "Its over $6.50 in our neighborhood.",
    "The thing I hear about is gasoline.",
    "More upheaval could lie ahead.",
    "Weve got the proof, she said.",
    "I wonder how that plays out.",
    "As a result, I almost died.",
    "You havent elected anybody.",
    "Professor Rosenberg asked.",
    "I know weve got to heal.",
    "Its not just technology.",
    "You have to stand out.",
    "Weve got the fuel now.",
    "and Stop inflation!",
    "nomination.",
    "Heres why.",
    "When Gov.",
    "bastions.",
    "he said.",
    "G.O.P.",
    "Right?"
  ]
}