{
  "id": 10790,
  "mediaId": 8484,
  "date": "2022-03-08",
  "headline": "Homeland Security secretly collected data on at least 200 MILLION money transfers of over $500 made by Americans in the last 12 years without a warrant, Democratic Senator says",
  "image": "https://i.dailymail.co.uk/1s/2022/03/08/14/55095855-0-image-a-14_1646748573747.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10589817/DHS-secretly-collected-data-200M-money-transfers-Americans-12-years.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katelyn Caralle",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The DHS law-enforcement arm was collecting information on domestic and international transfers exceeding $500 to or from Arizona, California, New Mexico and Texas – as well as money transfers of that amount going to or from Mexico from anywhere within the U.S.\n'Given the many serious issues raised by this troubling program, I request that you investigate the program's origins, how the program operated, and whether the program was consistent with agency policy, statutory law, and the Constitution,' Senator Wyden wrote to DHS Inspector General Joseph Cuffari.",
    "+3\nView gallery\nSenator Ron Wyden is demanding DHS probe a bulk surveillance program that allowed the secret collection of at least 200 million domestic and international money transfers between Mexico and the states of Arizona, California, New Mexico and Texas since 2010 without a warrant\nA separate 2014 money-laundering settlement between Western Union and the state of Arizona led to the creation of the Transaction Record Analysis Center (TRAC), which hosts the data from the money transfers described in Wyden's letter.",
    "+3\nView gallery\nThe program falls under ICE's purview with the Department of Homeland Security (DHS) and appears to be a way for border states to try and stop illegal drug and human smuggling as well as other transborder crime\nWhen the agreements did lapse, the Arizona AG asked ICE to compel companies to continue sharing the money transfer data by using a law to investigate people and goods moving transnationally to and from the U.S.",
    "The Oregon Democratic senator's office first learned about the program last month, and Wyden claimed in a letter to the Department of Homeland Security's (DHS) inspector general that it was the first time Congress was made aware of the program's existence, the Wall Street Journal reported after reviewing the letter.",
    "The previously undisclosed surveillance program dates back to at least 2010, according to Wyden's letter, and stems from when the Arizona attorney general's office started collecting data from Western Union following a money-laundering settlement with the financial services company.",
    "'I cannot think of another arrangement like this that combines an illegal use of subpoenas with an inscrutable, private nonprofit just for the purposes of housing this information,' American Civil Liberties Union Senior Staff Attorney Nathan Freed Wessler told the Journal.",
    "Although the program is seen as a way to stop illegal actions coming from across the border, privacy advocates briefed on the program by Wyden staff said it is unusual to use nongovernmental entities to collect and store data that law-enforcement agencies access.",
    "ICE investigators collected approximately 6 million records of international money transfers under TRAC from just Western Union and Maxitransfers alone since 2019, which only amounts to 3 percent of data held by the host program, a Wyden aide said.",
    "Ron Wyden is demanding an investigation after finding out Immigration and Customs Enforcement (ICE) has secretly surveilled and collected records on 200 million American money transfers without obtaining a warrant for at least the last 12 years.",
    "After Wyden's office contacted DHS about the program, the summonses arrangement with Western Union and Maxitransfers ended in January, but other voluntary submissions are continuing, a Wyden aide and separate government official revealed.",
    "'Our office uses TRAC, a federally-funded program to legally monitor international wire cash transfers from border states to Mexico,' spokeswoman Katie Conner for Arizona's Republican Attorney General Mark Brnovich said in a statement.",
    "Western Union, along with dozens of other money transfer companies, voluntarily shared data with TRAC until 2019, Wyden details, which is when the agreement with the Arizona attorney general's office ended.",
    "While Tae Johnson has been in the position as an acting capacity since January 13, 2021, the position has been officially open for the last five years – ever since former President Barack Obama left office.",
    "For example, ICE used TRAC to seize 150,000 counterfeit painkiller pills in Oregon, Wyden's state, which was brought there by a Mexican drug smuggler whose transactions were tracked by the government.",
    "Between July 2019 and January 2022, ICE issued six summons to Western Union, and in 2021 issued two to Maxitransfers Corp., each requesting relevant data for six months at a time, the Journal notes.",
    "The agency cannot seem to get a director confirmed, especially as Republican push for more hard-line immigration enforcement and progressives are calling for the abolition of ICE altogether.",
    "He claimed since these entities are not subject to government public records laws, it 'has the effect of shielding this tremendously concerning program from public scrutiny.'",
    "ICE has agreed to stop using its summons authority for the Program, but the agency and Customs and Border Protection (CBP) still use data for their investigations.",
    "The data supposedly includes names, addresses and identification numbers of the money transfer senders, as well as names and addresses of the recipients.",
    "Until at least 2019, dozens of money transfer companies were voluntarily sharing transaction details with ICE.",
    "Wyden asked Cuffari to probe whether Homeland Security Investigations (HSI) was operating similar programs.",
    "It is ironic that during a historic border crisis, this would be the focus of any U.S. senator,' she added.",
    "He also demanded DHS ensure activities like this are subject to congressional oversight.",
    "This means TRAC has information on at least 200 million money transfers.",
    "The law enforcement arm of DHS still does not have a director.",
    "'This is done to combat human and drug trafficking."
  ]
}