{
  "id": 1134,
  "mediaId": 2573,
  "date": "2022-02-11",
  "headline": "Fighter jet crashes at Luke AFB in Arizona; pilot survives",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/GettyImages-1231400657.jpg",
  "link": "https://www.foxnews.com/us/fighter-jet-crashes-luke-afb-arizona-pilot-survives",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2092,
    1423,
    737,
    7,
    6569,
    5949,
    6014,
    6515,
    6411
  ],
  "sentences": [
    "ARIZONA GOVERNOR SUES BIDEN ADMIN OVER FEDERAL MONEY FOR SCHOOLS WITH MASK MANDATES\nAnother Mirage F1 operated by a different contractor crashed in Las Vegas last year as the pilot came in to land at nearby Nellis Air Force Base.",
    "PHOENIX — A fighter jet operated by a military contractor crashed outside Phoenix on Thursday, but the pilot ejected safely and no one on the ground was hurt, a spokesman for the contractor and U.S. Air Force officials said.",
    "Officials at Luke Air Force Base in nearby Glendale later confirmed the crash and said it occurred late Thursday morning about 15 miles (24 kilometers) west of the base in an unpopulated area.",
    "The 23-year-old from Kenosha, Wisconsin, was in a pickup truck providing safety oversight for a construction crew working alongside the runway at Marine Corps Air Station-Yuma.",
    "\"We are thankful for the continued outstanding support Luke receives from our community partners, especially during difficult situations like this,\" Kreuder said.",
    "The British-built jet flying on a mission for the Air Force wobbled, veered off the left side of the base runway and eventually hit the pickup.",
    "John Rupp, director of foreign military sales for Airborne Tactical Advantage Co., confirmed it was one of his company's jets that went down.",
    "A National Transportation Safety Board report said the pilot of the BAE Systems Hawk jet took off at too low a speed on March 11, 2015.",
    "The May 24 crash happened after Hamilton had an inflight emergency, and the plane crashed into a neighborhood, bursting into flames.",
    "The company provides aggressor aircraft to help military fighter pilots learn their trade as well as other services to the military.",
    "Gen. Gregory Kreuder, commander of the base's 56th Fighter Wing, said in a statement that the base is committed to safety.",
    "UKRAINE, RUSSIA STANDOFF: ARIZONA AIR FORCE BASE COULD DEPLOY US TROOPS IF MOSCOW LAUNCHES ATTACK\nThe plane was destroyed.",
    "Airborne Tactical Advantage is one of a growing number of contractors that fly aircraft to help train military aviators.",
    "The Air Force sent crews from the base fire department, explosives ordnance specialists and police to secure the site.",
    "\"Finally, I’m grateful nobody was hurt on the ground, and the pilot was safely recovered with only minor injuries.\"",
    "The French-made Mirage F1 crashed near Buckeye, a growing community about 30 miles (48 kilometers) west of Phoenix.",
    "Another crash of a military contractor aircraft happened in 2015 in southern Arizona, killing Marine Lance Cpl.",
    "The plane had been operating out of Luke, the Air Force's main base for training F-35 fighter pilots.",
    "Hamilton, a retired U.S. Air Force pilot, was working for military contractor Draken International.",
    "ARIZONA OFFICER SHOT AND AIRLIFTED TO HOSPITAL, MANHUNT UNDERWAY FOR SUSPECT: SHERIFF\nBrig.",
    "The company said it will work with investigators to determine the cause of the crash.",
    "The pilot was taken to a hospital and treated for minor injuries, he said.",
    "\"The pilot is safe and doing well,\" Rupp told The Associated Press.",
    "The pilot — Nicholas Hunter Hamilton, 43, of Las Vegas — died.",
    "Hamilton ejected shortly before the plane hit the ground.",
    "The Buckeye Fire Department was also on scene.",
    "Anthony T. DuBeau."
  ]
}