{
  "id": 12295,
  "mediaId": 8347,
  "date": "2022-03-22",
  "headline": "Drug trafficking suspects identified after months of investigating",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/510fb24/2147483647/strip/true/crop/723x380+0+51/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F66%2F14%2F7fd584184bcd825b053a95f8d620%2F08ff8121-7380-e42e-7869-598e40e1e9fc.jpg",
  "link": "https://www.kgun9.com/news/local-news/drug-trafficking-suspects-have-been-identified-after-months-of-investigation",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bivian Contreras",
  "authorUrl": "https://www.kgun9.com/bivian-contreras",
  "termIds": [
    0
  ],
  "sentences": [
    "The Drug Enforcement Administration, Tempe Police Department, Arizona Attorney General’s Office, were involved with this investigation, with assistance from the Maricopa County Drug Suppression Task Force High Intensity Drug Trafficking Areas Clandestine Lab Team.",
    "Rojas-Armenta plead guilty to one count of conspiracy to commit possession of dangerous drugs for sale (methamphetamine) and possession of a narcotic drug (cocaine) for sale in an amount over the statutory threshold, both are class two felonies as well.",
    "Police recovered about $1,311,000 worth of methamphetamine, cocaine and heroin have been recovered:\n230 pounds of methamphetamine\n25 pounds of cocaine\n25 pounds of heroin along with equipment and chemicals used in manufacturing methamphetamine.",
    "Bernal-Robles pleaded to one count of possessing of a dangerous drug (methamphetamine) for sale and one count of manufacturing a dangerous drug (methamphetamine), both of which are class two felonies.",
    "TUCSON, Ariz. (KGUN) — According to Attorney General Mark Brnovich, investigators identified two suspects who were convicted for their involvement in a drug trafficking organization.",
    "On Thursday, December 16, 2021, a Pima County Superior Court Judge sentenced Bernal-Robles to five years in the Arizona Department of Corrections.",
    "The Pima County court sentenced Rojas-Armenta to three years in the Arizona Department of Corrections back in Wednesday, March 16.",
    "On September 22, 2020, police completed a months-long investigation and issued a search warrant at the men's home in Tucson.",
    "The two suspects were identified as 29-year-old Diego Bernal-Robles and 44-year-old Cipriano Arturo Rojas-Armenta."
  ]
}