{
  "id": 1229,
  "mediaId": 2727,
  "date": "2022-02-17",
  "headline": "Arizona Jews sue to stop the state from using Zyklon B in executions",
  "image": "https://static.timesofisrael.com/www/uploads/2013/12/10901222613_b49298f346_b-1024x640.jpg",
  "link": "https://www.timesofisrael.com/arizona-jews-sue-to-stop-the-state-from-using-zyklon-b-in-executions/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Advertisement\n“We just want to know if there’s anything new that’s changed that would allow the government to essentially argue that its current use of cyanide gas, or plans to use cyanide gas, doesn’t violate the prohibition against cruel and unusual punishment.”\nJewish tradition prescribes the death penalty in some situations, but in practice Jewish courts have rarely if ever carried out executions, and many Jewish leaders in the United States have long advocated against the punishment.",
    "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe next step for the lawsuit is a hearing on March 7, where the defendants in the case — including the state of Arizona; the Arizona Department of Corrections, Rehabilitation and Reentry; Arizona Attorney General Mark Brnovich and others — will have a first chance to make the case for letting execution by gas continue in the state.",
    "“To think that it was done to millions of people during the Holocaust is horrific enough, but to think that 70 to 80 years later we’re thinking of using it as a method of capital punishment is mind-boggling.”\nArizona ended the use of execution by lethal gas in 1992, but allowed the use of gas for people who had already been sentenced at that time, leaving 17 people potentially subject to this form of execution.",
    "“We are not arguing the merits of the death penalty, nor the guilt or innocence of the defendants — simply that because of our tragic history we have a unique lens to declare that the use of Zyklon B is a cruel and barbarous practice whose usage has no place in modern society,” said Paul Rockower, executive director of the Phoenix JCRC and one of the individual plaintiffs.",
    "“Today, those same moral and ethical values require us to take a stand against a practice that we know, from very recent history, is cruel, inhumane and will highly likely cause severe pain and suffering.”\nA version of this article originally appeared in the Jewish News of Greater Phoenix and is republished with permission.",
    "The lawsuit, which the American Civil Liberties Union of Arizona filed this week on behalf of the Jewish Community Relations Council of Greater Phoenix and two members of the local Jewish community, represents a new frontier in the effort to avert the state’s plans.",
    "“Under no circumstances should the same method of execution used to murder over 1 million people, including Jews, during the Holocaust be used in the execution of people on death row,” said Jared Keenan, senior staff attorney with the ACLU of Arizona.",
    "“What we’re asking the court to do is essentially order the defendants to tell us and the court, whether there are any facts or if anything has changed since the protocol that’s been in place since the late 1990s,” said Keenan.",
    "Jewish News of Greater Phoenix via JTA — Leaders of Arizona’s Jewish community are suing the state to prevent it from using hydrogen cyanide, the same lethal gas that was deployed at Auschwitz, to carry out capital punishment.",
    "“Arizona has acknowledged the horrors of cyanide gas as a method of execution and eliminated it in all but a narrow set of cases — it’s time the court eliminates the use of cyanide gas for execution once and for all.",
    "Advertisement\nThe lawsuit alleges that the state statute that allows cyanide gas to be used for a form of execution violates the Arizona state constitution’s prohibition on cruel and unusual punishment.",
    "Using the gas in executions in the United States is “tantamount to approving of what the Nazis did,” said Janice Friebaum, former vice president and spokesperson for the Phoenix Holocaust Association.",
    "As The Times of Israel's Diplomatic Correspondent, I'm well aware that Israel's security, strategy and national interests are always scrutinized and have serious implications.",
    "“Thousands of years ago, Jews shunned mutilation, burning at the stake, and throwing the condemned into a funeral pyre — common practices in other cultures,” he said.",
    "The state is currently seeking warrants of execution for two death row inmates, Frank Atwood and Clarence Dixon, both of whom would be eligible to be executed by gas.",
    "Financial support from readers like you allows me to travel to witness both war (I just returned from reporting in Ukraine) and the signing of historic agreements.",
    "The Guardian broke the news last year that Arizona was refurbishing its gas chamber in preparation to carry out executions, which it last carried out in 2014.",
    "LaGrand displayed “agonizing choking and gagging” and took 18 minutes to die, according to an eyewitness account published by the Tucson Citizen at the time.",
    "And it enables The Times of Israel to remain the place readers across the globe turn to for accurate news about Israel's relationship with the world.",
    "During the Holocaust, the Nazis used pellets of Zyklon B, a hydrogen cyanide formulation, in the gas chambers at Auschwitz and other death camps.",
    "If it's important to you that independent, fact-based coverage of Israel's role in the world exists and thrives, I urge you to support our work.",
    "Arizona has not carried out an execution since 2014, and the last time it did so with hydrogen cyanide gas was for Walter LaGrand in 1999.",
    "It takes balance, determination, and knowledge to accurately convey Israel's story, and I come to work every day aiming to do so fully.",
    "It is not, its plaintiffs say, a broad challenge to capital punishment in principle or a defense of the men facing execution.",
    "At the height of Auschwitz’s operations in 1943 and 1944, an average of 6,000 Jews were gassed to death each day there.",
    "(LaGrand, a German citizen, reportedly chose the method of execution because of its resonance with the Holocaust.)",
    "“It’s a very painful way to kill a person and it’s fundamentally inhumane,” Friebaum said.",
    "The newspaper also reported that the state was buying chemicals that could form Zyklon B.",
    "Tim Eckstein, chairman of the JCRC board, said the lawsuit is rooted in that tradition.",
    "Israel is now a far more prominent player on the world stage than its size suggests.",
    "Thank you,\nLazar Berman, Diplomatic Correspondent\nAdvertisement",
    "That news prompted an immediate outcry locally and beyond.",
    "Will you join The Times of Israel Community today?",
    "The other, Alan Zeichick, is a JCRC board member.",
    "(Israel abolished the death penalty in 1954.)"
  ]
}