{
  "id": 13134,
  "mediaId": 2595,
  "date": "2022-02-28",
  "headline": "Admin Schemes After SCOTUS Hears the ‘Welfare for Illegal Aliens’ Case",
  "image": "https://www.independentsentinel.com/wp-content/uploads/2020/12/iStock-494420816.jpg",
  "link": "https://www.independentsentinel.com/admin-schemes-after-scotus-hears-the-welfare-for-illegal-aliens-case/",
  "mediaOutlet": "independentsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "M Dowling",
  "authorUrl": "https://www.independentsentinel.com/author/freebird/",
  "termIds": [
    4905,
    3401,
    2765,
    392,
    504,
    514,
    1126,
    6383
  ],
  "sentences": [
    "“More than a dozen Republican attorneys general, led by Arizona’s Mark Brnovich, have sought to defend the 2019 public charge rule, which broadened the definition of ‘public charge’ to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period — and included a substantial number of benefits,” Fox News reported on Saturday.",
    "Those benefits included in the 2019 rule included Supplemental Security Income (SSI), cash assistance under Temporary Assistance for Needy Families (TANF), as well as most forms of Medicaid and the Supplemental Nutrition Assistance Program (SNAP), commonly known as food stamps.",
    "Under the new rule by the Biden administration, SSI, TANF, state, tribal and local cash assistance for income maintenance and “long-term institutionalization at government expense” would still all be considered when officials make a public charge determination.",
    "The network reported that the new rule is ready to go:\nMeanwhile, the Biden administration announced last week its own public charge rule which would roll back many of the additional benefits that the Trump administration wished to consider.",
    "However, the administration proposes ignoring a range of other taxpayer-funded benefits, which foreign nationals would be able to receive without it ever being held against them on green card applications.",
    "The “public charge” consideration is used when a legal immigrant on a temporary visa seeks permanent legal status, and officials consider whether the immigrant is likely to be reliant on welfare.",
    "Republican attorneys general sued to preserve a Trump-era rule aimed at reducing the number of migrants being permitted to obtain taxpayer-funded benefits.",
    "Those include SNAP/food stamps, the Children’s Health Insurance Program (CHIP), most Medicaid benefits, housing benefits, and transportation vouchers.",
    "For example, when the administration lost the case of returning migrants (illegal aliens) to Mexico, they simply gutted the Trump-era rule.",
    "Brnovich is still hoping to continue the case to its conclusion but a decision has not been made.",
    "The AGs tried to ward off the rule but Biden’s administration decided not to defend it.",
    "Democrats want to give them all the benefits of citizenship, including welfare.",
    "And if they win, they ignore the ruling or distort it after the fact.",
    "If they think they are going to lose, that’s what they do.",
    "Biden said it’s not who we are and not our values.",
    "The US Supreme Court heard the case last week.",
    "They intend to soften it and start all over."
  ]
}