{
  "id": 13843,
  "mediaId": 8350,
  "date": "2022-03-18",
  "headline": "Arizona AG Brnovich requests report on nearly 200 cases MCAO forced to drop",
  "image": "https://ktar.com/wp-content/uploads/2022/03/Studio_Project-5.jpg",
  "link": "https://ktar.com/story/4956065/arizona-ag-brnovich-requests-report-on-nearly-200-cases-mcao-forced-to-drop/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Brnovich sent a letter Thursday to County Attorney Allister Adel with concerns that victims of the alleged crimes wouldn’t receive justice because of the failure to prosecute the 180 misdemeanor cases from 2020 before the one-year statute of limitations expired.",
    "The Arizona Republic reported that the dropped cases included drunken driving, domestic violence, assault and criminal damage incidents and primarily came from the Maricopa County Sheriff’s Office and Arizona Department of Public Safety.",
    "He gave a March 31 deadline for Adel’s office to produce the report, which should include information on how MCAO is structured, who is responsible for making sure charges are filed on time and a list of the cases not submitted on time.",
    "Doug Ducey called for accountability in the office, saying the dropped cases are “unacceptable.”\n“I think leaders should take accountability for their actions and not blame people on their team,” Ducey said.",
    "PHOENIX — Arizona Attorney General Mark Brnovich is requesting a detailed report on the nearly 200 cases the Maricopa County Attorney’s Office was forced to drop after charges weren’t filed on time.",
    "“Victim’s rights is a pillar of my administration and I will endeavor to ensure this error does not happen in the future.”\nA day earlier, Gov.",
    "Brnovich requested the report under a state law that gives the attorney general supervisory powers over county attorneys.",
    "The report also asks for an explanation for the inaction and steps that will be taken to ensure it doesn’t happen again.",
    "“The police officers that put their life on the line every day and the victims of these crimes deserve justice.”",
    "“I take full responsibility for everything that happens within this office,” Adel said in a statement.",
    "The request is the latest development after MCAO confirmed Monday the failure to file the cases.",
    "Adel on Wednesday took responsibility for the slip up.",
    "“To the victims of these cases, I apologize."
  ]
}