{
  "id": 1684,
  "mediaId": 8416,
  "date": "2022-02-11",
  "headline": "Attorney General Brnovich Co-Leads Coalition to Protect Veterans’ Rights and Limit the Power of Federal Agencies at the U.S. Supreme Court",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/02/11/attorney-general-brnovich-co-leads-coalition-to-protect-veterans-rights-and-limit-the-power-of-federal-agencies-at-the-u-s-supreme-court/?utm_source=rss&utm_medium=rss&utm_campaign=attorney-general-brnovich-co-leads-coalition-to-protect-veterans-rights-and-limit-the-power-of-federal-agencies-at-the-u-s-supreme-court",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Conner",
  "authorUrl": "https://azag.gov",
  "termIds": [
    0
  ],
  "sentences": [
    "Despite this, the courts below concluded that the relevant statutes lack specifications regarding the effective date for the resumption of disability compensation, thus expanding the VA’s authority to decide these effective dates under Chevron deference.",
    "Arizona Attorney General Mark Brnovich is co-leading a coalition of 15 state attorneys general urging the U.S Supreme Court (SCOTUS) to hear and reverse Buffington v. McDonough to ensure federal agencies have limited power in interpreting laws.",
    "Joining Attorney General Brnovich are the attorneys general from Alabama, Alaska, Arkansas, Indiana, Louisiana, Mississippi, Montana, Nebraska, Ohio, Oklahoma, South Carolina, Texas, Utah, and Virginia.",
    "He served from July 2003 to June 2004 and then again from November 2004 to July 2005, but upon formal application to resume the disability compensation benefits, the VA wrongfully refused.",
    "After serving on active duty in the United States Air Force for eight years, veteran Thomas H. Buffington was honorably discharged and sought disability compensation for tinnitus.",
    "Chevron deference is a legal principle that tells federal courts that they should generally defer to an agency’s interpretation of a genuinely ambiguous statute.",
    "The coalition argues it is the job of the courts to interpret the applicable laws when there are disagreements concerning agencies’ policymaking authority.",
    "Disability compensation is a statutory right guaranteed to veterans who suffer from personal injury or disease related to the line of duty.",
    "Attorney General Brnovich will continue to fight for veterans’ rights as well as make sure agencies stay within their statutory authority.",
    "The same statute does not place a restriction on disability compensation resumption when active duty is again concluded.",
    "After a few years, Buffington was recalled to active duty in the Air National Guard, pausing disability compensation.",
    "The court below wrongfully deferred to VA’s interpretation, which expanded its power at the expense of veterans.",
    "§ 5304(c)) specifies that disability compensation cannot be received simultaneously with active-duty pay.",
    "Alternatively, the coalition’s petition argues that Chevron should be overturned.",
    "The Veterans Affairs (VA) agreed to pay Buffington disability compensation.",
    "Copy of amicus brief here.",
    "Federal law (38 U.S.C."
  ]
}