{
  "id": 1763,
  "mediaId": 8295,
  "date": "2022-02-16",
  "headline": "Experts spotlight disparities in contraception, family planning as Supreme Court weighs key abortion case",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/02/abortion2-1024x640-1.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/02/16/roe-v-wade-abortion-experts-spotlight-arizona-disparities/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natasha Yee",
  "authorUrl": "https://cronkitenews.azpbs.org/people/natasha-yee/",
  "termIds": [
    0
  ],
  "sentences": [
    "That includes children who are preborn – and I believe it’s each state’s responsibility to protect them.”\nDisproportionate impact\nAbortion rights supporters say restrictive abortion measures disproportionately affect low-income patients and women of color like Esmarie, who is Latina, and they insist those patients will be the most harmed if Roe is overturned.",
    "“I had just read all this information all over the internet, and I was like, ‘Oh my God.’ I was just so scared, honestly.”\nSB 8, also known as the Texas Heartbeat Act, makes it illegal for doctors to perform abortions once a fetal heartbeat is detected, which usually occurs at about six weeks, before many women know they are pregnant.",
    "“Any efforts to decrease unintended pregnancy will need to include elimination of barriers such as a lack of insurance, inadequate coverage that requires large out-of-pocket expenses, or extremely high premiums,” wrote the authors of a 2020 study published in the journal Contraception and Reproductive Medicine.",
    "And as a society, we should trust people that they know what’s best for them.”\nExperts blame disparities in family planning care on income levels but also structural racism, unequal access to services and distrust of the medical system, and note that more must be done to fix such inequities.",
    "After SB 8 took effect, Cathi Herrod, president of the anti-abortion lobbying group Center for Arizona Policy, said it could be a guide to similar legislation in Arizona, and indeed several proposals to further restrict abortion care are now making their way through the Legislature.",
    "“We can’t allow people who wish to return us to the past to get their way.”\nIn anticipation of that coming decision, the Arizona Senate passed a measure Tuesday that mirrors the Mississippi bill, banning abortion after 15 weeks and subjecting doctors in violation to a felony.",
    "“Given the attacks on abortion in Texas and across the country, it’s more important than ever that patients can access their choice of birth control and other health care through Title X,” Alexis McGill Johnson, president and CEO of Planned Parenthood, said in a statement.",
    "Along with Brnovich and Ducey, Herrod’s group, three GOP members of the state’s congressional delegation and 14 Arizona legislators joined in briefs to the Supreme Court calling on oversight of abortion law to be returned to the states.",
    "(Photo by Emily Sacia/Cronkite News)\nRipple effects\nSB 8 is particularly confining considering that Roe v. Wade protects the right to an abortion until fetal viability, at about 24 weeks, compared with six weeks under the Texas law.",
    "According to the World Health Organization, 74 million women living in low- and middle-income countries have unintended pregnancies each year, leading to an estimated 25 million unsafe abortions and 47,000 maternal deaths globally.",
    "Herrod denounced the legal challenge, calling it “a desperate attempt to stand in the way of Arizona law protecting the preborn from discrimination.”\nIf the Supreme Court overturns Roe v. Wade, these other proposals would be moot.",
    "Vicki Cowart, CEO at Planned Parenthood of the Rocky Mountains, reported a 520% increase in Texas patients from August to September at a Denver clinic, where patients waited “as long as 21 days” for their appointments.",
    "As a result, all Planned Parenthood affiliates withdrew from the program; six states – Hawaii, Maine, Oregon, Utah, Vermont, and Washington – stopped providing Title X-funded services; and six others reduced services.",
    "“Anyone that doesn’t fit into the perfect square of our health care system struggles when you put up these additional barriers,” said Caroline Mello Roberson, Southwest regional director for NARAL Pro-Choice America.",
    "“The demand for reproductive health care in our region is already high, and we’re doing all we can to serve our local communities and welcome our neighbors with open arms,” Cowart said at a news briefing last fall.",
    "In December, not long after Esmarie’s abortion, yet another law took effect in Texas barring access to abortion pills after seven weeks of pregnancy and making it a crime to send the pills through the mail.",
    "“I really hope that Texas can get past this, because it’s really scary.”\nTo be forced to go through with a pregnancy when one isn’t ready, “someone could hurt themselves over that,” she said.",
    "It says that private individuals, rather than state officials, may bring civil lawsuits against anyone who performs or “aids or abets” the procedure, with a $10,000 fine for each violation.",
    "For example, Title X, a federally funded grant program launched in 1970 to combat unintended pregnancies among low-income women, faced new restrictions under Donald Trump’s administration.",
    "Abortion rights advocates worry the court will further restrict abortion, and they say restrictive abortion measures disproportionately affect low-income patients and women of color.",
    "Abortion rights advocates worry the court will further restrict abortion, and they say restrictive abortion measures disproportionately affect low-income patients and women of color.",
    "“Like, ‘Let’s help you … so you don’t have to go through this again.’”\nHer baby slept soundly in the next room as she spoke, a conversation fraught with long pauses and hesitations.",
    "About 18% of all pregnancies end in abortion, according to the Centers for Disease Control and Prevention, and rates are higher among Black and Hispanic women compared with whites.",
    "After abortion rights advocates sued, a federal judge blocked those provisions, but Arizona’s attorney general has appealed to the U.S. Supreme Court, where a decision is pending.",
    "Last year, Ducey signed Senate Bill 1457, allowing felony charges to be brought against doctors who perform abortions because of genetic abnormalities, such as Down syndrome.",
    "If Roe were to be overturned, “26 states are certain or likely to ban abortion,” according to the Guttmacher Institute, a research organization that supports abortion rights.",
    "In March 2019, Title X grantees were told all pregnant patients must be referred to prenatal services and that they’d lose their funding if they provided abortion referrals.",
    "As both sides await a ruling, expected this summer, abortion rights advocates from Arizona and Nevada to Texas and beyond fear that after 49 years, Roe v. Wade could fall.",
    "(File photo by Meghan Finnerty/Cronkite News)\nPHOENIX – Esmarie stared down at two solid pink lines on the test strip in the small bathroom of her central Texas apartment.",
    "Those states either have abortion bans on the books from before 1973 or so-called trigger laws that would automatically ban abortion in their states if Roe is rescinded.",
    "March for Life protesters march past the Supreme Court, which is expected to severely weaken or overturn Roe v. Wade, its 1973 ruling recognizing a right to an abortion.",
    "Health care company GoodRx estimates birth control can cost up to $2,000 annually, depending on the type used, and it estimates 33% of users are paying out of pocket.",
    "President Joe Biden has since reversed those changes, and proponents hope that will incentivize providers who defaulted from Title X funding under Trump to reapply.",
    "The state would default to a 1912 law outlawing abortion unless necessary to save the mother’s life, penalizing physicians with two to five years of imprisonment.",
    "“It could impact 1.6 million women who are of reproductive age living in Arizona, and it may lead to a 2,175% increase in the traveling distance” for a procedure.",
    "“It is the states that have primary authority over health care, and there is no constitutional right to provide abortion or to avoid regulation,” one brief reads.",
    "“There are a lot of networks out there, both seen and unseen, that are going to be ready to keep supporting people, no matter what happens on a policy level.”",
    "To keep their funding, clinics also were required to both physically and financially separate from any establishment engaging in abortion-related activities.",
    "(File photo by Meghan Finnerty/Cronkite News)\nHundreds of protesters, from both sides of the abortion debate, rally last year outside the U.S. Supreme Court.",
    "(File photo by Meghan Finnerty/Cronkite News)\nHundreds of protesters, from both sides of the abortion debate, rally last year outside the U.S. Supreme Court.",
    "“They’re helping you to be safe right now, get what you need right now, and they want to make sure that you’re going to be good in the future,” she said.",
    "The program funds providers offering contraceptive education as well as cancer screenings, testing for sexually transmitted diseases and pregancy tests.",
    "“This right has existed for years, and we cannot lose it now,” Nevada Attorney General Aaron Ford said in a Planned Parenthood news briefing last year.",
    "The Guttmacher Institute reported a 14-fold increase in driving distance to get an abortion after SB 8 went into effect, averaging 247 miles one-way.",
    "The court is weighing a Mississippi case that could scale back or overturn Roe v. Wade, the landmark case legalizing a woman’s right to an abortion.",
    "The court is weighing a Mississippi case that could scale back or overturn Roe v. Wade, the landmark case legalizing a woman’s right to an abortion.",
    "The court is weighing a Mississippi case that could scale back or overturn Roe v. Wade, the landmark case legalizing a woman’s right to an abortion.",
    "Rates are highest among women who are 18 to 24, live below the poverty level or lack a high school diploma, as well as Black and unmarried women.",
    "Efforts to eliminate public funding for birth control and family planning care, or limit access to care, have added to the problem, experts note.",
    "In addition to the bill that’s akin to the Mississippi law, another measure introduced this session mirrors the Texas fetal heartbeat law.",
    "In 2019, there were 57,000 abortions in Texas, compared with 9,000 in Colorado and fewer than 4,000 in New Mexico, according to the CDC.",
    "In spite of the landscape, Sarah Tarver-Wahlquist, who works with the Tucson Abortion Support Collective, said she remains optimistic.",
    "Abortion clinics in neighboring states have scrambled to meet the needs of patients from the second most populous state in the U.S.",
    "When the high court heard that case in December, some justices appeared to lean toward scaling back or overturning Roe entirely.",
    "An analysis by the federal office that runs Title X found the changes may have led to more than 180,000 unintended pregnancies.",
    "Abortions can cost up to $1,500 in the first trimester, not including extra expenses like travel, childcare and time off work.",
    "(File photo by Ulysse Bex/Cronkite News)\nIn this 2016 photo, abortion rights advocates gather outside the U.S. Supreme Court.",
    "(File photo by Ulysse Bex/Cronkite News)\nIn this 2016 photo, abortion rights advocates gather outside the U.S. Supreme Court.",
    "‘It’s really scary’\nEsmarie was not required to travel to obtain her abortion, but the process was still shrouded in secrecy.",
    "A third of those clients were women of color, another third identified as Hispanic, and 19% had limited English proficiency.",
    "She sought help from a friend, who contacted an out-of-the-country organization to acquire pills for a medication abortion.",
    "In 2020, the U.S. Supreme Court upheld a provision allowing employers to avoid coverage for religious or moral reasons.",
    "The law is just one of many recent challenges to Roe v. Wade, the 1973 U.S. Supreme Court decision legalizing abortion.",
    "The collective is made up of 10 volunteers who provide financial and emotional support to those seeking abortion care.",
    "Research shows unintended pregnancies decreased in the U.S. from 51% of all pregnancies in 2008 to 45% in 2011.",
    "“It really just comes down to economic stability,” said Eloisa Lopez, executive director of Pro-Choice Arizona.",
    "It was mid-September, and a new Texas law banning abortions after six weeks had taken effect weeks before.",
    "“I reached out to a friend and I was like, ‘l just started my period, but my test just came out positive.",
    "And not all brands or methods of birth control are on the government list of those approved for coverage.",
    "She remembered the feeling from her last pregnancy, when she gave birth to her son, now 7 months old.",
    "The University of Notre Dame was sued over its refusal to cover certain types of contraceptive care.",
    "Eighty-six percent of those patients were women, and 66% had incomes at or below the poverty level.",
    "The 20-year-old had been uncharacteristically tired and unable to wake up for her fast-food job.",
    "“I feel really inspired by people that I know are never going to give up this fight,” she said.",
    "Esmarie doomscrolled through social media, trying to digest the news in light of her dilemma.",
    "The Affordable Care Act requires coverage of contraceptives, but there are loopholes to that.",
    "That could be as simple as driving someone to a clinic or donating money for the procedure.",
    "Her pills came in the mail with a package including sanitary napkins, water and condoms.",
    "She agreed to tell her story on a first-name basis to protect herself from retribution.",
    "“Overnight, Arizonans may see abortion care go away completely,” Mello Roberson said.",
    "Doug Ducey have expressed support for a Roe reversal in briefs to the Supreme Court.",
    "And in a statement last year, Ducey said: “Every single life has immeasurable value.",
    "In this 2016 photo, abortion rights advocates gather outside the U.S. Supreme Court.",
    "The law is unique not only in its restrictive nature but in the way it is enforced.",
    "The program went from serving 3.1 million patients in 2019 to 1.5 million in 2020.",
    "Anyone who “intends to engage in the conduct” described above may also be sued.",
    "Those include a Mississippi statute banning abortions at 15 weeks of pregnancy.",
    "Today, many in Texas are leaving the state for abortions, adding cost and risk.",
    "These are not the first attempts to restrict abortion in Arizona.",
    "“Sometimes I get really nervous talking about it,” Esmarie said.",
    "What is happening?’” Esmarie recalled in a phone interview.",
    "“People know if they can or cannot bring in more children.",
    "They include Utah, Wyoming, Idaho, Texas – and Arizona.",
    "Arizona Attorney General Mark Brnovich and Gov.",
    "That bill now moves to the state House."
  ]
}