{
  "id": 1795,
  "mediaId": 8322,
  "date": "2022-02-09",
  "headline": "Border Patrol rescues two unaccompanied 5-year-old girls in two days crossing into US",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21214605450831.jpg",
  "link": "https://www.foxnews.com/us/border-patrol-rescues-two-unaccompanied-5-year-old-girls-crossing-us",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    1428,
    1397
  ],
  "sentences": [
    "Border Patrol agents in the Del Rio Sector have rescued two 5-year-old girls attempting to cross the border with no accompanying adults in two separate incidents in two days — the latest instance of children being abandoned and left to fend for themselves at the border.",
    "Unaccompanied children are not being expelled via Title 42 public health protections and are being moved quickly into Health and Human Services custody before being united with a sponsor, normally a guardian or parent already in the country.",
    "In October, Customs and Border Protection released footage showing a 7-year-old from El Salvador being brought over the 30-foot border wall in El Centro Sector by a smuggler on a rope ladder.",
    "On Wednesday, Chief Patrol Agent Jason Owns announced that a 5-year-old Honduran girl had been encountered along with three older children, the oldest of whom was 16 years old.",
    "Border Patrol agents on Tuesday encountered a 5-year-old Guatemalan girl who told agents that she crossed the perilous Rio Grande Valley river by herself.",
    "In June, Border Patrol released video of a 5-year-old migrant girl wandering alone at the border after being abandoned near the end of the wall.",
    "Agents in September rescued two small children abandoned along the Rio Grande River, including a 3-month-old in an infant carrier.",
    "It is the latest in a number of incidents of children being found abandoned by relatives or smugglers at the border.",
    "\"This time a 5-year-old Honduran female was found with three other children, the oldest being 16.\"",
    "\"Another 5-year-old female child found, making this the second in two days,\" he said.",
    "Video shows the child being dropped off and moving away from the smuggler.",
    "Fox News' Bill Melugin contributed to this report.",
    "\"Where are the parents?\"",
    "he asked."
  ]
}