{
  "id": 1850,
  "mediaId": 2662,
  "date": "2022-02-04",
  "headline": "EXCLUSIVE: Maricopa County FOIA Emails Reveal Gross Negligence, Missing Internet Connection Logs?",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/E94DCA46-8A82-4615-98E4-4B84A0A5AD03.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/exclusive-maricopa-county-foia-emails-reveal-gross-negligence-missing-internet-connection-logs/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3106,
    3342,
    3401,
    4267,
    13,
    1082,
    749,
    6329,
    6360
  ],
  "sentences": [
    "Reynaldo Valenzuela Jr., CERA\nDirector of Elections (Election Services & Early Voting)\nOffice of Maricopa County Recorder\n510 South 3rd Avenue, Phoenix, Arizona 85003\nAnother document:\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nFrom: Rey Valenzuela – RISCX <rvalenzuela@risc.maricopa.gov>\nSent: Wednesday, July 28, 2021 9:58 AM\nTo: Renee Suaava – RISCX <rsuaava@risc.maricopa.gov>\nCc: Kristi Passarelli – RISCX <kpassarelli@risc.maricopa.gov>\nSubject: RE: SLI and PRO V&V Tab System Log Review?",
    "Rey Valenzuela finally admitted to another fact that contradicts the County’s previous stance: “Having the Pro V&V and SLI report saying ‘trust us we looked at the logs’ is not enough to say to the Senate Auditors.”\nFrom: Rey Valenzuela – RISCX <rvalenzuela@risc.maricopa.gov> Sent: Wednesday, July 28, 2021 9:42 AM\nTo: Renee Suaava – RISCX <rsuaava@risc.maricopa.gov>\nCc: Kristi Passarelli – RISCX <kpassarelli@risc.maricopa.gov>\nSubject: SLI and PRO V&V Tab System Log Review?",
    "When the Maricopa County Board of Supervisors was in session, Rey Valenzuela asked Kristi Passarelli if the County had access to the logs reviewed during their fake audit with Pro V&V and SLI Compliance, “In case it is indeed called for by the Board to handover the logs.”\nFormer Maricopa County Supervisor Steve Chucri admitted that the County’s audit was “bullsh*t” and later resigned.",
    "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released\nWe The People AZ Alliance will deliver this evidence to Arizona Attorney General Mark Brnovich for his ongoing criminal investigation.",
    "From: Renee Suaava – RISCX <rsuaava@risc.maricopa.gov>\nSent: Wednesday, July 28, 2021 10:10 AM\nTo: Rey Valenzuela – RISCX <rvalenzuela@risc.maricopa.gov>\nCc: Kristi Passarelli – RISCX <kpassarelli@risc.maricopa.gov>\nSubject: RE: SLI and PRO V&V Tab System Log Review?",
    "From: Rey Valenzuela – RISCX <rvalenzuela@risc.maricopa.gov>\nSent: Wednesday, July 28, 2021 10:20 AM\nTo: Renee Suaava – RISCX <rsuaava@risc.maricopa.gov>\nCc: Kristi Passarelli – RISCX <kpassarelli@risc.maricopa.gov>\nSubject: RE: SLI and PRO V&V Tab System Log Review?",
    "From: Renee Suaava – RISCX <rsuaava@risc.maricopa.gov>\nSent: Wednesday, July 28, 2021 10:23 AM\nTo: Rey Valenzuela – RISCX <rvalenzuela@risc.maricopa.gov>\nCc: Kristi Passarelli – RISCX <kpassarelli@risc.maricopa.gov>Subject: RE: SLI and PRO V&V Tab System Log Review?",
    "Despite acknowledging that the report was not enough evidence, the County fought tooth and nail against providing routers, passwords, and Splunk logs, telling Senate auditors, “trust us we looked at the logs,” and there was no internet connection.",
    "In an email chain from last July 2021, Maricopa County Elections Director Rey Valenzuela and Assistant Director discuss transaction logs supposedly used to look for internet connectivity in the elections server.",
    "On July 29th, The Gateway Pundit reported that Maricopa County was still withholding the subpoenaed routers, Splunk logs, and passwords needed to validate the machines were never connected to the internet.",
    "It appears that Rey Valenzuela and Kristi Passarelli were talking about recreating log data that did not exist when saying, “pull the logs anew.”\nHow do you pull logs anew if they don’t exist?",
    "Newly released emails that We The People AZ Alliance obtained through public records requests show Maricopa County’s negligence and complete disregard for election security.",
    "The Arizona Senate has finally started the audit of the routers and Splunk logs used in the 2020 election after almost a year of fighting with the County for access.",
    "Renee, SLI and PRO V&V reviewed all transaction logs of each tabulator and the server to validate every step to validate that they never connected to the internet.",
    "They want to know if we have those logs used by either or both of the VSTL’s to be able to prove to the Senate Auditors.",
    "Having the Pro V&V and SLI report saying “trust us we looked at the logs” is not enough to say to the Senate Auditors.",
    "Do we have contact information for the two vendors to see if they have a copy of the pulled logs they reviewed?",
    "There is discussion as to providing those logs to show there was no connection by any of our BTC equipment.",
    "DO NOT do that as I am just asking in case it is indeed called for by the Board to handover the logs.",
    "Hopefully he calls back soon since it is a question being asked right now by the Board in session.",
    "According to CyFir CEO Ben Cotton, these logs were never obtained by the Arizona Senate auditors.",
    "The Gateway Pundit reported that IT experts were chosen to answer the Arizona Senate’s questions.",
    "They would need the capture the logs to review so what we want is those exact logs they pulled.",
    "“The PRO V&V report that was released confirms that we were never connected to the internet.",
    "Do we have those logs created by these tow vendors when they did that review?",
    "If they do not then next is can we load the election and pull the logs anew?",
    "If you can expedite a reply since we are in session now and has been asked.",
    "But there were logs pulled and looked at to verify no connectivity.",
    "He, Brian, and Bruce are all together in the BTC offices right now.",
    "Yes, I believe the logs are there, we just need to take a look.",
    "I’ll talk to Bruce, but I think the best would be to pull anew.",
    "It appears that these logs were lost or never actually created.",
    "That is all we have,” said Kristi Passarelli.",
    "So, I just spoke with Charles on the phone."
  ]
}