{
  "id": 2021,
  "mediaId": 8506,
  "date": "2022-02-07",
  "headline": "Attorney General’s Office Resolves Arizona Bar Complaints",
  "image": "https://yumanewsnow.com/templates/js_novitas/favicon.ico",
  "link": "https://yumanewsnow.com/index.php/news/arizona-news/9253-attorney-general-s-office-resolves-arizona-bar-complaints.html",
  "mediaOutlet": "yumanewsnow.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“No one working for our office should have been subjected to these bar complaints, which put their reputations and livelihoods in jeopardy merely for doing their jobs as public servants.”\nFor decades, the Attorney General’s Office, through both Democrat and Republican administrations, has performed its independent constitutional and statutory duties while also representing various state agencies, boards, and commissions, as required by the Arizona Legislature, even when there have at times been competing interests among offices and agencies.",
    "The Attorney General will now pursue a rule change proceeding before the Arizona Supreme Court, to seek clarity in the Rules of Professional Conduct as they apply to all government lawyers, including the Attorney General who is a constitutional officer as well as a lawyer, with additional duties that are prescribed by law.",
    "Phoenix, Arizona - Friday Attorney General Mark Brnovich announced he has reached an agreement with the State Bar of Arizona to resolve the bar complaints filed by the Secretary of State (SOS) and Arizona Board of Regents (ABOR) against General Brnovich and several Office attorneys.",
    "With those efforts now put to rest, the Attorney General will work to ensure that his successors can rely on greater clarity in the Rules of Professional Conduct, so they and the lawyers who work for them will never again be subjected to such an inquisition.",
    "\"This is a victory for the rule of law and a rebuke for anyone attempting to weaponize the system for regulating lawyers for their own political purposes,” said Attorney General Brnovich.",
    "These unprecedented complaints, filed by the SOS and ABOR, sought to use the State Bar to try to silence the Attorney General and to advance their own political agendas.",
    "The agreement will result in the dismissal of each complaint with no sanction or findings of professional misconduct.",
    "Until these bar complaints, those practices and procedures were never questioned."
  ]
}