{
  "id": 2022,
  "mediaId": 5247,
  "date": "2022-02-09",
  "headline": "Air Force approves first religious exemptions to COVID-19 vaccine for 9 troops",
  "image": "https://www.airforcetimes.com/resizer/CUz3K-O3S04AZJZu9aj3DpO_M6M=/1024x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/mco/LIEYGNXCHBFRRFJHKJVD5H4X7Y.jpg",
  "link": "https://www.airforcetimes.com/news/your-air-force/2022/02/08/air-force-approves-first-religious-exemptions-to-covid-19-vaccine-for-9-troops/",
  "mediaOutlet": "Military Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel S. Cohen",
  "authorUrl": "https://www.airforcetimes.com/author/rcohen",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Department of the Air Force determined the service members’ accommodations could be supported with no impact to mission readiness.”\nAs of Tuesday, the Air Force has rejected nearly 3,700 religious exemption requests and appeals with almost 3,300 more still under consideration — though the total number has fluctuated in weekly data updates.",
    "As of Feb. 3, the Air Force had approved five initial requests for a religious waiver and granted one exemption upon appeal, according to data submitted to federal district court in Florida by Col. Jason Holbrook, who runs the COVID-19 team under Air Force deputy staff director Nancy Dolan.",
    "“Service members who continue to refuse to obey a lawful order to receive the COVID-19 vaccine after their exemption request/final appeal has been denied, or retirement/separation has not been approved, will be subject to administrative discharge,” the Air Force said.",
    "Getting vaccinated yourself may also protect people around you.”\nUnvaccinated people who have already contracted the virus are more than twice as likely to catch COVID-19 again than their previously infected, vaccinated counterparts, the agency added.",
    "As of Jan. 31, the service had granted about 1,500 medical exemptions for conditions such as severe allergic reactions, not including those that have expired, and around 1,800 administrative exemptions for people who are leaving military service.",
    "Active duty airmen and guardians were required to be fully vaccinated as of Nov. 2, 2021, followed by Reservists on Dec. 2 and Guardsmen on Dec. 31, 2021 — the only date that still falls within the 30-day window for consideration.",
    "The military offers exemptions to people whose religions oppose using modern medicine, like Christian Scientists, but the waivers have become a sought-after tool for anyone looking to avoid the politically polarized vaccines.",
    "Approximately 20% of Americans ages 5 and older remain unvaccinated (the shots are not yet authorized for the youngest children), and at drastically higher risk of severe illness and death without that protection.",
    "Individuals do not have to get immunized as long as their request is in the process of being decided.”\nThe Air Force had kicked out 142 active duty airmen as of Monday, Stefanek said, up from 125 on Jan. 27.",
    "The Air Force acknowledged the change after a military document submitted as part of a court case seemingly contradicted the service’s position that no one had earned a pass because of their faith.",
    "Military leaders are encouraging their forces to get the jab and lessen the likelihood that long-term effects of coronavirus infection and a higher death toll will deal a blow to combat readiness.",
    "Until Tuesday, the Air Force had said no one had shown a sincere belief that their faith should keep them from inoculation, or that public health concerns outweighed their objection.",
    "Thousands of service members across the Defense Department have cited their faith as a reason to get out of receiving COVID-19 shots, though they have been largely unsuccessful.",
    "Active duty airmen and Title 32 Guardsmen who want to get out must leave by April 1, or no later than the beginning of the fifth month after their last appeal is rejected.",
    "Americans have reported more than 76.4 million cases of COVID-19 since the pandemic began in December 2019, according to the Centers for Disease Control and Prevention.",
    "“Religious accommodations are a subset of administrative exemptions and are determined by the [major command and field command] commanders,” according to the Air Force.",
    "“The Department of the Air Force has approved eight religious accommodations and one religious accommodation appeal,” service spokeswoman Ann Stefanek said in an email.",
    "About 900,000 people in the United States have died, including 156 Air Force and Space Force service members, civilian employees, contractors and their dependents.",
    "As of Jan. 31, 96% of the active duty Air Force and Space Force, the Air National Guard and Air Force Reserve were fully vaccinated against the coronavirus.",
    "Correction: A previous version of this story misstated the percentage of Department of the Air Force service members who have obtained religious waivers.",
    "More than 213 million Americans have gotten both of a two-dose Moderna or Pfizer vaccine regimen or the single-shot Johnson & Johnson version.",
    "Holbrook’s data show that no one who failed to obtain a religious waiver despite appealing their case has been separated from the service.",
    "The Air Force said Tuesday it has allowed nine airmen to opt out of the Pentagon’s coronavirus vaccine mandate for religious reasons.",
    "About 501,000 airmen and guardians serve in the Air Force and Space Force, not including civilian employees or contractors.",
    "But a court document filed Feb. 4, in a class-action lawsuit brought by troops protesting the mandate, indicated otherwise.",
    "For instance, some Catholics argue they can’t take some vaccines that are loosely tied to cell lines derived from abortion.",
    "“All COVID-19 vaccines currently available in the United States are effective at preventing COVID-19,” the CDC said.",
    "“COVID-19 vaccination helps protect you by creating an antibody response without you having to experience sickness.",
    "“Appeals are determined by the [Air Force] Surgeon General with inputs from the chaplain and staff judge advocate.",
    "However, the shots do not contain fetal cells, and the Catholic Church endorses vaccination against COVID-19.",
    "Others, like evangelical Protestants, eschew the shots on the grounds that their health is in God’s hands.",
    "Those nine people comprise 0.07% of the 12,623 religious waiver applicants in the system as of Feb. 3.",
    "It’s unclear why the number of administrative waivers dropped from about 2,300 over the past week.",
    "The popular “Air Force amn/nco/snco” Facebook page published Holbrook’s information on Sunday.",
    "Three Marines snagged religious exemptions as of Jan. 27; the Army and Navy have issued none.",
    "About 42%, or 90.2 million, of them are further protected with a recommended booster dose.",
    "As of Jan. 31, however, the Air Force had blocked exemptions for more than 400 personnel.",
    "The Department of the Air Force tries to process requests within 30 business days.",
    "The service did not respond to questions emailed on Tuesday about the data.",
    "The exemptions mark a first for the service’s roughly 500,000 troops.",
    "Stefanek declined to release further information on the approvals.",
    "The amount has been updated to 0.07%."
  ]
}