{
  "id": 2693,
  "mediaId": 8322,
  "date": "2022-02-01",
  "headline": "Arizona woman pleads guilty to voter fraud after accused of forging dead mother's signature",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/tracey.jpg",
  "link": "https://www.foxnews.com/politics/arizona-voter-fraud-dead-mother-signature-scottsdale",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawrence Richard",
  "authorUrl": "https://www.foxnews.com/person/r/lawrence-richard",
  "termIds": [
    5393,
    3401,
    2765,
    511,
    752,
    6360,
    5949,
    6515,
    6594
  ],
  "sentences": [
    "DESPITE DEMOCRACY FEARS, MORE AMERICANS ACCEPT BIDEN'S ELECTION THAN THEY DID TRUMP'S FOUR YEARS AGO\n\"Appearing before Judge Margaret LaBianca in Maricopa County Superior Court on January 26, 2022, McKee admitted signing Mary Arendt’s name to an early ballot envelope and mailing it to Maricopa County on or between October 7, 2020, and November 3, 2020,\" the office of Arizona Attorney General Mark Brnovich said in a statement, according to the report.",
    "An Arizona woman has become the 10th person in the state charged with voter fraud in connection with the 2020 election after she pleaded guilty to voting illegally on behalf of her deceased mother, authorities said.",
    "McKee’s sentencing hearing is scheduled for March 2, at which time she will be stripped of her right to vote until she completes the probationary sentence, FOX 10 reported.",
    "The guilty plea came amid an agreement with the attorney general’s office, which will subsequently drop an additional perjury charge, FOX 10 reported.",
    "McKee is accused of forging her mother's signature on the ballot affidavit, and sending it through the mail to be counted, FOX 10 of Phoenix reported.",
    "\"McKee is the daughter of Arendt, who died on October 5, 2020, and as such was not eligible to vote in the November 3, 2020, General Election.\"",
    "Tracey Kay McKee, 64, of Scottsdale, admitted to filling out a ballot under the name of Mary Arendt, who died Oct. 5, 2020, authorities said.",
    "McKee will be sentenced to probation, potentially serving up to 90 days in jail, and will pay $1,800 in fines and fees, the office said.",
    "The death occurred days before the county mailed early ballots, The Associated Press reported.",
    "She will also be required to fulfill 100 hours of community service, according to the report.",
    "Arizona backed Joe Biden over Donald Trump in the 2020 election by just under 10,500 votes.",
    "A court can restore this right at a later time."
  ]
}