{
  "id": 2813,
  "mediaId": 8387,
  "date": "2022-02-01",
  "headline": "Scottsdale woman pleads guilty to casting dead mother's ballot in 2020 election",
  "image": "https://www.gannett-cdn.com/presto/2020/11/04/PPHX/bf5f9be1-0d25-4bf8-9ba0-0743be9218bf-cent02-7d24f14hxy8x3cs0hle_original.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/scottsdale-breaking/2022/02/01/election-fraud-woman-admits-signing-and-casting-dead-moms-ballot/9306363002/",
  "mediaOutlet": "Northwest Valley Republic: Local news headlines for Surprise, Anthem, Sun City, Sun City West and Youngtown Arizona - azcentral.",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julie Luchetta",
  "authorUrl": "https://www.azcentral.com/staff/8200981002/julie-luchetta/",
  "termIds": [
    4905,
    5156,
    1899,
    3401,
    82,
    111,
    752,
    6360,
    6111,
    5949,
    6594,
    6515
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nA report released by Maricopa County officials in January found that out of 2.1 million votes cast, fewer than 100 ballots were cast fraudulently or double counted in Maricopa.",
    "“There is a very specific reason why we don’t see many instances of fraud, and that is because the system is designed to catch it, to flag it and then hold those people accountable,” Amber McReynolds, a former director of elections in Denver and the founding CEO of the National Vote at Home Institute, which promotes mail voting, told The Associated Press in December.",
    "Tracey Kay McKee, 64, entered a guilty plea to one felony count of attempted illegal voting for signing and casting her recently deceased mother's early ballot in the 2020 general election, Arizona Attorney General Mark Brnovich reported.",
    "On Jan. 26, McKee appeared before Judge Margaret LaBianca in Maricopa County Superior Court and admitted to forging her mother's signature and submitting it to the county after her mother's death.",
    "A Scottsdale woman has pleaded guilty to forging her dead mother's signature on a 2020 election ballot and submitting it, the Arizona Attorney General's Office said on Tuesday.",
    "Amid allegations of extensive voting fraud by Republicans disputing Democratic President Joe Biden's win in the 2020 presidential election, election fraud is exceedingly rare.",
    "The Associated Press reported that out of the 3.4 million ballots cast statewide in the 2020 general election, only 198 were flagged as fraudulent.",
    "McKee's mother, Mary Arendt, died on Oct. 5, 2020, which made her ineligible to cast a ballot in the Nov. 3, 2020, election.",
    "She also will be required to pay about $1,800 in fines and fees and must perform 100 hours of community service.",
    "McKee also will lose her right to vote until she completes probation and a court restores her rights.",
    "Under the plea agreement, she will be sentenced to probation and could face up to 90 days in jail.",
    "In the last decade, election fraud accounted for less than 0.0001% of votes cast in Arizona.",
    "Reach breaking news reporter Julie Luchetta at jluchetta@arizonarepublic.com.",
    "McKee is scheduled to return to court on March 2 for a sentencing hearing.",
    "Arendt died before Maricopa County early ballots were sent to voters.",
    "The Associated Press contributed to this article.",
    "Of those, 10 led to criminal charges.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}