{
  "id": 2904,
  "mediaId": 2548,
  "date": "2022-01-31",
  "headline": "State AG Asks Mayorkas To Stop Letting Illegal Migrants Travel Through US Airports With Arrest Warrants",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/01/brnovich-e1643652782504.jpg",
  "link": "https://dailycaller.com/2022/01/31/mark-brnovich-alejandro-mayorkas-letter-arrest-warrant-migrant-tsa-dhs-ice/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3401,
    4509,
    4873,
    5218,
    1398,
    1126,
    5949
  ],
  "sentences": [
    "(EXCLUSIVE: ‘Department Of Homeland Secrecy’: Missouri Attorney General Asks Mayorkas To End Policy Allowing Migrants To Use Arrest Warrants As IDs At Airports)\nIn his letter, Brnovich asked Mayorkas to provide the number of migrants that have used the ICE form to travel through airport security in Arizona and the number of migrants that have used the form to travel to Arizona airports since Jan. 20.",
    "The Daily Caller News Foundation exclusively reported that TSA Administrator David Pekoske disclosed to Republican Texas Rep. Lance Gooden’s office on Jan. 7 that an Immigration and Customs Enforcement (ICE) “Warrant for Arrest of Alien” could be used by migrants as an alternate form of identification at airport security.",
    "Republican Arizona Attorney General Mark Brnovich sent a letter to Department of Homeland Security (DHS) Secretary Alejandro Mayorkas on Jan. 27 demanding that he stop allowing illegal migrants to travel through U.S. airports over a TSA policy permitting them to use arrest warrants as identification.",
    "Brnovich has sued the Biden administration four times over its immigration policies, which he argues are “reckless.”\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "“Until there is a federal commitment to securing the border and enforcing existing laws, our office requests that you prohibit travel through U.S. airports by any migrant that is illegally here,” Brnovich wrote.",
    "“It is an affront to the most basic common sense to allow anyone to use an ‘arrest warrant’ as acceptable identification to pass through government security,” he said.",
    "Additionally, Brnovich requested that Mayorkas disclose which airports in Arizona are allowing migrants to use the form as identification.",
    "The administrative warrants are signed by ICE officials, who believe there is a reason the person should be removed from the country.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org."
  ]
}