{
  "id": 320,
  "mediaId": 8475,
  "date": "2022-02-24",
  "headline": "Los defensores resaltan la inequidad mientras la Corte Suprema evalúa un caso clave de aborto",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022322_abortion1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/022422_021722_abortion_right_disparities_esp/los-defensores-resaltan-la-inequidad-mientras-la-corte-suprema-evalua-un-caso-clave-de-aborto/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natasha Yee",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Cualquier esfuerzo para disminuir los embarazos no deseados deberá incluir la eliminación de barreras como la falta de seguro, cobertura inadecuada que requiere grandes gastos de bolsillo o primas extremadamente altas”, escribieron los autores de un estudio de 2020 publicado en la revista Anticoncepción y Medicina Reproductiva.",
    "Después de que la SB 8 entró en vigor, Cathi Herrod, presidenta del grupo de cabildeo antiaborto Center for Arizona Policy, dijo que podría ser una guía para una legislación similar en Arizona y, de hecho, varias propuestas para restringir aún más la atención del aborto ahora se están abriendo camino a través de la Legislatura.",
    "“Dados los ataques contra el aborto en Texas y en todo el país, es más importante que nunca que los pacientes puedan acceder a su elección de control de la natalidad y otros servicios de salud a través del Título X”, dijo Alexis McGill Johnson, presidente y director ejecutivo de Planned Parenthood, en un comunicado.",
    "Los expertos atribuyen las disparidades en la atención de la planificación familiar a los niveles de ingresos, pero también al racismo estructural, el acceso desigual a los servicios y la desconfianza en el sistema médico, y señalan que se debe hacer más para corregir tales desigualdades.",
    "Junto con Brnovich y Ducey, el grupo de Herrod, tres miembros del Partido Republicano de la delegación del Congreso del estado y 14 legisladores de Arizona se unieron en informes a la Corte Suprema pidiendo que se devuelva la supervisión de la ley del aborto a los estados.",
    "“La demanda de atención de la salud reproductiva en nuestra región ya es alta y estamos haciendo todo lo posible para servir a nuestras comunidades locales y recibir a nuestros vecinos con los brazos abiertos”, dijo Cowart en una conferencia de prensa el otoño pasado.",
    "Según la Organización Mundial de la Salud, 74 millones de mujeres que viven en países de ingresos bajos y medianos tienen embarazos no deseados cada año, lo que lleva a un estimado de 25 millones de abortos inseguros y 47,000 muertes maternas en todo el mundo.",
    "Vicki Cowart, directora ejecutiva de Planned Parenthood de las Montañas Rocosas, informó un aumento del 520 % en los pacientes de Texas de agosto a septiembre en una clínica de Denver, donde los pacientes esperaron “hasta 21 días” para sus citas.",
    "“Cualquiera que no encaje en el cuadrado perfecto de nuestro sistema de atención médica tiene dificultades cuando se colocan estas barreras adicionales”, dijo Caroline Mello Roberson, directora regional del suroeste de NARAL Pro-Choice America.",
    "Como resultado, todos los afiliados de Planned Parenthood se retiraron del programa; seis estados (Hawái, Maine, Oregón, Utah, Vermont y Washington) dejaron de brindar servicios financiados por el Título X; y otros seis servicios reducidos.",
    "Efectos de la ondulación\nLa SB 8 es particularmente restringida considerando que Roe v. Wade protege el derecho al aborto hasta la viabilidad fetal, alrededor de las 24 semanas, en comparación con las seis semanas bajo la ley de Texas.",
    "Por ejemplo, el Título X, un programa de subvenciones con fondos federales lanzado en 1970 para combatir los embarazos no deseados entre mujeres de bajos ingresos, enfrentó nuevas restricciones bajo la administración de Donald Trump.",
    "Desde entonces, el presidente Joe Biden ha revertido esos cambios, y los proponentes esperan que eso incentive a los proveedores que no cumplieron con los fondos del Título X bajo Trump para que vuelvan a presentar una solicitud.",
    "En diciembre, poco después del aborto de Esmarie, entró en vigor otra ley en Texas que prohíbe el acceso a las píldoras abortivas después de las siete semanas de embarazo y convierte en delito el envío de las píldoras por correo.",
    "Después de que los defensores del derecho al aborto demandaron, un juez federal bloqueó esas disposiciones, pero el fiscal general de Arizona apeló ante la Corte Suprema de los Estados Unidos, donde está pendiente una decisión.",
    "Dice que los particulares, en lugar de los funcionarios estatales, pueden entablar demandas civiles contra cualquier persona que realice o “ayude o sea cómplice” del procedimiento, con una multa de $ 10,000 por cada violación.",
    "Impacto desproporcionado\nLos defensores del derecho al aborto dicen que las medidas restrictivas del aborto afectan desproporcionadamente a los pacientes de bajos ingresos y a las mujeres de color como Esmarie, que es latina.",
    "Alrededor del 18 % de todos los embarazos terminan en aborto, según los Centros para el Control y la Prevención de Enfermedades, y las tasas son más altas entre las mujeres negras e hispanas en comparación con las blancas.",
    "Anticipándose a esa próxima decisión, el Senado de Arizona ya aprobó una medida que refleja el proyecto de ley de Mississippi, prohibiendo el aborto después de 15 semanas y sometiendo a los médicos a un delito grave.",
    "El año pasado, Ducey firmó el proyecto de ley 1457 del Senado, que permite que se presenten cargos por delitos graves contra los médicos que practican abortos debido a anomalías genéticas, como el síndrome de Down.",
    "En marzo de 2019, a los beneficiarios del Título X se les dijo que todas las pacientes embarazadas debían ser remitidas a servicios prenatales y que perderían su financiación si brindaban referencias de aborto.",
    "Mientras ambas partes esperan un fallo, que se espera este verano, los defensores del derecho al aborto desde Arizona y Nevada hasta Texas y más allá temen que después de 49 años, Roe v. Wade pueda caer.",
    "La compañía de atención médica GoodRx estima que el control de la natalidad puede costar hasta $2,000 al año, según el tipo que se use, y estima que el 33 % de los usuarios están pagando de su bolsillo.",
    "Los esfuerzos para eliminar el financiamiento público para el control de la natalidad y la planificación familiar, o limitar el acceso a la atención, se han sumado al problema, señalan los expertos.",
    "Las tasas son más altas entre las mujeres de 18 a 24 años, que viven por debajo del nivel de pobreza o que no tienen un diploma de la preparatoria, así como las mujeres afroamericanas y solteras.",
    "El estado adoptaría por defecto una ley de 1912 que prohibiría el aborto a menos que fuera necesario para salvar la vida de la madre, penalizando a los médicos con dos a cinco años de prisión.",
    "Para mantener su financiación, las clínicas también debían separarse tanto física como financieramente de cualquier establecimiento que participara en actividades relacionadas con el aborto.",
    "Esos estados tienen prohibiciones de aborto en los libros desde antes de 1973 o las llamadas leyes de activación que prohibirían automáticamente el aborto en sus estados si se rescinde Roe.",
    "El Instituto Guttmacher informó un aumento de 14 veces en la distancia de conducción para abortar después de que la SB 8 entró en vigencia, con un promedio de 247 millas en un solo sentido.",
    "“Son los estados los que tienen la autoridad principal sobre la atención médica, y no existe un derecho constitucional para proporcionar abortos o evitar la regulación”, dice un escrito.",
    "El programa financia a proveedores que ofrecen educación anticonceptiva, así como exámenes de detección de cáncer, pruebas de enfermedades de transmisión sexual y pruebas de embarazo.",
    "Si se anulara Roe, “26 estados están seguros o probablemente prohibirán el aborto”, según el Instituto Guttmacher, una organización de investigación que apoya el derecho al aborto.",
    "Herrod denunció el desafío legal y lo calificó como “un intento desesperado de interponerse en el camino de la ley de Arizona que protege a los no nacidos de la discriminación”.",
    "La SB 8, también conocida como la Ley de latidos del corazón de Texas, hace que sea ilegal que los médicos realicen abortos una vez que se detecta un latido del corazón fetal.",
    "“Podría afectar a 1,6 millones de mujeres en edad reproductiva que viven en Arizona, y podría conducir a un aumento del 2175 % en la distancia de viaje para un procedimiento”.",
    "“Este derecho ha existido durante años y no podemos perderlo ahora”, dijo el fiscal general de Nevada, Aaron Ford, en una rueda de prensa de Planned Parenthood el año pasado.",
    "Además del proyecto de ley que es similar a la ley de Mississippi, otra medida presentada en esta sesión refleja la ley de latidos cardíacos fetales de Texas.",
    "Un análisis realizado por la oficina federal que administra el Título X encontró que los cambios pueden haber provocado más de 180,000 embarazos no deseados.",
    "Los abortos pueden costar hasta $1,500 en el primer trimestre, sin incluir gastos adicionales como viajes, cuidado de niños y tiempo libre en el trabajo.",
    "“Te están ayudando a estar seguro en este momento, obtener lo que necesitas en este momento y quieren asegurarse de que estarás bien en el futuro”, dijo.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "Las clínicas de aborto en los estados cercanos se han esforzado por satisfacer las necesidades de los pacientes del segundo estado más poblado de los EE.",
    "“Hay muchas redes, visibles e invisibles, que estarán listas para seguir apoyando a las personas, sin importar lo que suceda en el ámbito de políticas”.",
    "El fiscal general de Arizona, Mark Brnovich, y el gobernador Doug Ducey han expresado su apoyo a una reversión de Roe en informes a la Corte Suprema.",
    "Buscó la ayuda de una amiga, quien se puso en contacto con una organización fuera del país para adquirir pastillas para un aborto con medicamentos.",
    "Nation/World\nEsmarie se quedó mirando dos líneas rosadas continuas en la tira reactiva del pequeño baño de su apartamento en el centro de Texas.",
    "Era mediados de septiembre y semanas antes había entrado en vigor una nueva ley de Texas que prohibía los abortos después de las seis semanas.",
    "Un tercio de esos clientes eran mujeres de color, otro tercio se identificaba como hispano y el 19 % tenía un dominio limitado del inglés.",
    "Su bebé dormía profundamente en la habitación de al lado mientras ella hablaba, una conversación plagada de largas pausas y vacilaciones.",
    "A pesar del panorama, Sarah Tarver-Wahlquist, que trabaja con el Colectivo de Apoyo al Aborto de Tucson, dijo que sigue siendo optimista.",
    "‘Es realmente aterrador’\nNo se requirió que Esmarie viajara para obtener su aborto, pero el proceso todavía estaba envuelto en secreto.",
    "Cuando el tribunal superior escuchó ese caso en diciembre, algunos jueces parecían inclinarse por reducir o revocar Roe por completo.",
    "Y no todas las marcas o métodos de control de la natalidad están en la lista del gobierno de aquellos aprobados para cobertura.",
    "El colectivo está compuesto por 10 voluntarios que brindan apoyo financiero y emocional a quienes buscan servicios de aborto.",
    "En 2019, hubo 57,000 abortos en Texas, en comparación con 9,000 en Colorado y menos de 4,000 en Nuevo México, según los CDC.",
    "“De la noche a la mañana, los arizonenses pueden ver desaparecer por completo la atención del aborto”, dijo Mello Roberson.",
    "Cualquier persona que “tenga la intención de participar en la conducta” descrita anteriormente también puede ser demandada.",
    "Esmarie deslizó noticias negativas a través de las redes sociales, tratando de digerir las noticias a la luz de su dilema.",
    "Verse obligada a seguir adelante con un embarazo cuando uno no está listo, “alguien podría lastimarse por eso”, dijo.",
    "“Realmente todo se reduce a la estabilidad económica”, dijo Eloisa López, directora ejecutiva de Pro-Choice Arizona.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "Eso generalmente ocurre alrededor de las seis semanas, antes de que muchas mujeres sepan que están embarazadas.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "Eso incluye a los niños que nacen antes de nacer, y creo que es responsabilidad de cada estado protegerlos”.",
    "confirmó una disposición que permite a los empleadores evitar la cobertura por motivos religiosos o morales.",
    "Hoy en día, muchas personas en Texas abandonan el estado para abortar, lo que aumenta el costo y el riesgo.",
    "La Universidad de Notre Dame fue demandada por negarse a cubrir ciertos tipos de atención anticonceptiva.",
    "El 86 % de esos pacientes eran mujeres y el 66 % tenía ingresos iguales o inferiores al nivel de pobreza.",
    "La ley es solo uno de los muchos desafíos recientes a Roe v. Wade, la decisión de la Corte Suprema de EE.",
    "La Ley del Cuidado de Salud a Bajo Precio exige la cobertura de anticonceptivos, pero eso tiene lagunas.",
    "La joven de 20 años estaba inusualmente cansada y no podía despertarse para su trabajo en comida rápida.",
    "Eso podría ser tan simple como llevar a alguien a una clínica o donar dinero para el procedimiento.",
    "Sus pastillas llegaron por correo con un paquete que incluía toallas sanitarias, agua y condones.",
    "Recordó la sensación de su último embarazo, cuando dio a luz a su hijo, que ahora tiene 7 meses.",
    "“Me siento realmente inspirada por las personas que sé que nunca abandonarán esta lucha”, dijo.",
    "La ley es única no solo en su naturaleza restrictiva sino también en la forma en que se aplica.",
    "“No podemos permitir que las personas que desean devolvernos al pasado se salgan con la suya”.",
    "Esos incluyen un estatuto de Mississippi que prohíbe los abortos a las 15 semanas de embarazo.",
    "“Me acerqué a un amigo y le dije: ‘Acabo de comenzar mi regla, pero mi prueba salió positiva’.",
    "Y en una declaración el año pasado, Ducey dijo: “Cada vida tiene un valor incalculable.",
    "Y como sociedad, debemos confiar en las personas que saben lo que es mejor para ellos”.",
    "El programa pasó de atender a 3,1 millones de pacientes en 2019 a 1,5 millones en 2020.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Las investigaciones muestran que los embarazos no deseados disminuyeron en los EE.",
    "Si la Corte Suprema anula Roe v. Wade, estas otras propuestas serían discutibles.",
    "Ellos insisten en que esos pacientes serán los más perjudicados si se anula Roe.",
    "Aceptó contar su historia por su nombre de pila para protegerse de represalias.",
    "Join Chris Hostetter, Heidi Harley , and Bruce hermes and contribute today!",
    "“Como, ‘Vamos a ayudarte… para que no tengas que pasar por esto otra vez'”.",
    "“Acababa de leer toda esta información en Internet y dije: ‘Oh, Dios mío’.",
    "“Realmente espero que Texas pueda superar esto, porque da mucho miedo”.",
    "Estos no son los primeros intentos de restringir el aborto en Arizona.",
    "¿Qué está pasando?’”, recordó Esmarie en una entrevista telefónica.",
    "“A veces me pongo muy nerviosa al hablar de eso”, dijo Esmarie.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Concerned about keeping quality reporting alive in Tucson?",
    "del 51 % de todos los embarazos en 2008 al 45 % en 2011.",
    "Support TucsonSentinel.com with a contribution today!",
    "Support TucsonSentinel.com with a contribution today!",
    "Ese proyecto de ley ahora está en la Cámara estatal.",
    "“La gente sabe si puede o no traer más niños.",
    "Donate to TucsonSentinel.com today!",
    "Estaba tan asustada, sinceramente”.",
    "En 2020, la Corte Suprema de EE.",
    "de 1973 que legalizó el aborto.",
    "- 30 -",
    "UU.",
    "UU.",
    "UU.",
    "UU."
  ]
}