{
  "id": 3631,
  "mediaId": 2520,
  "date": "2022-01-24",
  "headline": "Arizona Attorney General Mark Brnovich turns a blind eye to fake Trump electors",
  "image": "https://www.gannett-cdn.com/presto/2021/11/22/PPHX/1290b5be-11b2-490d-88b7-b01f2bbf881d-cent02-7iixb6qdpdg6d3nx2uf_original.jpg?crop=3599,2025,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/01/24/arizona-attorney-general-mark-brnovich-ignores-fake-trump-electors/6633139001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    3401,
    2765,
    2915,
    3332,
    1126,
    392,
    1458,
    1489,
    5949
  ],
  "sentences": [
    "The last attorney general-like thing Brnovich did came days after the 2020 presidential election when he defended the integrity of the process, saying, “There is no evidence, there are no facts that would lead anyone to believe that the election results will change.”\nDonald Trump did not like that.",
    "For example, he is choosing not to investigate the fake presidential electors from Arizona who fraudulently claimed they were valid electors, hoping to subvert the constitutional work of the Electoral College and overturn the outcome of a duly certified election.",
    "Brnovich is no longer attorney general\nArizona’s phony document is signed by Dr. Kelli Ward, Dr. Michael Ward, Greg Safsten, Samuel I. Moorehead, Robert Montgomery, James Lamon, Jake Hoffman, Tyler Bowyer, Loraine B. Pellegrino and Nancy Cottle.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "There is no doubt – none – that if the phony electors had been Democrats, Brnovich would be sprinting to the nearest courthouse in order to honor his oath and perform his prosecutorial duties.",
    "Right/Wrong v. Republican/Democrat\nAnd since Brnovich needs those people to win the Republican nomination for the Senate, he stopped being attorney general and started being a Trump toady.",
    "And while Brnovich ignores traitors, he indulges the whims of Republicans in the state Legislature by having his office investigate what we know to be completely debunked election fraud.",
    "Actual attorneys general, like the one in Michigan, are turning over evidence of fraud from their fake Republican electors to the Department of Justice.",
    "Brnovich and some others who have relinquished their sworn elected obligations in order to become Trump sycophants are not.",
    "Opinion: If the pack of traitors had been Democrats instead of Republicans, he'd be sprinting to the nearest courthouse.",
    "The fake certificates, in which the signatories claimed to be valid electors, were sent to the National Archives.",
    "The last attorney-general thing he did\nThe shame of Brnovich is the sham of Brnovich.",
    "The idea was to replace valid presidential electors with a pro-Trump group.",
    "Once he decided to run for the Senate he stopped being attorney general.",
    "Arizona Attorney General Mark Brnovich is no longer attorney general.",
    "And neither did the people in Arizona who support Donald Trump.",
    "That is why Brnovich is no longer Arizona’s attorney general.",
    "Brnovich also is a Republican running for U.S. Senate.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "Kelli Ward is the state Republican Party chair.",
    "Lamon is a Republican running for U.S. Senate.",
    "Hoffman is a Republican state representative.",
    "For more opinions content, please subscribe.",
    "Because he is running for the U.S. Senate.",
    "Or perhaps he stopped even before that.",
    "Because he is running for U.S. Senate.",
    "This is not a small thing.",
    "By his actions, anyway.",
    "But he is not.",
    "Why?",
    "Why?"
  ]
}