{
  "id": 3761,
  "mediaId": 8322,
  "date": "2022-01-27",
  "headline": "Twenty-five states urge Supreme Court to hear case fighting Maryland firearms ban",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Guns20Store.jpg",
  "link": "https://www.foxnews.com/politics/25-states-urge-scotus-hear-case-fighting-maryland-firearms-ban",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Lee",
  "authorUrl": "https://www.foxnews.com/person/l/michael-lee",
  "termIds": [
    3401,
    5414,
    1269,
    5949,
    6159,
    6697,
    6366
  ],
  "sentences": [
    "A legal brief cites the 2008 landmark District of Columbia v. Heller case, which resulted in the Supreme Court ruling that individuals unconnected to military service or a militia had the right to possess firearms for lawful purposes, arguing that the ruling should be clarified to extend to sporting rifles in \"common use.\"",
    "Other states joining Arizona and West Virginia include Alabama, Alaska, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, Montana, Nebraska, New Hampshire, Ohio, Oklahoma, South Carolina, South Dakota, Texas, Utah, Virginia and Wyoming.",
    "They argue that the Maryland law compromises \"the Second Amendment rights of millions of citizens\" and bans firearms that \"benefit public safety, counterbalance the threat of illegal gun violence and help make our streets safer.\"",
    "A 2017 study \"found that the law was associated with a significant reduction in the trafficking of handguns into the underground crime gun market,\" according to the Center for American Progress.",
    "It also attempts to define assault weapons, banning the sale of firearms such as the AR-15 and similar rifles while also restricting magazine capacity to 10 rounds of ammunition.",
    "Maryland's 2013 law is one of the strictest in the country, requiring that residents undergo safety training and fingerprinting before being granted a license to buy a pistol.",
    "The press release notes that many of the firearms banned under Maryland's law fit the common use definition, noting that 42 other states currently allow for their possession.",
    "\"Americans do not require approval from a local jurisdiction to exercise their constitutional rights,\" Arizona Attorney General Mark Brnovich said in a press release.",
    "\"If left untouched, Maryland’s unconstitutional ban on firearms and the Fourth Circuit’s erroneous standard threaten the constitutional rights of all Americans.",
    "FIRST ON FOX: Arizona and West Virginia are leading a group of 25 states urging the Supreme Court to hear a case challenging Maryland's strict firearms law.",
    "The law also bans firearms with features the 25 states argue actually serve to enhance gun safety, including folding stocks and flash hiders.",
    "The United States Court of Appeals for the Fourth Circuit upheld the Maryland law in September, prompting the appeal to the Supreme Court.",
    "The 25 states are urging the Supreme Court to hear Bianchi v. Frosh, which challenges Maryland's Firearms Safety Act of 2013.",
    "\"SCOTUS should not allow a state to invade its own citizens’ constitutional rights,\" the release states.",
    "Arizona and forty-two other states allow the commonly-used firearms that Maryland has banned outright.\"",
    "\"We must vigorously oppose this type of misguided overreach at all levels of government.\""
  ]
}