{
  "id": 3889,
  "mediaId": 2512,
  "date": "2022-01-24",
  "headline": "Newly released MAGA e-mails underscore Trump’s brazen efforts to overturn Arizona election results: report",
  "image": "https://www.alternet.org/media-library/image.png?id=29027413&width=1200&coordinates=0%2C18%2C0%2C18&height=600",
  "link": "https://www.alternet.org/2022/01/newly-released-maga-e-mails-underscore-trumps-efforts-to-overturn-arizona-election-results-report/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    0
  ],
  "sentences": [
    "“Waldron, who says he worked in the Defense Intelligence Agency’s clandestine service and had ties to former National Security Advisor Michael Flynn, is part of a small group of military veterans who have argued that Chinese Communist Party front groups, Venezuelans, and voting-machine companies have all contributed to vote-rigging and election fraud.”\nKroll adds, “Waldron would go on to write a PowerPoint presentation titled ‘Election Fraud, Foreign Interference & Options for 6 JAN’ that described a number of ways to try to stop the certification of Biden’s election victory.",
    "Sent in early December 2020, the e-mails cover a critical moment when the post-election push by Trump and Republican allies to find fraud and overturn the presidential election was in full swing.”\nStart the Steal: New MAGA Emails Reveal Plot to Hand Arizona to Trump https://www.rollingstone.com/politics/politics-features/maga-emails-arizona-trump-2020-election-1287447/\\u00a0\\u2026 via @RollingStone\n— Fred Wellman (@Fred Wellman) 1642994207\nThe far-right conspiracy theory that Trump, not Biden, was the real winner in Arizona has been repeatedly debunked.",
    "Former Republican Recorder Helen Purcell agrees.”\nBut even though Biden’s victory over Trump in Arizona was perfectly legitimate, Trump and his attorneys did everything they could to overturn the state’s presidential election results — and the MAGA e-mails that Rolling Stone has obtained from the watchdog group American Oversight show how brazen they were about it.",
    "“The technology was complicated, but the plan was simple: Scan mail-in and absentee ballots in populous Maricopa County, remove the ‘invalid votes,’ and recertify the state’s 2020 election count, surely declaring then-President Donald Trump the rightful winner,” Rolling Stone’s Andy Kroll reports in an article published on January 23.",
    "The select committee investigating the January 6 insurrection has subpoenaed Ellis and Kerik.”\nIn Arizona, we have some of the strongest election laws in the country, laws that prioritize accountability and clearly lay out procedures for conducting, canvassing, and even contesting the results of an election.",
    "“The e-mails also reveal that several Trump advisers, including campaign lawyer Jenna Ellis and legal adviser Bernie Kerik, were included in the discussion.”\nKroll continues, “Ellis and Kerik played influential roles on Trump’s legal team after the 2020 election, and their work extended beyond Arizona.",
    "Recounts confirmed Biden’s victory in that state, and one conservative Republican who hasn’t been shy about saying that is Maricopa County Recorder Stephen Richer — who, in an “Open Letter to Maricopa County” in August 2021, wrote, “Nobody stole Maricopa County’s election.",
    "“The e-mails show how a group of fringe election sleuths pressed state legislators on a plan to disrupt the 2020 election certification and potentially change the vote count in a battleground state that helped deliver Joe Biden the presidency,” Kroll explains.",
    "Doug Ducey, a conservative Republican, was certifying Joe Biden’s presidential victory in Arizona on Monday morning, November 30, 2020, then-President Donald Trump tried to reach him on the phone — but Ducey didn’t answer.",
    "“Waldron is emblematic of the crew of self-styled investigators and researchers that have emerged in the last 18 months to spout convoluted and sometimes easily debunked theories about election fraud,” Kroll explains.",
    "4/\n— Doug Ducey (@Doug Ducey) 1606791018\nMany of the e-mails, according to Kroll, were written by a pro-Trump conspiracy theorist named Phil Waldron, who owns a bar near Austin, Texas.",
    "And newly released e-mails from December 2020, according to Rolling Stone, underscore efforts by Trump supporters to steal Arizona’s electoral votes from now-President Biden.",
    "Ellis appeared at public hearings, sometimes alongside Trump lawyer Rudy Giuliani, and amplified baseless claims about election fraud in frequent media appearances.",
    "Waldron and his associates sent the document to multiple people, and it ultimately ended up in the inbox of White House Chief of Staff Mark Meadows.”",
    "Kerik played a more behind-the-scenes role, e-mails and other records show, assisting the Trump campaign’s fruitless search for election wrongdoing.",
    "We review EVERY signature (every single one) on early ballots \\u2014 by hand \\u2014 unlike other states that use computers.",
    "“This scheme to subvert the election outcome in Arizona is laid out in newly released e-mails obtained by Rolling Stone.",
    "Even after that certification, Trump and his allies kept trying to throw out the election results in Arizona.",
    "3/\n— Doug Ducey (@Doug Ducey) 1606790969\nWe\\u2019ve got ID at the polls.",
    "Clear deadlines, including no ballots allowed after Election Day.",
    "Republican Arizona Attorney General Mark Brnovich agrees….",
    "Elections in Maricopa County aren’t rigged.",
    "Prohibitions on ballot harvesting.",
    "Bipartisan poll observers.",
    "Former Republican Gov.",
    "Jan Brewer agrees.",
    "Doug Ducey agrees.",
    "When Gov.",
    "Gov."
  ]
}