{
  "id": 4500,
  "mediaId": 8361,
  "date": "2022-01-06",
  "headline": "News Briefs",
  "image": "https://lovinlife.com/wp-content/uploads/2022/01/opionLLAF.jpg",
  "link": "https://lovinlife.com/news-briefs-18/",
  "mediaOutlet": "Lovin' Life After 50",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Without this ethic of cultural stewardship, designations like this would be impossible.”\nDr. Michael Fassett, board president of the Tucson Historic Preservation Foundation, notes, “The Beck House is an important example of modern architecture that celebrates the contribution of an important local architect.",
    "He can’t say that he’s for public health and tie the hands of cities and counties as the pandemic surges to record levels and hospital ICU beds dwindle.”\nAccording to the latest city of Tucson employee data, 99% of its workers have complied with the city’s requirement and/or have been granted an exemption.",
    "Board approves county redistricting process\nThe Pima County Board of Supervisors unanimously approved establishing a county redistricting committee to draw the lines for the supervisors’ districts, which will also serve as the district lines for the five Pima Community College district lines.",
    "“These upgrades add even greater convenience while also keeping safety top of mind.”\nAt 8280 N. Cortaro Road in Marana, guests will see a slew of updates, including improved lighting, Vision Center 2.0, new building signage, a mother’s room, grab and go, and expanded electronics department.",
    "As a result of this designation, we hope owners of other John Beck buildings will work to designate their properties.”\nHe concludes, “The foundation is available to help owners of iconic historic architecture prepare local historic landmark designation.”\nBeck was born in Boston in 1919.",
    "Pima County offers free COVID-19 antigen rapid tests and PCR tests at centers and mobile events throughout the county and has plans to expand hours at the Ellie Towne Center, Tucson Electric Power’s Downtown office and Liberty Plaza, with hours and days of operation to be decided soon.",
    "Pima County approves $3M to support COVID-19 testing\nThe Pima County Board of Supervisors unanimously voted to authorize $3 million in American Rescue Plan Act (ARPA) contingency funds to support the Pima County Health Department’s ongoing COVID-19 testing program.",
    "His Tucson buildings include Randolph Park Communications Center (1960), Palms Mortuary and Chapel (1960), Beta Theta Pi Greek House (1960), Christopher City (1962), Park Student Union at the University of Arizona (1965) and Alvernon Village Shopping Center (1969).",
    "Customers will enjoy the following changes at 1650 W. Valencia Road, Tucson: updated apparel department; improved auto care center; new building signage; expanded pickup and delivery; remodeled restrooms; grab and go; and expanded electronics, home, deli and tools.",
    "The property, nominated for the designation by the Tucson Historic Preservation Foundation, is a rare residential expression of modern architecture, a 4,000-square-foot binuclear international modernist residence with tilt-in-place cast concrete wall system.",
    "The historic landmark designation protects the exterior character features of the house under local zoning law,” says Demion Clinco, CEO of the Tucson Historic Preservation Foundation who prepared the historic landmark and rezoning applications.",
    "Mayor, council designate Beck House a historic landmark\nTucson’s mayor and city council unanimously voted at the December meeting to designate the John Beck House, located on Potter Place in the Catalina Vista neighborhood, a historic landmark.",
    "“Designation of properties like the John Beck House is only possible through the partnership of forward-thinking owners who understand the importance of protecting the architectural heritage of our community and region.",
    "COVID-19 testing at health department sites has been supported by federal funds via the Arizona Department of Health Services as a pass-through agency, but that funding source was expected to deplete in December.",
    "Avelo’s exclusive, twice-weekly direct service between Tucson International Airport and Los Angeles’ most convenient and popular airport – Hollywood Burbank Airport will operate on Thursdays and Sundays.",
    "“We continue to believe that the county’s investment in free and accessible testing is critical during the current COVID-19 surge,” Acting County Administrator Jan Lesher said in a memo to the board.",
    "Flight 144 departs Tucson at 8:50 p.m., arriving Burbank at 9:30 p.m. Avelo will also offer additional flights on select Tuesdays and Saturdays during the end-of-year peak holiday season.",
    "Remodeled Walmart stores provide a better way to shop\nTucson-area residents got a first look at the newly remodeled Walmart Supercenters at 8280 N. Cortaro Road and 1650 W. Valencia Road.",
    "State law requires counties to review supervisor district boundaries with each decennial census and require supervisor districts have equal population with no more than 10% variance.",
    "“We are excited for Marana customers to visit our newly remodeled supercenter that is going to make their shopping fast and easy,” says store manager Vicente Verdugo.",
    "To balance the districts, the board created a redistricting advisory committee that will begin meeting after January 18 and hold a minimum of five public meetings.",
    "The upgrades also complement the measures the company has taken in its U.S. stores to help protect associates and customers from the ongoing COVID-19 pandemic.",
    "The public will be able to track progress of the committee’s work, provide comments, and see draft maps and other information at pima.gov/\ncountyredistricting.",
    "Three districts — one, two and three — are within the variance with each other, but districts one and four have more than 10% variance with district five.",
    "Additionally, Pima County is providing free BinaxNOW at-home self-test kits at all Pima County Public Libraries during their regular hours of operation.",
    "Designed in 1959 by architect John Beck as his own home and built in 1960, the project incorporated a cast exposed-aggregate concrete panel system.",
    "“Through this designation the mayor and council continue to underscore the importance of protecting historic resources in our community.",
    "The primary living spaces surround a glass-walled atrium/courtyard, which allows diffused natural daylight to illuminate the interior.",
    "Each panel was fabricated on-site using river rock and lifted into place giving the principal elevation a monolithic quality.",
    "The remodels include several department transformations and the expansion of innovations that will help customers save time.",
    "Avelo Airlines takes off from LA for Tucson\nAvelo Airlines began nonstop service between Los Angeles and Tucson December 16.",
    "For consistency, Pima Community College has agreed to use the same district lines for its five governing board districts.",
    "Doug Ducey issued an executive order banning cities from instituting COVID-19 vaccine mandates on December 15.",
    "He has no authority to preempt local actions through executive orders,” Tucson Mayor Regina Romero says.",
    "Romero reiterated that “the governor needs to focus on the crisis at hand as COVID-19 cases rise.",
    "“Arizona Attorney General (Mark) Brnovich already told the governor what he doesn’t want to hear.",
    "The board wants the committee to complete its work and present its recommendations by April 30.",
    "“Our employees answered the call to protect each other and protect our community,” Romero says.",
    "He studied architecture at Wentworth Institute and the Massachusetts Institute of Technology.",
    "A complete schedule, hours of operation, and additional information can be found at pima.gov.",
    "His first architectural project was a home for his family in Seattle, built in 1953.",
    "Beck and his family traveled extensively through Asia, Africa and South America.",
    "The city of Tucson will keep its current policy requiring employee vaccinations.",
    "By Christina Fuoco-Karasinski\nRomero says Tucson will stay the course\nGov.",
    "Each board member will appoint a representative to serve on the committee.",
    "Everyday one-way low fares starting at $29 are available at aveloair.com.",
    "It’s Avelo’s 10th nonstop destination from its Southern California base.",
    "The flights will be operated by Boeing Next Generation 737-800 aircraft.",
    "Flight 143 departs Burbank at 5:40 p.m., arriving in Tucson at 8:10 p.m.",
    "The state requires the board adopt the new district lines by July 1.",
    "The Becks moved to Tucson in 1956.",
    "Beck died April 15, 2006."
  ]
}