{
  "id": 466,
  "mediaId": 8475,
  "date": "2022-02-24",
  "headline": "Arizona donors gave $120,000 to Canada’s 'trucker protest' that shut down Ottawa",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022422_canadian-trucker-protest.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022422_ottowa_az_donors/arizona-donors-gave-120000-canadas-trucker-protest-that-shut-down-ottawa/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "The hacker who took over GiveSendGo and released the data said they did so because of concerns of how the convoy could be used by extremist groups as cover for extremist activities, citing the recent march by Patriot Front in Washington, D.C..\nA number of donors also used fake names in Arizona such as “Joe Biden” or “Lesco Brandon,” a play on the “Let’s Go Brandon” meme which has become a way for conservatives to insult the president without saying an expletive.",
    "The slogan, which stands for “where we go one we go all,” is a common hashtag or calling card of QAnon adherents and their “digital soldiers.”\n“Americans against Castro JR.,” said one $50 donor from the Sierra-Vista area, citing a debunked conspiracy theory that Fidel Castro is Canadian Prime Minister Justin Trudeau’s Father.",
    "Republican Attorney General Mark Brnovich sent a letter to GoFundMe earlier this month demanding that the company preserve documents related to its deletion of similar campaigns for the Canadian convoy and questioned whether GoFundMe violated the state’s laws regarding fraud and deceptive business practices.",
    "The Mirror found one $1,000 donor is a neurologist at a local Arizona hospital who put his name on his donation as “LET’S GO, TRUDEAU.” (Donors on the website are able to choose a name for their donation that others can see, but may provide their real name to GiveSendGo.)",
    "Some alluded to the Canadian prime minister “squealing” soon or being a “Trojan horse” for a nefarious “deep state,” a conspiracy theory that a shadow government exists to control the current government and people.",
    "“Humanity is watching and you are encouraging others to say no to slavery and ‘elite/scumbag’ tyrants and yes to freedom and the unity of people around the world,” said one donor in the Tucson area who gave $100.",
    "Arizonans — or, at least, people claiming to live in Arizona — gave nearly $120,000 to the massive anti-vaccine mandate Canadian trucker protest that shut down the country’s capital for more than a week.",
    "The Intercept discovered that thousands of members of the far-right anti-government militia group the Oathkeepers donated to the convoy, many of them making anti-government comments in their donations.",
    "The information also gives a rare glimpse at who is helping fund the convoy, and researchers and journalists have found notable people, such as U.S. billionaire Thomas Siebel, who donated $96,000.",
    "The Mirror analyzed data from two funds set up to support the Canadian Truck protests that collectively raised millions of dollars: the “Freedom Convoy 2022” and “Adopt a Trucker” campaigns.",
    "Just days prior to the hack, the Ontario Superior Court had ordered GiveSendGo to freeze access to the money from both of these campaigns, causing a fiery response from the company itself.",
    "“Thinking back warmly on the fate of Mussolini,” one $12 donor from the Sunnyslope area said, seemingly alluding to how fascist Dictator Benito Mussolini was killed.",
    "The data was obtained by the journalism collective Distributed Denial of Secrets, which made it available only to journalists and researchers.",
    "An analysis by the Washington Post found richer Americans were more prone to donate, a trend the Mirror found among the Arizona donors.",
    "Another individual put “POYB” as their public name, an acronym which stands for “Proud of your boy,” a reference to the group.",
    "The Mirror also found one employee of the Federal Bureau of Prisons who used his official email address to make his donation.",
    "The top ZIP codes for donations had a higher median average household income than the state average of approximately $50,000.",
    "The leak itself has led to displeasure from many on the right, and some are calling for violence in response to the hack.",
    "to the pits of fire with these communist,” another donor who used the name “communistEraser” said in his comments.",
    "In total, roughly 104,000 people donated to both campaigns totalling $9.6 million to the two campaigns.",
    "The Arizona Mirror used data from the Christian fundraising site GiveSendGo that was hacked last week.",
    "The ZIP code with the highest number of donors in the state was the affluent 85255 in Scottsdale.",
    "Of that, $118,467 came from 1,610 people who listed themselves as having an Arizona ZIP code.",
    "There were also a number of donations including the QAnon slogan “WWG1WGA” in the comments.",
    "The vast majority of the donations came from smaller donors, ranging between $10 and $50.",
    "The top two ZIP codes for donations in the state both came from the Scottsdale area.",
    "The leak contains names, emails and, in some instances, credit card information.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "“We are grateful for your movement — your (sic) in our thoughts and prayers.",
    "Conspiracy theorists and extremists also donated to the convoy from Arizona.",
    "One known Proud Boy donated $5 to the campaign and commented “FJB!!",
    "WWG1WGA.”\nOther comments took a darker and more threatening tone.",
    "Several ZIP codes had average incomes of more than $100,000.",
    "Some of the top donors also come from the medical field.",
    "!” an acronym for an expletive aimed at the President.",
    "God be with you my Canadian Brothers and Sisters.",
    "“yall (sic) doing Gods work.",
    "- 30 -"
  ]
}