{
  "id": 5831,
  "mediaId": 2520,
  "date": "2022-04-11",
  "headline": "Mark Brnovich refused to defend election law, but that's not his only sin",
  "image": "https://www.gannett-cdn.com/presto/2021/04/14/PPHX/818d9d73-d3ea-40b1-8a63-61285c848990-MarkBrnovich003.JPG?crop=1599,900,x0,y81&width=1599&height=900&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/2022/04/11/mark-brnovich-misused-arizona-attorney-general-office/9499840002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kris Mayes",
  "authorUrl": "",
  "termIds": [
    2129,
    3401,
    105,
    1126,
    99,
    83,
    90,
    5949
  ],
  "sentences": [
    "Let's restore the AG's office to its core mission\nPerhaps the most blatant example came when Brnovich chose to sue and take legal positions that were blatantly contrary to the interests of two of his office’s own clients, the Arizona Board of Regents and the secretary of state – selfish political acts that engendered widespread rebukes and landed him in the equivalent of ethical rehab with the State Bar of Arizona.",
    "It is long past time to take politics out of the Attorney General’s Office and restore it to its core mission: serving as the chief legal officer for the state of Arizona, upholding the rule of law, fighting corruption and crime wherever it occurs, protecting Arizona’s most vulnerable citizens and defending individual rights, including voting and reproductive rights.",
    "opinion contributor\nEarlier this month, Arizona Republic columnist Bob Robb argued that GOP Attorney General Mark Brnovich is failing to fulfill his basic duties by refusing to defend Arizona’s mail-in voting system and is using the AG’s Office to advance his own political ambitions.",
    "In fact, at least one of those candidates has suggested that Brnovich hasn’t gone far enough in challenging the 2020 presidential election, a clear tell that the GOP plans to continue hurtling down the path of repurposing the Attorney General’s Office for their own political aims.",
    "Not defending early voting is just 1 example\nAs I recently argued in my amicus brief before the Supreme Court defending mail-in voting, the way that nearly 90% of Arizonans vote is clearly constitutional and rests on more than 100 years of early voting history in Arizona.",
    "But Brnovich has also sued to overturn the Affordable Care Act, manipulated the language of a 2018 ballot initiative, and set up a television station inside the AG’s office using taxpayer funds in an obvious attempt to boost his image for his U.S. Senate bid.",
    "His failure to defend Arizona’s popular and fully constitutional system of mail-in voting in the case that was brought by the Arizona Republican Party before the state Supreme Court is just one example of Brnovich’s selfish dereliction of duty.",
    "Brnovich’s cowardice in refusing to defend the rights of 90% of Arizona voters to use mail-in voting is only one of numerous examples of how he has inappropriately used this critical office as a launching pad for his political ambitions.",
    "In abdicating his duty to defend Arizona’s storied and popular early voting law in his filing before the Supreme Court, Brnovich was once again trying to pacify the right-wing GOP politicians who are behind this offensive challenge.",
    "(This week, the state high court declined to take special action jurisdiction and dismissed the case, meaning the Arizona GOP will have to start in Superior Court if it wants to continue its baseless assault on mail-in voting).",
    "Indeed, early voting dates to our state’s formative years – when the very people who wrote Arizona’s Constitution also enacted early voting to allow soldiers leaving for World War I to cast their ballots.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "No attorney general in Arizona history has politicized and abused his authority as blatantly and comprehensively as Mark Brnovich.",
    "Not a single Republican candidate for attorney general has called Brnovich out for politicizing the Attorney General’s Office.",
    "Kris Mayes is the Democratic nominee for Arizona attorney general and a former member of the Arizona Corporation Commission.",
    "So is Tim Steller, the Arizona Daily Star columnist who made similar arguments recently.",
    "So is the silence coming from my GOP competitors in the 2022 race to replace Brnovich.",
    "That is precisely what I plan to do as the next attorney general of Arizona.",
    "The scope of Brnovich’s misuse of the AG’s office is breathtaking.",
    "Reach her at kris@krismayes.com.",
    "Robb is correct."
  ]
}