{
  "id": 5943,
  "mediaId": 2520,
  "date": "2022-04-11",
  "headline": "Did Arizona illegally redraw voting districts just to help Sen. Wendy Rogers?",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/639ac325-2486-4688-b1f8-a5be8dd84edc-Trump_in_Florence_Drop_4_031.JPG?crop=983,553,x0,y56&width=983&height=553&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/04/11/did-sen-wendy-rogers-get-unconstitutional-reelection-boost-voting-districts/7281072001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2729,
    3333,
    91,
    1489,
    6667,
    6157,
    6014,
    5949
  ],
  "sentences": [
    "But if you can really believe that a Republican commissioner proposed carving out a few blocks of what just happened to be Wendy Rogers’ mobile home park because he was looking out for the Navajos, well, then have I got some great beachfront property to sell you in downtown Ajo.",
    "And the Democrats think he’s going to investigate whether the commission tossed out the constitution to save Trump bestie Wendy Rogers, drawing her into a district that will be hers for life, assuming she can defeat Republican Sen. Kelly Townsend of Apache Junction?",
    "During a break on the final day of deliberations, Republican Commissioner David Mehl approached Democratic Commissioner Shereen Lerner about moving a block or two at the district’s southern end out of LD6 and into LD7, where Republicans dominate.",
    "In the final moments of a long and arduous process to redraw legislative districts, Arizona’s (supposedly) Independent Redistricting Commission made a seemingly inconsequential change to the map, moving one boundary just a few blocks.",
    "Once the public meeting resumed, Mehl proposed moving a small area south of Route 66 – basically Rogers’ mobile home park – into LD 7, which runs south to Apache Junction and even to Oracle, which is just north of Tucson.",
    "Luck, or more likely a blatant violation of the Arizona Constitution, which flatly forbids commissioners or their staff from considering where politicians live as they go about redrawing Arizona’s political districts.",
    "An attorney general who had no interest in investigating the pressure campaign mounted by state GOP Chairwoman Kelli Ward and other Trump allies to get the Maricopa County to stop counting ballots after the election.",
    "“He came over to me and he said, ‘I’d like to make a change for a friend of mine who asked me to make this change,’” Lerner told reporters\n“I said, ‘Don’t tell me if it’s for an incumbent,’ ” Lerner continued.",
    "Mehl, when pressed by reporters, would later claim the change was made to help Democrats boost Navajo voting strength in LD 6 but Lerner said he told a different story about what happened during the break.",
    "“And he said, ‘Then, I won’t tell you.’ ”\nThe Democratic Party, in its letter to Brnovich, laid out similar though less clear cut moves to help Kerr and Leach, moves that also were engineered by Mehl.",
    "Instead, a group of five citizens – two Republicans, two Democrats and one independent – would draw the lines based upon specific criteria, none of which includes the address of Wendy Rogers’ trailer.",
    "One thing's clear: Brnovich isn't touching this\nIt’s unclear why Democrats have waited four months to file a complaint, unless they were waiting for the lawmakers to file their nominating petitions.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "The panel already had approved a set of draft maps during the fall and held two months of public hearings, leading to this December moment when the commission was set to approve the final map.",
    "And as luck would have it, that last-minute “tweak” moved state Sen. Wendy Rogers’ Flagstaff mobile home out of an overwhelmingly Democratic district into one dominated by Republicans.",
    "The Arizona Democratic Party on Monday asked Attorney General Mark Brnovich to investigate how commissioners decided to move Rogers and two other Republican state legislators – Sens.",
    "This is an attorney general who apparently was unfazed by the fake electors who sent a legal document to Congress and the National Archives, avowing that Donald Trump won Arizona.",
    "That, Mehl explained, would make the dividing line a “little cleaner.”\nLerner objected, saying the proposed change was to benefit a sitting legislator and thus unconstitutional.",
    "This is an attorney general who said early on that Biden won Arizona until he began chasing that endorsement and now, suddenly, he says there are questions about the election.",
    "In fact, the Arizona Constitution says “the places of residence of incumbents or candidates shall not be identified or considered” as part of the redistricting process.",
    "These days, Arizona’s attorney general defines his job as “what can I do today to get Donald Trump’s endorsement” for the Senate in a crowded Republican primary.",
    "No longer, they decreed, will legislators draw the maps, deciding who they want to represent by creating districts favorable to them.",
    "Sine Kerr of Buckeye and Vince Leach of SaddleBrooke – out of Democratic districts and into areas where they can glide to reelection.",
    "The two Republican commissioners, Mehl and Douglas York, along with the independent Erika Neuberg voted to make the change anyway.",
    "But here is what's crystal clear:\nBrnovich isn’t about to touch this complaint with a 10-foot Trump flagpole.",
    "One that placed Rogers’ Flagstaff residence in northern Arizona's heavily Democratic Legislative District 6.",
    "Opinion: Sen. Wendy Rogers was doomed until a last-minute 'tweak' to Arizona's new political districts.",
    "Did our supposedly Independent Redistricting Commission trample the constitution to protect her?",
    "Commissioners were preparing to approve the final legislative maps for the coming decade.",
    "Commissioners made a last-minute map change\nA little background seems in order.",
    "Arizona voters changed the way Arizona’s political districts are drawn in 2000.",
    "Right after he investigates Arizona’s fake presidential electors.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "It's too late now to make changes for the 2022 election.",
    "With that in mind, come back with me now to Dec. 22.",
    "This, she would later report, to help a “friend”.",
    "I’m quite sure Brnovich will get right on that.",
    "Or to help Navajo voters, as Mehl claimed?",
    "Move a few blocks to help a 'friend'?",
    "Which should be any time now.",
    "Sure, that’ll happen.",
    "Shouldn’t it?"
  ]
}