{
  "id": 596,
  "mediaId": 2745,
  "date": "2022-02-23",
  "headline": "Supreme Court considers whether Biden administration properly ditched Trump immigration rule",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CSQZJVT72UI6ZDGIW2LFMS5HSY.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/23/supreme-court-trump-public-charge-rule/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2697,
    2765,
    4905,
    3401,
    5124,
    1269,
    6239
  ],
  "sentences": [
    "“There’s a kind of mismatch here between what you’re saying went wrong and what you’re saying you want,” said Kagan, adding that Brnovich was “trying to intervene in a suit that’s completely dead that never applied to you in the first place.”\nWhen Brnovich again said the government’s actions were unprecedented, Justice Brett M. Kavanaugh interrupted.",
    "Usually, the Administrative Procedure Act requires extensive notice and comment before repealing such rules, and Chief Justice John G. Roberts Jr. said the Biden administration’s strategy of abandoning its defense of the rule in court and then enacting a new one raised the question of “collusive action.”\n“I’m not questioning anybody’s motives.",
    "That is not unprecedented at all.”\nHelen H. Hong, representing California governments that opposed Trump’s rule, said she agreed with Arizona that it was important for state and local governments to be able to intervene in cases, so the Supreme Court need not make a broad decision in the case.",
    "Kagan told him that in defending the administration’s action, he should “assume that that is a problem and that we shouldn’t be greenlighting that behavior for your administration or any other administration.”\nThe substance of the actual rule in question was not in front of the court.",
    "I’m questioning the ease with which a decision in your favor will make it for an incoming administration to avoid notice-and-comment review,” the chief justice said to Deputy Solicitor General Brian H. Fletcher, representing the Biden administration.",
    "And several members of the Supreme Court on Wednesday seemed suspicious the Biden administration was skirting the requirements in its zeal to get rid of a Trump administration rule that made it harder for immigrants to obtain green cards.",
    "It was in effect about a year, but courts across the country judged it at odds with the Immigration and Naturalization Act, and a district judge in Illinois in November 2020 said it could not be implemented nationwide.",
    "“The 2019 Public Charge Rule was vacated through a final judgment in a separate case in a different circuit, and there is no rule left for [Arizona] to defend in the courts below,” Hong said.",
    "He and other Republican state attorneys general want to intervene to defend the rule, but the U.S. Court of Appeals for the 9th Circuit, which covers the West, turned him down.",
    "President Donald Trump’s “public charge” rule, approved in 2019, denied green cards to immigrants if they had relied too much on social welfare programs such as food stamps.",
    "But Brnovich was whipsawed by questions, also from both sides of the court’s ideological divide, that at times appeared to leave him tongue-tied.",
    "“It’s very much not unprecedented, as Justice [Clarence] Thomas says, for the government to acquiesce in an adverse judgment invalidating a rule.",
    "“We know that it affected only about five of the approximately 50,000 adjustment of status applications to which it was applied,” Fletcher said.",
    "That left states that favored the public charge rule without recourse, Arizona Attorney General Mark Brnovich (R) told the justices Wednesday.",
    "Whenever partisan control of the White House changes hands, old policies are junked and new ones, often exactly the opposite, are installed.",
    "The Biden administration acquiesced to the Illinois judge’s decision, and moved to dismiss the remaining cases around the country.",
    "Why can’t a new administration simply comply with an adverse lower court ruling if it thinks the rule is incorrect?",
    "Fletcher told the court the incoming Biden administration thought the rule was wrong, as well as ineffective.",
    "From the other side of the court’s ideological divide, Justice Elena Kagan had similar concerns.",
    "“The real issue to me is the evasion of notice and comment,” she said to Fletcher.",
    "What gave his state standing to be involved in federal immigration policy?",
    "Among them: How could a state intervene in a rule no longer in force?",
    "“This case can be resolved on that straightforward basis alone.”",
    "“This was an unprecedented legal maneuver,” Brnovich said.",
    "Had he sued under the Administrative Procedure Act?",
    "Had he tried to overturn the judge in Illinois?",
    "But there’s a process that must be followed."
  ]
}