{
  "id": 6364,
  "mediaId": 8416,
  "date": "2022-04-16",
  "headline": "Arizona Attorney General Warns of Scams During Tax Season",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/16/arizona-attorney-general-warns-of-scams-during-tax-season/?utm_source=rss&utm_medium=rss&utm_campaign=arizona-attorney-general-warns-of-scams-during-tax-season",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Conner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Consumers should know the government is never going to call you, asking for money.”\nOften, scammers will pose as the Internal Revenue Service (IRS) via unsolicited phone calls or emails.",
    "If you receive a call from someone who claims to be with the IRS or Arizona Department of Revenue (ADOR), follow these tips:\nThe IRS and ADOR always initiate communications via U.S. Mail.",
    "Arizona Attorney General Brnovich offers these additional tips:\nNever give any personal information to someone you don’t know who calls or emails you and offers to help with your taxes.",
    "In some situations, the scam artists will leave a voicemail with a return phone number, which is most likely a “spoofed” phone number to give the appearance of being legitimate.",
    "Watch out for services claiming to eliminate your debt with the IRS for “cents on the dollar.” Many of these companies charge high fees and rarely obtain the promised results.",
    "“It’s sad, but crooks and con artists will say and do anything to rip you off, even stooping so low as to pretend to be with the IRS,” said Attorney General Mark Brnovich.",
    "Consumers can go directly to the IRS website to check their status at www.irs.gov and click the icon “Where’s My Refund” to check the status of an anticipated refund.",
    "With the April 18th income tax deadline approaching, Arizona Attorney General Mark Brnovich is urging Arizona consumers to be aware of potential tax-related scams.",
    "If you enter into an agreement with a tax preparation service, be sure to get a copy of the signed contract and other paperwork before you leave the business.",
    "Never provide any bank account information, credit card information, or other personal or financial information to a person or company that you do not know.",
    "If you receive a supposed IRS or ADOR call without previously receiving something in the mail from that entity, hang up the phone.",
    "Be cautious of companies or individuals who contact you and claim that they can check on the status of your tax refund for a fee.",
    "Call and report the incident to the Treasury Inspector General for Tax Administration at 1(800)-366-4484 or at www.tigta.gov.",
    "They may make calls to consumers telling them that if they do not provide immediate payment, the IRS will take legal action.",
    "Never pay someone demanding payment over the telephone, especially with a pre-paid debit card or wire transfer.",
    "If you think you have been a victim of a tax scam, Attorney General Brnovich wants to hear from you.",
    "If a caller said they were from ADOR, call and report the incident to ADOR at (602) 255-3381.",
    "If it is a scam, once the money has been sent, it is very difficult to get your money back.",
    "For more information on tax scams, contact the Attorney General’s Office at (602) 542-5025.",
    "They can give consumers cash quickly but may have high fees and interest rates.",
    "Please call (602) 542- 5763 or visit https://www.azag.gov/complaints/consumer.",
    "The scam artists may even provide fake IRS employee identification numbers.",
    "If you are concerned that you owe back taxes, contact the IRS directly.",
    "Contact information can be found at 1(800)-829-1040 or at www.irs.gov.",
    "These types of refunds are also known as Refund Anticipation Loans.",
    "Think twice before you choose an “instant” or “rapid” refund."
  ]
}