{
  "id": 7390,
  "mediaId": 2573,
  "date": "2022-04-04",
  "headline": "Republican states sue to stop Biden admin’s lifting of Title 42 border policy",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1358087851.jpg",
  "link": "https://www.foxnews.com/politics/republican-states-sue-biden-title-42-lift",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2765,
    3401,
    4905,
    4873,
    1126,
    392,
    6678
  ],
  "sentences": [
    "\"After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,\" the Centers for Disease Control and Prevention announced in a statement.",
    "The Republican states’ lawsuit argues that the Biden administration’s ending of Title 42 is not only bad policy, but is in breach of the notice-and-comment requirements set out in the Administrative Procedure Act (APA) and is \"arbitrary and capricious\" -- grounds under which other immigration policies have been struck down.",
    "They cite \"increased health care costs for aliens infected with COVID-19 and the cost of increased illegal immigration caused by the Termination Order, and the presence of much greater numbers of paroled aliens with non-meritorious asylum claims who were induced to enter the United States because of the Termination Order.\"",
    "FIRST ON FOX: Three Republican states on Monday announced they have filed a lawsuit to stop the Biden administration’s lifting of the Title 42 public health order that has been used to expel a majority of migrants at the southern border -- arguing that it was done unlawfully and will have a devastating impact on states.",
    "The attorneys general of Arizona, Louisiana and Missouri are suing over the move to end Title 42, which was implemented by the Trump administration in March 2020 in response to the COVID-19 pandemic and allows for the rapid expulsion of migrants at the border, on May 23.",
    "\"We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,\" Arizona Attorney General Mark Brnovich said Monday morning on \"FOX & Friends.\"",
    "\"This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this administration’s disastrous border policies from devolving into an unmitigated catastrophe,\" the complaint read.",
    "\"We are doing everything we can to prepare for this increase, ensure we continue to process people humanely and impose consequences on those who break the law,\" Customs and Border Protection Commissioner Chris Magnus responded Monday.",
    "MCCARTHY: BIDEN ‘ABDICATED HIS RESPONSIBILITIES AT OUR BORDER’ WITH TITLE 42 REPEAL\nThe Biden administration announced on Friday that it will be terminating the order, despite fears of a massive migrant wave in the coming months.",
    "DHS Secretary Alejandro Mayorkas on Friday claimed that DHS has \"put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border.\"",
    "Last year, the Biden administration was ordered to restore the Trump-era Remain-in-Mexico policy, after a judge ruled that the administration had ended the policy unlawfully.",
    "\"While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,\" Brnovich said in a statement.",
    "\"We are increasing our capacity to process new arrivals, evaluate asylum requests, and quickly remove those who do not qualify for protection,\" he said in a statement.",
    "Arizona recently secured a preliminary injunction that partially blocked the use of the administration’s narrowed Immigration and Customs Enforcement (ICE) guidance.",
    "Activists and left-wing Democrats have been calling for the Biden administration to end the order for months, claiming it is cruel and denied migrants due process.",
    "This includes the increased use of technology, on-ground monitoring, use of drones and additional support personnel\" to aid Border Patrol agents, he added.",
    "This administration’s reckless pandering to the far Left and complete abdication of its responsibility to public safety cannot be allowed to continue.\"",
    "The lawsuit, filed in a U.S. District Court in Louisiana, claims that the administration failed to estimate or account for the costs to the states.",
    "Over the next two months, we are putting in place additional, appropriate COVID-19 protocols, including ramping up our vaccination program.\"",
    "\"We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border.",
    "\"I'm doing everything I can to hold the Biden administration accountable and stop them from destroying our southern border.\"",
    "\"It’s a ridiculously poor decision with a bad intention for border states and American communities across the country.",
    "But Republicans, along with some Democrats, have warned that it will lead to even bigger numbers at the border.",
    "It marks the latest legal pushback by Republican states in the courts to the Biden administration’s policies.",
    "In February, 55% of the more than 164,000 migrants encountered at the border were expelled under the order.",
    "The administration has conceded as much, saying that it will lead to an \"influx\" of migrants.",
    "\"At the same time, we will continue to use all available resources to secure our borders.",
    "A CDC spokesperson told Fox News that it does not comment on pending litigation.",
    "We are referring smugglers and certain border crossers for criminal prosecution.",
    "Fox News' Ashley Cozzolino contributed to this report."
  ]
}