{
  "id": 7801,
  "mediaId": 2520,
  "date": "2022-04-07",
  "headline": "Executing mentally ill Arizona death row inmate Clarence Dixon is, itself, insane",
  "image": "https://www.gannett-cdn.com/presto/2020/01/27/PPHX/aab06080-cd79-42ae-9582-deee0a6b088d-038977.jpg?crop=479,270,x0,y120&width=479&height=270&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/04/07/clarence-dixon-mentally-ill-arizona-death-row-inmate-execution/9493768002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    4605,
    3401,
    2526,
    103,
    5949
  ],
  "sentences": [
    "Dixon’s attorney Jennifer Moreno issued a statement saying in part, “The execution of Mr. Dixon – a severely mentally ill, visually disabled, and physically frail member of the Navajo Nation – is unconscionable.”\nThe way we determine if the punishment fits the crime – and the criminal – is meant to be carefully considered, balanced, deliberate, circumspect, reasoned.",
    "When the Arizona Supreme Court issued the warrant of execution for Dixon, Arizona Attorney General Mark Brnovich issued a statement reading in part, “I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment.”\nActually, we know that is not true.",
    "She ruled Dixon “not guilty by reason of insanity.”\nProsecutors should have followed up on that by immediately commencing civil commitment proceedings for Dixon, which O’Connor wanted, but that didn’t happen and Dixon simply was released from a state hospital.",
    "In 2002 the U.S. Supreme Court ruled that executing individuals with intellectual disabilities violated the Eighth Amendment prohibition against cruel and unusual punishment.",
    "The murder shouldn't have happened\nJust two days before Bowdoin was murdered Dixon was in court facing charges that he’d attacked another woman.",
    "He then fired his court appointed attorneys over some delusional beliefs about the evidence against him and was permitted to represent himself.",
    "When dispensing justice to someone who committed what Brnovich calls the “ultimate crime,” we shouldn’t sink to the level of the killer.",
    "There are two things we know for sure about death row inmate Clarence Dixon, whom the state of Arizona hopes to execute in May.",
    "We reserve the death penalty for the worst of the worst, knowing that execution leaves no room for errors.",
    "The fact is that hardly any of those who commit the ultimate crime receive the ultimate punishment.",
    "Dixon received the death penalty for the murder of Arizona State University student Deana Bowdoin.",
    "Opinion: Punishment is meant be carefully considered, balanced, deliberate, circumspect, reasoned.",
    "The Superior Court judge hearing the case was eventual Supreme Court Justice Sandra Day O’Connor.",
    "Whether it’s legal or not we know that killing a mentally ill person is, in and of itself, crazy.",
    "There was a long and ugly history of abuse during Dixon’s upbringing on the Navajo reservation.",
    "The kind of stuff that best serves as an explanation, but not as an excuse.",
    "Given his mental health, winding up on death row was a foregone conclusion.",
    "So Dixon, in his 60s, blind and with other ailments, can be executed.",
    "He was linked to Bowdoin’s murder years later by DNA evidence.",
    "A lovely young woman with a bright future, murdered at 21.",
    "So it’s not a matter of could we, but should we?",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "But, somehow, a mental health loophole remains.",
    "First, he is a stone-cold rapist and murderer.",
    "Do we rise above or sink to a killer's level?",
    "The ultimate penalty for the ultimate crime?",
    "For more opinions content, please subscribe.",
    "Executing Dixon is just the opposite.",
    "Second, he is seriously mentally ill.",
    "This is none of those things.",
    "And errors have been made.",
    "It’s acting like … him.",
    "And for good reason."
  ]
}