{
  "id": 8742,
  "mediaId": 8347,
  "date": "2022-04-05",
  "headline": "AG Brnovich announces first execution warrant issued across Arizona in eight years",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/eee325a/2147483647/strip/true/crop/1862x978+0+229/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F61%2Fe0%2F4c9183e44c9ca34ed1631c4a6874%2Fscreen-shot-2020-02-12-at-5.20.26%20PM.png",
  "link": "https://www.kgun9.com/news/state/ag-brnovich-announces-first-execution-warrant-issued-across-arizona-in-eight-years",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb J. Fernández",
  "authorUrl": "https://www.kgun9.com/caleb-fernandez",
  "termIds": [
    3401,
    104,
    6667,
    6649,
    5949
  ],
  "sentences": [
    "After earning his bachelor's degree from Pennsylvania State University in Advertising/Public Relations, Caleb went straight to New York City where he learned the necessities of production assistance, photography and art direction.",
    "A jury found him guilty in 2020 and sentenced Dixon to death\nSince the victim was murdered before November 23, 1992, he can choose either lethal injection or gas.",
    "Share your story ideas and important issues with Caleb by emailing caleb.fernandez@kgun9.com or by connecting on LinkedIn, Instagram, and Twitter.",
    "TUCSON, Ariz. (KGUN) — Attorney General (AG) Mark Brnovich has announced the first execution warrant issued across Arizona in eight years.",
    "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,\" shared Brnovich.",
    "Born and raised in Southern California, Caleb has always had an affinity for creative collaborations.",
    "Police originally didn't find Dixon until 20 years later when a Tempe detective re-opened the case.",
    "\"I will continue to fight every day for justice for victims, their families, and our communities.\"",
    "An Arizona court indicted him in the 1978 rape and murder of 21-year-old Deana Bowdoin.",
    "——-\nCaleb Fernández is a digital content producer for KGUN 9.",
    "The Arizona Supreme Court has issued it for Clarence Dixon.",
    "Dixon's execution is set for Tuesday, May 10."
  ]
}