{
  "id": 9046,
  "mediaId": 2618,
  "date": "2022-03-21",
  "headline": "Lara Logan goes off in epic rant on Ukraine, citing ‘fake NGOs,’ Vindman, Hunter Biden, Romney’s son",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/21/lara_logan_goes_off_in_epic_rant_on_ukraine_citing_fake_ngos_vindman_hunter_biden_romneys_son_81697.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "",
  "termIds": [
    5702,
    5583,
    4104,
    3858,
    2957,
    3246,
    6177,
    6672
  ],
  "sentences": [
    "WE all know there's more going on here than meets the eye...but...do I believe that the nazis are in control...a little hard to understand...my heart and mind is with the Ukrainians and their plight...the new world order is not coming to America...because WE woke up...and WE know china and Russia are in cahoots and fighting off soros and his army of socialists...the fact that the politicians in Washington DC are playing this world domination game is not a surprise,...I recall President Trump telling US the swamp is worse than he had expected..and the torture he and his family had to endure and is still enduring makes sense...he stopped the world order dudes and they had to get rid of him...fortunately President Trump played them like a violin...but china stepped in with the virus and set US back a bit...yes...I really believe that china did it on purpose...\nGlad to see everyone is at each other's throat.",
    "A super pro-Israel President brings peace to the middle-east PLUS shuts down North Korea/China/Russia/ISIS, and STOPS the war machine in Washington D.C. TWICE Impeached is fair indication that Trump kept his finger on a raw nerve of the Davos Globalist Elite and their 'poodles' in US/EU governments, while in Office.",
    "For instance since our US left of today use \"diversity\" as a tactic to create fear or shame for appearing to associate as you see fit based on irrelevant racial characteristics, despite any legitimate concerns for a lack of common values and willingness to live by a common set of rules.",
    "Yet today's American left are creating the exact same big government with an appearance of private ownership of the means of production but with a complex web of government control rendering the status of \"ownership\" questionable at best.",
    "I predict that all the above suspects will choose to see the historic capital area of Kiev destroyed ten times over by a hundred hypersonic missiles rather than one shred of truth come to light for the world to see.",
    "That its people are cannon fodder in some “great game.” Bidet and many others in our government are conflicted until they publicly explain their connections to Ukraine and why they were taking money out of it.",
    "I’m late to the party but it seems like this would be a good time to post the following quote, which is attributed to George Orwell… In a time of universal deceit, telling the truth is a revolutionary act.",
    "under the cover of some economic aid, or \"humanitarian\" initiative are going to be exposed because the CIA can't control the information, it will be the Russians who will, once they capture it in Kiev.",
    "You know our elites who have business dealings there have an agenda and that is to keep that under wraps and the fact that the Biden’s are neck deep in corruption there has to influence his response.",
    "With regards to the logos on soldier's uniforms --- it just might be a nod to the past and a show of respect to some deceased relatives and not necessarily a vote of \"support\" for what they did.",
    "Ukraine is the most corrupt country in Europe, and Vindman, Chalupa, Soros and Nuland got US into a new war that is not in our National Interest and we cannot afford after our military defeats.",
    "The US MSM are all in on proclaiming Ukraine as the good guys to protect Pelosi's,Kerry's, Biden's snd Romney's sons as well as others involved with the corruption such as Nuland and Vindman.",
    "Lara Logan has more than enough on the ground experience to authoritatively speak her mind on official and political corruption in foreign lands and the USA getting involved in foreign wars.",
    "But to bring up a straw man about the actions of some Ukrainians 80 years ago, in order to smear the Ukrainians, who elected a Jewish leader, as some type of Nazis, is just bonkers.",
    "Can we claim moral superiority now over Ukrainians who 80 years ago made a different decision to ally with the devil they didn't know to try to defeat the devil they knew?",
    "You’ll recall she became inches from losing her life reporting in the Middle East somewhere when she was attacked, violated numerous times, and beat unconscious.",
    "She does not pull her punches, play it safe, or dumb down her comments out of any concern about political correctness or offending her viewers or listeners.",
    "But wait, our involvement is not about Ukriane, it is to reset the world for the \"New World Order\" and the only way to that is to destroy Russia and China.",
    "Re: the Ukraine/Hitler connection: No doubt true, there were a lot of 'nastis' , but considering their alternative, we've got to cut them a lot of slack.",
    "They are tied to a pole or tree, wrapped in plastic wrap so they can't move, their pants are dropped to the ground and they are beaten on their buttocks.",
    "The United States engaged in the worst type of imperialism against Mexico, and later, the Spanish possessions of Cuba, the Philippines, and Puerto Rico.",
    "The everyday Ukrainians deserve to live in peace and I hope this turns into a quagmire for Russia and everyday they have targets on their backs.",
    "I guess if they threw in with Stalin ... and the Red Russians who killed their parents after 1917's revolution ... everything would be Jake now.",
    "This US support is not surprising, because whoever is running Biden and his administration appears to be in agreement with WEF and Klaus Schwab.",
    "Vindman and his pal, Adam Schiff, acted as un-American as any foreigners in their hatred of Donald Trump and their fanatical efforts to get him.",
    "Unfortunately even generations away we grab on to the same propaganda and focus on the tactics used while missing the larger history lesson.",
    "There are so many narratives out there in the media, I am having a hard time sorting them all out which I believe is also part of the plan.",
    "I agree with #6's reflection the parallel between the US supporting one despot in a war between despots where Ukraine supported the other.",
    "Lara is right about Doughboy Vindman and other connected people in our government making illegal money from Ukraine and other countries.",
    "I like Lara Logan, and I usually appreciate her willingness to speak openly about many issues that others would just as well cover up.",
    "All these crazy inconsistent statements are clarified - Ukraine has been attracting sleazy, money-grabbing cheats like flies to honey.",
    "Yes, there were Ukrainians collaborating with Nazis against the Soviets, on the reasoning that \"the enemy of my enemy is my friend\".",
    "The Bible is very clear (paraphrasing), \"Your sins shall seek you out\" and \"You will fall into your own trap you build for another.\"",
    "When the Globalist Ultra-Left went after Donald Trump to utterly destroy him they made a HUGE mistake... they messed with God's man.",
    "There is only a handful of true journalists today; Lara Logan, Emerald Robinson, Sundance, Sharyl Atkinson, maybe Tucker & Gutfeld.",
    "I get it that the Ukrainian government is not exactly on the up-and-up and they picked the wrong devil's side to support in WWII.",
    "Jews are still being mistreated by Nazi-like people around the world but people seem to forget about their worst abuser, Muslims.",
    "That the U.S. chose a different \"lesser\" of the two evils of Nazi Germany and Soviet Russia is not necessarily to its credit.",
    "However, there's a common flaw in the conclusion that there must not be a vein of Nazism in Ukraine since they elected a Jew.",
    "She's a breath of fresh air, which is far too rare, especially because of pervasive threats of knee jerk cancel culture.",
    "By that reasoning, how does Lara Logan, ex-resident of the white supremacist apartheid state of South Africa, get a say?",
    "Laura Logan just gave the best synopsis of the situation and yes, it is Nazis redo in 2022 also Soviet rebirth by Putin.",
    "The dimokkkrap party was the pro slavery party, founded the kkk and used jim crowe laws to create institutional racism.",
    "What you can take to the bank is that these greedy corrupt politicians will do whatever it takes to protect themselves.",
    "None of us should be judged collectively by the actions of prior generations or the countries from which we originate.",
    "With a then recent history of Soviet genocide against the Ukraine, it is understandable, even if not morally correct.",
    "Lara Logan is the closest we have to someone who digs deeps and practices real journalism and I tend to believe her.",
    "The people of Ukraine have been abused by their government (if not why have so many left prior to Russia invading?)",
    "I knew about Biden, Kerry and Pelosi boys enriching themselves off Ukraine, but Romney´s Mormon son was news to me.",
    "I can hardly watch my favorite show, “The Five” without a full blown media narrative of Russia evil, Ukraine good.",
    "I have seen enough and read enough outside of lara logan to conclude that Ukraine is misrepresented in the media.",
    "To call someone a dimocrat today has a different meaning- perhaps like neo nazis they hide their ultimate plans.",
    "I learned a long time ago that the people of a country do not always reflect the \"government\" of that country.",
    "This is not to say that all Ukraines believe in nazism but the government is influenced by neo-nazi ideology.",
    "I told my friends who will listen that the war in the Ukraine is the Nazis fighting the Soviets nothing else.",
    "Like most reasonable Americans I will not be an apologist for evil regardless of its resent or past history.",
    "Ukraine is a hot bed of corruption tied to many of our leaders in this country and others around the world.",
    "It is obvious that even the conservative media have bought into the whole ‘save Ukraine’s democracy’ hype.",
    "Not only because she's easy on the eyes and that killer accent but she's fearless and doesn't mince words.",
    "Can anyone really blame them from siding with Germany, after Stalin nearly starved the country to death?",
    "All the under the table deals done by Clinton, Obama, Biden, Kerry, Pelosi, McCain, Graham, Schiff, etc.",
    "The neocons have us all exercised over a corrupt s**thole where we have no real interest whatsoever.",
    "There are Americans who were feeding off this financially and are now trying to avoid being exposed.",
    "All totalitarian despots use some form of fear tactic to herd you into the prison of their control.",
    "But God will not be mocked and as Scripture also makes clear, \"Vengeance is mine sayeth the Lord.\"",
    "Yes, they tie up Russian-speaking people to lamp posts and torture them (Juan Sinmiedo, Twitter).",
    "Yesterday I saw a video that showed me how people in Ukraine are controlled - by other Ukranians.",
    "Kind of like wearing the Stars and Bars on your own jacket or displaying it on your car or truck.",
    "The point is that the mistakes of prior generations cannot be applied to the people of today.",
    "It may be inactive, but it is there bubbling just beneath the surface waiting to be revived.",
    "They are all about control and how they get there is secondary, just like Hitler and Stalin.",
    "Ukraine would have to undergo a disarmament process to ensure it wasn't a threat to Russia.",
    "#6, if you haven'tmseen it, which I doubt you have, watch Oliver Stone's \"Ukraine On Fire.\"",
    "She is fearless and am I am sure she is ready for the incoming that is surely going to hit.",
    "Explains Romney’s behavior, highlights Joe’s greediness and his years long quest for power.",
    "I’m going to guess that few people knew they were wearing nazi symbols on their uniforms.",
    "Maybe she can take Ingraham's or Hannity's time slot as those two have become tiresome.",
    "Zelensky wants to drag us and NATO into it to save his bacon which will bring on WWIII.",
    "Any legitimate investigation will show that she is about 95% correct with her comments.",
    "What did Matt Lauer say, “I make more money than G-d!”\nGreatest journalist of our time?",
    "Groups use them for great effect especially governments, armies, law enforcement, etc.",
    "The peace negotiations: \"Ukraine should be neutral and should not apply to join Nato.",
    "The sins of the father should never be visited on the son ... a wise man once wrote.",
    "I would like to know what these Ukrainian nazis are doing that makes them dangerous.",
    "Therefore, I reject the idea that the symbols used by Ukrainian forces mean nothing.",
    "Their choice of what to leverage to drive that fear does not define their end goal.",
    "I posted this to my FB page and evidently no one watched as there were no comments.",
    "I would believe Lara Logan before I would believe any others reporting on this war.",
    "If we're going to dredge up old history, then why are we cooperating with Germany?",
    "Our left is more fascist than socialist yet they claim to be all about diversity.",
    "That kind of evil somehow manages to remain the hearts and minds of some people.",
    "The only sure thing I know is that the Ukrainian people did not deserve this.",
    "So should Ukraine be punished for something that happened over 75 years ago?",
    "These media personalities are addicted to the camera and the huge salaries.",
    "For eight long years Azov bombarded Donetsk civilians with our blessing.",
    "I expected to be put in FB Hell because of the posting but haven't yet.",
    "There would have to be protection for the Russian language in Ukraine.",
    "We sacrificed Eastern Europe to the Soviets in order to defeat Hitler.",
    "Our country is implicated in the globalist's cesspool in Ukraine.",
    "Just because Naziism was defeated does not mean it was wiped out.",
    "I don’t know what it means to say in 2022 that someone is a nazi.",
    "It is that they are the victims of the evil going on over there.",
    "Whoever it is that is driving our policy has lost credibility.",
    "They suffer while the elites jockey for positions in the NWO.",
    "Doesn't mean you support slavery or that you are a racist.",
    "Lara Logan is one of the only journalists I'll listen too.",
    "Ukraine was also caught between the Nazis and the Soviets.",
    "All of a sudden they are okay because we need their oil.",
    "Most aren’t beholding to the corporate media oligarchs.",
    "However, I want and need all the information I can get.",
    "but we have no business getting entangled in this war.",
    "Logan’s point was not that Ukrainian people are evil.",
    "America is supporting a neo-Nazi influenced regime.",
    "There is much more to this than we have been told.",
    "As above poster said, this little gal is fearless.",
    "Hitler used the opposite tactic of racial purity.",
    "These are the kind of people drawn to the occult.",
    "May they know not a minute of peace while there.",
    "And there is something called de-Nazification.\"",
    "Soros is all in for Ukraine, so I research why.",
    "Does that invalidate anything we may do today.",
    "(Not as if there was any of THAT going on now.",
    "In fact, they can have significant influence.",
    "The imagery that was mentioned is disturbing.",
    "The Azov battalion is indeed formed by Nazis.",
    "There are no white hats left in this world.",
    "Lara Logan is a hero for telling the truth.",
    "For goodness sake ... we sided with Stalin!",
    "In other words she isn't a woke PC shill.",
    "Ukraine is not a democracy and never was.",
    "Lara Logan is much more than trustworthy.",
    "By people who are likely now all dead?",
    "I know when the media is gaslighting.",
    "It is commonly used in name calling.",
    "It is a highly corrupt dictatorship.",
    "Its President may be playing a roll.",
    "I don’t know, but it is disturbing.",
    "I mean, they were the actual Nazis.",
    "She needs her own show on Fox News.",
    "And regular people suffer for it.",
    "Is it intimidation or admiration?",
    "She always tells it like it is.",
    "Lara Logan is spot on correct.",
    "Collective communal menticide.",
    "All part of the elites' plan.",
    "Certainly a top contender!",
    "Including older children.",
    "Ms. Logan speaks truth.",
    "Symbols mean something.",
    "They are merely pawns.",
    "Excellent commentary.",
    "Mariupol will fall.",
    "Remember Finland?",
    "God bless them.",
    "I don’t know.",
    "Like racist.",
    "Brilliant.",
    "Finally!",
    "/s)."
  ]
}