{
  "id": 913,
  "mediaId": 8475,
  "date": "2022-02-14",
  "headline": "Arizona AG Brnovich’s radical, lawless border war opinion normalizes extremism - sets stage for violence",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021422_brnovich-media-gs.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/opinion/report/021422_brnovich_border_op/arizona-ag-brnovichs-radical-lawless-border-war-opinion-normalizes-extremism-sets-stage-violence/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Small",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/37438",
  "termIds": [
    3401,
    2915,
    5949,
    6667
  ],
  "sentences": [
    "The U.S. Constitution delegates war powers to the federal government and Congress — but one provision says that a state can “engage in War” if it is “actually invaded.” But that doesn’t mean a foreign nation has to be doing the invading, Brnovich concluded: that word can be triggered by basically any unwanted non-state actors, including criminal gangs, drug-smugglers and human-traffickers.",
    "While Ducey has given no indication that he’s taking the opinion seriously or will be goaded into testing the constitutional limits of a state’s war-making power, the Republicans vying to replace him are tripping all over themselves to claim that they’re the toughest on the border and they’ll launch a violent and unconstitutional assault.",
    "“He’s not an unreasonable person, but he’s been taking some wild positions lately.”\nAnd by laundering extremism through the Arizona Attorney General’s Office in order to boost his profile in a naked bid to appear to GOP voters in this year’s U.S. Senate primary, Brnovich has shifted the parameters of the debate around border security.",
    "“This is one of the most dramatic claims for state’s rights since the Civil War.”\nThe top attorney in the state, who was elected to uphold the law and constitution, took a fringe position espoused by nativists, xenophobes and extremists — like Neo-Nazi border vigilante and murderer J.T.",
    "If (or when, if you’re a pessimist) this notion becomes standard fare for an increasingly extreme GOP, it’s not hard to conjure up a scenario where a governor decides to use his or her private army to do something that puts it in conflict with another state — or the Pentagon.",
    "That will not be in Arizona.”\nThat someone at the top of the legal establishment in Arizona is willing to use the state’s reputation to push arguments that Green said “are so unconnected to basic principles of constitutional law” is a frightening prospect.",
    "That’s what makes this trend of governors clamoring to use military force to do things that have historically been the job of the federal government so disturbing, University of Texas law professor and constitutional scholar Steve Vladeck told me.",
    "One goal of far-right extremists in recent years has been to repeatedly propose continually more extreme policies — and to find elected officials to back them — in the hopes of shifting the acceptable solutions further to the right.",
    "“This is really destructive and radical and threatens very basic principles of federal constitutional law,” Temple University law professor Craig Green, an expert in constitutional law and American legal history, told me this week.",
    "Opinion\nGuest opinion\nIt’s impossible to overstate just how lawless and dangerous Arizona Attorney General Mark Brnovich showed himself to be this month when he issued a flagrantly political legal opinion that all but dares Gov.",
    "The opinion is “a game-changer” for governors, said a spokesman for GOP candidate Karrin Taylor Robson, who said it will allow her (or whoever wins) to use soldiers “in as active a capacity as possible” along the border.",
    "“I think it will further normalize the deeply troubling and disturbing notion that states can take it upon themselves to set their own immigration policy and to enforce that policy, by force if necessary.”\n- 30 -",
    "“That line between what’s reliable and fringe is already threatened, and this opinion risks blurring that line further.”\nYou don’t have to look any further than the 2022 governor’s race to see that happening.",
    "“We just don’t want a scenario in which there’s the specter of troops from different states, or state and federal troops, at cross-purposes with each other,” he said.",
    "Doug Ducey to declare a literal war and send troops to the border to engage in firefights with drug cartels, human smugglers and whoever else they might encounter.",
    "“Ever since the Declaration of Independence, a core idea of the United States is that the United States would handle war and diplomacy, not the individual states.",
    "America is already divided and the political extremes are gaining more influence, eroding people’s trust and belief in what’s reliable and what’s not.",
    "Political scientists call that shifting the Overton window — basically, changing the range of ideas the public is willing to consider and accept.",
    "Every time that happens, ideas once outside the window because they were deemed too extreme become part of the political discourse.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "There’s an all-too-real fear that this will lead to actual violence — and not just along the southern border.",
    "I think that’s why he’s doing this,” said Paul Bender, an Arizona State University law professor.",
    "That idea is codified in the constitution, in the same clause we’re talking about,” he said.",
    "“It simply cannot be that a state cannot declare war on Britain or the Taliban or a cartel.",
    "“And yet, opinions like these only increase the odds of that happening.",
    "Ready — and lent it the credibility and respectability of his office.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Tell your friends to follow us on Facebook and Twitter.",
    "“The political consequences are serious,” he told me.",
    "Support TucsonSentinel.com with a contribution today!",
    "We’re watching Brnovich do that in real-time.",
    "It’s constitutional hogwash, Green said.",
    "Thanks for reading TucsonSentinel.com.",
    "“He wants to be senator.",
    "Why?"
  ]
}