{
  "id": 9215,
  "mediaId": 2520,
  "date": "2022-03-22",
  "headline": "Another Senate subpoena for 2020 election records? Seriously, will it ever end?",
  "image": "https://www.gannett-cdn.com/presto/2021/08/13/PPHX/8af9a6f1-386e-4860-89e0-d59393c5c844-cent02-7h316z6zllj4krq4837_original.jpg?crop=4499,2531,x0,y229&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/03/22/another-arizona-senate-election-subpoena-maricopa-county-voters/7131695001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is surprising because the County has not released this protected voter information to any organization other than the Arizona Senate following subpoenas in 2021; and the Senator is using the discredited work of Ayyadurai as a basis for this new subpoena.”\nBrnovich, apparently still holding out hope for a Trump endorsement of his Senate campaign, is investigating Ayyadurai's latest bombshell (or dud, depending upon the way you see it).",
    "“This subpoena serves as an effort to place into permanent record the testimony from the Maricopa County Board of Supervisors the legal reasoning for the delay in their production of the requested documents by the Attorney General’s office, and to seek answers as to what further plans the Board of Supervisors has regarding cooperation with the investigation,” she said on Tuesday.",
    "“The inability of Maricopa County election officials and their loyal scribe (the Arizona Mirror’s Jeremy Duda) to keep in line a dark-skinned East Indian-American who dares to use his hard-earned scientific and engineering training and intelligence, is the source of this real racism,” he wrote, in a reply to the dismissal of his findings.",
    "“In addition, the Elections Department answered all the questions from AG investigators and provided in-depth tours of Election facilities.”\nArizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Sen. Kelly Townsend, R-Apache Junction, on Monday issued a subpoena to the Maricopa County Board of Supervisors, based upon a recent analysis of early ballots by a so-called expert whose work on the election audit ranged from questionable to downright rolling-around-on-the-floor laughable.",
    "Undeterred, Townsend is now demanding that county officials turn over all manner of documents – including the files on more than 2,000 Maricopa County voters – to her committee and to the Attorney General’s Office, which requested the files earlier this month.",
    "There's no statute of limitations on desperation\nOn March 9, Brnovich’s Elections Integrity Unit demanded that the county turn over the files of those more than 2,000 voters, including their signatures and anything in their files related to the 2020 election.",
    "His latest report only sort of reviewed signatures\nInstead, he says he and his team compared more than 2,000 early ballot signatures to signatures he found on publicly available documents and concluded that more than 250 of them didn’t match.",
    "Supervisors Chairman Bill Gates seemed astounded that Townsend and Attorney General Mark Brnovich would give any credibility to the findings of Shiva Ayyadurai, whose work on the election audit was thoroughly debunked.",
    "“Senator Townsend’s subpoena specifically references a ‘study’ conducted by Shiva Ayyadurai that points to voter signatures and ballot envelopes which are not public record,” Gates said on Tuesday.",
    "His report was laughably inaccurate\nHe did not disappoint, producing a report last fall that was full of wildly inaccurate conclusions that fraud may have been afoot in Maricopa County’s election.",
    "The fact that he reached this conclusion without actually seeing the voters’ signatures in the county’s voter registration files – the ones used to authenticate ballots – is rather remarkable.",
    "“As of the first week in February, Maricopa County had produced more than 4,400 documents and five detailed PowerPoint slide decks to the Attorney General’s Office,” Gates said on Tuesday.",
    "Of course, we don’t know whether those publicly available documents were really signed by the voters in question (given Ayyadurai’s history on this thing, it’s a legitimate concern).",
    "Break out another Senate subpoena, the bloodhounds over the Arizona Senate continue their hunt for all that as-yet undiscovered evidence that Arizona’s 2020 election was stolen.",
    "Ayyadurai was hired by Senate President Karen Fann in the waning weeks of the audit, paid $50,000 to review digital images of the county’s 1.9 million early ballot envelopes.",
    "Clearly, he was the obvious choice for an unbiased review, given his claims to have invented email and his promotion of conspiracy theories that the 2020 election was rigged.",
    "Unfortunately for the conspiracy chasers, the only thing his report proved was his total lack of understanding of election procedures used to verify early ballot signatures.",
    "Opinion: The Arizona Senate is once again hot on the trail of elections records, determined as ever to find that oh-so-elusive proof that Donald Trump was robbed.",
    "Investigators also renewed a request for other documents setting out early voting policies and procedures, claiming it’s the third time they’ve asked.",
    "Now, Ayyadurai is back with a new study, claiming that more than 200,000 early ballot signatures did not match the actual voters’ signatures.",
    "But his llatest conclusion that funnybusiness may be afoot was apparently enough for Senate candidate Brnovich to launch an investigation.",
    "Gates said the latest request arrived less than two weeks ago, while the county was busy running the Tempe City Council Election.",
    "So naturally, that must mean that 215,000 of the county’s 1.9 million early ballots have mismatched signatures, he concluded.",
    "And for Fann to make that investigation public, released a copy of the AG’s latest records request over the weekend.",
    "“Looks like Maricopa BOS doesn’t want to comply with AG’s request for documents,” she tweeted on Sunday.",
    "When county officials debunked his claims, point by point, his response was to accuse them of racism.",
    "After eight lawsuits, several audits, millions of dollars wasted and still no proof of voter fraud.",
    "Sadly, there is no statute of limitations on wishful thinking or political desperation.",
    "And we don’t know how long ago those publicly available documents were signed.",
    "Experts will tell you that a person’s signature changes over time.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "The records will be provided, he said, as required by law.",
    "Call me skeptical, given Ayyadurai’s track record.",
    "Why are they listening to Shiva Ayyadurai?",
    "This, fully 16 months after the election.",
    "(Do you see me now, President Trump?)",
    "The county says that’s not true.",
    "Maybe you remember this guy.",
    "“What are they hiding now?",
    "Will it ever end?"
  ]
}