{
  "id": 11453,
  "mediaId": 2890,
  "date": "2022-03-16",
  "headline": "The free speech search engine that never was",
  "image": "https://cdn.vox-cdn.com/thumbor/tKLVRFtTdTnAr33ZZxcJQxR84dE=/0x113:2004x1162/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320998/GettyImages_156014359.jpg",
  "link": "https://www.vox.com/recode/22981115/duckduckgo-free-speech-privacy-oops",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sara Morrison",
  "authorUrl": "https://www.vox.com/authors/sara-morrison",
  "termIds": [
    0
  ],
  "sentences": [
    "The Federalist called DuckDuckGo a “valuable replacement tool” for Google, saying that Google “hides” conservative content, while “a more organic DuckDuckGo search turns up a variety of viewpoints and ideologies.” Joe Rogan (who may not be “right wing” himself but certainly has a sizable right-wing audience that he’s always happy to cater to) announced that he was using DuckDuckGo to find information about vaccine-related injuries, because he couldn’t find it on Google.",
    "It now promotes itself as “immune to cancel culture.” Substack, MeWe, and Telegram haven’t gone that far, but their laxer content policies had made them a home (and, in some cases, a big money-making opportunity) for controversial figures, including Alex Berenson and Graham Linehan (Substack); Laura Loomer and Milo Yiannopoulos (Telegram); and radical extremist groups (MeWe).",
    "Fox News noted back in 2018 that DuckDuckGo was gaining in popularity “as Google faces questions about its practices and alleged bias against conservatives.” As recently as February 23, the New York Times pronounced DuckDuckGo to be the search engine of choice for “conspiracy theorists.”\nSo DuckDuckGo surely knew what many of its new fans were coming to it for.",
    "“Search engines by definition put relevant higher-quality sites over lower ones for every search.”\nUnlike some of the other platforms that conservatives have flocked to — Gab, GETTR, Parler, BitChute, and Locals, for instance — DuckDuckGo wasn’t created to be a right-wing Big Tech alternative, even if that became a reason why a lot of people started to use it.",
    "Weinberg’s tweet announcing the change generated thousands of comments, many of them from conservative-leaning users who were furious that the company they turned to in order to get away from perceived Big Tech censorship was now the one doing the censoring.",
    "DuckDuckGo, the search engine that markets itself as a privacy-first alternative to Google, was no different: On March 9, its CEO Gabriel Weinberg announced that it was going to down-rank sites that spread Russian disinformation.",
    "Rumble happily pivoted, getting investments from Peter Thiel, making deals with far-right or far-right-adjacent creators like Dan Bongino and Glenn Greenwald, and partnering with Trump’s upcoming social media app, TRUTH Social.",
    "By comparison, Google, by far the most-used search engine, is believed to handle trillions of search inquiries a year (Google doesn’t release its search statistics), so DuckDuckGo is still a mere fraction of the search market.",
    "Some of its now-former users are encouraging others to switch to Brave, whose crypto-friendly CEO’s politics might better align with their own, and, yes, Yandex — probably no threat of down-ranking pro-Russia content there!",
    "It’s yet another example of the impossible situation some platforms have found themselves in: By not taking a public stance against misinformation or content deemed to be harmful, DuckDuckGo was taking a stance.",
    "That’s its entire point,” Carlson’s guest that night, Arizona senate candidate and Thiel Foundation president Blake Masters chimed in, bestowing a title on DuckDuckGo that DuckDuckGo never bestowed on itself.",
    "DuckDuckGo spokesperson Kamyl Bazbaz told Recode that the decision was simply about doing what a search engine is supposed to do: ensure that users were getting the best results for their searches.",
    "This was a bit of a dodge; conservatives accused Google of intentionally keeping conservative sites and content off of its results, not just returning results influenced by a searchers’ interests.",
    "It didn’t help that the content DuckDuckGo was demoting and calling disinformation was Russian state media, whose side some in the right-wing contingent of DuckDuckGo’s users were firmly on.",
    "But this time period also corresponds with an anti-Big Tech crusade many on the right took up as they believed that they were increasingly being censored on Big Tech platforms.",
    "Sean Simmers/The Washington Post via Getty Images\nA lot of tech companies have responded to the Russian invasion of Ukraine by restricting their services in or to the country.",
    "A representative of the company told the House Committee on Energy and Commerce on March 1 that DuckDuckGo suspended its partnership with Yandex, a Russian search engine.",
    "DuckDuckGo told Recode that its search traffic “has been normal” since Weinberg’s announcement, but it might be too soon to tell if the decision does any lasting damage.",
    "While companies including Apple, Meta, Amazon, and, yes, Google, have largely been praised in the United States for pulling out of Russia, DuckDuckGo was attacked.",
    "#DuckDuckGone was then trending, and Tucker Carlson lamented that DuckDuckGo had “joined the herd.”\n“DuckDuckGo is supposed to be the free speech search engine.",
    "Weinberg told Fox News and Quartz that Google’s search results were biased because Google collects data on users, which it then uses to target results to them.",
    "Candace Owens encouraged her fans to look up George Floyd on DuckDuckGo instead of Google, which she said was hiding the full truth about his alleged drug use.",
    "Perhaps part of DuckDuckGo’s appeal to them was the privacy, but for many, the key reason was that they thought DuckDuckGo’s search results were unbiased.",
    "“Sites like RT and Sputnik that deliberately put out false information to intentionally mislead people directly cut against that purpose,” Bazbaz said.",
    "Many on the right adopted it as their pro-free-speech search engine of choice, a mission DuckDuckGo never actually had but had now, somehow, violated.",
    "Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.",
    "Instead, it doubled down on what has, for almost its entire existence, been DuckDuckGo’s only stated mission, despite what others attributed to it.",
    "Rumble, Substack, MeWe, and Telegram are all platforms that didn’t set out to cater to the right wing, only to find themselves embraced by it.",
    "In recent years, it’s expanded its privacy mission beyond search, with a mobile browser app and plans to release a desktop version soon.",
    "But then Weinberg tweeted that he was “sickened” by Russia’s actions and that DuckDuckGo was down-ranking Russian disinformation.",
    "According to DuckDuckGo’s own figures, annual search queries ballooned from 5.9 billion in 2017 to 35.3 billion last year.",
    "But it’s also the second-most used search engine in some places, and in late 2020, it raised $100 million from investors.",
    "Because DuckDuckGo didn’t collect data, its results were unbiased and searchers were free from Google’s echo chamber.",
    "DuckDuckGo didn’t respond to Recode’s question about whether or not it was surprised by the response to its decision.",
    "“Privacy is our top priority, not supporting any particular political or ideological point of view,” Bazbaz said.",
    "It’s a position some of its similarly situated peers might find themselves in, too, if they haven’t already.",
    "DuckDuckGo was accused of betraying a user base it unintentionally cultivated but didn’t exactly discourage.",
    "By 2010, it latched onto privacy as the thing to differentiate it from its competitors, Google especially.",
    "There was a growing awareness about internet privacy during those years, which must have been a factor.",
    "Our mission has never been more vital than it is in this moment: to empower through understanding.",
    "DuckDuckGo actually took action before most of its conservative fanbase realized it did.",
    "It’s just search rankings.”\nThis story was first published in the Recode newsletter.",
    "But DuckDuckGo grew slowly — until about 2018, when it started growing very quickly.",
    "It stopped tracking its users’ search histories, and privacy advocates praised it.",
    "But it was an answer that seemed to satisfy users of all political persuasions.",
    "Supposedly liberal Google was censoring supposedly conservative content.",
    "“Privacy is a human right and transcends politics,” Weinberg tweeted.",
    "That, he said, created filter bubbles that further polarized society.",
    "Right-wing publications and pundits happily pushed DuckDuckGo, too.",
    "Millions turn to Vox to understand what’s happening in the news.",
    "The response from many of its users, however, was different.",
    "But DuckDuckGo, it turns out, does not transcend politics.",
    "It doesn’t seem to have hurt any of their bottom lines.",
    "Please consider making a contribution to Vox today.",
    "Will you support Vox’s explanatory journalism?",
    "A little history: DuckDuckGo launched in 2008.",
    "Sign up here so you don’t miss the next one!",
    "In This Stream\nView all 86 stories",
    "And supposedly, DuckDuckGo wasn’t.",
    "Then came the Russian invasion.",
    "They leaned into it a bit, too.",
    "What caused this sudden rise?",
    "Will it hurt DuckDuckGo’s?",
    "“This isn’t censorship.",
    "Or any damage at all."
  ]
}