{
  "id": 12778,
  "mediaId": 2528,
  "date": "2022-02-28",
  "headline": "Republican Sen. Rick Scott's rogue plan to 'rescue' America has become a fundraising 'godsend' for Democrats as they roast the GOP about his plan to raise taxes",
  "image": "https://i.insider.com/621d4aecbea1240018a90ab9?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/rick-scott-rescue-america-plan-raise-taxes-fundraising-democrats-midterm-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warren Rojas",
  "authorUrl": "https://www.businessinsider.com/author/warren-rojas",
  "termIds": [
    0
  ],
  "sentences": [
    "\"It's pretty rich that Val Demings is feigning interest in lowering Floridians' taxes when just last fall she voted to raise taxes on Floridians and cut taxes for millionaires in blue states like New York and California,\" said Elizabeth Gregory, Rubio campaign spokeswoman, referring to the Build Back Better Act that included a provision to increase the federal deduction for state and local taxes, known as SALT.",
    "Within hours of Scott publishing his ideas, Democratic Senatorial Campaign Committee Chairman Gary Peters hung the surprise tax-hikes pitch around the necks of Republicans like incumbent Sen. Ron Johnson of Wisconsin, and Senate hopefuls Herschel Walker, who is running for office in Georgia, and Blake Masters, who is running in Arizona, in new radio and online ads.",
    "\"Marco Rubio's party boss is planning to hike taxes on Florida's working families, seniors, and veterans with the Rubio-Scott Tax Hike, and Rubio is too cowardly to reject the politicians and special interests that tell him what to do,\" Christian Slater, Demings' campaign communications director, said in a statement.",
    "Scott's agenda would lead to thousands of dollars in tax hikes for essential workers, such as meatpacking workers, grocery store cashiers, and home health aides, according to a new analysis conducted by House Ways and Means Committee Democrats that Speaker Nancy Pelosi released on Monday.",
    "Pelosi's staff also cites an analysis by the left-leaning Tax Policy Center that found under a plan such as Scott's, more than \"80 percent of the tax increase would be paid by households making about $54,000 or less, and 97 percent would be paid by those making less than about $100,000.\"",
    "The Trumpian midterm reelection plan Republican Sen. Rick Scott had hoped would electrify colleagues has instead reenergized Democrats in both chambers, sparking nationwide campaign ads, fundraising appeals, and fresh lines of attack against GOP lawmakers on the ballot this fall.",
    "\"While Republicans plan to squeeze hard working Americans with higher taxes, Democrats are moving legislation to lower everyday prices and cut taxes for middle class families — paid for by making big corporations and the wealthiest pay their fair share,\" Pelosi's staff wrote.",
    "Warren Rojas/Insider \"As the last year has shown, expanding our majority matters — 50-50 is not enough,\" Schumer, who has struggled to move much of President Joe Biden's agenda through the narrowly divided chamber, blasted out in a fundraising email on February 25.",
    "Warren Rojas/Insider\n'We must fight back'\nSenate Majority Leader Chuck Schumer, a New York Democrat seeking a fifth term in November, warned supporters that the prospect of Scott's vision coming true \"would be the end of the road for so many of our priorities.\"",
    "The campaign for Rep. Val Demings, who is running for the Democratic nomination for Senate in Florida to unseat Republican Sen. Marco Rubio, released a new ad Monday that slams the \"Rubio-Scott tax hike\" and urges Floridians to tell Rubio to \"take a hike.\"",
    "The 11-point strategy, which Scott developed on his own and unveiled February 22, takes conservative-fueled culture wars and MAGA priorities to another level — prompting fellow Republicans to characterize it as \"polarizing\" and \"silly.\"",
    "The Democratic National Committee ran ads in the retirement-heavy community The Villages, Florida, over the weekend as Scott was preparing to speak at the Conservative Political Action Conference less than 60 miles away in Orlando.",
    "Sen. Elizabeth Warren, a Democrat of Massachusetts, joined in on February 27, alerting her populist base that a Republican-controlled Senate would \"rig the rules even further in favor of the wealthy and well-connected.\"",
    "In addition to imposing new taxes on low- and middle-income earners currently exempt from federal collections, Scott declares war on national mask mandates, local school boards, and race relations in general.",
    "\"We're making sure voters know the facts about Senate Republicans' agenda: a tax hike on millions of seniors and over half of all Americans,\" DSCC spokesman David Bergstein wrote in a companion post.",
    "Democrats all over the US have moved quickly to tie the plan to Republican candidates given that Scott leads the National Republican Senatorial Committee, the main campaign arm for the Senate GOP.",
    "\"At every opportunity, Republicans are pushing the interests of the ultra-wealthy and big corporations that get rich by spiking costs – all while working families pay the price. \"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Opposition researchers have pounced on the issue particularly because Senate Minority Leader Mitch McConnell, a Kentucky Republican, hasn't released a policy plan.",
    "Gregory noted that Rubio had introduced the provision to double the child tax that was included in the 2017 tax bill former President Donald Trump signed into law.",
    "Demings was on the shortlist to be Biden's running mate, and the Florida seat could become one of the most competitive and expensive races in Senate history.",
    "\"Any proposal that touts the virtues of American patriotism, the American family, and capitalism is anathema to everything the Democrat Party stands for.\"",
    "Warren Rojas/Insider \"So much is at stake ahead of the midterms, and the GOP is willing to do anything to win,\" Warren wrote in a campaign email.",
    "Democratic Sen. Elizabeth Warren of Massachusetts rails against GOP Sen. Rick Scott's \"Rescue America\" plan in a fundraising email.",
    "GOP Sen. Rick Scott of Florida speaks at the Conservative Political Action Conference on February 26, 2022 in Orlando, Florida.",
    "Hope he keeps it up,\" a Senate Democratic leadership aide said of the Florida Republican's freestyle \"Rescue America\" package.",
    "\"Sen. Rick Scott's plan to raise taxes on working families and seniors by more than $100 billion is a godsend to Democrats.",
    "Senate Majority Leader Chuck Schumer rails against GOP Sen. Rick Scott's \"Rescue America\" plan in a fundraising email.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The analysis found that Scott's agenda could increase federal income taxes by more than $100 billion in 2022.",
    "The plan was Scott's ideas \"for how to rescue America,\" said Chris Hartline Scott's spokesman at the NRSC.",
    "Joe Raedle/Getty Images\nDemocrats are gleefully bashing Republicans with Rick Scott's midterm agenda.",
    "Democrats are posting campaign ads and sending fundraising pleas highlighting Scott's tax-hike plan.",
    "The latest Demings ad is part of a six-figure buy the campaign is doing on digital ads.",
    "Rubio hasn't answered questions publicly about whether he supports Scott's plan.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "A Democratic aide described Scott's plan as \"a godsend\" ahead of the midterms.",
    "CPAC had copies of Sen. Rick Scott's 11-point conservative policy plan.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Scott, a Republican of Florida, will speak at CPAC on Saturday.",
    "\"He's not surprised Democrats are attacking it,\" Hartline said.",
    "His campaign wouldn't share Rubio's stance but panned the ad.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "\"We must fight back.\""
  ]
}