{
  "id": 2225,
  "mediaId": 2748,
  "date": "2022-02-08",
  "headline": "Blake Masters: “Joe Biden Violates the Constitution EVERY SINGLE DAY – a Culture of Lawlessness – Look at How They’re Going After President Trump!” (VIDEO)",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Ew2UPiW3zNM1RCuxEUX3b5NU6s5J82msgGUGCZF58xFiLazmYnehoh_4SBqp_v45qWK1UXXak_OZeHPjBNRatfOv5fZOpQUU3P4Ce-84E4LKoCA79cWeA3NbZ5G69ou1LRvwKxNq-u53yw47DDR-Te4=w1200-h630-p-k-no-nu",
  "link": "http://www.yourdestinationnow.com/2022/02/blake-masters-joe-biden-violates.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5292,
    1708,
    2765,
    3005,
    733,
    6395
  ],
  "sentences": [
    "If you were a BLM activist in Minneapolis, Minnesota in June of 2020 you could burn down a police precinct and nothing would happen to you.",
    "Blake Masters joined Tucker Carlson on Monday night to discuss the historic crime wave and record numbers of homicides in America today.",
    "If the President of the United States violates law every single day, importing people illegally from other countries into ours.",
    "But if you were in the capital on January 6th and you stepped over the line you’re hunted down and treated as a terrorist.",
    "George Soros funds all of these leftwing DAs and you get these DAs in office and they don’t want to arrest anybody.",
    "Tucker we’ve got criminals thriving at the bottom of our system because we got criminals running it at the top.",
    "When was the last time you heard a US Senate candidate stand up for President Trump and his family?",
    "And so this culture of lawlessness is propped up by powerful Democrats and by bad people.",
    "And the thing to really look out for here is the weaponization of our Justice System.",
    "And now his family, these leftwing attorneys they want to prosecute the Trumps.",
    "Masters told Tucker put blame where it is due — at the feet of Joe Biden.",
    "But because he led the MAGA movement and that terrifies them.",
    "Then why should you even pause before stealing Louis Vuitton?",
    "We cannot let these leftwing psychopaths get away with this!",
    "Biden violates the Constitution like every single day!",
    "Or look at how they’re going after President Trump!",
    "So this political retribution has got to stop!",
    "Blake Masters: “It’s not just low-level crime.",
    "You got to look at the people at the top.",
    "Tucker Carlson: That’s such a good point.",
    "And that’s the highest law of our land.",
    "And too few politicians will make them!",
    "They’ve just completely weaponized it.",
    "Not because they did anything wrong.",
    "You got to look at who’s in charge.",
    "Without consent of the governed.",
    "Blake Masters: Well, exactly.",
    "Bad people like George Soros.",
    "Because that would be racist.",
    "Look at Joe Biden.",
    "Excellent points!",
    "They DIDN’T!",
    "Right?"
  ]
}