{
  "id": 4473,
  "mediaId": 2658,
  "date": "2022-01-10",
  "headline": "Former Manchin chief signs 2",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/01/10/former-manchin-chief-signs-2-799790",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5510,
    5879,
    4637,
    4762,
    4905,
    2649,
    2740,
    2765,
    317,
    1489,
    6718
  ],
  "sentences": [
    "New Joint Fundraisers\nHAGEMAN VICTORY FUND (Hageman for Wyoming, 1890 PAC)\nNew PACs\n1890 PAC (Leadership PAC: Harriet Hageman)\nAmerican Oath Initiative (Super PAC)\nBLUE2022 (Super PAC)\nDemocratic Promise Action Fund PAC (Super PAC)\nOkieWay (Super PAC)\nPA For PA (Super PAC)\nProgressive Voices Action Fund (Super PAC)\nVote Aloha (Hybrid PAC)\nNew Lobbying Registrations\nArent Fox LLP: Arquitectonica International Corporation\nGrassroots Political Consulting LLC: Avicena Systems Ltd.\nHusch Blackwell Strategies: A3 Global, Inc.\nLarry Puccio, LLC: Comcast Coporation\nLarry Puccio, LLC: Humanity Forward\nMccaulley&Company: Nami Ohio\nMercari, Inc.: Mercari, Inc.\nS-3 Group: Pitney Bowes\nThe Madison Group: Nextlink Internet\nThe Madison Group: Stratolaunch\nNew Lobbying Terminations\nBen Barnes Group Lp: Planet Fitness Independent Franchise Council\nBryant Songy Snell LLC: Huntington Ingalls Incorporated\nFidelis Government Relations: Exela Pharma Sciences\nFidelis Government Relations: Sexton'S Creek Consulting On Behalf Of American Titanium Works\nGdr Strategies: General Electric Company\nGdr Strategies: Northrup Grumman Systems Corporation\nJamison And Sullivan, Inc.: Shenandoah Valley Battlefields Foundation\nJ Phillip Gingrey Md, LLC: Faegre Drinker Biddle & Reath On Behalf Of Boston Childrens Hospital\nKing & Spalding LLP: American Regent, Inc.\nKing & Spalding LLP: Chime Financial, Inc.\nLiebman & Associates, Inc.: Energetico, Inc.\nMcdermott+Consulting LLC: Preventive Medicine Research Institute\nPeter Tompa Law: Professional Numismatists Guild\nPremier, Inc.: Premier, Inc.\nRepublic Consulting, LLC: Acp Technologies, LLC\nRepublic Consulting, LLC: M3 Consulting Services, Inc.\nRepublic Consulting, LLC: Personal Connected Health Alliance\nS-3 Group: Bacterioscan, Inc.\nS-3 Group: Richetti Tactical Solutions, LLC\nS-3 Group: Xojet Aviation, LLC\nSusan Molinari: Viridi Parente\nFollow Us",
    "Drew won’t register to lobby, but will offer strategic advice to the firm’s clients on the policymaking process “and how they can best develop messaging to advance their priorities, so that they can advance their goals within that process,” she said in an interview, adding that she’s “really excited to take my knowledge of both how the Hill works, and my experience in strategic communications to help them achieve those goals.”\n— “Monument Advocacy is fortunate to add Katie's skill and experience to their team,” Hoyer said in a statement provided by the firm, calling Drew a “trusted advisor to me for the past sixteen years” whose “work has impacted every major policy debate during that time” and benefited the “entire Democratic caucus.”\nROSEN TO LEAVE SKDK: Hilary Rosen is leaving SKDKnickerbocker after more than a decade at the strategic comms firm, she told staff today.",
    "According to sources and internal documents, British American Tobacco has played a central and hands-on role in orchestrating, directing, and funding the World Vapers’ Alliance—a seemingly grassroots lobbying group designed to recruit pro-vaping advocates around the world under an anti-smoking guise.”\nNFT = NEW FUNDRAISING TREND: “Congressional candidates and PACs are beginning to embrace the crypto boom ahead of this year’s midterm elections, auctioning off digital collectibles known as NFTs that have already drawn hundreds of thousands of dollars in donations,” POLITICO’s Sam Sutton writes.",
    "Like the broader digital currency explosion, NFTs are beginning to raise a host of policy and legal concerns, from their potential use in money laundering to how candidates can avoid running afoul of campaign finance and investor protection rules as they sell them.”\nTUSK FORMS A CRYPTO, FINTECH PRACTICE: New York public affairs firm Tusk Strategies today launched a new practice to bolster its cryptocurrency and fintech business, as New York City Mayor Eric Adams has openly embraced the emerging financial sector and as federal regulators have signaled a coming crackdown.",
    "“I am excited for this next stage and plan to take on some new projects, continuing my role as a CNN commentator and having more time for family and travel.”\nCHAMBER MEMBERS PAID BILLIONS IN FINES: “Companies belonging to the U.S. Chamber of Commerce paid more than $154 billion in penalties for violations of federal, state and local laws since 2000, the consumer advocacy group Public Citizen says in a report it's issuing amid a tug of war over Washington's regulatory powers,” POLITICO’s Leah Nylen reports.",
    "The Chamber has accused the FTC of ‘waging war on American business.’ In a response late Sunday, the Chamber called the allegations ‘patently false,’ arguing that the FTC's ‘regulatory overreach’ is threatening economic recovery from the pandemic.”\n— Though the Chamber doesn’t publicly identify its members, “Public Citizen said it found that 111 companies that self-identify as Chamber members violated state and federal laws nearly 16,000 times over the past two decades.",
    "Tech executive Shrina Kurani, a Democrat who is looking to flip a Republican House district in California, raised $6,600 in 72 hours late last year by selling 21 NFTs containing her crypto policy agenda.”\n— “The move by campaigns to entice donors with digital swag is just the latest example of crypto mania spilling into politics, with a growing list of candidates on both sides of the aisle touting pro-crypto platforms as they look to unseat incumbents.",
    "— In an interview, Karvelas said that he doesn’t plan on registering to lobby until his one-year cooling off period ends in June, but pointed to Buchanan’s service as the top Republican on all but one subcommittee on the powerful tax-writing panel, including the tax subcommittee during the 2017 GOP tax overhaul and the trade subcommittee while the USMCA was moving through the House.",
    "Beat smoking,’ the page urges.”\n— “As for the people who want you to make the switch, the site says that its alliance ‘includes groups representing vapers—our partners—as well as individual vapers from around the world.’ And while the WVA provides a list of those partners, one key name is missing: the world’s largest tobacco company.",
    "— In early December, just a few weeks before Manchin sunk Democrats’ social and climate spending package, in part due to his opposition to extending the enhanced child tax credit, Humanity Forward, the anti-poverty organization founded by Yang, hired Puccio and Moore to lobby on the tax credit, which has since expired.",
    "Former Manchin chief signs 2\nBy CAITLIN OPRYSKO\n01/10/2022 05:14 PM EST\nWith Daniel Lippman\nFORMER MANCHIN CHIEF SIGNS 2: A longtime adviser and former chief of staff to Sen. Joe Manchin (D-W.Va.) has signed telecom giant Comcast and the nonprofit formed by Andrew Yang.",
    "The practice will assist clients with some of the usual needs like public policy and advocacy, PR, digital and trade association management, but will also help clients apply for a BitLicense or for a bank charter to conduct virtual currency business in the state.",
    "“‘The World Vapers’ Alliance amplifies the voice of passionate vapers around the world and empowers them to make a difference for their communities,’ reads the homepage for the WVA, whose logo is revolutionary pastiche—a left fist clenching a vape pen.",
    "Comcast retained Larry Puccio, who was Manchin’s top aide as governor of West Virginia and has remained close with the swing vote senator, and fellow West Virginia lobbyist Angel Moore, at the end of November, according to a newly filed disclosure.",
    "BALLARD ADDS TIE TO POTENTIAL WAYS AND MEANS CHAIR: Ballard Partners, the Florida-based firm that has staffed up on Democratic lobbyists and ties to the Hill since Donald Trump left office, is adding Dave Karvelas to its team ahead of the midterms.",
    "Puccio and Moore, through Larry Puccio LLC, registered to lobby at the federal level for the first time only last year, public disclosures show, when Manchin first took on an outsize role as a centrist Democrat in an evenly divided Senate.",
    "Corporations such as the major oil companies recorded more than 1,600 violations with $8.9 billion in penalties, Public Citizen said.”\nTHE TOBACCO COMPANY INVOLVED IN A PRO-VAPING GROUP: “A pro-vaping group says it wants to save your life.",
    "Sinema, who has typically aligned more with Republicans and internet service providers like Comcast over the rest of her party on the issue of net neutrality, has not yet revealed whether she will vote for Sohn.",
    "— Tusk’s Eric Soufer will lead the practice group of roughly half a dozen, and Jackie Zupsic, head of the firm’s Los Angeles office, will lead the group’s communications, marketing and public relations efforts.",
    "Karvelas previously served as chief of staff to Rep. Vern Buchanan (R-Fla.), who is next in line to chair the powerful House Ways and Means Committee should Republicans regain control of the chamber next year.",
    "— “The watchdog group says the analysis, released Monday, calls into question the motives of the nation’s largest business lobby in criticizing a proposed regulatory crackdown by the Federal Trade Commission.",
    "Arizona GOP Senate candidate Blake Masters last month raised $550,000 in 36 hours when he auctioned off digital tokens depicting the cover of a book he wrote with tech investor and GOP megadonor Peter Thiel.",
    "HOYER AIDE JOINS MONUMENT: Katie Grant Drew, a longtime communications staffer for House Majority Leader Steny Hoyer, has decamped from the Hill to join Monument Advocacy’s public affairs practice.",
    "— Dirk Auer has been promoted to director of competition policy at the International Center for Law & Economics, where he’ll work on competition and antitrust issues in the U.S., U.K. and Europe.",
    "She was previously deputy chief of staff for Rep. Lauren Underwood (D-Ill.) and is a Sen. Amy Klobuchar (D-Minn.), Rep. Peter Welch (D-Vt.) and former Rep. Bruce Braley (D-Iowa) alum.",
    "Opposition from Republicans and hesitancy from some Democrats over Sohn’s membership on the board of a nonprofit TV streaming service delayed her confirmation last year.",
    "— NFTs are “now poised to be big business in the world of politics, with consultants launching NFT platforms to help clients cash in on the boom and engage with voters.",
    "Rosen, who was the consulting powerhouse’s vice chair and managing director, said in an internal memo she’ll leave the firm — and “agency life” — at the end of March.",
    "MORE NEW BUSINESS: Comcast recently added another lobbyist with deep ties to the home state of the Senate’s other key swing vote, Kyrsten Sinema (D-Ariz.).",
    "“We've got a very close relationship, and have had since the day I went to work for him,” weeks after Buchanan was first elected, Karvelas told PI.",
    "More than half of the amount comes from big banks, which have paid about $81 billion in penalties related to 485 legal violations, the group said.",
    "She previously spent more than 20 years at the FTC, most recently as associate director of the Division of Privacy and Identity Protection.",
    "Sohn, a progressive net neutrality advocate, is set for a vote in the Senate Commerce Committee, on which Sinema sits, later this month.",
    "— Andrew Arculin has joined Blank Rome as a partner in the financial institutions litigation and regulatory compliance practice group.",
    "The telecom company hired Kirk Adams of Consilium Consulting last week to lobby on FCC nominations, according to a disclosure filing.",
    "The registration filing was amended later in the day to change the issues Adams would be lobbying on to telecommunications policy.",
    "But smokers may be surprised who’s behind that message,” The Daily Beast's Roger Sollenberger and William Bredderman report.",
    "She was previously executive vice president of external relations and policy at the trade group and is a Bob Goodlatte alum.",
    "He was previously a regional administrator for the General Services Administration during the Obama administration.",
    "— Rita Hite has been named president and CEO of the American Forest Foundation, the first woman in the role.",
    "She was most recently corporate counsel for litigation at Northrop Grumman and is a DOJ Civil Division alum.",
    "— Katie Cross has been promoted to director of government affairs at the Fragrance Creators Association.",
    "Andrew Cuomo, is announcing the launch of his own firm, Bulldog Strategies, New York Playbook reports.",
    "She was most recently a data and innovation research consultant supporting businesses and nonprofits.",
    "— The hire came days after President Joe Biden renominated Gigi Sohn for an open seat at the agency.",
    "She is a former deputy assistant to the president and senior director for Asian affairs at the NSC.",
    "— Omair Mirza is joining J.P. Morgan Chase as vice president of federal government relations.",
    "— Tamra Moore has joined King & Spalding as a partner on the health care team in Washington.",
    "— Maneesha Mithal is now a partner in Wilson Sonsini’s privacy and cybersecurity practice.",
    "— Stuart Malec is now director of government affairs for the Progressive Policy Institute.",
    "— Comcast is the first major corporate client for Puccio and Moore at the federal level.",
    "Good afternoon and welcome to PI, which today more than ever is a proud pro-UGA space.",
    "— Pete Nonis has been promoted to vice president of marketing and development at BCIU.",
    "They’ll lobby for Comcast on telecom issues like broadband deployment and adoption.",
    "He most recently chaired Venable’s financial services practice and is a CFPB alum.",
    "Jobs Report\n— Cornerstone Public Affairs has hired Kirsten West as a principal.",
    "— Allison Hooker is now a senior vice president at American Global Strategies.",
    "He previously was communications director for Rep. Kathleen Rice (D-N.Y.).",
    "He most recently was senior policy adviser for Rep. André Carson (D-Ind.).",
    "She was previously manager of government affairs for the trade group.",
    "— Rich Azzopardi, the longtime spokesperson for former New York Gov.",
    "Another $20 billion in penalties relate to environmental misdeeds.",
    "Jordan Shapiro is now a data and economic policy analyst for PPI.",
    "— Rochelle Colburn is now COO of Millennial Action Project.",
    "Here's a little Saturday in Athens for this Monday in Indy.",
    "“Now is the right time,” Rosen said in the note to staff.",
    "He was most recently director of corporate development.",
    "He was most recently senior vice president in the firm.",
    "— Thorn Run Partners has named Chas Thomas a partner.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "— Jason Klumb has joined KBS Group as a principal.",
    "She previously was COO of College to Congress.",
    "Cigarettes, they remind us, can kill you.",
    "Tips: coprysko@politico.com.",
    "‘Back vaping."
  ]
}