{
  "id": 9294,
  "mediaId": 2550,
  "date": "2022-03-20",
  "headline": "All About NFTs: What this means for political campaigns",
  "image": "https://images.dailykos.com/images/1049706/story_image/new1.jpg?1647626112",
  "link": "https://www.dailykos.com/stories/2022/3/19/2086386/-All-About-NFTs-What-this-means-for-political-campaigns?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2342,
    2879,
    3005,
    5820,
    5851,
    5660,
    67,
    857,
    6396
  ],
  "sentences": [
    "Shrina Kurani, a Democrat running in California’s 42nd Congressional District, will publish 2,022 non-fungible tokens (NFT) on the Solana blockchain today as part of her election campaign!https://t.co/i4oznLCpKY\n— Jazzy.sol (@Jazzy_sol) December 16, 2021\nThere’s very legitimate concerns about the environmental impact of the blockchain, for both cryptocurrencies and NFTs.",
    "“If you use NFTs for donor or volunteer recognition, it's a much more impactful way to recognize supporters than a tote bag or a T-shirt,” said Tomicah Tillemann, the global head of policy for the crypto investing arm of venture capital giant Andreessen Horowitz, a heavyweight backer of blockchain startups.",
    "This can happen if people sell fractions of individual NFTs, or an “NFT basket,” which would make it an investment product called a “security.” Securities are investments that are held in the anticipation of an increase in value that are traded in a market, and they are very tightly regulated.",
    "”NFTs could emerge as a breakout technology in the political space for campaigns in the '22 cycle simply because they are a much more powerful mechanism for demonstrating support for a candidate than most of what's available today.”\nRepublicans seem to have gotten into the game first.",
    "One successful set has been electronic versions of the arrest warrants—in the form of “Wanted” posters—for the brave state representatives who left the state last year to deny a quorum in hopes of slowing down the Republican assault on Texas’ voting rights.",
    "Their gamble paid off, as Rymer told ABC News, “We’ve added 2,500 new people that are going to support our campaign going forward.” The NFTs show Jensen at the infamous Minnesota State Fair either eating a corn dog or carrying a cow.",
    "Although the Federal Election Commission has issued some guidance for accepting cryptocurrency contributions, there is a lot of concern that their sale in a campaign might trigger regulations aimed at investment products.",
    "Numero CEO Brian Forde, a former Obama administration official, said his service allows campaigns to give grassroots donors a one-of-a-kind, hand-illustrated NFT that can be customized when they buy other merchandise.",
    "She even tried to attract bids by promising that a portion would go to charity, but in true Trump fashion, she and her team refused to say how big that portion would be, even after repeatedly being asked.",
    "In fact, public records on the Solana blockchain indicate that the winner came from the same address that minted the NFT, meaning that the winning bid likely came from Melania herself to save face.",
    "HODL PAC is even planning a series of NFTs for their preferred candidates that would function like membership cards or campaign pins depending on the level of donor, according to their founder.",
    "There is something to be said for having forward-thinking elected officials focused on constructing legislation that will maximize the positive impacts of new technology and minimize the harm.",
    "This cycle has seen more wealthy tech entrepreneurs, tech start-ups, and crypto advocates getting into politics out of frustration with government regulations governing their industry.",
    "Max Rymer, a digital consultant for Minnesota Republican gubernatorial candidate Dr. Scott Jensen, decided to use NFTs to bring in a younger demographic along with some good press.",
    "Unlike Jensen, who made many digital files to sell them as cheaply as possible, Masters purposefully created only 99 to sell to top donors for the maximum $5,800 campaign donation.",
    "Yet on March 14, Kurani announced a launch of several climate-focused NFTs on Abris, which is dubbed an \"environmentally friendly\" marketplace built on the Algorand blockchain.",
    "Another Democratic fundraising firm called Numero recently launched electables.com, a platform for campaigns to offer NFTs that would also allow supporters to show them off.",
    "cc @garyvee pic.twitter.com/0OjdAL6nrC\n— Scott Jensen (@drscottjensen) September 1, 2021\nBlake Masters is another political candidate who has also gotten into the NFT game.",
    "They raise a host of policy and legal concerns, from their potential use in money laundering to liability for candidates in violating campaign finance laws.",
    "Scott Jensen, a Republican candidate for governor in Minnesota, became the first political candidate to use NFTs for his campaign just last September.",
    "I will admit the images are very folksy, especially considering they are for a quack doctor under investigation for spreading COVID-19 misinformation.",
    "The Securities and Exchange Commissioner, Hester Peirce, warned that the “fractionalization” of individual NFTs could prompt the agency to crack down.",
    "She quickly raised $6,600 in just 72 hours late last year by selling 21 NFTs representing “vision and concept statements” for emerging technologies.",
    "Currently, a group of Democratic operatives are planning on turning political memorabilia and photos into NFTs that can be used for fundraising.",
    "The money attracted the attention of the political class, who are using NFTs to raise money—either for their campaign or just for themselves.",
    "Just like physical items, the purchases constitute a donation, and there are laws limiting who can purchase and how many can be purchased.",
    "Since they are so popular right now, they can certainly be used to grow interest and create needed community engagement with a campaign.",
    "PRONTO PUP: https://t.co/1O21HUATCX\nLIFE IS A MIRACLE: https://t.co/5HrcZ8SaiZ@BirkMatt will be announcing two new exclusives Thursday!",
    "NFTs (Non-fungible tokens) exploded onto the scene last year, with several creators becoming millionaires—in some cases overnight.",
    "He has gone all in on Trump, and has the backing of his billionaire boss, Peter Thiel, who has pledged $10 million to help him.",
    "This has blunted other Democratic candidates from rushing into NFTs, since climate change is such a core tenet of our party.",
    "Roger Stone is attempting to sell a digital photo of a magazine with Trump’s signature to help pay his growing legal bills.",
    "Campaigns are now offering the option to purchase limited-edition NFTs alongside the usual fare of T-shirts or silly hats.",
    "Her new campaign is selling 230 NFTs to represent the 230 billion tons of carbon remaining in the world's \"carbon budget.\"",
    "Disgraced political figures aside, where NFTs are really changing the game is in this year’s midterm political campaigns.",
    "There has been at least one Democrat who is using NFTs for her campaign, and she happens to be a technology executive.",
    "In addition to attracting new supporters and getting press, there’s another benefit to getting involved with NFTs.",
    "In addition, there are several ethical and environmental concerns that need to be raised when dealing with NFTs.",
    "So if you are a candidate considering NFTs involved with your campaign, there’s a few things we need to discuss.",
    "Several sites have already sprung up this year to guide candidates on how to take advantage of this new trend.",
    "On the other hand, as with any new technology, there are pitfalls that need to be looked at before jumping in.",
    "One image showcased her wide-brimmed white hat, and the other image featured her constantly half-closed eyes.",
    "In fact, a new Political Action Committee, HODL PAC, is supporting crypto-friendly congressional candidates.",
    "To give a little more incentive, Masters promised “exclusive access to parties with me and Peter.” (Gross.)",
    "The algorithm, called “proof of stake,” doesn’t use as much energy as the ones used by other blockchains.",
    "An entire liberal NFT marketplace, Front Row, is already partnering with Democratic campaigns and causes.",
    "Stone also said he’d throw in the actual physical copy of the dumb magazine if the bidding reaches $20k.",
    "Be prepared to address the very legitimate concerns of the environmental impact from your constituents.",
    "Ensure anything you sell is original, and closely monitor and record the sales of any NFTs created.",
    "Shrina Kurani, the vice president of a financial tech firm, is running for Congress in California.",
    "If the environmental question can be answered, expect to see many more candidates embracing NFTs.",
    "The Algorand blockchain claims to be carbon neutral, due to offsets and the algorithm it employs.",
    "(For an explanation on the difference between “proof of stake” vs. “proof of work,” click here.)",
    "Melania Trump raised eyebrows for recently issuing a series of NFTs to raise money—for herself.",
    "Masters offered to sell the image of the cover of his book that he wrote with Peter Thiel.",
    "Minnesota law puts a cap on donations of $4,000 for an individual and $8,000 for a couple.",
    "Poll\n 287 votes Show Results\n Are NFTs a good idea to integrate into a political campaign?",
    "Their first client was the Texas Democratic Party, which is selling digital collectibles.",
    "She holds the distinction of being the first federal candidate to use NFTs in a campaign.",
    "If you do decide to sell NFTs, hire a consultant or firm that knows what they are doing.",
    "She needed $250,000 but only got $170,000 after attracting a grand total of five bids.",
    "?election conspiracy theorist running for Mark Kelly’s Arizona Senate seat this year.",
    "She advocates for legislation to better address tax and accounting rules for crypto.",
    "Candidates are figuring out ways to use them not just to cash in, but to reach out.",
    "x\nWe are the FIRST political campaign in history to release our own line of NFTs!",
    "The cost should be high enough to cover the extraordinary fees, but not too high.",
    "They are no longer on sale at his website, likely because the limit was reached.",
    "Expect Thiel to repeat this strategy for other Trumpian candidates he’s backing.",
    "New candidates are viewing this as an issue to attract a new means of support.",
    "They have complained that the current regulations are unclear and illogical.",
    "Just know that whatever you decide, NFTs aren’t going anywhere anytime soon.",
    "Melania and her hat\nUnfortunately for Melania, the auction was a total flop.",
    "I’m not weighing in on whether a political campaign should use them or not.",
    "The campaign made each available to purchase and ended up making $25,000.",
    "Political figures in need of money are using NFTs to try to raise cash.",
    "3%\n10 votes\nNo\n 78%\n224 votes\nI need to do more research\n 18%\n53 votes",
    "Yet unlike purchasing a T-shirt, NFTs can cause tremendous headaches.",
    "That’s the theme for Steven Olikara’s campaign for Wisconsin Senate.",
    "Typically, the technology sector outpaces federal government policy.",
    "Democrats like Kurani have seized on this to fuel their campaigns.",
    "My million-dollar NFT featuring Al Gore at Netroots Nation 2017.",
    "Are NFTs a good idea to integrate into a political campaign?",
    "No one has ever accused the Trumps of not being shameless.",
    "NFTs are a case study of technology outpacing regulation.",
    "Yes\n No\n I need to do more research\n 287 votes Vote Now!",
    "Moreover, they have proven a good way to grow capital.",
    "Check out the first two in our State Fair series.",
    "The ploy worked, and he raised nearly $575,000.",
    "This is Part Two of a two-part series on NFTs.",
    "Kurani was one of their first beneficiaries.",
    "Like everything else, NFTs are complicated.",
    "Let’s go down the rabbit hole together.",
    "At the end of the day, it’s your call.",
    "He too is utilizing NFTs to fundraise.",
    "?This is huge for the NFT community??",
    "For Part one, go here.",
    "Masters is an ?",
    "(Ouch!)",
    "Yes\n .",
    "x\n?"
  ]
}