{
  "id": 9662,
  "mediaId": 2573,
  "date": "2022-03-29",
  "headline": "Tucker: Cory Booker invented his own identity",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/874189d6-a782-4472-b722-0a149c379baf/08331572-4012-4592-af28-710ff8f99096/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/tucker-cory-booker-invented-his-own-identity",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "DEVINE: And, you know, the thing about Cory Booker, and his performance is that it was all about \"Look at me\" and you played that bit that was really the whole point of it, which is, he says, you know, when he's trying to take claim for her nomination, and you know, he's talking about being in the office with the President when he was deciding and, you know, looking into Kamala Harris's eyes, because he knows the Vice President really well.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "(BEGIN VIDEO CLIP)\nCHRISTINE ANDERSON, MEMBER OF THE EUROPEAN PARLIAMENT: It would have been more appropriate for Mr. Trudeau, Prime Minister of Canada to address this house according to Article 144, an article which was specifically designed to debate violations of human rights, democracy, and the rule of law, which is clearly the case with Mr. Trudeau.",
    "So yes, there also has been -- there is a huge vacuum in the Republican Party, not just people speaking up, but actually coughing up money, coming up with lawyers and money to help these desperate people who are trapped and have nowhere else to turn and our political leaders are, for the most part, have completely abandoned these Americans.",
    "They are trapped in the system and no one except for a few people, including you, Tucker, and a few people like Marjorie Taylor Greene and Louie Gohmert, et cetera are speaking out about this unconstitutional, inhumane abuse of political protesters simply because they protested the election and are basically dissidents of Joe Biden.",
    "So, if you read \"The Post\" piece, and you shouldn't, obviously Jeff Bezos' newspaper is utter garbage, you will find that \"The Post\" Editorial Board is aghast that Republicans asked Ketanji Jackson about kiddy porn, about the sentences she handed down, sentences that fell far beneath federal sentencing guidelines.",
    "Our crime rates are already up, I'm not attributing all of that to illegal immigration, but I promise you, part of it is, and all of a sudden, these people are going to be in people's neighborhoods, or in their cars, or on their front porch, charging their phone, just walking out and plugging their phone in.",
    "Then again, a Prime Minister who openly admires the Chinese basic dictatorship, who tramples on fundamental rights by persecuting and criminalizing his own citizens as terrorists just because they dare to stand up to this perverted concept of democracy should not be allowed to speak in this house at all.",
    "Of course, the opposite is true, but you're not allowed to say it, but imagine the reserve of energy it takes as a newsman to pretend, having shown the clips that we just did, that that was anything but horrifying, anything but so fake that the hair on the back of your neck goes up at the fraudulence.",
    "That means that there will be some men who will have been behind bars for almost two years, not convicted of any crime, never presented any evidence before a jury to decide, simply held, denied bail, because they are Trump supporters who protested the election of Joe Biden on January 6, 2021.",
    "You have judges on the D.C. District Court, I'm talking about judges all the way from Trump appointees down to Reagan appointees, who are going along with the Justice Department holding even nonviolent protesters, upwards of 18 months while they are delaying their trials, letting D.O.J.",
    "The problem with all this is -- easy to make fun of -- but the problem is they are praising a sitting United States senator (Remember the Judiciary Committee) for asking zero questions during a confirmation hearing, during which we're choosing the next Supreme Court justice.",
    "You know, it's sort of -- it's just sickening, and the fact that those CNN anchors and the rest of them are treating him seriously instead of laughing at him, he should be laughed at, because that kind of behavior in a senator is really corrosive, ultimately.",
    "(COMMERCIAL BREAK)\nCARLSON: So the Biden administration is encouraging effectively the rest of the world to ignore American law and come here illegally and as a result of that, nearly 200,000 illegal migrants arrive at this border in this country every month.",
    "We sat there, but I felt so alienated that there was a gulf as wide as the Grand Canyon between us and I could not reach out to save this young man, and we drove back to a housing project called Brick Towers, and I've never seen him again since that day.\"",
    "Imagine if you worked at, say, CNN or MSNBC or NBC News, and you had to pretend that that was an authentic scene that meant something, that was rooted in some observable physical reality that people who went to Ivy league schools somehow are oppressed.",
    "But a couple of weeks ago, Toria Nuland that's the Under Secretary of State who oversees Ukraine, mentioned in a Senate hearing that their U.S. funded biolabs in Ukraine and whatever is in these labs, Nuland said to Marco Rubio is so dangerous.",
    "If you were to take a survey of the people most likely to give you a moral lecture about your own moral shortcomings, they would be the people whose personal lives could withstand the lightest scrutiny, if you know what we mean.",
    "They've all been silent by the fact, in the fact that the Justice Department, Joe Biden's Justice Department has sought pretrial detention for at least a hundred Americans for their participation in the events of January 6th.",
    "If academic credentials still had any connection to ability or achievement, Cory Booker would be a very impressive person, but in his case, we're going to have to grade on a curve because Cory Booker has come a long way.",
    "Some of them you may even know by name -- the famous ones like Chuck Schumer and Mitch McConnell, obviously, the publicity addicts like Lindsey Graham and of course, the ones you see on your own ballot every six years.",
    "DANIELLE HOLLEY-WALKER, HOWARD UNIVERSITY: What we saw Senator Padilla and Senator Booker do to affirm her is something that is deeply touching in a way because we know how deeply disrespected Black women can be.",
    "Based on what I'm seeing on the campaign trail in Arizona, people are tired of this, people are waking up, they're pushing back, I daresay they're mad as hell, and they're not going to take it anymore.",
    "YAMICHE ALCINDOR, MSNBC POLITICAL CONTRIBUTOR: There are a lot of Black women who watched Cory Booker and said, \"This is someone who came to really give her the sort of flowers that she deserved.\"",
    "They're saying it is immoral because of the way that she looks, to ask her real questions, to know what we're getting before she takes the seat for life and of course, this was the whole point.",
    "Did you see the poll that came out that said if America were invaded tomorrow, two-thirds of Democrats say that they would flee instead of fight to defend this country, it's like, what is that?",
    "Anyway, no one has used language like that to describe opponents of Ketanji Jackson, even though she let, to restate, industrial scale pedophiles out of jail with three-month jail sentences.",
    "\"The Washington Post\" Editorial Board saw that groveling and decided it didn't go far enough, so they published this headline yesterday, \"Republicans boast they have not pulled a Kavanaugh.",
    "Nearly 80 of those Americans still are behind bars, denied the opportunity to post bail, as the same Justice Department delays their trials into the middle or towards the end of this year.",
    "And a lot of these people have public defenders, they have not been able to hire criminal defense attorneys in D.C. because of course is you know, that six figures that they don't have.",
    "Now, you can't acknowledge that because no one can define what a woman is, not even people who want to sit on a Supreme Court and if you try to define them, you will get in big trouble.",
    "We can't help but notice that the very same people talking about democracy in Ukraine are still holding Americans in prison in this country for what are essentially political offenses.",
    "CARLSON: So why aren't people who say they have the interests of women at heart standing up and saying: No, you can't pretend that being a woman is as simple as changing your clothes?",
    "Well, unless you happen to live next door to one or you watch an inordinate amount of C-SPAN, it's hard to know what they're like and that's why confirmation hearings are so great.",
    "(BEGIN VIDEO CLIP)\nSEN. CORY BOOKER (D-NJ): Your family and you speak to service, service, service and I'm telling you right now I'm not letting anybody in the Senate steal my joy.",
    "For decades, the U.S. government worked on bio weapons at places like Fort Dietrich in suburban Maryland underground at the Army's Dugway Proving Ground outside Salt Lake City.",
    "But after a series of accidents and controversies, the government decided to move bioweapons research offshore, Ukraine, among other countries was a perfect place to relocate.",
    "(COMMERCIAL BREAK)\nCARLSON: So Justin Trudeau ends democracy in Canada, then he goes over to the European Parliament to complain that Vladimir Putin is a threat to democracy.",
    "So, they are to a person every bit as fraudulent as the people on stage, telling you from the peak of the fake meritocracy that they're somehow fighting against the current.",
    "You got here how every Black woman in America who's gotten anywhere has done, by being like Ginger Rogers said, \"I did everything Fred Astaire did, but backwards in heels.\"",
    "And that's what we're trying to prevent from happening in Uvalde because it's a powder keg that's going to blow up and this government has no regard for American citizens.",
    "You bring these people into a community like Uvalde, you know usually at 8:30 to nine o'clock, there's not anything but a convenience store so what are you going to have?",
    "Our language is being diluted all over the place in the U.K. and I'm sure in the U.S., women are called cervix-havers, menstrual waiters, chest feeders, birthing persons.",
    "You throw someone up there who represents your views, who can't be questioned because anyone who questions the person is, of course, mean or racist or sexist or whatever.",
    "In the silence of not just the Democrats and the usual suspects who defend political -- the taking and holding of political prisoners, but also people like Mitt Romney.",
    "is releasing huge numbers of Cuban nationals, Venezuelans, Nicaraguans, Colombians, et cetera in to the United States to what they call a humanitarian parole pathway.",
    "MCLAUGHLIN: Well, Tucker, we were doing pretty good, but between fighting the pandemic and now the surge of illegal aliens, it is wild or worse than it's ever been.",
    "CARLSON: So this seems -- I mean, you know, far be it for me to weigh in on what it must be like as a woman, but it does seem degrading to be called a cervix-haver?",
    "But the National Pulse is reporting tonight, that apparently a private equity firm run by Hunter Biden funded some of the research into pathogens in these biolabs.",
    "That's their MO, not just the White House, but the toadies in the press corps who do their bidding, denouncing American citizens as disloyal for telling the truth.",
    "Yes, but a deeply committed one, a man who has honed his skills and those skills have been on full display this week as Booker has emoted all over Ketanji Jackson.",
    "CARLSON: Last question, do you think that, you know, Republicans are very dissatisfied with their leadership of the party and I think they have every reason to be.",
    "He told us at the time that Brett Kavanaugh was so odious, so morally filthy, so satanic that anyone who could vote for his nomination was guilty of a mortal sin.",
    "That's honestly like telling you that, Lia Thomas is a deeply accomplished female swimmer who is winning because she just practiced harder than the other girls.",
    "(END VIDEO CLIP)\nCARLSON: We told you last time we wanted to talk to the woman in that video, we have found her and we're very excited to have her join us next.",
    "Or whatever, and I look at Kamala and we have a knowing glance, which we've had for years when she and I used to sit on this, end of this committee, at times.",
    "And they knew this because Pentagon flack had handed them a quote \"factsheet\" that told them so, so they read the talking points dutifully as they always do.",
    "You would want to point out that rather than ask a single actual question during the confirmation hearings, Cory Booker just slobbered all over the nominee.",
    "CARLSON: So you may get the feeling that people are trying to kind of figure out ways to control your money, to control the finances of private citizens.",
    "What we're shocked by is the Biden administration's willingness to attack anyone who presses them for answers as an agent of a hostile foreign power.",
    "This is why those of us -- and it's fantastic that you talk about this quite a lot, Tucker, because so many other broadcasters are simply too afraid.",
    "I mean, they're releasing -- in Eagle Pass, Texas right now, which is 63 miles from Uvalde, they are releasing 700 people a day into the community.",
    "Booker attended not only Stanford and Yale Law School, but then went all the way to Oxford University in England on the coveted Rhodes Scholarship.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: This is what Mayor Don McLaughlin saw outside the Uvalde Customs and Border Protection station this morning.",
    "Technology has been harnessed by a political party to suppress any dissent, in your sense from traveling the state, is people picking up on this?",
    "The Biden administration, by contrast, is giving parole to tens of thousands of illegal aliens, and then they're dropping them off into the U.S.",
    "get away with this, delay, not just their trials, but concealing evidence, refusing to turn over discovery materials to these defense attorneys.",
    "And then I try to get out to the President what it means, what it means, and I want to tell you when I look at you, this is why I get emotional.",
    "It turns out there are confirmation hearings underway right now, you may have heard about them, for a Biden appointee called Ketanji Jackson.",
    "It turns out that our government has for some time funded biolabs in Ukraine that do among other things, research on yes, biological weapons.",
    "This cycle, we're seeing a wave of new and fresh faced candidates who are like President Trump, just speaking directly to the people, right?",
    "If you're like most people, you know the Senate has a hundred members or two from every state, and you know that they are somehow important.",
    "The, you know, I hate to appeal it to the U.N., but if Republicans won't even stand on their behalf, like who else to go to at this point?",
    "CARLSON: Well, it is sinister, because it seems like the biggest and best organized bullying campaign against a population ever organized.",
    "One of the best things about, say, a Supreme Court confirmation hearing is that you get to see the U.S. Senate in action and this is new.",
    "MAYA WILEY, LAWYER, PROFESSOR, AND CIVIL RIGHTS ACTIVIST: It's bringing tears to my eyes right now, brought tears to my eyes yesterday.",
    "This is how the emotive, weepy Cory Booker treated the last nominee to the Supreme Court, someone whose politics he doesn't agree with.",
    "I mean, you know, I think I could care less how you dress or what you call yourself, but this is not liberation, this is the Dark Ages.",
    "BRIANNA KEILAR, CNN ANCHOR: That moment has kind of ruled the day after what was really Republicans hijacking so much of this hearing.",
    "And we asked, among other things, why didn't the Biden administration secure what was ever in these labs before the Russians invaded?",
    "According to Federal law, parole can only be used for, quote, \"urgent humanitarian purposes\" and quote, \"significant public benefit.\"",
    "She is also the author of \"January 6: How Democrats Used the Capitol Protest to Launch a War of Terror against the Political Right.\"",
    "And so just today, my campaign released a new series of NFT's based on art from the bestselling book that I wrote with Peter Thiel.",
    "We, for example, are still locked out of our Twitter account for affirming the obvious, biological sex is real, it is set at birth.",
    "CARLSON: Well, it is and you're absolutely right to note the narcissism at the bottom of it because that always is what it's about.",
    "It's hard for me not to look at you and not see my mom, not to see my cousins, one of them who had to come here and sit behind you.",
    "And then on top of that, we have the gotaways that we're having pursuits through town and we don't know which way to turn anymore.",
    "Could any of that money be used to get real legal representation for people sitting in jail because they attended a rally for him?",
    "It's just interesting that the people who are lecturing us about human rights in Eastern Europe are the ones violating them here.",
    "Heck, in honor of your person who shares your birthday, you might be called a communist, but don't worry, my sister, don't worry.",
    "No, we're not shocked that our government is lying about this, a bioweapons program is by definition a National Security matter.",
    "And those that knew it wouldn't say it, but the person in front of me was quite happy to say that he was definitely a woman.",
    "Now, Jackson is a world-renowned legal genius who, for reasons that are still not clear, cannot determine what a woman is.",
    "Yet even if you agree that because the internet makes acquiring kiddy porn easier, we shouldn't be as tough on kiddy porn.",
    "A lot of the Black women who watched that loved it, said one NBC journalist -- a person who can't define what a woman is.",
    "In fact, we didn't even mentioned bio weapons, we just quoted what To-ria Nuland told the Senate and asked what it meant.",
    "CARLSON: As murderers and rapists walk free, a guy walks into a classroom and shot a bunch people was out in three days.",
    "(COMMERCIAL BREAK)\nCARLSON: It feels like just the other day that you had to believe all women because women never lie.",
    "Now, like Ketanji Jackson, Cory Booker is also a world-famous legal scholar, hence his seat on the Judiciary Committee.",
    "We just spoke to someone who knows the answer to this question, someone with direct firsthand knowledge of this topic.",
    "You just told us you funded biolabs in Ukraine, and didn't take out the dangerous agents before the Russians invaded?",
    "But it's just weird to see how seriously that kind of embarrassing performance is taken by all the supposedly adults.",
    "Well, FOX's Bill Melugin who is being the single best reporter on this question for a year has now found that D.H.S.",
    "Another representative from Croatia said Trudeau -- Canada has become a symbol of symbol of civil rights violations.",
    "They are super woke, and they are like two seconds away from freezing your checking account if you're a Republican.",
    "That we have wonderful families that did migrate from Mexico and came in the right way and they are fed up with it.",
    "CARLSON: Yes, well, I can promise you, the White House doesn't care at all about you or anyone else in your town.",
    "But what happens if you get kicked out of your bank account or blocked from making and receiving payments online?",
    "There was just this oppressive silence on everybody knew that there was a man in the pool, racing with the girls.",
    "I talked to many girls outside of the swimming pool, who, you know, you said the question like: What is a woman?",
    "I mean, you're born in this country, you're -- the American citizens in your town are suffering because of this.",
    "KAVANAUGH: That's in the summer after a football workout when we went over to ...\nBOOKER: You drank on weekdays.",
    "(BEGIN VIDEO CLIP)\nBOOKER: I was in the White House with my Democratic colleagues, and I'm again, I'm in my joy.",
    "Even if you think that's a fair standard, it's certainly fair to ask about it, no, in a Supreme Court hearing?",
    "And what's funny is that Brett Kavanaugh actually had to answer the question, not that it mattered in the end.",
    "CARLSON: So as noted again, and again, because it really was a moment in the history of confirmation hearings.",
    "They accused us of repeating discredited Russian disinformation about the existence of bio weapons in Ukraine.",
    "There are many people that are afraid that are in positions where they feel they're going to lose their jobs.",
    "memo explaining that senior Biden officials authorized a new policy of mass release using this parole system.",
    "He once described his world in an interview, quote: \"I still remember my first month on the street,\" he said.",
    "We're trying to find things to be happy about and actually, if you look hard enough, there are a lot of them.",
    "For comparison's sake, and we didn't want to go here, it's just too obvious, but we can't control ourselves.",
    "(BEGIN VIDEO CLIP)\nBOOKER: Judge Kavanaugh, you drank on weekdays as well in high school, not just weekends.",
    "UNIDENTIFIED MALE: Nearly 100 young men and women got into four large passenger buses bound for San Antonio.",
    "Because Ukraine is not a democracy, the Ukrainian government can host all the bioweapons research it wants.",
    "You are either complicit in the evil, you are either contributing to the wrong or you are fighting against.",
    "(COMMERCIAL BREAK)\nCARLSON: Remember the biolab story, it was a couple of weeks ago, so much has happened.",
    "For asking it, we were immediately denounced by so-called reporters as disloyal agents of Vladimir Putin.",
    "That has come to mean shutting down the bank accounts of anyone who disagrees with the current orthodoxy.",
    "And you look at that and you think, it's so patronizing to a woman with, you know, great accomplishments.",
    "Our new Supreme Court nominee can't tell you what a woman is, but she's not alone, many Democrats can't.",
    "Nobody is going to steal the joy of that woman in the street or the calls that I'm getting or the texts.",
    "But the -- you know, if the only people that are allowed to be called women these days are actually men.",
    "But Tucker, it should be fun and exciting to participate in politics and help take back the U.S. Senate.",
    "Ketanji Brown's explanation for her low sentences with the guidelines were written before the internet.",
    "Now you can judge, but you have to concede that whatever else he is, Cory Booker is a remarkable actor.",
    "And he leaped up and for me, looked me right in the eye and said, 'Who the blank do you think you are?",
    "In other words, that that July 1st reference to skis, \"went over for skis,\" that's brewskis, correct?",
    "One minute women are here, fully female and authentic filling you in the gritty details of womanhood.",
    "(END VIDEO CLIP)\nCARLSON: We've been talking to Mayor Don McLaughlin of Uvalde for almost a year now.",
    "(END VIDEO CLIP)\nCARLSON: So we said we're going to try and find the woman who said that and we did.",
    "Neither one has ever left the tiny world of credential mongering NPR listeners who run this country.",
    "(END VIDEO CLIP)\nCARLSON: You should know that not one of the people you just saw is a poor person.",
    "KAVANAUGH: In the summer, when we went over to Timmy's house on July 1st, that would indicate yes.",
    "TUCKER CARLSON, FOX NEWS CHANNEL HOST: Well, good evening and welcome to TUCKER CARLSON TONIGHT.",
    "CARLSON: I think that's exactly -- yes, handcart I think that's exactly -- that's exactly right.",
    "Major financial institutions are now doing this to Americans who have the wrong political views.",
    "With the with the Border Patrol releasing migrants in our town, you know, it's just ridiculous.",
    "A hundred fifty to two hundred people, and they're going to start walking in the neighborhoods.",
    "\"I walked up to this charismatic Black guy my age called T-Bone, who was one of the drug lords.",
    "As Booker later recalled with sadness, quote \" ... that rift between me and T-Bone was inches.",
    "We have one bus that runs from San Antonio, to Eagle Pass, to Del Rio and then back to Uvalde.",
    "CARLSON: So the Biden administration confirmed that there are U.S. funded biolabs in Ukraine.",
    "Ketanji Brown Jackson, meanwhile, still is not explain what the meaning of the word woman is.",
    "The best part, Cory Booker and Kamala Harris share a knowing glance, as they have for years.",
    "It shows one woman watching as Lia Thomas who is a man wins a women's swimming competition.",
    "KEEN: I don't think anyone dared say it, which is why I really felt I had to say something.",
    "KEEN: Well, I think if you can no longer define what a woman is, we can't talk about women.",
    "Border agents told McLaughlin to expect up to 150 people to be released in Uvalde each day.",
    "You really see how the Republican Party feels about its voters as they languish in prison.",
    "Julie Kelly has been following the fate of the January 6 defendants for more than a year.",
    "The next thing you know, you drop them off at a housing project and they're gone forever.",
    "I've got to say and I hate to, you know, Cory Booker, obviously is so self- discrediting.",
    "(BEGIN VIDEO CLIP)\nLAWRENCE O'DONNELL, MSNBC HOST: Cory Booker had no questions, really.",
    "It turns out that Cory Booker is not a product of the streets of Newark, not even close.",
    "You're a good citizen, so we're going to continue to ask, we hope that others will, too.",
    "Blake Masters is running for Senate in the State of Arizona and he has seen this happen.",
    "I mean, that figuratively, of course, but also literally fight for it if it comes to it.",
    "And you have remained cheerful and honest in the middle of it and I really admire that.",
    "Now, T-Bone, as you probably concluded, was one of Newark's most notorious drug lords.",
    "Not one of them has anything at all in common with the people they claim to speak for.",
    "Now, that people can amass huge amounts of kiddy porn, the guidelines are too strict.",
    "BRETT KAVANAUGH (THEN NOMINEE FOR U.S. SUPREME COURT ASSOCIATE JUSTICE): On weekdays?",
    "So a lot of the Texans, the Americans in your part of the state are Spanish speaking.",
    "You've got Joe Biden and Kamala Harris, neither of whom can form a coherent sentence.",
    "And like all phony people, you see a little glimpse of cruelty and meanness beneath.",
    "In fact, no one has ever seen T-Bone at any point ever because T-Bone doesn't exist.",
    "By this point, Cory Booker was the mayor of Newark, so the friendship couldn't last.",
    "It's almost like these immigrants have more rights than we do as American citizens.",
    "The fight that I'm seeing on the ground here is like nothing I could have imagined.",
    "The place we grew up in, you know, we have some problems, but nothing unmanageable.",
    "And when that happens, somebody is going to get hurt and I hope it doesn't happen.",
    "BLAKE MASTERS (R), ARIZONA SENATORIAL CANDIDATE: So many people come on your show.",
    "You're not a Russian agent, repeating discredited Putin talking points if you ask.",
    "They have definitely seen each other at Whole Foods or on the flight to Edgartown.",
    "And, you know, childish, and gloating and put, you know, making himself the story.",
    "(END VIDEO CLIP)\nCARLSON: And the fake priestess in the fake clerical collar nods.",
    "Now you could say, \"I'm offended by it,\" but you can also acknowledge that's art.",
    "I can't help it and the President is asking our advice, \"Who should we nominate?\"",
    "And yet, just recently, here in Arizona, Wells Fargo de- banked a friend of mine.",
    "DON MCLAUGHLIN, MAYOR, UVALDE, TEXAS: People in our community are fed up with it.",
    "Look, I know the Biden economy is tanking, but we have a bull market in politics.",
    "Nor has anyone subjected her to questions about her high school drinking habits.",
    "The Rhodes Scholar and the crack slinger, united by a common love of the street.",
    "He's from a hard, unforgiving world of crime, decay, and raw urban authenticity.",
    "She's a columnist of \"The New York Post,\" the author of \"The Laptop from Hell.\"",
    "CARLSON: People are nice, basically united and loving the place they were born.",
    "If you ever so much as, look at me again, I'm going to put a cap in your ass.\"",
    "CARLSON: So Big Tech is de-platforming Americans, it happened to us yesterday.",
    "CARLSON: When you say it's a powder keg that could blow up, what do you mean?",
    "Now, that we saw the tape of Nuland saying this and we were really surprised.",
    "Turns out that question is now above the pay grade of the U.S. Supreme Court.",
    "BOOKER: I'm talking about the calendars that you provided during these dates.",
    "You know, pick your attack, but the person is immune from sincere questions.",
    "So, you'd have to figure out a way to ignore it and our media dutifully did.",
    "But Cory Booker is a bad dude, too, in his own way and the two became close.",
    "Every summer, they fly to foreign countries and act like they're President.",
    "Well, apparently they are, at least in some hard-to-define spiritual sense.",
    "He says the Biden administration picked his city because it has a bus stop.",
    "We've got a female Supreme Court nominee who doesn't know what a woman is.",
    "The answer because no one wants to do bioweapons research in this country.",
    "KAVANAUGH And after Tobin's ...\nBOOKER: Sir, sir, I just need a yes or no.",
    "CARLSON: It does seem like there's just too much control over everything.",
    "For decades, these two pioneers have followed virtually identical paths.",
    "This is a rush transcript from \"Tucker Carlson Tonight,\" March 24, 2022.",
    "And it's not, you know, this is not just some identity politics trophy.",
    "No wonder so many elected Republicans obey them, they're afraid not to.",
    "Well, here's German Member of Parliament Christine Anderson responding.",
    "KEEN: It is ultimately really sexist, like the most pernicious sexism.",
    "In my campaign, there was a hit piece that \"The New York Times\" wrote.",
    "But Tucker, I actually wanted to come on and give a bit of good news.",
    "MIRANDA DEVINE, FOX NEWS CHANNEL CONTRIBUTOR: It's all a big charade.",
    "\"It's service,\" but the best was at the end, \"Don't worry my sister.\"",
    "But so far, the star of these hearings has not been Ketanji Jackson.",
    "Cory Booker made him up entirely, but Cory Booker didn't stop there.",
    "(BEGIN VIDEO CLIP)\nBOOKER: In a moral moment, there is no bystander.",
    "They said that my campaign videos sounded too much like you, Tucker.",
    "They shut down his account, because he is a prominent conservative.",
    "At this point, they're just sick and tired of being sick and tired.",
    "Now Jackson is an oppressed member of the professional class, too.",
    "And so I think I'm over the target, or look at fundraising, right?",
    "She is worried it'll fall into the wrong hands, people could hurt.",
    "They are being targeted and persecuted by this Justice Department.",
    "MCLAUGHLIN: That's the question I ask: What gives them the right?",
    "The mayor of that city says, Uvalde is now flooded with migrants.",
    "The volume is totally overwhelming U.S. Border Patrol facilities.",
    "(END VIDEO CLIP)\nCARLSON: That's the guy lecturing you about God.",
    "Maybe we're meant to think of women as an archetype, a pastiche.",
    "No one in human history has ever doubted that because it's true.",
    "That's foretelling and yet somehow it gets even more nauseating.",
    "He just offered an extraordinary, extemporaneous set of remarks.",
    "Now, it's been a struggle for both of them, but they've made it.",
    "KELLIE-JAY KEEN, FOUNDER, STANDING FOR WOMEN: Thank you so much.",
    "But the experience did get us thinking, what is the truth here?",
    "Why exactly are we paying for biolabs in Ukraine of all places?",
    "That seemed like a fair question, maybe an important question.",
    "So yes, we're using NFT's as a fun way to get donors involved.",
    "He is, in fact, a blue-eyed rich kid from an all-White suburb.",
    "It's been a junior senator from New Jersey called Cory Booker.",
    "You know what Senator Booker said was the God's honest truth.",
    "Tell us the legal principle behind that, if you would, Judge.",
    "UNIDENTIFIED FEMALE: I'm not a vet, but I know what a dog is.",
    "And you wonder if he would do the same if, if she were a man.",
    "UNIDENTIFIED FEMALE: I'm not a vet, but I know what a dog is.",
    "Content and Programming Copyright 2022 Fox News Network, LLC.",
    "And it deserves to be an America that we love and recognize.",
    "Did anybody at the meet say: Wait a second, that's cheating.",
    "No one is interested in actually helping corn pop or T-bone.",
    "Cory Booker learned that T-Bone was on the lam from the law.",
    "Maybe they're like T-Bone, the baddest drug lord in Newark.",
    "But they come on and talk about how terrible everything is.",
    "They can't get a fair jury in Washington, D.C. as you know.",
    "I appreciate your calling attention to it again and again.",
    "MCLAUGHLIN: The people I represent think enough is enough.",
    "KELLY: There really is nowhere for these defendants to go.",
    "Has anyone ever seen T-bone and corn pop in the same room?",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: Are you a biologist?",
    "This copy may not be in its final form and may be updated.",
    "They are experiencing truckloads of cognitive dissonance.",
    "Otherwise, the world is going fast to hell in a handcart.",
    "Well, Americans, people in the town of Uvalde, Texas are.",
    "I just look at you and I start getting full of emotion.",
    "You didn't get here because of some dark money groups.",
    "You get to see U.S. senators in their natural habitat.",
    "It's the mutual recognition of the totally fraudulent.",
    "In Del Rio, they are standing on their street corners.",
    "And you can't tell them they can't charge their phone.",
    "I'm a hundred percent sure that that I have to say it.",
    "So we have to give up the language that describes us.",
    "I mean, is there any body to which they can complain?",
    "All of us hope for Ukraine to be free and democratic.",
    "There is nothing ordinary Ukrainians can do about it.",
    "(END VIDEO CLIP)\nCARLSON: That's not Jussie Smollett?",
    "No one is willing to actually call out the absurdity.",
    "As we later learned, T-Bone is a fictional character.",
    "This is a lifetime appointment to the Supreme Court.",
    "And he's turned it into an Oscar speech for himself.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: I'm a woman.",
    "Hate to bring it up, but here's what it looked like.",
    "So why is the U.S. government doing this in Ukraine?",
    "That's what's happening to women all over the world.",
    "So what are you worried about what's happening here?",
    "CARLSON: It's a powder keg that is about to blow up.",
    "And they said: Well, Uvalde is a transportation hub.",
    "By the time that bus gets to you Uvalde, it is full.",
    "The former President has raised almost $200 million.",
    "I mean, he is running a dictatorship, which is true.",
    "It's a poignant story, but Cory Booker isn't alone.",
    "Cory Booker is from a world you have never been to.",
    "I told you this at the beginning, I'm embarrassed.",
    "The Democrats have a gigantic fundraising machine.",
    "We decided to find out what exactly is this about?",
    "CARLSON: So you're not afraid to say what's true.",
    "Thank you so much for coming on, Kellie-Jay Keen.",
    "But we know it's legitimate to ask what it means.",
    "Get out of our way or will accuse you of treason.",
    "People are so tired of cookie cutter politicians.",
    "You couldn't buy a ticket out of Uvalde on a bus.",
    "There's a local news report and what he's seeing.",
    "Cory Booker chokes up thinking about the journey.",
    "He is the Jussie Smollett of Democratic politics.",
    "\"Oh, you're pretending to be someone, you're not?",
    "So, you wouldn't want to acknowledge any of that.",
    "It's all about congratulating himself, as always.",
    "For any democracy, please spare us your presence.",
    "Last night, we told you about one woman who can.",
    "As Joe Biden might have said, he was a bad dude.",
    "CARLSON: How can the White House do this to you?",
    "So we started poking around to find out, we did.",
    "I mean, there are a lot of fake things going on.",
    "This man is cheating, because that's what it is.",
    "I appreciate coming on tonight, Kellie-Jay Keen.",
    "So, this is obviously a human rights violation.",
    "Now this is completely illegal you should know.",
    "So how is the administration dealing with this?",
    "That's fine if you're not on Twitter, whatever.",
    "And I get it because there's a lot of material.",
    "That's what we call hard edge striving, though.",
    "So if that sounds good, go to blakemasters.com.",
    "People know we need to fight for this country.",
    "(END VIDEO CLIP)\nCARLSON: Did we make that up?",
    "So, they wear dark suits and red ties to work.",
    "But some people are still willing to say that.",
    "You know, it's like the Emperor's New Clothes.",
    "The White House tells us they love this stuff.",
    "What are the people you represent think of it.",
    "We're happy to have him join us again tonight.",
    "JULIE KELLY, \"AMERICAN GREATNESS\": Not at all.",
    "KEEN: This, I've thought about long and hard.",
    "This is the White House encouraging felonies.",
    "MCLAUGHLIN: Well, I mean, here's the problem.",
    "And, you know, he's, they're patronizing her.",
    "Are you talking about during the school year?",
    "They're going to accuse you of this and that.",
    "(END VIDEO CLIP)\nCARLSON: Well, she's a hero.",
    "That actually happened in the United States.",
    "Did you see the footage from the sentencing?",
    "He joins us tonight to explain the outlines.",
    "Blake Masters, thanks so much for coming on.",
    "Bill Melugin has obtained an internal D.H.S.",
    "You've taken a stand on this specific issue.",
    "UNIDENTIFIED MALE: Can I ask you a question?",
    "And we're happy to have her join us tonight.",
    "We'd never heard anything like this before.",
    "It's too dangerous, and it's too unpopular.",
    "Republicans need to be scrappy and compete.",
    "Mr. Mayor, Don McLaughlin of Uvalde, Texas.",
    "She went to Harvard and Harvard Law School.",
    "Cory Booker is from the streets of Newark.",
    "UNIDENTIFIED MALE: Can I ask you question?",
    "And, you know, we're talking about T-bone.",
    "It's intended for a small number of cases.",
    "And you have candidates talking about it.",
    "UNIDENTIFIED FEMALE: That is not a woman.",
    "So, the two of them have a lot in common.",
    "She had to be, she had to have your back.",
    "We showed you this clip the other night.",
    "You wouldn't be able to say any of that.",
    "In fact, they've treated Jackson worse.\"",
    "I think it comes to cult-like mentality.",
    "They're just -- they're very frustrated.",
    "Mr. Mayor, thanks so much for coming on.",
    "CARLSON: So just a quick legal question.",
    "How can they crush your town like this?",
    "And I just appreciate your speaking up.",
    "So you do not expect full transparency.",
    "It is different that way, biologically.",
    "UNIDENTIFIED FEMALE: Ask me a question.",
    "UNIDENTIFIED MALE: Are you a biologist.",
    "You could win dinner with me and Peter.",
    "CARLSON: Yes, a peaceful, happy place.",
    "She joins us to assess these hearings.",
    "Both grew up in white-collar families.",
    "No one has seen T-Bone since that day.",
    "She's a founder of Standing for Women.",
    "Same thing in Del Rio, over 500 a day.",
    "I haven't seen that in a while, ever.",
    "I think these people are brainwashed.",
    "There is no other way to describe it.",
    "I mean, this is such a rigged system.",
    "He said, \"Service, service, service.\"",
    "Will they actually vote in primaries?",
    "Both went to multiple elite schools.",
    "But then inevitably, tragedy struck.",
    "But do you really know these people?",
    "UNIDENTIFIED MALE: No, I am serious.",
    "What are the outlines of that story?",
    "Julie, thanks so much for coming on.",
    "I think because it needs to be said.",
    "MCLAUGHLIN: Thank you for having me.",
    "And so these banks, it's a problem.",
    "You shouldn't be on Twitter anyway.",
    "UNIDENTIFIED MALE: No, I'm serious.",
    "And they literally would not speak?",
    "Miranda Devine, thank you for that.",
    "That is a very consistent standard.",
    "MASTERS: I think they will, Tucker.",
    "Their kids are going to live here.",
    "That was honestly her explanation.",
    "He also invented his own identity.",
    "Don't ask, you're a tool of Putin.",
    "KELLY: Yes, they absolutely could.",
    "Certainly, I'm trying to innovate.",
    "But I'm really worried that it is.",
    "People can win super cool prizes.",
    "She is with \"American Greatness.\"",
    "We told you about her last night.",
    "Nobody's going to steal that joy.",
    "Blake Masters, thank you so much.",
    "Mr. Trudeau, you are a disgrace.",
    "Our kids are going to live here.",
    "It wouldn't matter what he said.",
    "His parents were IBM executives.",
    "This is not a conspiracy theory.",
    "How long has this been going on?",
    "They are tired of the open door.",
    "CARLSON: Human rights violation.",
    "But there is more to the story.",
    "We'll tell you after the break.",
    "UNIDENTIFIED FEMALE: Oh my God.",
    "DEVINE: Thanks so much, Tucker.",
    "UNIDENTIFIED FEMALE: Oh my God.",
    "KAVANAUGH: I'd say that's rare.",
    "That's what we're fighting for.",
    "MASTERS: Is it so much to ask?",
    "I think it comes to cowardice.",
    "They have relatives in Mexico.",
    "He's got a finance background.",
    "Would that be possible to do?",
    "And what's the purpose of it?",
    "Julie Kelly joins us tonight.",
    "It's the Greta Thunberg play.",
    "You are my harbinger of hope.",
    "It's exactly Jussie Smollett.",
    "Not one of them is oppressed.",
    "I said, 'Yo, man, what's up?'",
    "I see my ancestors and yours.",
    "They're in the Constitution.",
    "It's easy to enjoy all this.",
    "Her name is Kellie-Jay Keen.",
    "But we can't all be silent.",
    "KEEN: I think it's my duty.",
    "The whole thing was absurd.",
    "So we brought it up on air.",
    "There's a lot of bad stuff.",
    "That's not Jussie Smollett?",
    "Miranda Devine is not gone.",
    "MASTERS: Thank you, Tucker.",
    "You have earned this spot.",
    "Maybe you agree with that.",
    "It happened earlier today.",
    "I appreciate it very much.",
    "They're in people's yards.",
    "But why is this important?",
    "So it's just really scary.",
    "Is that an overstatement?",
    "It's the best show on TV.",
    "Not to American citizens.",
    "That's not a small thing.",
    "Neither one applies here.",
    "So, that's what you know.",
    "They sound very familiar.",
    "It's just totally crazy.",
    "MASTERS: Oh, absolutely.",
    "Like they own the place.",
    "People lie all the time.",
    "Why are you not afraid?",
    "Julie Kelly, thank you.",
    "KELLY: You too, Tucker.",
    "She is thankfully here.",
    "Watch their solidarity.",
    "That's what's at stake.",
    "We'll see you tomorrow.",
    "He has quite a resume.",
    "Today, you're my star.",
    "A faker knows a faker.",
    "Isn't that your fault?",
    "It's really sinister.",
    "Humanitarian to whom?",
    "It was just boastful.",
    "\"Did you have a beer?",
    "Answer the question.\"",
    "That brewskis, right?",
    "Who are they, really?",
    "They talk about laws.",
    "Are women even real?",
    "Don't be ridiculous.",
    "Don't be ridiculous.",
    "Shut up, Putin love.",
    "Do you have ovaries?",
    "That's over the top.",
    "Have the best night.",
    "ALL RIGHTS RESERVED.",
    "This is our country.",
    "We'll be right back.",
    "Why wouldn't it be?",
    "Biolabs in Ukraine.",
    "It is embarrassing.",
    "So who's suffering?",
    "That's not a woman.",
    "It's just so funny.",
    "What are they like?",
    "Do we create that?",
    "Everybody knew it.",
    "That's despicable.",
    "That's the truth.",
    "Let them come in.",
    "BOOKER: Yes, sir.",
    "CARLSON: They do.",
    "Good to see you.",
    "Maybe you don't.",
    "God has got you.",
    "They're related?",
    "KEEN: Thank you.",
    "Good to see you.",
    "We're not sure.",
    "We're not sure.",
    "You are worthy.",
    "Yes or no, sir?",
    "Remember that?",
    "Wait a second.",
    "How much more?",
    "Wait a second.",
    "How is Uvalde?",
    "How did it go?",
    "CARLSON: Yes.",
    "CARLSON: Yes.",
    "I mean, what?",
    "That's okay.",
    "That's true.",
    "That's next.",
    "So I get it.",
    "BOOKER: Yes.",
    "Here she is.",
    "Watch this.",
    "KELLY: Yes.",
    "Wait, what?",
    "And we did.",
    "We promise.",
    "Thank you.",
    "It's true.",
    "Thank you.",
    "We're not.",
    "Thank you.",
    "How come?",
    "Me too.\"",
    "A fraud?",
    "Amazing.",
    "I agree.",
    "Watch.",
    "Watch.",
    "Watch.",
    "Right?",
    "Right?",
    "What?",
    "Why?",
    "Huh.",
    "Yes."
  ]
}