[
  {
    "id": 970,
    "mediaId": 2662,
    "date": "2022-02-10",
    "sentence": "WATCH: AZ Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> DEMOLISHES 60 Minutes Australia – “The Only Thing Keeping Us From Being Australia Right Now, Or Canada Is Our Second Amendment.”\nKari Lake doesn’t let the fake news make her look bad.",
    "author": "Jordan Conradson",
    "title": "EPIC! Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by Kari Lake — Then GETS SCHOOLED Again (VIDEO)"
  },
  {
    "id": 1095,
    "mediaId": 2595,
    "date": "2022-02-11",
    "sentence": "— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) February 10, 2022\nKari Lake Tapes the Loser as He’s Taping Her and Trying to Destroy Her – She’s Prepared\nThis next bit is great where she goes after the snob.",
    "author": "M Dowling",
    "title": "We Would Hate to Be the Dem Running Against Kari Lake – Watch 3 videos!"
  },
  {
    "id": 11027,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Trump-backed Arizona candidate threatens Australian journalist: ‘Your days are numbered’"
  },
  {
    "id": 10934,
    "mediaId": 2664,
    "date": "2022-03-13",
    "sentence": "She ends up storming off the set.pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1647219078\nRepublican nominee for Arizona governor <span class='selected-term'>Kari Lake</span> (pictured) stormed out of an interview after showing an outright dislike to an Australian reporter\n“Donald Trump said the accused [over the Capitol Riots] should be forgiven.",
    "author": "Sarah K. Burris",
    "title": "Kari Lake triggered by Jan. 6 questions from '60 Minutes' in Australia — and storms off the set"
  },
  {
    "id": 10812,
    "mediaId": 2520,
    "date": "2022-03-14",
    "sentence": "For pointing that out, I’ll, no doubt, join the growing growing ranks of scolded journalists who dared to criticize <span class='selected-term'>Kari Lake</span>, or even ask a question that might lead one to conclude that when it comes to matters of substance, this particular Lake is a puddle.",
    "author": "Laurie Roberts",
    "title": "Kari Lake is unmasked after her disaster of a Down Under interview"
  },
  {
    "id": 11331,
    "mediaId": 2663,
    "date": "2022-03-14",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> gave quite the performance on 60 Minutes Australia over the weekend, dodging serious questions and abruptly cutting the interview short.",
    "author": "Dan Tracer",
    "title": "Trump-endorsed candidate Kari Lake rants about guns and freedom before storming off “60 Minutes” set"
  },
  {
    "id": 11421,
    "mediaId": 2748,
    "date": "2022-03-15",
    "sentence": "60 Minutes Australia finally aired a small edited portion of Trump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span>’s interview with leftist hack Liam Bartlett.",
    "author": "",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  },
  {
    "id": 10783,
    "mediaId": 2540,
    "date": "2022-03-15",
    "sentence": "Watch what happened next\nArizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> abruptly stopped an interview with 60 Minutes Australia, after the journalist asked her about the US Capitol attack.",
    "author": "",
    "title": "Trump-endorsed candidate asked about January 6. Watch what happened next"
  },
  {
    "id": 10882,
    "mediaId": 2662,
    "date": "2022-03-15",
    "sentence": "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by <span class='selected-term'>Kari Lake</span> — Then GETS SCHOOLED Again (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe video finally aired on Sunday.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ Gubernatorial Candidate Kari Lake Reacts to 60 Minutes Australia’s Extremely Biased Interview: “This Guy Came Into It With a Raging Case Of Stage 4 Trump Derangement Syndrome”"
  }
]