[
  {
    "id": 2544,
    "mediaId": 2748,
    "date": "2022-02-05",
    "sentence": "Trump, who has endorsed a number of former Democrats including ex-Obama donor <span class='selected-term'>Kari Lake</span> (AZ), took to the airwaves on Tuesday to offer his thoughts on the decision that has roiled his MAGA base:\n“Well, I didn’t know Robby Starbuck; I have known Morgan; she’s been in the administration; she did a good job,” Trump told anchor Rob Schmitt.",
    "author": "Blarp Blog",
    "title": "The Battle for TN-5: Trump Defends Ortagus Pick and Suggests Robby Starbuck Voted for Obama… Except He Didn’t?"
  },
  {
    "id": 10812,
    "mediaId": 2520,
    "date": "2022-03-14",
    "sentence": "For pointing that out, I’ll, no doubt, join the growing growing ranks of scolded journalists who dared to criticize <span class='selected-term'>Kari Lake</span>, or even ask a question that might lead one to conclude that when it comes to matters of substance, this particular Lake is a puddle.",
    "author": "Laurie Roberts",
    "title": "Kari Lake is unmasked after her disaster of a Down Under interview"
  },
  {
    "id": 11504,
    "mediaId": 2790,
    "date": "2022-03-17",
    "sentence": "Sometimes, those things are even lies, like in an ad from Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Domenico Montanaro",
    "title": "The truth in political advertising: 'You're allowed to lie'"
  },
  {
    "id": 7163,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "The Trump-backed gubernatorial candidate in Arizona’s 2022 election, former TV news anchor <span class='selected-term'>Kari Lake</span>, told Breitbart News at the premiere that the film “was one of the most important movies I’ve ever seen.”\n“Americans are busy.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Trump at ‘Rigged’ Premiere: ‘It Shouldn’t Be Allowed’ for Mark Zuckerberg to Privately Finance Election Operations"
  },
  {
    "id": 7319,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Subscribe to\nAt a Donald Trump rally in North Carolina on Saturday, MyPillow CEO Mike Lindell and Trump-endorsed Republican primary candidate for Arizona governor <span class='selected-term'>Kari Lake</span>, a former journalist in the state, came together on the web-based Right Side Broadcasting Network (RSBN) to claim the 2020 election was stolen, Pennsylvania Republicans are traitors to the United States, and Fox News and the conservative media in general are cowards.",
    "author": "Caleb Howe",
    "title": "Mike Lindell Shouts ‘Dominion’, Bashes Fox, Call Republicans ‘Traitors’ with Trump Candidate at NC Rally"
  },
  {
    "id": 5675,
    "mediaId": 2574,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Collin Anderson",
    "title": "Trump-Backed Kari Lake Knocked Doors for Obama, Former Colleague Says"
  }
]