[
  {
    "id": 4574,
    "mediaId": 2605,
    "date": "2022-01-06",
    "sentence": "In Arizona, he endorsed <span class='selected-term'>Kari Lake</span>, a former television broadcaster running for governor who falsely claims Trump won the state.",
    "author": "Chris Megerian",
    "title": "The battle for the Capitol ended. The war for democracy continues"
  },
  {
    "id": 3951,
    "mediaId": 2605,
    "date": "2022-01-20",
    "sentence": "Prominent at Trump’s rally was <span class='selected-term'>Kari Lake</span>, his choice to dump Arizona Gov.",
    "author": "Jackie CalmesColumnist",
    "title": "Column: Biden’s first year is a chronicle of Republican obstruction and Trump’s shadow"
  },
  {
    "id": 3279,
    "mediaId": 2662,
    "date": "2022-02-03",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\n<span class='selected-term'>Kari Lake</span>: Well he’s obviously sitting in the White House.",
    "author": "Jim Hoft",
    "title": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)"
  },
  {
    "id": 1916,
    "mediaId": 2618,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Jennifer Smith",
    "title": "Exclusive: Whoopi Goldberg's fake Jewish past: The View host wrote 1993 recipe for 'Jewish American Princess Fried Chicken' then claimed SHE was a practicing Jew - as insiders slam 'decades' of 'disgusting' appropriation and anti-Semitism"
  },
  {
    "id": 1888,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nTrump-endorsed Arizona Gubernatorial Candidate <span class='selected-term'>Kari Lake</span> shared this video to expose their evil agenda.",
    "author": "Jordan Conradson",
    "title": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted"
  },
  {
    "id": 1858,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> called for perp walks after seeing this video.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE – ELECTION FRAUD ON VIDEO: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server Before Delivery To Auditors"
  },
  {
    "id": 7206,
    "mediaId": 2662,
    "date": "2022-04-09",
    "sentence": "Watch right now on Rumble or through my app!https://t.co/yVIDSuHsyr\n— <span class='selected-term'>Kari Lake</span> for AZ Governor (@KariLake) April 9, 2022",
    "author": "Jim Hoft",
    "title": "THOUSANDS Expected at Trump NC Rally Tonight with Ted Budd, Madison Cawthorn, Dan Bishop and Greg Murphy at 7 PM ET"
  }
]