[
  {
    "id": 4396,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "\"I endorsed [Starbuck] months ago and I stand by my endorsement,\" tweeted Rep. Madison Cawthorn, R-N.C.\n\"I endorsed Robby months ago & believe he's exactly what we need in these difficult times,\" wrote Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Igor Derysh",
    "title": "Allies revolt after Trump endorses rival to MAGA darling: He 'has it completely wrong'"
  },
  {
    "id": 3649,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "\"I endorsed [Starbuck] months ago and I stand by my endorsement,\" tweeted Rep. Madison Cawthorn, R-N.C.\n\"I endorsed Robby months ago & believe he's exactly what we need in these difficult times,\" wrote Trump-backed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span>.",
    "author": "Igor Derysh",
    "title": "'Trump has it completely wrong': Allies revolt after Trump endorses rival to MAGA darling"
  },
  {
    "id": 2447,
    "mediaId": 2557,
    "date": "2022-02-07",
    "sentence": "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\n<span class='selected-term'>Kari Lake</span>, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "author": "DML News App",
    "title": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle"
  },
  {
    "id": 685,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "Trump-endorsed Arizona gubernatorial candidate <span class='selected-term'>Kari Lake</span> is on the agenda, but neither of her top opponents will appear.",
    "author": "",
    "title": "Opinion This year’s CPAC lineup speaks volumes about the conservative movement"
  },
  {
    "id": 5559,
    "mediaId": 2589,
    "date": "2022-04-20",
    "sentence": "ROBBY HAS BEEN ENDORSED BY SENATOR RAND PAUL, CANDACE OWENS, CHARLIE KIRK, CONGRESSMAN MADISON CAWTHORN, CONGRESSMAN THOMAS MASSIE, CONGRESSWOMAN MARJORIE TAYLOR GREENE, TURNING POINT ACTION, LEXIT, PRESIDENT TRUMP’S LAWYER JENNA ELLIS, WILLIAMSON COUNTY SHERIFF DUSTY RHOADES, SEBASTIAN GORKA, CONGRESSMAN RALPH NORMAN, NYC MAYOR RUDY GUILIANI, CONGRESSMAN KEN BUCK, REPUBLICANS FOR NATIONAL RENEWAL, AZ GOP CHAIR KELLI WARD, BIENVENIEDO, BULL MOOSE PROJECT, AZ GOV CANDIDATE <span class='selected-term'>KARI LAKE</span> AND MANY MORE\nStarbuck says a full statement is coming soon.",
    "author": "Karen Townsend",
    "title": "TN GOP kicks 3 candidates off ballot, including Trump and Pompeo endorsee"
  }
]