[
  {
    "id": 3639,
    "mediaId": 2520,
    "date": "2022-01-22",
    "sentence": "The liberals' debate over how to respond to Sinema's filibuster stance largely overshadowed the decision by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., to back a maneuver to weaken the filibuster rule only for the voting rights legislation that he co-sponsored.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Sen. Kyrsten Sinema censured by Arizona Democratic Party executive board over filibuster vote"
  },
  {
    "id": 3775,
    "mediaId": 2607,
    "date": "2022-01-22",
    "sentence": "Sinema’s fight with the left has overshadowed the 2022 reelection bid of <span class='selected-term'>Mark Kelly</span>, Arizona’s other Democratic senator, who will be trying to hold on to the seat he won in a special election.",
    "author": "Associated Press",
    "title": "Arizona Democrats censure Sinema over voting rights bill"
  },
  {
    "id": 3711,
    "mediaId": 2746,
    "date": "2022-01-26",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> disagrees with the Arizona Democratic Party’s decision to censure Sen. Kyrsten Sinema after she refused to change Senate rules to pass a bill to overhaul federal elections.",
    "author": "Seth McLaughlin",
    "title": "Sen. Mark Kelly defends Sen. Kyrsten Sinema against Arizona Democratic Party censure"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 4325,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "That would be Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 1815,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and Rep. Dave Schweikert are pushing for an extension of telehealth coverage for people enrolled in Medicare beyond 2023.",
    "author": "Cami Parrish",
    "title": "Sinema, Kelly and Schweikert want extension of telehealth coverage"
  },
  {
    "id": 1845,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Jim Lamon, a Republican Senate hopeful from the state of Arizona, is showing off a new ad that he says will air during the Super Bowl that features him firing a gun at a likenesses of President Joe Biden, House Speaker Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Brad Reed",
    "title": "Arizona GOP candidate's Super Bowl ad features him firing a gun at likenesses of Biden and Pelosi"
  },
  {
    "id": 11591,
    "mediaId": 8322,
    "date": "2022-03-25",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning President Biden against ending Title 42 border restrictions without a \"comprehensive plan\" in place to ensure order at the southern border -- a sharp contrast to the stance of Senate Majority Leader Chuck Schumer.",
    "author": "Adam Shaw",
    "title": "Arizona Dem senators warn Biden against 'sharp end' to Title 42 border restrictions without plan"
  },
  {
    "id": 12234,
    "mediaId": 2748,
    "date": "2022-03-26",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "author": "Blarp Blog",
    "title": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls"
  },
  {
    "id": 9879,
    "mediaId": 2520,
    "date": "2022-03-31",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee"
  },
  {
    "id": 8147,
    "mediaId": 8350,
    "date": "2022-04-06",
    "sentence": "PHOENIX – U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona said Wednesday the Biden administration’s decision to lift a public health ban on asylum seekers at the southern border soon “is a really bad idea” for now.",
    "author": "KTAR.COM",
    "title": "Arizona Sen. Kelly sees end of COVID border policy as ‘crisis on top of a crisis’"
  }
]