[
  {
    "id": 4478,
    "mediaId": 8475,
    "date": "2022-01-11",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, who faces a tough re-election in November, to back such legislation, saying he has draft language on his website.",
    "author": "Jeremy Duda",
    "title": "Ducey touts border security, water & tax plans in final State of the State speech"
  },
  {
    "id": 3564,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "But he’s held off on endorsing a Senate candidate to go up against incumbent Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Trump kicks off midterm year still stuck on last election"
  },
  {
    "id": 3557,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "Vilsack is in Phoenix today to discuss more of the efforts on meatpacking with Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Vilsack homes in on small meat processors"
  },
  {
    "id": 3708,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "U.S. Sen. <span class='selected-term'>Mark Kelly</span> announced Wednesday morning that he would support altering filibuster rules if Republicans block the measures.",
    "author": "Reagan Priest",
    "title": "Arizonans protest at U.S. Capitol as Senate takes up voting rights, Kelly endorses changing filibuster"
  },
  {
    "id": 3718,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 3604,
    "mediaId": 2590,
    "date": "2022-01-20",
    "sentence": "“I wanted to talk to you about a decision I’ve made,” Sen. <span class='selected-term'>Mark Kelly</span> (D) wrote in an email to supporters on Thursday afternoon.",
    "author": "Amanda Terkel",
    "title": "Arizona Sen. Mark Kelly Throws Shade At Kyrsten Sinema's Filibuster Reform Vote"
  },
  {
    "id": 3659,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jeremy Duda",
    "title": "Ducey: I’m still not running for Senate"
  },
  {
    "id": 3639,
    "mediaId": 2520,
    "date": "2022-01-22",
    "sentence": "The liberals' debate over how to respond to Sinema's filibuster stance largely overshadowed the decision by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., to back a maneuver to weaken the filibuster rule only for the voting rights legislation that he co-sponsored.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Sen. Kyrsten Sinema censured by Arizona Democratic Party executive board over filibuster vote"
  },
  {
    "id": 3775,
    "mediaId": 2607,
    "date": "2022-01-22",
    "sentence": "Sinema’s fight with the left has overshadowed the 2022 reelection bid of <span class='selected-term'>Mark Kelly</span>, Arizona’s other Democratic senator, who will be trying to hold on to the seat he won in a special election.",
    "author": "Associated Press",
    "title": "Arizona Democrats censure Sinema over voting rights bill"
  },
  {
    "id": 3965,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3590,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3637,
    "mediaId": 2590,
    "date": "2022-01-26",
    "sentence": "The state’s other Democratic senator, <span class='selected-term'>Mark Kelly</span>, is already fundraising off of his vote for the filibuster change ahead of a reelection campaign this fall.",
    "author": "Travis Waldron",
    "title": "The Death Of Dems' Voting Rights Bill Is A Green Light For GOP State Legislatures"
  },
  {
    "id": 3711,
    "mediaId": 2746,
    "date": "2022-01-26",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> disagrees with the Arizona Democratic Party’s decision to censure Sen. Kyrsten Sinema after she refused to change Senate rules to pass a bill to overhaul federal elections.",
    "author": "Seth McLaughlin",
    "title": "Sen. Mark Kelly defends Sen. Kyrsten Sinema against Arizona Democratic Party censure"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 4325,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "That would be Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 2687,
    "mediaId": 2573,
    "date": "2022-01-31",
    "sentence": "Raphael G. Warnock and <span class='selected-term'>Mark Kelly</span>, respectively, are up for reelection.",
    "author": "",
    "title": "Runaway inflation leads to people 'voting with their wallets': Larry Glazer"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 2717,
    "mediaId": 8475,
    "date": "2022-02-01",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are pushing Gov.",
    "author": "Paul Ingram",
    "title": "Sinema, Kelly urge Ducey to send Nat'l Guard to Az hospitals stressed by COVID"
  },
  {
    "id": 2771,
    "mediaId": 2658,
    "date": "2022-02-01",
    "sentence": "So, I don’t get it,” said Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Dems try to move on"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 2761,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "If Masters is able to win the Republican senatorial primary and unseat <span class='selected-term'>Mark Kelly</span>, Arizona can be the stepping stone towards garnering for the America First movement one of its most significant victories of 2022.",
    "author": "Kenny Cody",
    "title": "A Blake Masters Ariz. Win Would Boost America First Movement"
  },
  {
    "id": 1815,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and Rep. Dave Schweikert are pushing for an extension of telehealth coverage for people enrolled in Medicare beyond 2023.",
    "author": "Cami Parrish",
    "title": "Sinema, Kelly and Schweikert want extension of telehealth coverage"
  },
  {
    "id": 2551,
    "mediaId": 8450,
    "date": "2022-02-08",
    "sentence": "Brnovich se encuentra entre los cinco republicanos que compiten en las elecciones primarias de agosto por el derecho a enfrentarse al senador demócrata <span class='selected-term'>Mark Kelly</span> en noviembre.",
    "author": "",
    "title": "Brnovich asegura que el gobernador Ducey puede enviar tropas a la frontera para proteger a Arizona"
  },
  {
    "id": 2274,
    "mediaId": 2644,
    "date": "2022-02-08",
    "sentence": "Brnovich, who is seeking the GOP nomination to challenge US Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) later this year, wrote in the opinion that “only the Governor of the State of Arizona has the power to make a final determination” that the state is under invasion and then “establish the exact parameters for the exercise of the defensive use of force.”\nDucey issued a response to Brnovich that suggested he would not listen to the idea.",
    "author": "Steven Nelson",
    "title": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds"
  },
  {
    "id": 1928,
    "mediaId": 2526,
    "date": "2022-02-08",
    "sentence": "This November, at least two Senate Democrats stand to lose their seats in swing states that Biden won by slim margins: Sen. Raphael Warnock of Georgia and Sen. <span class='selected-term'>Mark Kelly</span> of Arizona — neither of whom have called for the president’s aid.",
    "author": "Paul Bois",
    "title": "Poll: Joe Biden Job Approval Rating Crashes to 38 Percent"
  },
  {
    "id": 2123,
    "mediaId": 8350,
    "date": "2022-02-09",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Sen. Mark Kelly, 2nd Democrat call for gas tax suspension to blunt rising prices"
  },
  {
    "id": 1910,
    "mediaId": 2520,
    "date": "2022-02-09",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> and Sen. Maggie Hassan are teaming up on legislation that would suspend the federal gas tax until 2023 in an attempt to lower gas prices.",
    "author": "Cami Parrish",
    "title": "Sen. Mark Kelly bill would suspend federal gas tax to ease costs"
  },
  {
    "id": 1845,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Jim Lamon, a Republican Senate hopeful from the state of Arizona, is showing off a new ad that he says will air during the Super Bowl that features him firing a gun at a likenesses of President Joe Biden, House Speaker Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Brad Reed",
    "title": "Arizona GOP candidate's Super Bowl ad features him firing a gun at likenesses of Biden and Pelosi"
  },
  {
    "id": 1046,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "Republican Senate candidate Jim Lamon dresses like an Old West lawman in a new ad in which he engages in a gunfight with actors representing President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span>, whose wife was gravely injured in a 2011 mass shooting near Tucson that left six dead and a dozen others injured.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Republican Senate candidate Jim Lamon assailed for gunslinging ad against Kelly, Biden, Pelosi"
  },
  {
    "id": 974,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "A GOP Senate candidate who was among the 11 Arizona Republicans who signed a forged electors document has released a violent campaign ad where he shoots at actors representing President Joe Biden, Speaker of the House Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span>, whose wife—former Rep. Gabby Giffords—survived a brutal assassination attempt in 2011.",
    "author": "",
    "title": "Arizona GOP candidate revels in outrage after releasing vile ad depicting political violence"
  },
  {
    "id": 1334,
    "mediaId": 2512,
    "date": "2022-02-11",
    "sentence": "Jim Lamon, one of the MAGA Republicans competing in Arizona’s 2022 GOP U.S. Senate primary, is drawing criticism for a new campaign ad that depicts him shooting at President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span> — who he is hoping to compete with in the general election, and whose wife, Gabby Giffords, survived an attempted murder in 2011.",
    "author": "Alex Henderson",
    "title": "Arizona Republican Senate hopeful slammed as 'disgusting' for violent campaign ad"
  },
  {
    "id": 1175,
    "mediaId": 2590,
    "date": "2022-02-11",
    "sentence": "https://t.co/wbFO0wU76O\n— Fred Guttenberg (@fred_guttenberg) February 10, 2022\nIn which a Republican candidate for Senate play acts shooting a gun at, among others, Senator <span class='selected-term'>Mark Kelly</span>, whose wife, former Congresswoman Gabby Giffords, was gravely injured by gunfire in real life.",
    "author": "Lee Moran",
    "title": "GOP Sen Candidate Shoots At Biden, Pelosi Lookalikes In 'Disgusting' Ad"
  },
  {
    "id": 1214,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "In a new campaign ad, Arizona Republican Senate candidate Jim Lamon — appearing as an Old West-style sheriff — shoots at an actor playing his political opponent, incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 1772,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nA Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1784,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent <span class='selected-term'>Mark Kelly</span>, while Ducey is within three points.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 1016,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "Basta ver, por ejemplo, la barbaridad que ha hecho el aspirante a senador por Arizona, Jim Lamon, en cuyo mensaje de campaña dispara su revólver al estilo Viejo Oeste contra caracterizaciones de la presidenta de la Cámara Baja, Nancy Pelosi, el presidente Joe Biden, y el senador demócrata de Arizona, <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Inimaginables serán para EE.UU. los días sin inmigrantes"
  },
  {
    "id": 944,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Several Republicans already are vying to run against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., in the key battleground state.",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 1368,
    "mediaId": 2601,
    "date": "2022-02-16",
    "sentence": "WFB: Sen. <span class='selected-term'>Mark Kelly</span> (D., Ariz.) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers.",
    "author": "MJA",
    "title": "Arizona Sen. Mark Kelly(D) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers"
  },
  {
    "id": 955,
    "mediaId": 2578,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "COMEDY: Vulnerable Senate Democrats Are Trying To Run As Tax Cutters"
  },
  {
    "id": 916,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "The GOP’s chances of flipping the seat held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> — a key contest in the party’s fight for the Senate majority — are viewed by many in both parties as even better with Ducey, who has been elected statewide three times, than the current cast of MAGA Republicans in the race.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 454,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "The incumbent is Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 16998,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "According to Oli Stokolosa, a Ukraine native and organizer who has lived in Arizona for about 10 years, one of the goals of the protest was to demand action from U.S. Sen. <span class='selected-term'>Mark Kelly</span> and Sinema to deliver the urgency of the message to the White House.",
    "author": "Laura Daniella Sepulveda",
    "title": "'I want Arizonans to be aware': Ukrainians in Phoenix call for more 'severe' action from US against Russia"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17076,
    "mediaId": 8345,
    "date": "2022-03-02",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said Tuesday the money comes from funding authorized by the Infrastructure Investment and Jobs law to protect communities, support recovery efforts, and reduce hazardous fuels on federal, state and tribal lands.",
    "author": "Associated Press",
    "title": "Senators: Federal funding authorized for wildfire recovery"
  },
  {
    "id": 13291,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., also noted the manufacturing issue, while calling for inflation-fighting moves to aid Americans.",
    "author": "Ronald J. Hansen",
    "title": "Unity at start of Biden's State of the Union speech gives way to familiar domestic battles"
  },
  {
    "id": 13161,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "Doug Ducey announced Thursday he would not be a candidate for US Senate in 2022, ending speculation about whether he would reconsider his previous stance against seeking the party's nomination to challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
    "title": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary"
  },
  {
    "id": 12969,
    "mediaId": 2605,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>,” Democratic Senatorial Campaign Committee spokesman Patrick Burgwinkle said in a statement.",
    "author": "Melanie MasonStaff Writer",
    "title": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes"
  },
  {
    "id": 12884,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General Mark Brnovich as the favorite to face incumbent Democrat <span class='selected-term'>Mark Kelly</span> in the November election.",
    "author": "Callie Patteson",
    "title": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch"
  },
  {
    "id": 12873,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate Run for Arizona Gov. Ducey, Blow to GOP Recruiting"
  },
  {
    "id": 12806,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "For months, he had told both reporters pressing him and Republicans courting him that he had little appetite to challenge Senator <span class='selected-term'>Mark Kelly</span>, a first-term Democrat.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 12653,
    "mediaId": 2679,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "STEVE PEOPLES",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 12544,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat <span class='selected-term'>Mark Kelly</span> in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; Blake Masters, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 17002,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like [Arizona’s] <span class='selected-term'>Mark Kelly</span>,” said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle in a press release drawing attention to Republicans’ faltering track record on recruitment.",
    "author": "Igor Bobic",
    "title": "GOP Senate Recruitment Efforts Continue To Fizzle"
  },
  {
    "id": 17129,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "Ducey’s announcement to some of his closest financial allies ends the long-running effort by national and local Republican leaders and deep-pocketed donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could decide which party controls the evenly divided chamber.",
    "author": "Stacey Barchenger",
    "title": "'I have the job I want': Arizona Gov. Doug Ducey will not run for the US Senate in 2022"
  },
  {
    "id": 17027,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "The Arizona Republic reports that Ducey's announcement ends the effort by local and national GOP leaders and affluent donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could determine control of the evenly split upper chamber.",
    "author": "Nicole Wells",
    "title": "Arizona Gov. Doug Ducey Will Not Run for US Senate in 2022"
  },
  {
    "id": 17042,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 17215,
    "mediaId": 2664,
    "date": "2022-03-03",
    "sentence": "Former President Donald Trump celebrated on Thursday after Senate GOP Leader Mitch McConnell (R-KY) failed at recruiting a top contender to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) in the 2022 midterm elections.",
    "author": "Bob Brigham",
    "title": "Trump brags about destroying Mitch McConnell’s plan to recruit a coveted Senate candidate"
  },
  {
    "id": 17308,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like <span class='selected-term'>Mark Kelly</span>,\" said the Democratic Senatorial Campaign Committee.",
    "author": "Dylan Smith",
    "title": "Ducey firmly disavows Senate run: 'I'm an executive'"
  },
  {
    "id": 17344,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat <span class='selected-term'>Mark Kelly</span>, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "author": "John Bowden",
    "title": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate"
  },
  {
    "id": 15633,
    "mediaId": 8416,
    "date": "2022-03-06",
    "sentence": "Attorney General Mark Brnovich is seeking the Republican nomination for the US Senate to challenge incumbent Democrat and Biden supporter, <span class='selected-term'>Mark Kelly</span>.",
    "author": "David Stringer",
    "title": "Yavapai Republican Men’s Forum – Meet Your 2022 Candidates"
  },
  {
    "id": 15425,
    "mediaId": 8451,
    "date": "2022-03-08",
    "sentence": "One proposal, from a group of senators including Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., would suspend the federal gasoline tax for the rest of 2022.",
    "author": "Russ Wiles",
    "title": "Arizona gas prices are going up. Here's how to find the cheapest gas"
  },
  {
    "id": 15519,
    "mediaId": 2553,
    "date": "2022-03-10",
    "sentence": "To that end, from now until November, the SBA List is launching campaigns across the country to “expose the extremism of vulnerable pro-abortion Senators.”\nThe pro-life organization boasts of a massive $72 million 2022 election cycle budget — and it is zeroing in on Sen. <span class='selected-term'>Mark Kelly</span>, targeting the Arizona Democrat with a $1 million ad campaign highlighting Kelly’s abortion stances.",
    "author": "Mary Margaret Olohan",
    "title": "Abortion Is The Crux Of 2022 Elections, Major Pro-Life Group Predicts — And They’re Marshaling All Forces To Win That Battle"
  },
  {
    "id": 15583,
    "mediaId": 8350,
    "date": "2022-03-11",
    "sentence": "PHOENIX – Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona introduced a bipartisan bill Thursday that would create a White House office tasked with promoting rural prosperity nationwide.",
    "author": "KEVIN STONE",
    "title": "US Sen. Mark Kelly of Arizona introduces bill to create rural prosperity office"
  },
  {
    "id": 11087,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Brnovich has been criticized for leading the investigation into fraud by Trump supporters while seeking the former president's endorsement in his 2022 midterm challenge of Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ)/\nIn January, MSNBC's Rachel Maddow laid out a damning timeline of events:\nWatch:",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 15747,
    "mediaId": 8338,
    "date": "2022-03-13",
    "sentence": "Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> announced that federal funds are headed for Arizona projects Friday, including several that will impact Pinal County.",
    "author": "",
    "title": "Senators tout federal funds headed to Pinal County"
  },
  {
    "id": 10873,
    "mediaId": 2520,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., a member of the Senate Armed Services Committee, said in an interview that enforcing a no-fly zone would require a level of involvement that he can't support.",
    "author": "Ronald J. Hansen",
    "title": "After Zelenskyy speech, Arizona delegation calls for more aid to Ukraine without combat"
  },
  {
    "id": 14046,
    "mediaId": 8443,
    "date": "2022-03-18",
    "sentence": "The award application received widespread support including US Senator Krysten Sinema, US Senator <span class='selected-term'>Mark Kelly</span>, US Congressman Paul Gosar, US Congresswoman Debbie Lesko, Governor Doug Ducey, AZ Senator Sonny Borrelli, AZ Representative Regina Cobb, AZ Representative Leo Biasiucci, and AZ Corporation Commission Chairwoman Lea Marquez Peterson.",
    "author": "tsn-thestandard",
    "title": "Mohave Electric Cooperative receives national accolades for Fiber Project"
  },
  {
    "id": 9182,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "The Arizona Republican primary to challenge Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "author": "Eric Mack",
    "title": "Two Polls Show Close Race Between Masters, Lamon"
  },
  {
    "id": 9630,
    "mediaId": 2695,
    "date": "2022-03-22",
    "sentence": "Brnovich is a candidate for U.S. Senate running in the GOP primary to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "Chris Pandolfo",
    "title": "Arizona Republicans advance election bill to end mail-in voting — but it's likely dead on arrival"
  },
  {
    "id": 11591,
    "mediaId": 8322,
    "date": "2022-03-25",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning President Biden against ending Title 42 border restrictions without a \"comprehensive plan\" in place to ensure order at the southern border -- a sharp contrast to the stance of Senate Majority Leader Chuck Schumer.",
    "author": "Adam Shaw",
    "title": "Arizona Dem senators warn Biden against 'sharp end' to Title 42 border restrictions without plan"
  },
  {
    "id": 11605,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "The Journal said the southern half of McCormick Ranch largely is comprised of middle-class and upper-middle-class families, and retirees on fixed incomes vulnerable to inflation — voters both major parties will eye as they battle for an open governor’s seat and a U.S. Senate seat currently held by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Charlie McCarthy",
    "title": "Inflation Expected to Be Key Midterm Issue in Battleground States"
  },
  {
    "id": 12234,
    "mediaId": 2748,
    "date": "2022-03-26",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "author": "Blarp Blog",
    "title": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls"
  },
  {
    "id": 9407,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Vulnerable Democrat Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) trails a generic Republican in Arizona’s Senate race, according to a poll from OHPredictive Insights released this past week.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 11585,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Border Patrol chief says US on track to hit 1M migrant encounters in 6 months as crisis accelerates"
  },
  {
    "id": 9951,
    "mediaId": 2746,
    "date": "2022-03-30",
    "sentence": "Those are worrisome signs for Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Seth McLaughlin",
    "title": "Biden’s approval rating drops to new low in Arizona"
  },
  {
    "id": 10087,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "pic.twitter.com/esgRMhCFrk\n— House Freedom Caucus (@freedomcaucus) March 30, 2022\nArizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) sent a letter to President Biden last week, stating, \"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Julio Rosas",
    "title": "Even Some Democrats Are Telling the Biden Admin to Not End Title 42 At the Southern Border"
  },
  {
    "id": 9879,
    "mediaId": 2520,
    "date": "2022-03-31",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9881,
    "mediaId": 2636,
    "date": "2022-04-01",
    "sentence": "“I heard from a lot of business owners,” Senator <span class='selected-term'>Mark Kelly</span> of Arizona, one of the three Democrats, told Politico by way of justification for his opposition.",
    "author": "",
    "title": "The People, United, Must Fight Hard or Be Defeated"
  },
  {
    "id": 9863,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "“It is not lost on (us) that folks who seized on the Trump Administration’s Title 42 restrictions to stoke fear about migrants bringing COVID into communities were among the first to lift indoor mask mandates and other restrictions.”\nThey continued: “Our government has the tools to safely process and screen people at the border, as required by law, in order to determine whether they qualify for asylum or other humanitarian protections.”\nArizona’s Democratic senators, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both denounced Biden’s decision to end Title 42.",
    "author": "Ariana Figueroa",
    "title": "Biden administration to halt pandemic policy blocking migrants who claim asylum"
  },
  {
    "id": 9839,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "Democratic Sen. <span class='selected-term'>Mark Kelly</span> has taken the lead in getting the bill passed, and noted in November, after getting it out of committee, that “it is a captivating natural and geological wonder— a real gem in our state.”\n“Chiricahua Monument is a natural wonder and deserves to be a national park,\" he said in a public statement on Thursday.",
    "author": "Bennito L. Kelty",
    "title": "Senate OKs bill to establish Chiricahua National Park, measure still awaits House action"
  },
  {
    "id": 9870,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "In Arizona, Sen. <span class='selected-term'>Mark Kelly</span> is up for reelection.",
    "author": "Stephen Dinan",
    "title": "Romney predicts GOP election wins due to Biden’s embrace of border chaos"
  },
  {
    "id": 10562,
    "mediaId": 2695,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Alex Nitzberg",
    "title": "Manchin condemns 'frightening decision' to nix Title 42 order, says it will result in an even greater flow of migrants along the southern border"
  },
  {
    "id": 10454,
    "mediaId": 8309,
    "date": "2022-04-01",
    "sentence": "“If we want to be resolute world power, we must not only compete in the global commons but also compete and win in contested sovereigns,” said Gen. <span class='selected-term'>Mark Kelly</span>, commander of ACC.",
    "author": "",
    "title": "Detachment 1 activates at DM under ACC co-lead effort to hone Information Warfare readiness"
  },
  {
    "id": 10016,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Manchin calls Biden lifting Title 42 border policy 'frightening decision'"
  },
  {
    "id": 7075,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 7538,
    "mediaId": 2859,
    "date": "2022-04-01",
    "sentence": "Here are the eight races to watch in the West:\nArizona U.S. Senate\nSen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is facing his first reelection campaign.",
    "author": "D. Hunter Schwarz",
    "title": "These 8 midterm races in the West could decide who controls Congress"
  },
  {
    "id": 10690,
    "mediaId": 2595,
    "date": "2022-04-02",
    "sentence": "",
    "author": "M Dowling",
    "title": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”"
  },
  {
    "id": 9921,
    "mediaId": 8350,
    "date": "2022-04-03",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said in a statement that they asked U.S.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from April 1-3"
  },
  {
    "id": 9912,
    "mediaId": 6509,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal Lawsuit Seeks to Block End to Title 42 Asylum Limits"
  },
  {
    "id": 9899,
    "mediaId": 4045,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Missouri among states suing to stop Biden administration from ending asylum limits"
  },
  {
    "id": 10004,
    "mediaId": 8475,
    "date": "2022-04-04",
    "sentence": "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly and humane process at the border,” said Sen. <span class='selected-term'>Mark Kelly</span>, whose comments were echoed by fellow Arizona Democratic Sen. Kyrsten Sinema.",
    "author": "Emily Sacia",
    "title": "With Title 42 winding down, worries rise about handling migrant surge"
  },
  {
    "id": 9986,
    "mediaId": 2520,
    "date": "2022-04-04",
    "sentence": "Former Sen. Martha McSally was the lead Republican on the bill but was not reelected; she was succeeded by <span class='selected-term'>Mark Kelly</span>.",
    "author": "Barry Kluger",
    "title": "Every parent who loses a child deserves to have paid time off to grieve"
  },
  {
    "id": 7933,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La queja republicana incluso cita a senadores demócratas de Arizona, <span class='selected-term'>Mark Kelly</span> y Kirsten Sinema, que consideran que la Administración Biden terminará el programa “sin estar lista”.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 7579,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning Biden against ending the “border restrictions without a comprehensive plan” to secure the border.",
    "author": "Elvia Díaz",
    "title": "Tired of COVID-19 restrictions? Then don't complain about the end of Title 42"
  },
  {
    "id": 8013,
    "mediaId": 8345,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal lawsuit seeks to block end to sweeping U.S. asylum limits"
  },
  {
    "id": 7979,
    "mediaId": 2573,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about it being lifted without proper planning.",
    "author": "Adam Shaw",
    "title": "Sen. Tester becomes latest Democrat to oppose Biden move to end Title 42"
  },
  {
    "id": 7092,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "author": "EJ Montini",
    "title": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie"
  },
  {
    "id": 8648,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Another CNN host said it was understandable that Sen. <span class='selected-term'>Mark Kelly</span>, Democrat of Arizona, expressed concern that the change would start another stampede to the border.",
    "author": "",
    "title": "Three Questions On Immigration That Democrats Should Ask"
  },
  {
    "id": 8617,
    "mediaId": 2877,
    "date": "2022-04-05",
    "sentence": "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.” —Senator <span class='selected-term'>Mark Kelly</span>\n“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants.",
    "author": "Jordan Candler /",
    "title": "Tuesday Short Cuts"
  },
  {
    "id": 8860,
    "mediaId": 8347,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Bivian Contreras",
    "title": "President Biden signs Shadow Wolves Enhancement Act into law"
  },
  {
    "id": 7059,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7055,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Via AP news wire",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7991,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Hawley grills Biden admin on migrant surge, whether DHS plans to give phones to illegal immigrants"
  },
  {
    "id": 8147,
    "mediaId": 8350,
    "date": "2022-04-06",
    "sentence": "PHOENIX – U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona said Wednesday the Biden administration’s decision to lift a public health ban on asylum seekers at the southern border soon “is a really bad idea” for now.",
    "author": "KTAR.COM",
    "title": "Arizona Sen. Kelly sees end of COVID border policy as ‘crisis on top of a crisis’"
  },
  {
    "id": 7549,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump’s endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 7392,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Brnovich is seeking Trump's endorsement as he runs for the U.S. Senate in Arizona against incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Matthew Chapman",
    "title": "Trump’s 'Big Lie' undermined by long-awaited report from Arizona attorney general"
  },
  {
    "id": 7680,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7947,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "So, will this love letter be enough to get Trump's endorsement so Brnovich can be the guy to take on Sen. <span class='selected-term'>Mark Kelly</span>?",
    "author": "Liz Dye",
    "title": "Arizona AG, Hoping For Trump Nod, Produces Election 'Report' Heavy On Innuendo, Light On Data"
  },
  {
    "id": 7126,
    "mediaId": 2520,
    "date": "2022-04-07",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., easily collected the most signatures in his bid for re-election.",
    "author": "Ronald J. Hansen",
    "title": "Arizona congressional races slightly clearer after primary qualification deadline passes"
  },
  {
    "id": 7336,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "“Because of <span class='selected-term'>Mark Kelly</span>, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  },
  {
    "id": 8499,
    "mediaId": 6461,
    "date": "2022-04-07",
    "sentence": "In Arizona, where a Democratic senator, <span class='selected-term'>Mark Kelly</span>, is vulnerable, prices are up by 50%.",
    "author": "",
    "title": "Spiralling fuel prices add to Democrats’ woes"
  },
  {
    "id": 8161,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "Kyrsten Sinema, D-Ariz., and <span class='selected-term'>Mark Kelly</span>, D-Ariz., oppose ending the policy without a \"comprehensive, workable plan in place,\" saying the would overwhelm Arizona border communities and stretch the resources of nonprofits that are already near capacity.",
    "author": "Clara Migoya",
    "title": "What is Title 42 and how does it affect the Arizona border? The immigration policy, explained"
  },
  {
    "id": 8036,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "Senator from Arizona, <span class='selected-term'>Mark Kelly</span>, never left her side.",
    "author": "EJ Montini",
    "title": "Reminded of what America lost – and gained – when Gabby Giffords was shot"
  },
  {
    "id": 8827,
    "mediaId": 8430,
    "date": "2022-04-09",
    "sentence": "On behalf of the hardworking business owners in Chandler and their customers, I hope that Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> will stop this misguided proposal before it’s too late.",
    "author": "SanTan Sun News",
    "title": "Don’t make tax season harder for Arizona small businesses"
  },
  {
    "id": 6997,
    "mediaId": 8484,
    "date": "2022-04-10",
    "sentence": "The Democratic senators on board with the upper chamber bill to keep Title 42 as long as the health emergency remains are moderates Krysten Sinema of Arizona and Joe Manchin of West Virginia as well as <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Katelyn Caralle",
    "title": "Now 11 DEMOCRATS oppose Biden ending Title 42: Texas Rep. Henry Cuellar is the latest to join bipartisan legislation to KEEP the pandemic-era policy at the border"
  },
  {
    "id": 6972,
    "mediaId": 8347,
    "date": "2022-04-11",
    "sentence": "The policy change, though, is frustrating conservatives like McCarthy, as well as moderate Democratic senators like Senator <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Senator Catherine Cortez Masto of Nevada and Senator Jon Tester of Montana.",
    "author": "Joe St. George",
    "title": "What is Title 42 and what is being done to address an expected surge?"
  },
  {
    "id": 7037,
    "mediaId": 2690,
    "date": "2022-04-11",
    "sentence": "They were joined by Senators John Cornyn (R-TX), <span class='selected-term'>Mark Kelly</span> (D-AZ), John Thune (R-SD), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), and Thom Tillis (R-NC).",
    "author": "Mike Smith",
    "title": "Bipartisan Group of Senators Introduce Bill to Block Termination of Title 42"
  },
  {
    "id": 6645,
    "mediaId": 8378,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Krista Allen",
    "title": "‘A big win for Tuba City’: Kelly, Sinema add long-term care in omnibus budget bill"
  },
  {
    "id": 5691,
    "mediaId": 2574,
    "date": "2022-04-11",
    "sentence": "The candidates are vying for a chance to run against incumbent Democratic senator <span class='selected-term'>Mark Kelly</span>, who is viewed as one of the most vulnerable candidates in the election cycle.",
    "author": "Washington Free Beacon Staff",
    "title": "Poll: Lamon Leads in Arizona’s GOP Senate Primary"
  },
  {
    "id": 6592,
    "mediaId": 2589,
    "date": "2022-04-11",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada.",
    "author": "John Sexton",
    "title": "Democrats are heading for disaster in the Senate"
  },
  {
    "id": 6914,
    "mediaId": 8386,
    "date": "2022-04-12",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have since introduced a Senate bill delaying the end of the measure.",
    "author": "Angela Gervasi • Nogales International",
    "title": "For migrants, desert journey remains ‘unforgiving’"
  },
  {
    "id": 6871,
    "mediaId": 6404,
    "date": "2022-04-12",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada…\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nSo Democrats are likely to lose 3-4 Senate seats this year and that’s just the start of their troubles.",
    "author": "Mike LaChance",
    "title": "It’s Starting To Look Like Democrats Are Going To Lose The Senate This Year"
  },
  {
    "id": 6795,
    "mediaId": 2741,
    "date": "2022-04-13",
    "sentence": "Cosponsors on the legislation included two Democrats, <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire, both of whom are facing uphill reelection battles this cycle.",
    "author": "Eric Lutz",
    "title": "Beto O'Rourke Wants Biden To End Pandemic Border Restrictions. But Not Like This."
  },
  {
    "id": 6700,
    "mediaId": 8347,
    "date": "2022-04-14",
    "sentence": "In Douglas on Wednesday, Senator <span class='selected-term'>Mark Kelly</span> said the immigration system was stressed before Title 42 and lifting the restriction should make things worse.",
    "author": "Craig Smith",
    "title": "Rep. Grijalva splits with Senators on Title 42"
  },
  {
    "id": 6933,
    "mediaId": 2545,
    "date": "2022-04-15",
    "sentence": "Despite much Super-PAC spending on their behalf, only one of them, former astronaut <span class='selected-term'>Mark Kelly</span>, actually got elected.",
    "author": "Steve Early - Suzanne Gordon",
    "title": "Green Ex-Marine: Matthew Hoh is a Different Kind of “Service Candidate”"
  },
  {
    "id": 5515,
    "mediaId": 3993,
    "date": "2022-04-15",
    "sentence": "There’s a pretty crowded field of Republican candidates vying to unseat first-term senator and gun control activist <span class='selected-term'>Mark Kelly</span> from his seat in Arizona later this year, but to the best of my knowledge only one of them has proudly talked about building his own guns.",
    "author": "Cam Edwards",
    "title": "AZ Senate candidate: gun control is dead"
  },
  {
    "id": 6341,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Democrats are defending four incumbents in closely contested states: Hassan, Warnock, Nevada Sen. Catherine Cortez Masto and Sen. <span class='selected-term'>Mark Kelly</span> in Arizona.",
    "author": "",
    "title": "McConnell-tied super PAC makes early $141M play for the Senate"
  },
  {
    "id": 4922,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "",
    "author": "NationalWatch",
    "title": "Senate Homeland Security Chair Peters Says Plan to Drop Title 42 ‘Should Be Revisited’"
  },
  {
    "id": 4904,
    "mediaId": 8295,
    "date": "2022-04-18",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "Camila Pedrosa",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 4729,
    "mediaId": 8284,
    "date": "2022-04-19",
    "sentence": "",
    "author": "",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  },
  {
    "id": 5837,
    "mediaId": 8428,
    "date": "2022-04-19",
    "sentence": "The winner of the Republican primaries will face off against incumbent Democrat Sen. <span class='selected-term'>Mark Kelly</span> on Nov. 8.",
    "author": "Alex Caldwell",
    "title": "Trump will not endorse Arizona Attorney General Mark Brnovich for U.S. Senate"
  },
  {
    "id": 5143,
    "mediaId": 8295,
    "date": "2022-04-20",
    "sentence": "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., said earlier this month, as he introduced a bill to delay that move.",
    "author": "Reagan Priest/Cronkite News",
    "title": "Border numbers hit highest level in 20 years, as end of Title 42 looms"
  },
  {
    "id": 4971,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "One of those who has expressed doubts that Title 42 should be ended is Senator <span class='selected-term'>Mark Kelly</span> of Arizona who is up for reelection in November in a state that will be heavily affected by the opening of the floodgates, and the retired astronaut raised his concerns with Fox News Digital on Friday.",
    "author": "Chris Donaldson",
    "title": "Midterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42"
  },
  {
    "id": 5108,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "A Republican candidate looking to replace Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> is getting some blowback for a campaign ad, making it the third time this year his public messaging struck a sour note, according to the Phoenix New Times' Elias Weiss.",
    "author": "Sky Palma",
    "title": "GOP candidate released a dramatic 'savior' ad – and it might be blowing up in his face: report"
  },
  {
    "id": 5062,
    "mediaId": 6746,
    "date": "2022-04-20",
    "sentence": "Senators <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both Democrats from Arizona, have questioned whether the Biden administration is adequately prepared to ease the limitations.",
    "author": "Madz Dizon",
    "title": "Title 42: Agencies May Run Out of Funds Amid Looming End of Trump-Era Immigration Policy as Biden Administration Pressure Runs High"
  },
  {
    "id": 4705,
    "mediaId": 8416,
    "date": "2022-04-20",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers – Cronkite News"
  },
  {
    "id": 5117,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Sen. <span class='selected-term'>Mark Kelly</span> said earlier this month, as he introduced a bill to delay that move.",
    "author": "Reagan Priest",
    "title": "Border numbers hit highest level in 20 years, as end of Title 42 looms"
  },
  {
    "id": 4839,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "Even as the White House mistakenly continues to push the same tax and spend agenda, it is my hope that our Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> reject these massive new spending proposals and listen to their constituents instead.",
    "author": "Guest Opinion",
    "title": "Fix inflation, don’t pass big spending bills"
  },
  {
    "id": 4681,
    "mediaId": 2866,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Fix This Nation Staff",
    "title": "Dem’s Sweetheart Slams Biden’s Border Effort"
  },
  {
    "id": 4660,
    "mediaId": 8295,
    "date": "2022-04-22",
    "sentence": "“La administración de Biden se equivocó al establecer una fecha de finalización para el Título 42 sin un plan integral”, dijo el senador <span class='selected-term'>Mark Kelly</span>, demócrata por Arizona, a principios de este mes, cuando presentó un proyecto de ley para retrasar esa medida.",
    "author": "Por Reagan Priest/Cronkite Noticias",
    "title": "Los números fronterizos alcanzan el nivel más alto en 20 años, a medida que se avecina el fin del Título 42"
  },
  {
    "id": 5112,
    "mediaId": 2522,
    "date": "2022-04-23",
    "sentence": "“And the reality is, Joe Biden and ‘Cartel Kelly'” Brnovich said referring to incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), “are trying to impose some neo-Marxist vision on this country and Americans are paying the price, not only at the gas pump and the grocery store, but literally with our lives and the lives of our children.",
    "author": "Kevin Haggerty",
    "title": "Arizona AG tears into Dems suddenly recognizing border crisis, importance of Title 42"
  },
  {
    "id": 5021,
    "mediaId": 8475,
    "date": "2022-04-23",
    "sentence": "“La administración de Biden se equivocó al establecer una fecha de finalización para el Título 42 sin un plan integral”, dijo el senador <span class='selected-term'>Mark Kelly</span>, demócrata por Arizona, a principios de este mes, cuando presentó un proyecto de ley para retrasar esa medida.",
    "author": "Reagan Priest",
    "title": "Números fronterizos son más alto en 20 años, mientras llega el fin del Título 42"
  }
]