[
  {
    "id": 10496,
    "mediaId": 6449,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> sent a letter to Biden expressing their concern.",
    "author": "Jarrett Stepman",
    "title": "Border Crisis Is About to Get a Lot Worse"
  },
  {
    "id": 10381,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "author": "Callie Patteson",
    "title": "Biden administration to scrap Title 42 border policy by May 23 despite warnings: reports"
  },
  {
    "id": 10022,
    "mediaId": 2553,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Gabe Kaminsky",
    "title": "White House Expects Migrant ‘Influx’ If Anticipated Order Scrapping Trump-Era Policy Implemented"
  },
  {
    "id": 10148,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "Senators Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) wrote to Biden last week with their concerns on ending the directive, telling him to continue the order.",
    "author": "Charlotte Pence Bond",
    "title": "‘The Borders Have To Be Secure’: Manchin Pans Plans To End Title 42"
  },
  {
    "id": 9837,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Arizona’s two (very nervous) Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, dashed off a letter to President Biden last week urging him not to cancel Title 42 without a viable plan that will control the border in its absence.",
    "author": "RJ Hauman",
    "title": "Exclusive–Hauman: Get Ready for a Border Surge the Likes of Which Our Country Has Never Seen"
  },
  {
    "id": 9812,
    "mediaId": 2584,
    "date": "2022-04-01",
    "sentence": "We are already facing an unprecedented increase in migrants this year.”\n<span class='selected-term'>Mark Kelly</span>, a Democratic senator from Arizona who faces a tough re-election fight, said: “This is a crisis and in my estimation, because of a lack of planning from the administration, it’s about to get worse.”\nThe Department of Homeland Security (DHS) insists it will be ready.",
    "author": "David Smith",
    "title": "Biden ends Trump-era asylum curbs amid border-region Democrat backlash"
  },
  {
    "id": 9910,
    "mediaId": 2551,
    "date": "2022-04-03",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with the Department of Homeland Security (DHS) about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Katelyn Caralle",
    "title": "Now White House blames border crisis on CONGRESS as administration braces for massive influx of asylum claims as CDC announced impending end to pandemic-era Title 42"
  },
  {
    "id": 9912,
    "mediaId": 6509,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal Lawsuit Seeks to Block End to Title 42 Asylum Limits"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 8699,
    "mediaId": 2609,
    "date": "2022-04-07",
    "sentence": "But rather than view it as a public health victory, some moderate Democrats see a huge political liability, leaving them furious that the White House ended policy ahead of a tough midterm election…\nSen. Joe Manchin (D-W.Va.) called it a “frightening decision.” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) called it “wrong.” And Sen. Maggie Hassan (D-N.H.) said the Biden administration “does not appear to be ready” for the surge in migration that could result.",
    "author": "Mike LaChance",
    "title": "Obama’s DHS Secretary Jeh Johnson Against Ending Title 42, Says Southern Border Not Sustainable"
  },
  {
    "id": 8690,
    "mediaId": 2724,
    "date": "2022-04-07",
    "sentence": "“It seems highly unlikely it will be adequate by May 23, because of poor logistics.”\nSinema and fellow Arizona Democrat <span class='selected-term'>Mark Kelly</span> issued statements about Biden’s move, with Kelly saying, “This is the wrong decision.",
    "author": "Rusty Weiss",
    "title": "Bipartisan Group Fighting Back Against Biden’s Effort to Lift Title 42, A Move Expected to Create Surge of Illegal Immigrants"
  },
  {
    "id": 4870,
    "mediaId": 2855,
    "date": "2022-04-18",
    "sentence": "That is likely why Democratic Sen. <span class='selected-term'>Mark Kelly</span> (Ariz.), who is facing reelection in a tight contest this year, is being so openly critical of DHS’s handling of illegal migration at the Southwest border, and its ability to deal with a post Title 42 migrant tsunami:\nRight now we have a crisis on our southern border.",
    "author": "Andrew R. Arthur",
    "title": "Polling Shows Trouble for Biden"
  },
  {
    "id": 4918,
    "mediaId": 2751,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike at US-Mexico border as US plans to lift curb on asylum"
  },
  {
    "id": 5152,
    "mediaId": 2721,
    "date": "2022-04-20",
    "sentence": "However, other signatories include lesser-known Democrats in close fights for re-election, like <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire.",
    "author": "",
    "title": "Joe Biden’s immigration dilemma"
  },
  {
    "id": 5648,
    "mediaId": 2855,
    "date": "2022-04-21",
    "sentence": "Kyrsten Sinema, <span class='selected-term'>Mark Kelly</span>, Maggie Hassan, Jon Tester, and Joe Manchin, who joined with Republican Sen. James Lankford and other Republicans to introduce a bill (S. 4036) to put obstacles in the way of termination:\n[The order] shall be lifted not earlier than 60 days after the date on which the Surgeon General provides written notification to ... Congress that such public health emergency declaration ... ha[s] been terminated.",
    "author": "George Fishman",
    "title": "42 Skiddo: Is the Biden Administration Expelling Border Security?"
  },
  {
    "id": 4989,
    "mediaId": 2694,
    "date": "2022-04-21",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span> of Arizona visited the U.S.-Mexico border, and in a sign of the issue’s political salience, so did Senator Maggie Hassan of New Hampshire, despite the fact that New Hampshire is nowhere near Mexico.",
    "author": "David A. Graham",
    "title": "The Punt Presidency"
  }
]