[
  {
    "id": 2723,
    "mediaId": 8475,
    "date": "2022-01-28",
    "sentence": "Arizona Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat elected in a special election in 2020, praised Breyer for protecting freedom of speech, reproductive rights and health care access as a justice.",
    "author": "Jennifer Shutt",
    "title": "Biden vows to nominate first Black woman to Supreme Court by end of February"
  },
  {
    "id": 11797,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) have urged the administration to continue enforcing the authority.",
    "author": "John Binder",
    "title": "Report: Biden Officials Prepare for ‘Mass Migration Event’ at Southern Border"
  },
  {
    "id": 9976,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum Limits At Border Expected To End May 23: Report"
  },
  {
    "id": 8407,
    "mediaId": 6406,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Ketanji Brown Jackson Will Be A Liability for Senate Democrats"
  },
  {
    "id": 6473,
    "mediaId": 2800,
    "date": "2022-04-17",
    "sentence": "WASHINGTON (Sputnik) - A group of US lawmakers will travel to Germany, Poland, India, and the United Arab Emirates (UAE) to try to secure stronger support for... 18.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e5/0b/1e/1091155623_0:0:3073:1728_1920x0_80_0_0_cb53c02e02c3fb7715ece47413485b1d.jpg.webp\nThe Congressional lawmakers will include US Senators <span class='selected-term'>Mark Kelly</span>, Kirsten Gillibrand, Cory Booker, and Ed Markey, as well as House of Representatives member Mondaire Jones.The delegation’s upcoming nine-day trip was announced by Kelly in an e-mail to the newspaper on Sunday evening.According to The Hill, Germany, Poland, India, and the UAE have not been active enough in cooperating with US-led efforts to isolate Russia.Russia launched its special military operation in Ukraine on February 24, after the Donetsk and Lugansk People’s Republics (DPR and LPR) appealed for help in defending themselves against Ukrainian provocations.",
    "author": "",
    "title": "US Congress Members to Visit Germany, UAE, Hoping to Get More Support For Kiev - Reports"
  },
  {
    "id": 4768,
    "mediaId": 2696,
    "date": "2022-04-23",
    "sentence": "",
    "author": "Marcus E. Howard",
    "title": "Sen. Ed Markey calls on the U.S. to lift the cap on Ukrainian refugees"
  }
]