[
  {
    "id": 13369,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Both Sen. Joe Manchin (D-W.Va.) and Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said Tuesday that they were undecided about Gonzalez and planned to spend more time reviewing the allegations against him.",
    "author": "",
    "title": "White House tries to avoid a Raskin repeat as ICE pick teeters in Senate"
  },
  {
    "id": 7967,
    "mediaId": 2573,
    "date": "2022-04-08",
    "sentence": "The bill includes not only Republicans such as Sen. James Lankford, R-Okla., and Sen. John Cornyn, R-Texas, but also a number of Democrats: Sens <span class='selected-term'>Mark Kelly</span>, D-Ariz., Kyrsten Sinema, D-Ariz., Jon Tester, D-Mont., Joe Manchin, D-W.Va., and Maggie Hassan, D-N.H.",
    "author": "Adam Shaw",
    "title": "Senate lawmakers eye hearing on Title 42 repeal amid bipartisan pushback, fears of migrant surge"
  },
  {
    "id": 4910,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "\"Right now, this administration does not have a plan,\" Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., said while visiting the border in his state.",
    "author": "NationalWatch",
    "title": "Some Senate Dems Pushing Back on Biden Lifting Title 42 Border Restrictions"
  },
  {
    "id": 4922,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "",
    "author": "NationalWatch",
    "title": "Senate Homeland Security Chair Peters Says Plan to Drop Title 42 ‘Should Be Revisited’"
  },
  {
    "id": 4742,
    "mediaId": 2557,
    "date": "2022-04-18",
    "sentence": "Democratic Sen. <span class='selected-term'>Mark Kelly</span> says Biden has 'no plan.'",
    "author": "DML News App",
    "title": "REPORT: Biden faces deepening Democratic rift over Title 42"
  },
  {
    "id": 4971,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "One of those who has expressed doubts that Title 42 should be ended is Senator <span class='selected-term'>Mark Kelly</span> of Arizona who is up for reelection in November in a state that will be heavily affected by the opening of the floodgates, and the retired astronaut raised his concerns with Fox News Digital on Friday.",
    "author": "Chris Donaldson",
    "title": "Midterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42"
  },
  {
    "id": 5067,
    "mediaId": 2572,
    "date": "2022-04-20",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for reelection this year, along with Delaware Sen. Christopher Coons, Michigan's Gary Peters, and Kelly's intrastate counterpart Kyrsten Sinema, have all voiced support for retaining Title 42 protections, she said.",
    "author": "",
    "title": "Border rancher fumes at Biden, says officials need to 'get off their butts' and see what he's seeing"
  }
]