[
  {
    "id": 4469,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) is not yet committed to a rules overhaul that would allow elections reform legislation to pass by a simple majority, he told Burgess and Marianne on Monday.",
    "author": "",
    "title": "Democrats look for a roadmap on rules changes"
  },
  {
    "id": 3572,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nTHE NEW SOUTHWEST CENTRISM — Sen. <span class='selected-term'>MARK KELLY</span> is the subject of a lengthy new profile from the Arizona Republic’s Yvonne Wingett Sanchez that offers as good a glimpse as any into how the freshman Democrat aims to position himself as he heads into what is likely to be a highly competitive reelection campaign this fall.",
    "author": "",
    "title": "POLITICO Playbook: MLK’s family hopes Biden is working today"
  },
  {
    "id": 3569,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.), all previously reluctant to chip at the filibuster.",
    "author": "",
    "title": "Why Schumer picked a filibuster fight he couldn't win"
  },
  {
    "id": 3573,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) endorsed a rules change specific to elections legislation, and Sens.",
    "author": "",
    "title": "Senate Dems' filibuster ambitions fall short"
  },
  {
    "id": 3708,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "U.S. Sen. <span class='selected-term'>Mark Kelly</span> announced Wednesday morning that he would support altering filibuster rules if Republicans block the measures.",
    "author": "Reagan Priest",
    "title": "Arizonans protest at U.S. Capitol as Senate takes up voting rights, Kelly endorses changing filibuster"
  },
  {
    "id": 3718,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 3604,
    "mediaId": 2590,
    "date": "2022-01-20",
    "sentence": "“I wanted to talk to you about a decision I’ve made,” Sen. <span class='selected-term'>Mark Kelly</span> (D) wrote in an email to supporters on Thursday afternoon.",
    "author": "Amanda Terkel",
    "title": "Arizona Sen. Mark Kelly Throws Shade At Kyrsten Sinema's Filibuster Reform Vote"
  },
  {
    "id": 3639,
    "mediaId": 2520,
    "date": "2022-01-22",
    "sentence": "The liberals' debate over how to respond to Sinema's filibuster stance largely overshadowed the decision by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., to back a maneuver to weaken the filibuster rule only for the voting rights legislation that he co-sponsored.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Sen. Kyrsten Sinema censured by Arizona Democratic Party executive board over filibuster vote"
  },
  {
    "id": 3775,
    "mediaId": 2607,
    "date": "2022-01-22",
    "sentence": "Sinema’s fight with the left has overshadowed the 2022 reelection bid of <span class='selected-term'>Mark Kelly</span>, Arizona’s other Democratic senator, who will be trying to hold on to the seat he won in a special election.",
    "author": "Associated Press",
    "title": "Arizona Democrats censure Sinema over voting rights bill"
  },
  {
    "id": 3555,
    "mediaId": 2658,
    "date": "2022-01-25",
    "sentence": "Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.), for example, will almost certainly be compared with Sinema and attacked by Republicans as a party pawn for backing an end run around the filibuster.",
    "author": "",
    "title": "POLITICO Playbook: Schumer strategy leaves some Dems seething"
  },
  {
    "id": 3637,
    "mediaId": 2590,
    "date": "2022-01-26",
    "sentence": "The state’s other Democratic senator, <span class='selected-term'>Mark Kelly</span>, is already fundraising off of his vote for the filibuster change ahead of a reelection campaign this fall.",
    "author": "Travis Waldron",
    "title": "The Death Of Dems' Voting Rights Bill Is A Green Light For GOP State Legislatures"
  },
  {
    "id": 3711,
    "mediaId": 2746,
    "date": "2022-01-26",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> disagrees with the Arizona Democratic Party’s decision to censure Sen. Kyrsten Sinema after she refused to change Senate rules to pass a bill to overhaul federal elections.",
    "author": "Seth McLaughlin",
    "title": "Sen. Mark Kelly defends Sen. Kyrsten Sinema against Arizona Democratic Party censure"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 2807,
    "mediaId": 2550,
    "date": "2022-01-29",
    "sentence": "Her fellow member in the senate, <span class='selected-term'>Mark Kelly</span>, was able to take that risk.",
    "author": "",
    "title": "Connect! Unite! Act! What makes for vulnerability and courage?"
  },
  {
    "id": 2717,
    "mediaId": 8475,
    "date": "2022-02-01",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are pushing Gov.",
    "author": "Paul Ingram",
    "title": "Sinema, Kelly urge Ducey to send Nat'l Guard to Az hospitals stressed by COVID"
  },
  {
    "id": 2771,
    "mediaId": 2658,
    "date": "2022-02-01",
    "sentence": "So, I don’t get it,” said Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Dems try to move on"
  },
  {
    "id": 2761,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "If Masters is able to win the Republican senatorial primary and unseat <span class='selected-term'>Mark Kelly</span>, Arizona can be the stepping stone towards garnering for the America First movement one of its most significant victories of 2022.",
    "author": "Kenny Cody",
    "title": "A Blake Masters Ariz. Win Would Boost America First Movement"
  },
  {
    "id": 1974,
    "mediaId": 2658,
    "date": "2022-02-06",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: A Manchin-Murkowski mindmeld"
  },
  {
    "id": 1815,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and Rep. Dave Schweikert are pushing for an extension of telehealth coverage for people enrolled in Medicare beyond 2023.",
    "author": "Cami Parrish",
    "title": "Sinema, Kelly and Schweikert want extension of telehealth coverage"
  },
  {
    "id": 16998,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "According to Oli Stokolosa, a Ukraine native and organizer who has lived in Arizona for about 10 years, one of the goals of the protest was to demand action from U.S. Sen. <span class='selected-term'>Mark Kelly</span> and Sinema to deliver the urgency of the message to the White House.",
    "author": "Laura Daniella Sepulveda",
    "title": "'I want Arizonans to be aware': Ukrainians in Phoenix call for more 'severe' action from US against Russia"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17076,
    "mediaId": 8345,
    "date": "2022-03-02",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said Tuesday the money comes from funding authorized by the Infrastructure Investment and Jobs law to protect communities, support recovery efforts, and reduce hazardous fuels on federal, state and tribal lands.",
    "author": "Associated Press",
    "title": "Senators: Federal funding authorized for wildfire recovery"
  },
  {
    "id": 13291,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., also noted the manufacturing issue, while calling for inflation-fighting moves to aid Americans.",
    "author": "Ronald J. Hansen",
    "title": "Unity at start of Biden's State of the Union speech gives way to familiar domestic battles"
  },
  {
    "id": 17308,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like <span class='selected-term'>Mark Kelly</span>,\" said the Democratic Senatorial Campaign Committee.",
    "author": "Dylan Smith",
    "title": "Ducey firmly disavows Senate run: 'I'm an executive'"
  },
  {
    "id": 15390,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span>, a former astronaut who won a 2020 special election with 51.2% of the vote, secured more than 40 projects in the final government spending bill.",
    "author": "Jennifer Shutt",
    "title": "Return of earmarks a boon for members of Congress facing midterm battles"
  },
  {
    "id": 15747,
    "mediaId": 8338,
    "date": "2022-03-13",
    "sentence": "Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> announced that federal funds are headed for Arizona projects Friday, including several that will impact Pinal County.",
    "author": "",
    "title": "Senators tout federal funds headed to Pinal County"
  },
  {
    "id": 14071,
    "mediaId": 2557,
    "date": "2022-03-15",
    "sentence": "Michael Bennet, Catherine Cortez Masto, Maggie Hassan, <span class='selected-term'>Mark Kelly</span>, Joe Manchin, Jacky Rosen, Kyrsten Sinema, and Jon Tester.",
    "author": "DML News App",
    "title": "REPORT: White House threatens veto of Rand Paul legislation which just passed in Senate with bipartisan support"
  },
  {
    "id": 14046,
    "mediaId": 8443,
    "date": "2022-03-18",
    "sentence": "The award application received widespread support including US Senator Krysten Sinema, US Senator <span class='selected-term'>Mark Kelly</span>, US Congressman Paul Gosar, US Congresswoman Debbie Lesko, Governor Doug Ducey, AZ Senator Sonny Borrelli, AZ Representative Regina Cobb, AZ Representative Leo Biasiucci, and AZ Corporation Commission Chairwoman Lea Marquez Peterson.",
    "author": "tsn-thestandard",
    "title": "Mohave Electric Cooperative receives national accolades for Fiber Project"
  },
  {
    "id": 12234,
    "mediaId": 2748,
    "date": "2022-03-26",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "author": "Blarp Blog",
    "title": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls"
  },
  {
    "id": 11797,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) have urged the administration to continue enforcing the authority.",
    "author": "John Binder",
    "title": "Report: Biden Officials Prepare for ‘Mass Migration Event’ at Southern Border"
  },
  {
    "id": 11585,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Border Patrol chief says US on track to hit 1M migrant encounters in 6 months as crisis accelerates"
  },
  {
    "id": 10496,
    "mediaId": 6449,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> sent a letter to Biden expressing their concern.",
    "author": "Jarrett Stepman",
    "title": "Border Crisis Is About to Get a Lot Worse"
  },
  {
    "id": 9867,
    "mediaId": 2746,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, Arizona Democrats, fired off a letter last week urging a go-slow approach and complained of “the lack of a specific plan” for handling the expected surge.",
    "author": "Stephen Dinan",
    "title": "ICE officers prepare for ‘massive crash’ in immigration system"
  },
  {
    "id": 9824,
    "mediaId": 5118,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum limits at Mexico border expected to end May 23, sources say; US braces for influx of migrants"
  },
  {
    "id": 10022,
    "mediaId": 2553,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Gabe Kaminsky",
    "title": "White House Expects Migrant ‘Influx’ If Anticipated Order Scrapping Trump-Era Policy Implemented"
  },
  {
    "id": 10381,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "author": "Callie Patteson",
    "title": "Biden administration to scrap Title 42 border policy by May 23 despite warnings: reports"
  },
  {
    "id": 10328,
    "mediaId": 6519,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C.— In response to the Senate’s failed effort to move David Weil’s nomination forward, Adam Brandon, FreedomWorks President, commented:\n“We applaud the 50 Republican Senators and the three Democratic Senators–West Virginia’s Joe Manchin and Arizona’s Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>–who voted against cloture on the nomination of David Weil to be Administrator of the Department of Labor’s Wage and Hour Division.”\n“Weil’s confirmation to this position would have harmed workers as well as employers, particularly small businesses.",
    "author": "Adam Brandon",
    "title": "FreedomWorks Statement in Response to Failed Effort to Move David Weil’s Nomination Forward"
  },
  {
    "id": 10200,
    "mediaId": 2930,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body Blow to Working People': Right-Wing Democrats Reject Biden Labor Nominee"
  },
  {
    "id": 10148,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "Senators Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) wrote to Biden last week with their concerns on ending the directive, telling him to continue the order.",
    "author": "Charlotte Pence Bond",
    "title": "‘The Borders Have To Be Secure’: Manchin Pans Plans To End Title 42"
  },
  {
    "id": 10000,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Dem senators sound alarm over reports Biden administration will end Title 42 border policy"
  },
  {
    "id": 10681,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body blow to working people': Right-wing Democrats reject Biden labor nominee"
  },
  {
    "id": 9923,
    "mediaId": 2644,
    "date": "2022-03-31",
    "sentence": "Joe Manchin of West Virginia and Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona opposed the nomination.",
    "author": "Mark Moore",
    "title": "Biden pick for Labor post defeated in Senate — with three Dems opposing"
  },
  {
    "id": 9879,
    "mediaId": 2520,
    "date": "2022-03-31",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9863,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "“It is not lost on (us) that folks who seized on the Trump Administration’s Title 42 restrictions to stoke fear about migrants bringing COVID into communities were among the first to lift indoor mask mandates and other restrictions.”\nThey continued: “Our government has the tools to safely process and screen people at the border, as required by law, in order to determine whether they qualify for asylum or other humanitarian protections.”\nArizona’s Democratic senators, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both denounced Biden’s decision to end Title 42.",
    "author": "Ariana Figueroa",
    "title": "Biden administration to halt pandemic policy blocking migrants who claim asylum"
  },
  {
    "id": 10003,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ), both of who urged Biden to keep Title 42 in place, said the decision shows the depth to which the White House does not understand the toll illegal immigration has on border communities.",
    "author": "John Binder",
    "title": "Battleground State Democrats Panic over Biden Ending Trump-Era Border Controls: ‘A Frightening Decision’"
  },
  {
    "id": 10562,
    "mediaId": 2695,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Alex Nitzberg",
    "title": "Manchin condemns 'frightening decision' to nix Title 42 order, says it will result in an even greater flow of migrants along the southern border"
  },
  {
    "id": 10607,
    "mediaId": 2721,
    "date": "2022-04-01",
    "sentence": "They were also joined by <span class='selected-term'>Mark Kelly</span>, Arizona’s other senator.",
    "author": "",
    "title": "Biden embarrassed by Senate defeat"
  },
  {
    "id": 10690,
    "mediaId": 2595,
    "date": "2022-04-02",
    "sentence": "",
    "author": "M Dowling",
    "title": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”"
  },
  {
    "id": 9921,
    "mediaId": 8350,
    "date": "2022-04-03",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said in a statement that they asked U.S.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from April 1-3"
  },
  {
    "id": 9899,
    "mediaId": 4045,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Missouri among states suing to stop Biden administration from ending asylum limits"
  },
  {
    "id": 9912,
    "mediaId": 6509,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal Lawsuit Seeks to Block End to Title 42 Asylum Limits"
  },
  {
    "id": 10202,
    "mediaId": 8258,
    "date": "2022-04-04",
    "sentence": "Richard Burr (R-NC), Bill Cassidy (R-LA), Susan Collins (R-ME), Chris Coons (D-DE), Lindsey Graham (R-SC), Maggie Hassan (D-NH), John Hickenlooper (D-CO), <span class='selected-term'>Mark Kelly</span> (D-AZ), Angus King (I-ME), Joe Manchin (D-WV), Jerry Moran (R-KS), Lisa Murkowski (R-AK), Rob Portman (R-OH), Mitt Romney (R-UT), Mike Rounds (R-SD), Jeanne Shaheen (D-NH), Kyrsten Sinema (D-AZ), Jon Tester (D-MT), Thom Tillis (R-NC), Mark Warner (D-VA), and Todd Young (R-IN).",
    "author": "AFF NEWSWIRE- CHLOE",
    "title": "Watch As Queen Pelosi BLOWS UP On National Television- ” If Her Radical Demands Aren’t Met She’s Going To Do THIS”"
  },
  {
    "id": 10004,
    "mediaId": 8475,
    "date": "2022-04-04",
    "sentence": "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly and humane process at the border,” said Sen. <span class='selected-term'>Mark Kelly</span>, whose comments were echoed by fellow Arizona Democratic Sen. Kyrsten Sinema.",
    "author": "Emily Sacia",
    "title": "With Title 42 winding down, worries rise about handling migrant surge"
  },
  {
    "id": 9997,
    "mediaId": 2641,
    "date": "2022-04-04",
    "sentence": "Joe Manchin of West Virginia, and the Arizona senators, <span class='selected-term'>Mark Kelly</span>, who is up for reelection, and Kyrsten Sinema, are opposed to the White House's decision to end Title 42, especially without having a contingent plan to deal with the pressing border crisis.",
    "author": "Peter Malbin",
    "title": "Ending Title 42 Expulsions a 'Disaster Politically' for Democrats: Republican Strategist"
  },
  {
    "id": 9982,
    "mediaId": 2520,
    "date": "2022-04-04",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> said Monday he will vote to confirm Judge Ketanji Brown Jackson to the U.S. Supreme Court when her nomination appears before the evenly-divided Senate, expected later this week.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Why Sen. Mark Kelly will vote to confirm Judge Ketanji Brown Jackson to the Supreme Court"
  },
  {
    "id": 9986,
    "mediaId": 2520,
    "date": "2022-04-04",
    "sentence": "Former Sen. Martha McSally was the lead Republican on the bill but was not reelected; she was succeeded by <span class='selected-term'>Mark Kelly</span>.",
    "author": "Barry Kluger",
    "title": "Every parent who loses a child deserves to have paid time off to grieve"
  },
  {
    "id": 7579,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning Biden against ending the “border restrictions without a comprehensive plan” to secure the border.",
    "author": "Elvia Díaz",
    "title": "Tired of COVID-19 restrictions? Then don't complain about the end of Title 42"
  },
  {
    "id": 7092,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "author": "EJ Montini",
    "title": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 8147,
    "mediaId": 8350,
    "date": "2022-04-06",
    "sentence": "PHOENIX – U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona said Wednesday the Biden administration’s decision to lift a public health ban on asylum seekers at the southern border soon “is a really bad idea” for now.",
    "author": "KTAR.COM",
    "title": "Arizona Sen. Kelly sees end of COVID border policy as ‘crisis on top of a crisis’"
  },
  {
    "id": 7991,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Hawley grills Biden admin on migrant surge, whether DHS plans to give phones to illegal immigrants"
  },
  {
    "id": 8359,
    "mediaId": 2877,
    "date": "2022-04-06",
    "sentence": "House Minority Leader Kevin McCarthy is opposed, of course, but so are several Democrat senators — Joe Manchin, Kyrsten Sinema, <span class='selected-term'>Mark Kelly</span>, Mark Warner, and Maggie Hassan are warning that Biden’s decision to open the borders even further will result in nothing but a surge of new border crossers.",
    "author": "Nate Jackson /",
    "title": "The Border Is About to Get Even Worse"
  },
  {
    "id": 8385,
    "mediaId": 2650,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Cameron Arcand",
    "title": "Report: Bipartisan Group of Lawmakers Takes on Biden Over Border Crisis"
  },
  {
    "id": 8480,
    "mediaId": 2574,
    "date": "2022-04-06",
    "sentence": "Arizona Democratic senators <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema sent a letter to the White House last month that asks Biden \"not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Joseph Simonson",
    "title": "Migrant Surge May Push DHS To Lower Security Standards at Border"
  },
  {
    "id": 8689,
    "mediaId": 2668,
    "date": "2022-04-07",
    "sentence": "Joe Manchin (WV), Kyrsten Sinema (AZ), <span class='selected-term'>Mark Kelly</span> (AZ), Maggie Hassan (NH), and Raphael Warnock (GA).",
    "author": "Nick Arama",
    "title": "WH Gets Dunked on Big Time for Pathetic Response on Title 42"
  },
  {
    "id": 8690,
    "mediaId": 2724,
    "date": "2022-04-07",
    "sentence": "“It seems highly unlikely it will be adequate by May 23, because of poor logistics.”\nSinema and fellow Arizona Democrat <span class='selected-term'>Mark Kelly</span> issued statements about Biden’s move, with Kelly saying, “This is the wrong decision.",
    "author": "Rusty Weiss",
    "title": "Bipartisan Group Fighting Back Against Biden’s Effort to Lift Title 42, A Move Expected to Create Surge of Illegal Immigrants"
  },
  {
    "id": 8006,
    "mediaId": 2526,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), James Lankford (R-OK), John Cornyn (R-TX), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), Thom Tillis (R-NC), and John Thune (R-SD) sponsored the legislation.",
    "author": "Sean Moran",
    "title": "Bipartisan Lawmakers Hope to Slip Amendment to Delay End of Title 42 in Coronavirus Aid"
  },
  {
    "id": 8116,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about the policy being lifted without proper planning.",
    "author": "Kyle Morris",
    "title": "Georgia Sen. Warnock, other vulnerable Democrats oppose ending Title 42 border policy"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 7336,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "“Because of <span class='selected-term'>Mark Kelly</span>, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  },
  {
    "id": 8559,
    "mediaId": 2890,
    "date": "2022-04-08",
    "sentence": "That didn’t stop five Democratic senators — Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Joe Manchin of West Virginia, Raphael Warnock of Georgia, and Maggie Hassan of New Hampshire — from joining Republicans in introducing a bill Thursday that would preserve the policy until 60 days after the surgeon general announces the end of the public health emergency related to Covid-19.",
    "author": "Nicole Narea",
    "title": "The Democratic revolt over Biden’s border policy"
  },
  {
    "id": 8161,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "Kyrsten Sinema, D-Ariz., and <span class='selected-term'>Mark Kelly</span>, D-Ariz., oppose ending the policy without a \"comprehensive, workable plan in place,\" saying the would overwhelm Arizona border communities and stretch the resources of nonprofits that are already near capacity.",
    "author": "Clara Migoya",
    "title": "What is Title 42 and how does it affect the Arizona border? The immigration policy, explained"
  },
  {
    "id": 6645,
    "mediaId": 8378,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Krista Allen",
    "title": "‘A big win for Tuba City’: Kelly, Sinema add long-term care in omnibus budget bill"
  },
  {
    "id": 6972,
    "mediaId": 8347,
    "date": "2022-04-11",
    "sentence": "The policy change, though, is frustrating conservatives like McCarthy, as well as moderate Democratic senators like Senator <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Senator Catherine Cortez Masto of Nevada and Senator Jon Tester of Montana.",
    "author": "Joe St. George",
    "title": "What is Title 42 and what is being done to address an expected surge?"
  },
  {
    "id": 6629,
    "mediaId": 2735,
    "date": "2022-04-13",
    "sentence": "Just 19% of Arizona Democratic primary voters have a favorable opinion of Sinema, according to a January Data for Progress poll, compared to 78% for fellow Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Igor Derysh",
    "title": "Kyrsten Sinema Assures Corporate Donors She’ll Protect Their Tax Breaks"
  },
  {
    "id": 5870,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 4943,
    "mediaId": 6627,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "",
    "title": "DEMS Turn On Biden: We Have A CRISIS Here"
  },
  {
    "id": 4830,
    "mediaId": 2818,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "The First",
    "title": "REJECTING BIDEN: Dems Turn on Joe, Urge White House to Keep Title 42 at the Border"
  },
  {
    "id": 4971,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "One of those who has expressed doubts that Title 42 should be ended is Senator <span class='selected-term'>Mark Kelly</span> of Arizona who is up for reelection in November in a state that will be heavily affected by the opening of the floodgates, and the retired astronaut raised his concerns with Fox News Digital on Friday.",
    "author": "Chris Donaldson",
    "title": "Midterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42"
  },
  {
    "id": 5062,
    "mediaId": 6746,
    "date": "2022-04-20",
    "sentence": "Senators <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both Democrats from Arizona, have questioned whether the Biden administration is adequately prepared to ease the limitations.",
    "author": "Madz Dizon",
    "title": "Title 42: Agencies May Run Out of Funds Amid Looming End of Trump-Era Immigration Policy as Biden Administration Pressure Runs High"
  },
  {
    "id": 5067,
    "mediaId": 2572,
    "date": "2022-04-20",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for reelection this year, along with Delaware Sen. Christopher Coons, Michigan's Gary Peters, and Kelly's intrastate counterpart Kyrsten Sinema, have all voiced support for retaining Title 42 protections, she said.",
    "author": "",
    "title": "Border rancher fumes at Biden, says officials need to 'get off their butts' and see what he's seeing"
  },
  {
    "id": 5143,
    "mediaId": 8295,
    "date": "2022-04-20",
    "sentence": "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., said earlier this month, as he introduced a bill to delay that move.",
    "author": "Reagan Priest/Cronkite News",
    "title": "Border numbers hit highest level in 20 years, as end of Title 42 looms"
  },
  {
    "id": 4724,
    "mediaId": 2634,
    "date": "2022-04-20",
    "sentence": "That isn’t likely to occur because Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> won’t vote for it and Virginia Senator Mark Warner may not either.",
    "author": "Timothy Noah",
    "title": "Jennifer Abruzzo Has Become One of the Quiet Heroes of the Biden Administration"
  },
  {
    "id": 5117,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Sen. <span class='selected-term'>Mark Kelly</span> said earlier this month, as he introduced a bill to delay that move.",
    "author": "Reagan Priest",
    "title": "Border numbers hit highest level in 20 years, as end of Title 42 looms"
  },
  {
    "id": 4839,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "Even as the White House mistakenly continues to push the same tax and spend agenda, it is my hope that our Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> reject these massive new spending proposals and listen to their constituents instead.",
    "author": "Guest Opinion",
    "title": "Fix inflation, don’t pass big spending bills"
  },
  {
    "id": 4681,
    "mediaId": 2866,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Fix This Nation Staff",
    "title": "Dem’s Sweetheart Slams Biden’s Border Effort"
  },
  {
    "id": 5112,
    "mediaId": 2522,
    "date": "2022-04-23",
    "sentence": "“And the reality is, Joe Biden and ‘Cartel Kelly'” Brnovich said referring to incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), “are trying to impose some neo-Marxist vision on this country and Americans are paying the price, not only at the gas pump and the grocery store, but literally with our lives and the lives of our children.",
    "author": "Kevin Haggerty",
    "title": "Arizona AG tears into Dems suddenly recognizing border crisis, importance of Title 42"
  }
]