[
  {
    "id": 3590,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3965,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 4325,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "That would be Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 2148,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "Ducey has aggressively challenged President Joe Biden’s border policies, including in last month’s state of the state address, when he said “the White House and Congress have decided to turn a blind eye” to what he called “a national crisis.”\nBrnovich is among five Republicans competing in August’s primary election for the right to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span> in November.",
    "author": "Bob Christie",
    "title": "Political football? Arizona AG says governor can send armed troops to border."
  },
  {
    "id": 2274,
    "mediaId": 2644,
    "date": "2022-02-08",
    "sentence": "Brnovich, who is seeking the GOP nomination to challenge US Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) later this year, wrote in the opinion that “only the Governor of the State of Arizona has the power to make a final determination” that the state is under invasion and then “establish the exact parameters for the exercise of the defensive use of force.”\nDucey issued a response to Brnovich that suggested he would not listen to the idea.",
    "author": "Steven Nelson",
    "title": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds"
  },
  {
    "id": 1784,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent <span class='selected-term'>Mark Kelly</span>, while Ducey is within three points.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 454,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "The incumbent is Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 12969,
    "mediaId": 2605,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>,” Democratic Senatorial Campaign Committee spokesman Patrick Burgwinkle said in a statement.",
    "author": "Melanie MasonStaff Writer",
    "title": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes"
  },
  {
    "id": 17042,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 15633,
    "mediaId": 8416,
    "date": "2022-03-06",
    "sentence": "Attorney General Mark Brnovich is seeking the Republican nomination for the US Senate to challenge incumbent Democrat and Biden supporter, <span class='selected-term'>Mark Kelly</span>.",
    "author": "David Stringer",
    "title": "Yavapai Republican Men’s Forum – Meet Your 2022 Candidates"
  },
  {
    "id": 11087,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Brnovich has been criticized for leading the investigation into fraud by Trump supporters while seeking the former president's endorsement in his 2022 midterm challenge of Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ)/\nIn January, MSNBC's Rachel Maddow laid out a damning timeline of events:\nWatch:",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 9182,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "The Arizona Republican primary to challenge Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "author": "Eric Mack",
    "title": "Two Polls Show Close Race Between Masters, Lamon"
  },
  {
    "id": 7075,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 7282,
    "mediaId": 8484,
    "date": "2022-04-04",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with DHS about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Emily Goodin",
    "title": "Three Republican states SUE the Biden administration to stop lifting Title 42 with growing fears there will be chaos and a huge migrant influx at the southern border in May"
  },
  {
    "id": 7811,
    "mediaId": 2724,
    "date": "2022-04-04",
    "sentence": "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place.”\nBoth Arizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) have have expressed concerns about ending the order to DHS Secretary Alejandro Mayorkas, and Sen. Maggie Hassan (D-NH) has said that she is concerned about a massive surge at the border.",
    "author": "Becky Noble",
    "title": "GOP States Sue As Biden Adm. Lifts Title 42 Order, Expected To Create Surge Of Illegal Immigrants At Border"
  },
  {
    "id": 7092,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "author": "EJ Montini",
    "title": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie"
  },
  {
    "id": 7055,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Via AP news wire",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7059,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7680,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7549,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump’s endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 7392,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Brnovich is seeking Trump's endorsement as he runs for the U.S. Senate in Arizona against incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Matthew Chapman",
    "title": "Trump’s 'Big Lie' undermined by long-awaited report from Arizona attorney general"
  },
  {
    "id": 7947,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "So, will this love letter be enough to get Trump's endorsement so Brnovich can be the guy to take on Sen. <span class='selected-term'>Mark Kelly</span>?",
    "author": "Liz Dye",
    "title": "Arizona AG, Hoping For Trump Nod, Produces Election 'Report' Heavy On Innuendo, Light On Data"
  },
  {
    "id": 7126,
    "mediaId": 2520,
    "date": "2022-04-07",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., easily collected the most signatures in his bid for re-election.",
    "author": "Ronald J. Hansen",
    "title": "Arizona congressional races slightly clearer after primary qualification deadline passes"
  },
  {
    "id": 5275,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive Blake Masters who is seeking the seat currently being held by Sen. <span class='selected-term'>Mark Kelly</span> (D).",
    "author": "Tom Boggioni",
    "title": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report"
  },
  {
    "id": 5483,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 5691,
    "mediaId": 2574,
    "date": "2022-04-11",
    "sentence": "The candidates are vying for a chance to run against incumbent Democratic senator <span class='selected-term'>Mark Kelly</span>, who is viewed as one of the most vulnerable candidates in the election cycle.",
    "author": "Washington Free Beacon Staff",
    "title": "Poll: Lamon Leads in Arizona’s GOP Senate Primary"
  },
  {
    "id": 4904,
    "mediaId": 8295,
    "date": "2022-04-18",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "Camila Pedrosa",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 5837,
    "mediaId": 8428,
    "date": "2022-04-19",
    "sentence": "The winner of the Republican primaries will face off against incumbent Democrat Sen. <span class='selected-term'>Mark Kelly</span> on Nov. 8.",
    "author": "Alex Caldwell",
    "title": "Trump will not endorse Arizona Attorney General Mark Brnovich for U.S. Senate"
  },
  {
    "id": 4705,
    "mediaId": 8416,
    "date": "2022-04-20",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers – Cronkite News"
  },
  {
    "id": 5648,
    "mediaId": 2855,
    "date": "2022-04-21",
    "sentence": "Kyrsten Sinema, <span class='selected-term'>Mark Kelly</span>, Maggie Hassan, Jon Tester, and Joe Manchin, who joined with Republican Sen. James Lankford and other Republicans to introduce a bill (S. 4036) to put obstacles in the way of termination:\n[The order] shall be lifted not earlier than 60 days after the date on which the Surgeon General provides written notification to ... Congress that such public health emergency declaration ... ha[s] been terminated.",
    "author": "George Fishman",
    "title": "42 Skiddo: Is the Biden Administration Expelling Border Security?"
  },
  {
    "id": 5117,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Sen. <span class='selected-term'>Mark Kelly</span> said earlier this month, as he introduced a bill to delay that move.",
    "author": "Reagan Priest",
    "title": "Border numbers hit highest level in 20 years, as end of Title 42 looms"
  },
  {
    "id": 5755,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "He wants to be politically correct.”\nTrump has not yet endorsed a candidate in the five-person race for the GOP nomination to face Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Tim Steller",
    "title": "Political Notebook: Little opposition for Tucson's Prop. 411"
  },
  {
    "id": 5112,
    "mediaId": 2522,
    "date": "2022-04-23",
    "sentence": "“And the reality is, Joe Biden and ‘Cartel Kelly'” Brnovich said referring to incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), “are trying to impose some neo-Marxist vision on this country and Americans are paying the price, not only at the gas pump and the grocery store, but literally with our lives and the lives of our children.",
    "author": "Kevin Haggerty",
    "title": "Arizona AG tears into Dems suddenly recognizing border crisis, importance of Title 42"
  }
]