[
  {
    "id": 3587,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "KELLY GETS SINEMA’S BACK — Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.) defended his fellow Democrat and delegation mate KYRSTEN SINEMA on Tuesday, saying he doesn’t agree with his state party’s move to censure her, the Arizona Republic reports.",
    "author": "",
    "title": "POLITICO Playbook: Ominous signs for Ukraine"
  },
  {
    "id": 17040,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) wrote Biden a letter saying his proposals are “concrete steps that should be taken to drive down gas prices and provide relief to families.” While the White House has said “all options are on the table” the gas tax holiday faces universal opposition from Republicans and has split Democrats on the Hill.",
    "author": "",
    "title": "American air carriers cut off Russia"
  },
  {
    "id": 15200,
    "mediaId": 2658,
    "date": "2022-03-09",
    "sentence": "Kirsten Gillibrand, <span class='selected-term'>Mark Kelly</span>)\nNew PACs\nBlueRock National Committee (PAC)\nCommon Good Fund (Super PAC)\nEngineering America's Future (Super PAC)\nPATRIOTS PAC LLC (PAC)\nStop Collectivism Or Totalitarianism Triumphs PAC (Leadership PAC: Scott Baugh)\nNew Lobbying Registrations\nNone.",
    "author": "",
    "title": "Feds charge dual national with acting as a Kremlin agent"
  },
  {
    "id": 15203,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) have co-sponsored a bill to prohibit defense contractors from buying rare earths from China, one of a number of ideas to address the problem.",
    "author": "",
    "title": "The Market Is Not Enough"
  },
  {
    "id": 15454,
    "mediaId": 2748,
    "date": "2022-03-10",
    "sentence": "Scott Kelly is the twin brother of <span class='selected-term'>Mark Kelly</span>, a Democratic senator representing Arizona",
    "author": "STATION GOSSIP",
    "title": "Epic: Angry US Astronaut Tells Russians What to Do with Special Medal They Awarded Him in 2011"
  }
]