[
  {
    "id": 10807,
    "mediaId": 2607,
    "date": "2022-03-08",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Steve Peoples",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 13630,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "In neighboring Arizona, more than twice that amount has been plowed so far into Spanish-language ads backing Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Dems begin building a Latino vote firewall in the West"
  },
  {
    "id": 9870,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "In Arizona, Sen. <span class='selected-term'>Mark Kelly</span> is up for reelection.",
    "author": "Stephen Dinan",
    "title": "Romney predicts GOP election wins due to Biden’s embrace of border chaos"
  },
  {
    "id": 8499,
    "mediaId": 6461,
    "date": "2022-04-07",
    "sentence": "In Arizona, where a Democratic senator, <span class='selected-term'>Mark Kelly</span>, is vulnerable, prices are up by 50%.",
    "author": "",
    "title": "Spiralling fuel prices add to Democrats’ woes"
  },
  {
    "id": 6972,
    "mediaId": 8347,
    "date": "2022-04-11",
    "sentence": "The policy change, though, is frustrating conservatives like McCarthy, as well as moderate Democratic senators like Senator <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Senator Catherine Cortez Masto of Nevada and Senator Jon Tester of Montana.",
    "author": "Joe St. George",
    "title": "What is Title 42 and what is being done to address an expected surge?"
  },
  {
    "id": 6592,
    "mediaId": 2589,
    "date": "2022-04-11",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada.",
    "author": "John Sexton",
    "title": "Democrats are heading for disaster in the Senate"
  },
  {
    "id": 6871,
    "mediaId": 6404,
    "date": "2022-04-12",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada…\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nSo Democrats are likely to lose 3-4 Senate seats this year and that’s just the start of their troubles.",
    "author": "Mike LaChance",
    "title": "It’s Starting To Look Like Democrats Are Going To Lose The Senate This Year"
  },
  {
    "id": 4953,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Ed Morrissey",
    "title": "How will McConnell survive as Senate GOP leader? Here are 141 million reasons ..."
  }
]