[
  {
    "id": 3564,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "But he’s held off on endorsing a Senate candidate to go up against incumbent Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Trump kicks off midterm year still stuck on last election"
  },
  {
    "id": 4233,
    "mediaId": 8475,
    "date": "2022-01-18",
    "sentence": "Agriculture Secretary Tom Vilsack, a former Iowa governor, is scheduled to announce the new strategy in Phoenix, alongside Forest Service Chief Randy Moore and Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jacob Fischler",
    "title": "Forest Service in 'paradigm shift' to use logging, controlled burns to prevent wildfires"
  },
  {
    "id": 3775,
    "mediaId": 2607,
    "date": "2022-01-22",
    "sentence": "Sinema’s fight with the left has overshadowed the 2022 reelection bid of <span class='selected-term'>Mark Kelly</span>, Arizona’s other Democratic senator, who will be trying to hold on to the seat he won in a special election.",
    "author": "Associated Press",
    "title": "Arizona Democrats censure Sinema over voting rights bill"
  },
  {
    "id": 3637,
    "mediaId": 2590,
    "date": "2022-01-26",
    "sentence": "The state’s other Democratic senator, <span class='selected-term'>Mark Kelly</span>, is already fundraising off of his vote for the filibuster change ahead of a reelection campaign this fall.",
    "author": "Travis Waldron",
    "title": "The Death Of Dems' Voting Rights Bill Is A Green Light For GOP State Legislatures"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 2551,
    "mediaId": 8450,
    "date": "2022-02-08",
    "sentence": "Brnovich se encuentra entre los cinco republicanos que compiten en las elecciones primarias de agosto por el derecho a enfrentarse al senador demócrata <span class='selected-term'>Mark Kelly</span> en noviembre.",
    "author": "",
    "title": "Brnovich asegura que el gobernador Ducey puede enviar tropas a la frontera para proteger a Arizona"
  },
  {
    "id": 16998,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "According to Oli Stokolosa, a Ukraine native and organizer who has lived in Arizona for about 10 years, one of the goals of the protest was to demand action from U.S. Sen. <span class='selected-term'>Mark Kelly</span> and Sinema to deliver the urgency of the message to the White House.",
    "author": "Laura Daniella Sepulveda",
    "title": "'I want Arizonans to be aware': Ukrainians in Phoenix call for more 'severe' action from US against Russia"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17076,
    "mediaId": 8345,
    "date": "2022-03-02",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said Tuesday the money comes from funding authorized by the Infrastructure Investment and Jobs law to protect communities, support recovery efforts, and reduce hazardous fuels on federal, state and tribal lands.",
    "author": "Associated Press",
    "title": "Senators: Federal funding authorized for wildfire recovery"
  },
  {
    "id": 13161,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "Doug Ducey announced Thursday he would not be a candidate for US Senate in 2022, ending speculation about whether he would reconsider his previous stance against seeking the party's nomination to challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
    "title": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary"
  },
  {
    "id": 15425,
    "mediaId": 8451,
    "date": "2022-03-08",
    "sentence": "One proposal, from a group of senators including Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., would suspend the federal gasoline tax for the rest of 2022.",
    "author": "Russ Wiles",
    "title": "Arizona gas prices are going up. Here's how to find the cheapest gas"
  },
  {
    "id": 15583,
    "mediaId": 8350,
    "date": "2022-03-11",
    "sentence": "PHOENIX – Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona introduced a bipartisan bill Thursday that would create a White House office tasked with promoting rural prosperity nationwide.",
    "author": "KEVIN STONE",
    "title": "US Sen. Mark Kelly of Arizona introduces bill to create rural prosperity office"
  },
  {
    "id": 11605,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "The Journal said the southern half of McCormick Ranch largely is comprised of middle-class and upper-middle-class families, and retirees on fixed incomes vulnerable to inflation — voters both major parties will eye as they battle for an open governor’s seat and a U.S. Senate seat currently held by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Charlie McCarthy",
    "title": "Inflation Expected to Be Key Midterm Issue in Battleground States"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 9921,
    "mediaId": 8350,
    "date": "2022-04-03",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said in a statement that they asked U.S.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from April 1-3"
  },
  {
    "id": 9899,
    "mediaId": 4045,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Missouri among states suing to stop Biden administration from ending asylum limits"
  },
  {
    "id": 8147,
    "mediaId": 8350,
    "date": "2022-04-06",
    "sentence": "PHOENIX – U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona said Wednesday the Biden administration’s decision to lift a public health ban on asylum seekers at the southern border soon “is a really bad idea” for now.",
    "author": "KTAR.COM",
    "title": "Arizona Sen. Kelly sees end of COVID border policy as ‘crisis on top of a crisis’"
  },
  {
    "id": 7680,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7549,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump’s endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7059,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 4839,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "Even as the White House mistakenly continues to push the same tax and spend agenda, it is my hope that our Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> reject these massive new spending proposals and listen to their constituents instead.",
    "author": "Guest Opinion",
    "title": "Fix inflation, don’t pass big spending bills"
  }
]