[
  {
    "id": 2687,
    "mediaId": 2573,
    "date": "2022-01-31",
    "sentence": "Raphael G. Warnock and <span class='selected-term'>Mark Kelly</span>, respectively, are up for reelection.",
    "author": "",
    "title": "Runaway inflation leads to people 'voting with their wallets': Larry Glazer"
  },
  {
    "id": 1928,
    "mediaId": 2526,
    "date": "2022-02-08",
    "sentence": "This November, at least two Senate Democrats stand to lose their seats in swing states that Biden won by slim margins: Sen. Raphael Warnock of Georgia and Sen. <span class='selected-term'>Mark Kelly</span> of Arizona — neither of whom have called for the president’s aid.",
    "author": "Paul Bois",
    "title": "Poll: Joe Biden Job Approval Rating Crashes to 38 Percent"
  },
  {
    "id": 2386,
    "mediaId": 2671,
    "date": "2022-02-10",
    "sentence": "Maggie Hassan (D-HN) and <span class='selected-term'>Mark Kelly</span> (D-AZ) – both of whom are up for reelection in the fall – would suspend the 18.4 cents per gallon federal gas tax until the beginning of 2023.",
    "author": "The Right Scoop",
    "title": "This is how DESPERATE Democrats are before this year’s election"
  },
  {
    "id": 891,
    "mediaId": 2658,
    "date": "2022-02-16",
    "sentence": "",
    "author": "",
    "title": "Vulnerable Senate Dems try to run as tax-cutters"
  },
  {
    "id": 955,
    "mediaId": 2578,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "COMEDY: Vulnerable Senate Democrats Are Trying To Run As Tax Cutters"
  },
  {
    "id": 773,
    "mediaId": 2916,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Isaac Schorr",
    "title": "Senate Democrats Rail against Corporate Influence While Accepting Piles of Tainted Cash"
  },
  {
    "id": 15390,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span>, a former astronaut who won a 2020 special election with 51.2% of the vote, secured more than 40 projects in the final government spending bill.",
    "author": "Jennifer Shutt",
    "title": "Return of earmarks a boon for members of Congress facing midterm battles"
  },
  {
    "id": 13553,
    "mediaId": 2573,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., called the scenes in the video \"tragic,\" adding, \"Vladimir Putin is now attacking civilians, which is clearly a war crime.\"",
    "author": "Tyler Olson",
    "title": "'Heart-wrenching' Zelenskyy speech gives Congress 'vivid reminder' of Putin's brutal war"
  },
  {
    "id": 8574,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "author": "John Binder",
    "title": "More Vulnerable Democrats Blast Biden’s Ending Title 42 at Border"
  },
  {
    "id": 8116,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about the policy being lifted without proper planning.",
    "author": "Kyle Morris",
    "title": "Georgia Sen. Warnock, other vulnerable Democrats oppose ending Title 42 border policy"
  },
  {
    "id": 6840,
    "mediaId": 6449,
    "date": "2022-04-11",
    "sentence": "Arizona’s two Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, already have expressed their opposition, and others are now joining in.",
    "author": "Jarrett Stepman",
    "title": "Biden’s Radical Open Borders Policies Prompt Pushback"
  },
  {
    "id": 5483,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 5540,
    "mediaId": 2658,
    "date": "2022-04-16",
    "sentence": "",
    "author": "",
    "title": "GOP megadonors go big in battle for Congress: 5 takeaways from new campaign money filings"
  },
  {
    "id": 4815,
    "mediaId": 2589,
    "date": "2022-04-21",
    "sentence": "Acutely aware of the need to get distance from the president, the four most endangered Democratic incumbents — Arizona Sen. <span class='selected-term'>Mark Kelly</span>, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto and New Hampshire Sen. Maggie Hassan — are increasingly taking steps to highlight their independence from the president and underscore their differences.",
    "author": "Ed Morrissey",
    "title": "Politico: The Senate Democrat long-distance run from Biden has begun"
  }
]