[
  {
    "id": 3692,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Senate GOP re-election arm targets vulnerable 2022 Democrats over giving stimulus checks to prisoners"
  },
  {
    "id": 2671,
    "mediaId": 2629,
    "date": "2022-02-09",
    "sentence": "Doug Ducey to mount a challenge against Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Josh Israel",
    "title": "Another GOP Governor Rejects McConnell Plea To Run For US Senate"
  },
  {
    "id": 17199,
    "mediaId": 2569,
    "date": "2022-03-01",
    "sentence": "Senate Democrats like Raphael Warnock, <span class='selected-term'>Mark Kelly</span>, Catherine Cortez Masto, Michael Bennet, and Maggie Hassan have done nothing but rubber stamp Joe Biden’s disastrous agenda that’s hurting American families.",
    "author": "Peter Schorsch",
    "title": "Florida reacts to Joe Biden’s State of the Union address"
  },
  {
    "id": 17002,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like [Arizona’s] <span class='selected-term'>Mark Kelly</span>,” said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle in a press release drawing attention to Republicans’ faltering track record on recruitment.",
    "author": "Igor Bobic",
    "title": "GOP Senate Recruitment Efforts Continue To Fizzle"
  },
  {
    "id": 12544,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat <span class='selected-term'>Mark Kelly</span> in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; Blake Masters, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 12767,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "BRIAN SLODYSKO",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 15209,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "Georgia Sen. Raphael Warnock and Arizona Sen. <span class='selected-term'>Mark Kelly</span> pressed the Democrats’ financial advantage by launching an initial round of television ads in recent weeks, while New Hampshire Democratic Sen. Maggie Hassan placed $13 million in initial TV and radio advertising reservations.",
    "author": "",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  }
]