[
  {
    "id": 4474,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "— Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) raised nearly $9 million for his reelection bid, plus more fourth-quarter campaign fundraising hauls.",
    "author": "Johnson",
    "title": "Johnson, Thune fill out Senate puzzle"
  },
  {
    "id": 4465,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Burgess Everett reports that Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.) is undecided on what to do while Sen. JON TESTER (D-Mont.)",
    "author": "",
    "title": "POLITICO Playbook: Biden gets a rude welcome to Georgia"
  },
  {
    "id": 4469,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) is not yet committed to a rules overhaul that would allow elections reform legislation to pass by a simple majority, he told Burgess and Marianne on Monday.",
    "author": "",
    "title": "Democrats look for a roadmap on rules changes"
  },
  {
    "id": 3723,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "QUICK LINKS\nIowa’s Child-Care Problems Show Scale of Washington’s Challenge, from The Wall Street Journal\nLiz Cheney’s Wyoming Nemesis Is an Oath Keeper Who Was at Capitol Rally, from Sam Brodney at The Daily Beast\nMarlon Bundo, Pence family rabbit and unlikely gay rights figure, dies, from Bryan Pietsch at The Washington Post\n'Kind of a centrist but very pragmatic': After year in Senate, <span class='selected-term'>Mark Kelly</span> touts microchips bill, infrastructure, COVID-19 aid, from Yvonne Wingett Sanchez at The Arizona Republic\nTRANSITIONS\nBlake Davis has joined the Biden-Harris Administration as a Senior Advisor at OPM.",
    "author": "",
    "title": "Democrats try to go it alone, again"
  },
  {
    "id": 3708,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "U.S. Sen. <span class='selected-term'>Mark Kelly</span> announced Wednesday morning that he would support altering filibuster rules if Republicans block the measures.",
    "author": "Reagan Priest",
    "title": "Arizonans protest at U.S. Capitol as Senate takes up voting rights, Kelly endorses changing filibuster"
  },
  {
    "id": 3569,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.), all previously reluctant to chip at the filibuster.",
    "author": "",
    "title": "Why Schumer picked a filibuster fight he couldn't win"
  },
  {
    "id": 3573,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) endorsed a rules change specific to elections legislation, and Sens.",
    "author": "",
    "title": "Senate Dems' filibuster ambitions fall short"
  },
  {
    "id": 3604,
    "mediaId": 2590,
    "date": "2022-01-20",
    "sentence": "“I wanted to talk to you about a decision I’ve made,” Sen. <span class='selected-term'>Mark Kelly</span> (D) wrote in an email to supporters on Thursday afternoon.",
    "author": "Amanda Terkel",
    "title": "Arizona Sen. Mark Kelly Throws Shade At Kyrsten Sinema's Filibuster Reform Vote"
  },
  {
    "id": 3659,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jeremy Duda",
    "title": "Ducey: I’m still not running for Senate"
  },
  {
    "id": 3639,
    "mediaId": 2520,
    "date": "2022-01-22",
    "sentence": "The liberals' debate over how to respond to Sinema's filibuster stance largely overshadowed the decision by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., to back a maneuver to weaken the filibuster rule only for the voting rights legislation that he co-sponsored.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Sen. Kyrsten Sinema censured by Arizona Democratic Party executive board over filibuster vote"
  },
  {
    "id": 3692,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Senate GOP re-election arm targets vulnerable 2022 Democrats over giving stimulus checks to prisoners"
  },
  {
    "id": 3590,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3555,
    "mediaId": 2658,
    "date": "2022-01-25",
    "sentence": "Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.), for example, will almost certainly be compared with Sinema and attacked by Republicans as a party pawn for backing an end run around the filibuster.",
    "author": "",
    "title": "POLITICO Playbook: Schumer strategy leaves some Dems seething"
  },
  {
    "id": 3965,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3711,
    "mediaId": 2746,
    "date": "2022-01-26",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> disagrees with the Arizona Democratic Party’s decision to censure Sen. Kyrsten Sinema after she refused to change Senate rules to pass a bill to overhaul federal elections.",
    "author": "Seth McLaughlin",
    "title": "Sen. Mark Kelly defends Sen. Kyrsten Sinema against Arizona Democratic Party censure"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 2723,
    "mediaId": 8475,
    "date": "2022-01-28",
    "sentence": "Arizona Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat elected in a special election in 2020, praised Breyer for protecting freedom of speech, reproductive rights and health care access as a justice.",
    "author": "Jennifer Shutt",
    "title": "Biden vows to nominate first Black woman to Supreme Court by end of February"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 1807,
    "mediaId": 2658,
    "date": "2022-02-08",
    "sentence": "Doug Ducey has also resisted appeals by Senate Republicans for him to jump into the Senate race to try to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Hogan won’t challenge Van Hollen for Maryland Senate seat"
  },
  {
    "id": 2551,
    "mediaId": 8450,
    "date": "2022-02-08",
    "sentence": "Brnovich se encuentra entre los cinco republicanos que compiten en las elecciones primarias de agosto por el derecho a enfrentarse al senador demócrata <span class='selected-term'>Mark Kelly</span> en noviembre.",
    "author": "",
    "title": "Brnovich asegura que el gobernador Ducey puede enviar tropas a la frontera para proteger a Arizona"
  },
  {
    "id": 2671,
    "mediaId": 2629,
    "date": "2022-02-09",
    "sentence": "Doug Ducey to mount a challenge against Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Josh Israel",
    "title": "Another GOP Governor Rejects McConnell Plea To Run For US Senate"
  },
  {
    "id": 1910,
    "mediaId": 2520,
    "date": "2022-02-09",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> and Sen. Maggie Hassan are teaming up on legislation that would suspend the federal gas tax until 2023 in an attempt to lower gas prices.",
    "author": "Cami Parrish",
    "title": "Sen. Mark Kelly bill would suspend federal gas tax to ease costs"
  },
  {
    "id": 1908,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Callie Patteson",
    "title": "Al Franken calls Senate bid ‘tempting’ four years after resignation"
  },
  {
    "id": 1097,
    "mediaId": 2526,
    "date": "2022-02-10",
    "sentence": "While speaking with CNN on Thursday, Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) said that he is not satisfied with the Biden administration’s handling of inflation and that he won’t be pleased with how the administration is handling the issue until inflation comes down to a “more sustainable” level and until “families across the country can actually deal with” the levels of inflation.",
    "author": "Ian Hanchett",
    "title": "Dem Sen. Kelly: I’m Not Satisfied with Biden’s Handling of Inflation, Needs to Be Level Families ‘Can Actually Deal With’"
  },
  {
    "id": 1046,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "Republican Senate candidate Jim Lamon dresses like an Old West lawman in a new ad in which he engages in a gunfight with actors representing President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span>, whose wife was gravely injured in a 2011 mass shooting near Tucson that left six dead and a dozen others injured.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Republican Senate candidate Jim Lamon assailed for gunslinging ad against Kelly, Biden, Pelosi"
  },
  {
    "id": 974,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "A GOP Senate candidate who was among the 11 Arizona Republicans who signed a forged electors document has released a violent campaign ad where he shoots at actors representing President Joe Biden, Speaker of the House Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span>, whose wife—former Rep. Gabby Giffords—survived a brutal assassination attempt in 2011.",
    "author": "",
    "title": "Arizona GOP candidate revels in outrage after releasing vile ad depicting political violence"
  },
  {
    "id": 1334,
    "mediaId": 2512,
    "date": "2022-02-11",
    "sentence": "Jim Lamon, one of the MAGA Republicans competing in Arizona’s 2022 GOP U.S. Senate primary, is drawing criticism for a new campaign ad that depicts him shooting at President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span> — who he is hoping to compete with in the general election, and whose wife, Gabby Giffords, survived an attempted murder in 2011.",
    "author": "Alex Henderson",
    "title": "Arizona Republican Senate hopeful slammed as 'disgusting' for violent campaign ad"
  },
  {
    "id": 1214,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "In a new campaign ad, Arizona Republican Senate candidate Jim Lamon — appearing as an Old West-style sheriff — shoots at an actor playing his political opponent, incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 1141,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "Andrew Trunsky",
    "title": "GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1772,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nA Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1630,
    "mediaId": 2551,
    "date": "2022-02-11",
    "sentence": "+3\nView gallery\nDemocratic Senator <span class='selected-term'>Mark Kelly</span> of Arizona is married to Gabby Giffords, the former congresswoman who was shot in the head at a constituent event in 2011\n+3\nView gallery\nThe ad garnered many critics although Mark Kelly's campaign has not commented but Jim Lamon's Republican primary rivals have\nKelly's campaign has not commented on the ad but Lamon's GOP primary opponents - Blake Masters, a venture capitalist; and Michael 'Mick' McGuire, the retired adjutant general of the Arizona National Guard - criticized it.",
    "author": "Emily Goodin",
    "title": "Republican Senate candidate sparks fury with campaign ad showing him shooting at Biden, Nancy Pelosi and Mark Kelly - whose wife Gabby Giffords was shot in the head in 2011"
  },
  {
    "id": 923,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> of Arizona and a group of five other Senate Democrats last week proposed temporarily suspending the federal 18.4 cent-a-gallon gas tax through the end of the year.",
    "author": "",
    "title": "Biden, Democrats Eye Suspension of 18-Cent Federal Gas Tax: Report"
  },
  {
    "id": 944,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Several Republicans already are vying to run against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., in the key battleground state.",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 891,
    "mediaId": 2658,
    "date": "2022-02-16",
    "sentence": "",
    "author": "",
    "title": "Vulnerable Senate Dems try to run as tax-cutters"
  },
  {
    "id": 1407,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "On Tuesday, Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) had to leave town because his wife, former Rep. Gabby Gifford, had to be hospitalized with appendicitis.",
    "author": "",
    "title": "There can be no bipartisanship in the face of the latest from Senate Republicans"
  },
  {
    "id": 1368,
    "mediaId": 2601,
    "date": "2022-02-16",
    "sentence": "WFB: Sen. <span class='selected-term'>Mark Kelly</span> (D., Ariz.) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers.",
    "author": "MJA",
    "title": "Arizona Sen. Mark Kelly(D) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers"
  },
  {
    "id": 955,
    "mediaId": 2578,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "COMEDY: Vulnerable Senate Democrats Are Trying To Run As Tax Cutters"
  },
  {
    "id": 916,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "The GOP’s chances of flipping the seat held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> — a key contest in the party’s fight for the Senate majority — are viewed by many in both parties as even better with Ducey, who has been elected statewide three times, than the current cast of MAGA Republicans in the race.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 905,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Tricky math: Sen. Ben Ray Luján (D-N.M.) is still out following his stroke and Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) rushed home this week as his wife, former Rep. Gabrielle Giffords, was hospitalized for appendicitis.",
    "author": "CR stars",
    "title": "CR stars in pre-recess rerun"
  },
  {
    "id": 1721,
    "mediaId": 2520,
    "date": "2022-02-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> wants to temporarily suspend the federal gas tax, but that could only make things worse.",
    "author": "",
    "title": "Sen. Mark Kelly's gas tax plan is a fundamentally bad idea"
  },
  {
    "id": 17279,
    "mediaId": 2573,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Tyler O'Neil",
    "title": "Senate votes to block Democrat bill enshrining abortion as Supreme Court reconsiders Roe v. Wade"
  },
  {
    "id": 17308,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like <span class='selected-term'>Mark Kelly</span>,\" said the Democratic Senatorial Campaign Committee.",
    "author": "Dylan Smith",
    "title": "Ducey firmly disavows Senate run: 'I'm an executive'"
  },
  {
    "id": 17344,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat <span class='selected-term'>Mark Kelly</span>, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "author": "John Bowden",
    "title": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate"
  },
  {
    "id": 17049,
    "mediaId": 2621,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Kipp Jones",
    "title": "Democrats a No as Resolution to End Covid-19 Emergency Declaration Passes Senate in Party-Line Vote"
  },
  {
    "id": 17129,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "Ducey’s announcement to some of his closest financial allies ends the long-running effort by national and local Republican leaders and deep-pocketed donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could decide which party controls the evenly divided chamber.",
    "author": "Stacey Barchenger",
    "title": "'I have the job I want': Arizona Gov. Doug Ducey will not run for the US Senate in 2022"
  },
  {
    "id": 17027,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "The Arizona Republic reports that Ducey's announcement ends the effort by local and national GOP leaders and affluent donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could determine control of the evenly split upper chamber.",
    "author": "Nicole Wells",
    "title": "Arizona Gov. Doug Ducey Will Not Run for US Senate in 2022"
  },
  {
    "id": 17042,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 17215,
    "mediaId": 2664,
    "date": "2022-03-03",
    "sentence": "Former President Donald Trump celebrated on Thursday after Senate GOP Leader Mitch McConnell (R-KY) failed at recruiting a top contender to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) in the 2022 midterm elections.",
    "author": "Bob Brigham",
    "title": "Trump brags about destroying Mitch McConnell’s plan to recruit a coveted Senate candidate"
  },
  {
    "id": 17160,
    "mediaId": 2746,
    "date": "2022-03-03",
    "sentence": "The five non-voting senators were two Republicans — James Inhofe of Oklahoma and Richard Burr of North Carolina — and three Democrats — Alex Padilla and Dianne Feinstein of California and <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Senate passes resolution to end federal COVID state of emergency"
  },
  {
    "id": 17002,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like [Arizona’s] <span class='selected-term'>Mark Kelly</span>,” said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle in a press release drawing attention to Republicans’ faltering track record on recruitment.",
    "author": "Igor Bobic",
    "title": "GOP Senate Recruitment Efforts Continue To Fizzle"
  },
  {
    "id": 17008,
    "mediaId": 2578,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Julian Conradson",
    "title": "JUST IN: US Senate Passes Resolution to End Covid-19 National State of Emergency"
  },
  {
    "id": 12544,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat <span class='selected-term'>Mark Kelly</span> in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; Blake Masters, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 12653,
    "mediaId": 2679,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "STEVE PEOPLES",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 13161,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "Doug Ducey announced Thursday he would not be a candidate for US Senate in 2022, ending speculation about whether he would reconsider his previous stance against seeking the party's nomination to challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
    "title": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary"
  },
  {
    "id": 12969,
    "mediaId": 2605,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>,” Democratic Senatorial Campaign Committee spokesman Patrick Burgwinkle said in a statement.",
    "author": "Melanie MasonStaff Writer",
    "title": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes"
  },
  {
    "id": 12884,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General Mark Brnovich as the favorite to face incumbent Democrat <span class='selected-term'>Mark Kelly</span> in the November election.",
    "author": "Callie Patteson",
    "title": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch"
  },
  {
    "id": 12873,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate Run for Arizona Gov. Ducey, Blow to GOP Recruiting"
  },
  {
    "id": 12806,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "For months, he had told both reporters pressing him and Republicans courting him that he had little appetite to challenge Senator <span class='selected-term'>Mark Kelly</span>, a first-term Democrat.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 17201,
    "mediaId": 2746,
    "date": "2022-03-04",
    "sentence": "Doug Ducey confirmed he will not challenge vulnerable Democratic Sen. <span class='selected-term'>Mark Kelly</span> in November.",
    "author": "Susan Ferrechio",
    "title": "Senate recruiting becomes proxy war in Trump-McConnell feud"
  },
  {
    "id": 17820,
    "mediaId": 2629,
    "date": "2022-03-04",
    "sentence": "The Democratic Senatorial Campaign Committee released a statement Thursday noting the trend:\nOnce again, Senate Republicans' recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>.",
    "author": "Josh Israel",
    "title": "Mitch McConnell Finds More Rejection In Search For GOP Senate Candidate"
  },
  {
    "id": 13019,
    "mediaId": 2569,
    "date": "2022-03-07",
    "sentence": "Herschel Walker\nMarco Rubio\n<span class='selected-term'>Mark Kelly</span>\nMitch McConnell\nNRSC\nRaphael Warnock\nRick Scott\nVal Dmeings\nAs the prospect of a red wave grows, a series of Republican missteps including recruiting stumbles, weak fundraising and intense infighting is threatening the GOP’s path to the Senate majority.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to U.S. Senate control"
  },
  {
    "id": 12730,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Associated Press",
    "title": "Republican 'unforced errors' threaten path to Senate control"
  },
  {
    "id": 12767,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "BRIAN SLODYSKO",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 15377,
    "mediaId": 2658,
    "date": "2022-03-08",
    "sentence": "Sen. Sherrod Brown (D-Ohio) warned more day-to-day discussions would prompt negative headlines saying “that we’re talking to Manchin and this is going here and we’re failing.”\nAnd Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), who also faces a competitive reelection, said he’s focused on “rising costs,” the upcoming government funding package and semiconductor manufacturing.",
    "author": "",
    "title": "Deal with Manchin would reshape Dems’ fight to keep majority"
  },
  {
    "id": 15209,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "Georgia Sen. Raphael Warnock and Arizona Sen. <span class='selected-term'>Mark Kelly</span> pressed the Democrats’ financial advantage by launching an initial round of television ads in recent weeks, while New Hampshire Democratic Sen. Maggie Hassan placed $13 million in initial TV and radio advertising reservations.",
    "author": "",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 11050,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "Others, like Democratic senators Maggie Hassan of New Hampshire and <span class='selected-term'>Mark Kelly</span> of Arizona, who are facing tough reelection races in their states, have called for temporarily eliminating the federal gas tax.",
    "author": "Jessica Chasmar",
    "title": "Gas prices fueling coming Democratic bloodbath in midterms, Republicans say"
  },
  {
    "id": 10807,
    "mediaId": 2607,
    "date": "2022-03-08",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Steve Peoples",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 15390,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span>, a former astronaut who won a 2020 special election with 51.2% of the vote, secured more than 40 projects in the final government spending bill.",
    "author": "Jennifer Shutt",
    "title": "Return of earmarks a boon for members of Congress facing midterm battles"
  },
  {
    "id": 15519,
    "mediaId": 2553,
    "date": "2022-03-10",
    "sentence": "To that end, from now until November, the SBA List is launching campaigns across the country to “expose the extremism of vulnerable pro-abortion Senators.”\nThe pro-life organization boasts of a massive $72 million 2022 election cycle budget — and it is zeroing in on Sen. <span class='selected-term'>Mark Kelly</span>, targeting the Arizona Democrat with a $1 million ad campaign highlighting Kelly’s abortion stances.",
    "author": "Mary Margaret Olohan",
    "title": "Abortion Is The Crux Of 2022 Elections, Major Pro-Life Group Predicts — And They’re Marshaling All Forces To Win That Battle"
  },
  {
    "id": 15747,
    "mediaId": 8338,
    "date": "2022-03-13",
    "sentence": "Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> announced that federal funds are headed for Arizona projects Friday, including several that will impact Pinal County.",
    "author": "",
    "title": "Senators tout federal funds headed to Pinal County"
  },
  {
    "id": 14071,
    "mediaId": 2557,
    "date": "2022-03-15",
    "sentence": "Michael Bennet, Catherine Cortez Masto, Maggie Hassan, <span class='selected-term'>Mark Kelly</span>, Joe Manchin, Jacky Rosen, Kyrsten Sinema, and Jon Tester.",
    "author": "DML News App",
    "title": "REPORT: White House threatens veto of Rand Paul legislation which just passed in Senate with bipartisan support"
  },
  {
    "id": 13443,
    "mediaId": 2540,
    "date": "2022-03-15",
    "sentence": "The Democrats who voted to rid of the mask mandate are: the senators from Nevada, Jacky Rosen and Catherine Cortez Masto; the senators from Arizona, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema; Michael Bennet of Colorado, Joe Manchin of West Virginia, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Ali Zaslav",
    "title": "Senate votes to repeal travel mask mandates in bipartisan rebuke of Biden administration policy"
  },
  {
    "id": 13369,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Both Sen. Joe Manchin (D-W.Va.) and Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said Tuesday that they were undecided about Gonzalez and planned to spend more time reviewing the allegations against him.",
    "author": "",
    "title": "White House tries to avoid a Raskin repeat as ICE pick teeters in Senate"
  },
  {
    "id": 9630,
    "mediaId": 2695,
    "date": "2022-03-22",
    "sentence": "Brnovich is a candidate for U.S. Senate running in the GOP primary to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "Chris Pandolfo",
    "title": "Arizona Republicans advance election bill to end mail-in voting — but it's likely dead on arrival"
  },
  {
    "id": 11671,
    "mediaId": 2658,
    "date": "2022-03-23",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said he was “impressed with her testimony so far” and added that the depiction of Jackson as too lenient in sentencing is “just politics.” Sen. Catherine Cortez Masto (D-Nev.) said the soft-on-crime narrative “has been discredited.",
    "author": "",
    "title": "'It's bulls---': Dems reject that Jackson's soft on crime"
  },
  {
    "id": 11665,
    "mediaId": 2745,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "How senators voted on Ketanji Brown Jackson for the Supreme Court"
  },
  {
    "id": 9407,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Vulnerable Democrat Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) trails a generic Republican in Arizona’s Senate race, according to a poll from OHPredictive Insights released this past week.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 12232,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "John Binder",
    "title": "Senate GOP Moderates Silent on Ketanji Brown Jackson’s Trustee Role at Woke, Pro-Critical Race Theory School"
  },
  {
    "id": 11604,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "Catherine Cortez-Masto, D-Nev., and <span class='selected-term'>Mark Kelly</span>.",
    "author": "Tyler Olson",
    "title": "GOP to use Jackson hearing to spotlight social issues in midterms: 'Literally can't say what a woman is'"
  },
  {
    "id": 10337,
    "mediaId": 2619,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Levi Sumagaysay",
    "title": "Senate’s rejection of Biden Labor Department nominee seen as a win for gig companies, loss for PRO Act"
  },
  {
    "id": 10087,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "pic.twitter.com/esgRMhCFrk\n— House Freedom Caucus (@freedomcaucus) March 30, 2022\nArizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) sent a letter to President Biden last week, stating, \"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Julio Rosas",
    "title": "Even Some Democrats Are Telling the Biden Admin to Not End Title 42 At the Southern Border"
  },
  {
    "id": 10148,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "Senators Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) wrote to Biden last week with their concerns on ending the directive, telling him to continue the order.",
    "author": "Charlotte Pence Bond",
    "title": "‘The Borders Have To Be Secure’: Manchin Pans Plans To End Title 42"
  },
  {
    "id": 10328,
    "mediaId": 6519,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C.— In response to the Senate’s failed effort to move David Weil’s nomination forward, Adam Brandon, FreedomWorks President, commented:\n“We applaud the 50 Republican Senators and the three Democratic Senators–West Virginia’s Joe Manchin and Arizona’s Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>–who voted against cloture on the nomination of David Weil to be Administrator of the Department of Labor’s Wage and Hour Division.”\n“Weil’s confirmation to this position would have harmed workers as well as employers, particularly small businesses.",
    "author": "Adam Brandon",
    "title": "FreedomWorks Statement in Response to Failed Effort to Move David Weil’s Nomination Forward"
  },
  {
    "id": 9879,
    "mediaId": 2520,
    "date": "2022-03-31",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee"
  },
  {
    "id": 9923,
    "mediaId": 2644,
    "date": "2022-03-31",
    "sentence": "Joe Manchin of West Virginia and Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona opposed the nomination.",
    "author": "Mark Moore",
    "title": "Biden pick for Labor post defeated in Senate — with three Dems opposing"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9799,
    "mediaId": 8322,
    "date": "2022-04-01",
    "sentence": "\"Senate Democrats like <span class='selected-term'>Mark Kelly</span> created this border crisis and have consistently voted against measures to secure the border,\" National Republican Senatorial Committee (NRSC) spokeswoman Katharine Cooksey claimed in a statement to Fox News.",
    "author": "Paul Steinhauser",
    "title": "Biden immigration decision could make midterm climate even tougher for Democrats"
  },
  {
    "id": 9839,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "Democratic Sen. <span class='selected-term'>Mark Kelly</span> has taken the lead in getting the bill passed, and noted in November, after getting it out of committee, that “it is a captivating natural and geological wonder— a real gem in our state.”\n“Chiricahua Monument is a natural wonder and deserves to be a national park,\" he said in a public statement on Thursday.",
    "author": "Bennito L. Kelty",
    "title": "Senate OKs bill to establish Chiricahua National Park, measure still awaits House action"
  },
  {
    "id": 9870,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "In Arizona, Sen. <span class='selected-term'>Mark Kelly</span> is up for reelection.",
    "author": "Stephen Dinan",
    "title": "Romney predicts GOP election wins due to Biden’s embrace of border chaos"
  },
  {
    "id": 10607,
    "mediaId": 2721,
    "date": "2022-04-01",
    "sentence": "They were also joined by <span class='selected-term'>Mark Kelly</span>, Arizona’s other senator.",
    "author": "",
    "title": "Biden embarrassed by Senate defeat"
  },
  {
    "id": 10202,
    "mediaId": 8258,
    "date": "2022-04-04",
    "sentence": "Richard Burr (R-NC), Bill Cassidy (R-LA), Susan Collins (R-ME), Chris Coons (D-DE), Lindsey Graham (R-SC), Maggie Hassan (D-NH), John Hickenlooper (D-CO), <span class='selected-term'>Mark Kelly</span> (D-AZ), Angus King (I-ME), Joe Manchin (D-WV), Jerry Moran (R-KS), Lisa Murkowski (R-AK), Rob Portman (R-OH), Mitt Romney (R-UT), Mike Rounds (R-SD), Jeanne Shaheen (D-NH), Kyrsten Sinema (D-AZ), Jon Tester (D-MT), Thom Tillis (R-NC), Mark Warner (D-VA), and Todd Young (R-IN).",
    "author": "AFF NEWSWIRE- CHLOE",
    "title": "Watch As Queen Pelosi BLOWS UP On National Television- ” If Her Radical Demands Aren’t Met She’s Going To Do THIS”"
  },
  {
    "id": 9982,
    "mediaId": 2520,
    "date": "2022-04-04",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> said Monday he will vote to confirm Judge Ketanji Brown Jackson to the U.S. Supreme Court when her nomination appears before the evenly-divided Senate, expected later this week.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Why Sen. Mark Kelly will vote to confirm Judge Ketanji Brown Jackson to the Supreme Court"
  },
  {
    "id": 9802,
    "mediaId": 2572,
    "date": "2022-04-04",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., Monday became the latest Democrat to officially back Jackson.",
    "author": "Tyler Olson",
    "title": "Judiciary panel deadlocks on Jackson SCOTUS nomination, setting up Senate vote to move it out of committee"
  },
  {
    "id": 7282,
    "mediaId": 8484,
    "date": "2022-04-04",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with DHS about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Emily Goodin",
    "title": "Three Republican states SUE the Biden administration to stop lifting Title 42 with growing fears there will be chaos and a huge migrant influx at the southern border in May"
  },
  {
    "id": 8071,
    "mediaId": 2658,
    "date": "2022-04-05",
    "sentence": "Joe Manchin of West Virginia, <span class='selected-term'>Mark Kelly</span> of Arizona, Kyrsten Sinema of Arizona, Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia.",
    "author": "",
    "title": "Covid deal hampered by GOP opposition to Biden immigration policy"
  },
  {
    "id": 8574,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "author": "John Binder",
    "title": "More Vulnerable Democrats Blast Biden’s Ending Title 42 at Border"
  },
  {
    "id": 8396,
    "mediaId": 2874,
    "date": "2022-04-06",
    "sentence": "Senators <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire to suspend the federal gas tax for the remainder of the year.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Sarah Godlewski issues 'Cut Costs Plan,' calls for suspension of federal gas tax"
  },
  {
    "id": 8668,
    "mediaId": 2790,
    "date": "2022-04-06",
    "sentence": "Some Democrats question wisdom of terminating order\nSeveral Senate Democrats — including <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Joe Manchin of West Virginia, and Maggie Hassan of New Hampshire — have questioned the wisdom of terminating the Title 42 order.",
    "author": "Susan Davis",
    "title": "Clash over immigration policy derails Senate COVID aid bill"
  },
  {
    "id": 8608,
    "mediaId": 2725,
    "date": "2022-04-06",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Arizona) is among others like Democratic Sens.",
    "author": "Murjani Rawls",
    "title": "COVID Bill Hits Impasse As Senate Republicans Block Over Title 42 Amendment"
  },
  {
    "id": 8147,
    "mediaId": 8350,
    "date": "2022-04-06",
    "sentence": "PHOENIX – U.S. Sen. <span class='selected-term'>Mark Kelly</span> of Arizona said Wednesday the Biden administration’s decision to lift a public health ban on asylum seekers at the southern border soon “is a really bad idea” for now.",
    "author": "KTAR.COM",
    "title": "Arizona Sen. Kelly sees end of COVID border policy as ‘crisis on top of a crisis’"
  },
  {
    "id": 8116,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about the policy being lifted without proper planning.",
    "author": "Kyle Morris",
    "title": "Georgia Sen. Warnock, other vulnerable Democrats oppose ending Title 42 border policy"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 7336,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "“Because of <span class='selected-term'>Mark Kelly</span>, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  },
  {
    "id": 7126,
    "mediaId": 2520,
    "date": "2022-04-07",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., easily collected the most signatures in his bid for re-election.",
    "author": "Ronald J. Hansen",
    "title": "Arizona congressional races slightly clearer after primary qualification deadline passes"
  },
  {
    "id": 8868,
    "mediaId": 2591,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Human Events Staff",
    "title": "Lawmakers Introduce Bipartisan Bill Requesting Delayed End to Title 42"
  },
  {
    "id": 8407,
    "mediaId": 6406,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Ketanji Brown Jackson Will Be A Liability for Senate Democrats"
  },
  {
    "id": 7967,
    "mediaId": 2573,
    "date": "2022-04-08",
    "sentence": "The bill includes not only Republicans such as Sen. James Lankford, R-Okla., and Sen. John Cornyn, R-Texas, but also a number of Democrats: Sens <span class='selected-term'>Mark Kelly</span>, D-Ariz., Kyrsten Sinema, D-Ariz., Jon Tester, D-Mont., Joe Manchin, D-W.Va., and Maggie Hassan, D-N.H.",
    "author": "Adam Shaw",
    "title": "Senate lawmakers eye hearing on Title 42 repeal amid bipartisan pushback, fears of migrant surge"
  },
  {
    "id": 5275,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive Blake Masters who is seeking the seat currently being held by Sen. <span class='selected-term'>Mark Kelly</span> (D).",
    "author": "Tom Boggioni",
    "title": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report"
  },
  {
    "id": 5483,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 5691,
    "mediaId": 2574,
    "date": "2022-04-11",
    "sentence": "The candidates are vying for a chance to run against incumbent Democratic senator <span class='selected-term'>Mark Kelly</span>, who is viewed as one of the most vulnerable candidates in the election cycle.",
    "author": "Washington Free Beacon Staff",
    "title": "Poll: Lamon Leads in Arizona’s GOP Senate Primary"
  },
  {
    "id": 6115,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "He is running against several other Republicans for the nomination to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>, including state Attorney General Mark Brnovich and businessman Jim Lamon.",
    "author": "Matthew Chapman",
    "title": "Pro-Trump Arizona candidate complains Biden's new rules wouldn't let him build his 'very cool' ghost gun"
  },
  {
    "id": 6592,
    "mediaId": 2589,
    "date": "2022-04-11",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada.",
    "author": "John Sexton",
    "title": "Democrats are heading for disaster in the Senate"
  },
  {
    "id": 7037,
    "mediaId": 2690,
    "date": "2022-04-11",
    "sentence": "They were joined by Senators John Cornyn (R-TX), <span class='selected-term'>Mark Kelly</span> (D-AZ), John Thune (R-SD), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), and Thom Tillis (R-NC).",
    "author": "Mike Smith",
    "title": "Bipartisan Group of Senators Introduce Bill to Block Termination of Title 42"
  },
  {
    "id": 6871,
    "mediaId": 6404,
    "date": "2022-04-12",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada…\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nSo Democrats are likely to lose 3-4 Senate seats this year and that’s just the start of their troubles.",
    "author": "Mike LaChance",
    "title": "It’s Starting To Look Like Democrats Are Going To Lose The Senate This Year"
  },
  {
    "id": 7038,
    "mediaId": 2688,
    "date": "2022-04-12",
    "sentence": "Doug Ducey (R) announced in a letter to donors that he wouldn’t launch a bid against incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "John Judis",
    "title": "Where Things Stand: McConnell Warns ‘Unacceptable’ GOP Candidates Could Spoil The Fun For Everyone"
  },
  {
    "id": 5931,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 5870,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 6700,
    "mediaId": 8347,
    "date": "2022-04-14",
    "sentence": "In Douglas on Wednesday, Senator <span class='selected-term'>Mark Kelly</span> said the immigration system was stressed before Title 42 and lifting the restriction should make things worse.",
    "author": "Craig Smith",
    "title": "Rep. Grijalva splits with Senators on Title 42"
  },
  {
    "id": 5540,
    "mediaId": 2658,
    "date": "2022-04-16",
    "sentence": "",
    "author": "",
    "title": "GOP megadonors go big in battle for Congress: 5 takeaways from new campaign money filings"
  },
  {
    "id": 6176,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), facing a tough reelection battle this November, said he’s “continuing to evaluate her record” after a similar meeting.",
    "author": "",
    "title": "Midterm politicking comes for Biden’s stalled tech nominee"
  },
  {
    "id": 6341,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Democrats are defending four incumbents in closely contested states: Hassan, Warnock, Nevada Sen. Catherine Cortez Masto and Sen. <span class='selected-term'>Mark Kelly</span> in Arizona.",
    "author": "",
    "title": "McConnell-tied super PAC makes early $141M play for the Senate"
  },
  {
    "id": 4867,
    "mediaId": 2603,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Susan Rinkunas",
    "title": "Ope! Elizabeth Warren Just Took a Little Dig at Nancy Pelosi"
  },
  {
    "id": 4904,
    "mediaId": 8295,
    "date": "2022-04-18",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "Camila Pedrosa",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  },
  {
    "id": 4910,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "\"Right now, this administration does not have a plan,\" Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., said while visiting the border in his state.",
    "author": "NationalWatch",
    "title": "Some Senate Dems Pushing Back on Biden Lifting Title 42 Border Restrictions"
  },
  {
    "id": 4922,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "",
    "author": "NationalWatch",
    "title": "Senate Homeland Security Chair Peters Says Plan to Drop Title 42 ‘Should Be Revisited’"
  },
  {
    "id": 4953,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Ed Morrissey",
    "title": "How will McConnell survive as Senate GOP leader? Here are 141 million reasons ..."
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 4689,
    "mediaId": 2687,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Senate Democrats Way Ahead In Fundraising"
  },
  {
    "id": 4848,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "And if fundraising is any measure, Senate Democrats have a fighting chance in November, with their four most vulnerable senators—Raphael Warnock in Georgia, <span class='selected-term'>Mark Kelly</span> of Arizona, Catherine Cortez Masto of Nevada, and Maggie Hassan of New Hampshire—all surpassing the hauls of their leading GOP challengers.",
    "author": "",
    "title": "Midterms will be a heavy lift for the Senate GOP. One super PAC is already shelling out $141 million"
  },
  {
    "id": 5837,
    "mediaId": 8428,
    "date": "2022-04-19",
    "sentence": "The winner of the Republican primaries will face off against incumbent Democrat Sen. <span class='selected-term'>Mark Kelly</span> on Nov. 8.",
    "author": "Alex Caldwell",
    "title": "Trump will not endorse Arizona Attorney General Mark Brnovich for U.S. Senate"
  },
  {
    "id": 5610,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  },
  {
    "id": 5433,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 5168,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "“In this case, the administration hasn’t even prepared, and they don’t have a plan for what to expect,” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said.",
    "author": "Kevin Haggerty",
    "title": "Biden may delay lifting Title 42 as Democrats fret over looming midterm disaster: report"
  },
  {
    "id": 5067,
    "mediaId": 2572,
    "date": "2022-04-20",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for reelection this year, along with Delaware Sen. Christopher Coons, Michigan's Gary Peters, and Kelly's intrastate counterpart Kyrsten Sinema, have all voiced support for retaining Title 42 protections, she said.",
    "author": "",
    "title": "Border rancher fumes at Biden, says officials need to 'get off their butts' and see what he's seeing"
  },
  {
    "id": 4705,
    "mediaId": 8416,
    "date": "2022-04-20",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers – Cronkite News"
  },
  {
    "id": 4724,
    "mediaId": 2634,
    "date": "2022-04-20",
    "sentence": "That isn’t likely to occur because Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> won’t vote for it and Virginia Senator Mark Warner may not either.",
    "author": "Timothy Noah",
    "title": "Jennifer Abruzzo Has Become One of the Quiet Heroes of the Biden Administration"
  },
  {
    "id": 4815,
    "mediaId": 2589,
    "date": "2022-04-21",
    "sentence": "Acutely aware of the need to get distance from the president, the four most endangered Democratic incumbents — Arizona Sen. <span class='selected-term'>Mark Kelly</span>, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto and New Hampshire Sen. Maggie Hassan — are increasingly taking steps to highlight their independence from the president and underscore their differences.",
    "author": "Ed Morrissey",
    "title": "Politico: The Senate Democrat long-distance run from Biden has begun"
  },
  {
    "id": 5697,
    "mediaId": 2656,
    "date": "2022-04-21",
    "sentence": "Recommended: Lefties in Panic Over Biden Support Collapse With Younger Voters\nMy colleague and dear friend Stephen Kruiser — an Arizona native and Tucson resident — just doesn’t see any Republican knocking off <span class='selected-term'>Mark Kelly</span>.",
    "author": "Stephen Green",
    "title": "Sabato: Republicans 'Favorites' to Take Senate"
  }
]