[
  {
    "id": 3602,
    "mediaId": 2590,
    "date": "2022-01-23",
    "sentence": "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. <span class='selected-term'>Mark Kelly</span> to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "author": "Kevin Robillard",
    "title": "Joe Biden Still Believes In Washington. He Might Be The Only One."
  },
  {
    "id": 3692,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Senate GOP re-election arm targets vulnerable 2022 Democrats over giving stimulus checks to prisoners"
  },
  {
    "id": 1815,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and Rep. Dave Schweikert are pushing for an extension of telehealth coverage for people enrolled in Medicare beyond 2023.",
    "author": "Cami Parrish",
    "title": "Sinema, Kelly and Schweikert want extension of telehealth coverage"
  },
  {
    "id": 124,
    "mediaId": 2512,
    "date": "2022-02-21",
    "sentence": "A different bill introduced by US Senators Jon Ossoff, of Georgia, and <span class='selected-term'>Mark Kelly</span>, of Arizona, covers only stock trades but includes a broader range of assets.",
    "author": "Noah Berlatsky",
    "title": "Why giving Congress a raise could actually help fight corruption"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17254,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "And I didn’t have tickets,” said Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Congress returns to normal-ish for Biden’s speech — with cheers, jeers and viral moments"
  },
  {
    "id": 13291,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., also noted the manufacturing issue, while calling for inflation-fighting moves to aid Americans.",
    "author": "Ronald J. Hansen",
    "title": "Unity at start of Biden's State of the Union speech gives way to familiar domestic battles"
  },
  {
    "id": 12502,
    "mediaId": 2658,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>MARK KELLY</span> this fall.",
    "author": "",
    "title": "POLITICO Playbook: Russia escalates brutality, Congress steps up response"
  },
  {
    "id": 10779,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Eight Senate Dems — including several up for reelection this fall — voted with the GOP: MICHAEL BENNET (Colo.), CATHERINE CORTEZ MASTO (Nev.), MAGGIE HASSAN (N.H.), <span class='selected-term'>MARK KELLY</span> (Ariz.), JOE MANCHIN (W.Va.), JACKY ROSEN (Nev.), Sinema and JON TESTER (Mont.).",
    "author": "",
    "title": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get"
  },
  {
    "id": 11187,
    "mediaId": 2868,
    "date": "2022-03-17",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span>, a Democrat from Arizona, took home funding for a light rail project in Phoenix.",
    "author": "",
    "title": "Why the return of earmarks could be good news for the planet"
  },
  {
    "id": 9959,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "One of the stricter bills was introduced in January by Senators Jon Ossoff (D-GA) and <span class='selected-term'>Mark Kelly</span> (D-AZ) and includes the legislators’ spouses and dependent children in the restrictions.",
    "author": "Cabot Phillips",
    "title": "Here’s How Members Of Congress Use Inside Information To Make Millions On The Stock Market"
  },
  {
    "id": 10337,
    "mediaId": 2619,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Levi Sumagaysay",
    "title": "Senate’s rejection of Biden Labor Department nominee seen as a win for gig companies, loss for PRO Act"
  },
  {
    "id": 10087,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "pic.twitter.com/esgRMhCFrk\n— House Freedom Caucus (@freedomcaucus) March 30, 2022\nArizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) sent a letter to President Biden last week, stating, \"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Julio Rosas",
    "title": "Even Some Democrats Are Telling the Biden Admin to Not End Title 42 At the Southern Border"
  },
  {
    "id": 9827,
    "mediaId": 2658,
    "date": "2022-03-31",
    "sentence": "Those are all things that people are going to have to take into consideration.”\nSen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), a top target for Republicans in November, said he wants the Senate to ultimately have a say.",
    "author": "",
    "title": "'The president will get his way': Congress likely can't stop new Iran nuke deal"
  },
  {
    "id": 9910,
    "mediaId": 2551,
    "date": "2022-04-03",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with the Department of Homeland Security (DHS) about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Katelyn Caralle",
    "title": "Now White House blames border crisis on CONGRESS as administration braces for massive influx of asylum claims as CDC announced impending end to pandemic-era Title 42"
  },
  {
    "id": 10678,
    "mediaId": 2728,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Alan Fram And Aaron M. Kessler",
    "title": "Billions, and more, for lawmakers’ projects in spending bill"
  },
  {
    "id": 8071,
    "mediaId": 2658,
    "date": "2022-04-05",
    "sentence": "Joe Manchin of West Virginia, <span class='selected-term'>Mark Kelly</span> of Arizona, Kyrsten Sinema of Arizona, Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia.",
    "author": "",
    "title": "Covid deal hampered by GOP opposition to Biden immigration policy"
  },
  {
    "id": 7616,
    "mediaId": 6449,
    "date": "2022-04-07",
    "sentence": "And quite frankly, politically, this is going to be a hard year for U.S. Sen. <span class='selected-term'>Mark Kelly</span>, between the inflation that’s going on in Arizona and the border crisis that’s going on in Arizona’s border and across the nation.",
    "author": "Douglas Blair",
    "title": "Rep. Debbie Lesko Reveals GOP Plan to Lower Gas Prices"
  },
  {
    "id": 6473,
    "mediaId": 2800,
    "date": "2022-04-17",
    "sentence": "WASHINGTON (Sputnik) - A group of US lawmakers will travel to Germany, Poland, India, and the United Arab Emirates (UAE) to try to secure stronger support for... 18.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e5/0b/1e/1091155623_0:0:3073:1728_1920x0_80_0_0_cb53c02e02c3fb7715ece47413485b1d.jpg.webp\nThe Congressional lawmakers will include US Senators <span class='selected-term'>Mark Kelly</span>, Kirsten Gillibrand, Cory Booker, and Ed Markey, as well as House of Representatives member Mondaire Jones.The delegation’s upcoming nine-day trip was announced by Kelly in an e-mail to the newspaper on Sunday evening.According to The Hill, Germany, Poland, India, and the UAE have not been active enough in cooperating with US-led efforts to isolate Russia.Russia launched its special military operation in Ukraine on February 24, after the Donetsk and Lugansk People’s Republics (DPR and LPR) appealed for help in defending themselves against Ukrainian provocations.",
    "author": "",
    "title": "US Congress Members to Visit Germany, UAE, Hoping to Get More Support For Kiev - Reports"
  },
  {
    "id": 4867,
    "mediaId": 2603,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Susan Rinkunas",
    "title": "Ope! Elizabeth Warren Just Took a Little Dig at Nancy Pelosi"
  },
  {
    "id": 5075,
    "mediaId": 8475,
    "date": "2022-04-21",
    "sentence": "The legislation has gained broad support, including Arizona Sen. <span class='selected-term'>Mark Kelly</span>, who also supports the SAFE Banking Act, which would allow cannabis businesses access to banking services that are now illegal due to federal prohibitions.",
    "author": "David Abbott",
    "title": "Federal attempts to legalize marijuana flail, even as public support grows"
  }
]