[
  {
    "id": 3602,
    "mediaId": 2590,
    "date": "2022-01-23",
    "sentence": "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. <span class='selected-term'>Mark Kelly</span> to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "author": "Kevin Robillard",
    "title": "Joe Biden Still Believes In Washington. He Might Be The Only One."
  },
  {
    "id": 2687,
    "mediaId": 2573,
    "date": "2022-01-31",
    "sentence": "Raphael G. Warnock and <span class='selected-term'>Mark Kelly</span>, respectively, are up for reelection.",
    "author": "",
    "title": "Runaway inflation leads to people 'voting with their wallets': Larry Glazer"
  },
  {
    "id": 2123,
    "mediaId": 8350,
    "date": "2022-02-09",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Sen. Mark Kelly, 2nd Democrat call for gas tax suspension to blunt rising prices"
  },
  {
    "id": 904,
    "mediaId": 2746,
    "date": "2022-02-17",
    "sentence": "OPINION:\nCall it what it is: the “Reelect Vulnerable Democrats Act.”\nWhen Senate Democrats <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire proposed a temporary tax cut on gasoline last week, they unwittingly highlighted two of the dirtiest secrets of the green agenda.",
    "author": "Larry Behrens",
    "title": "Democrats trying to shuffle the deckchairs on their sinking poll numbers"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17264,
    "mediaId": 8350,
    "date": "2022-03-02",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Ukraine war upends Biden’s agenda on energy, climate change"
  },
  {
    "id": 15209,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "Georgia Sen. Raphael Warnock and Arizona Sen. <span class='selected-term'>Mark Kelly</span> pressed the Democrats’ financial advantage by launching an initial round of television ads in recent weeks, while New Hampshire Democratic Sen. Maggie Hassan placed $13 million in initial TV and radio advertising reservations.",
    "author": "",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 15390,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span>, a former astronaut who won a 2020 special election with 51.2% of the vote, secured more than 40 projects in the final government spending bill.",
    "author": "Jennifer Shutt",
    "title": "Return of earmarks a boon for members of Congress facing midterm battles"
  },
  {
    "id": 13553,
    "mediaId": 2573,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., called the scenes in the video \"tragic,\" adding, \"Vladimir Putin is now attacking civilians, which is clearly a war crime.\"",
    "author": "Tyler Olson",
    "title": "'Heart-wrenching' Zelenskyy speech gives Congress 'vivid reminder' of Putin's brutal war"
  },
  {
    "id": 10436,
    "mediaId": 4045,
    "date": "2022-03-30",
    "sentence": "",
    "author": "COLLEEN LONG",
    "title": "AP sources: Asylum limits at border expected to end May 23"
  },
  {
    "id": 10584,
    "mediaId": 2801,
    "date": "2022-03-30",
    "sentence": "",
    "author": "COLLEEN LONG, JASON DEAREN and ELLIOT SPAGAT",
    "title": "AP sources: Asylum limits at border expected to end May 23"
  },
  {
    "id": 9824,
    "mediaId": 5118,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum limits at Mexico border expected to end May 23, sources say; US braces for influx of migrants"
  },
  {
    "id": 10328,
    "mediaId": 6519,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C.— In response to the Senate’s failed effort to move David Weil’s nomination forward, Adam Brandon, FreedomWorks President, commented:\n“We applaud the 50 Republican Senators and the three Democratic Senators–West Virginia’s Joe Manchin and Arizona’s Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>–who voted against cloture on the nomination of David Weil to be Administrator of the Department of Labor’s Wage and Hour Division.”\n“Weil’s confirmation to this position would have harmed workers as well as employers, particularly small businesses.",
    "author": "Adam Brandon",
    "title": "FreedomWorks Statement in Response to Failed Effort to Move David Weil’s Nomination Forward"
  },
  {
    "id": 8827,
    "mediaId": 8430,
    "date": "2022-04-09",
    "sentence": "On behalf of the hardworking business owners in Chandler and their customers, I hope that Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> will stop this misguided proposal before it’s too late.",
    "author": "SanTan Sun News",
    "title": "Don’t make tax season harder for Arizona small businesses"
  },
  {
    "id": 6473,
    "mediaId": 2800,
    "date": "2022-04-17",
    "sentence": "WASHINGTON (Sputnik) - A group of US lawmakers will travel to Germany, Poland, India, and the United Arab Emirates (UAE) to try to secure stronger support for... 18.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e5/0b/1e/1091155623_0:0:3073:1728_1920x0_80_0_0_cb53c02e02c3fb7715ece47413485b1d.jpg.webp\nThe Congressional lawmakers will include US Senators <span class='selected-term'>Mark Kelly</span>, Kirsten Gillibrand, Cory Booker, and Ed Markey, as well as House of Representatives member Mondaire Jones.The delegation’s upcoming nine-day trip was announced by Kelly in an e-mail to the newspaper on Sunday evening.According to The Hill, Germany, Poland, India, and the UAE have not been active enough in cooperating with US-led efforts to isolate Russia.Russia launched its special military operation in Ukraine on February 24, after the Donetsk and Lugansk People’s Republics (DPR and LPR) appealed for help in defending themselves against Ukrainian provocations.",
    "author": "",
    "title": "US Congress Members to Visit Germany, UAE, Hoping to Get More Support For Kiev - Reports"
  },
  {
    "id": 5126,
    "mediaId": 8251,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5064,
    "mediaId": 8450,
    "date": "2022-04-18",
    "sentence": "El senador <span class='selected-term'>Mark Kelly</span>, un demócrata por Arizona que buscará la reelección este año, recorrió la frontera la semana pasada y advirtió que el gobierno de Biden no está preparado para que se levanten las restricciones de asilo.",
    "author": "",
    "title": "Crece la cifra de cruces de migrantes en la frontera sur de EEUU, la más alta en 20 años"
  },
  {
    "id": 5013,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 4918,
    "mediaId": 2751,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike at US-Mexico border as US plans to lift curb on asylum"
  },
  {
    "id": 4989,
    "mediaId": 2694,
    "date": "2022-04-21",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span> of Arizona visited the U.S.-Mexico border, and in a sign of the issue’s political salience, so did Senator Maggie Hassan of New Hampshire, despite the fact that New Hampshire is nowhere near Mexico.",
    "author": "David A. Graham",
    "title": "The Punt Presidency"
  },
  {
    "id": 4839,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "Even as the White House mistakenly continues to push the same tax and spend agenda, it is my hope that our Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> reject these massive new spending proposals and listen to their constituents instead.",
    "author": "Guest Opinion",
    "title": "Fix inflation, don’t pass big spending bills"
  }
]