{
  "id": 1113,
  "mediaId": 124,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "Trump's influence on GOP in question ahead of Georgia rally",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_12/3543155/220324-mo-brooks-trump-one_time_use-mn-0836.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/trump-s-influence-gop-question-ahead-georgia-rally-n1292915",
  "sentiment": "0.0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2039
  ],
  "sentences": [
    "In a new TV ad, Sen. Ron Johnson, R-Wis., blasts the Biden administration over rising prices, telling voters, inflation is the Democrats' tax on the middle class.?\nJohnson also tells viewers that gasoline prices are at record levels because Democrats declared war on fossil fuels.? He also cites a statistic pushed by Jason Furman, who chaired Obama's Council of Economic Advisers, that alleges costs facing American families have risen by $4,000 in 2021 due to inflation.",
    "Our colleague Benjy Sarlin puts it well: It's a weird moment where Trump simultaneously 1) has never looked weaker, 2) is still the frontrunner for the nomination, and 3) cannot be making it clearer his one guiding issue is re-running 2020 only now rigged in his favor at the state level.?\nThat's how much money the conservative Club for Growth Action has spent on ads supporting Rep. Mo Brooks in Alabama's GOP Senate primary.",
    "Mulvaney, a former congressman from the state who once served as Trump's chief of staff, told NBC News Arrington was not the best candidate by any stretch of the imagination.? In the text messages, Arrington responded to the statement by calling Mulvaney a piece of st? twice.",
    "South Carolina-01: The State newspaper obtained a number of combative text messages sent from Katie Arrington, a Trump-endorsed candidate for Congress in South Carolina, to former White House Chief of Staff Mick Mulvaney in the wake of his public comment disparaging her.",
    "Missouri Senate: Trump hasn't endorsed any of the GOP Senate hopefuls, but yesterday he put out a statement saying, Have the great people of Missouri been considering the big, loud, and proud personality of Congressman Billy Long for the Senate?",
    "NBC News' Sahil Kapur reports on a conundrum Senate Republicans face as they rail against dark money groups who support Supreme Court nominee Ketanji Brown Jackson but still oppose laws requiring such groups to disclose their donors.",
    "The recent enrollment surge is powered in part by increased subsidies for premiums that were part of the $1.9 trillion American Rescue Plan that made it easier to sign up for a plan or upgrade to a new one with lower deductibles.",
    "Other news from the trail: The Biden administration threatened to remove celebrity doctor Mehmet Oz and former football star Herschel Walker from the President's Council on Sports, Fitness & Nutrition if they don't step down.",
    "The New York Times reports that a former Manhattan prosecutor investigating Trump believes that the former president was guilty of numerous felony violations.?\nNorth Korea tested an ICBM for the first time since 2017.",
    "At an event in Austin on Wednesday, Speaker Nancy Pelosi confirmed that she's backing the more moderate Rep. Henry Cuellar, D-Texas, in his primary fight against the progressive Jessica Cisneros.",
    "And even though he's shown some interest in a newer version that could still include ACA fixes, he's been slow to start negotiations and the outcome of any future talks is highly uncertain.",
    "$275 million: The amount of money philanthropist MacKenzie Scott donated to Planned Parenthood, which was the largest donation by a single donor in the organization's over 100-year history.",
    "Rep. Mo Brooks says Trump asked him to rescind 2020 election\nMarch 23, 202205:02\nIn Georgia, where he'll be on Saturday, polls show the Trump-backed David Perdue trailing incumbent Gov.",
    "Enrollment reached a new official peak of 14.5 million through the law's health care marketplace, and upwards of 15.5 million according to a broader count by ACA analyst Charles Gaba.",
    "If changes discussed by Democrats this year pass, the U.S. might get close to providing universal coverage (with a large exception for undocumented immigrants, who are ineligible).",
    "Trump appointed both men, now GOP Senate candidates, to the panel, but the White House says they can no longer serve on the council since they are candidates for federal office.",
    "And maybe most stunningly of all is Brooks' allegation  after the un-endorsement  that Trump asked him to rescind? the 2020 presidential election and reinstate him as president.",
    "The Affordable Care Act celebrated its 12th anniversary on Wednesday, with tributes pouring in from Democratic politicians, and it comes at an all-time high point for the law.",
    "But the reality is that Brooks had already been losing altitude in this three-way May 24 GOP primary, and Trump takes special pride of his endorsement won-loss record.",
    "But first: When Donald Trump travels to Georgia this Saturday for his latest rally, he'll arrive in his weakest political position in months  within his own party.",
    "17: The number of states where bird flu has been detected in flocks, as America faces its worst outbreak since 2015 (experts say the risk to humans remains low).",
    "Adding more urgency to the conversation, Medicaid has been operating under emergency rules during the pandemic that prevent state programs from dropping people.",
    "Instead, the court urged Wisconsin officials to move forward with a Republican-backed map that had previously been rejected by the state's Supreme Court.",
    "Once that emergency declaration ends, there could be a flood of newly uninsured people looking for a backstop that only a patched-up ACA might provide.",
    "But the ACA is also at a quiet crossroads this month that could determine whether it will build on its gains even further or start to roll them back.",
    "The House bill also would have offered subsidized private plans to 2.2 million more uninsured in the 12 states that have not expanded Medicaid.",
    "Wisconsin redistricting: The Supreme Court on Wednesday blocked a Wisconsin state legislative redistricting plan crafted by Democratic Gov.",
    "80,040,040: The number of confirmed cases of coronavirus in the United States, per the most recent data from NBC News and health officials.",
    "The NBC News poll finds Republicans increasingly considering themselves more as supporters of the GOP rather than as supporters of Trump.",
    " This is not an Endorsement, but I'm just askin'.?\nWisconsin Senate: Democratic candidate Mandela Barnes released his manufacturing plan.",
    "The Biden administration is assembling a team to ready contingency plans in case Russia uses chemical weapons, per the New York Times.",
    "So far Durant's campaign has spent $2 million on ads, while Britt's has spent $1.2 million and Brooks' campaign has spent $449,000.",
    "23.5: The number of hours that senators questioned Judge Ketanji Brown Jackson for over the last two days, per NBC's Julie Tsirkin.",
    "Brad Little signed a bill into law modeled after the controversial Texas law that bans abortions after six weeks of pregnancy.",
    "Brooks himself has been outspent on the airwaves by Britt and Army veteran Mike Durant, who is self-funding his campaign.",
    "84: The age at which former Secretary of State Madeleine Albright, the first woman to serve in the post, died yesterday.",
    "Johnson has already spent over $2.6 million on ads so far, according to AdImpact, and isn't facing a primary challenger.",
    "He withdrew his endorsement of Mo Brooks in Alabama's Senate race, citing Brooks' words from an Aug. 2021 rally.",
    "$1.8 billion: The amount of Covid stimulus money obtained via alleged fraud, according to an IRS investigation.",
    "Even though Trump withdrew his endorsement of Brooks yesterday, the group is still backing the congressman.",
    "WASHINGTON  If it's Thursday ... President Biden, in Europe, pushes allies to ramp up pressure on Russia.",
    "... Ketanji Brown Jackson's confirmation hearing enters its final day (hearing from outside witnesses).",
    "Democrats hoped to use their Build Back Better? bill to extend the ACA subsidies, at least temporarily.",
    "Republican political opposition has also plummeted after years of failed repeal efforts and lawsuits.",
    "Brian Kemp in the state's gubernatorial primary, despite Trump appearing in multiple ads for Perdue.",
    "... And Madeleine Albright, the first woman to serve as secretary of state, passes away at age 84.",
    "If they don't, premiums will likely become unaffordable for some of the newly enrolled.",
    "... Speaker Pelosi confirms she's backing Rep. Henry Cuellar in the Texas-28 runoff.",
    "Meanwhile, Democrats running to oust him are still fighting it out in a primary.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Evers' map would have created a new majority-Black district near Milwaukee.",
    "979,516: The number of deaths in the United States from the virus so far.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Another 18.7 million are covered under the law's Medicaid expansion.",
    "But Sen. Joe Manchin, D-W.V., killed that bill in December.",
    "The two will face each other in a May primary runoff.",
    "... NBC's Benjy Sarlin looks at Obamacare at age 12.",
    "They expire at the end of this year, however.",
    "(That's 34,780 more than yesterday morning.)",
    "(That's 1,267 more than yesterday morning.)",
    "Idaho GOP Gov.",
    "Tony Evers."
  ]
}