{
  "id": 1200,
  "mediaId": 19,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "Analysis: Senate Majority May Come Down to 11 Battleground Races",
  "image": "https://media.breitbart.com/media/2022/03/Adam-Laxalt-Cortez-Masto-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/15/analysis-senate-majority-may-come-down-11-battleground-races/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver and Matthew Boyle",
  "authorUrl": "",
  "termIds": [
    2491,
    2491,
    1765,
    1765,
    1878,
    1878,
    729,
    729,
    1462,
    1462,
    1404,
    1404,
    815,
    815,
    571,
    571,
    2799,
    2799,
    2834,
    2834
  ],
  "sentences": [
    "McCrory also recently spoke out in support of Trump's longtime nemesis Senate GOP Leader Mitch McConnell (R-KY), saying he wanted to compliment? McConnell for his take on the concept of legitimate political discourse.?\nWhile Budd and McCrory were found polling neck-and-neck in a hypothetical matchup in a Cygnal poll in January, former Rep. Mark Walker (R-NC) also remains in the race in a distant third place.",
    "While RealClearPolitics rates the general election here as lean Republican,? Cook Political Report, another election analysis outlet, rates it solid Republican.?\nFlorida, Lean Republican\nIncumbent Sen. Marco Rubio (R-FL) has so far been outraised by his likely Democrat challenger, Rep. Val Demings (D-FL), who reported the third-highest Senate fundraising haul behind Warnock and Kelly last quarter.",
    "The primary field is packed with other Republicans, including Rep. Vicky Hartzler (R-MO), whom Sen. Josh Hawley (R-MO) is supporting; Attorney General Eric Schmitt, whom Cruz is supporting; Rep. Billy Long (R-MO); and Mark McCloskey, who famously appeared with his wife as armed homeowners amid Black Lives Matter protests and riots.",
    "Colorado, Lean Democrat\nSen. Michael Bennet (D-CO) could face any of a handful of Republican candidates running in the June 28 primary, including Olympian and former local GOP chair Eli Bremer, businessman Joe O'Dea, real estate developer Gino Campana, state Rep. Ron Hanks, or radio host Deborah Flora.",
    "Candidates trailing Greitens have pointed to scandals that plagued his tenure as governor, including a sexual assault charge that was ultimately dropped in court but still prompted him to resign from office in 2018 because of what he described as an incredible amount of strain? on his family.",
    "When McConnell, who has typically backed incumbents, announced his endorsement of Walker, Walker thanked him for his commitment to bringing the party together toward the collective goal of defeating Senator Warnock.?\nMade a quick trip to DC to see some friends and future colleagues.",
    "Attorney General Mark Brnovich (R), who is running, won a high-profile U.S. Supreme Court case last year upholding a ban on ballot harvesting, but Brnovich has still come under pressure from Trump for not doing more to pursue Trump's claims of election fraud in Maricopa County.",
    "The general election is therefore poised to be a matchup between either Budd or McCrory and the frontrunning Democrat candidate, Cheri Beasley, a black woman and former state Supreme Court justice who has raised the most money among the Democrat candidates so far.",
    "Oz at one point, for instance, appeared to promote red flag? gun control laws on one of his shows, was found to have ownership in a company fined for employing illegal aliens, and has raised questions about his deep roots in Turkey, where he has dual-citizenship.",
    "Pennsylvania, Toss-up\nPennsylvania Republicans have been warming up to former hedge fund CEO David McCormick as a top Senate contender after Trump-backed candidate Sean Parnell's campaign was derailed by a public custody battle with his estranged wife.",
    "Walker, who is a household name in Georgia after winning the Heisman Trophy as a University of Georgia football star and going on to play in the NFL, has been polling miles ahead of his closest primary challenger, Agriculture Commissioner Gary Black.",
    "Although Oz carries a hundred percent name recognition and initially appeared well-received when he launched his campaign, his background has been scrutinized amid his bid for office and unearthed concerns seem to be tarnishing his candidacy.",
    "The Missouri Republican is an outspoken ally of Trump and reinforced his allegiance to the president last fall when he declared in a Breitbart News op-ed that he would not support McConnell as Senate GOP leader should Greitens be elected.",
    "A Philadelphia Inquirer report recently described the Democrat contest as a Pennsylvania-sized version of Joe Biden vs. Bernie Sanders,? in which Lamb has attempted a more moderate persona while Fetterman appears more outside the box.",
    "Ron DeSantis (R), became a mandate-free respite in the face of nationwide Democrat-led coronavirus mandates over the past two years, and now, for the first time in history, Republicans have surpassed Democrats in voter registration.",
    "Support from both Trump and the conservative Club for Growth, which is pouring millions into Budd's campaign  including by launching a $10 million ad blitz in the last two months of the primary  has strengthened Budd's winnability.",
    "Walker represents a rare case of being backed by both Trump and Trump foe McConnell and has promoted a vision for a unified Republican Party amid other primary battles in his state  most notably the gubernatorial race between Gov.",
    "The Republican who will undertake challenging the well-funded Arizona Democrat is somewhat unclear in the early stages of the primary, which takes place August 2, but election integrity is likely to be a top topic for candidates.",
    "After 2020, concerns over the election results dominated headlines in Arizona, and Trump has since found himself at odds with state leaders as he continues to contest the results, which showed he lost by less than half a percent.",
    "If 2022 ends up being a big red wave year, this one could swing towards the GOP in the home stretch, but do not expect it to be easy as Bennet is likely to have the backing of significant national Democrat forces and finances.",
    "Georgia, Toss-up\nGeorgia's general election for Senate, which will take off after the state's May 24 primary, has shaped into a likely faceoff between incumbent Sen. Raphael Warnock (D-GA) and former athlete Herschel Walker.",
    "The latest primary poll, taken by Fox News, showed all three polling in the single digits behind McCormick and Oz, though a plurality of respondents in that poll, or 31 percent, said they were undecided on whom to vote for.",
    "Chris Sununu (R), decided at the end of last year to instead run for reelection as governor, despite encouragement from McConnell and other national Republicans like Sen. Ted Cruz (R-TX), according to a Fox News report.",
    "McCrory is backed by the state's retiring senator, Sen. Richard Burr (R-NC), who is leaving office on a sour note with Trump after joining six other senators in voting to convict Trump over the January 6 riot.",
    "That thin margin suggests the Senate race could also come down to the wire, especially if Budd, Trump's preferred candidate, wins the primary and runs a campaign that mirrors that of the former president's.",
    "Republican candidates at this stage include Army veteran Donald Bolduc, who served multiple tours in Afghanistan and ran for Senate in 2020, state Sen. Chuck Morse, and Londonderry Town Manager Kevin Smith.",
    "The GOP has targeted Hassan's seat as a pickup opportunity that is especially ripe given Hassan won her race in 2016 by the narrowest Senate race margin in the country, 0.1 percent, or about 1,000 votes.",
    "Arizona, Toss-up\nSecond only to Warnock in fundraising in the last quarter of 2021 was incumbent Sen. Mark Kelly (D-AZ), a former astronaut who banked $8.9 million according to his last financial report.",
    "The map shows Democrat incumbents in Georgia, Nevada, Arizona, New Hampshire, and Colorado will have to work to defend their seats, and the same goes for Republican incumbents in Wisconsin and Florida.",
    "Ohio, Lean Republican\nThe latest polling here has businessman Mike Gibbons out in front in the GOP primary for this open seat, with former state Treasurer Josh Mandel in second place and author J.D.",
    "Republicans need to gain a net one seat to take back the majority in the upper chamber, which is currently split 5050 but controlled by Democrats because the vice president casts tiebreaking votes.",
    "The New York Times detailed that Masto began her campaign strategy in 2022 in part by targeting Nevada's Hispanic population, which makes up a little under a third of the state's total population.",
    "Republicans' opportunity to take over lies in seven toss-up elections and four elections that lean either toward Republican or Democrat, according to the most up-to-date RealClearPolitics map.",
    "In at least three recent polls, McCormick has led the second-place candidate, television celebrity Dr. Mehmet Oz, by a modest margin in the race to replace retiring Sen. Pat Toomey (R-PA).",
    "The winner of the GOP primary appears to be headed for a race against Marine veteran Lucas Kunce or former state Sen. Scott Sifton, the two best-funded candidates in the Democrat primary.",
    "New Hampshire, Toss-up\nThe primary in the Granite State is still six months away, slated for September 13, and Sen. Maggie Hassan (D-NH) has yet to see a clear Republican opponent emerge.",
    "While the state has had a fully Republican-controlled legislature for almost two decades, Democrats stunned the country in 2020 by eking out narrow wins in Georgia at the federal level.",
    "While Trump lost Wisconsin in 2020 by less than one point, advantageous to Johnson are Biden's national approval, which has been deeply underwater for months, along with Gov.",
    "Walker has nevertheless been edging out Warnock in polls, but the race is angling to be a tight one considering Walker's lead has stayed within the polls' margins of error.",
    "The clear gains Republicans have made with that voting bloc serve to endanger Masto's reelection chances considering she appears to be planning to rely on Hispanic voters.",
    "Billionaire entrepreneur Peter Thiel is throwing his weight behind Brnovich challenger Blake Masters, a venture capitalist and president of Thiel's eponymous foundation.",
    "Tony Evers' (D) baggage from Kenosha riots in 2020 and a horrific parade massacre in Waukesha this year allegedly carried out by a man with a long criminal track record.",
    "Colorado is a tough state for Republicans to win in statewide in any cycle, but they have done it before in recent history as now former Sen. Cory Gardner (R-CO) showed.",
    "Indicative of Georgia's highly competitive political landscape is the fact that Warnock and Walker both ended 2021 as two of the top Senate fundraisers in the country.",
    "Former Ohio GOP chairwoman Jane Timken and state Sen. Matt Dolan  two establishment forces  are also in the hunt but down in fourth and fifth place in polling.",
    "One indicator of Masto's vulnerability lies in a recent Wall Street Journal poll that found Republicans lead Democrats by nine points with Hispanic voters.",
    "gg pic.twitter.com/RLPX4iV8L0\n Herschel Walker (@HerschelWalker) March 11, 2022\nGeorgia has evolved into one of the most contentious battleground states.",
    "Democrats have until the August 9 primary to determine the candidate best equipped to unseat Johnson, and there are many to choose from at this stage.",
    "On the Republicans' side, one top contender is Rep. Ted Budd (R-NC), whom former President Donald Trump endorsed in a surprise announcement last June.",
    "Once a presidential contender and target of Trump's mockery in 2016, Rubio now finds himself endorsed by Trump in his bid for a third term in office.",
    "Warnock was, however, number one nationwide in the last quarter, amassing $9.8 million and reporting a monster sum of $23 million in cash on hand.",
    "Trump won this state by wide margins in both 2016 and 2020, and the reddened nature of Ohio bodes well for whoever wins the GOP nomination.",
    "Thirty-five Senate seats are up for grabs in November, but 11 of them could determine which party controls the Senate in the next Congress.",
    "Nevada, Toss-up\nSen. Catherine Cortez Masto (D-NV) appears to be one of Democrats' most vulnerable incumbents heading into the midterms.",
    "The presidential race there was the closest of any state and came down to about 12,000 votes out of nearly five million votes cast.",
    "Mandela Barnes (D) currently stands out as a frontrunner as he is leading in polls and boasts endorsements from prominent Sens.",
    "Also in the primary mix are military veteran Kathy Barnette, real estate developer Jeff Bartos, and businesswoman Carla Sands.",
    "Warnock, a longtime pastor, also won in that election cycle and is now finishing out the late Sen. Johnny Isakson's term.",
    "Eric Greitens (R), a retired Navy SEAL, has been leading in Republican primary polls ahead of the August 2 primary race.",
    "However, the Buckeye State is still a battleground state and Democrats seek to take this one if they can in November.",
    "Doug Ducey (R), whom the New York Times detailed as McConnell's preferred candidate, recently ruled out running.",
    "Whoever wins the primary will likely face Rep. Tim Ryan (D-OH) in the general election to succeed retiring Sen.",
    "The state's primary takes place June 14, and polling has so far shown mixed results for both Laxalt and Masto.",
    "We talked about how we have to save the American Dream so that everyone can have the opportunity to succeed.",
    "Trump just barely edged out a victory in North Carolina in 2020  winning with about 1.4 percent of the vote.",
    "North Carolina, Toss-up\nOne of the first battleground state primaries happens in North Carolina on May 17.",
    "Wisconsin, Toss-up\nSen. Ron Johnson (R-MO) is pursuing reelection in Wisconsin with the backing of Trump.",
    "Pat McCrory (R), who previously served as Charlotte mayor and host to a popular Charlotte radio show.",
    "Up for grabs are open seats of retiring senators in North Carolina, Pennsylvania, Missouri, and Ohio.",
    "Evers is also up for reelection and considered one of the most vulnerable governors in the midterms.",
    "She will likely face Trump-backed Adam Laxalt, who formerly served as the state's attorney general.",
    "Brian Kemp (R) and former Sen. David Perdue (R-GA)  being bitter and combative in nature.",
    "The primary takes place in two months on May 17, the same day as North Carolina's.",
    "He is not actively engaged or working on any matters for Breitbart News.",
    "John Fetterman (D) or Rep. Conor Lamb (D-PA) in the general election.",
    "Disclosure: Breitbart News is represented by Cooper & Kirk, PLLC.",
    "Rubio has however continued to dominate the race in polls.",
    "Benefitting Rubio is Florida's reddening trajectory.",
    "We are so grateful to have you all on @teamherschel!",
    "The North Carolina congressman is facing former Gov.",
    "The Republican candidate is likely to face Lt. Gov.",
    "Vance either tied for second or in third place.",
    "Cory Booker (D-NJ) and Elizabeth Warren (D-MA).",
    "Adam Laxalt is a partner at Cooper & Kirk.",
    "The best-known potential challenger, Gov.",
    "Missouri, Lean Republican\nFormer Gov.",
    "The Sunshine State, led by Gov.",
    "One such leader, Gov.",
    "Rob Portman (R-OH).",
    "Lt. Gov."
  ]
}