{
  "id": 2312,
  "mediaId": 151,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "More Dem Senate hopefuls split with Biden on border",
  "image": "https://www.politico.com/dims4/default/eb7ad72/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F38%2Fee%2Fdb13294a495eb6c8704d7c3d5f29%2Fpennsylvania-democrats-96064.jpg",
  "link": "https://www.politico.com/news/2022/04/18/more-dem-senate-hopefuls-split-with-biden-on-border-00025925",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "A spokesperson for Warnock said he does not support lifting Title 42 at this time.?\nHe believes in protecting the humanity of migrants at the border, but before this policy is rescinded, the administration should present a plan for how it will ensure our border security has the manpower, infrastructure, humanitarian and legal resources they need to prevent this policy change from making an already dire humanitarian situation worse,? the spokesperson said.",
    "One of her opponents, Milwaukee Bucks executive Alex Lasry, another Wisconsin Senate candidate, put it this way: We must have an understanding of a comprehensive plan that will deal with an influx of asylum seekers before any changes to Title 42 are made.?\nWhat's more, Democratic Senatorial Campaign Committee Chair Gary Peters (D-Mich.) said Monday that Democratic senators and candidates are right to raise questions? about the policy.",
    "Rep. Val Demings of Florida, who is challenging Sen. Marco Rubio (R-Fla.), seemed to defend the Biden administration's move earlier this month, but her campaign said on Monday that until there is a plan to put more boots on the ground and support our law enforcement officers at the border, Chief Demings does not support lifting Title 42.?\nThat leaves Tom Nelson of Wisconsin as an outlier.",
    "Barnes said in a statement for this story that we need to have a plan in place to make sure we're keeping asylum seekers and people in the U.S. safe before we lift Title 42.?\nThe Centers for Disease Control and Prevention decided this month to roll back a suspension of some migrants into the United States, citing advances in vaccines and treatments.",
    "A White House official said that Title 42 resulted in rapid expulsions of people who illegally crossed the border and because they were not processed they ultimately faced no consequences for attempting to re-enter the country illegally.? That will all change on May 23, according to the official, who was granted anonymity to speak candidly.",
    "This is a really tough issue for Democrats.?\nHassan declined to comment on Sharry's criticism, but said in a statement that the administration should not end Title 42 until it has a comprehensive plan.?\nMany immigration groups support Democrats who are questioning the administration, but don't support a bill to delay the policy.",
    "The Pennsylvania lieutenant governor and front-runner for the state's Democratic Senate nomination is distancing himself from President Joe Biden's plans to end pandemic-era border restrictions, known as Title 42.\nWe should not end Title 42 until we have a detailed plan in place,? Fetterman told POLITICO this weekend.",
    "If you have a surge of immigrants at the border, if you have mass catch-and-release policies put in place, I think you're putting all those Democrats in terrible political jeopardy,? said Domingo Garcia, president of the League of United Latin American Citizens.",
    "The Senate candidate and Outagamie County executive said Barnes, one of his primary opponents, and other Democrats are showing nothing short of political cowardice.?\nI've been in these polling briefings and Democrats are scared to death of this issue.",
    "Cheri Beasley, the presumptive Democratic Senate nominee in North Carolina, believes that it is not the right time to lift this policy, especially without a plan in place to deal with a potential influx in migrants,? said spokeswoman Dory MacMillan.",
    "Five more Democratic Senate candidates told POLITICO they disagree with the way the Biden administration is phasing out Title 42, the latest sign that Biden's policy position is a big loser among purple-state Democrats facing tough elections.",
    "Polls show it's one of the toughest areas for Democrats this fall with independent voters, and even some immigration groups say the administration needs to do more to help protect the party's slim majorities.",
    "Until there is a plan, for the safety of our citizens and those seeking asylum, they should not lift it,? said Wisconsin state Treasurer Sarah Godlewski, who is running for the Democratic Senate nomination.",
    "| Matt Rourke/AP Photo\nBy Burgess Everett and Holly Otterbein\n 04/18/2022 04:28 PM EDT\nUpdated: 04/18/2022 05:09 PM EDT\nPLYMOUTH MEETING, Pa.  John Fetterman says he's 100 percent? behind the Biden agenda.",
    "Asylum and other legal migration pathways should remain available to those seeking protection, and we are working to expand legal pathways in the region so that people don't make the treacherous journey.",
    "I want to give the administration an opportunity to fully articulate how they are going to handle the situation.?\nBurgess Everett reported from Washington and Holly Otterbein reported from Pennsylvania.",
    "Support the president.?\nAnd it's not just in the open Senate seat races in North Carolina, Pennsylvania and Wisconsin  the policy debate is seeping into incumbents' reelection campaigns as well.",
    "And look, we don't only need a long-term and detailed plan here for ending Title 42, but we still need to fix our broken immigration system as a whole.?\nFetterman is certainly not on an island.",
    "Mandela Barnes, who is also running for the Senate in Wisconsin, shows that even on the left there are few Democratic Senate candidates giving a full-on embrace to Biden's border policies.",
    "But this could play to that.?\nLiberal activists, however, are upset at those Democrats now defending the controversial asylum policy, which was initiated by former President Donald Trump.",
    "Sen. Raphael Warnock (D-Ga.), a leading progressive on many issues, has received blowback from immigration groups in his state for questioning the administration's border decision.",
    "But when you pretend that you're something you're not, it doesn't work,? said Frank Sharry, executive director of America's Voice, an immigration advocacy group.",
    "Otherwise, the Biden administration could be locked in a lengthy political fight with members of its own party, dividing them just as they need to unite.",
    "So, too, is Pennsylvania state Rep. Malcolm Kenyatta, another Senate hopeful, who said we need a plan? now that the Trump-era policy has been reversed.",
    "Michael Bennet (D-Colo.), Cortez Masto and Warnock are staying off that bill but raising questions about the administration's policies.",
    "But those not seeking protection or who don't qualify will be promptly removed to their countries of origin,? the official said.",
    "And Hassan in particular surprised some supporters by both joining the bill and recording a video at the border wall.",
    "Peters is also the Senate's Homeland Security Committee chair, with the power to conduct oversight on the decision.",
    "Unless we have a well thought-out plan, I think it is something that should be revisited and perhaps delayed.",
    "Senate centrists are leading the charge against the policy, with some even signing onto a bill to delay it.",
    "I certainly don't think Maggie Hassan's border wall stunt was anything other than a disaster for her.",
    "Officials plan to implement that on May 23, though many fear the border will quickly be overwhelmed.",
    "Sen. Catherine Cortez Masto (D-Nev.), another incumbent in a tough race, is reviewing that bill.",
    "\"We should not end Title 42 until we have a detailed plan in place,? Pennsylvania Lt. Gov.",
    "There needs to be a plan, and right now it doesn't look like the administration has one.",
    "Warnock has not yet signed onto the bipartisan bill to delay Title 42's implementation.",
    "It falls into the false narrative of the Republicans, that we have an open border.",
    "And an increasing number of Democrats say the whole thing needs to be paused.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire are supporting it.",
    "Senate races are heating up and border politics are increasingly volatile.",
    "John Fetterman, a frontrunner for the Democratic Senate nomination, said.",
    "The administration has a few weeks to cool the criticisms from Democrats.",
    "Because a lot of them, they don't have any backbone,? Nelson said.",
    "The timing of the decision is inopportune for Democrats.",
    "Democrats have got to stand up and do the right thing.",
    "I'm going to defer judgment on that,? Peters said.",
    "But the criticism from Fetterman and Lt. Gov.",
    "But Warnock is sticking to his position.",
    "I mean, we want her to get elected.",
    "We think she's a terrific senator.",
    "But incumbent Democratic Sens.",
    "That's false, it's not true.",
    "Well, with one exception.",
    "And for now, Sens.",
    "And why?"
  ]
}