{
  "id": 2322,
  "mediaId": 195,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Vulnerable Democrats buck Biden on Trump-era immigration fight",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/kellymark_040522gn_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/senate/3269162-vulnerable-democrats-buck-biden-on-trump-era-immigration-fight/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordain Carney",
  "authorUrl": "https://thehill.com/author/jordain-carney/",
  "termIds": [
    886,
    1060,
    1147,
    1765,
    2039,
    2066,
    2087,
    2505,
    146,
    571
  ],
  "sentences": [
    "Sen. Mark Kelly (D-Ariz.) offered a stark warning to the administration as he visited the U.S.-Mexico border this week: Without a comprehensive plan, they could face a humanitarian crisis.?\nThe administration's decision to end the Trump-era Title 42 policy, which allows for the rapid expulsion of migrants at the border and blocks them from seeking asylum due to the pandemic, has opened up a high-profile rift between Biden and Democrats in races that will determine if they keep the Senate majority.",
    "Jack Pandol, a spokesman for the McConnell-aligned Senate Leadership Fund, told The Hill that the worrisome thing for Democrats like Mark Kelly is that it's likely to get worse? and that the administration's decision was driving a wedge in their party.?\nI think that's why you see this politically motivated backpedaling on Title 42 is they recognize that it's likely to make the situation at the border even worse than it already is.",
    "Mandela Barnes, the frontrunner for the Democratic nomination to take on GOP Sen. Ron Johnson, told the Milwaukee Journal Sentinel that he opposed the administration's decision because there's not a detailed plan in place so that we can keep asylum seekers and people in the country safe.?\nI'd like to see Biden put forward a comprehensive plan that deals with an influx of asylum seekers before we lift Title 42,? he added.",
    "And after Biden's 2021 address to Congress, Kelly criticized the president for not laying out a comprehensive plan to address the immediate crisis at the border? and vowed to continue holding this administration accountable.?\nSenator Kelly has spent his first 16 months in office addressing the issues that matter most to Arizonans, which is why he's worked for months to ensure a humane, orderly process at the border.",
    "Hassan, a member of the Senate Homeland Security Committee, said in a statement that she would keep pressing the administration for a comprehensive plan to strengthen border security and deliver additional resources to the border, which is especially important given its recent announcement to end Title 42.?\nDistancing themselves from the administration's Title 42 decision carries its own set of risks.",
    "Kelly, speaking with reporters during his fifth trip to the state's southern border since joining the Senate, said he was in frequent contact with Department of Homeland Security Secretary Alejandro Mayorkas but that the administration reaction had so far been unacceptable.?\nRight now we have a crisis on our southern border.",
    "While we welcome this change,? they added, it stands in stark contrast to DHS's treatment of black and brown migrants, who have been forced to wait in danger all the while.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He predicted that the elimination of Title 42 will not earn them any additional votes, but will surely cost them liberal votes.?\nKelly, in a joint press release with Sinema, was one of the first Senate Democrats to criticize the administration's decision to rescind Title 42.",
    "We cannot continue to turn a blind eye to those in need at our borders or ignore clear inequities in Title 42's implementation  inequities that were recently highlighted by DHS's explicit support for exempting Ukrainians at our borders from Title 42,? the groups wrote.",
    "Underscoring the tricky political situation Hassan is facing, the Senate GOP arm both accused Hassan of having a MAGA makeover? and touted criticism Hassan faced back in her home state over the trip and the photofrom New Hampshire progressives.",
    "Sen. Maggie Hassan (D-N.H.), who is up for reelection in November, used the Senate's April recess to visit the southern border for a third time, including releasing a photo of herself standing in front of the border wall.",
    "Kelly is typically a reliable ally for Biden and has avoided the sort of backlash from fellow Democrats that has sparked talk of a primary challenge against Arizona Sen. Kyrsten Sinemawho isn't on the ballot until 2024.",
    "Republicans view immigration as a potent political issue not only in Arizona  a border state with one of the country's largest Hispanic populations  but in states with races far from the border.",
    "Biden faced pressure for months from immigration advocates and Democratic allies to end the Trump-era policy that they viewed as illegal and cruel to those fleeing persecution and danger.",
    "Kelly and Hassan are two of the five Democrats who signed onto a bill last week to effectively prevent the administration from lifting Title 42 by tying it to the public health emergency.",
    "A group of Arizona immigration advocacy groups released a joint statement stressing that they emphatically disagree? with Sinema and Kelly, urging that Title 42 stay in place for now.",
    "But a Politico and Morning Consult poll found that 54 percent of registered voters surveyed said they oppose the Biden administration's decisions, while 35 percent support the move.",
    "Though 62 percent of Democrats polled said that they supported the decision, only 33 percent of Independents held the same position and 53 percent said that they opposed the move.",
    "Republicans, in particular, point to a spate of budget votes Kelly and other 2022 Democrats took last year related to the border and immigration as fueling their campaign attacks.",
    "Sen. Catherine Cortez Masto (D-Nev.) and Raphael Warnock (D-Ga.), two other Democrats facing tough elections this fall, have also slammed the administration's decision.",
    "Though Arizona tilted toward Democrats in 2020, Republicans are vowing to use immigration, and Biden's low poll numbers, to try to flip the Senate seat in 2022.",
    "Senator Kelly has proven he's someone Arizonans can always count on to put our state first,? said Sarah Guggenheimer, a spokesperson for Kelly's campaign.",
    "They view Kelly's stance on Title 42 as the Democratic senator trying to find distance from the president and the national party heading into November.",
    "But immigration has been a running point of tension between Kelly and the administration, dating back to the earliest days of Biden's presidency.",
    "We are delighted to not only be discussing their economic failures but also their failures at keeping our southern border safe,? said T.W.",
    "I warned them about this months ago and they do not have a plan in place on how to deal with the increased numbers.",
    "Kelly is leaning into a border fight with the administration as he seeks his first full six-year term in November.",
    "The other three Democrats who joined with a group of Republicans to introduce the bill are Sinema and Sens.",
    "And it's going to be, to be honest, it's going to be a crisis on top of a crisis,? Kelly said.",
    "The order from the Centers for Disease Control and Prevention (CDC) lifts Title 42 on May 23.",
    "And it's going to draw even more attention to what's already a bad situation,? he added.",
    "Those Senate fights will likely determine if Democrats hold their majority in the fall.",
    "Kelly spoke with Mayorkas in January 2021 about the need for border security.",
    "But he's hardly alone, underscoring the firestorm over the issue.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Arrighi, a spokesman for the Senate GOP campaign wing.",
    "), all three of whom are up for reelection in 2024.",
    "Right now this administration does not have a plan.",
    "Joe Manchin (D-W.Va.) and Jon Tester (D-Mont.",
    "The Democrats are the gift that keeps giving.",
    "In Wisconsin, Lt. Gov."
  ]
}