{
  "id": 2325,
  "mediaId": 239,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Former state Rep. Barnes considering run for lt. gov.",
  "image": "",
  "link": "https://www.washingtontimes.com/news/2017/oct/18/former-state-rep-barnes-considering-run-for-lt-gov/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SCOTT BAUER",
  "authorUrl": "",
  "termIds": [
    2039
  ],
  "sentences": [
    "Mandela Barnes' record of irresponsible behavior in office, which includes attacking a man for asking questions about a vote, shows that he is not up to the serious task of fighting for Wisconsin families,? Republican Party spokesman Alec Zimmerman said.",
    "In response to his consideration of running statewide, the Wisconsin Republican Party said he was unfit for office and referenced a 2015 incident caught on tape where Barnes confronted a well-known protester outside of the Capitol.",
    "MADISON, Wis. (AP) - Former state Rep. Mandela Barnes said Wednesday that he is strongly considering? running for lieutenant governor next year, making him the first prominent Democrat to express interest in the position.",
    "More than a dozen Democrats are either running or considering running for governor against Republican Scott Walker, who said Wednesday that he'll formally announce early next month that he's seeking a third term.",
    "Miles Kristan alleged that Barnes pushed him after Kristan had asked him why he voted for public financing to help pay for construction of a new arena for the Milwaukee Bucks.",
    "The winner of the August Democratic primary for lieutenant governor would be paired with whoever wins the gubernatorial primary to run as a ticket in the general election.",
    "Race baiting helped get them a president, of course they'll use it to protect a failing governor,? he posted on Twitter, referring to President Donald Trump and Walker.",
    "He was cited for disorderly conduct in 2011 after he dumped a glass of beer on state Rep. Robin Vos, who is now speaker of the Assembly.",
    "Political newcomer Robert Louis Slamka, of Madison, is the only Democratic candidate who has registered to run for lieutenant governor.",
    "I just got assaulted by a politician; did anybody else see that?? Kristan says on camera as Barnes walked away.",
    "He now works for State Innovation Exchange doing research and policy work for state lawmakers.",
    "He ran for state Senate but lost in the primary to Democratic incumbent Sen. Lena Taylor.",
    "Barnes, who is black, accused Republicans of race baiting by bringing up the incident.",
    "Barnes, 30, of Milwaukee, served in the state Assembly from 2013 until January.",
    "Kristan was a well-known protester in and around the Capitol starting in 2011.",
    "The immediate aftermath of the confrontation can be seen on the video.",
    "Barnes said he pushed the camera away but did not assault Kristan.",
    "Follow Scott Bauer on Twitter at https://twitter.com/sbauerAP",
    "Neither Kristan nor Barnes was cited in their altercation."
  ]
}