{
  "id": 2326,
  "mediaId": 367,
  "date": "d2022-04-15T00:00",
  "headline": "Republican U.S. Sen. Ron Johnson raised $7.1 million in campaign cash during the first three months of 2022",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/PMJS/a56e8bd5-3e8a-4dde-8000-451ee5e0b211-MCT_US_NEWS_TAXPLAN-COLLINS_2_ZUM.jpg?crop=1663,2641,x635,y207&width=600&height=954&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/04/15/ron-johnson-raised-7-1-million-re-election-bid-first-three-months-2022/7330603001/",
  "sentiment": "0.0",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    661,
    741,
    802,
    1147,
    1568,
    1587,
    1848,
    1925,
    2039,
    2087,
    2427,
    428,
    571,
    2646,
    2661,
    2724,
    2945
  ],
  "sentences": [
    "More:Ron Johnson says his Oshkosh firm and many others benefited from 2017 business tax cut he championed\nMore:Republican U.S. Sen. Ron Johnson, running for a third term, expects education issues to motivate voters in the fall\nFundraising reports for the first quarter are due to be filed Friday.",
    "Nelson, who has leaned into his underdog status in the race, said: \"Bottom line, we're going to have enough money to keep the lights on and get out the message when we need to.\"",
    "In the Democratic primary, Outagamie County Executive Tom Nelson's campaign said it raised $220,000 in the first quarter and had $550,000 cash on hand at the end of March.",
    "Republican U.S. Sen. Ron Johnson just threw down a big fundraising number, raising $7.1 million during the first three months of the year, his campaign said Friday.",
    "Senator Johnson's strong fundraising quarter shows broad support for his campaign,\" said Johnson campaign spokesman Jake Wilkins.",
    "He faces a tough re-election battle in a state that narrowly backed President Joe Biden over ex-President Donald Trump in 2020.",
    "Milwaukee Bucks executive Alex Lasry poured $3.45 million into his campaign and has raised $3.9 million overall.",
    "State Treasurer Sarah Godlewski added $1.5 million to her campaign and raised $2.1 million overall.",
    "Significantly, 35,301 donors gave 56,393 times online, raising $2.1 million, the campaign said.",
    "Johnson's campaign did not announce how much cash on hand it had at the end of March.",
    "Small-dollar online donors have become increasingly important for campaigns.",
    "Johnson's campaign said it received donations from more than 40,000 donors.",
    "Johnson waited until January before announcing his run for a third term.",
    "Other top Democratic candidates have already announced their numbers.",
    "Godlewski's campaign said it had around $1.63 million cash on hand.",
    "At the end of last year it had $2.4 million cash on hand.",
    "Mandela Barnes raised $1.7 million.",
    "Lt. Gov."
  ]
}