{
  "id": 2328,
  "mediaId": 151,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Another Capitol riot participant is cooperating with the Jan. 6 committee. She's reasoning that her cooperation should earn her a reduced sentence.",
  "image": "https://www.politico.com/interactives/uploads/image-service/2022/4/14/616c2f1dfc-1200.jpeg",
  "link": "https://www.politico.com/minutes/congress/04-14-2022/",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    779,
    1147,
    1925,
    2039,
    2087,
    2163,
    2414,
    84
  ],
  "sentences": [
    "[Investigator] Sean Quinn stated his appreciation for her candor and honesty.?\nSeeking a reduced sentence: Shaner said Krzywicki's interview with the panel was important to show her genuine remorse and to help her as well as our nation to make sense of what occurred that heartbreaking day.?\nWhat Krzywicki did: Prosecutors say Krzywicki and her mother, Jean Lavin, arrived in Washington too late to see Donald Trump's speech but meandered with the crowd until they reached the Capitol.",
    "Mandela Barnes to the Milwaukee Journal Sentinel\nThe existing opposition: House Democrats have joined Republicans in introducing a bill that would prevent the Biden administration from lifting the Trump-era provision without a plan to address an anticipated surge of immigrants at the border.",
    "Tap, scroll or click for more g\nWhat's happening: The Biden administration's lifting of a pandemic-borne provision known as Title 42 that allows the government to limit migration at the southern border due to public health concerns is drawing new opposition from a prominent progressive.",
    "Tap, scroll or click for more g\nWhat happened: Republicans are accusing the Biden administration of hypocrisy after extending a mask mandate for public transportation right after ending Title 42, a provision that would restrict immigration at the southern border due to the pandemic.",
    "Senate Democrats have introduced a bill of their own calling for a 60-day extension of the Title 42 policy, along with requiring the Department of Homeland Security to create a plan that would deal with the influx of migrants.",
    "Tap, scroll or click for more g\nCarla Krzywicki of Connecticut said she spoke with three investigators from the Jan. 6 select committee last month to describe her motivation for participating in the events of that day.",
    " ChuckGrassley (@ChuckGrassley) April 13, 2022\nOn the other side of the aisle: Democrats have been largely quiet on the Biden administration's decision to extend the traveling mask mandate by 15 days.",
    "As reported by the Milwaukee Journal Sentinel, Barnes argues that the president needs to \"put forward a comprehensive plan that deals with influx of asylum seekers before we lift Title 42.\"",
    "They entered through a Senate wing door about 10 minutes after the initial breach, the same minute then-Vice President Mike Pence was being evacuated to an underground loading dock.",
    "Mandela Barnes, the Wisconsin lieutenant governor who's running in the primary to challenge Republican Sen. Ron Johnson, is breaking with the administration over Title 42.",
    "The party has been trying to move on from pandemic-related mandates for weeks now, in a bid to show far things have come since the beginning of the 2020 lockdown.",
    "I applaud today's extension and urge the continued centering of the immunocompromised and individuals with disabilities in our ongoing pandemic response.",
    "After a thorough and intense two hours of asking questions, the Attorney Investigator [James] Sasso stated, Carla, you are a breath of fresh air.",
    "Now Krzwyicki wants a federal judge to consider her cooperation with the select committee as a reason to give her a sentence of probation.",
    "https://t.co/vOBE9fFZ9S\n Ed Markey (@SenMarkey) April 13, 2022\nWhy it matters: Democrats staying silent on the issue is no accident.",
    "Rallying to the defense of public transit mandates, as much as most Dems would probably agree, might risk undercutting that message.",
    "A grateful committee: As part of that argument, Krzwycki indicated that the House investigators were pleased with her cooperation.",
    "So many of the witnesses we have spoken to try to minimize their involvement,'? Krzywicki's attorney Heather Shaner indicated.",
    "Last month, I wrote to the CDC and TSA urging them to maintain the mask requirement given the recent rise in COVID-19 cases.",
    "Republicans are piling on theBiden administrationfor extending mask mandates on planes, trains and other public transit.",
    "Our Adam Cancryn has more this morning on how that Covid-message balancing act is playing out at the White House.",
    "There's growing opposition to the Biden administration's plans to lift Title 42 coming from fellow Democrats.",
    "\"There's not a detailed plan in place so that we can keep asylum seekers and people in the country safe.\"",
    "Democrats, on the other hand, are largely staying silent rather than springing to the mandates' defense.",
    "But it's terminating Title 42 at the S border bc threat of Covid supposedly doesn't justify it anymore.",
    "Check out our archive for previous minutes, or sign up for Huddle our morning Capitol Hill newsletter.",
    "Completely hypocritical If Americans are still bound by Covid policies shouldn't our border be too???",
    "), who urged the CDC last month to maintain the policy in light of the recent rise of Covid cases.",
    "Carla Krzywicki of Connecticut is the fourth known member of the mob to cooperate with the panel.",
    "It's rare to see both centrist and liberal members of the president's party speak out so vocally.",
    "One of the few Democratic voices to speak out on the matter was Sen. Ed Markey (D-Mass.",
    "Krzywicki and Lavin spent about 40 to 50 minutes inside the Capitol, prosecutors say.",
    "Krzywicki pleaded guilty to her part in the Capitol breach in January.",
    "Biden Admin extends airplane mask mandate due to concerns about Covid.",
    "Check back later today for updates from the Hill.",
    "That's all for now.",
    "Want to see more?",
    " Lt. Gov."
  ]
}