{
  "id": 2329,
  "mediaId": 65,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "High profile Democrats on this year's ballot break with Biden on lifting immigration restrictions",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/258e6b5e-c4ad-46b6-9376-557e9542962b/810d61bd-28ac-44d1-b181-c9d013625450/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/high-profile-democrats-on-this-years-ballot-break-with-biden-on-lifting-immigration-restrictions",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2039
  ],
  "sentences": [
    "In February, approximately 55% of migrants were returned due to the order rather than being released into the U.S. And last September, in a development that grabbed national headlines, the Department of Homeland Security cited Title 42 as it deported roughly 7,000 asylum-seekers from Haiti who had huddled at the international bridge in Del Rio, Texas.",
    "The Centers for Disease Control and Prevention (CDC) order to lift the restrictions on May 23 could become another political liability for the president and his party, which already faces historical headwinds and an unfavorable political climate partially fueled by soaring inflation and skyrocketing gas prices.",
    "With just over a month to go until President Biden's administration rescinds a Trump-era pandemic restriction known as Title 42 that severely restricted the ability of migrants to cross the U.S.-Mexico border to seek asylum, some high profile Democrats running in the 2022 elections are voicing serious concerns.",
    "\"I have yet to hear a plan from the Biden administration to address the dynamic we will have on the border once Title 42 ends,\" the former congressman from El Paso, 2018 Democratic Senate nominee in Texas, and 2020 White House contender said Tuesday in an interview with the Texas Tribune.",
    "\"I'd like to see Biden put forward a comprehensive plan that deals with an influx of asylum seekers before we lift Title 42,\" said Barnes, the front-runner in his state's Democratic primary for Senate, with the winner taking on GOP Sen. Ron Johnson, whom Democrats view as vulnerable.",
    "The Democrats are trying to maintain their razor-thin majorities in the House of Representatives and Senate in November's midterm elections, as well as trying to make gains in gubernatorial and state legislative contests across the country.",
    "\"Right now we have a crisis on our southern border,\" Sen. Mark Kelly of Arizona said on Wednesday after meeting with U.S. Customs and Border Protection officials at the Douglas Port of Entry along the U.S.-Mexico border.",
    "Barnes told the Milwaukee Journal Sentinel on Tuesday that he opposes lifting the restrictions \"simply because there's not a detailed plan in place so that we can keep asylum seekers and people in the country safe.\"",
    "Kelly is one of two first-term Democratic senators from key battleground states who are being heavily targeted by Republicans who have come out in opposition to the Biden administration's move to rescind Title 42.",
    "And the Biden administration's move came after more than a year of pressure from fellow Democrats amid frustration with the inability to end a policy they view as illegal and cruel to those fleeing persecution.",
    "\"It does not make sense to end this until there is a real plan and the capacity in place to handle those and address those that come over,\" Texas Democratic gubernatorial nominee Beto O'Rourke argued this week.",
    "\"Border agents were very clear with me that the end of Title 42 will lead to a steep increase of attempted crossings that they will not be able to effectively handle because they don't have enough resources.\"",
    "\"My trip to the southern border reinforced my concerns about the administration preemptively ending Title 42,\" Hassan said after touring the U.S.-Mexico border over the weekend in Texas and Arizona.",
    "Sen. Mitt Romney of Utah, the 2012 GOP presidential nominee, called the Biden administration's Title 42 announcement the \"worst domestic news\" of the day, in a tweet following the news.",
    "While it is a public health order, not an immigration policy, it became one of the central border policies in place as the U.S. faces a continuing crisis of numbers at the border.",
    "But with border crossings over the past year at historical highs, the GOP sees the Title 42 announcement by the Biden administration as fresh ammunition on the campaign trail.",
    "A couple of public opinion polls conducted since the administration's announcement on Title 42 indicate majority opposition to rescinding the immigration restrictions.",
    "But at the same time, he argued that it was the \"best GOP political news,\" suggesting that \"Arizona, Nevada, and more Dem senators will lose their elections.\"",
    "BIDEN IMMIGRATION MOVE COULD MAKE MIDTERM CLIMATE EVEN TOUGHER FOR DEMOCRATS\nAnd he said that the administration's reaction has so far been \"unacceptable.\"",
    "And President Biden's approval ratings on how he's handling immigration and border security are well underwater in most national polling.",
    "Hassan and Kelly joined three other moderate Democrats and six Republicans to sponsor a bill to halt the Biden administration's move.",
    "(Sen. Mark Kelly office)\nTitle 42 was an order issued by Donald Trump's administration amid the coronavirus outbreak.",
    "The president's overall standing with Americans is key barometer of how his party will fare in November's midterms.",
    "There is a similar measure in the House that is backed by some Democrats facing tough reelections this year.",
    "It was used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "TEXAS BEGINS DISPATCHING BUSES TO THE BORDER TO TRANSPORT ILLEGAL IMMIGRANTS TO DC\nWisconsin Lt. Gov.",
    "It shouldn't be around forever, but right now this administration does not have a plan.",
    "Mandela Barnes is also on the list of Democrats opposing the rescinding of Title 42.",
    "\"Title 42 was put in place because of a public health emergency.",
    "I warned them about this months ago,\" Kelly told reporters.",
    "The other is Sen. Maggie Hassan of New Hampshire.",
    "And it's not just Senate races."
  ]
}