{
  "id": 2332,
  "mediaId": 238,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Opinion: Democrats must make a strategic choice in Wisconsin's Senate race",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/13/wisconsin-senate-primary-democrats-must-make-strategic-choice-mandela-barnes/",
  "sentiment": "-0.508",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    1925,
    2039,
    146,
    318,
    428,
    571,
    2855,
    2972
  ],
  "sentences": [
    "One can imagine that Sen. Ron Johnson, the Republican incumbent whom Barnes would face should he win his party's nomination, would like nothing more than to make this a race against socialism.? Johnson has a boatload of controversies and gaffes, including his latest flub when he admitted that the plastics business he owned, as well as some of his prominent donors, benefited from the small-business tax provision that he pushed for in the 2017 tax cuts.",
    "But Barnes is now distancing himself from two unpopular, far-left political movements  defunding police and abolishing ICE  despite support from groups backing these efforts and past social media activity referencing these causes.?\nBarnes began the race in a moderate state by picking up an endorsement from one of the biggest progressive names in the country, Sen. Elizabeth Warren (D-Mass.).",
    "Meanwhile, NBC News reported last September that Barnes went far left, stressing his support for Medicare for All, the Green New Deal and making corporations and wealthy people pay their fair share.? He also grabbed endorsements from groups such as Democracy for America, the Progressive Change Campaign Committee and the Working Families Party.",
    "Wisconsin has a history of electing businessmen with deep pockets, including Johnson and former Democratic senator Herb Kohl, though Lasry, who did not arrive in Wisconsin until 2014, has already come under attack from both parties as a carpetbagger trying to buy the race.",
    "Then there is Alex Lasry, a billionaire's son who is on leave as an executive for the Milwaukee Bucks and who has reached up to 17 percent in internal polling by dumping $2.35 million of his own fortune into ads to jump-start his race.",
    "Those two candidates, however, have a combined total of 17 percent, roughly 20 points behind Barnes in recent internal polling, although a large percentage of voters remain undecided.",
    "Voters in the state better get to know the candidates and think a whole lot about electability if they don't want to see Sen. Mitch McConnell (R-Ky.) return as majority leader.",
    "Sarah Godlewski, the state treasurer, has run a savvy campaign appealing to all segments of the party, including rural counties (which she won in her treasurer's race).",
    "Mandela Barnes has tried to stake out his place as a liberal candidate seeking the Democratic nomination for the U.S. Senate,? the Milwaukee Journal Sentinel reports.",
    "More than a quarter of Democratic voters remain undecided, and with nearly four months to go before the August primary, many voters haven't started paying attention.",
    "She has mastered the art of advancing center-left ideas that work in Wisconsin with none of the firebrand rhetoric better suited for Vermont or Massachusetts.",
    "Meanwhile, Tom Nelson, the county executive for rural Outagamie County and former state assemblyman, has been called a scrappy? underdog.",
    "The 2022 midterm cycle will no doubt be challenging for Democrats, but they still have a real shot to hold on to the Senate.",
    "The good news for Democrats is that their front-runner in Wisconsin's Senate primary seems to be course-correcting.",
    "His pro-union bona fides and working-class constituents give him the feel of a rural populist.",
    "The path to keeping Democrats in the majority may well run through Wisconsin.",
    "The bad news is that it might be too little, too late.",
    "It is not as if Democrats lack sensible candidates.",
    "Lieutenant Gov."
  ]
}