{
  "id": 2346,
  "mediaId": 21,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Wisconsin Lt. Gov. Mandela Barnes has early lead in Democratic Senate primary: poll",
  "image": "https://i.insider.com/6242c1b2d1defa00182e2f9a?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/mandela-barnes-wisconsin-senate-democratic-primary-lead-johnson-poll-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    2468,
    2468,
    1568,
    2039,
    2039,
    802,
    802,
    1568,
    571,
    571,
    623,
    623,
    2855,
    2855,
    2780,
    2780,
    2972,
    2972
  ],
  "sentences": [
    "A victory for Democrats in this critical swing state could help the party in their quest to retain control of the Senate, especially as they will likely face a difficult midterm environment and will have tough races in Arizona, Nevada, and Georgia, where President Joe Biden narrowly won in 2020.",
    "Wisconsin Democrats are eager to win back the Senate seat, which has been occupied by Republican Sen. Ron Johnson  a top conservative foil and ally to former President Donald Trump  since he knocked off then-Democratic Sen. Russ Feingold in the 2010 midterm elections.",
    "The Democratic candidates have repeatedly criticized Johnson on a range of issues, from his promotion of COVID-19 misinformation to his contention that Wisconsin had \"enough jobs\" after Oshkosh Defense sought to hire and manufacture its trucks in South Carolina.",
    "This year's Senate contest is shaping up to be one of the most competitive races in the country, as the state narrowly backed Biden over Trump in the 2020 election, with the president winning by roughly 20,000 votes out of nearly 3.3 million ballots cast.",
    "Lasry, Nelson, and Godlewski have also attracted a range of supporters, and the candidates have sought to articulate their respective visions for the future with myriad proposals on health-care reform, climate change, and strengthening workers' rights.",
    "In 2016, Johnson was seen as a highly vulnerable incumbent during his rematch with Feingold, but he pulled off a win that year alongside Trump, who defeated former Secretary of State Hillary Clinton in the presidential race.",
    "His nearest rival was Milwaukee Bucks executive-on-leave Alex Lasry, who received 17% of the vote among primary voters, followed by state Treasurer Sarah Godlewski at 9% and Outagamie County Executive Tom Nelson at 8%.",
    "A Marquette University Law School poll released in early March showed the contest with similar dynamics, with Barnes ahead at 23% support, followed by Lasry at 13%, Nelson at 5%, and Godlewski at 3%.",
    "Mandela Barnes has an early 21-point lead in the state's Democratic Senate primary, bolstered by strong favorability ratings among respondents, according to internal polling shared with Insider.",
    "In the current multi-candidate race, Barnes has the support of 38% of Democratic voters in the state, according to the survey, which was conducted by Impact Research for the Barnes campaign.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The Impact Research survey is based on responses from 449 likely Democratic primary voters from March 16-23, 2022, and has a margin of error of 4.6 percent.",
    "\"To me, the polls represent what I see when I travel the state: that people know I understand their experience because I share that experience.\"",
    "\"We're building a grassroots campaign and taking our message right to every community across the state,\" Barnes said in a statement to Insider.",
    "Barnes  who served in the Wisconsin Assembly from 2013 to 2017 before being elected lieutenant governor on a ticket with now-Democratic Gov.",
    "In the Marquette poll, 33% of all respondents said they had a favorable view of Johnson, while 45% disapproved of the incumbent senator.",
    "The lieutenant governor boasted a 56% favorability rating among primary voters, with 9% having an unfavorable view of him.",
    "AP Photo/Morry Gash\nMandela Barnes has a 21-point lead in the Wisconsin Senate Democratic primary, per an internal poll.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Tony Evers  entered the race last July and has racked up multiple endorsements from state and national lawmakers.",
    "Republican Sen. Ron Johnson, a high-profile incumbent, is running for a third term in office.",
    "Barnes leads his closest rival, Bucks executive-on-leave Alex Lasry, by a 38%-17% margin.",
    "The survey also revealed that 26% of the Democratic primary electorate remains undecided.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Nearly half  48%  of all respondents in the Marquette survey were undecided.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Three percent of respondents opted for another candidate.",
    "The Democratic primary will be held on August 9.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Mandela Barnes of Wisconsin.",
    "Wisconsin Lt. Gov.",
    "Lt. Gov.",
    "Lt. Gov."
  ]
}