{
  "id": 2357,
  "mediaId": 367,
  "date": "d2022-03-17T00:00",
  "headline": "Gov. Tony Evers isn't endorsing any candidates in the Democratic primary for U.S. Senate",
  "image": "https://www.gannett-cdn.com/presto/2022/02/16/PMJS/25d3d417-011b-48cb-a2f0-5d334208bc85-MJS_state16_15.jpg_state16.JPG?crop=2903,1633,x0,y0&width=2903&height=1633&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/03/17/tony-evers-isnt-endorsing-democratic-primary-u-s-senate/7079625001/",
  "sentiment": "0.341",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Marley",
  "authorUrl": "https://www.jsonline.com/staff/2646637001/patrick-marley/",
  "termIds": [
    741,
    802,
    1568,
    1925,
    2039,
    2145,
    146,
    428,
    571,
    2855,
    2945
  ],
  "sentences": [
    "\"Mandela Barnes knows that as the leader of the party, Governor Evers cannot get involved in the primary,\" said a statement from Maddy McDaniel, a Barnes' campaign spokeswoman.",
    "\"He looks forward to continuing their great relationship throughout the campaign and is committed to doing everything he can to support the Governor's re-election.\"",
    "Among the others in the large Senate primary are state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson.",
    "Evers gave a simple \"no\" when asked Thursday at a WisPolitics.com luncheon if he had a favorite in the crowded primary to replace Republican Sen. Ron Johnson.",
    "Evers said in late 2020 he hoped Barnes would run for another term as lieutenant governor but that he would respect whatever decision he made.",
    "And so, we look forward to a robust primary and having somebody be actively campaigning to beat the present U.S.",
    "Tony Evers isn't endorsing his lieutenant governor  or anyone else  in the Democratic primary for U.S. Senate.",
    "Mandela Barnes, who has served with Evers since they were both sworn in in January 2019.",
    "The winner of the Aug. 9 primary will face Johnson in the Nov. 8 general election.",
    "\"As the elected leader of the Democratic Party, that'd be wrong,\" Evers said.",
    "Bill Glauber of the Journal Sentinel staff contributed to this report.",
    "Contact Patrick Marley at patrick.marley@jrn.com.",
    "Barnes got in the Senate race seven months later.",
    "Among those running for Senate is Lt. Gov.",
    "Follow him on Twitter at @patrickdmarley.",
    "\"I know a lot of those people.",
    "They're all good people.",
    "MADISON  Gov.",
    "senator.\""
  ]
}