{
  "id": 2373,
  "mediaId": 21,
  "date": "3/4/2022 12:00:00 AM",
  "headline": "9 top political ad agencies that are shaping key races in the 2022 midterms as money shifts to digital",
  "image": "https://i.insider.com/6212b058462ff20019c5dee1?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/top-digital-political-ad-agencies-to-watch-in-midterm-elections-2022-3",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Coffee",
  "authorUrl": "https://www.businessinsider.com/author/patrick-coffee",
  "termIds": [
    2039
  ],
  "sentences": [
    "00:12\nBoston bomber death sentence reinstated\n00:21\nFlorida set to ban abortion after 15 weeks\n00:24\nNFL drops COVID protocols\n00:14\nSony and Honda to make EVs together\n00:29\nNancy Pelosi reveals husband's stock trades\n00:27\nWe're updating the news until 1pm ET\n00:07\nIt's the 9th day of the Russian war against Ukraine\n00:06\nFire is out at Ukrainian nuclear plant\n00:32\nHungary accepts refugees\n00:27\nElon Musk to Ukraine: Maybe don't use Starlink\n00:26\nFlooded with flag orders\n00:26\nAnalyst toasts to the death of Russian stock market\n00:29\nA week into the Russia and Ukraine war\n03:26\nCheck back soon!",
    "Drew Angerer/Getty Images\nConsidered one of the hottest digital agencies for Democratic candidates, digital persuasion firm Gambit Strategies was launched in early 2021 by Democratic strategists Megan Clasen, who handled digital ad-buying for Biden at Omnicom's GMMB; and Patrick McHugh, who led Democrats' biggest PAC, Priorities USA.",
    "TV is expected to continue to dominate political ad spending for some time since voters tend to be older and heavy TV watchers, with established firms like GMMB and National Media handling most of the money; Kantar/CMAG estimates that this year, digital will account for $1.2 billion of the pie and broadcast, $3.8 billion.",
    "Current clients include candidates in top Senate and gubernatorial races, such as John Fetterman of Pennsylvania and Beto O'Rourke, the Democratic nominee in the upcoming Texas gubernatorial election, as well as a group launching a primary challenge to US Sen. Kyrsten Sinema.",
    "AP Photo/LM Otero\nKenneth Pennington and Hector Sigala, directors of digital and social media for Bernie Sanders' 2016 campaign, launched Middle Seat that year, taking their name from memes that described Sanders as someone who would choose the center seat on a flight.",
    "This year is expected to break ad spending records for a midterm election, with spend on federal and state races set to near $8 billion across broadcast TV, streaming video, social media, and radio, said Steve Passwaiter, VP of Growth and Strategy at Media by Kantar.",
    "The biggest trend in recent years has been a huge shift in dollars to ad-supported digital platforms, helped by the Supreme Court's 2010 Citizens United v. Federal Election Commission decision that supercharged political advertising by lifting donation restrictions.",
    "According to FEC filings, FlexPoint's clients include the Republican State Leadership Committee, Senate candidates Ted Budd of North Carolina and Kelvin Kling of Georgia, and House candidates Matt Jacobs of California and Tom Keane of New Jersey.",
    "In the last election cycle, the firm worked on Sanders' campaign, where Tagaris was a senior advisor, in addition to Georgia gubernatorial candidate Stacy Abrams, the gun control advocacy group run by former Rep. Gabby Giffords, and Sens.",
    "Photo by Chip Somodevilla/Getty Images\nAisle 518 was founded by Tim Tagaris, former partner at ad firm Revolution Messaging, where he helped Sen. Bernie Sanders bring in a reported $218 million in 2016, mostly in small online donations.",
    "His firm's largest clients have included the National Republican Congressional and Senatorial Committees, along with PACs launched by Sen. Mitch McConnell, former House Speaker Paul Ryan, and the National Rifle Association.",
    "The firm was founded in 2015 by Josh Holmes, a former chief of staff to Senate Minority Leader Mitch McConnell; public affairs strategist John Ashbrook; and Michael Duncan, formerly of GOP marketing firm Harris Media.",
    "\"Some players, particularly on the GOP side, think digital is a priority and have almost equal spending across TV, mail, and digital,\" said Liz Bennett, director of advertising at left-leaning Middle Seat Digital.",
    "Cory Booker, Tammy Baldwin, and Kyrsten Sinema, as well as House candidate Litesa Wallace, Rep. Lauren Underwood, and Democratic groups including the Senate Majority PAC and Vote Vets, according to FEC filings.",
    "The 300-person digital marketing and strategy firm also is unusual among its peers in that it has holding company ties; Stagwell, the network run by former Bill Clinton advisor Mark Penn, is an investor.",
    "Clasen is a vet of WPP and Publicis, where she helped brands like AT&T and Samsung adapt to digital before going to lead then-presidential candidate Hillary Clinton's digital ad operations in 2015.",
    "In 2016, Politico dubbed Cavalry \"the go-to GOP shop,\" citing its work helping Sen. Todd Young defeat Democratic vet Evan Bayh and advising McConnell and Republican megadonor Sheldon Adelson.",
    "Middle Seat calls its client base \"decidedly left of center,\" with high-profile candidates and organizations including New York Rep. Alexandria Ocasio-Cortez and the Working Families Party.",
    "Aisle 518 positions itself as an underdog firm that works with ideologically progressive candidates to defeat \"powerful corporate interests and politicians who prioritize their needs.\"",
    "AP Photo/Patrick Semansky\nGOP strategists Tim Cameron and Kegan Beran founded FlexPoint Media in 2017 to unite traditional and digital media services with a platform-neutral approach.",
    "Greg Nash/Pool via AP\nDigital consulting firm Imge was founded in 2013 by GOP veterans including Phil Musser, former executive director of the Republican Governors Association.",
    "Its president, Ethan Elion, was partner at Vertical Strategies, which helped handle digital media for candidates like Sen. Ben Sasse and worked on the RNC's email fundraising.",
    "Charles Krupa/AP\nDemocratic-focused Authentic Campaigns was founded in 2018 by Mike Nellis and Loren Merchan, who like Tagaris also are veterans of Revolution Messaging.",
    "Cameron and Beran were chief digital strategist for the National Republican Senatorial Committee and president of GOP ad firm Strategic Media Placement, respectively.",
    "Drew Angerer/Getty Images\nCavalry works with GOP officials and organizations on persuasion efforts, media production, crisis communications and fundraising campaigns.",
    "As spending increasingly moves online and more platforms pitch political buyers, candidates need help figuring out where they'll get the best returns, said Cameron.",
    "A GOP strategist said their firm often collaborates with Targeted Victory, while a veteran Democrat called it among a handful of GOP firms that \"get digital right.\"",
    "Imge's current clients include Senate candidates Latham Saddler of Georgia, Jeff Bartos of Pennsylvania, and Marjorie K. Eastman of North Carolina, per FEC filings.",
    "Targeted Victory's clients also include companies like FedEx, AT&T, and IBM; the firm helped Meta with its advertising business and ad transparency issues in 2018.",
    "Digital makes sure no voters get left behind; for example, Biden's team reached rural communities with ads on the Professional Bull Riders website, Clasen said.",
    "But they're facing a fight for these digital dollars from digital agencies that are pitching themselves as more adept at managing candidates' online spending.",
    "Drew Angerer/Pool via AP\nTargeted Victory is widely considered one of the most sought-after firms for GOP candidates thanks to its digital fundraising work.",
    "Director of Advertising Liz Bennett, another vet of the Sanders campaign, said pandemic cord-cutting further solidified the firm's focus as digital-first.",
    "Recent clients have included McConnell and Sen. Rand Paul, along with Nevada Senate candidate and former Attorney General Adam Laxalt, per FEC filings.",
    "We believe in a focused, tailored approach to digital organizing and persuasion, and we've had a lot of success with it over the years,\" Nellis said.",
    "They're attracting more than just candidates  one agency founder said he'd turned down five serious venture capital offers over the past four years.",
    "Elion said politics has been slow to adapt to new media, but predicted the distinction between digital and TV-focused agencies would soon disappear.",
    "He also expects new data collection and targeting policies among tech giants Apple, Google, and Meta to complicate the game for ad buyers this year.",
    "Insider spoke to more than a dozen political vets who named nine agencies that have been winning business from top candidates and party committees.",
    "\"Our digital programs are deeply rooted in who our candidates are, where they're running, and the issues that matter to voters in their districts.",
    "Cameron and Kegan predicted that as competition among political agencies heats up, more firms will try to combine all media buying in one place.",
    "Bengtson also handled digital campaigns and content for Planned Parenthood and worked on Hillary Clinton, Barack Obama, and California Gov.",
    "\"I believe in a comprehensive media mix for sound voter strategy, but the trends are obvious; people are way more online now,\" she said.",
    "Political ad firms accelerated their shift to digital in the pandemic, when even senior citizens cut the cord at record rates, she said.",
    "\"In order for us to reach out to more people, we have to be prioritizing digital in the same way we prioritize TV,\" Clasen said.",
    "While Cavalry is considered more traditional than some of its competitors, the firm emphasizes its founders' digital experience.",
    "Rod Lamkey/Pool/AFP via Getty Images\nLike Gambit, Wavelength is a voter persuasion agency that emphasizes creative advertising.",
    "Kelly, Duckworth, and Alex Padilla, along with Cheri Beasley, candidate for the North Carolina Senate, and Wisconsin Lt. Gov.",
    "Political advertising this year is expected to break records for a midterm election, with spending hitting around $8 billion.",
    "Nellis touted Authentic's diverse staff, a focus on digital over broadcast, and belief in hyper-local messaging strategies.",
    "FlexPoint Media\n FlexPoint's founders have worked with former Vice President Mike Pence and other prominent Republicans.",
    "\"It's a fractured environment for media consumption, and we need plans to navigate this chaotic landscape,\" he said.",
    "Bengtson recently said most campaigns talk about the importance of digital media but don't hire enough specialists.",
    "Insiders named 9 of the most notable firms working for top candidates and organizations on both sides of the aisle.",
    "The agency also recently sold voter data to the National Republican Congressional Committee for around $2 million.",
    "Gavin Newsom's campaigns, while McNally was political director for the Democratic Senatorial Campaign Committee.",
    "Other estimates run even higher, and don't include tens of millions spent on direct mail and other analog media.",
    "Gambit is working for 16 campaigns and advocacy organizations, with a focus on statewide races, Clasen said.",
    "It's also landed clients outside of politics, like Consumer Reports and \"Queer Eye\" star Jonathan Van Ness.",
    "Democrats were ahead in adopting online messaging, but the GOP has since gotten more aggressive in digital.",
    "2020 clients included VP Kamala Harris, Colorado Sen. John Hickenlooper and California Rep. Adam Schiff.",
    "They previously worked with former House Speaker Newt Gingrich, Vice President Mike Pence, and Ohio Gov.",
    "Its Co-Founder Zac Moffatt was the digital director for Mitt Romney's failed 2012 presidential campaign.",
    "Tagaris launched Aisle 518, an agency that handles fundraising and voter persuasion campaigns, in 2018.",
    "The firm also helped elect Michelle Wu and Phil Murphy as Mayor of Boston and Governor of New Jersey.",
    "Unless otherwise noted, the agencies declined to comment or did not respond to requests for comment.",
    "Wavelength is heavily involved in this year's top Senate races and often works with larger firms.",
    "According to FEC filings, the agency is currently helping the re-election campaigns of Sens.",
    "Sen. Tim Scott of South Carolina is working with Targeted Victory, among other GOP agencies.",
    "Wavelength Strategy\n Wavelength is among the firms retained by Sen. Mark Kelly of Arizona.",
    "You may download the file here: The Refresh from Insider\nThe Refresh from Insider\nWelcome!",
    "\"I tasked our teams with envisioning a world in October where there is zero platform data.",
    "Mark Kelly and Maggie Hassan; Wavelength is collaborating with GMMB on Hassan's campaign.",
    "The founders worked together on McConnell's 2014 re-election bid, among other campaigns.",
    "Known for fundraising, the firm has recently been actively pitching persuasion services.",
    "Gambit Strategies\n Gambit's co-founder led digital ad strategy for President Joe Biden.",
    "Cavalry\n Cavalry has worked closely with Senate Minority Leader Mitch McConnell (R-KY).",
    "Targeted Victory\n Sen. Marco Rubio of Florida is one of Targeted Victory's top clients.",
    "Middle Seat Digital\n Middle Seat is working on Beto O'Rourke's gubernatorial campaign.",
    "Kevin Dietsch/Pool via AP\n This story is available exclusively to Insider subscribers.",
    "A crop of digital-first firms are giving traditional ad agencies a run for that money.",
    "Emmy Bengtson and Dan McNally launched Wavelength ahead of the 2020 election.",
    "If you can't do it with your own data, then you shouldn't do it,\" Elion said.",
    "We're fresh like live radio, but on your schedule lik...\n00:00\n09:04\nWelcome!",
    "Current clients, per FEC filings, include the re-election campaigns of Sens.",
    "They're listed in alphabetical order, Democratic-affiliated ones first.",
    "One client, according to FEC filings: North Carolina's Cheri Beasley.",
    "Authentic Campaigns\n The firm helped elect Boston Mayor Michelle Wu.",
    "00:36\nSpooler\n Deal icon An icon in the shape of a lightning bolt.",
    "According to FEC filings, it's currently working to reelect Sens.",
    "Both are vets of Sen. Kristen Gillibrand's presidential campaign.",
    "\"Research shows that about 40% of people are unreachable by TV.\"",
    "Aisle 518 Strategies\n Sen. Tammy Duckworth is a current client.",
    "Get ready for a rash of political ads in the coming months.",
    "Mandela Barnes, who is running to replace Sen. Ron Johnson.",
    "Tim Scott, Marco Rubio and Marsha Blackburn, among others.",
    "Imge\n Imge has worked with Sen. Rand Paul of Kentucky.",
    "Your browser does not support the audio element.",
    "The firm has also worked with Sen. Rand Paul.",
    "Become an Insider and start reading now.",
    "Mark Kelly and Tammy Duckworth.",
    "It's now working for Sens.",
    "For Mar 4, 2022.",
    "John Kasich.",
    "For you"
  ]
}