{
  "id": 2401,
  "mediaId": 323,
  "date": "1/23/2022 12:00:00 AM",
  "headline": "Wisconsin's Field of Democratic Senate Hopefuls Is Lining Up on Left of Biden",
  "image": "https://images.wsj.net/im-472054?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/wisconsins-field-of-democratic-senate-hopefuls-is-lining-up-on-left-of-biden-11642942804",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormick",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    849,
    1568,
    2039
  ],
  "sentences": [
    "That is what I believe in and that's what I believe that people of my state want me to do.?\nRounding out the top half-dozen Democrats for fundraising in the Wisconsin race are Dr. Gillian Battino, a radiologist who supports Medicare for All, and Steven Olikara, a former nonprofit chief executive who backs legalizing marijuana and term limits.",
    "What I do support is investing just as heavily in preventing crime from occurring in the first place, in addition to ensuring law enforcement agencies have the resources they need.?\nDuring an online appearance last year at Netroots Nation, an annual conference for progressives, Mr. Barnes made no mention of Mr. Biden in his 10-minute speech.",
    "Wisconsin State Treasurer Sarah Godlewski has said she supports an Elizabeth Warren-style wealth tax.'\n Photo: Amber Arnold/Associated Press\nThree of the four top fundraising Democratic candidates participated in interviews for this story; an aide to Mr. Barnes said he was unavailable over the course of more than a week.",
    "While Democrats trip over themselves to prove who is the most liberal, Senator Johnson is speaking directly to Wisconsinites about the issues that matter: reckless spending, government overreach, and standing up for freedom,? Anna Kelly, a spokeswoman for the Republican Party of Wisconsin, said.",
    "?I don't want to scrap our entire system and start over.?\nShe's said she supports an Elizabeth Warren-style wealth tax.?\nAlex Lasry says he supports Medicare for all who want it,' echoing a slogan put forward by Transportation Secretary Pete Buttigieg when he campaigned for president.",
    "Photo: Mark Hoffman/Associated Press\nMr. Nelson offers the firmest endorsement of the Green New Deal, a statement of goals put forward by progressives in 2019 that, among other things, aims to slow climate change by ending U.S. reliance on fossil fuels within 10 years.",
    "It is the mirror image of what's playing out in some other key states, including Arizona and Pennsylvania, where Democrats say they stand to benefit if GOP voters nominate candidates too conservative or too closely aligned with former President Donald Trump.",
    "Mandela Barnes and State Treasurer Sarah Godlewski, as well as Alex Lasry, the son of a billionaire hedge-fund manager who is also co-owner of the Milwaukee Bucks basketball team, and Tom Nelson, the top elected official in a county southwest of Green Bay.",
    "At candidate forums, liberal heroes like Sen. Elizabeth Warren of Massachusetts and Sen. Bernie Sanders of Vermont are mentioned by the Wisconsin contenders more frequently than the party's current national leader and White House occupant.",
    "In a state decided by less than 1 percentage point in the 2020 presidential electionthe third-narrowest outcome nationallysix Democrats who have raised the most money so far are all taking positions to the left of President Biden's.",
    "Photo: Ron Page/Associated Press\nHe also tweeted in 2020 that defunding the police only dreams of being as radical as a Donald Trump pardon,? a reference to a progressive rallying cry that has proven politically toxic for Democrats.",
    "That allows plenty of time for potential infighting among those in the Democratic fieldsomething that is already emergingas Mr. Johnson tries to boost his image through paid advertising before he's more directly confronted.",
    "Photo: Brandon Bell/Getty Images\nMr. Lasry supports Medicare for all who want it,? echoing a slogan offered by Transportation Secretary Pete Buttigieg when he campaigned for the 2020 Democratic presidential nomination.",
    "We're talking about being a progressive who can get things done,? said Mr. Lasry, who has worked for Goldman Sachs, former President Barack Obama's White House and the basketball team his father, Marc Lasry, co-owns.",
    "The current top tier of Democrats campaigning for U.S. Senate in Wisconsin includes a lieutenant governor, a state treasurer, a county executive and a former Goldman Sachs analyst who is a billionaire's son.",
    "Mr. Barnes, who worked as a community organizer before being elected to the Wisconsin Assembly in 2012 and to his current post in 2018, might have the most progressive record among the top candidates.",
    "The incumbenta staunch supporter of Mr. Trump who is rated as one of the most vulnerable incumbent senators by the nonpartisan Cook Political Reportannounced Jan. 9 that he is seeking a third term.",
    "It also showcases a geographic reality that requires Democrats to win over large numbers of progressives in the state's two biggest cities, Madison and Milwaukee, to win a statewide nomination.",
    "Republicans are highlighting a photo of him holding a T-shirt printed with abolish ICE,? a slogan popular with those who want to eliminate the U.S. Immigration and Customs Enforcement agency.",
    "Ms. Godlewski, who has been endorsed by Emily's List, the national organization that backs Democratic women supportive of abortion rights, refused to place herself left or right of Mr. Biden.",
    "Ms. Godlewski stopped short of supporting Medicare for All, although she agrees with Mr. Sanders and other progressives that dental, vision and hearing coverage should be added to Medicare.",
    "In 2018, it re-elected Democratic Sen. Tammy Baldwin, the first openly gay person to serve in the Senate and one of the chamber's most liberal members, by almost 11 percentage points.",
    "The less-aggressive proposal, which goes further than what Mr. Biden has supported, would allow Americans to buy into a government plan while preserving private insurance.",
    "Messrs. Barnes and Nelson support Medicare for All, a proposal promoted by progressives and opposed by Mr. Biden that would create a universal federal plan.",
    "While there hasn't yet been any credible public polling on the Wisconsin race, early fundraising suggests there are four top Democratic candidates: Lt. Gov.",
    "The composition of the Wisconsin field, which includes roughly a dozen candidates, reflects the national party's progressive tendencies in recent years.",
    "The incumbent, Republican Sen. Ron Johnson, could benefit from drawing a November opponent too progressive for a state filled with independent voters.",
    "Mr. Barnes, his state's first Black lieutenant governor, declined to distance himself from the slogan when asked about it by an interviewer last year.",
    "Tom Nelson, a county executive in Wisconsin, says many Democrats haven't effectively explained Medicare for All and the Green New Deal to the public.",
    "They also want to see the Senate's 60-vote filibuster rule eliminated, something Mr. Biden recently backed on a limited basis for voting legislation.",
    "In an interview, Mr. Nelson said many Democrats haven't done an effective job of explaining the benefits of Medicare for All or the Green New Deal.",
    "Mandela Barnes recently said he doesn't support defunding the police, although in the past he has declined to distance himself from the slogan.",
    "He'll be campaigning in a national environment favorable for Republicans, while also confronting some of the worst poll ratings of his career.",
    "Both were well behind the top four candidates for totals raised in the most recently available disclosure reports.",
    "Wisconsin, which narrowly backed Mr. Biden, has elected both progressives and conservatives to statewide office.",
    "Write to John McCormick at mccormick.john@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "I don't support defunding the police,? he said in a statement to The Wall Street Journal late last week.",
    "He has also questioned the push to vaccinate people against Covid-19, citing possible safety concerns.",
    "The contest is one of about a half dozen nationally likely to determine control of the Senate.",
    "SHARE YOUR THOUGHTS\nWhat are your predictions for Wisconsin's Democratic Senate primary?",
    "Mr. Johnson has embraced Mr. Trump's false claims of widespread election fraud in 2020.",
    "All of the top four support legalizing marijuana, an idea Mr. Biden hasn't embraced.",
    "He instead gave a shout-out to Ms. Warren, who has endorsed his candidacy.",
    "I have to be a pragmatic, common-sense Democrat,? she said.",
    "They are issues that a lot of folks embrace,? he said.",
    "We need to have universal healthcare,? she said.",
    "The state's primary isn't until Aug. 9.",
    "None could be described as centrists.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Join the conversation below.",
    "Wisconsin Lt. Gov."
  ]
}