{
  "id": 2402,
  "mediaId": 367,
  "date": "d2022-01-23T00:00",
  "headline": "U.S. Sen. Ron Johnson accuses Gov. Tony Evers, Lt. Gov. Mandela Barnes of inciting Kenosha rioters",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/PMJS/a56e8bd5-3e8a-4dde-8000-451ee5e0b211-MCT_US_NEWS_TAXPLAN-COLLINS_2_ZUM.jpg?crop=2999,1687,x1,y682&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/2022/01/23/ron-johnson-accuses-evers-barnes-inciting-kenosha-rioters/6629299001/",
  "sentiment": "-0.894",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    1925,
    2039,
    2145,
    428,
    571,
    2734,
    2793,
    2794,
    2945,
    2964
  ],
  "sentences": [
    "More:Ron Johnson panel on COVID-19 to bring together vaccine skeptics and promoters of unproven early treatments\nMore:Bice: U.S. Sen. Ron Johnson blames LBJ and Great Society for high percentage of out-of-wedlock births\n\"The fact is that the governor called in the National Guard within 11 hours, doubled the Guard's presence every night, and provided immediate support with police officers from surrounding areas and the State Patrol,\" Roecker said in a statement.",
    "Barnes' campaign manager, Kory Kozloski, called Johnson's comments \"ridiculous\" claiming \"they're just another one of his pitiful attempts to distract from the fact that he's wasted his decade in Washington doubling his personal wealth, calling for the outsourcing of American jobs and delivering millions in tax breaks for his megadonors.\"",
    "While Republicans have blamed Democratic leaders for not quickly suppressing the 2020 summer riots that swept through Kenosha after the shooting of a Black man by a white police officer, Johnson's comment escalated the accusation as he claimed that Evers and Barnes spurred on rioters.",
    "In one of his first TV campaign ads, titled \"Stand and Fight,\" Johnson said, \"Democrat policies have been disastrous for America,\" and he talked of \"Kenosha set on fire, a growing number of murders in Milwaukee and the Waukesha Christmas Parade turned into a terrible tragedy.\"",
    "Prior to a Sept. 2020 visit to Kenosha by then-President Donald Trump, Johnson said that instead of working with Trump, Evers and Barnes \"made statements, leapt to conclusions, and have participated in rallies that have done more to incite than calm the situation.\"",
    "Evers campaign spokesman Sam Roecker fired back that Johnson and Wisconsin Republicans \"are spreading pants-on-fire lies about Kenosha and other tragedies to try to score political points and divide our state.\"",
    "It was the first time since announcing his run for reelection that Johnson criticized by name one of his potential Democratic rivals, Barnes, who is running in a crowded U.S. Senate primary.",
    "But it didn't because Governor Evers and Lieutenant Governor Mandela Barnes actually incited the rioters and refused to provide the type of manpower to quell the riots.\"",
    "Evers authorized the deployment of 125 members of the Wisconsin National Guard after the first night of unrest, later increasing troop numbers to 250 and then 500.",
    "Barnes appeared at a rally and march in Kenosha days after the unrest ended and told the crowd \"justice should be guaranteed to everyone in this country.\"",
    "Milwaukee County District Attorney John Chisholm, a Democrat, said the bail recommendation was made in error by a prosecutor under his supervision.",
    "The latter was a reference to a low $1,000 bail recommended in an earlier case involving Waukesha parade suspect Darrell Brooks.",
    "The march was led by the family of Jacob Blake Jr., the man shot by a police officer who responded to a domestic disturbance.",
    "In an interview that aired Sunday on WISN-TV's \"UpFront,\" Johnson said: \"The Kenosha riots should have ended after one night.",
    "As he stepped up his campaign for reelection, Republican U.S. Sen. Ron Johnson charged in an interview that Democratic Gov.",
    "In a video address after the first night of unrest, Evers asked those protesting to \"do so peacefully.\"",
    "Later, in a news release, Evers said: \"We should not tolerate violence against any person.\"",
    "Johnson has previously assailed Evers and Barnes on Kenosha.",
    "Johnson has frequently attacked Democrats on safety issues.",
    "Johnson's statement was labeled as \"false\" by PolitiFact.",
    "Mandela Barnes \"incited\" rioters in Kenosha.",
    "Tony Evers and Lt. Gov."
  ]
}