{
  "id": 2403,
  "mediaId": 195,
  "date": "d2022-01-21T19:57",
  "headline": "These Senate seats are up for election in 2022",
  "image": "https://cdn.jwplayer.com/v2/media/psXKliIE/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/senate/590812-these-senate-seats-are-up-for-election-in-2022",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "Tags John Boozman Mark Kelly Kyrsten Sinema Alex Padilla Richard Blumenthal Marco Rubio Alexandria Ocasio-Cortez Catherine Cortez Masto Chris Van Hollen Mitch McConnell Tammy Duckworth Charles Schumer Abby Finkenauer Raphael Warnock Martha McSally Kelly Loeffler Vicky Hartzler Lisa Murkowski James Lankford Richard Shelby Michael Bennet Chuck Grassley Johnny Isakson Kamala Harris Sherrod Brown Maggie Hassan Patrick Leahy Anthony Fauci Gavin Newsom Kelly Ayotte Brian Schatz Richard Burr Chris Sununu Patty Murray John Kennedy Val Demings Peter Welch Rob Portman Ron Johnson John Hoeven Mark Walker John McCain Larry Hogan Jerry Moran Billy Long Todd Young John Thune Mike Crapo Pat Toomey Mehmet Oz Ron Wyden Mo Brooks Roy Blunt Rand Paul Tim Scott Joe Biden Mike Lee Tim Ryan Ted Budd Dr. Oz Donald Trump Ivanka Trump Alabama Alaska Arizona Arkansas California Colorado Florida Connecticut Election 2022 midterms",
    "The Wisconsin Republican announced his decision in January, writing in an op-ed that while he preferred to retire he decided to wage another bid to fight against Democratic control in Washington and disastrous policies.?\nJohnson is expected to easily secure the GOP nomination though he may face headwinds in the general election, as a number of Democrats are running to flip the seat blue.",
    "While Republicans have yet to unite around a GOP challenger, members of the party think they have a chance of flipping the seat red considering Hassan's poor favorability in the state: An October University of New Hampshire poll found that Hassan has a 33 percent favorable rating among New Hampshire residents, while 51 percent saying they have an unfavorable opinion of her.",
    "The former Patriots player and Army veteran dubbed himself a true conservative who will advance the Trump conservative agenda.? In March, however, before Bequette announced his candidacy, Trump threw his support behind Boozman, despite the fact that the Arkansas Republican did not object to the Electoral College vote for the 2020 presidential election in January 2021.",
    "Trump himself has not yet thrown his support behind a candidate, though many GOP operatives are concerned that a Greitens endorsement could dampen the party's chances of holding the seat  the former governor resigned from office in 2018 amid allegations that he sexually assaulted, took nude photos of and blackmailed his hairdresser.",
    "Trump endorsed Walker in September, calling him a great friend, a Patriot, and an outstanding American who is going to be a GREAT United States Senator.?\nWarnock has made a name for himself during his short time on Capitol Hill, sponsoring more than 25 bills and becoming a vocal advocate for voting rights legislation.",
    "The longtime senator is facing challenges from within his party  former police officer and veteran Mike Little, businessman Scott Trotter and veteran Jeremy Gilbert have all announced bids  though none of the campaigns appear to be formidable enough to knock Crapo from his post in Washington.",
    "A number of Democrats are also running to unseat Lankford, including attorney and former State Department employee Jason Bollinger and Madison Horn, a cybersecurity leader who says she is running as a conservative leader.? The Cook Political Report labels the seat lean Republican.",
    "Candidates both inside and outside the Democratic Party are waging bids against Schumer in an attempt to end his more than two decades in the Senate, but any campaign is unlikely to be successful considering Schumer's high name recognition and large influence in the Empire State.",
    "Democrat Michael J. Steele, an Army veteran, is mounting a campaign against Hoeven, but it does not appear that his campaign has picked up steam in the state: He had $833 cash on hand as of Sept. 30, which is far short of the more than $2.6 million Hoeven had.",
    "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer Josh Mandel, entrepreneur and author JD Vance and former state GOP Chair Jane Timken.",
    "He had roughly $84,000 cash on hand as of Sept. 30, which was more than other GOP candidates  most of whom did not have fundraising information available at the end of the third quarter  but still far less than Duckworth's roughly $5.77 million cash on hand.",
    "A number of Republicans are vying for the GOP nomination to take on Duckworth in November, including financial adviser Bobby Piton, who has reportedly promoted false claims of election fraud in Arizona in connection to the 2020 presidential election.",
    "A number of candidates from all corners of the political spectrum have announced bids against the longtime lawmaker, with the most formidable campaign shaping up to be that of Republican Tiffany Smiley, a veterans advocate and former triage nurse.",
    "On the Democratic side, former North Carolina Supreme Court Justice Cheri Beasley is the favorite to secure the party's nomination, especially after state Sen. Jeff Jackson (D) dropped out of the race and threw his support behind the ex-justice.",
    "Georgia\nWarnock, 52, will appear on Georgia's ballot after previously winning a close special election runoff race in January 2021, when he ousted incumbent Rep. Kelly Loeffler (R) to become the first Black senator to represent the Peach State.",
    "Former President Trump endorsed Tshibaka in June, following through on his vow to unseat Murkowski after she criticized him following the Jan. 6, 2021, attack on the Capitol and voted to convict him at his second impeachment trial.",
    "Johnson has been the target of criticism in recent months for various comments he has made regarding COVID-19, the 2020 election and racial justice protests, remarks that may make him a more vulnerable candidate come November.",
    "Former Utah lawmaker Becky Edwards and political strategist Ally Isom have both launched primary bids against Lee, though early polling suggests that they will have a difficult time taking the nomination from the incumbent.",
    "Head-to-head match-up polls conducted by Redfield & Wilton Strategies in November found that both Budd and McCrory would lead Beasley in a general election among likely voters by two points and one point, respectively.",
    "He immediately received Trump's endorsement, with the former president pointing to the Louisiana Republican's stance on crime, the border, the military, veterans, abortion, energy, the economy and the Second Amendment.",
    "Thune has found himself out of step with Trump at some points over the past year after the South Dakota Republican did not embrace the then-president's effort to overturn the results of the 2020 presidential election.",
    "The Senate Finance Committee chairman is facing a primary challenge from William E. Barlow III, the founder of a visual communications company who has worked at the Oregon Department of Consumer and Business Services.",
    "Arizona Attorney General Mark Brnovich appears to be leading the pack, but Trump has muddied the waters by criticizing the official for not doing more to flip Biden's win in Arizona in the 2020 presidential election.",
    "Former NFL player Jake Bequette announced a primary bid against Boozman in July, suggesting that Arkansas's representation in the upper chamber was in need of a change after years of Boozman's service in Washington.",
    "The race on the right has since morphed into a competitive contest with candidates from every corner of the fractured Republican Party vying for the GOP nomination, but a clear front-runner has not yet emerged.",
    "North Carolina\nBurr, 66, is following through on a pledge he made in 2016 to not seek a fourth term, giving a handful of Democrats and Republicans an opportunity to run for an open seat in the upper chamber.",
    "Since arriving in Washington, Padilla has taken a top role in issues involving immigration, receiving the chairmanship post of the Senate Judiciary Subcommittee on Immigration, Citizenship and Border Safety.",
    "Alaska\nSen. Lisa Murkowski (R)\nMurkowski, 64, is running for a fourth full term after first being appointed to the Senate in 2002 to finish her father Frank Murkowski's term as he went on to become governor.",
    "Hammond Mayor Thomas McDermott Jr. led the Democratic field in fundraising at the end of September with roughly $66,000 cash on hand but still lagged significantly behind Young's $5.6 million cash on hand.",
    "Members of the party are hopeful that the nine-term congressman could flip the Senate seat blue, pointing to the messy primary on the right and Sen. Sherrod Brown's (D-Ohio) victory in the state in 2018.",
    "Retired Army Ranger Sean Parnell shook things up on the Republican side in November when he announced that he was suspending his campaign for Senate after losing a custody battle for his three children.",
    "Days later Rep. Peter Welch (D-Vt.) announced that he was mounting a campaign for the upper chamber, news that came as little surprise since the congressman was largely viewed as a successor to Leahy.",
    "Some Republicans have launched bids to take on Blumenthal, though no candidate has raised substantial funds to run a formidable campaign against the two-term senator, as noted by the Hartford Courant.",
    "The Cook Political Report rates the seat lean Republican, likely a credit to Rubio's strong connections in South Florida and ties to the Cuban American community, which typically tilts toward the GOP.",
    "An internal poll released by the Barnes campaign in January shows the lieutenant governor leading the Democratic pack, though just short of a third of respondents said they are still undecided.",
    "Oz and Sands have leaned into Trump's rhetoric, criticizing mask and vaccine mandates and coronavirus-related school and business closures, while Bartos has emphasized his business experience.",
    "The longtime senator, however, will likely face a tough race against former Rep. Abby Finkenauer (D), who is currently running for her party's nomination against a handful of other Democrats.",
    "A number of Republicans are running for their party's nomination to take on Warnock in November, including state Agriculture Commissioner Gary Black and former football star Herschel Walker.",
    "Olympian and former El Paso County Republican official Eli Bremer had the most total reported funds raised and cash on hand out of all the primary candidates, according to Colorado Politics.",
    "No clear frontrunner has emerged on either side of the political aisle, leaving onlookers keenly focused on the election, which could determine the balance of the upper chamber in November.",
    "Two Democrats are currently vying for the party's nomination to take on Kennedy in November: Baton Rouge community activist Gary Chambers Jr. and former U.S. Navy fighter pilot Luke Mixon.",
    "Pennsylvania\nToomey, 60, announced in October 2020 that he would not seek a third term, setting the scene for a true toss up race in a state that President Biden narrowly flipped in 2020.",
    "While the Cook Political Report rates Van Hollen's seat solid Democrat, recent internal polling from an outside group showed Hogan leading Van Hollen by 12 points in a head-to-head race.",
    "A Deseret News/Hinckley Institute of Politics poll conducted in October found that Lee had 53 percent support, with Edwards following at seven percent and Isom trailing with two percent.",
    "He has been serving in the upper chamber since 2012, after being appointed to replace former Sen. Jim DeMint (R-S.C.), who left Congress to become president of the Heritage Foundation.",
    "Early that month she told VTDigger that she was not ready to make a formal decision or announce a potential candidacy, but she has filed paperwork with the Federal Election Commission.",
    "He is facing challenges from every political direction, including a bid from CIA veteran and former third-party presidential candidate Evan McMullin, who is running as an Independent.",
    "Trump endorsed Moran in February after the Kansas Republican voted to acquit the then-president in his second impeachment trial following the Jan. 6, 2021, attack on the Capitol.",
    "Former Rep. Mark Walker (R-N.C.), another GOP candidate for Senate, is reportedly considering running for the lower chamber instead, which could shake up the Republican primary.",
    "Rep. Val Demings (D) rolled out her Senate campaign in June and has already proven to be a formidable candidate, outraising Rubio in the third quarter with an $8.4 million haul.",
    "Missouri\nBlunt, 72, announced in March that he will not seek a third term, opening the field to a number of Democrats and Republicans vying to replace him in the upper chamber.",
    "Crapo had more than $5.3 million cash on hand at the end of September, according to OpenSecrets, while the organization said it did not have data for the three GOP challengers.",
    "A poll by the Oklahoma City firm Amber Integrated released in December found that Lankford has a strong lead over his primary opponents, months ahead of the November election.",
    "Ohio\nPortman, 66, announced in January 2021 that he would not seek a third term, igniting a fierce competition on the right with pro-Trump candidates vying for the open seat.",
    "A Missouri Scout poll published earlier this month found that Greitens has a lead among his GOP opponents, but more than a third of those polled said they remain undecided.",
    "Wisconsin\nJohnson, 66, is running for a third term, breaking a promise he made during his 2016 campaign that he would only seek two six-year stretches in the upper chamber.",
    "Three Democrats are running to unseat Scott in November: state Rep. Krystle Matthews, local Democratic Party Chairwoman Angela Geter and activist Catherine Fleming Bruce.",
    "Gavin Newsom (D) appointed him to the upper chamber after then-Sen. Kamala Harris (D-Calif.) became vice president-elect, making him California's first Hispanic senator.",
    "According to fundraising numbers, business owner Darin Harbick appears to be leading the pack on the right: he had more cash on hand than his opponents as of Sept. 30.",
    "Rep. Alexandria Ocasio-Cortez had been rumored as a potential challenger to Schumer from the left, though the progressive Democrat has not announced such an endeavor.",
    "Since then, celebrity doctor Mehmet Oz  best known for hosting The Dr. Oz Show?  and former hedge fund executive David McCormick have launched bids for the open seat.",
    "Nevada\nCortez Masto, 57, is running to secure a second term, a bid that is already shaping up to be a fierce race between the Democrat and a Trump-backed Republican.",
    "A December McLaughlin & Associates poll found that Brooks had 31.4 percent support among likely voters, followed by Britt at 26.2 percent and Durant at 16.6 percent.",
    "Hogan has said serving in the Senate is not something I aspire to,? but GOP heavyweights are lobbying the governor behind the scenes to move into national politics.",
    "Grassley is also facing a primary challenge by state Sen. Jim Carlin (R), who launched his candidacy in February before Grassley had made a decision on reelection.",
    "The victor of the GOP primary will take on Kelly, one of the Senate's most prolific fundraisers, in what is expected to be a closely watched election this cycle.",
    "When asked about primarying Schumer in a future race Ocasio-Cortez did not rule it out, instead suggesting that she prefers to focus on her career in real time.",
    "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson have all announced primary bids.",
    "On the Democratic side at least six candidates have announced bids for Blunt's post, including former state Sen. Scott Sifton and Marine veteran Lucas Kunce.",
    "A handful of pro-Trump Republicans are running to succeed Blunt, including Attorney General Eric Schmitt, Reps. Vicky Hartzler and Billy Long and former Gov.",
    "Fifteen Republicans and 13 Democrats are on the ballot this year, while six other seats remain open after senators announced they are not seeking reelection.",
    "Tshibaka raised $1.2 million and had more than $294,000 cash in hand at the end of September, while Murkowski's campaign reported $3.2 million cash on hand.",
    "Thune announced in January that he would seek an additional term in the Senate, saying he is uniquely positioned? to deliver for the Mount Rushmore State.",
    "Smiley has more than $1.52 million cash on hand, which is far less than Murray's roughly $5.89 million but more than her other opponents as of Sept. 30.",
    "Additionally, the former president attended a fundraiser with venture capitalist Blake Masters in November, who is also running for the GOP nomination.",
    "Paul has made headlines over the past year for repeatedly clashing with White House chief medical adviser Anthony Fauci during congressional hearings.",
    "Iowa\nGrassley, 88, announced in September that he will seek an eighth term amid a GOP pressure campaign urging him to throw his hat in the ring again.",
    "Republicans see his reelection campaign as a way to hold the coveted Senate seat in a year that the party is looking to take control of the chamber.",
    "Chris Sununu (R) passed on a bid for the Senate in November despite heavyweights in the party pointing to him as their best chance to flip the seat.",
    "Businessman Bernie Moreno and Mike Gibbons, an investment banker who co-chaired Trump's Ohio fundraising in 2016, are also vying for the nomination.",
    "A number of Democrats are also running to unseat Lee, including Kael Weston, a former candidate for U.S. House and an ex-State Department official.",
    "Trump endorsed Parnell in September, and it remains unknown if he will pick a new horse in the race following the retired Army Ranger's withdrawal.",
    "Christina Nolan, former U.S. attorney for Vermont, revealed in January that she is exploring a Republican campaign to replace Leahy in the Senate.",
    "Brooks, who secured Trump's endorsement in April, emerged as an early leader, though his margin has since waned as Britt ramps up her campaign.",
    "Arizona\nKelly, 57, will face the ballot less than two years after Arizonans first sent him to represent the Grand Canyon State in the Senate.",
    "The election is already shaping up to be a fierce battle on the Republican side, where Trump-endorsed Rep. Ted Budd (R-N.C.) and former Gov.",
    "On the other side of the political aisle, Democrats appear to be coalescing around Rep. Tim Ryan as he looks to jump to the upper chamber.",
    "He is seen as a potential successor to McConnell, though the Senate minority leader has not publicly indicated any plans of retiring soon.",
    "At least three Republicans are challenging Thune for the GOP nomination, but none are expected to make a splash against the minority whip.",
    "Former Nevada Attorney General Adam Laxalt is the likely favorite among GOP voters to take on Cortez Masto in November's general election.",
    "A November poll from Redfield & Wilton Strategies found that Warnock has a 6-point lead on Walker among both registered and likely voters.",
    "Entrepreneur Scott Cleveland is also vying to represent the Gem State in the Senate as an Independent who would caucus with Republicans.",
    "He officially filed for reelection in January and will now face off against Valerie Fredrick and Tami Stainfield for the GOP nomination.",
    "Their chances of clinching the seat, however, remain slim in the red state  the Cook Political Report says the seat is solid Republican.",
    "The race, however, could proceed differently if a Republican like Greitens secures Trump's endorsement and skates to the GOP nomination.",
    "Demings, however, first has to best a field of Democrats vying for the nomination, though she has quickly emerged as an early favorite.",
    "The race, however, has largely come down to Rep. Mo Brooks (R) and Katie Boyd Britt, who previously served as Shelby's chief of staff.",
    "A handful of candidates are waging primary bids against Lankford, including state Sen. Nathan Dahm and Tulsa pastor Jackson Lahmeyer.",
    "The South Carolina junior senator and the only Black Republican serving in the upper chamber is favored to win reelection this year.",
    "A December survey conducted by the National Republican Senatorial Committee, however, had Walker up by 1 point among likely voters.",
    "Kennedy, however, is likely to secure reelection to the upper chamber as the Cook Political Report rates his seat solid Republican.",
    "Trump also threw his support behind Rubio, quelling speculation that his daughter Ivanka Trump may run for the Sunshine State seat.",
    "A number of senators are up for reelection this November in what is expected to be a competitive slate of races across the country.",
    "All eyes will be on the Senate as both parties look to tip the balance of power in the upper chamber from its current 50-50 split.",
    "While a handful of Democrats and Republicans have already announced primary bids for the seat, eyes remain fixed on Maryland Gov.",
    "The trial lawyer and Army veteran has knocked Grassley for his vote in favor of the $1.2 trillion bipartisan infrastructure bill.",
    "John Fetterman, Rep. Conor Lamb Montgomery County Board of Commissioners Chairwoman Val Arkoosh and state Rep. Malcolm Kenyatta.",
    "Florida\nRubio, 50, is running for a third term in what is already shaping up to be a fierce race between two big-name lawmakers.",
    "Businessman Peter Lumaj, landscaper Robert Hyde and former portfolio manager John Flynn are all running for the GOP nomination.",
    "The filing deadline for the Maryland Senate seat is Feb. 22, and Hogan has not yet said if he will throw his hat into the ring.",
    "He also has the experience of both winning and losing in statewide elections, having fallen short in his 2018 bid for governor.",
    "What comes next, however, remains to be seen, as early polling suggests a tight race between Beasley and both Budd and McCrory.",
    "More than a half a dozen Democrats are vying for their party's nomination to replace Toomey in the Senate, including Lt. Gov.",
    "Thirty-two percent of respondents, however, said they did now know who they would support if the primary were held that day.",
    "Former Sen. Kelly Ayotte (R-N.H.), who some saw as a formidable opponent to Hassan, said in November that she will not run.",
    "A Trafalgar poll conducted in December found that Mandel has a six-point lead on Vance, followed by Gibbons then Timken.",
    "The senator has knocked the top health official for matters involving masks, herd immunity and the origins of COVID-19.",
    "Bennet, however, will likely secure a third term in November, as Cook Political Report rates the seat solid Democrat.",
    "He is facing two challenges within the party, from fund accountant Danny Niederberger and business owner John Piper.",
    "Mike Durant, a former Black Hawk pilot who was shot down in Somalia in 1993, is also running for the GOP nomination.",
    "Senators not running for reelection\nAlabama\nShelby, 87, announced in February that he would not seek a seventh term.",
    "She lost the GOP nomination for reelection in 2010 but went on to win the general election as a write-in candidate.",
    "He appears to be the only candidate running to represent the Aloha State in the upper chamber this November.",
    "Here is a list of which senators are facing reelection in November, as well as which Senate seats are open.",
    "Kelly ousted former Rep. Martha McSally (R-Ariz.), who was appointed to the seat following McCain's death.",
    "The primary winner will then face off against one of four Democrats vying to become the party's candidate.",
    "Laxalt already has the support of the former president and Senate Minority Leader Mitch McConnell (R-Ky.).",
    "Lankford raked in 56 percent support, followed by Dahm with nine percent and Lahmeyer with eight percent.",
    "A Data for Progress poll conducted in December found that Grassley has a 14-point lead over Finkenauer.",
    "A handful of Republicans are currently vying for the GOP nomination to take on the senator in November.",
    "Former Alaska Commissioner of Administration Kelly Tshibaka is waging a primary bid against Murkowski.",
    "While McMullin did not secure Utah's electoral votes in 2016, he did rake in 21.3 percent of the vote.",
    "It remains to be seen, however, which Republican will emerge as the front-runner to take on Hassan.",
    "South Carolina\nScott, 56, is running for his second full term as U.S. senator from South Carolina.",
    "Paul far outraised Booker in the third quarter, surpassing the Democrat by at least $2.3 million.",
    "Loeffler was appointed to the post following the resignation of the late Sen. Johnny Isakson (R).",
    "Former Brighton Mayor Brandaun Dean appears to be the only Democrat looking to succeed Shelby.",
    "The former California secretary of state is expected to win a full six-year term in November.",
    "At least one Republican, Timothy Swain, appears to be waging a primary bid against Scott.",
    "Idaho\nCrapo, 70, is seeking a fifth term after first being elected to the post in 1998.",
    "Ambassador to Denmark Carla Sands are also vying for the GOP nomination, among others.",
    "A November St. Pete Polls survey found that Rubio has a 7-point lead ahead of Demings.",
    "Larry Hogan (R), whose name has been floated as a potential challenger to Van Hollen.",
    "Navy veteran and college professor Brian Bengs is waging a Democratic run for Senate.",
    "Those surveys, however, were put in the field before Jackson dropped out of the race.",
    "South Dakota\nThune, 61, the Senate minority whip, is running to secure a third term.",
    "Roughly half a dozen Republicans are vying for the GOP nomination to take on Kelly.",
    "The election was scheduled following the death of Sen. John McCain (R-Ariz.).",
    "Lankford has also significantly more cash on hand compared to both opponents.",
    "The winner will likely take on former Kentucky state Rep. Charles Booker (D).",
    "Vermont\nLeahy, 81, announced in November that he would not seek a ninth term.",
    "His name has also been tossed around as a potential presidential candidate.",
    "New York\nSchumer, 71, the Senate majority leader, is seeking a fifth term.",
    "Louisiana\nKennedy, 70, announced in June that he would seek a second term.",
    "Brown is currently the only elected Democrat serving in statewide office.",
    "The Cook Political Report, however, says Leahy's seat is solid Democrat.",
    "A Murkowski has represented the Last Frontier in the Senate since 1981.",
    "Nearly 22 percent of respondents, however, said they remain undecided.",
    "The Cook Political Report, however, says the seat is solid Republican.",
    "The Cook Political Report rates the Iowa Senate seat solid Republican.",
    "The Cook Political Report, however, says the seat is lean Republican.",
    "The Cook Political Report, however, rates the seat as solid Democrat.",
    "This will not be the first time Murkowski faces a primary challenge.",
    "The Cook Political Report, however, rates the seat solid Republican.",
    "For the meantime, however, he plans to stay put in the Senate race.",
    "Schumer won reelection with roughly 70 percent of the vote in 2016.",
    "A number of Republicans are also hoping to oust Wyden in November.",
    "The Cook Political Report currently says the race is a toss-up.",
    "The Cook Political Report says the race is currently a toss-up.",
    "Piton appears to be leading the pack in terms of fundraising.",
    "The Cook Political Report rates Paul's seat solid Republican.",
    "The Cook Political Report rates Todd's seat solid Republican.",
    "The Cook Political Report says the seat is solid Republican.",
    "Oklahoma\nLankford, 53, is running for his second full term.",
    "North Dakota\nHoeven, 64, is running to secure a third term.",
    "The Cook Political Report rates the seat solid Republican.",
    "The Cook Political Report rates the seat is lean Democrat.",
    "He previously said he would primary Grassley if necessary.",
    "The Cook Political Report says the seat is solid Democrat.",
    "The Cook Political Report says the seat is solid Democrat.",
    "California\nPadilla, 48, is vying for his first full term.",
    "Cook Political Report says the seat is solid Republican.",
    "The Cook Political Report rates the seat solid Democrat.",
    "Hawaii\nSchatz, 49, is running for his second full term.",
    "Illinois\nDuckworth, 53, is running for her second term.",
    "New Hampshire\nHassan, 63, is running for a second term.",
    "Maryland\nVan Hollen, 63, is running for a second term.",
    "Connecticut\nBlumenthal, 75, is vying for a third term.",
    "The Cook Political Report says the race is a toss-up.",
    "Oregon\nWyden, 72, is running for his fifth full term.",
    "The Cook Political Report says the race is a toss-up.",
    "The Cook Political Report says the race is a toss up.",
    "Washington\nMurray, 71, is vying for her sixth term.",
    "Colorado\nBennet, 57, is running for his third term.",
    "Arkansas\nBoozman, 71, is running for a third term.",
    "Kentucky\nPaul, 59, is running for his third term.",
    "Cook Political Report says the race is a toss up.",
    "He is Vermont's sole lawmaker in the U.S. House.",
    "Indiana\nYoung, 49, is running for a second term.",
    "Kansas\nMoran, 67, is running for a third term.",
    "Utah\nLee, 50, is running for a third term.",
    "Pat McCrory remain locked in a tight race.",
    "Businessman Jeff Bartos and former U.S.",
    "Trump endorsed Grassley in October.",
    "Trump endorsed him in March.",
    "Updated at 3:09 p.m.",
    "California Gov.",
    "Eric Greitens.",
    "Lt. Gov.",
    "Gov."
  ]
}