{
  "id": 2408,
  "mediaId": 195,
  "date": "1/19/2022 12:00:00 AM",
  "headline": "Barnes raises over $1 million in final quarter of 2021",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/article_images/mandelabarnes.jpeg?itok=tJiXIlWv",
  "link": "https://thehill.com/homenews/campaign/590279-barnes-raises-over-1-million-in-final-quarter-of-2021",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "Less than 6 months into his campaign, there's no question that Mandela Barnes has built the largest grassroots coalition and is poised to defeat Ron Johnson once and for all,? said Barnes' campaign manager Kory Kozloski.",
    "News of the fourth quarter fundraiser numbers comes after the campaign said last week that it raked in nearly $150,000 in the three days after incumbent Sen. Ron Johnson (R-Wis.) announced his reelection bid.",
    "Wisconsin Treasurer Sarah Godlewski and Milwaukee Bucks executive Alex Lasry also raised more than $1 million during the time period, but each donated large sums of money to their campaigns.",
    "Barnes is a part of a crowded Democratic Senate primary that includes state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson.",
    "The average donation was roughly $43 and the haul was comprised of 27,252 individual donations from 17,830 total donors, according to the campaign.",
    "Mandela Barnes (D) announced on Wednesday that his Senate campaign raked in over $1.23 million during the final quarter of 2021.",
    "Barnes appears to be the first candidate to announce his fourth-quarter fundraising numbers ahead of the deadline.",
    "Last week, the Democratic Senate Majority PAC rolled out a $1 million ad buy against Johnson.",
    "Barnes' campaign said it has not taken any money from political action committees.",
    "The state's Senate race is on track to be one of the most expensive of the cycle.",
    "The latest numbers put Barnes' fundraising total so far at $2.3 million.",
    "The non-partisan Cook Political Report rates the race as a \"toss-up.\"",
    "Barnes raised $1.1 million between July 1 and Sept. 30.",
    "Outside groups are also cashing in on the contest.",
    "Wisconsin Lt. Gov."
  ]
}