{
  "id": 2417,
  "mediaId": 238,
  "date": "d2022-01-11T00:00",
  "headline": "Opinion: These maps show where Democrats are losing ground in the fight for Senate control",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/01/12/senate-democratic-control-senate-maps-analysis/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    886,
    1136,
    1253,
    1469,
    1486,
    2039,
    2087,
    146,
    571,
    2953
  ],
  "sentences": [
    "In late 2021, only 32 percent of registered Pennsylvania voters said Biden was doing an excellent? or good? job  a 12-point slide since June  and 47 percent said he's doing a poor job.? Any of these Republicans could make this race close  or win it  by tying Fetterman or Lamb to Biden.",
    "Charlie Sykes, the Milwaukee-based anti-Trump conservative editor, put it bluntly: Mandela Barnes is the way to keep that seat Republican.?\nRepublican Sen. Patrick J. Toomey is retiring in Pennsylvania and neither party has a clear edge  or an easy path  in the race to succeed him.",
    "Johnson's announcement certainly communicates strength: Despite making false and potentially damaging comments on coronavirus vaccines and the Jan. 6 insurrection (and previously pledging to serve only two terms), he believes he has earned a third term.",
    "Jeff Jackson, her last remaining opponent, left the race saying that Republicans Pat McCrory and Ted Budd are gearing up to spend millions of dollars attacking each other in order to be the Republican nominee.",
    "The GOP primary is unsettled  Secretary of State Mark Brnovich leads a field that includes retired Maj. Gen. Mick McGuire, businessman Blake Masters and former state representative Justin Olson.",
    "Democratic Sen. Raphael G. Warnock  who has held the seat for only a year  will face off against former National Football League star and University of Georgia running back Herschel Walker.",
    "Stacey Abrams is running for governor again, which will attract nationwide interest and money to the state at all levels, and her campaign may increase Democratic turnout.",
    "North Carolina Democrats often get excited about a candidate early in an election year, only to watch the GOP candidate use national issues to rev up the base and win.",
    "Other candidates include former ambassador to Denmark Carla Sands, businessman Jeff Bartos and hedge fund manager David McCormick (who'll likely enter the race soon).",
    "Even if Republicans win by a wide margin in the House, just one or two eccentric GOP candidates could sabotage Republican hopes of taking back the Senate.",
    "John Fetterman, a progressive dedicated to working-class voters, and Rep. Conor Lamb, a centrist who represents Pittsburgh's suburbs, lead the pack.",
    "Adam has my Complete and Total Endorsement!?\nNevada is home to many Latinos and suburbanites  voters with whom Republicans gained ground in 2020.",
    "First, Georgia, like Virginia, is home to many college-educated suburbanites who began voting for Democrats only after Trump took over the GOP.",
    "President Biden's approval rating  which was above 50 percent for much of 2021  is now at 43 percent among likely and registered voters.",
    "If Walker seems a little more palatable than Trump to such voters  or makes even a little progress with Black voters  he too could win.",
    "On Sunday, Republican Sen. Ron Johnson  who has been publicly uncertain about his reelection bid  announced that he would run again.",
    "In Virginia, many of these voters returned to the GOP fold after Trump left office and as Youngkin struck a kinder, gentler tone.",
    "Trump lost Arizona by less than a percentage point in 2020, and Biden's approval rating has dropped to 42 percent in the state.",
    "And that may happen again: In the fall, 55 percent of North Carolinians said they disapproved of Joe Biden's job performance.",
    "Days after Laxalt announced his run, Trump said, He fought valiantly against the Election Fraud, which took place in Nevada.",
    "A naval aviator and space shuttle pilot, he starts with impeccable credentials in this newly purple, highly suburban state.",
    "Democrats struggled in the 2021 gubernatorial elections, with Republican Glenn Youngkin taking Virginia and Democratic Gov.",
    "If Laxalt improves on Trump's statewide showing by a small margin, he could unseat Democratic Sen. Catherine Cortez Masto.",
    "Both parties were looking at roughly three vulnerable seats, and it was unclear how each of those races would shake out.",
    "But, Republicans nearly won the governorship in New Jersey  a state that voted for Biden by 16 points a year before.",
    "In Wisconsin, where politics has resembled a blood sport for the past decade, Johnson has thrown down the gauntlet.",
    "She's won statewide office before and was the first Black woman to become the state Supreme Court's chief justice.",
    "If Democrats lose even a little ground in the Phoenix suburbs, a Trump acolyte like Brnovich could take the seat.",
    "These developments  as well as other state-level events  have shifted the landscape of the 2022 Senate elections.",
    "Democrats have a stronger field but may struggle to win the state in the second year of the Biden administration.",
    "On the Republican side: Trump's preferred candidate, Sean Parnell, dropped out because of a child custody battle.",
    "Additionally, Warnock's opponent is a political newcomer with baggage (such as allegations of spousal abuse).",
    "Chris Sununu, once their best prospect, is seeking another term in Concord rather than running for Senate.",
    "Mehmet Oz, a popular TV host who promotes unscientific medical treatments, entered the race soon after.",
    "The bottom line in GOP-held seats: Republicans could successfully defend all their seats in 2022.",
    "Second, Warnock has done little to separate himself from Biden, who visited the state on Tuesday.",
    "According to FiveThirtyEight's tracker, Warnock supported Biden's agenda on 97 percent of votes.",
    "Cheri Beasley, a former chief justice of the state Supreme Court, cleared the field in December.",
    "Mandela Barnes, a former supporter of Bernie Sanders who may be too progressive for the state.",
    "Laxalt is a former state attorney general and part of a long-serving Nevada political family.",
    "If we're going to flip this seat, we can't do that.?\nDemocrats are optimistic about Beasley.",
    "Like Warnock, Democratic Sen. Mark Kelly will be running again after only a year in office.",
    "All of these candidates have adopted Trump's positions on such key issues as the border.",
    "In North Carolina, Democrats have one advantage: They've already settled on a candidate.",
    "And while Colorado might become competitive in a wave election, for now it is a stretch.",
    "If that happens, they only need to take one  out of three  vulnerable Democratic seats.",
    "Biden won the state by 14 points, Republicans still need to find a credible candidate.",
    "In the summer of 2021, the race for control of the U.S. Senate looked like a toss-up.",
    "He is strong on Secure Borders and defending America against the Radical Left.",
    "New Hampshire is one of the few states where Republicans can't buy good news.",
    "Republicans have gained a very small edge in the race for Senate control.",
    "Biden's approval rating in Wisconsin was a meager 43 percent in the fall.",
    "What looked like a strong Republican opportunity is now far less certain.",
    "The party that wins the House isn't guaranteed to win the upper chamber.",
    "But Republicans voters are unsure who to pick: Half are still undecided.",
    "She's also a good fundraiser who could turn out the progressive base.",
    "But over the last eight months, the GOP's position has improved.",
    "An upset in Colorado seems unlikely, but it's not impossible.",
    "Control of the Senate will be decided in less than a year.",
    "In both races, Democrats lost suburban voters to the GOP.",
    "Progressive state Rep. Malcolm Kenyatta is also running.",
    "If Biden remains unpopular, it could drag Warnock down.",
    "Since then, Democrats have lost ground politically.",
    "Phil Murphy only narrowly winning in New Jersey.",
    "But a strong Democratic field may not be enough.",
    "And Democrats seem keen on nominating Lt. Gov.",
    "Johnson's timing works to the GOP's advantage.",
    "A state-by-state analysis shows why.",
    "And he's a close Trump ally.",
    "Warnock has some advantages.",
    "But that may not be enough.",
    "Lt. Gov.",
    "Gov."
  ]
}