{
  "id": 2427,
  "mediaId": 323,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "Ron Johnson, Republican Senator, to Seek Third Term in Wisconsin",
  "image": "https://images.wsj.net/im-464478?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/ron-johnson-republican-senator-to-seek-third-term-in-wisconsin-11641737583",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormick",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "PREVIEW\nSUBSCRIBE\nThe state saw some of the first television advertisements of the 2022 campaign cycle nearly a year ago when the Democratic Party of Wisconsin launched more than $100,000 in spots critical of Mr. Johnson, who has questioned the existence of climate change, Mr. Biden's 2020 victory and whether the Jan. 6 riot at the Capitol amounted to an armed insurrection.",
    "In 2022, Wisconsinites will hold Ron Johnson accountable and elect another Democratic senator who will put the interests of our state's working families first.?\nThe nonpartisan Cook Political Report rates the Wisconsin contest as one of three tossups among seats currently held by the GOP, along with North Carolina and Pennsylvania.",
    "Nor did we anticipate the pandemic, the government's failed response to it, the loss of freedom that has resulted, and the tyrannical approach taken by the elites who have created and maintained a state of fear that allows them to exercise control over Americans' lives,? he wrote.",
    "Much as I'd like to ease into a quiet retirement, I don't feel I should.?\nMr. Johnson, a former businessman who has also questioned the push to vaccinate as many people as possible against Covid-19, pointed to the pandemic as a rationale for his re-election bid.",
    "Mandela Barnes and State Treasurer Sarah Godlewski, as well as Alex Lasry, the son of a billionaire hedge-fund manager who is also co-owner of the Milwaukee Bucks basketball team, and Tom Nelson, the top elected official in a county southwest of Green Bay.",
    "In January 2021, he was among 11 current and incoming GOP senators who said they would vote to reject the Electoral College count of some states unless Congress appointed a commission to conduct an emergency, 10-day audit of the election results.",
    "Mr. Johnson's political career began in 2009 at roughly the same time as the emergence of the antiestablishment tea party movement that challenged government spending, regulations, taxes and the Affordable Care Act that became law in 2010.",
    "Their path, paved with false hope and greater dependency, always leads to tyranny.?\nThe decision by Mr. Johnson, who once pledged to retire after two terms, comes as the GOP seeks to win control of the Senate, currently split 50-50.",
    "Many of the races aren't expected to be competitive, but open seats in North Carolina and Pennsylvania are already receiving considerable attention and Wisconsin promises to be a tight contest.",
    "Mr. Johnson has been looking out for himself at the expense of Wisconsinites and failing to do the job he was elected to do,? Democratic Party of Wisconsin Chair Ben Wikler said in a statement.",
    "In 2018, it re-elected Democratic Sen. Tammy Baldwin, one of the chamber's most liberal members, by almost 11 percentage points, while also only barely voting conservative Republican Gov.",
    "Republican Sen. Ron Johnson of Wisconsin, a strong supporter of former President Donald Trump, said he would seek a third term in one of the nation's most politically competitive states.",
    "Mr. Biden won Wisconsin in 2020 by six-tenths of a percentage point, the third-narrowest outcome nationwide and the latest example of the state's long tradition of hard-fought races.",
    "The party in control of the White House traditionally loses seats in midterm elections, voters are feeling squeezed by inflation, and President Biden's popularity has sagged.",
    "A Marquette Law School Poll of registered voters in late October showed 38% said they would vote to re-elect Mr. Johnson, while 52% said they would support someone else.",
    "Since entering the Senate, Mr. Johnson has embraced the outsider's mantle and has tried to establish himself as a leading voice for fiscal restraint.",
    "Republicans are optimistic about their prospects of retaking the House, while facing a tougher fight in their efforts to take control of the Senate.",
    "Mr. Thune drew the wrath of Mr. Trump for pushing back on the former president's false claims that the election had been stolen from him.",
    "He is seen as a leading contender to succeed Senate Minority Leader Mitch McConnell (R., Ky.), should Mr. McConnell leave the chamber.",
    "Close to a dozen Democrats are jockeying ahead of an August primary to win the right to challenge Mr. Johnson in the general election.",
    "With a significant number of swing voters, Wisconsin has elected both progressives and conservatives to statewide office.",
    "The move means Republicans won't have to scramble to find another candidate ahead of the party primary this summer.",
    "Newsletter Sign-up\n Capital Journal\n Scoops, analysis and insights driving Washington from the WSJ's D.C. bureau.",
    "Write to John McCormick at mccormick.john@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Mr. Johnson won his seat in 2010 by defeating former Democratic Sen. Russ Feingold, a three-term incumbent.",
    "Mr. Johnson, 66 years old, made the announcement in an opinion column published in The Wall Street Journal.",
    "Like Mr. Trump, Mr. Johnson has spread false assertions that there was widespread election fraud in 2020.",
    "Mr. Biden narrowly won Wisconsin and Pennsylvania, while Mr. Trump eked out a victory in North Carolina.",
    "Mr. Johnson faces an uphill battle with voters, as state polling shows his approval rating underwater.",
    "Mr. Johnson's announcement follows a similar one Saturday by Sen. John Thune of South Dakota, the No.",
    "Mr. Johnson won a rematch between the two men six years later, although his 2016 margin was narrower.",
    "We face powerful forces that desire even more power and control over our lives,? he wrote.",
    "Democrats are defending 14 Senate seats this year, compared with 20 for the GOP.",
    "At the same time, the current political environment is perilous for Democrats.",
    "In the wake of the Jan. 6 riot, Mr. Johnson declined to challenge the count.",
    "Based on early fundraising, the top four Democrats in the race are Lt. Gov.",
    "Slightly more had an unfavorable than favorable view of him, 42% to 36%.",
    "I believe America is in peril,? Mr. Johnson wrote.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Scott Walker out of office.",
    "2 Senate Republican."
  ]
}