{
  "id": 2432,
  "mediaId": 124,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "GOP Sen. Ron Johnson announces bid for third term in Wisconsin",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_01/3491771/210716-ron-johnson-mb-1814.jpg",
  "link": "https://www.nbcnews.com/politics/congress/gop-sen-ron-johnson-announces-bid-third-term-wisconsin-n1287213",
  "sentiment": "0.0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1568,
    2039
  ],
  "sentences": [
    "\"In order for my campaign to succeed, I will need the support of every Wisconsinite who values the truth and refuses to allow lies and distortions to prevail.?\nJohnson's decision spares Republicans a wide-open primary battle as well as the prospect of having to run an untested candidate in a state they can't afford to lose this year, as they fight for control of the Senate.",
    "He promised to stand up for working families, but instead opposed critical economic relief for families and small businesses, while helping to write the law that gives millions in tax breaks to the ultra-wealthy.?\nKevin Nicholson, a Marine veteran who lost a GOP Senate primary in 2018, has said he would run for governor if Johnson decided to seek reelection.",
    "He described last year's deadly riot by Trump supporters at the Capitol as by and large peaceful protest.?\nJohnson, 66, previously said that he would only serve two terms, but has since eased off on that position, spending much of last year expressing ambivalence about another run.",
    "Before his announcement, Wisconsin state GOP leaders were starting to worry aloud about their chances with a different candidate, as those interested in his seat waited for Johnson to make up his mind.",
    "Number one, you need people who know where the bodies are buried, they know how to use a gavel, they know how to fight for people.?\nEven with the incumbent on the ballot, Wisconsin is still in play.",
    "\"The only people cheering Johnson's decision are the wealthy special interests and big donors who have made a killing during his time in Washington,? Barnes said in a campaign statement Friday.",
    "Sen. Ron Johnson, R-Wis., said Sunday that he has decided to seek a third term, setting up a bitter clash with Democrats in what is expected to be one of the hardest-fought races of 2022.",
    "But good Lord, we need Ron Johnson to run again for a couple of reasons,? former Rep. Sean Duffy, R-Wis., said during an interview last week on Milwaukee radio station WISN.",
    "It's also a boost for former President Donald Trump, who last April endorsed and encouraged Johnson, one of his most ardent defenders, to run again.",
    "Mandela Barnes, another Democratic candidate, also weighed in as word trickled out last week that Johnson was about to confirm his re-election bid.",
    "Having already experienced a growing level of vitriol and false attacks, I certainly don't expect better treatment in the future,\" Johnson added.",
    "\"Today, I am announcing I will continue to fight for freedom in the public realm by running for re-election,\" he said in a campaign statement.",
    "And in the crowded Democratic primary, candidates have been running for months on the assumption that Johnson would be their opponent.",
    "Let's hold him to his promise of serving two terms,? contender Tom Nelson, county executive for Outagamie, tweeted last week.",
    "Johnson is known for advancing right-wing conspiracy theories and debunked claims about the 2020 election.",
    "Nicholson would face Rebecca Kleefisch, a former lieutenant governor, in the Republican primary.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "I think a transition for people in government is a good thing.",
    "\"It is not a decision I have made lightly.",
    "Lt. Gov."
  ]
}