{
  "id": 2440,
  "mediaId": 367,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "U.S. Sen. Ron Johnson poised to announce run for a third term as early as next week, according to sources",
  "image": "https://www.gannett-cdn.com/presto/2021/10/31/PMJS/f7d6b38e-3112-4ad8-8bf6-018d26c18241-MJS_Johnson_3.jpg?width=1320&height=1216&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/2022/01/07/wisconsin-u-s-sen-ron-johnson-set-announce-run-third-term/9134003002/",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    2272,
    2272,
    2039,
    2039,
    1925,
    1968,
    1968,
    1925,
    1568,
    1568,
    1372,
    1372,
    1112,
    1112,
    146,
    146,
    571,
    571,
    2945,
    2945
  ],
  "sentences": [
    "In a statement, Barnes claimed that \"the only people cheering Johnson's decision are the wealthy special interests and big donors who have made a killing during his time in Washington,\" and added that Johnson \"has made clear that he's corrupt, out of touch with Wisconsinites and can't be trusted.\"",
    "Concentrating on fiscal issues early in his tenure, Johnson has recently become a lightning rod for his controversial remarks on vaccinations and the Jan. 6, 2021, insurrection.",
    "Mandela Barnes, state Treasurer Sarah Godlewski, Outagamie County Executive Tom Nelson and Alex Lasry, on leave from his executive job with the Milwaukee Bucks.",
    "U.S. Sen. Ron Johnson appears poised to announce as early as next week that he's running for reelection, according to two highly placed Republican sources.",
    "The Milwaukee Journal Sentinel has learned that in recent weeks Johnson reached out to potential staffers and advisers in preparation for the campaign.",
    "Johnson was part of a tea party wave of candidates to reach the U.S. Senate, winning the 2010 race over Democratic U.S. Sen. Russ Feingold.",
    "Six years later, Johnson won a rematch against Feingold and provided some coattails to help Donald Trump win the state and the presidency.",
    "\"I'm not ready to say anything,\" Johnson told CNN, which reported that Republicans were bullish about prospects that he would run again.",
    "Godlewski said Johnson \"has failed Wisconsinites\" by \"looking out for corporate special interests and promoting conspiracy theories.\"",
    "Johnson has drawn out his decision-making for months even as a large field of Democrats assembled to take him on in the midterms.",
    "During an interview last fall with the Journal Sentinel, Johnson said he was best positioned to retain the seat for Republicans.",
    "Paul Farrow, chairman of the Republican Party of Wisconsin, said he last spoke with Johnson about the race late last year.",
    "Johnson's impending announcement is also likely to reverberate in the Republican race for governor, where former Lt. Gov.",
    "Former U.S. Senate candidate Kevin Nicholson has said he would run for governor if Johnson opted to go for another term.",
    "I think he has a voice for the people of Wisconsin and we look forward to the decision he's going to make.\"",
    "By running, the Oshkosh Republican will be breaking a past campaign pledge to serve only two terms.",
    "\"The senator has been a stalwart for conservatives and the Republican Party,\" Farrow said.",
    "High on Johnson's to-do list: hiring a campaign manager and a general consultant.",
    "Barnes said Johnson \"has been a failure and Wisconsin voters know it.\"",
    "In 2016, they wrote him off that he wasn't going to win and he won.",
    "The party's top four candidates in the Senate primary are Lt. Gov.",
    "\"Oh, it's not just me, I think just about everybody I talk to.",
    "I mean the political pros believe that,\" Johnson said.",
    "Rebecca Kleefisch is the lone major candidate.",
    "Democrats appeared eager to take on Johnson.",
    "\"He ran as an unknown and won in 2010."
  ]
}