{
  "id": 3451,
  "mediaId": 151,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "MoveOn plows $30 million into 'Us vs. MAGA' campaign",
  "image": "https://www.politico.com/dims4/default/b7ce30a/2147483647/legacy_thumbnail/1200x848%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff8%2Fbd%2F1b092ace4a58aa6f2d781ae05386%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1354094971",
  "link": "https://www.politico.com/news/2022/05/17/moveon-30-million-maga-campaign-00032763",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1015,
    1147,
    1368,
    1951,
    2039,
    2416,
    4737,
    428,
    3423
  ],
  "sentences": [
    "Epting said tying midterm elections to out-of-power former President Donald Trump is a vital political issue: We need to come together across the political spectrum to defeat this dangerous ideology that is taking hold in the Republican Party.\nMoveOn is taking a targeted approach, making initial endorsements of a dozen candidates in statewide races and key House battles with plans to roll out more later, after primary races conclude.",
    "For us, its really being laser focused on making sure voters understand whats at stake, and just how great of a risk MAGA has become, and that its really become the base of the Republican Party.\nThe $30 million plan represents the groups largest midterm pledge yet, and is a welcome boost for Democrats in the face of large midterm investments from leading Republican groups.",
    "With the Senate majority evenly split and Democrats holding only a narrow edge in the House, Epting said MoveOn is going for depth over breadth.\nOur theory is we know we have a shot at winning, maintaining our Democratic majorities in the House and Senate, which will be hard, but its possible, she said.",
    "| Jemal Countess/Getty Images for MoveOn\nBy Burgess Everett\n 05/17/2022 04:30 AM EDT\nMoveOn is pouring $30 million into midterm battles for Congress, governorships and secretaries of state, a badly needed infusion for Democrats facing an uphill battle this fall in a tough political climate.",
    "And the group is framing the race in a very specific fashion: 2022 is about us versus MAGA, said Rahna Epting, MoveOns executive director, using the acronym for former President Donald Trumps 2016 campaign slogan that Democrats are seeking to co-opt as an insult for pro-Trump Republicans.",
    "The group is also planning to bundle $1 million each to a handful of gubernatorial candidates and secretary of state hopefuls, a reflection of the increased focus on top election officials after the still-unfolding fight against false claims of widespread fraud in the 2020 election.",
    "And in the states, MoveOn is targeting increased turnout in two main voting blocs: Surge voters who voted in 2018 and 2020 but might not normally vote in midterms and Democrats angry about the draft Supreme Court opinion and the Jan. 6 Capitol insurrection.",
    "That is indicative of just how much people understand that our democracy is at stake right now.\nMoveOn is backing two high-profile Democratic gubernatorial candidates thus far: Stacey Abrams in Georgia and Beto ORourke in Texas.",
    "Theyre also backing six battleground House members: Reps. Katie Porter and Mike Levin of California, Jahana Hayes of Connecticut, Colin Allred of Texas, Lauren Underwood of Illinois and Sharice Davids of Kansas.",
    "The progressive organization is rolling out a dozen endorsements in the coming days and pledging to spend millions in several critical swing states, according to details first shared with POLITICO.",
    "But even as it expends its most resources ever for a midterm election cycle, Epting said the group is planning to be strategic on where it deploys its money and organizing might.",
    "In Senate races, MoveOn is endorsing Mandela Barnes in Wisconsins Democratic primary to take on Sen. Ron Johnson (R-Wis.) as well as incumbent Sen. Mark Kelly (D-Ariz.).",
    "This election is a choice between all of us who believe in and want to safeguard American democracy so that it works for everyone.",
    "Instead, MoveOns approach harmonizes with President Joe Biden, who spent last week decrying the GOPs ultra MAGA turn.",
    "And the group is supporting secretary of state candidates Bee Nguyen in Georgia and Reginald Bolding in Arizona.",
    "But MoveOn isnt focusing precisely on the usual kitchen table issues that might normally dominate midterm races.",
    "MoveOn also plans to run digital, TV and radio ads to help with voter mobilization as part of its fall plans.",
    "Executive Director of MoveOn Rahna Epting listens during a talk with student activists on November 18, 2021.",
    "Our members have been really hot on the secretary of state work, Epting said.",
    "And MAGA, which represents the radical right, Epting said in an interview."
  ]
}