{
  "id": 938,
  "mediaId": 43,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "House Democrat and indicted GOP attorney general headed to runoffs",
  "image": "https://images.dailykos.com/images/1043719/story_image/GettyImages-1370192565.jpg?1646196219",
  "link": "https://www.dailykos.com/story/2022/3/2/2083320/-Morning-Digest-Anti-choice-House-Democrat-and-indicted-GOP-attorney-general-headed-to-runoffs",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    1844,
    2039,
    2298
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "However, while this will likely remain a solidly blue district after redistricting concludes, Republican state Rep. Chip LaMarca says he's thinking about running here and says he'll decide after the legislative session, which is set to conclude March 11.\n? MI-10: Sterling Heights City Councilman Henry Yanez announced Tuesday that he would seek the Democratic nomination for the open 10th District, a suburban Detroit seat that would have narrowly backed Donald Trump 50-49.",
    "House\n? FL-15: While former state Rep. Adam Hattersley showed some interest last year in making a second run for Florida's 15th Congressional District, the Democrat announced this week that he'd instead run to unseat state Chief Financial Officer Jimmy Patronis, a Republican who has many of the duties that would belong to a treasurer or comptroller in other states.",
    "With 49,000 votes counted, Cuellar held a tiny 48-47 lead on Cisnerosa margin of about 800 ballotsfollowing Tuesday's primary, while a third candidate, community organizer Tannya Benavides, took 5%enough to keep either of the two leaders from winning an outright majority and avoiding a second round.",
    "Texas Democrat Jessica Cisneros, who is challenging Rep. Henry Cuellar\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Yanez, who is a retired firefighter, previously ran for Congress in 2010 against then-Rep. Candice Miller in a safely red seat (which was also numbered the 10th District) and lost the general election 72-26, but he bounced back two years later by winning a competitive state House district.",
    "Leading Off\n? TX-28, TX-AG: The hotly anticipated rematch between Rep. Henry Cuellar, one of the most conservative Democrats in the House, and immigration attorney Jessica Cisneros, who is challenging the incumbent from the left, appears headed headed to a May 24 runoff.",
    "Vance: 14 (9)\nFormer state Treasurer Josh Mandel: 14 (15)\nFormer state party chair Jane Timken: 12 (13)\nState Sen. Matt Dolan: 8 (3)\nBusinessman Bernie Moreno, who took 11% in January, dropped out of the race in the time between the two surveys.",
    "Vance's allies at Protect Ohio Values have released a survey of the May Republican primary from Fabrizio Lee arguing that the group's recent ad buys have helped stabilize Vance in the weeks since it found his campaign in a \"precipitous decline.\"",
    "Meanwhile, Texas' scandal-plagued attorney general, Republican Ken Paxton, was also forced into a runoff after falling well short of a majority in Tuesday's primary, a battle that will pit him against state Land Commissioner George P. Bush.",
    "Young this week became the first Republican to announce a bid for the swingy 28th House District in the Des Moines suburbs, which, according to Dave's Redistricting App, would have favored Joe Biden by a tight 49.0-48.8 margin.",
    "? OK-Sen-B, OK-Sen-A: State Sen. Nathan Dahm has announced that he's ending his longshot primary challenge to Republican Sen. James Lankford and will instead compete in the special election to replace outgoing Sen. Jim Inhofe.",
    "He convincingly held on during the 2014 GOP wave and won his final term 54-46 even as Donald Trump was carrying his constituency 52-43, but he went on to lose a contested race in 2018 for a GOP-leaning state Senate district.",
    "We'll be recapping all of Tuesday's results in the next Morning Digest, though if you don't want to wait that long, join us on Wednesday at Daily Kos Elections and follow along as we provide updates in our Live Digest.",
    "Governors\n? MI-Gov: MIRS has commissioned a survey of the August Republican primary by the GOP firm Mitchell Research that finds former Detroit Police Chief James Craig leading chiropractor Garrett Soldano 32-10.",
    "? FL-22: Democratic Rep. Ted Deutch tells the South Florida Sun-Sentinel that he plans to start his new job leading the American Jewish Committee on Oct. 1, which means he'll be resigning sometime before then.",
    "? NC-13: State House Speaker Tim Moore said over the weekend that he would seek another term leading the chamber, a move that once and for all takes the Republican out of contention for Congress this cycle.",
    "? RI-02: The Rhode Island AFL-CIO, which WPRI says is the Ocean State's largest labor group, has endorsed Treasurer Seth Magaziner in the September Democratic primary for this open seat.",
    "Bynum says he will not seek the GOP nod for any office in 2022.\n? WI-Sen: Milwaukee Bucks executive Alex Lasry has released a poll from Normington Petts that shows him trailing Lt. Gov.",
    "Several fellow Democrats have already expressed interest in running to succeed him in what's currently a 57-42 Biden seat, but state Sen. Tina Polsky says she's not going to go for it.",
    "Yanez joins attorney Huwaida Arraf and Warren Council member Angela Rogensues in the August primary, while former Macomb County Judge Carl Marlinga is also considering the race.",
    "Yanez's time out of office was short, though, as he was appointed to a vacant seat on the Sterling Heights City Council months later and subsequently held it at the ballot box.",
    "Lankford's other intra-party foe, pastor Jackson Lahmeyer, has decided to keep campaigning against the incumbent, though like Dahm, he ended 2021 with little money.",
    "The memo includes numbers from unreleased surveys to argue that Lasry has dramatically shrunk what was a 43-4 deficit last August as he's gotten his name out.",
    "Jeb Bush, by a 43-23 margin, with former state Supreme Court Justice Eva Guzman taking 17% and missing out on the second slot in the May 24 runoff.",
    "? MN-01: Democrat Dan Feehan, who lost close general elections in 2018 and 2020, says that he will not compete in the Aug. 9 special election.",
    "? NC-09: State Rep. John Szoka has ended his primary campaign against Republican Rep. Richard Hudson days ahead of Friday's filing deadline.",
    ": After losing two tight congressional races, former Rep. David Young has decided that the good meal is to be found in the Iowa state House.",
    "The results also terminated Rep. Louie Gohmert's political career, as the notoriously addled congressman finished fourth with 17% as well.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The new numbers are below, with the January results in parentheses:\nBusinessman Mike Gibbons: 18 (14)\nVenture capitalist J.D.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Mandela Barnes 35-27 in the August Democratic primary, while everyone else remains mired in the single digits.",
    "The last poll we saw was a December Impact Research internal for Barnes that had him leading Lasry 40-11.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\n? OH-Sen: J.D.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Feehan's announcement came about two weeks ahead of the March 15 filing deadline.",
    "The poll was in the field Feb. 17-19 and sampled 539 likely GOP primary voters.",
    "With most votes tallied, Paxton led Bush, who is the son of former Florida Gov.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "Two Democrats are currently campaigning here.",
    "Check out our new podcast, The Downballot!",
    "(The CFO is also the state fire marshal.)",
    "This is a short blurb about Daily Kos.",
    "You may unsubscribe at any time.",
    "Grab Bag\n? Where Are They Now?",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Meanwhile, Tulsa Mayor G.T.",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Senate\n Sign up!",
    "Please read it."
  ]
}