{
  "id": 1212,
  "mediaId": 8421,
  "date": "2022-02-15",
  "headline": "Republican Club 2022 Election Year Kick-Off!",
  "image": "https://online.fliphtml5.com/jebo/sgve/files/shot.jpg",
  "link": "https://quailcreekcrossing.com/republican-club-2022-election-year-kick-off/",
  "mediaOutlet": "Quail Creek Crossing",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Furthering that objective, we had four superb Republican candidates address our attendees at the Jan. 21 meeting: Michelle Ugenti-Rita running for Arizona Secretary of State, Tiffany Shedd running for Arizona Attorney General, Juan Ciscomani running for the U.S. House representing District 6, and Mick McGuire running for the U.S. Senate.",
    "Rich Ulery, President, Quail Creek Republican Club\nThe Quail Creek Republican Club (QCRC) kicked off the 2022 election year on Friday, Jan. 21, with 100 attendees in the Ocotillo/Mesquite Room in the Kino Conference Center.",
    "President Rich Ulery, 1st Vice President Pat Colburn, 2nd Vice President Kathy Kimbrell, Secretary Steve Ware, Treasurer Pat Hendershott, Program Chair Shelley Kais, and at-large members Dave Roy and Rick Swenson.",
    "The Quail Creek Republican Club has become one of the largest and most influential Republican clubs in Southern Arizona, and many more Republican candidates will be at each QCRC monthly meeting throughout 2022.",
    "A key objective of our club in 2022 is to introduce our members to all Republican candidates running in the August primary election so that informed choices can be made.",
    "We also plan a kegger in June before the primary election and a fall Oktoberfest event prior to the November general election.",
    "Visit our website at www.quailcreekrepublicans.com and join our educational and fun club or renew your membership for 2022.",
    "Elected Membership Chair Sherry Mayer was unable to attend and will be installed at a future meeting.",
    "The 2022 club officers were installed by State Senator Michelle Ugenti-Rita.",
    "Don’t miss all the action!"
  ]
}