{
  "id": 13784,
  "mediaId": 8350,
  "date": "2022-03-15",
  "headline": "GOP tensions rise as Arizona Senate votes down more election bills",
  "image": "https://ktar.com/wp-content/uploads/2022/03/arizona-senate-chambers-interior-fbook.jpg",
  "link": "https://ktar.com/story/4950364/gop-tensions-rise-as-arizona-senate-votes-down-more-election-bills/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/ap_override/",
  "termIds": [
    0
  ],
  "sentences": [
    "Among the bills killed Monday were measures that would have created new criminal charges for a variety of missteps by election workers and contractors; created new rights for election observers, including the right to question election officials during counting; set new requirements for post-election audits and recordkeeping; required a unique serial number on each ballot.",
    "Boyer and Ugenti-Rita were highly critical of the 2020 election review conducted on behalf of GOP Senate leaders by Cyber Ninjas, a Florida-based cybersecurity firm owned by a Donald Trump supporter who has espoused false claims about the election.",
    "The review of ballots and election records in Maricopa County confirmed President Joe Biden’s victory in metro Phoenix but made a variety of allegations of irregularities that have been largely discredited.",
    "PHOENIX — The Arizona Senate voted down more election bills Monday, including many creating criminal penalties for missteps by election officials that stem from Senate Republicans’ 2020 election review.",
    "The failure of more than a half-dozen election bills came amid a tense spat between the Republicans most vocally supporting and opposing the partisan election review.",
    "It was the third time in a week that a swath of election bills died amid opposition from one or two Republicans and all Democrats, leaving them short of a majority.",
    "They also voted down a bill requiring the public posting of registered voters and images of all ballot without linking ballot images to the voters who cast them.",
    "The GOP has a narrow 16-14 majority in the 30-member Senate, so opposition from any Republican is enough to sink a bill if Democrats are united against it.",
    "Kelly Townsend of Apache Junction and Sonny Borrelli of Lake Havasu City accused critics of their bills of acting in bad faith.",
    "They did not explain their opposition to each measure but described several of them as unworkable, unnecessary or duplicative.",
    "Michelle Ugenti-Rita of Scottsdale, Paul Boyer of Glendale or both of them, in conjunction with all 14 Democrats.",
    "The bills could be revived before the end of the legislative session if opponents change their minds.",
    "Tensions rose at times Monday as proponents of the measures, including Republican Sens.",
    "Opposition from Boyer and Ugenti-Rita sank several other election bills last week.",
    "They said their bills would restore confidence in elections.",
    "Most of the bills were defeated by Republican Sens.",
    "Share\nComments"
  ]
}