{
  "id": 15922,
  "mediaId": 8476,
  "date": "2022-03-10",
  "headline": "The Daily Agenda: Election Lie Bills Get Knocked Down",
  "image": "https://media1.fdncms.com/tucsonweekly/imager/u/slideshow/32081270/vote_ballot.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/03/10/the-daily-agenda-election-lie-bills-get-knocked-down",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    0
  ],
  "sentences": [
    "@MichelleUgenti started the prayer with \"Well God, this is Michelle Ugenti-Rita\" Stay tuned we've got some exciting bills on the calendar...\n— Camryn Sanchez (@CamrynSanchezAZ) March 9, 2022\nAmong the other bad election bills Boyer shot down this week (occasionally with help from Ugenti-Rita) are:\nA Sharpiegate-inspired bill to prevent Sharpie markers from being used to fill out ballots (even though that’s the preferred method from the voting machine manufacturer)\nA bill to beef up the attorney general’s powers to investigate alleged election malfeasance, which comes as the AG is investigating the claims made in the Cyber Ninjas “audit”\nA bill to make it harder for people who move frequently to vote\nAnd a bill to force the auditor general to audit elections, though it wouldn’t pay the office nearly enough to hire the 35 new full-time employees the office says it would need to do so\nStill, saying that cooler heads “killed” those bills might be premature.",
    "The language of bills matters and means something.”\nAs we’ve written, we don’t even particularly think posting ballot images online is a bad idea — but having three different and conflicting bills to do it three different ways is emblematic of the Arizona Senate’s rush to do something, anything, all the things at once, to prove to the loudest election deniers that Republican senators take their conspiracies seriously.",
    "https://t.co/Y8EVjnAd1i\n— Laurie Roberts (@LaurieRoberts) March 9, 2022\nPlease get this sorted so we can stop being sports reporters: The baseball lockout continues, and the start of the season got pushed out again, this time to April 13 at least, as Major League Baseball owners and players remain at a standstill on contract negotiations.",
    "We hope you voted: Unofficial results for the Tempe City Council election yesterday show Arlene Chin, Jennifer Adams and Berdetta Hodge as the top three vote-getters for three open seats, though there could a runoff depending on how the final vote counts play out, the Republic’s Paulina Pineda reports.",
    "The consequences are always unintended: The Arizona Mirror’s Jeremy Duda shows how several legal changes over the past few years and pandemic delays to Census results led to the uproar over the change to PC elections made by a bill sold as a way to adjust signature requirements after redistricting.",
    "Doing what Brno won’t: The Maricopa County Attorney’s Office appears to be interested in Republicans’ efforts to overturn the 2020 presidential election, as it requested records involving communications between Stop the Steal leaders, senators and the Cyber Ninja audit team they hired.",
    "They paved paradise and put up yet another high-rise: The downtown building that used to be Phoenix Public Market (with its baller happy hour) could be demolished, along with two other nearby buildings, to make way for a high-rise, the Republic’s Joshua Bowling reports.",
    "She noted the bill would conflict with another bill still moving through the process that also deals with ballot images (both bills are from Sen. Sonny Borrelli, a superspreader of election disinformation) and argued haphazard lawmaking doesn’t result in good policy.",
    "We noted recently that all the Big-Lie-inspired election legislation that has been flying through the Senate Government Committee is coming to a head before the full Senate — and after watching the Senate votes this week, now seems like a good time to revisit that.",
    "Sen. Tyler Pace, who sponsored the bill, said he sat on a study committee about license plates, which came to the conclusion that these standards would help identify what an Arizona plate is and aid with public safety by making the numbers easier to read.",
    "Going backward in time: Criminal cases for marijuana possession by commercial vehicle drivers could give prosecutors wiggle room on filing charges despite Arizona’s legalization of adult recreational pot use, the Phoenix New Times’ David Abbott reports.",
    "— Jeremy Duda (@jeremyduda) March 10, 2022\nHoping to identify the lost: Eleven bodies were found in burial pits near the U.S.-Mexico border by volunteers whose relatives had disappeared, according to Mexican authorities, the Associated Press reports.",
    "Back in his day: Former Arizona Supreme Court Justice Stanley G. Feldman, who retired from the court in 2002, laments the current state of politics, which is filled with divisive rhetoric and a lack of respect, he told the Green Valley News.",
    "Some help on the way: A Scottsdale-based ammunition company donated 1 million rounds of ammo to Ukraine to aid in its fight against Russia, and expects its shipment to arrive in the country this week, the Republic’s Ryan Randazzo reports.",
    "Some places still get rain: Nogales is expected to get nearly $9 million from the federal government to help with persistent flash flooding, though a solution still won’t be in place for several years, the Nogales International reports.",
    "https://t.co/MpDTHf1ynL\n— Skyler Morrison (@TheSkylerMorr) March 9, 2022\nIn the op-ed pages today: Matt Salmon defends his comment about how teachers’ unions are a “scourge on society,” saying he loves teachers, but hates the unions.",
    "But more importantly, when election officials provide sloppy estimations of how many ballots are left to count, and those estimations grow over time, it gives rise to conspiracies that someone is “injecting” ballots into the system.",
    "And Tim Steller likes where the Tucson City Council is heading with the idea of sanctioned homeless camps — along with “pallet shelters” and services — until the city can come up with enough property to expand its housing programs.",
    "Mesnard’s SB1411, large counties would be required to post the number of early ballots they received in an election, and the number of early ballots they’ve tabulated each day following Election Day, starting in the 2024 election.",
    "The good news is Arizona voters can depend on Republican Sen. Paul Boyer to shoot down the worst of the worst bills that make it to the floor, no matter how many threats and hate emails he receives from angry election dead-enders.",
    "And it's hard to get things done when people act like that.”\nA small solution: A mobile farmer’s market on a bus is now coming to a part of Tempe that became a food desert after a Food City closed last year, ABC15 reports.",
    "The burnout epidemic: Like many workers during the past two years, teachers are experiencing burnout in their jobs as they weather the pandemic and the intense pushback from parents over curriculum and pandemic measures.",
    "Despite the differences in their scopes, they are related to the same efforts to undo the November 2020 election (that are continuing in many ways),” AZ Law blogger and Democratic state House candidate Paul Weich wrote.",
    "Robert Robb argues that while lawmakers shouldn’t dictate school curriculum, a bill to allow alternatives to Algebra 2 to graduate high school is cool because, really, how many of us need to know what a polynomial is?",
    "The bad news is even Republican Sen. Michelle Ugenti-Rita, who Democrats once dubbed the “queen of voter disenfranchisement,” is starting to sound reasonable and thoughtful in comparison to the rest of her caucus.",
    "Nothing is dead until the Legislature adjourns, and already, some senators have called for “reconsideration” of the bills shot down this week, giving them one last chance to twist some arms and change some votes.",
    "No bank bans: The Arizona House voted down a bill from Rep. Jake Hoffman that would’ve made it so banks couldn’t consider environmental, social justice and governance practices when calculating financial risks.",
    "If lawmakers really want to instill confidence in our voting system, as they have claimed, they should lean into common sense policies like this, and away from Dominion and Sharpie conspiracies.",
    "Neighbors say the city does little to help with the problem, and the clusters in poorer areas makes them believe wealthier ZIP codes get treated differently when they have encampments.",
    "The current case to watch is in Mohave County, where police say they can enforce federal law (which makes marijuana possession illegal) on state highways, despite state legalization.",
    ": Phoenix residents reported thousands of homeless encampments in their neighborhoods throughout the city, most often in poorer parts of town, the Republic’s Jessica Boehm reports.",
    "We’ve complained about this for a long time — without that data, it’s effectively impossible to calculate what percent of the vote a candidate needs to overcome another candidate.",
    "From the party of freedom: Parents, advocacy groups and young people are speaking out about multiple bills that limit the freedoms of trans youth, 12News’ Brahm Resnik reports.",
    "Speaking of happy hours we used to be able to afford, it costs just $8 per month to become a paid subscriber to the Arizona Agenda, the scrappiest little newsletter in town.",
    "Take Ugenti-Rita’s explanation for joining Boyer and the Democrats in shooting down Senate Bill 1119, which would require counties to post images of all ballots cast online.",
    "Unlike many of the new requirements lawmakers are attempting to heap on counties, this one actually allocates new money to carry out the task, and it fixes a real problem.",
    "Arizona’s Law tracked down a copy of a previously unreleased public records request that County Attorney Allister Adel filed last November seeking the communications.",
    "Will goes over Ducey’s time in office — including Ducey’s reaction to the audit, which the governor called a “grift-fest” — and his resistance to running for Senate.",
    "pic.twitter.com/XsSGuND8Hx\n— Mary Coleman KOLD (@Mary_reports) March 9, 2022\nAt least someone likes him: Conservative writer George Will still really like Gov.",
    "“It’s no longer just, ‘I don’t agree with you on this, and I don’t agree with you on that.’ If you don’t agree with me, you’re a liar, a thief, a this, a that.",
    "The building is 76 years old, and preservationists say the building may not be considered historic, but it’s still a vital part of the feel of the area.",
    "Bills that would ban trans girls from competing in girls’ sports and prohibit gender-affirming care for minors are still moving in the Legislature.",
    "@FannKfann wasn’t happy to hear lawmakers like Rep. Jake Hoffman criticizing legislative staffers by name yesterday over the PC bill dispute.",
    "“I would prefer if we had a more specific idea of how we want to address issues before we just put all this stuff up on the board,” she said.",
    "Editor's note: The Arizona Agenda is a Substack newsletter about Arizona government and politics run by Rachel Leingang and Hank Stephenson.",
    "Pretty much every year, lawmakers approve new license plate options, and it becomes harder and harder to identify what’s an Arizona plate.",
    "But some bills, including Republican Sen. Wendy Rogers’ bill to throw out all the Dominion voting machines, are not being watered down.",
    "It’s going to be a busy few weeks as senators negotiate provisions and water down bills before votes to avoid catching Boyer’s ire.",
    "“Calling out any staff members name from either party in committee or on the floor is unacceptable and inappropriate,” she told me.",
    "Arizona notoriously has dozens of license plate options to choose from, many of which benefit nonprofits and charity organizations.",
    "It requires background colors of license plates to contrast with the color of letters, numbers and the name Arizona on the plate.",
    "Besides those bills coming back for a vote, there’s still a whole lot of bad election ideas still coming to the Senate floor.",
    "“It’s havoc, it doesn’t yield good results, and I think last week demonstrated that this stuff has unintended consequences.",
    "Why on earth wouldn't @KateWGallego respond to @jboehm's questions about the growing problem of homelessness in Phoenix?",
    "Deer Valley teacher Matthew Laskin told KJZZ’s Lauren Gilger about how he’s managing his job, from Red for Ed to now.",
    "When nobody knows how many ballots are left to count, it creates distrust among voters and confusion for the press.",
    "I’ll be 100% honest, it was super terrifying but I’m so glad I had the opportunity to voice my opposition.",
    "For years, some lawmakers have tried to make some uniformity in Arizona’s license plates, to no avail.",
    "?This goes well beyond the scope of the later subpoenas issued by Congress' January 6th Committee.",
    "It also requires “Arizona” to be written in a sans serif font and three-fourths of an inch high.",
    "But let’s end on a good election bill that lawmakers in the Senate passed (almost unanimously!)",
    "But with the slim majorities Republicans hold in both chambers, any dissenter can stop a bill.",
    "Some teachers said the burnout will lead them to leave their jobs sooner than they expected.",
    "It's better to be rich than to be not rich ... And it's a big day for license plates.",
    "Doug Ducey and heaped more praise on him in print in the Washington Post yesterday.",
    "Senate Bill 1206 will put some guardrails in place for how our license plates look.",
    "JUST IN: The Pima County Attorney will resume charging for minor drug offenses.",
    "The House Transportation Committee gave unanimous approval yesterday as well.",
    "Notably, Phoenix Mayor Kate Gallego wouldn’t do an interview for the story.",
    "Surely people have a right to know what their mayor plans to do about it.",
    "Doug Ducey will do if Kari Lake becomes the GOP nominee to replace him.",
    "Elvia Diaz ponders what Republican Governors Association Chair Gov.",
    "You can find their archives and subscribe at arizonaagenda.com.",
    "(Remember, even a white nationalist is better than a Democrat.)",
    "Wanna help a former local kid make a documentary in Douglas?",
    "That pushes Spring Training out again, if it happens at all.",
    "— Walt Blackman for Congress (@BlackmanForAZ) March 8, 2022",
    "Who’s making these memes for Arizona Rep. Walt Blackman?",
    "None of that took place back in 1982,” Feldman said.",
    "We hope Boyer’s backbone can stand the pressure.",
    "It's primetime for moderate Republicans ...",
    "The Senate approved the bill unanimously.",
    "Or at least most Republican senators do.",
    "Rich people get better treatment?",
    "“It’s just changed completely.",
    "Under Republican Sen. J.D.",
    "Senate is in session.",
    "I can threaten you.",
    "I can harass you.",
    ": You’re in luck.",
    "this week.",
    "“?",
    "."
  ]
}