{
  "id": 3809,
  "mediaId": 8347,
  "date": "2022-01-27",
  "headline": "Senate panel OKs working poor tax credit Dems, Ducey want",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/239e410/2147483647/strip/true/crop/3600x1890+0+255/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F48%2Fca%2F70b659434ffcbc5feafac09c207c%2Fap22026794126006.jpg",
  "link": "https://www.kgun9.com/news/local-news/senate-panel-oks-working-poor-tax-credit-dems-ducey-want",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.kgun9.com/associated-press",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s something that can really help a lot of families throughout the state.”\nThe proposal didn’t sit well with Leach, who said the tax credits were a move toward the government providing basic income for everyone, an idea championed by some progressives that Bowie said he does not support.“This gets precariously close, one step closer, to guaranteed income, which is floating around again,” Leach said.",
    "“And I think we should all be concerned about that.”\nA lobbyist for the Free Enterprise Club, an advocacy group that backs limited government and lower taxes, said the proposal forces some taxpayers to subsidize others.“The Legislature should never be considering refundable tax credits,” lobbyist Amy Yentes told the panel.",
    "“If we’re able to do this ... and it’s included in the budget, that would go a long way towards getting me on the budget.”The $74 million plan is the first tax proposal the governor has backed in his eight legislative sessions that specifically aims to benefit lower-income workers.",
    "And Bowie said that money would flow right back into the economy.“It’s been a very effective measure to reduce poverty throughout the country,” Bowie told the committee, with the federal credit lifting 5.6 million Americans out of poverty.",
    "“We’ve opposed this for very large businesses, special interests industries ... and we oppose it in this form, too, as basically straight welfare.”The committee’s 7-2 vote sends the bill to the full Senate for consideration.",
    "The new proposal cuts another percent off the full assessed value that is used to assess business property such as telecommunications facilities and shopping centers.",
    "(AP Photo/Ross D. Franklin, File)\nPHOENIX (AP) — A Democratic proposal to create a new tax credit for working low-income Arizonans that Republican Gov.",
    "Tax cuts Ducey has championed, including a nearly $2 billion income tax cut passed last year, have instead mainly flowed to businesses or the wealthy.",
    "Vince Leach and Michelle Ugenti-Rita opposed the measure, a sign that the proposal could have a difficult time in the narrowly divided Legislature.",
    "The proposal from Sen. Sean Bowie, a Phoenix Democrat, did not make it out of the Finance Committee with the full support of majority Republicans.",
    "And he said its inclusion in the governor’s new spending plan could sway him to give the budget a rare Democratic vote.“I like the chances.",
    "The idea is to provide extra cash to working families who could use the money for food, utilities, gas, and other necessities.",
    "But Bowie said he’s optimistic, noting that it passed the Senate on a 26-3 vote last session before stalling in the House.",
    "Doug Ducey adopted as part of his budget proposal was approved by an Arizona Senate committee Wednesday, Jan. 26, 2022.",
    "Mesnard adds to a proposal enacted last year that phased-in rate cuts from 18% of assessed valuation to 16% in 2025.",
    "The Earned Income Tax Credit proposal mirrors the federal credit, which provides refunds to the working poor.",
    "Doug Ducey adopted as part of his budget proposal was approved by an Arizona Senate committee Wednesday.",
    "A Democratic proposal to create a new tax credit for working low-income Arizonans that Republican Gov.",
    "It sets the credit at 5% of the federal amount, and the average family would get $128 per year.",
    "Business interest groups have long argued that Arizona’s business property taxes are too high.",
    "The Senate Finance Committee also approved a property tax cut for most business property.",
    "The proposal would benefit about 577,000 taxpayers, according to the governor’s office.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "I mean, I liked the governor’s budget proposal a lot,” Bowie said.",
    "A family with three children would get more than $300 a year.",
    "Doug Ducey speaks at a ceremony on Dec. 7, 2021, in Phoenix.",
    "(Copyright 2022 The Associated Press.",
    "The cut from Republican Sen. J.D.",
    "FILE - Arizona Republican Gov.",
    "All rights reserved.",
    "GOP Sens."
  ]
}