[
  {
    "id": 1033,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "The Cook Political Report rates the race as a toss-up.?\nThe Michigan governor faces a crowded field of 11 Republican challengers, including former Detroit Police Chief <span class='selected-term'>James Craig</span>, conservative talk show host Tudor Dixon and chiropractor Garrett Soldano.",
    "author": "Julia Manchester",
    "title": "Seven most vulnerable governors facing reelection in 2022"
  },
  {
    "id": 1025,
    "mediaId": 43,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer well ahead of four potential Republican foes:\n49-39 vs. former Detroit Police Chief <span class='selected-term'>James Craig</span>\n50-33 vs. chiropractor Garrett Soldano\n50-33 vs. businessman Kevin Rinke\n50-31 vs. conservative radio host Tudor Dixon\nPolling from reliable firms has been rare here so far.",
    "author": "",
    "title": "Morning Digest: We're looking back on Harry Reid's long and storied career on the campaign trail"
  },
  {
    "id": 1026,
    "mediaId": 19,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) holds a nearly ten-point lead over her closest Republican competitor, former Detroit Police Chief <span class='selected-term'>James Craig</span>, in Michigan's 2022 race for governor, according to a poll published Tuesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer"
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) is tied with Republican gubernatorial candidate <span class='selected-term'>James Craig</span> in Michigan's race for governor, according to an internal polling memo released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "More:Gretchen Whitmer opens small lead over <span class='selected-term'>James Craig</span>, new poll of race for governor shows\nJohnson was not available for comment Thursday, Yob said.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 1005,
    "mediaId": 43,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "A dozen Republicans are seeking their party's nod, including former Detroit Police Chief <span class='selected-term'>James Craig</span>, chiropractor Garrett Soldano, businessman Kevin Rinke, and conservative radio host Tudor Dixon.",
    "author": "",
    "title": "GOP primary for Wisconsin governor"
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "But <span class='selected-term'>James Craig</span>, the former chief of Detroit police, has raised the most money from supporters and is currently seen as the front-runner in the Republican race.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy"
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Things didn't go nearly as well for former Detroit Police Chief <span class='selected-term'>James Craig</span>, who looked like the Republican frontrunner when he announced his campaign back in July.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief and Michigan gubernatorial candidate <span class='selected-term'>James Craig</span> holds a wide lead over all other Republican primary challengers, according to a poll.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals"
  },
  {
    "id": 938,
    "mediaId": 43,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: MIRS has commissioned a survey of the August Republican primary by the GOP firm Mitchell Research that finds former Detroit Police Chief <span class='selected-term'>James Craig</span> leading chiropractor Garrett Soldano 32-10.",
    "author": "",
    "title": "House Democrat and indicted GOP attorney general headed to runoffs"
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "That includes former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Norton Shores businesswoman Tudor Dixon, Ottawa County real estate agent Ryan Kelley, Oakland County pastor Ralph Rebandt, Livingston County evangelist Bob Scott, and Grand Rapids businesswoman Donna Brandenburg.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know"
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator Tudor Dixon, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businessman Perry Johnson and businessman Kevin Rinke.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Polls have consistently shown former Detroit Police Chief <span class='selected-term'>James Craig</span> leading the Republican field, but with nowhere near majority support.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is widely seen as leading the field, but former President Donald Trump has yet to weigh in on the race.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Cook Political Report shifted the race from lean D? to toss up? in December, and one recent general election poll found the governor just one point ahead of her closest opponent, former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race"
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates <span class='selected-term'>James Craig</span>, Perry Johnson, Ryan Kelley, Kevin Rinke and Garrett Soldano made the cut, according to a news release.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac"
  },
  {
    "id": 3292,
    "mediaId": 261,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Notably absent from the debate was former Detroit Police Chief <span class='selected-term'>James Craig</span>, who was once seen as the clear Republican front-runner.",
    "author": "Paul Egan",
    "title": "Higher education funding highlights divisions among GOP candidates for governor at debate"
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Based on a poll the business group conducted of support for the 10 candidates who have submitted petition signatures to get on the primary ballot, the chamber invited former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Kelley, Oakland County businessman Kevin Rinke, and Kalamazoo chiropractor Garrett Soldano to participate in the June 2 debate.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements"
  },
  {
    "id": 3455,
    "mediaId": 19,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ethan Letkeman",
    "title": "Exclusive  She Has Failed Miserably: Former Detroit Police Chief James Craig on Democrat Gov. Gretchen Whitmer"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The recommendations immediately transformed the race in the battleground state and dealt a major blow to former Detroit Police Chief <span class='selected-term'>James Craig</span>, who has led in polling despite campaign problems, and businessman Perry Johnson, who has spent millions of his own money to run.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "LANSING  Former Detroit Police Chief <span class='selected-term'>James Craig</span>, once the consensus front-runner in the Republican race for governor, has not filed enough valid signatures to make the August primary ballot, according to a report released late Monday by the Bureau of Elections.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Brown, as well as financial adviser Michael Markey, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businesswoman Donna Brandenburg and self-described quality guru Perry Johnson, all had signatures that the bureau recommended to be deemed insufficient as many were fraudulent.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race"
  }
]