[
  {
    "id": 1026,
    "mediaId": 19,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) holds a nearly ten-point lead over her closest Republican competitor, former Detroit Police Chief <span class='selected-term'>James Craig</span>, in Michigan's 2022 race for governor, according to a poll published Tuesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer"
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) is tied with Republican gubernatorial candidate <span class='selected-term'>James Craig</span> in Michigan's race for governor, according to an internal polling memo released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "More:Gretchen Whitmer opens small lead over <span class='selected-term'>James Craig</span>, new poll of race for governor shows\nJohnson was not available for comment Thursday, Yob said.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "But <span class='selected-term'>James Craig</span>, the former chief of Detroit police, has raised the most money from supporters and is currently seen as the front-runner in the Republican race.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief and Michigan gubernatorial candidate <span class='selected-term'>James Craig</span> holds a wide lead over all other Republican primary challengers, according to a poll.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals"
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator Tudor Dixon, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businessman Perry Johnson and businessman Kevin Rinke.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case"
  },
  {
    "id": 902,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> believes rooting out woke prosecutors? and woke judges? is critical to overcoming nationwide crime waves, providing his view on the matter in an interview on SiriusXM's Breitbart News Saturday.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Chief James Craig Rips Woke Prosecutors': Bad Guys Know There's No Consequences' for Crime"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Polls have consistently shown former Detroit Police Chief <span class='selected-term'>James Craig</span> leading the Republican field, but with nowhere near majority support.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is widely seen as leading the field, but former President Donald Trump has yet to weigh in on the race.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22"
  },
  {
    "id": 881,
    "mediaId": 261,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The challenges against former Detroit Police Chief <span class='selected-term'>James Craig</span>, conservative commentator Tudor Dixon and Oakland County businessman Perry Johnson could threaten their candidacies if successful.",
    "author": "Clara Hendrickson",
    "title": "Michigan GOP candidates hoping to unseat Whitmer face challenges to nominating petitions"
  },
  {
    "id": 877,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief <span class='selected-term'>James Craig</span>, businessman Perry Johnson and conservative commentator Tudor Dixon  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot"
  },
  {
    "id": 865,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "It's impossible to predict whether Karamo will defeat the incumbent Democrat Jocelyn Benson, but Michigan is usually closely divided, and Democratic Governor Gretchen Whitmer, atop the ticket, holds only a small polling lead over the GOP challenger, <span class='selected-term'>James Craig</span>.",
    "author": "David A. Graham",
    "title": "The Wackadoodle Wave"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Cook Political Report shifted the race from lean D? to toss up? in December, and one recent general election poll found the governor just one point ahead of her closest opponent, former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race"
  },
  {
    "id": 3296,
    "mediaId": 261,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "More:<span class='selected-term'>James Craig</span> splits with handlers who shielded him from media in race for Michigan governor\nBrewer has alleged a group of signature collectors used a \"round-robin\" technique to fill out each other's petitions using forged names from a list of legitimate voters.",
    "author": "Paul Egan",
    "title": "James Craig acknowledges possible fraud in signature gathering for his petition"
  },
  {
    "id": 3455,
    "mediaId": 19,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ethan Letkeman",
    "title": "Exclusive  She Has Failed Miserably: Former Detroit Police Chief James Craig on Democrat Gov. Gretchen Whitmer"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The recommendations immediately transformed the race in the battleground state and dealt a major blow to former Detroit Police Chief <span class='selected-term'>James Craig</span>, who has led in polling despite campaign problems, and businessman Perry Johnson, who has spent millions of his own money to run.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures"
  }
]