[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Whitmer is facing a cavalcade of possible Republican challengers, including former Detroit Police Chief <span class='selected-term'>James Craig</span> and conservative media personality Tudor Dixon, and her ability  or inability  to fend off her ultimate challenger will indicate how Democrats are able to rebut coronavirus-related criticism and compete in Rust Belt swing states like Michigan, Pennsylvania and Wisconsin.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022",
    "sentiment": null
  },
  {
    "id": 1033,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "The Cook Political Report rates the race as a toss-up.?\nThe Michigan governor faces a crowded field of 11 Republican challengers, including former Detroit Police Chief <span class='selected-term'>James Craig</span>, conservative talk show host Tudor Dixon and chiropractor Garrett Soldano.",
    "author": "Julia Manchester",
    "title": "Seven most vulnerable governors facing reelection in 2022",
    "sentiment": null
  },
  {
    "id": 1025,
    "mediaId": 43,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer well ahead of four potential Republican foes:\n49-39 vs. former Detroit Police Chief <span class='selected-term'>James Craig</span>\n50-33 vs. chiropractor Garrett Soldano\n50-33 vs. businessman Kevin Rinke\n50-31 vs. conservative radio host Tudor Dixon\nPolling from reliable firms has been rare here so far.",
    "author": "",
    "title": "Morning Digest: We're looking back on Harry Reid's long and storied career on the campaign trail",
    "sentiment": null
  },
  {
    "id": 1026,
    "mediaId": 19,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) holds a nearly ten-point lead over her closest Republican competitor, former Detroit Police Chief <span class='selected-term'>James Craig</span>, in Michigan's 2022 race for governor, according to a poll published Tuesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer",
    "sentiment": null
  },
  {
    "id": 1023,
    "mediaId": 43,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Thursday, Jan 13, 2022  10:36:14 AM Pacific Standard Time  David Nir\nMI-Gov: Former Detroit Police chief <span class='selected-term'>James Craig</span> has released an internal poll from ARW Strategies showing him tied at 46% with Democratic Gov.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 1/13",
    "sentiment": null
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) is tied with Republican gubernatorial candidate <span class='selected-term'>James Craig</span> in Michigan's race for governor, according to an internal polling memo released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race",
    "sentiment": null
  },
  {
    "id": 1022,
    "mediaId": 237,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Maddock, a fan of Republican gubernatorial contender <span class='selected-term'>James Craig</span>, was in the room with the retired Detroit police chief when he met Trump to pitch an endorsement.",
    "author": "David M. Drucker",
    "title": "Top GOP official in Michigan aiding Trump's bid to install loyalists in Lansing",
    "sentiment": null
  },
  {
    "id": 1021,
    "mediaId": 43,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: Former Detroit Police chief <span class='selected-term'>James Craig</span> has released an internal poll from the GOP firm ARW Strategies showing him tied at 46% with Democratic Gov.",
    "author": "",
    "title": "Morning Digest: Hedge funder launches Senate bid with backing from Trumpworld's greatest villains",
    "sentiment": null
  },
  {
    "id": 1011,
    "mediaId": 43,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer defeating one of her Republican opponents, former Detroit Police Chief <span class='selected-term'>James Craig</span>, 46-41, which is an improvement from her 45-44 edge in the firm's August survey.",
    "author": "",
    "title": "they offer a difficult landscape for Democrats",
    "sentiment": null
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "More:Gretchen Whitmer opens small lead over <span class='selected-term'>James Craig</span>, new poll of race for governor shows\nJohnson was not available for comment Thursday, Yob said.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor",
    "sentiment": null
  },
  {
    "id": 1005,
    "mediaId": 43,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "A dozen Republicans are seeking their party's nod, including former Detroit Police Chief <span class='selected-term'>James Craig</span>, chiropractor Garrett Soldano, businessman Kevin Rinke, and conservative radio host Tudor Dixon.",
    "author": "",
    "title": "GOP primary for Wisconsin governor",
    "sentiment": null
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "But <span class='selected-term'>James Craig</span>, the former chief of Detroit police, has raised the most money from supporters and is currently seen as the front-runner in the Republican race.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy",
    "sentiment": null
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Things didn't go nearly as well for former Detroit Police Chief <span class='selected-term'>James Craig</span>, who looked like the Republican frontrunner when he announced his campaign back in July.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote",
    "sentiment": null
  },
  {
    "id": 983,
    "mediaId": 43,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Deshotel instead said, It may be that I end up using the money to support other candidates who I believe can help the state.?\n Friday, Feb 11, 2022  11:56:39 AM Pacific Standard Time  Jeff Singer\nMI-Gov: Blueprint Polling, which describes itself as a sister company? to the Democratic firm Chism Strategies, is out with a survey showing Democratic incumbent Gretchen Whitmer deadlocked 44-44 with former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/11",
    "sentiment": null
  },
  {
    "id": 977,
    "mediaId": 43,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "? MI-Gov: Blueprint Polling, which describes itself as a \"sister company\" to the Democratic firm Chism Strategies, is out with a survey showing Democratic incumbent Gretchen Whitmer deadlocked 44-44 with former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "",
    "title": "Morning Digest: The 7th time was finally the charm for 'Little Tark.' Will he press his luck an 8th?",
    "sentiment": null
  },
  {
    "id": 966,
    "mediaId": 163,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "James Oliphant",
    "title": "Governors' races in 'blue wall' states carry high stakes for voting rights",
    "sentiment": null
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief and Michigan gubernatorial candidate <span class='selected-term'>James Craig</span> holds a wide lead over all other Republican primary challengers, according to a poll.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals",
    "sentiment": null
  },
  {
    "id": 938,
    "mediaId": 43,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: MIRS has commissioned a survey of the August Republican primary by the GOP firm Mitchell Research that finds former Detroit Police Chief <span class='selected-term'>James Craig</span> leading chiropractor Garrett Soldano 32-10.",
    "author": "",
    "title": "House Democrat and indicted GOP attorney general headed to runoffs",
    "sentiment": null
  },
  {
    "id": 935,
    "mediaId": 243,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "In April, Williams filed a suit in federal court in Michigan against former police chief <span class='selected-term'>James Craig</span>, the city of Detroit, and Bussa.",
    "author": "Khari Johnson",
    "title": "How Wrongful Arrests Based on AI Derailed 3 Men's Lives",
    "sentiment": null
  },
  {
    "id": 929,
    "mediaId": 19,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) is looking to defend herself against many Republican challengers, including frontrunner <span class='selected-term'>James Craig</span>, who was a strong supporter of the trucker convoys.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating Is 36 Percent, Impacting Battleground States",
    "sentiment": null
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary",
    "sentiment": null
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "That includes former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Norton Shores businesswoman Tudor Dixon, Ottawa County real estate agent Ryan Kelley, Oakland County pastor Ralph Rebandt, Livingston County evangelist Bob Scott, and Grand Rapids businesswoman Donna Brandenburg.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": null
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator Tudor Dixon, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businessman Perry Johnson and businessman Kevin Rinke.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case",
    "sentiment": null
  },
  {
    "id": 909,
    "mediaId": 136,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "The leading candidate in Michigan's Republican primary, <span class='selected-term'>James Craig</span>, seems to have reversed his allyship to the LGBTQ community, saying he'd want a \"more aggressive\" version of Florida's controversial \"Don't Say Gay\" bill.",
    "author": "Katherine Fung",
    "title": "Former LGBT Ally Wants 'More Aggressive' 'Don't Say Gay' Bill in Michigan",
    "sentiment": null
  },
  {
    "id": 902,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> believes rooting out woke prosecutors? and woke judges? is critical to overcoming nationwide crime waves, providing his view on the matter in an interview on SiriusXM's Breitbart News Saturday.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Chief James Craig Rips Woke Prosecutors': Bad Guys Know There's No Consequences' for Crime",
    "sentiment": null
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is widely seen as leading the field, but former President Donald Trump has yet to weigh in on the race.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert",
    "sentiment": null
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Polls have consistently shown former Detroit Police Chief <span class='selected-term'>James Craig</span> leading the Republican field, but with nowhere near majority support.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says",
    "sentiment": null
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": null
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": null
  },
  {
    "id": 884,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: Republican Rep. Jack Bergman, whose 1st District covers the Upper Peninsula and northernmost portion of the Lower Peninsula, has switched his endorsement in the August GOP primary from former Detroit Police Chief <span class='selected-term'>James Craig</span> to self-funding businessman Perry Johnson.",
    "author": "",
    "title": "Morning Digest: Trump's man in Georgia keeps flogging election conspiracies as his campaign craters",
    "sentiment": null
  },
  {
    "id": 881,
    "mediaId": 261,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The challenges against former Detroit Police Chief <span class='selected-term'>James Craig</span>, conservative commentator Tudor Dixon and Oakland County businessman Perry Johnson could threaten their candidacies if successful.",
    "author": "Clara Hendrickson",
    "title": "Michigan GOP candidates hoping to unseat Whitmer face challenges to nominating petitions",
    "sentiment": null
  },
  {
    "id": 877,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief <span class='selected-term'>James Craig</span>, businessman Perry Johnson and conservative commentator Tudor Dixon  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot",
    "sentiment": null
  },
  {
    "id": 868,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know.",
    "sentiment": null
  },
  {
    "id": 869,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know.",
    "sentiment": null
  },
  {
    "id": 867,
    "mediaId": 881,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Michigan Republican front-runner <span class='selected-term'>James Craig</span> has pledged to do whatever I can? to keep that law in place should he win the governorship.",
    "author": "Cameron Joseph",
    "title": "The 2022 elections could determine the fate of abortion access for years in a number of major swing states.",
    "sentiment": null
  },
  {
    "id": 865,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "It's impossible to predict whether Karamo will defeat the incumbent Democrat Jocelyn Benson, but Michigan is usually closely divided, and Democratic Governor Gretchen Whitmer, atop the ticket, holds only a small polling lead over the GOP challenger, <span class='selected-term'>James Craig</span>.",
    "author": "David A. Graham",
    "title": "The Wackadoodle Wave",
    "sentiment": null
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Cook Political Report shifted the race from lean D? to toss up? in December, and one recent general election poll found the governor just one point ahead of her closest opponent, former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race",
    "sentiment": null
  },
  {
    "id": 3296,
    "mediaId": 261,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "More:<span class='selected-term'>James Craig</span> splits with handlers who shielded him from media in race for Michigan governor\nBrewer has alleged a group of signature collectors used a \"round-robin\" technique to fill out each other's petitions using forged names from a list of legitimate voters.",
    "author": "Paul Egan",
    "title": "James Craig acknowledges possible fraud in signature gathering for his petition",
    "sentiment": null
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates <span class='selected-term'>James Craig</span>, Perry Johnson, Ryan Kelley, Kevin Rinke and Garrett Soldano made the cut, according to a news release.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac",
    "sentiment": null
  },
  {
    "id": 3292,
    "mediaId": 261,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Notably absent from the debate was former Detroit Police Chief <span class='selected-term'>James Craig</span>, who was once seen as the clear Republican front-runner.",
    "author": "Paul Egan",
    "title": "Higher education funding highlights divisions among GOP candidates for governor at debate",
    "sentiment": null
  },
  {
    "id": 3455,
    "mediaId": 19,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ethan Letkeman",
    "title": "Exclusive  She Has Failed Miserably: Former Detroit Police Chief James Craig on Democrat Gov. Gretchen Whitmer",
    "sentiment": null
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Based on a poll the business group conducted of support for the 10 candidates who have submitted petition signatures to get on the primary ballot, the chamber invited former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Kelley, Oakland County businessman Kevin Rinke, and Kalamazoo chiropractor Garrett Soldano to participate in the June 2 debate.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements",
    "sentiment": null
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The recommendations immediately transformed the race in the battleground state and dealt a major blow to former Detroit Police Chief <span class='selected-term'>James Craig</span>, who has led in polling despite campaign problems, and businessman Perry Johnson, who has spent millions of his own money to run.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": null
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Brown, as well as financial adviser Michael Markey, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businesswoman Donna Brandenburg and self-described quality guru Perry Johnson, all had signatures that the bureau recommended to be deemed insufficient as many were fraudulent.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": null
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "LANSING  Former Detroit Police Chief <span class='selected-term'>James Craig</span>, once the consensus front-runner in the Republican race for governor, has not filed enough valid signatures to make the August primary ballot, according to a report released late Monday by the Bureau of Elections.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": null
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections recommended on Monday that <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman, be excluded from the Aug. 2 primary, finding that neither candidate met the requirement of submitting signatures from at least 15,000 registered voters.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia",
    "sentiment": null
  },
  {
    "id": 8356,
    "mediaId": 261,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Those candidates are: former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman and \"quality guru\" Perry Johnson, Byron Center businesswoman Donna Brandenburg, Grand Haven financial adviser Michael Markey and Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "GOP to Board of Canvassers on petition fraud scandal: Evaluate each signature one-by-one",
    "sentiment": null
  },
  {
    "id": 8453,
    "mediaId": 25,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "Two of the top GOP contenders for Michigan governor, Perry Johnson and <span class='selected-term'>James Craig</span>, were barred from the ballot, along with three minor candidates, because they fell short of the required number of valid signatures on their nominating petitions.",
    "author": "",
    "title": "5 Republican candidates for Michigan governor barred from ballot over invalid signatures",
    "sentiment": null
  },
  {
    "id": 8441,
    "mediaId": 129,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "The five candidates, half of the party's field, were denied a spot on the Aug. 2 primary ballot by the Board of State Canvassers, including <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman.",
    "author": "",
    "title": "Republican Governors Lose Their Dread of Trump",
    "sentiment": null
  },
  {
    "id": 8438,
    "mediaId": 261,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "Those candidates are former Detroit Police Chief <span class='selected-term'>James Craig</span>, Byron Center businesswoman Donna Brandenburg, and Grand Haven financial adviser Michael Markey.",
    "author": "Paul Egan",
    "title": "Perry Johnson is 1st Michigan GOP candidate for governor to sue over ballot scandal",
    "sentiment": null
  },
  {
    "id": 8434,
    "mediaId": 19,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The deadlocked vote keeps former Detroit Police Chief <span class='selected-term'>James Craig</span> and businessman Perry Johnson off the ballot, two of the GOP's top candidates in the race to replace Democrat Gov.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Michigan Board of Canvassers Knocks Five Republican Candidates for Governor off Ballot",
    "sentiment": null
  },
  {
    "id": 8435,
    "mediaId": 157,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates <span class='selected-term'>James Craig</span> and Perry Johnson, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "author": "Igor Derysh",
    "title": "GOP election lawyer accuses Michigan Republicans of 'despicable abuse'",
    "sentiment": null
  },
  {
    "id": 8433,
    "mediaId": 169,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates <span class='selected-term'>James Craig</span> and Perry Johnson, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "author": "Igor Derysh",
    "title": "Embarrassing: Even Republicans fume at Michigan GOP for defending candidates busted for fraud",
    "sentiment": null
  },
  {
    "id": 8432,
    "mediaId": 261,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "Front-running gubernatorial candidate and former Detroit Police Chief <span class='selected-term'>James Craig</span> filed a lawsuit Saturday challenging the action of the Michigan Board of State Canvassers that took him off of the August primary ballot.",
    "author": "Paul Egan",
    "title": "Former Detroit Police Chief James Craig files lawsuit over removal from August ballot",
    "sentiment": null
  },
  {
    "id": 8671,
    "mediaId": 151,
    "date": "5/31/2022 12:00:00 AM",
    "sentence": "Former Rep. Thaddeus McCotter, remarking on the petition-forging case that caused <span class='selected-term'>James Craig</span>, Perry Johnson and other Republicans to get thrown off the gubernatorial ballot  a decision they are appealing.",
    "author": "",
    "title": "The June primaries already ballooning with big money",
    "sentiment": null
  },
  {
    "id": 8670,
    "mediaId": 157,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "Johnson had sought the decision after the Board of State Canvassers deadlocked last week along party lines on a recommendation by state election officials that he, along with former Detroit Police Chief <span class='selected-term'>James Craig</span>, Michigan State Police Capt.",
    "author": "Jon King",
    "title": "Michigan 'quality guru' Perry Johnson remains off August primary ballot after unanimous court ruling",
    "sentiment": null
  },
  {
    "id": 8668,
    "mediaId": 261,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Grand Haven financial adviser Michael Markey and Byron Center businesswoman Donna Brandenburg all failed to submit enough valid signatures to appear on the primary ballot, the Michigan Bureau of Elections concluded May 23.",
    "author": "Arpan Lobo",
    "title": "Disqualified Republican governor hopefuls battle it out in court",
    "sentiment": null
  },
  {
    "id": 8664,
    "mediaId": 261,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> and Grand Haven financial adviser Michael Markey have also filed lawsuits challenging their removal from the primary ballot.",
    "author": "Arpan Lobo",
    "title": "Michigan Court of Appeals: Perry Johnson doesn't qualify for August primary ballot",
    "sentiment": null
  },
  {
    "id": 8663,
    "mediaId": 238,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The Wednesday ruling means Johnson cannot appear on the Aug. 2 primary ballot, and it probably does not bode well for the other would-be candidates  including former Detroit police chief <span class='selected-term'>James Craig</span> and businessman Michael Markey  who had filed similar legal challenges to try to continue their campaigns.",
    "author": "Amy B Wang",
    "title": "Mich. GOP candidate ruled ineligible for ballot after fraudulent petitions",
    "sentiment": null
  },
  {
    "id": 8660,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Arpan Lobo",
    "title": "James Craig loses bid to appear on primary ballot after Michigan court denies appeal",
    "sentiment": null
  },
  {
    "id": 8659,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Five earlier candidates, including former Detroit Police Chief <span class='selected-term'>James Craig</span> and Oakland County businessman Perry Johnson, failed to submit enough valid signatures to qualify for a spot on the primary ballot.",
    "author": "Pavithra Rajesh",
    "title": "Watch live: Michigan Republican gubernatorial debate at Mackinac",
    "sentiment": null
  },
  {
    "id": 8657,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "More:<span class='selected-term'>James Craig</span> loses bid to appear on primary ballot after Michigan court denies appeal\nMore:Whitmer 'optimistic' on gun reform, but key Dem says 'full of s---' GOP won't act\nAllegations of voter fraud in Michigan\nPoliticians aligned with former President Donald Trump have consistently raised the specter of voter fraud to explain how Trump could have lost the state to Joe Biden by more than 154,000 votes in the 2020 presidential race after winning it in 2016.",
    "author": "Lou Jacobson and Clara Hendrickson",
    "title": "Kevin Rinke ad falsely claims 'dead people always vote Democrat'",
    "sentiment": null
  },
  {
    "id": 8656,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "The Court of Claims earlier Thursday rejected a request from ex-Detroit Police Chief <span class='selected-term'>James Craig</span> to accept thousands of signatures on his candidacy petition deemed invalid by the state Board of Elections.",
    "author": "Dave Boucher",
    "title": "Michigan GOP gubernatorial candidates eager for Donald Trump's endorsement",
    "sentiment": null
  },
  {
    "id": 8655,
    "mediaId": 157,
    "date": "6/3/2022 12:00:00 AM",
    "sentence": "Five candidates  financial adviser Michael Markey, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businesswoman Donna Brandenburg, self-described quality guru Perry Johnson and Michigan State Police Capt.",
    "author": "",
    "title": "Michigan GOP gov. candidates infuse debate with conspiracies about Whitmer and voting",
    "sentiment": null
  },
  {
    "id": 8962,
    "mediaId": 129,
    "date": "6/3/2022 12:00:00 AM",
    "sentence": "The two candidates  <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman  were among five Republicans in the race who were declared ineligible.",
    "author": "",
    "title": "Pennsylvania court sides with McCormick for now, ordering undated ballots to be counted.",
    "sentiment": null
  },
  {
    "id": 8958,
    "mediaId": 25,
    "date": "6/4/2022 12:00:00 AM",
    "sentence": "Detroit's former police chief, <span class='selected-term'>James Craig</span>, is in the same category.",
    "author": "",
    "title": "2 Michigan gubernatorial candidates lose final appeals and will remain off ballot after phony petition signatures",
    "sentiment": null
  },
  {
    "id": 8976,
    "mediaId": 129,
    "date": "6/4/2022 12:00:00 AM",
    "sentence": "The candidates  <span class='selected-term'>James Craig</span>, Perry Johnson and Michael J. Markey Jr.  did not meet the total number of signatures necessary to qualify for the ballot after thousands of the signatures on their nominating petitions were found to be fraudulent, though officials said there was no evidence the candidates had knowledge of the widespread cheating effort.",
    "author": "",
    "title": "Three G.O.P. candidates for Michigan governor will stay off the ballot, the state's Supreme Court rules.",
    "sentiment": null
  },
  {
    "id": 8975,
    "mediaId": 261,
    "date": "6/4/2022 12:00:00 AM",
    "sentence": "The board's impasse sparked a frenzy of lawsuits from disqualified gubernatorial candidates, including two of the top-polling Republicans in the race: former Detroit Police Chief <span class='selected-term'>James Craig</span> and Oakland County businessman and self-described \"quality guru\" Perry Johnson.",
    "author": "Dave Boucher",
    "title": "Procedural step squashed 5 Republican campaigns for Michigan's next governor",
    "sentiment": null
  },
  {
    "id": 8974,
    "mediaId": 151,
    "date": "6/4/2022 12:00:00 AM",
    "sentence": "CHAOS FOR THE MICHIGAN GOP: The Michigan Supreme Court sent frontrunner <span class='selected-term'>JAMES CRAIG</span> and other Republican gubernatorial candidates packing Friday, refusing to reinstate them on the primary ballot over fraudulent signatures on their nominating petitions.",
    "author": "",
    "title": "POLITICO Playbook: Yellen admits Biden got inflation wrong",
    "sentiment": null
  },
  {
    "id": 8972,
    "mediaId": 21,
    "date": "6/4/2022 12:00:00 AM",
    "sentence": "The candidates who will remain off the ballot include former Detroit police chief <span class='selected-term'>James Craig</span>  who for months had been seen as a frontrunner in the race  along with businessmen Perry Johnson and Michael Markey Jr.",
    "author": "John L. Dorman",
    "title": "Michigan Supreme Court blocks three GOP gubernatorial candidates from ballot over forged petition signatures",
    "sentiment": null
  },
  {
    "id": 8968,
    "mediaId": 157,
    "date": "6/6/2022 12:00:00 AM",
    "sentence": "The announcement came just days after the state's Bureau of Elections and Board of Canvassers disqualified five of the 10 Republicans running for governor, including frontrunners <span class='selected-term'>James Craig</span> and Perry Johnson, after discovering that thousands of the signatures on the petitions they circulated to qualify for the ballot were fraudulent.",
    "author": "Igor Derysh",
    "title": "Michigan's GOP push to fight fake 'voter fraud' gets upended by actual fraud",
    "sentiment": null
  },
  {
    "id": 8969,
    "mediaId": 157,
    "date": "6/6/2022 12:00:00 AM",
    "sentence": "Despite a Michigan Supreme Court decision that kept Republican <span class='selected-term'>James Craig</span> off of the August primary ballot, the former Detroit police chief says he is evaluating next steps in a bid to stay in the gubernatorial race.",
    "author": "Jon King",
    "title": "Michigan Republican on getting booted from ballot over fraudulent signatures: Not going to let this go'",
    "sentiment": null
  },
  {
    "id": 8967,
    "mediaId": 169,
    "date": "6/6/2022 12:00:00 AM",
    "sentence": "The announcement came just days after the state's Bureau of Elections and Board of Canvassers disqualified five of the 10 Republicans running for governor, including frontrunners <span class='selected-term'>James Craig</span> and Perry Johnson, after discovering that thousands of the signatures on the petitions they circulated to qualify for the ballot were fraudulent.",
    "author": "Igor Derysh",
    "title": "Michigan's GOP push to fight fake \"voter fraud\" gets upended by actual fraud",
    "sentiment": null
  },
  {
    "id": 8964,
    "mediaId": 261,
    "date": "6/6/2022 12:00:00 AM",
    "sentence": "Along with Johnson, the Bureau of Elections found issues with signatures submitted by former Detroit Police Chief <span class='selected-term'>James Craig</span>, Grand Haven financial adviser Michael Markey, Byron Center businesswoman Donna Brandenburg and Michigan State Police Capt.",
    "author": "Arpan Lobo",
    "title": "Perry Johnson files lawsuit in federal court to get on GOP primary ballot for governor",
    "sentiment": null
  }
]