[
  {
    "id": 17048,
    "mediaId": 8345,
    "date": "2022-02-26",
    "sentence": "PHOENIX – A judge this week declined Secretary of State <span class='selected-term'>Katie Hobbs</span>' request for an order blocking Arizona's attorney general from prosecuting her if she temporarily shuts down a candidate signature portal for a required update.",
    "author": "Associated Press",
    "title": "Arizona judge declines Katie Hobbs’ request to block Brnovich threats"
  },
  {
    "id": 15344,
    "mediaId": 8260,
    "date": "2022-03-13",
    "sentence": "I think that is part of the reason why she is able to work with others on the other side of the aisle because she doesn’t burn the bridges that way.”\nDesai has been a critical part of the legal teams that defended the Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, and the Arizona Democratic Party in multiple cases that all were unsuccessful in reversing the election.",
    "author": "",
    "title": "‘I don’t have a lot of fear about speaking truth to power’: Roopali Desai honored by USA TODAY"
  },
  {
    "id": 11173,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "The lawsuit names as defendants both the state and Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat running for governor.",
    "author": "Amy Sherman",
    "title": "Voting by mail has been popular in Arizona for decades. Now the state GOP wants to ban it"
  },
  {
    "id": 8560,
    "mediaId": 2631,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona Supreme Court rejects GOP request to invalidate mail voting"
  },
  {
    "id": 8542,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "\"Today, the Arizona Supreme Court dismissed a dangerous lawsuit that threatened early voting in the state and challenged provisions of the Elections Procedures Manual,\" tweeted <span class='selected-term'>Katie Hobbs</span>, Arizona's Democratic secretary of state.",
    "author": "Jon Skolnik",
    "title": "GOP-led Arizona Supreme Court shuts down Republican bid to ban early voting"
  },
  {
    "id": 8422,
    "mediaId": 2888,
    "date": "2022-04-06",
    "sentence": "Earlier this week, Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the lawsuit, condemned the state GOP’s attempt to eradicate mail-in voting.",
    "author": "Chris Walker",
    "title": "Arizona Supreme Court Rejects State GOP Lawsuit to Eliminate Mail-In Voting"
  },
  {
    "id": 7052,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.pic.twitter.com/awWo5A6PF3\n— Secretary <span class='selected-term'>Katie Hobbs</span> (@Secretary Katie Hobbs) 1649203544\nHobbs is currently seeking the Democratic gubernatorial nomination.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 8818,
    "mediaId": 2629,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Chibueze Godwin",
    "title": "Arizona Supreme Court Rejects GOP Move To Abolish Mail Voting"
  },
  {
    "id": 6047,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  }
]