[
  {
    "id": 9269,
    "mediaId": 2618,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Morgan Phillips",
    "title": "Biden tears into 'political attacks' on transgender children: Slams bills stopping them getting puberty blockers, stopping biological boys playing sport against girls and Florida's 'Don't Say Gay Bill' for 'damaging mental health'"
  },
  {
    "id": 9440,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "author": "Jake Lambert",
    "title": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000"
  },
  {
    "id": 9988,
    "mediaId": 8345,
    "date": "2022-03-31",
    "sentence": "Ducey's signing letter was sent to Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, an abortion rights supporter who is seeking her party's nomination in November's election to replace Ducey, who is term-limited.",
    "author": "",
    "title": "Arizona Gov. Doug Ducey signs bills limiting abortion, trans rights"
  },
  {
    "id": 10282,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "The reason is simple, and common sense – this is a decision that will dramatically affect the rest of an individual’s life, including the ability of that individual to become a biological parent later in life,” Ducey wrote in a letter to Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Madeline Leesman",
    "title": "Arizona Gov. Ducey Signs Bills Limiting Abortion and Protecting Women’s Sports"
  },
  {
    "id": 7714,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "Source: AP Photo/Silvia Izquierdo\nArizona secretary of state and gubernatorial candidate <span class='selected-term'>Katie Hobbs</span> (D) appeared in an interview this week where she would not answer questions regarding limits on abortion.",
    "author": "Madeline Leesman",
    "title": "Democratic Arizona Gubernatorial Candidate Will Not Say If She Supports Limits on Abortion"
  },
  {
    "id": 4703,
    "mediaId": 8475,
    "date": "2022-04-19",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> became the face of Democratic opposition to GOP efforts to question the election during the partisan election “audit” in 2021, appearing regularly on national news shows where she criticized the state Senate’s review of Maricopa County’s election.",
    "author": "Jim Small",
    "title": "Election lies boost the bottom lines of prominent Arizona Republican candidates"
  }
]