[
  {
    "id": 3657,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "Jordan Conradson",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 4263,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 12855,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 9100,
    "mediaId": 2578,
    "date": "2022-03-19",
    "sentence": "The Gateway Pundit recently reported that the Arizona Attorney General Mark Brnovich rejected <span class='selected-term'>Katie Hobbs</span>’ proposed 2022 Elections Procedures Manual after she failed to correct the outlined law violations.",
    "author": "Jordan Conradson",
    "title": "Soros-Backed Secretary of State Katie Hobbs Violates Arizona State Election Law by Shutting Down Election Petition System for Certain Candidates"
  },
  {
    "id": 7145,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nDue to Katie Hobbs’ deliberate malfeasance, candidates now struggle to meet the signature requirement before the Monday, April 4th deadline.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  }
]