[
  {
    "id": 3627,
    "mediaId": 8475,
    "date": "2022-01-17",
    "sentence": "Steve Gaynor and Karrin Taylor Robson are sitting on millions for their gubernatorial campaigns as they prepare to hit the airwaves, while <span class='selected-term'>Katie Hobbs</span> and Kari Lake offset strong fundraising numbers with big spending.",
    "author": "Jeremy Duda",
    "title": "As first campaign finance reports are filed, Arizona governor’s race comes into focus"
  },
  {
    "id": 1824,
    "mediaId": 8326,
    "date": "2022-02-08",
    "sentence": "Earlier on Monday, one of his rival candidates, former Arizona National Guard leader Mick McGuire, called on Brnovich to release records from the State Bar’s investigation of the complaints filed by Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents.",
    "author": "Laurie Roberts",
    "title": "AG Mark Brnovich wants to send troops to the border (and himself to the Senate)"
  },
  {
    "id": 1197,
    "mediaId": 2520,
    "date": "2022-02-13",
    "sentence": "Karrin Taylor Robson and Aaron Lieberman offer vague references to water on their websites, while Matt Salmon, <span class='selected-term'>Katie Hobbs</span> and Marco Lopez don’t mention it.",
    "author": "Joanna Allhands",
    "title": "What should Arizona governor and legislative candidates be saying about water?"
  },
  {
    "id": 980,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "They also aroused suspicion by making out-of-place comments critical of Lake and supportive of Democratic gubernatorial frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jeremy Duda",
    "title": "Leftist Arizona State student groups allege infiltration by Kari Lake campaign staffers"
  },
  {
    "id": 100,
    "mediaId": 8475,
    "date": "2022-02-21",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democratic frontrunner, called on the Senate to raise the limit and save K-12 schools from \"this manufactured funding crisis.\"",
    "author": "Jeremy Duda",
    "title": "No Republican candidates for Arizona governor are calling for school cuts to be stopped"
  },
  {
    "id": 718,
    "mediaId": 8428,
    "date": "2022-02-22",
    "sentence": "Republican Kari Lake, a former news anchor, is the only candidate who can defeat Democrat <span class='selected-term'>Katie Hobbs</span> in Arizona’s gubernatorial race this November, a new poll found.",
    "author": "Alex Caldwell",
    "title": "Kari Lake is the only Republican AHEAD of Dem. Katie Hobbs in Arizona governor’s race, new poll finds"
  },
  {
    "id": 282,
    "mediaId": 2520,
    "date": "2022-02-24",
    "sentence": "Karrin Taylor Robson, the other major GOP candidate for governor, and Democrat <span class='selected-term'>Katie Hobbs</span> have thus far been silent, which might have been a good strategy for Lake.",
    "author": "Laurie Roberts",
    "title": "No, Kari Lake, what is going on at the border isn't remotely like what is going on in Ukraine"
  },
  {
    "id": 12682,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat <span class='selected-term'>Katie Hobbs</span>, Kari Lake is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 12855,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 11474,
    "mediaId": 8428,
    "date": "2022-03-17",
    "sentence": "A recent survey showed that Lake, a former news anchor, is the only Republican candidate expected to be able to defeat Secretary of State <span class='selected-term'>Katie Hobbs</span>, D-Ariz., in this crucial gubernatorial race.",
    "author": "Timothy Frudd",
    "title": "Kari Lake easily qualifies for the August primary"
  },
  {
    "id": 11413,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "Lake is one of many Republicans running in Arizona’s Aug. 2 Republican primary, while the best known Democrat running is Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Amy Sherman",
    "title": "Jan. 6 defendants “are being held in prison without being charged.”"
  },
  {
    "id": 7529,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent <span class='selected-term'>Katie Hobbs</span> in the dust.",
    "author": "Summer Lane",
    "title": "Trump holds fundraiser for Kari Lake at Mar-a-Lago"
  },
  {
    "id": 5681,
    "mediaId": 2528,
    "date": "2022-04-12",
    "sentence": "She is the only Republican in the race more popular than Democratic candidate <span class='selected-term'>Katie Hobbs</span> — Arizona's current secretary of state.",
    "author": "Matthew Loh",
    "title": "Trump-endorsed Arizona gubernatorial candidate Kari Lake says she would fine airlines $1,000 for making passengers wear masks"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 4931,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The defendants are Lake’s Democrat opponent in the gubernatorial race <span class='selected-term'>Katie Hobbs</span>, the Maricopa County Board of Supervisors, and the Pima County Board of Supervisors.",
    "author": "Summer Lane",
    "title": "Kari Lake files injunction to STOP voting machines in Arizona"
  }
]