[
  {
    "id": 1856,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Brnovich announced Friday he had reached agreements with the State Bar of Arizona, which licenses and regulates attorneys, stemming from two ethics complaints filed against him and attorney general lawyers by Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat vying for her party’s gubernatorial nomination, and the Arizona Board of Regents.",
    "author": "Yvonne Wingett Sanchez",
    "title": "McGuire calls on Brnovich to release records related Bar complaints"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 6047,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 5511,
    "mediaId": 2680,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 5125,
    "mediaId": 2548,
    "date": "2022-04-22",
    "sentence": "She doesn’t care about working-class people.”\nListen to that and much more in this week’s unmissable Deep Dive podcast interview: https://t.co/Bw5mBA7LkA\n— POLITICO Playbook (@playbookdc) April 22, 2022\nGallego went on to accuse Sinema of not caring about other Democrats or her constituents, as evidenced by her lack of appearances on the campaign trail for Kelly or gubernatorial candidate <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael Ginsberg",
    "title": "Rep. Ruben Gallego Trashes Sen. Sinema, Says ‘She’s All About Herself’"
  },
  {
    "id": 4702,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "PHOENIX — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "",
    "title": "Brnovich sues Secretary of State in dispute over election procedures"
  }
]