[
  {
    "id": 3627,
    "mediaId": 8475,
    "date": "2022-01-17",
    "sentence": "Steve Gaynor and Karrin Taylor Robson are sitting on millions for their gubernatorial campaigns as they prepare to hit the airwaves, while <span class='selected-term'>Katie Hobbs</span> and Kari Lake offset strong fundraising numbers with big spending.",
    "author": "Jeremy Duda",
    "title": "As first campaign finance reports are filed, Arizona governor’s race comes into focus"
  },
  {
    "id": 3729,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> will be breaking the law if she shuts down the system that allows congressional and legislative candidates to collect signatures online so they can qualify for the ballot, the Attorney General’s Office warned Tuesday.",
    "author": "Jeremy Duda",
    "title": "Arizona AG’s Office: Hobbs can’t legally shut down online signature portal"
  },
  {
    "id": 3688,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "Once she receives the maps, Secretary of State <span class='selected-term'>Katie Hobbs</span> will send them to the counties so election officials can update their voter registration information to incorporate the new districts.",
    "author": "Jeremy Duda",
    "title": "Arizona Redistricting Commission gives final certification to new election maps"
  },
  {
    "id": 646,
    "mediaId": 8475,
    "date": "2022-02-24",
    "sentence": "An attorney for Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> urged a judge Wednesday to stop state Attorney General Mark Brnovich from pursuing a criminal action against her for planning to take a candidate signature-gathering system offline for maintenance.",
    "author": "Michael McDaniel",
    "title": "Arizona secretary of state urges judge to halt AG prosecution threat over election system maintenance"
  },
  {
    "id": 17324,
    "mediaId": 2745,
    "date": "2022-03-03",
    "sentence": "She is now general counsel for the Arizona secretary of state, Democrat <span class='selected-term'>Katie Hobbs</span>.",
    "author": "",
    "title": "Opinion Arizona Republicans keep churning out new election legislation targeting voting access"
  },
  {
    "id": 17172,
    "mediaId": 8475,
    "date": "2022-03-04",
    "sentence": "Democratic gubernatorial frontrunner <span class='selected-term'>Katie Hobbs</span> is calling for a handful of new tax credits and sales tax exemptions aimed at helping working families, including child care assistance and a state-level version of a recently expired federal child tax credit.",
    "author": "Jeremy Duda",
    "title": "Hobbs: Arizona should have state child tax credit, more help for working families"
  },
  {
    "id": 15347,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "\"As governor, I would not only veto this extremist bill, I would also trust Arizona women to make health care decisions alongside doctors, not politicians,\" said Democratic gubernatorial candidate and current Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael McDaniel",
    "title": "Transgender and abortion bills highlight growing division of Arizona lawmakers"
  },
  {
    "id": 10017,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "Well, to hear Ducey say it in a letter he sent to Secretary of State <span class='selected-term'>Katie Hobbs</span> on signing the measure: \"The reason is simple and common sense — this is a decision that will dramatically affect the rest of an individual's life, including the ability of that individual to become a biological parent later in life.\"",
    "author": "Blake Morlock",
    "title": "Time of the season for hatred: Transgender kids are in Arizona's legislative crosshairs"
  }
]