[
  {
    "id": 2797,
    "mediaId": 2578,
    "date": "2022-02-03",
    "sentence": "Unfortunately, it is likely that Arizona won’t get out of using ERIC as long as the current Secretary of State, <span class='selected-term'>Katie Hobbs</span>, is in office.",
    "author": "Joe Hoft",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 1647,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "AZGOP Chairwoman Dr. Kelli Ward urges patriots to get involved and notify her if they aren’t accepted by radical leftist Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "Here’s an Opportunity to Participate: Arizona Secretary of State And Maricopa County HIRING NOW – Walk-In Interviews Tomorrow"
  },
  {
    "id": 15290,
    "mediaId": 2662,
    "date": "2022-03-07",
    "sentence": "We were told that the Party supported the bill, which has proven to be false and that this was intended to fix the utter mess <span class='selected-term'>Katie Hobbs</span> has made of our election procedures for 2022.",
    "author": "Jordan Conradson",
    "title": "UPDATE: Arizona Republicans Look To Repeal Language In Bill Changing Precinct Committeemen Election Rules"
  },
  {
    "id": 9135,
    "mediaId": 2662,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General Mark Brnovich delegated his powers to enforce criminal action against crooked <span class='selected-term'>Katie Hobbs</span> for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "Jordan Conradson",
    "title": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes"
  },
  {
    "id": 8588,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "In a letter to Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, Ducey explained that this type of surgery is irreversible and has a lasting impact on a person’s life.",
    "author": "Madeline Leesman",
    "title": "GOP Rep Says People Should Hit a Certain Age Before Making ‘Life-Altering’ Decisions About Gender Identity"
  }
]